{"Reviews": [{"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Gaeta, Italy", "Title": "“Great Hotel!”", "Author": "GeminiR_S", "ReviewID": "UR125881739", "Content": "We stayed here 4 nights Mar 4-8, 2012. We asked for a balcony room, but instead we got one of their larger rooms, which was just fine. We found the room to be very comfortable, cleaned every day. Linens and bath towels were excellent quality. The Staff was very, very helpful and gave us excellent dinner recommendations every night - all within a couple blocks. Metro right around the corner. Breakfast was beautiful: pastries, cereal and milk, yogurt, fresh fruit, juice, American coffee, expresso and cappichino. Nice spacious dining room. The elevator is small, but typical European lift - no problems. We enjoyed our stay immensely, and would stay there again. Thanks for a wonderful visit!", "Date": "March 10, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Location": "4", "Rooms": "3"}, "AuthorLocation": "", "Title": "“Budget hotel”", "Author": "RZleb", "ReviewID": "UR125712854", "Content": "Good location, walking distance from Vatican city and next to a metro stop. Good value for monney. Clean hotel. Rooms are small but the overall is good.", "Date": "March 6, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Location": "5", "Rooms": "4"}, "AuthorLocation": "", "Title": "“A fresly renovated small hotel”", "Author": "Thanop", "ReviewID": "UR125608795", "Content": "It is a small hotel that is just renovated. Everything looks and feels new . Rooms look very pretty but they are small . Breakfast is great with excellent cappuccino ! Good value for money for 60-80 euros per night . Great location . The only thing that still needs renovation is the thin reception guy. A family owned hotel.", "Date": "March 4, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Lake Placid, New York", "Title": "“Hotel Gerber is a gem in a great location.”", "Author": "RAR214", "ReviewID": "UR125126087", "Content": "Our daughter was studying in Rome and living in the Prati section of the city not far from the Vatican. We were visiting for 12 days and wanted to find a hotel near her for part of that time. We booked Hotel Gerber because it was conveniently located just around the corner from her. We were pleasantly surprised with wonderfully helpful staff, spacious and immaculate rooms, terrific breakfast and a perfect location on a quiet side street. The hotel is one block from bus and metro stations that can take you anywhere in the city for one euro. We did a few overnights in Venice and Florence, and Hotel Gerber accommodated us by storing our large luggage while we were checked out! I can't say enough about how much staying at Hotel Gerber enhanced our first trip to Rome.", "Date": "February 24, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "gloucestershire", "Title": "“great little hotel”", "Author": "boogle1", "ReviewID": "UR124581037", "Content": "A lovely little hotel. Staff were very helpful and courteous, the breakfast was good and the rooms were very nice, clean and very adequate. The hotel is situated within easy walking distance of main attractions.", "Date": "February 14, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "La Crosse, Wisconsin, United States", "Title": "“An excellent place to stay”", "Author": "Diane582", "ReviewID": "UR122567296", "Content": "I was surprised to see any negative reviews. The Hotel Gerber is a top notch hotel with a great staff and location. We stayed there 8 nights from Dec. 26 to Jan. 2rd. Check in was smooth and painless, and they had our room ready for us. We were on the top floor, with a balcony and access to a terrace with a table and 4 chairs. To begin your day, a breakfast consisting of a couple different kinds of bread, croissants, fresh fruit, three different types of juice, ham, sausage, cheese, cereal, and other assorted items on the breakfast table. The person running the breakfast, seeing to our every need, was Romeo. He is a friendly, well spoken person who loves to serve. We looked forward to seeing him every morning. Our room was cleaned daily and never felt dirty. There was ample space for the 4 of us, and beds were very comfortable. We were so busy, though, we never did check out the TV to any extent. It was turned on for 5 minutes one day. The staff always greeted us and acknowledged us, we felt like valued customers to them. Location is great - a short 1.5 block walk to the metro got us to whereever we wanted to go. We would typically walk to where we were going, then take the metro back. Exploring Rome on foot is something I would recommend to anyone able to do this. It as a short 15-20 miute walk to St. Peter's, the Vatican, and other places of interested. Our longest walk consisted of an hour walk to the Colosseum, with detours to the Spanish steps and Trevi Fountain. New Years eve we were suprised to see two small bottls of champagne in our room, with 4 wine glasses. It was very nice to be treated like this. Our checkout, even though it was 3:00 AM, was smooth and effecient. They called a taxi to take us to the airport, and it picked us up in less than 5 minutes. Peter runs a great, friendly hotel that has a wonderful staff, outstanding location, and everything you could ask for in a hotel. They will treat you right!", "Date": "January 5, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Location": "4", "Rooms": "4"}, "AuthorLocation": "Perth, Australia", "Title": "“Convenient location, clean and comfortable rooms and friendly staff.”", "Author": "moroz", "ReviewID": "UR120901166", "Content": "Hotel Gerber is small and family owned/run. All the staff were very helpful and welcoming - even the window cleaner greeted us in perfect English. They don't, however, help with cases up the 5 or 6 steps from the lobby to the stairs and lift. Also, the lift is tiny so a couple with large cases must take the lift one at a time. The stairs are narrow and uneven, so not suitable for everyone. Rooms and bathrooms are clean and modern and the buffet breakfast was substantial. We stayed here twice and would certainly stay here again.", "Date": "November 22, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "malaysia", "Title": "“HOTEL GERBER”", "Author": "JohnsonArokiasamy", "ReviewID": "UR120691100", "Content": "It is a very good Hotel, the Manager Mr. Peter really taking care of the customers. He also very good, humble and polite. I always choose this hotel because they are very good and help full and the price also very reasonable. It is good place and located in the heart of City nearest to all Historical place Rome, Italy. BEST TO LIVE.", "Date": "November 17, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Sacramento, California", "Title": "“Comfortable and clean!”", "Author": "KathyfromSacramento", "ReviewID": "UR117565739", "Content": "We stayed in a triple room -- myself, my husband and our college-age son. The room had an enclosed balcony, that gave us a nice amount of extra space --enough to feel like we weren't crowded at all. The hotel staff was very helpful with directions and restaurant recommendations. Also, the breakfast was very nice. The hotel is close to the Metro and in a quiet area.", "Date": "September 1, 2011"}, {"Ratings": {"Cleanliness": "3", "Sleep Quality": "2", "Overall": "2.0", "Value": "2", "Service": "2"}, "AuthorLocation": "Milan, Italy", "Title": "“No iron”", "Author": "MattPrice77", "ReviewID": "UR116197868", "Content": "Some nicer rooms and some bad rooms here. Room 4 on the ground floor was a bad one. The bathroom was cramped and the toilet seat moved around. The bedroom was noisy. I could hear the hum of the AC units outside and it sounded like the people in the next room were coming through the wall when they took a shower. A tip for those considering staying here for a business trip: iron your shirt before you arrive and try not to crease it in your suitcase. They do not permit you to iron in the room. The chamber maid can do it apparantly but shes always too busy.", "Date": "August 3, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Foshan, China", "Title": "“Great location, would stay again”", "Author": "bookowl1000", "ReviewID": "UR115610097", "Content": "I got a single room for about 65 euros a night, which is very cheap by Rome standards so I did not have very high expectations especially as this price included breakfast. I was pleasantly surprised and very much enjoyed my 5 night stay. I had a single room with a shared bathroom. This was not a problem at all. I had a sink and hairdryer n my room and the toilet/ shower room was very close by - if there was ever anyone else using it I never saw a trace of them. Everywhere was clean and comfortable, and the communal areas were relaxing places to be. The room had air conditioning, sky tv with news channels in multiple languages and pay per view movie channels. There was a balcony with table and chairs and for a charge of 1.50 euros you could have your breakfast delivered to your room. Breakfast was served downstairs between 7am and 9.30am: continental style with lots of variety and tasty food. You could stock up and not need lunch if that is what you wanted. Free wifi and a computer in one of the two downstairs lounges that you could use for 1 euro per half hour. Staff were always polite, attentive and willing to be of assistance. There was one old fashioned, cage style lift that I found very cute. I found the location to be very convenient. Metro station 2 min walk away - fare of 1 euro for any single stop. It is 15-20 min walk from the Vatican, and except one occasion when I got the metro to the colosseum I walked everywhere. I felt safe walking in the neighbourhood after dark - it is a middle class area away from the city centre and the hoards of tourists, on a side street with little passing traffic but still within 5 mins there were still many bars and eating establishments. The fact that there core customers were locals meant the food was cheaper and of a higher quality than anything I had in the centre of Rome. You really must try the pizza place and ice cream parlour just around the corner from the hotel - I went there because of a recommendation in The Rough Guide to Rome and was not disappointed. If ever I went to Rome again I would definitely be looking up availability here before looking anywhere else.", "Date": "July 21, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Shoreline, Washington", "Title": "“Soothing Location in Metro area”", "Author": "Fredzie", "ReviewID": "UR111389014", "Content": "Delighted to report that based on my dear friends recommendation, we stayed at the Hotel Gerber in Rome for a \"trip of a lifetime\" girl's getaway! We were within easy walking distance to all of the locations on our \"must visit\" list and we put in very aggressive walking routes. At the end of the day, it was a true pleasure to look forward to returning to our very clean, and quiet room. The reservation included a breakfast, served downstairs - a great way to start the day. The staff were all very welcoming. This is one American who can truthfully say that my life has been enriched by my visit to Rome, its fabulous history and cuisine and the soothing rest that me and my BF (best friend) enjoyed at the Hotel Gerber!", "Date": "June 4, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "3", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Brasília", "Title": "“Great location, familiar and good service, but a little disappointing.”", "Author": "FelipeRocha", "ReviewID": "UR82878655", "Content": "My wife and I got a little disappointed with this hotel, since it had been highly recommended on several sites on the Internet. The negatives: bath water leaking through the floor; the bathroom cleaning was poor; they didn’t exchange the bedding; the breakfast was simple (but not bad) and the worst, for two times they opened the room door to clean it while we were there (once we were sleeping and the other time we were packing up our thing to leave to a tour). But there are also positives: the hotel staff were very attentive; the room is modern and well equipped; air-conditioning is great and essential in the summer; the location is very good (just one block from the subway, close to restaurants and shopping and just behind the Vatican) and free high speed internet is great. Despite the negatives, I would recomend and stay there again.", "Date": "October 10, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Atlanta, Georgia", "Title": "“Great location, clean, friendly, abundant breakfast.”", "Author": "Gardener77", "ReviewID": "UR68376326", "Content": "The best thing about the Gerber was the location. Halfway between the Vatican and the People's Plaza (Piazza del Popolo), it was perfectly located. If you like to walk you can get to all the sights on foot within 10 to 20 minutes. We walked everywhere! The room was spotless, the bed comfortable, the staff helpful, and breakfast was abundant and varied. The only observation we have (that was not really a problem for us) is that our bathroom was tiny, especially the shower. I could not help but thank my lucky stars that my husband and I are not overweight. If we had been just 10 lbs heavier we could not have gotten in and out of the shower. It is perfect for the sleek and thin but larger Americans beware!", "Date": "June 22, 2010"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "Salt Lake City, Utah", "Title": "“Very Friendly & Personal Service”", "Author": "hospexp", "ReviewID": "UR65043483", "Content": "The Gerber Hotel is located close to Vatican City and the Center City. Easy walking distance to many historic attractions and great restaurants. The staff will help you with your Italian and most speak English. The accommodations are impeccable and service is terrific. Great complimentary buffet in the morning.", "Date": "May 23, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Brussels", "Title": "“Excellent for quiet location near Vatican”", "Author": "viaggiatore41", "ReviewID": "UR63558220", "Content": "I stay here almost allways when I am in Rome. The location is quiet, a bit out of the center, but very near Vatican City and metro and bus stops. Very clean rooms, nice staff and a very good price/quality relation.", "Date": "May 8, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "2", "Overall": "1.0", "Value": "1", "Location": "2", "Rooms": "1"}, "AuthorLocation": "germany", "Title": "“Never never stay here”", "Author": "ozzyGermany", "ReviewID": "UR54742924", "Content": "Recently booked 2 nights at this hotel checked out after only one. Manager was extremely rude. My daughter was staying in another hotel nearby and he would not let her visit my room. Bed uncomfortable room stuffy. Could not open window as it was on the ground floor with no security. Plenty of other nicer places to stay.", "Date": "January 30, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Tbilsii", "Title": "“Great hotel with very hospitable people”", "Author": "maichka77", "ReviewID": "UR52895774", "Content": "I've been visiiting Rome during the New year's days and I'm very happy that I chose hotel Gerber. I've been searching the web for a good hotel for almost one month and was quite afraid to book it relying only on reviews and not knowing what a hotel represents in reality. I always go to Marriott hotels becuase my friend gives me a friends and family rate and having stayed in Marrioot I was quite afraid to go to other hotel. In Rome, Marriott whcih our friend could reserve for me was quite faw away from the center and we decided to book a hotel online. So, after many hesitaions and investigations we decided in favor of Gerber and never regreted our decision. The hotel is very close to Vatican ( almost 15 minutes walking distance), very close to the subways station - Lepanto whicn is in the nearest corner and is just one stop away from Piazza Spagna. You could walk also in 5 minutes to Via Ottavio which has a lot of shops along the street and is very nice. As about the hotel, everyone wwas very helpful. Reception desk, the host who greeted us every day very warlmy during the breakfast, waiter adn housekeepers did their job very well. Triple room was very nice on the second floor ( I think Italsians call it the first floor), bed was very comfortable and the bathroom was very clean and nice. In front of our room was a terrace with lemon trees. On 31 December, when we returned from New years' celebrations to our hotel we found a lovely surprise in our room - two bottle of champagne and chocolate. It's very important when you get to hotel after a tiring day to find yourself in a nice room with all the amenities. In summary, it was a great hotel with great people and Gerber's hospitlaity made our trip to Rome even greater. Maia, Tbilisi, Georgia", "Date": "January 8, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Location": "4", "Rooms": "4"}, "AuthorLocation": "Texas", "Title": "“Great value in quiet neighborhood”", "Author": "TexasSnow", "ReviewID": "UR47688415", "Content": "Traveled with grown children and husband. Great breakfast buffet in the German style - boiled eggs, ham, cheese, yogurt, cereal, bread and croissants, which was included in the room rate. Just north and east of the Vatican, 1 block from the Lepanto metro stop. Clean and quiet. This hotel is slightly off of the beaten path, which we liked. Very helpful, friendly staff (in the European manner-slightly reserved), bathrooms were decent size with a bidet. Internet access as .50 Euro for a half-hour.", "Date": "October 25, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "New York", "Title": "“Out of the noisy crowd, into a quiet neighborhood”", "Author": "MarianneforItaly", "ReviewID": "UR46206176", "Content": "...Conveniently located one block from the Lepanto Subway stop, walkable and clean area, comfortable and clean hotel with nice breakfast included every morning. The only things that were small (compared to US standards) were the elevator and the shower. But otherwise, the hotel was very comfortable and charming. The staff was very considerate and friendly despite my lack of Italian vocabulary. I would stay there again gladly.", "Date": "October 8, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Dublin, Ireland", "Title": "“Exceeds expectations”", "Author": "catrionamcmanus", "ReviewID": "UR36180444", "Content": "Hotel Gerber for an economical, roman hotel was great. For a quick visit to Rome, it has a great location in a tree lined street near the Vatican. All staff in the hotel were friendly and professional. Our room was comfortable and compact, with a spacious bathroom, we even had a bath. Would recommend it wholeheartedly and great value for money.", "Date": "July 29, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Business service (e.g., internet access)": "2", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "United Arab Emirates", "Title": "“Hotel Gerber is a Gem!”", "Author": "ColemanNative", "ReviewID": "UR22690286", "Content": "Terrific location a block from Lepanto Metro stop, and within easy walking distance of Vatican City and other major historical sites. Rooms were clean, breakfast was excellent, price was good, and the staff was exceptionally courteous and helpful. Would definitely stay there again. We had two separate rooms, one for parents one for two teenagers.", "Date": "December 13, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "long island", "Title": "“WONDERFUL HOTEL”", "Author": "mariabf87", "ReviewID": "UR21009156", "Content": "GERBER HOTEL ROME. ITALY This hotel was like a breath of fresh air. We had been touring Italy for 11 days and this was our last stop staying 5 nights. We were very happy with the location, around the corner from the metro. This is a residential section one train stop from the Vatican and a few stops from the Spanish Steps and Trevi fountain. If you plan on going to the Borghese a taxi ride was about 7 euros. The area was quiet. We had 2 rooms on the 4th floor in the back over looking a court yard. The hotel has a terrace on the 4th floor which was handy to have a picnic lunch or supper and get away from the restaurant scene. The hotel staff was very helpful. There is internet service available for a very small fee and free if you have your own laptop., The rooms were clean and bright. There is shopping near by and many places to eat. The hotel breakfast was very nice and the service was excellent.", "Date": "October 19, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Maryland", "Title": "“Great Hotel”", "Author": "Treely", "ReviewID": "UR20622931", "Content": "My husband and I stayed at Hotel Gerber for three nights at the end of September. We found the hotel staff very helpful and friendly. The hotel provided breakfast (e.g., rolls, cereal, fruit...continental style) every morning in their breakfast room. We found the room very comfortable. We were on the first floor but we were never disturbed by noise in the lobby or from outside the hotel. We were in a quiet neighborhood around the block from a metro station, which was great and easy to use. The only reason we did not rate this hotel a 5 is because the bathroom was a little small. My husband (who is 6'2'') had a little trouble with the shower...I think I spent several minutes laughing (in a loving way, of course) hearing him bang into the sides of the shower as he tried to wash himself. However, at 5'1'', the bathroom was not a problem for me. For those interested, there is a tv and phone available in the room. CNN and BCC are available for catching up late at night with what is going on in the world. However, given the time we were on vacation, it was probably best not to pay attention to the news. We were able to use our IPhone to get wireless internet in the hotel (no charge). We highly recommend this hotel. Everything was very enjoyable...I think we had the best pillows at Hotel Gerber than at any other hotel we stayed at in Italy.", "Date": "October 4, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Business service (e.g., internet access)": "3", "Check in / front desk": "5", "Overall": "5.0", "Value": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "US", "Title": "“Enjoyed the Gerber Hotel”", "Author": "MilesJesu", "ReviewID": "UR18282943", "Content": "Dates: 21-24 July Reviewer: Traveler with family, two boys (13, 11) Room Size: 1 Quad Room Location: Very convenient, next to the Lepanto Metro Station. It was only a 1.5 block walk. It is also in a relatively quite area of town about 9-10 blocks from the Vatican. There is a grocery store around the corner where you can pick up snacks and water relatively cheap if bringing a family. Experience: The room was clean and the air conditioning worked fine. All furniture was in good repair. The windows block out any city noise and the room can be darkened with the curtains closed. The breakfast was good. Shower was a little small. Cost: Reasonable compared to other comparable hotels and for the time of year. Hotel Staff: They were all nice and the front desk did a nice job coordinating transportation to and from the airport. They also made a nice recommendation on an Italian resturant around the corner. I believe the owner was Octavius but it was a family run place with great food and a reasonable price (compared to many others). We ate there two nights in a row. Would have made it three, but we were out late sight seeing and didn't make it back. Overall: I would stay there again and would recommend it to my family and friends, based on my experiences. They also have a nice, small map of Rome helpful for sightseeing.", "Date": "July 26, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Business service (e.g., internet access)": "2", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Kansas City, Missouri", "Title": "“Great Hotel”", "Author": "KMKC", "ReviewID": "UR15939660", "Content": "A wonderful hotel. It was in a more residential area of Rome, but it was very close to a bus and a metro stop. It was clean and the room was fine. We really enjoyed the breakfast and the staff was very helpful and friendly. We would return and would recommend it to anyone wanting to stay at a more reasonably price hotel in Rome.", "Date": "May 11, 2008"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Business service (e.g., internet access)": "3", "Check in / front desk": "3", "Overall": "3.0", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Arlington, VA", "Title": "“Fair hotel, good location”", "Author": "Rick92", "ReviewID": "UR15723873", "Content": "Hotel is okay, little expensive, but Rome is expensive now so relative to other hotels, not bad. Breakfast was fair and rooms have been updated but nothing fancy. Good location, can easily walk to the Vatican and even though we did not utilize it, there is a metro stop close by. Staff was not that friendly, the waiter did not like me ordering a second cappucino and the front desk was not that friendly.", "Date": "May 6, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Bloomington, illinois", "Title": "“Clean, Quite Hotel.”", "Author": "yarrow5", "ReviewID": "UR14721802", "Content": "Hotel Gerber in the Prati District of Rome was a great hotel to come back to after along day walking the streets of Rome. It was very quite, very very clean and had friendly staff. The bathroom was updated and had a bathtub/shower combo. Towels were changed daily. The breakfast was very good. The owner couldn't have been more pleasant and personable. The location was just a block from the Leponto Metro stop. Most sites were within walking distance.", "Date": "April 1, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "4", "Check in / front desk": "5", "Overall": "4.0", "Value": "5", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Madison, Wisconsin", "Title": "“Great location, friendly staff and the price was right!”", "Author": "Bustergirl", "ReviewID": "UR13005435", "Content": "We stayed at the Hotel Gerber for a week in January 2008. It is in a more residential (less crowded) part of Rome, but easy to get to on the Metro. The Lepanto stop is less than 2 blocks away. We used our weeklong Metro pass (16 euros) several times a day for getting around. Our room was small, but clean. The TV was also small but had satellite channels so we could see some shows in English and even the US football playoffs in the middle of the night. Breakfast was in the basement but again the area was clean and well lit, and run by the friendly man mentioned in prior posts. It is a definite cost savings to have breakfast included. There is also a PC in the basement where you can check your email for 1 euro for an hour. Speaking of cost savings, we were able to get this hotel for 100 euros a night on a winter special they were having - tax and breakfast included. That definitely made the Hotel Gerber a place to recommend, especially if you are on a budget. And we found January is a great time to visit Rome - weather is in the 50s and we encountered basically no significant lines or crowds, even at the Vatican. The front desk staff was helpful and friendly with basic English skills. They recommended an excellent restaurant just down the street - Pizzeria San Marco - where we had a great dinner during our last night in Rome. And there is a little pizza place right around the corner where you can grab a delicious slice of a wide variety of pizzas. We enjoyed our stay at the Hotel Gerber.", "Date": "January 26, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "San Diego", "Title": "“Quiet, cozy, xlnt breakfast”", "Author": "VickyMcG", "ReviewID": "UR11001553", "Content": "We brought my elderly parents & sis/bro in law on their 1st trip to Europe & I had to be sure all was good for them. Briefly: The elevator is old, but works fine. The rooms are clean, quiet and adequate-I saw all 3. All were equally small but functional. The bathrooms are very modern and spotless, although the shower is built for a small person. (pretty typical here). There is a private courtyard, nice & inviting. There is a cozy rooftop with chairs & tables. The buffet is wonderful-everything you need as mentioned by earlier TA writeups. The staff makes sure that the items are replenished, along with more coffee or cappuccino. The eggs are in that usual in-between stage, neither hard or soft-boiled. (the only imperfect thing about this buffet). The man in charge of the buffet is very fussy though; we couldn't even put our tables together. And if there is a full house, he tends to discourage you from sticking around over coffee. He is efficient, we ended up referring to him as the \"Breakfast Nazi\". There is one computer, you can use your laptop. The pizza place down the street is very good and very busy-go early. Location is great as mentioned. Air conditioning worked fine in all 3 rms. There was a safe in the room. We would stay there again. Ciao!", "Date": "November 23, 2007"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Business service (e.g., internet access)": "2", "Check in / front desk": "5", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Mississippi", "Title": "“The Hotel Gerber is a little gem in Rome.”", "Author": "Love2travel67", "ReviewID": "UR8027078", "Content": "The Hotel Gerber is located close to the Lepanto Metro stop in Rome - away from the maddening crowds of historic Rome and the central train station. A taxi ride from Termini is only about 10 euros if you are adverse to metro travel. But be warned that the metro is lots faster than the taxis. It is conveniently located in a residential neighborhood which allows for a quiet and safe stay after the hurried, frenzied tours of Rome. This charming little hotel has a friendly and helpful staff. We were in a comfortable room during our first stay in Rome. The shower in the bathroom was a little small, but we expected small bathrooms in Rome. On our second stay, we had room 427, which was an improvement. This room had a small balcony and a bathtub - which we were delighted to see. It was one of the few rooms we had during our 24 day Europe trip that had a bath tub rather than a shower. The hotel has a garden patio on the ground floor and a nice terrace with a view of a church dome on the top floor. When we return to Rome, we will stay at the Hotel Gerber. We enjoyed our stay there.", "Date": "June 29, 2007"}, {"Ratings": {"Service": "4", "Business service (e.g., internet access)": "3", "Check in / front desk": "4", "Overall": "1.0", "Value": "1", "Location": "3"}, "AuthorLocation": "Atlanta, Georgia", "Title": "“Disgusting Room”", "Author": "Georgia_chick", "ReviewID": "UR7772482", "Content": "I have no idea why everyone is giving the hotel such great ratings. We took the ancient elevator up to our room and opened the door to a filthy room which looked and smelled like someone lived there and smoked in it for 30 years. The \"King Size\" bed was 2 twin mattresses that were pushed together and they were so old they were flat on the ends from wear. Needless to say, we didn't stay there. This was the 2nd 3 star hotel we tried in Rome only to discover that we needed to go ahead and spend a little more to get the type of quality we are used to and expect from a hotel. The owners were nice, but that's the only good thing I experienced.", "Date": "June 5, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Chicago, Illinois", "Title": "“Our Sanctuary”", "Author": "dmrospond", "ReviewID": "UR7286324", "Content": "I stayed with my husband and daughter in a triple room at the Hotel Gerber for 5 nights at the end of March beginning of April. I could not have picked a nicer hotel. The property was lovely and well run with excellent service. It was very noisy and crowded at this time of year in Rome and after a long day it was so nice to be back at this wonderful quiet building. It is not that far a walk to the Vatican and a very short walk to the subway stop and there are many restaurants and other eateries close by. Our room was big and very comfortable with a big bathroom with everything you could need and it even had a glassed in balcony to view the street below and surrounding area. There is also a upper terrace and a ground floor terrace to use. We had a wonderful breakfast every morning included in the price and a big welcome from the nicest man who takes care of the breakfast. We will miss the Hotel Gerber but will always remember the wonderful memory of our stay . All hotels should be like the Gerber.", "Date": "April 6, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "2", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "peoria, illinois", "Title": "“A Gem in the city of Rome”", "Author": "mocho", "ReviewID": "UR5922604", "Content": "We stayed at the Hotel Gerber for 8 nights and just returned yesterday. We booked 2 double rooms and 1 single room for our group. The managers, Peter and Simonetta are friendly, helpful, and very welcoming to guests. The breakfast was great with fresh fruits, pastries, cereal, hard boiled eggs, cookies, and freshly brewed cappuccino. There is an outdoor terrace that is very inviting after a day of touring. There is also a 4th floor balcony which offers privacy and a great view. We bought a Metro pass for the week and the Lepanto station is within one block of the Gerber. We walked everywhere when not on the Metro or the bus. Walking is the best way to see Rome and you will find lots of streets and sights on foot that you would not find on a bus or in a taxi. The neighborhood is very safe and quiet and we walked late at night without any concerns. There are many good restaurants close by and the gellato is a must! The rooms are small but very comfortable and offer a safe, and a small stocked refrigerator. Our room 427 had a small private balcony. Room 428 also has a balcony. Since this was our first trip to Rome, we did not know what to expect. We were delighted with the Gerber and will recommend it to our friends. It is also recommended by Rick Steve. The Gerber offers comfort and value for your money. We don't always get the same quality for the same price here in the States. I would definitely stay here again...I hope my coin in the Trevi Fountain brings us back!", "Date": "October 6, 2006"}, {"Ratings": {"Cleanliness": "5", "Overall": "4.0", "Value": "5", "Service": "5", "Rooms": "5"}, "AuthorLocation": "State College Pennsylvania", "Title": "“Very nice accomodations”", "Author": "A TripAdvisor Member", "ReviewID": "UR5362120", "Content": "We just came back from a four night stay in Rome where we stayed very comfortably at the Hotel Gerber. The Hotel is very nicely decorated, very clean, and actually has shampoo in the bathroom. There is an electronic safe in the room that you can easily program yourself. The breakfast was generous with bread, cheese, meat, yougurt, fruit, tea, coffee, pastires. We foudn this to be unusual in Italy where everyone seems to want coffee and a pastry. We found the staff all to be very pleasant. The Hotel is close to the Lepanto metro stop which makes it a fairly long walk to the Vatican and St. Peter's, but it's doable and the streets are very nice. The Hotel is in a neighborhood that is largely residential so it's fairly quiet. I will stay there again when I go to Rome next.", "Date": "June 19, 2006"}, {"Ratings": {"Cleanliness": "5", "Overall": "5.0", "Value": "3", "Service": "5", "Rooms": "5"}, "AuthorLocation": "Michigan", "Title": "“Great Deal at the Gerber”", "Author": "A TripAdvisor Member", "ReviewID": "UR5316155", "Content": "A two-block walk from the Lepanto Metro stop put us on the doorstep of the quiet and somewhat secluded Hotel Gerber. A welcoming receptionist checked us in as we looked over the lobby featuring a small bar and a large semi-circle couch with a circular table covered in newspapers and magazine for your reading pleasure. Up four marble steps and then a quick cram into the elevator that barely fits two people and two suticases but it gets you where you need to go with no problems. Our double-bed room was amazingly clean complete with desk, small TV and fridge. A cabinet provides space to hang our clothes or slide them into drawers. An easy to use security box allowed me to dump off my passports and extra cash. there was also a large window that can be opened. The bathroom was clean with a couple of crisp white towels for the face and others for the shower. Although I am a private bathroom kind of guy, I would have opted for a shared bathroom because of the cleanliness throughout the hotel. Other ammenities included a fourth-floor balcony to just hang out and watch the sun set as well as a small courtyard area with tables and chairs. The best part was the sleep. No trucks and car alarms as you find around the downtown Rome hotels. Brekfast--Fantastic. Coffee, water, cereal, milk, juice, cheese, bread, hard boiled eggs and fruit. All served by some nice folks who like to talk and can help point the ways to different places if there are any questions. Don't forget breakfast is included in hte hotel cost. Hotel Gerber was a 15-minute ride out from the Rome train station on the Metro which is great because then you are right in the middle of everything you need to be for the rest of the trip. Two stops to the Vatican, one stop to the Spanish Steps, two to the Trevi Fountain and the heart of Rome's eating area. The only caution is that if the Metro closes you may have to rely on the buses which work well. A taxi ride is less than $10 Euros if you are ever stuck. For the sightseer or someone who likes to soak up the flavor, start out at the Gerber.", "Date": "June 6, 2006"}, {"Ratings": {"Cleanliness": "5", "Overall": "5.0", "Value": "5", "Service": "5", "Rooms": "4"}, "AuthorLocation": "yorba linda, ca", "Title": "“Great Experience”", "Author": "marianst", "ReviewID": "UR4977556", "Content": "We just returned from Italy and spent 4 days at the Hotel Gerber in Rome. We were concerned that it was not near the center of town but discovered that this was the best place to be. This hotel is located close to the Vatican City and close to a Metro station. We found it to be the perfect location because it was quiet at night and thanks to the Metro, we could be in the center of the city in minutes. The staff was extremely friendly and very helpful. We looked forward to the breakfast in the morning because the service was excellent and friendly. This hotel has a lift and the room was big & comfortable. I will definately stay here again.", "Date": "April 16, 2006"}, {"Ratings": {"Cleanliness": "4", "Overall": "4.0", "Value": "4", "Service": "4", "Rooms": "4"}, "AuthorLocation": "Dublin, Ireland", "Title": "“Really enjoyed our stay”", "Author": "A TripAdvisor Member", "ReviewID": "UR4345476", "Content": "The hotel is clean and well run. The staff were friendly and helpful. It is well situated being within walking distance of many attractions including the Vatican and is literally less that 5 minutes walk from a Metro station allowing quick access to the majority of the rest of the city. This is a hotel for those who want to see Rome without spending a huge amount on accommodation but at the same time want comfort and cleanliness.", "Date": "January 11, 2006"}, {"Ratings": {"Cleanliness": "5", "Overall": "5.0", "Value": "5", "Service": "5", "Rooms": "5"}, "AuthorLocation": "Dallas, Texas", "Title": "“Quiet and well located”", "Author": "dvaughn971", "ReviewID": "UR3482852", "Content": "The Hotel Gerber was clean, and the rooms were large. We had a great shower, and there is an elevator (all of these are rare in Italy). The staff was very helpful, and they stowed our luggage in a secure location after checkout. The Metro is very close, and the Vatican is a 10 minute walk. We did not have breakfast in the hotel, but Cafe Miso down the street had excellent coffee, pastries and service. We stayed over Easter holiday, and were pleasantly surprised by how quiet the neighborhood remained through this incredibly busy season. I would definitley stay again.", "Date": "May 18, 2005"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Toronto, ON", "Title": "“Very Pleasant”", "Author": "A TripAdvisor Member", "ReviewID": "UR2848403", "Content": "Stayed there in August and was quite happy with the hotel. My single room was clean with a small glass covered balcony. The room was small but not unlike most rooms in Italy. The hotel is in a quiet area close to the metro and Vatican which made getting around easy. The owner was quite friendly and spoke english having been to Toronto often. A friend from Italy who visits Rome often recommended it as a good hotel with no surprises and I would have to agree.", "Date": "November 26, 2004"}, {"Ratings": {"Cleanliness": "4", "Overall": "4.0", "Value": "4", "Service": "3", "Rooms": "4"}, "AuthorLocation": "Emeryville, CA", "Title": "“Perfectly Fine”", "Author": "SeeShopDine", "ReviewID": "UR2205296", "Content": "Our experience (in April 2004) was quite different from some of the other reviewers. The hotel was fine. We had a clean, comfortable room and the bathroom was quite good. Breakfast was pretty standard compared to hotels in Milan and Florence; the man who served breakfast was very sweet and friendly (front desk staff is more reserved). The on-line reservation we made didn't work, but fortunately we were still accommodated. The residential neighborhood actually seemed quiet, pleasant and safe to us (we walked around at night too). Down the street, we had a nice lunch at a cafe and a small market was convenient for water, fruit, etc. As for the subway itself, it seemed pretty typical for a big city. It got us where we wanted to go quickly.", "Date": "June 18, 2004"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "Pike Road, AL", "Title": "“An Oasis!”", "Author": "A TripAdvisor Member", "ReviewID": "UR1278474", "Content": "We left Orvieto heading for the Amalfi Coast stopped in Rome and found a wonderful place at the Hotel Gerber. The staff was friendly and helpful, our room was perfect and the outdoor courtyard was so peaceful and quiet. We will certainly return to the Hotel Gerber.", "Date": "September 10, 2003"}, {"Ratings": {"Overall": "3.0"}, "AuthorLocation": "Verona, NJ", "Title": "“A good bargain”", "Author": "fairytail", "ReviewID": "UR1144345", "Content": "The hotel is not bad for the price. The staff was reserved but helpful when asked. The breakfast was very bright and good. The rooms small but clean. The metro stop is accross the two-way street. It's not a six lane hgwy. The station is grubby but so is the rest of Rome. The sights are metro stations away but there's only two lines in Rome, A and B, so how far can you go? There's a good take out pizza place right near the metro sta. and a bus stop and a tobacco shop, so albeit the neighborhood dingy, it's safe. We came back late at night with no problem. The walk to St. Pete's is about 10 min or one metro stop away. On the way watch for used syringes on the ground. But all Rome is dirty, Vatican or no Vactican. The hotel secured a taxi for us back to the airport, $50 US. We took the train from the airport to metro to the hotel with no problem. we were all over with metro and found no difference between stations. One was as bad as the other. But the art is a must see.", "Date": "July 23, 2003"}, {"Ratings": {"Overall": "1.0"}, "AuthorLocation": "", "Title": "“Awful, unfriendly and outlying”", "Author": "A TripAdvisor Member", "ReviewID": "UR907604", "Content": "We visited the Gerber last May for five days. First we were placed in a little room facing the courtyard withouth any daylight (although we booked a quiet room on the top floor). As we refused to stay there (it was like a bear's den for the stuff) we were given a bright, well-equipped room - with the window directly to the 6-lane road and bus station directly in front of the hotel! Breakfast was terrible, the coffee (?) impossible to drink, but for lack of any cafes round there the only possibility to fuel energy after a horrible night. Stuff was snotty, unfriendly and incompetent. In walking distance you can't reach hardly any sightseeings, the tube is not advisable (expensive, dirty and too big distances between the stations), so you have to take the bus. Station is around the corner, but please do not rely on any timetables or routes! Take any bus in the right direction and jump off when you think you're right there!", "Date": "March 4, 2003"}], "HotelInfo": {"Name": "Hotel Gerber", "HotelURL": "/ShowUserReviews-g187791-d236168-Reviews-Hotel_Gerber-Rome_Lazio.html", "Price": "$69 - $198*", "Address": "<address><span rel=\"v:address\"><span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">Via degli Scipioni 241</span>, <span class=\"locality\"><span property=\"v:postal-code\">00192</span> <span property=\"v:locality\">Rome</span></span>, <span class=\"country-name\" property=\"v:country-name\">Italy</span> </span></span></address>", "HotelID": "236168", "ImgURL": "http://media-cdn.tripadvisor.com/media/photo-s/02/3c/07/2c/hall.jpg"}}