{"Reviews": [{"Ratings": {"Overall": "2.0"}, "AuthorLocation": "USA", "Title": "“Location OK, Qualty of Room not very good.”", "Author": "MaryGreatLakesRegion", "ReviewID": "UR6635221", "Content": "Located in \"Old Rome\" the hotel was difficult to find and not in a very nice location(alley type of street). A reasonable walking distance to sites like the Vatican. The room was small and not very well appointed. We slept in 2 uncomfortable, twin beds basicaly pushed together, not a queen or king size. The bathroom was extremely small and we had difficulty with hotel power on one day. Depressing with poor lighting and shabby room interior. On the positive side the desk clerk and bartender were very lovely people. Wine selection at hotel bar was very nice.", "Date": "January 21, 2007"}, {"Ratings": {"Cleanliness": "3", "Overall": "2.0", "Value": "2", "Service": "3", "Rooms": "1"}, "AuthorLocation": "", "Title": "“Are there 2 Cardinal Hotels in Rome???”", "Author": "A TripAdvisor Member", "ReviewID": "UR2754671", "Content": "My husband and I visited the Cardinal Hotel May 2003 - we could not believe the size of our bedroom - it was soooo small - we initially thought that we had walked into the broom cupboard!! We couldnt even open the bathroom door fully as the bed was 'in the way' which was by the way situated virtually 'in the wardrobe' again, another door that we couldn't fully open!!! But, at the end of the day it was clean & the staff were friendly and it is just somewhere to sleep!! Would class this hotel no more than a 3* - but then again after reading some of the other reviews 'large bedrooms etc....' perhaps we were in the broom cupboard after all!!!!!", "Date": "October 18, 2004"}, {"Ratings": {"Overall": "3.0"}, "AuthorLocation": "Hampshire, UK", "Title": "“A great position, but beware some rooms”", "Author": "A TripAdvisor Member", "ReviewID": "UR1646737", "Content": "Initial appearance is poor, but the central location is fantastic. Beware of some of the rooms, and insist upon a decent one.", "Date": "February 12, 2004"}, {"Ratings": {"Overall": "2.0"}, "AuthorLocation": "Nashville", "Title": "“Four Stars are a big stretch”", "Author": "nolagirl", "ReviewID": "UR1555812", "Content": "The best thing about the hotel is the location. It is on a very pretty residential street and close to everything. The rooms are clean but tiny and on the level of a Days Inn or Super 8 in terms of comfort and amenities. The staff was not very helpful or nice - a change from prior trips to Rome where I have found most people to be very pleasant. The breakfast was nothing special - they don't even make real cappucino - it comes from an automated machine. For the price, you can find better deals in Rome.", "Date": "January 18, 2004"}, {"Ratings": {"Overall": "1.0"}, "AuthorLocation": "Washington, DC", "Title": "“Would not stay there again”", "Author": "A TripAdvisor Member", "ReviewID": "UR1268736", "Content": "Very disappointed in this hotel during our July 2003 stay. We reserved a \"4-bed room\" but my wife and I were expected sleep on a pull out sofa. They didnt replace the burned out lightbulb (the only bulb) in the bath all during our stay; I ended up taking one from the hall. The management attitude was \"couldnt care less\". I think they must cater to the bus groups massing in the noisy lobby. I could be mistaken but I suspect we were encountering a subtle Anti-American Tax in their attitude. Enjoyed the location tho.", "Date": "August 28, 2003"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Palm Harbor, Florida", "Title": "“Wonderful stay at the Cardinal”", "Author": "A TripAdvisor Member", "ReviewID": "UR1219795", "Content": "I just got back from a group trip which included a 4 night stay at the Cardinal.. it was wonderful! It was one of the nicest hotels we stayed at in Europe. The only bad part was the small bathroom and small shower. (We even flooded the room because the shower overflowed!) I would reccomend the Cardinal to anyone.... great location and a friendly staff.", "Date": "August 8, 2003"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "Dracut, MA", "Title": "“Great Location to Do Rome”", "Author": "A TripAdvisor Member", "ReviewID": "UR1029081", "Content": "Just got back from our third trip to Rome and have to say each time it has gotten better, Last November we were sent to the Cardinal for one night when we arrived at our over booked Hotel. It was such a pleasant place with great location that when we book a family visit for this May I decided to stay the whole trip at the Cardinal and was not disappointed. The staff was helpful, room was clean and properly maintained and noise level from srteet traffic, which can be a problem in Rome was very tolerable. Having been to Rome a few times it was a perfect location to get to all the attractions with the minimun of walking, although you must expect to do a lot of walking in Rome in any case. Breakfast was fresh, plentiful, but was of the pastry, cereal variety. We stayed (4) in a quad room and found it more than adequate for our needs. I checked out several properties for the four of us and if you are looking for location, price (one room versus having to book two rooms) and pleasant conditions I would recommend the Cardinal to any of my friends. Just remember Rome is old and if you equate shiny glass and steel places to value Rome may not be the place to visit as they are few and far between, but if you want some atmosphere with old world charm try this place.", "Date": "May 26, 2003"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "Seattle, Washington", "Title": "“The CARDINAL HOTEL-The Roman Boutique Ideal”", "Author": "A TripAdvisor Member", "ReviewID": "UR870132", "Content": "Just returned from a spectacular adventure in Rome, which included a six-night stay at the Cardinal, a lower-end four-star hotel, in cobblestoned, 14th-century Via Giulia. Situated in one of the most picturesque and quiet Roman neighborhoods in Centro Storico and reasonably accessible to almost all of the top attractions (within a 5- to 45-minute walk to Piazza Farnese, Campo dei Fiori, Piazza Navona, the Pantheon, the Vatican City, Trastevere, the Colosseum, Roman Forum, Trevi Fountain, the Spanish Steps, shops of all stripes, ristorantes ranging from tiny romantic hosterias to exclusive fine dining establishments and bustling open markets), the Cardinal Hotel boasts a classic Renaissance-era facade designed in 1400 by Bramante, a charmingly decorated lobby, two spiral staircases and a tiny elevator, a simple, elegant bar and an atmospheric breakfast dining room with an ample and attentively replenished array of continental choices, including ham, cheese and rolls for delicious prima colazione sandwiches, pastries, cereals, coffee, fresh juice and yogurt each morning. Our second-floor double was typically small in overall area, but featured cathedral ceilings and tall, shuttered windows with draperies that opened out onto a courtyard, all of which lent an air of spaciousness to the room. (A few rooms with a common terrace appear to be available, but at a high premium.) Antique decor was spare and tasteful, and the bed firm but comfortable. Room services included telephone, television (no English-speaking channels save for European MTV), laptop connection and minibar. The tiled bathroom was larger than most European hotels and featured a spacious shower (with floor towel necessary to sop up excess splatter, however), sink, toilet and bidet. Service staff were uniformly gracious and warm but spoke only Italian. (A quick study of basic Italian is recommended for anyone travelling to Rome, if only to better ensure accurate communication in transactions.) Desk personnel were multilingual and efficient, if occasionally brusque. There is very little, if any, auto or pedestrian traffic after hours, but internal noise can prove an occasional nuisance, depending upon the habits and behaviors of one's neighbours. Ultimately, the Cardinal Hotel provides an extraordinary low season value and a good high season value for international travelers, highlighted by a safe, beautiful environment, incredibly convenient and peaceful locale and quality European hotel amenities with a Roman flair. For those who seek big, Hyatt-styled, Americanized comforts delivered by aggressively happy personnel in their hotel experiences abroad, the Cardinal Hotel will not likely be their cup of tea. For those like me, who prefer deluxe, boutique accommodations that reflect the essence, style and culture of the city and country in which they are visiting, the Cardinal Hotel is ideal. Another rarity, to my eye, all photographs utilized by the Cardinal Hotel in their advertising are honest representations of the property, although the rooms pictured are of some of their more impressive accommodations.", "Date": "February 28, 2003"}], "HotelInfo": {"Name": "Cardinal Hotel", "HotelURL": "/ShowUserReviews-g187791-d236161-Reviews-Cardinal_Hotel-Rome_Lazio.html", "Price": "$237 - $343*", "Address": "<address><span rel=\"v:address\"><span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">Via Giulia 62</span>, <span class=\"locality\"><span property=\"v:postal-code\">00186</span> <span property=\"v:locality\">Rome</span></span>, <span class=\"country-name\" property=\"v:country-name\">Italy</span> </span></span></address>", "HotelID": "236161", "ImgURL": ""}}