{"Reviews": [{"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Johannesburg, South Africa", "Title": "“Incredible location and excellent value for money!”", "Author": "Ilzedewet", "ReviewID": "UR128295321", "Content": "We stayed in room 409 with our own private balcony. Wow! Yes, the room, bathroom and shower are all small! You are in Europe - get over it!! We loved the breakfast spread - it was fresh and lovely. The best part of our stay, though was to wake up with the smell of freshly baked bread of the bakery right across the street and almost underneath our balcony. Over-all, the staff is friendly and accommodating, but some of them might want to reconsider another job which will suit them more. The location really is perfect and worth it!", "Date": "April 21, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "3", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Milan, Italy", "Title": "“Good value for Rome”", "Author": "mllespear", "ReviewID": "UR127907370", "Content": "The location, cleanliness, and price combination of this hotel outweigh the problems. I was very impressed with how clean the rooms felt. That said, the rooms felt more like staying in a hostel. Little decor, no frills. My boyfriend and I ended up in a triple so the room was quite spacious for two people. (Three would have been cramped in my opinion, especially if you had suitcases.) There was not much hot water which added to the hostel feel. It never got icy, but lukewarm was the best it got. Our toilet would also not flush on random occasions. We also could hear everything going on in the hall and assumed that everyone could hear most of what we said in our room and walking down the hallway. Breakfast is included in the price which makes the price even more reasonable. The breakfast has good variety (meat, cheese, yogurt, breads, pastries, cake, cereal, coffee, tea, juice, water, milk but the pastries appeared to be and tasted like yesterday's leftovers and kinda stale). My boyfriend and I met a group of friends in Rome and we all stayed here. It was good for that because there is a lobby where we could all meet and plenty of seating so we could wait for each other. There is a computer there too so we could check on restaurants or email while we waited. The rooms also have internet. You need to ask at the desk for the code. There were no breakfast tables for 6 so we couldn't all sit together which was a little disappointing. The location was great! We all were very happy to be able to walk everywhere we wanted to go. The location seriously could not be any better. Also, if you take a taxi from the train station you should know that it should be around 10 euros. We paid more on our way there, not having any idea what Roman taxis charge. Bargain it down!", "Date": "April 15, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Sleep Quality": "2", "Rooms": "2", "Location": "5"}, "AuthorLocation": "Stavanger, Norway", "Title": "“Location is the best to be said.”", "Author": "Aslaug2012", "ReviewID": "UR127875834", "Content": "Super location, clean. Very easy to hear conversations in neighboring rooms, lukewarm water in the morning, rather indifferent staff. Will not return.", "Date": "April 14, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Amstelveen", "Title": "“Very good hotel”", "Author": "Robert d", "ReviewID": "UR127721873", "Content": "This hotel is very good value for money. Location is superb, all major sites are within walking distance. Rooms are probably rather small compared to non-European hotels, but this is quite usual in major cities, especially in the city centre. Breakfast is OK and will you keep going for the larger part of the day.", "Date": "April 12, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "London", "Title": "“When in Rome... take what comes”", "Author": "canerandagio", "ReviewID": "UR127698883", "Content": "Rome is not an easy place for accommodation. Prices are high, distances are significant and reliability can leave you wanting, as you may book a place and find yourself elsewhere due to overbookings. I have done my research... and found that notwithstanding the small rooms, the uncertainty about getting a room in the hotel proper or in a nearby dependency, the not cheap prices, and the typical romanesque rudeness, this hotel was not bad at all. It's situated very near campo de' fiori, it's priced reasonably for the area, and it is clean. Our reservation worked really well, so I can't complain...", "Date": "April 11, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Atlanta", "Title": "“Great room and value in the heart of Rome”", "Author": "ammatlanta", "ReviewID": "UR127693700", "Content": "We had a great stay here for 3 nights in March. A relatively quiet area of the city, but the restaurant just outside of the hotel does cause some noise at night. The room was clean, simple, and just what we needed. The staff was very helpful during our stay. My only slightly negative comment is that the breakfast was very basic and could have been a bit better - just the addition of some fresh fruit would have made a big difference. I would stay here again.", "Date": "April 11, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Copenhagen, Denmark", "Title": "“Location, Massimo and Walter”", "Author": "toftwinther", "ReviewID": "UR127665454", "Content": "The Americans find the rooms too small - maybe the Americans are too big... Anyway - these rooms are just fine after Italian standard, they are good after the normal standard in Rome, and they are excellent compared to the location you get here. Staying in the absolute hearth of Rome you really don't need a room... But if you insist, this is the place. And at the same time you get the fine service - not too close, not too cool - from Massimo (fan of Lazio) and Walter (fan of Roma). Never mind the fine breakfast, the good cleaning and even the two roofgardens - it is Massimo and Walter (and the location) that make Smeraldo the very best Smeraldo in Rome. That is why we are coming back - and for the football...of course", "Date": "April 11, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Atlanta", "Title": "“Amazing value”", "Author": "LeaveHome", "ReviewID": "UR126910703", "Content": "The room is very clean and comfortable, the location is incredible, and the price is beyond reasonable. The front desk staff have been incredibly accommodating and we were not in the least bothered if they didn't smile when they graciously offered to refrigerate our bottle of wine. Do not miss either the cafe or the restaurant across the street! And yes, the shower is small, but it has been a great stay!", "Date": "March 29, 2012"}, {"Ratings": {"Service": "1", "Cleanliness": "4", "Overall": "2.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "denver,CO", "Title": "“Expect Nothing”", "Author": "mmlseptember", "ReviewID": "UR126446100", "Content": "My daughter and I spent 4 nights at the Hotel Smeraldo/Rome just recently. We would never return. Although I agree with the many reviews as to good price, central location, I hestiate to refer any traveler here because of the most fundamental business mistake. Rude, inconsiderate staff. I have been fortunate to travel a fair amount over the years. I have found that who greets you at the door will often provide the momentum for a terrific travel experience. I sympathize with anyone making a first time trip to Rome who encounters the Hotel Smeraldo staff. Expect nothing. Not even a smile, a thank you, Some will say, \"Oh, it's just Italians...\" Well, even in Rome, the hotel industry can, and should, compete. This hotel doesn't win.", "Date": "March 21, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "4", "Sleep Quality": "2", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Edmonton, Canada", "Title": "“Noisy, but the location makes the stay worth it”", "Author": "SDTrav12", "ReviewID": "UR126427015", "Content": "The hotel's location is perfect...a 20 minute walk from the Colosseum, a 10 minute walk from the Pantheon; 2 minutes from the Area Sacra (where Julius Caesar was stabbed) and a short walk away from the Campo de' Fiori square. You're also very close to tram/bus stops (although a word of warning, it's usually fairly packed with people so making sure you can get on the right tram can be a challenge). A restaurant with terrific pasta is right across the lane and if you prefer it, a grocery store with helpful staff is practically around the corner. Room was fairly basic and the bed/mattress was lumpy and a bit uncomfortable. But the room was clean and the bathroom was clean/a good size; shower was pretty teeny though. The views from the upper patios were great; like looking at a postcard of the roofs and skyline of Rome. Price was reasonable for Rome. My biggest complaint about the hotel was noise; we found it extremely noisy at night. We were on the second floor, close to the elevator and it seemed that sound traveled easily through the corridors which made it sometimes hard to fall asleep. The staff was helpful if not always pleasant. Overall, despite any negatives, the location and cost won out overall and made it a worthwhile stay.", "Date": "March 21, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "3.0", "Value": "4", "Sleep Quality": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "New York", "Title": "“Good location but basic”", "Author": "BrennaBee", "ReviewID": "UR123809002", "Content": "We stayed here for 2 nights the location was great but the rooms are quite basic, no frills. The rooms are small, flat screen tV, bathroom is tight. We stayed in a room that overlook Forno Riscoli so it was not too quiet at all. They have free internet downstairs and breakfast. If you are looking for something simple inexpensive then this is the place cannot beat the location.", "Date": "January 29, 2012"}, {"Ratings": {"Service": "2", "Cleanliness": "5", "Overall": "3.0", "Value": "5", "Sleep Quality": "4", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Florida", "Title": "“Call if you have young children, elderly for a better rate”", "Author": "gigianna", "ReviewID": "UR123287884", "Content": "We had 3 adults (my husband, elderly Aunt, and I) and a 2 1/2 year old boy. If you book online, they will require you to get 2 rooms and my Aunt was not comfortable being alone. When we called, they accomodated us in a comfortable 3 bedroom for a reasonable rate.. it is worth the international call (just skype it). I highly recommend doing this when traveling with children, most Italian hotels were very accomodating with kids and families with elderly sharing a room.The front desk was efficient but not very cordial. They were not very helpful when my Aunt tried to call home with the calling card. Room was clean and sufficient. Location is good since you are near the Campo dei Fiori and Piazza Navona. Also, do not close the shutters at night or you may oversleep since the room is so dark... we almost had to pay an extra night! We also would have recommended to have the breakfast included next time simply for the convenience of a traveling young family... If you are arriving in Rome first and want to see everything without exhausting yourself fighting jet lag it is a good idea to have had this included for your first stop. Spend and Splurge on dinner and lunch in Italy!", "Date": "January 19, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Winchester, Virginia", "Title": "“Good location near Campo Fiori”", "Author": "luvspain69", "ReviewID": "UR123133701", "Content": "We spent three nights at this hotel in Rome. Our room was lovely but the room and bathroom were very, very small. They must have bigger rooms. The hotel was well maintained. Breakfast was included and was adequate. Our room was very clean. Hotel staff was helpful. I would stay here again but request a larger room. The hotel has an annex but we were in the main hotel. The location was perfect--close to bus lines and within an easy walk to Campo di Fiori, Piazza Navona etc. Inspite of our small room I would recommend this hotel. A good value hotel for the location.", "Date": "January 15, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Sydney, Australia", "Title": "“great location”", "Author": "Amanda G", "ReviewID": "UR123050909", "Content": "This is a good hotel in a great location. Basic, clean, comfortable rooms for a good price", "Date": "January 14, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Wolverhampton, United Kingdom", "Title": "“Perfect location!”", "Author": "Wulfruna42", "ReviewID": "UR121668156", "Content": "We stayed here with a large group about 7 years ago, and decided to revisit for a family break. Great decision. We were in the annex - two teenage boys in a twin room, next door to me and my husband. The staff were friendly and helpful, and very patient with my almost non-existant Italian! Breakfast set us up well for the day, and the hotel is just so central! We walked everywhere and had a fabulous return trip to Rome. The rooms aren't massive - but with all there is to see in Rome, who would stay inside for long?", "Date": "December 12, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "3", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Columbia, Missouri", "Title": "“Good value and excellent location”", "Author": "ckassotis", "ReviewID": "UR121504611", "Content": "We arrived at the hotel at around 9:30 AM and check-in had not started yet, so we left our luggage with the front desk and went out to wander the city a bit. After a while we headed back to the hotel and got checked in. If you were looking for a roomy hotel room, this was not for you. The room was quite tiny, with barely enough room for the two twin beds and a small table. The heat was constantly on, even when the heat was set to off and the A/C was switched on, which was a bit uncomfortable, but for two guys exploring the city, we did not particularly care what the room looked like. At night it got amazingly loud (still not entirely sure what was going on in the middle of the night) and quite warm, but as we were only there to sleep, I couldn’t complain. The hotel was right in the center of things, which was exactly what we wanted. The staff was very nice, always smiling and greeting you if they saw you, and did I mention the location was great? Would definitely recommend, but if you need a lot of room, or aren't using it just to catch a little sleep each night before you head out to explore again, you might try elsewhere. Me, I enjoyed it, despite it's quirks.", "Date": "December 7, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Portsmouth, United Kingdom", "Title": "“Great value, great location, helpful staff”", "Author": "BagLadies", "ReviewID": "UR121381463", "Content": "A group of 8 ladies stayed at this hotel in September for two nights - should have been three but the Italians went on strike on our first day! The hotel were great in rearranging our booking and the minibus transfer from the hotel. The rooms were on the small side but for Rome this was the norm and we were only there to sleep! There is so much to do in Rome, we did not expect to spend very much time in the hotel at all. The rooms were spotlessly clean, we had four rooms in all, with separate locations within the hotel. I think that my only moan would be that I had the furthest to walk from the roof terrace, which gives wonderful views over the city and a chance to have a relaxing glass of wine before dinner (roof terrace closes at 7pm). The breakfast was continental but there was a wide selection. I would recommend this hotel as good value for money, very good location and helpful staff. The minibus driver on our way back to the airport was very informative about some sights in Rome that we passed but ran out of time. I would return to this hotel if I ever go the opportunity to visit Rome again.", "Date": "December 4, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Manchester UK", "Title": "“Location, location, location”", "Author": "Karen B", "ReviewID": "UR121203574", "Content": "My sister and I stayed in November 2011 and had a great time. The hotel room was a little small but very clean. The bathroom was a fairly decent size. The staff were extremely friendly and helpful. They arranged for a car to take us to the Airport at the same cost as a mad taxi! The breakfast had plenty of choice - lots of lovely pastries along with toast, bread, cheese ham etc. The location of this hotel though is what makes this a fantastic place to stay - it is within easy walking distance of all the major sites, 20 mins to the Vatican and 15 mins the other way to the Colosseum. Really close to Piazza Navona and Campo D'Fiori where there are some great bars and restaurants. Would highly recommend this hotel.", "Date": "November 29, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Washington DC, District of Columbia", "Title": "“Great Value, Great Location”", "Author": "Alexis726", "ReviewID": "UR121166985", "Content": "The hotel was no frills, but great location and a great price. The staff was friendly and they have a secure room for storing your bags if you are too early to check in/out. The room was big enough for three, a little tight, but not unusual for European hotels. This hotel is right by the Campo di Fiori which is such a fun area. Everything in Rome is walkable and a number of great restaurants on the square are only a few minutes away. The hotel provides breakfast and internet, which are nice perks. I would absolutely stay here again.", "Date": "November 28, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Västerås", "Title": "“Good hotel close to need to be seen”", "Author": "sallesweden", "ReviewID": "UR120869692", "Content": "Smeraldo is situated close to all need to be seen thing in Rome. I was here for the second time and the hotel is good, clean and well managed. The breakfast is perhaps little simple but you have to remebe that this is a three stqar hotel. I cn recomend this hotel and as it also is close to Campo di fiori and Trastever you will be ale to fins both good bars and nice restaurant.", "Date": "November 21, 2011"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "2", "Location": "5"}, "AuthorLocation": "Dallas, Texas, United States", "Title": "“Bad Recommendation”", "Author": "Michael B", "ReviewID": "UR120834094", "Content": "We stayed here earlier this month. The location is excellent -- but avoid this hotel like the plague! The staff raise the bar for rudeness, taking special care to make you sorry you chose to stay there. They get their attitude from the top of management. I had a chat with the manageress, pointing out that the smoke alarm in our room had no power and there was no fan, cooling or heat in our room for several nights running. She smugly assured me we were perfectly safe and commented that they were unable to get anyone out to repair the air conditioning. Get the picture? Rick Steves is WAY OFF on this recommendation!", "Date": "November 20, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "", "Title": "“In the heart of Rome without a fortune”", "Author": "ms mg", "ReviewID": "UR120827719", "Content": "We seleted this hotel for its location & price, both very good in a very expensive city. The rooms are small, no smaller than many we have had in Europe, in a heavily taxed city.. We did have one of the less expensive rooms which just has room for one suitcase on the desk and one suitcase on the luggage rack, your carryon willl have to fit in the closet. We faced onto the street on the first floor, so had a nice view of the outdoor cafe and bakery across the street- potential noise for you light sleepers IF you leave the window OPEN- but there is A/C so you dont have to. We use sleep masks and earlpugs anyway, no problem.Your fellow tourists talking in the hall make a lot more noise than the people in the cafe, in my experience. The hotel has an elevator and a free lobby computer. The internet in your room costs a few euros, but one could pay for 2 days and get one day free IF you asked and paid in advance for that special - ask for that. Slow internet, so what. Yes, the shower is tiny- had had the exact same size in Paris tho- think the size encourages you to turn off the water while you soap up and thus save energy to heat the water and the water itself. The bathroom is an average size with limited counter space. This is an authentic big city hotel in a remodeled building- the kind of place I like, family run and not a Hilton or Holiday Inn. However, the hotel is spotlessly clean, the breakfast is a good Italian continental- several sliced cheeses and sliced turley or ham, along with the juice, fruit, cake,toast, sweet croissants, and good coffee. We would be pleased to stay here again. The Campo Fiori was lively and fun at night and a block or two back to the hotel. The front desk gave us 3 good dinner recommendations, funnily enough 2 of them were in the RIck Steves guidebook and very straighforward. Walter at the front desk was especially helpful with reservations at a Fish Restaurant nearby. Everyone was very professional and courteous and dignified, as befits hotel professionals, including the breakfast room ladies and the cleaners. Completely enjoyed our stay at the Smeraldo.", "Date": "November 20, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "2", "Sleep Quality": "3", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Chicago, Illinois", "Title": "“Great location, not impressed with hotel”", "Author": "serohn", "ReviewID": "UR120788199", "Content": "When my husband and I traveled to Rome for our third city in Italy, we knew we wanted to stay in the Campo di Fiori area or near Piazza Navona. This hotel is situated on a very small, cute street that is less than 5 minutes walking distance from both of those areas. We also walked to every hot spot in the entire city from our hotel. The longest walk was about minutes one way, and that was to the Colloseum. The location of this hotel was fantastic. The hotel itself, however, was not so fantastic. The room was unbearably small, and the only window we had faced a brick wall. It was pitch black in the room unless we had the lights on. Now we literally were only in the room to shower and sleep, so it wasn't such a huge deal. The bathroom was fine. The breakfast was average, but included in the package. The employees at the front desk were somewhat curt and unwelcoming. And finally, the place smelled like smoke in the hallways. Either they still allowed smoking in the hotel, or people smoked right outside of the air unit outside of the building. As non-smoker, this was a killer turn off.", "Date": "November 19, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "3", "Sleep Quality": "5", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Arlington, Texas", "Title": "“Nice Central Rome place to stay”", "Author": "joedvet", "ReviewID": "UR120501533", "Content": "Good central Hotel. It was nice and quiet. Had a nice breakfast too. Room was typical of european rooms, a bit on the small size but adaquate. Good view from balcony too. Only negative: smallest shower I think I ever had in a room. Really tiny, even my wife at 5 foot 2 remarked that she could not shave her legs as she could not bend at all. Otherwise, great. They do charge for internet but they have a free computer downstairs.", "Date": "November 12, 2011"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "St. Paul, MN", "Title": "“Basic but nice, fun location”", "Author": "ranger1958", "ReviewID": "UR119958816", "Content": "Our room was small but clean. When closed, windows did a pretty good job of blocking out street noise. Breakfast is a nice addition, as breakfast (beyond a coffee and pastry) is a little hard to find. We asked the front desk for a taxi to airport and they gave us a car service for the same price which was nice! Really good restaurant just across the street (Trattoria Moderne). If you are walking (as we did, from the train station) I would recommend calling them to ask for directions as it is on a tiny street in a maze of tiny streets and is hard to find using a city map.", "Date": "October 31, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "MI, USA", "Title": "“tucked down ancient street in heart of Rome”", "Author": "Gail050", "ReviewID": "UR119796704", "Content": "Centrally located down a narrow ancient street near Campo de Fiori, this small hotel is perfect for walking to the Forum, Colosseum and Pantheon. Rooms are small but clean, breakfast is very nice, and staff all helpful. Local bread,cheese, and wine markets nearby - great for getting a snack to eat on the roof top deck at the end of the day.", "Date": "October 27, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Denver, Colorado", "Title": "“Convenient, helpful, and comfortable”", "Author": "passport2earth", "ReviewID": "UR119657135", "Content": "Stayed here for a weekend of sightseeing, and was very pleased. The hotel is in a great location- highly central, but tucked away from the noise of Rome's traffic. I highly recommend the hotel's breakfast, as it is hard to find a solid morning meal in Europe sometimes. The staff is very sweet, and there is free internet use in the lobby. The rooms are a little small, but well-kept, clean and very comfortable- I slept better than I usually do in my own bed. The shower was a dream compared to most European water pressure. Loved it and will definitely stay here again!", "Date": "October 24, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Toronto, Canada", "Title": "““Great hotel, highly recommended!”””", "Author": "annaf99", "ReviewID": "UR119417662", "Content": "My husband and I stayed in the hotel for 5 nights during our vacation to Rome in the beginning of October. Location is amazing,,, walking distance to many of the major points of interest, such as Piazza Nevona, Pantheon, Trevi Fountain, Campo di Fiori, Piazza Venezia and Trastevere. Close to transportation and great restaurants. Good trattorria and bar are right outside the door of the hotel . Room was not big, but comfortable and very clean. The roof terraces are fantastic. It was so nice to sit there in the evenings with glass of wine, looked over the rooftops and shared traveling tips with other guests. The breakfast was very simple, but ok . We found the staff there very friendly and helpful. I will highly recommend this hotel to anyone planning to visit Rome.", "Date": "October 17, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Phoenix, AZ", "Title": "“Couldn't have been happier...”", "Author": "jim85308", "ReviewID": "UR119358367", "Content": "My wife had been here before and wanted to share Rome with me. She was a little embarrassed to take me to a \"3 star\" hotel that seemed cheap by comparison to other options. I couldn't have been happier. The Smeraldo is a perfect mix of a respectably modern hotel in a charming authentic Italian neighborhood. For better of for worse a lot of the little eateries and shops we frequented around the Smeraldo spoke little English but were patient and understanding of us. After a week there we finally started to figure out the procedures. The little bar across the street \"Bar Rossana\" was a great place to grab a wine or americano at the bar or sit out front and watch the crazy little cars, scooters and local pedestrians scurry about. They have great prices on small daily essentials (wine, espresso and bottled water.) The hotel staff is friendly, speak english well and informative. From the hotel we walked everywhere we went and there is little we did not see. The transfer from hotel to airport is fair at 45 euro per couple. We will return to Rome and we will stay again.", "Date": "October 16, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "4.0", "Value": "5", "Sleep Quality": "3", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Fort Worth, Texas", "Title": "“The best place to stay in Rome”", "Author": "plstrobel", "ReviewID": "UR119351684", "Content": "Great place, wonderful staff, great location and they have two roof top patio areas that you can sit and have some wine. Only issue was that the air conditioning was not the most efficient. Good restaurant across the street and several within a short walk, ask the desk and they will assist.", "Date": "October 16, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "New Boston", "Title": "“Excellent”", "Author": "lngokray", "ReviewID": "UR119322283", "Content": "Smeraldo was fantastic. Great location to most of the sites in Rome. A main bus terminal within a block. The desk was very helpful with any of my questions, train schedules, etc. The rooms are small but clean and a nice brekfast.", "Date": "October 15, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Flint, Michigan", "Title": "“Great location, good price”", "Author": "scrimshaw2", "ReviewID": "UR119258374", "Content": "Second visit to this hotel, Location is ideal to all major sights. Price does not break the bank. Well run place...", "Date": "October 13, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Thunder Bay", "Title": "“Excellent”", "Author": "AJM012", "ReviewID": "UR119239251", "Content": "We spent 6 nights this year and it was a dream vacation for us. The location was ideal- very close to Campo de Fiori (about a block) and a couple of blocks south of Piazza Navona and the Pantheon. About a 5min walk to the Capitoline Hill. Nice restaurant across the street and a Forno for dinner on our terrace. We were one of the few lucky ones to have our own private terrace and although small, our room was very clean and quiet at night with the windows closed and the air conditioning turned on. The staff without exception were friendly and helpful. It was everything as promised and we would be back in a flash if we had any vacation time left.", "Date": "October 12, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Nashua, New Hampshire", "Title": "“Great Stay at Smeraldo”", "Author": "Christine L", "ReviewID": "UR119148160", "Content": "Our stay at the Smeraldo was fantastic. Walter at the desk was helpful with any questions and a great conversationalist. Our room was very comfortable, air conditioned and there is an elevator which was great. The hotel is located within walking distance of many of the major points of interest, such as Campo di Fiori, Piazza Nevona, Pantheon and Trevi Fountain. Also, there is a bar and a trattorria right outside the door of the hotel. The roof garden at the hotel had an incredible view of nearby Roman homes and domes and provided a relaxing venue to sip wine after a long day of touring the cobblestone streets. My husband and I would definitely return to the Smeraldo in the future.", "Date": "October 10, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "3", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Durham, NC", "Title": "“Good hotel at a decent price.”", "Author": "Bepumade", "ReviewID": "UR118922785", "Content": "The Smeraldo is in a great location for those that are looking to walk to most of the sites in Rome. It has a fantastic bakery right around the corner to the left (when you walk out of the hotel), and a tasty restaurant right across the street. The staff is friendly and helpful. We especially liked the small terrace at the top of the hotel. The breakfast is typical of what you find at a hotel in Europe, as well as the room size.", "Date": "October 4, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Helsinki", "Title": "“Nice hotel with excellent location”", "Author": "Pia23", "ReviewID": "UR118899250", "Content": "Excellent location in the middle of locals and close to Trastevere & many other key areas. We slept in the annex although we requested a room in the main site. But it was not bad at all. The room was small and clean. TV and air conditioning working. A small fridge would have been useful. The bathroom was ok - only some mold on the roof. The walls were not very thick. You could very well hear the neighbor trying to make the toilet work during the night. The reception personnel spoke good english and gave the needed directions. The restaurant across the street was good, and there is a wonderful little bakery next to the hotel annex. The breakfast was ok but included canned fruit instead of fresh which is a pity in such a country. And the personnel there could have been a bit friendlier and not show their boredom with customers that clearly.", "Date": "October 3, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Santa Fe, New Mexico", "Title": "“Comfortable and clean”", "Author": "NMmommynurse", "ReviewID": "UR118677174", "Content": "First time in Rome and several people had recommended we stay in this area, so I went w/ this Rick Steve's recommendation. I was pleasantly surprised by this very nice and simple little hotel. I met my 60ish mother in Rome and we stayed for 5 nights. We did request a room in the main hotel and not the annex on the 1st floor (so 1 flight up in Europe). The room was small w/ an even smaller bathroom, but comfortable. I had just come from what was supposed to be a 3 star hotel in Bologna which was really grim (basically felt like sleeping in an ashtray), so I was nervous about what Rome had in store. This place was CLEAN!! and quiet which is what we wanted after a day of sightseeing. It's hardly luxurious, but I managed to get an extra pillow when requested and the air conditioning worked well. I found the front desk staff helpful and friendly enough. They gave us correct directions and bus routes when asked, called taxis, etc. The bedside light never got fixed, but I didn't push it either. We found breakfast very adequate and low key. I wish we'd had a small fridge to keep water and stuff b/c it was REALLY hot while we were visiting, but for the price I think it is a reallly good deal.", "Date": "September 27, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Burlington, Canada", "Title": "“best location”", "Author": "passaporta", "ReviewID": "UR118493115", "Content": "spent 4 nights here & loved the location our room was small but very comfortable large bathroom great breakfast very friendly & helpful staff", "Date": "September 23, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "3", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Copenhagen", "Title": "“Location, location, location”", "Author": "Danish32", "ReviewID": "UR118347548", "Content": "Just returned from a wonderful vacation in Rome. And I can only recommend Smeraldo Hotel. The location is so great. We were able to walk everythere (yes - my feet really hurts now). There are lot of shops, small cafés and restaurants in the neighbourhood. The Campo de Fiori is only 5 minuttes walk away. The rooms are very small, but nice and clean. The roof terraces are fantastic - especially the upper terrrace. It was so nice to sit here in the evenings with a drink, a glass of redwine, some good cheese or whatever and look over the rooftops. You are free to bring you own stuff upthere. It was also very nice to meet other guests up here and sharing travelling tips. The breakfast was very simple, but ok - would have loved to have some fresh fruit... We never had any problems with rude staff, they were always very polite and helpfull. I would definately stay here again.", "Date": "September 20, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "4.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Plymouth, Minnesota", "Title": "“Clean and nice location”", "Author": "galsmiley1971", "ReviewID": "UR117810379", "Content": "My daughter and I stayed for 4 nights during our European vacation. It was centralized to the sights. Very cute area. The hotel staff were extremely helpful. It was very clean. We slept well. They had the best continental breakfast of our trip. Would gladly stay here again.", "Date": "September 7, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "4", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Belfast, United Kingdom", "Title": "“wonderful little hotel”", "Author": "teleprompt", "ReviewID": "UR117366247", "Content": "Many thanks to the staff at the Smeraldo Hotel who were very kind to my pregnant wife and my father who was ill. This is a great little hotel in a superb location. Excellent value for money. We'll be definitely be staying in the Smeraldo next time we visit Rome.", "Date": "August 28, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "4.0", "Value": "4", "Service": "4"}, "AuthorLocation": "Miami, Florida", "Title": "“Very good!! Great location”", "Author": "giome", "ReviewID": "UR117297816", "Content": "I loved the location of this hotel!! there are many little restaurants, shopping and a market right around the corner. The rooms and elevators are very small. The bedroom, the bathroom is very clean and the bed is comfortable. The breakfast they provide is very good too.", "Date": "August 26, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "4", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Arizona", "Title": "“great location”", "Author": "psyied", "ReviewID": "UR117242678", "Content": "Since we had very limited time in Rome, it was important for us to stay in close proximity to the sites and hotel Smeraldo was perfect!!! We were able to walk to trevi fountain, the vatican, the colosseum, everything! Plus there is a great coffee shop across the street and the hotel serves breakfast. Although the shower was a little small, the rest of the accommodations were great! A/C, ample bed size, TV, safe, location, friendly staff, quiet at night, and a free computer on site. Would definitely stay again.", "Date": "August 25, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "4", "Overall": "4.0", "Value": "4", "Service": "4"}, "AuthorLocation": "", "Title": "“Smeraldo Hotel Rome Italy --- Best stay for price - Location perfect”", "Author": "Traveling00Man", "ReviewID": "UR116609017", "Content": "For the Money you can't beat it. I priced all over Rome until I came across This hotel which was centrally placed to attractions .From the steps to the Vatican was very close to the river and streat vendors. (evening). Also found a streat market(open early morning with fresh fruits) and a grocery store within 3 mins of hotel.. The staff is great always helpfull The Rooms was nice but simple and the bathroom was tight (thats why I didn't give it a 5 star). The room comes with breakfest which was a nice way to start off the morning because buying food at any resteraunt is expensive in my opintion. IE 38 euros for two pizzas and three beer or $50 usa.. My suggestion go to the grocery store and put yourself a picnic basket together. Bottle of wine two beers Large bottle of coke, Soft persuto, cheese, cookies fresh bread 15 euros P.S. large bottle of water 2 ltr was LESS THAN 1 EURO. I wish someone would have mentioned this to me because I figured this out with only two days left in my vacation. I would definetly stay there again.. Almost forgot there is a wonderfull patio on top of the hotel You can use for whatever. maybe have a drink or picnic evening cocktail? Have fun Best Regards Ron", "Date": "August 12, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "4", "Overall": "4.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Canterbury, United Kingdom", "Title": "“Lovely place to stay and would stay here again.”", "Author": "cl1971", "ReviewID": "UR116156447", "Content": "Small but very clean. Central enough for all of the main attractions to be in walking distance. Staff were very friendly and helpful.If we return to Rome in the future we would definitely stay here again. Local restaurants very expensive and don't really offer good value for money so a good idea to shop around.", "Date": "August 2, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "4", "Overall": "3.0", "Value": "4", "Service": "3"}, "AuthorLocation": "Ireland", "Title": "“Great location... but not the friendliest staff!'”", "Author": "Dora_Ireland_11", "ReviewID": "UR116085578", "Content": "The hotel's location is great - close to Campo di Fiori, Piazza Navona, the Pantheon, only 10 minutes walk from Via del Corso - we literally walked everywhere! The room was clean and well equipped (towels, shampoo etc) and it was a bonus to have a few English speaking channels! The air conditioning worked well and can be controlled in the room, although it wasn't as warm as Rome can be on our visit. The major negative for this hotel were the staff. I completely agree with earlier comments about the breakfast staff - they appear to despise their job. The front desk were not much better -on our arrival we were 'greeted' by an abrupt man, who told my friend she looked very unhappy. He failed to give us any information about the location of the hotel or ammenities available or payment for the room. When I asked if he needed my credit card he responded by saying 'I would have asked for it I needed it'! We found him very rude and following this his presence on the front desk was unpleasant to say the least. We didn't even want to book our taxi to the airport while he was working. The other desk staff were adequate, but not friendly. This was unfortunate as the hotel was nice otherwise.", "Date": "July 31, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "4", "Service": "5"}, "AuthorLocation": "Grand Rapids, Michigan", "Title": "“Perfect location; comfortable rooms”", "Author": "ejkb", "ReviewID": "UR116075840", "Content": "We stayed 3 nights in this hotel recently. I had originally booked another hotel, but that was cancelled on us a week before our arrival date. I did some quick reviews, including the Rick Steves Book, called Smeraldo, and booked the room. We actually were given a triple, so the room as well as the bathroom was probably larger than the typical double room. We purchased wifi for three days and it worked well. A/C worked well, lots of hot water and good water pressure....all musts for us! Breakfast was more than adequate with cereals, yogurt, fruit, pastries, juices, and really good coffee. Staff was very helpful and gave us good directions with a smile! The location is central to everything - although we found Rome to be very walkable from a number of different areas. We liked the intimate feel of this neighborhood with the narrow streets and a more local feeling. There is a deli across the street that serves great food to eat there or for take away. We ate there several times, ordering different homemade items, including pizza and hot and cold pasta dishes. I would not hesitate to stay here again.", "Date": "July 31, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "4.0", "Value": "3", "Service": "4"}, "AuthorLocation": "Nottingham", "Title": "“Well positioned clean hotel”", "Author": "NottinghamSue074", "ReviewID": "UR115792236", "Content": "We actually stayed here back in April 2011, but did not review at that time. It came highly recommended for its position and on that we were not disappointed. In 5 minutes you can be in the lovely Campo di Fiori, a lively square at night with some nice bars. A further 5 minutes gets you to the Piazza Navarona, a bustling square which we came upon unexpectedly and it was a lovely surprise. The rooms are spotless and the towels were changed every day. It was nice to be able to sit on the roof terrace when we returned from our sightseeing and there was a small bar right outside as the hotel only has a vending machine for cold drinks. Breakfast however is a poor selection which becomes boring after 2 days, it needs to be livened up with a bit of variety and some fresh fruit. We were advised to go out for breakfast but they would not offer a 'no breakfast ' option. All the staff were very helpful..", "Date": "July 26, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "4.0", "Value": "5", "Service": "4"}, "AuthorLocation": "Houston, Texas", "Title": "“Perfect location”", "Author": "denisi11", "ReviewID": "UR115592994", "Content": "I found this hotel on the Rick Steve's guidebook, the location is superb, very centrally located in the Campo di Fiori area. Only a few blocks away from Piazza Navona, The Pantheon, less than a block away from Largo Argentina... I basically walked everywhere. The hotel itself is small, clean, the staff was friendly, as a solo traveler (first solo experience) I felt very comfortable. My room had a small balcony overlooking the terraces and the street, where I sat and enjoyed the sights while reviewing my itinerary for the next day. The biggest gripe I had was that the elevator was broken for the majority of my stay, I was on the fourth floor; needless to say, the trip upstairs was quite painful. The breakfast -which was included- did just fine, good coffee and pastries. Smeraldo was a great place!", "Date": "July 20, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "4", "Overall": "5.0", "Value": "3", "Service": "5"}, "AuthorLocation": "Cleveland, Ohio", "Title": "“Smeraldo - Rome hotel”", "Author": "muisc00man", "ReviewID": "UR115388443", "Content": "This is a great hotel -- the staff is wonderfull, price includes breakfest, within waking distance of many attractions and the local flea market; where you can buy fruits and some other touristy things. It's less then 1/4 mile from the river there are many vendors there along the river if your into that kinda thing. Don't forget to haggle on the price. Also would like to say Taxi was 12 euro 17 usa from train station to hotel for 3 people. Don't let anyone fool you. Had taxi drivers asking for 35euros 49 USA be patient and you will save money. Ron", "Date": "July 15, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "4", "Overall": "4.0", "Value": "5", "Service": "4"}, "AuthorLocation": "Missoula, Montana", "Title": "“Great Location, lots of stairs!!”", "Author": "MTMama1960", "ReviewID": "UR115198093", "Content": "We were a family of 8 when we visited and had 2 singles and 2 triples. The rooms were great, quiet, and clean. The hair dryer in our room didn't work, but I have learned to bring my own with me when traveling anywhere. Make sure you have a round two-prong adapter for electronic devices of any kind. The showers were small, in the corner of the bathroom, but it's Europe! If you have problems with stairs - be warned. There is a small elevator that reportedly holds three people, but you have to get very cozy to fit. One person with luggage fills it. Otherwise, there are stairs. The breakfast room is in the basement, down more stairs. We loved the location of the hotel, even though it was hard to find initially. We were in short walking distance to Campo di Fiore, Piazza Navona, the Pantheon, Trevi Fountain, the Forum and a little bit further to the Vatican. We were close to places to eat - right across the \"alley\" and around the corner - shopping and sights. The staff was helpful, but a little detached, not quite as friendly as I would have hoped. We'll definitely stay here again!", "Date": "July 9, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "4", "Overall": "3.0", "Value": "4", "Service": "2"}, "AuthorLocation": "Olathe, Kansas", "Title": "“The location is great, Staff not as much.”", "Author": "mackenziemiller", "ReviewID": "UR115047315", "Content": "Hotel Smeraldo was one of three hotels at which my husband and I stayed during our recent trip to Italy. We stayed in two different rooms on different legs of our trip, and the first was very small, while the second was larger and more comfortable, but both were fine. The location of the hotel is great, central to the attractions of Rome and directly across from an amazing restaurant, a bakery, and a cafe. The rooftop garden is also wonderful. The staff, while moderately helpful, is not friendly and in fact seems to be bothered by requests most of the time. While I had read that this was an issue, on our last day my husband received treatment that crossed the line into rudeness, which started off our last day in Rome very badly. Overall a reasonably good hotel with a fabulous location and garden, but don't expect much out of the staff. Also, wi-fi is not only expensive (3 Euro a day), but only can be used by one device, and local calls to make dinner reservations are also at an additional cost.", "Date": "July 5, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "4", "Overall": "4.0", "Value": "4", "Service": "5"}, "AuthorLocation": "Yucaipa, California", "Title": "“Good hotel at a good price”", "Author": "arcoccia", "ReviewID": "UR114986659", "Content": "This is our 3rd stay at the Smeraldo and as always we have found it to be just as before a good hotel at a good price. We travel every year across Europe, and this hotel for the price is as good as any! The rooms can't have very much light because of where the building sits,but this in the heart of medival Rome,a short walk form the Pantheon and many other sites,so I can turn on a light! The staff at the breakfast buffet ,were not Miss sunshine,but they were professional, helpful and kept the buffet full,what more can a guest ask! We spoke with the staff one morning and they mentioned tripadvisor and the review about the service,the fact that this bothered them should tell you about how they care about the service they provide. Maybe this hotel is not for everyone,but it is definately for us!", "Date": "July 3, 2011"}, {"Ratings": {"Cleanliness": "2", "Sleep Quality": "3", "Overall": "2.0", "Value": "1", "Service": "3"}, "AuthorLocation": "Washington State", "Title": "“I have very mixed feelings about this hotel...”", "Author": "lolo51", "ReviewID": "UR114878225", "Content": "I will begin with the positive, which is very little. We drove our car from Florence to Rome (a mistake we will NEVER make again!) and decided on the drive that we wanted to go directly to the Hertz Return at the airport to return the car. Originally, my husband was going to drop me at the hotel, then return the car. Words cannot describe how glad we were to NOT have done that as this hotel is in a very obscure location and we would probably still be driving around trying to find it. I digress - we called the hotel and asked if they could help us get a ride from the airport to the hotel. No problem, he couldn't have been more helpful. Best 50 euros ($75 US) we spent on the trip. I will say, however, that the initial contact on the phone was less than hopeful as communication was a bit challenging, but once he found our name on the roster, things got better. That's the positive. I agree wholeheartedly with the other reviews and all their criticisms. This hotel is wildly overpriced and the one reviewer must have had the same room as we did as our bathroom also smelled like urine. The room was adequate, at best. Dreary furnishings, etc. Bed was OK, and we really didn't complain of the room's size as we had just spent 10 days in France where the rooms barely hold the bed! The one gentleman at the front desk was nice, but there was one who was quite abrupt and often rude. We were on the 4th floor right next to the \"terrace\". I don't know what views the terrace provided, but it certainly was not the skyline of Rome! And I also don't know where the wine glasses, candles, etc., came from. There was no service on the terrace. It was small, and frankly annoying being so close to our room #406. The voices carried and we were tired after a long day of touring the city. Other than the urine smell in the bathroom, I really can't complain about the housekeeping. They changed our towels every day, which surprised us. We travel all the time both on business and pleasure, and we were shocked that water conservation was not considered. The only truly friendly employee of the hotel was a young man in the housekeeping department who greeted us every morning with a smiling face. We appreciated that as it all changed as you descended into the bowels of the hotel to the dining room. That is, without a doubt, the most unhappy, unfriendly, unsmiling, miserable staff of women I have ever encountered in our travels. No smile, no good morning, no nothing but glares. You were asked your room number, which baffled us as the buffet was included, and then the back was turned on you and that was the last dealings you had with the most miserable woman on the planet. Don't ask for a cappucino - the look you'll get - phew! And they are terrible to boot. The buffet was standard European fare, nothing to write home about. Oh yeh, this was the only hotel we stayed at on our three week trip that charged for internet use - 10 euros!! All in all, we will never return to this hotel. Poor location, really, all things considered, and way, way overpriced.", "Date": "June 29, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "3", "Overall": "3.0", "Value": "4", "Service": "3"}, "AuthorLocation": "Seattle, WA", "Title": "“Can't beat the location”", "Author": "comingtoyourcity", "ReviewID": "UR114852584", "Content": "This is the 2nd year in a row our group has stayed here and it’s mainly because of the amazing location 2 minutes away from Campo di Fiori and the price. This isn’t the greatest hotel but for the price and location, it works. The people at the front desk are okay – some are very helpful and some not so much. The rooms fit 1, 2 or 3 people. The beds are good – not great. Each room does have air conditioning, which is a plus. The walls in the room as thin and you can hear everything that happens in the bathroom. We have a bunch of 17 year olds in our group. The breakfast has a lot to offer and we had a lot of boys in our group and they like to eat and liked the selection and quantity available. The wi-fi isn't worth it and didn't work well. We’ll most likely stay there again.", "Date": "June 28, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Location": "2", "Rooms": "1"}, "AuthorLocation": "", "Title": "“Stay away from this Hotel!”", "Author": "Anonois", "ReviewID": "UR114729486", "Content": "This was the most depressing and yet overpriced hotel I've stayed in any where in Europe (or Africa or Asia) for that matter. It was dingy, dirty, uncomfortable, cramped, And noisy. The beds were like cardboard, the rooms were not just plain, but grubby, and the staff unhelpful. The price was only 9 euros less than am excellent 4 star hotel. There is no reason to stay here. Save yourself. There are many charming places in Rome, but this is definitely not one of them.", "Date": "June 25, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "3", "Overall": "3.0", "Value": "4", "Service": "3"}, "AuthorLocation": "", "Title": "“Great Location-Clean-But Most Likely won't go back.”", "Author": "Darlenehixon", "ReviewID": "UR114649733", "Content": "This hotel was very clean and was located in a great location in the Pantheon area of Rome. Very accessible restaurants and wonderful little boutique shopping, near the nightlife of the Pantheon. Fabulous location. The hotel rooms however are overly small, very dark. Wi-fi is charged there per device, which is terribly goofy and ridiculous. Why not charge three euros more for the room and make it an amenity of the room. The breakfast was very good in a very nice dining room in the basement of the hotel. This hotel was not bad...it was just ok. We will most likely try to find another hotel in the same area next time.", "Date": "June 22, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "MEMPHIS TN", "Title": "“Good room for the price”", "Author": "SARAHMEMPHISTN", "ReviewID": "UR109116737", "Content": "Three of us spent one night at Smeraldo Hotel Rome. We were pleased with the room . It was a small room but we were in Rome! The location was great for what we wanted to see. The staff was very polite and accommodating. The breakfast was very generous with a lot of variety. We used the airport pickup service and it was money well spent . We would recommend this hotel to a friend and would stay there again.", "Date": "May 20, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Austin, Texas", "Title": "“Great Location”", "Author": "EuropeLover1891", "ReviewID": "UR108984472", "Content": "The location of this hotel is wonderful and the staff most helpful. Our room was just as it looked on the internet. There were wonderful places to eat and outdoor markets just around the corner. We were close to almost all the major sites and when we needed directions or transportation the staff helped with everything. On the day of our departure I spilled watermelon juice on my outer shirt. One of the cleaning staff took me to the roof and washed out the stain and pressed my shirt. Rome was amazing!! I wish we would have had more than 2 days in the city.", "Date": "May 19, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "3", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Eads, Tennessee", "Title": "“Excellent location & price”", "Author": "4tennessee", "ReviewID": "UR108679327", "Content": "The hotel was recommended to us by friends who had stayed there previously. Rooms in Rome can be very expensive & the Smeraldo is a reasonable price for Rome and the location is excellent. The staff was very helpful. We arrived with a good case of jet lag and they were very helpful and patient. The hotel arranged pick up at the airport and they were waiting for us when we arrived. After a long flight, we really appreciated the ease of having someone waiting to take us to the hotel. Breakfast was also included which was a plus. I would certainly stay at the Smeraldo again.", "Date": "May 17, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "3", "Rooms": "4", "Location": "5"}, "AuthorLocation": "London, Ontario", "Title": "“Perfect location, everything I had hoped”", "Author": "no3putt", "ReviewID": "UR108302431", "Content": "This hotel is in a great location to walk to all the many sights of Rome. In three days, we walked to the Vatican(longest, maybe 25 min) to Spanish Steps, Colosseum, Trastevere Piazza Navona, Campo di Fiori(very close)and points in between. The rooms are very clean, compact and the bathroom beautiful but tiny shower. We found the staff to be polite, efficient and very helpful. Our room on the 3rd floor faced out to the street and although it was fun to look out and watch the activity, sleeping was almost impossible as the noises on the narrow stone streets all move upward. So we inquired about moving to a room in the back and fortunately one was available on our last night. The staff were gracious and offered to move our luggage. This room was 107, had a small window into a tiny quiet courtyard and we had a very peaceful sleep. The breakfast was a good offering of continental style items, great for us but don't expect bacon and eggs. Overall, I would certainly recommend this hotel, good value, clean and terrific location. We loved our visit to Rome and Smeraldo fit the bill perfectly. Don't forget the rooftop terrace, not fancy but a quiet spot for a glass of wine and view the skyline. Great cafe across from front door and we had a terrfic meal at Le Maschere around the corner.", "Date": "May 15, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "3", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Hoboken, NJ", "Title": "“Our Place in Rome”", "Author": "Vasio", "ReviewID": "UR107962073", "Content": "The Smeraldo hotel is located in our favorite section of Rome near our favorite restaurants. It's not showy, fancy, luxurious or even pretty. But, damn they are priced right, and smack in the middle of the best part of Rome (in our opinion). The breakfast is forgettable, so forget it. Go out and explore your part of town for morning coffee. The hotel offers a taxi service to the airport, it came very late. The driver went 100 mph to get us to the airport. It was cheaper than a regular cab. The Best part of this hotel: Rosicoli is right downstairs. If you CAN afford a fancy hotel in Rome, god bless. The fancy place will set you back a ton of euro. Hotel Smeraldo is affordable and can't be beat for anybody who doesn't have cash to burn. I'd rather spend my money on more food! PS. they have a roof terrace with great views of a nearby church. Perfect for drinking wine and chilling after a day of pounding the pavement in the eternal city.", "Date": "May 12, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Philadelphia Suburbs", "Title": "“Great Again”", "Author": "MalvernGuy", "ReviewID": "UR107590506", "Content": "Stayed here 2 years ago same time and was just as good this time. Great location in old Rome, friendly and helpful staff, clean rooms, comfortable bed, decent breakfast, 2 nice rooftop areas. All at a good rate.", "Date": "May 9, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "No. California", "Title": "“Happy with our stay at the Smeraldo”", "Author": "readyinredding", "ReviewID": "UR106399408", "Content": "I don't write a lot of reviews but felt I had to write this one because of the negitive reviews I have read about this hotel. We chose this hotel as it was recommended by family who stayed there several years ago. After reading some of the reviews, we almost decided to cancel and book elsewhere. Well, we are very happy we did not. We were satisfied with our 5 night stay. 1. As mentioned the rooms are small. We were traveling with another couple and theirs was more spacious so not all rooms are the same. We were in the annex and on the 4th floor which had only the two rooms which was nice. Even though our room was on the small side, our closet was large enough that we unpacked and had room to put our suitcase away on the top shelf. The room was very clean and updated. 2. The location is terrific. It is very centrally located and we walked everywhere except to the Vatican, but that is doable as our family walked to it. It is in a wonderful neighborhood with several piazzas nearby and lots of restaurants and shopping. 3. The main reason I am writing is to address the statements about the staff. Our first impressions were that they were reserved, but polite. During our 5 day stay we had reason to have contact with them for several reasons and had very satisfactory results. My friend dropped 10 postcards into their mailbox in the lobby. The next day she realized she had not put enough postage on them. She explained this to the desk and they went out of their way to track down the cards (which had left the lobby but were still in the possession of the hotel management at another location) and get them back for my friend. Another day our camera had stopped working and we asked about where to purchase a new one. The gentleman behind the desk took the time to think about where to send us that would sell us a new camera at a reasonable price and gave us directions on how to get there. They also helped us find a place to have laundry done without once saying we should just have the hotel do it. One evening we were sitting in the lobby doing e-mail when a woman appeared (in her robe and slippers) with a glass in her hand. With hand on hip she said \"what is wrong with you Italians, I can't get ice anywhere in this country!\" The clerk walked around the desk, took her glass and went across the street to a cafe to get ice for her. When he returned he said \"madame, this is the way of Italy. When I visit America, I do not expect everything to be done for me the same as at home\" Well, good for him! My point is, maybe it is people with attitudes like hers that causes the staff to act less than friendly. I am not saying everyone acts this way and in fact know it is the minority, but none the less, we do reap what we sow. 4. The breakfast was more than adequate, with a good selection. The breakfast room is very pleasant. We stayed in 9 different locations on our month long trip and this was one of our more satisfactory breakfasts. We would not hesitate to book this hotel again if we should return to Rome. The rate was reasonable and we were happy with our stay-AND the staff!!", "Date": "May 1, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Location": "4", "Rooms": "4"}, "AuthorLocation": "Richmond, Virginia", "Title": "“So-So Hotel in Great Location”", "Author": "A3Porsche", "ReviewID": "UR105979049", "Content": "The hotel was pretty average. Cramped bedrooms and bathrooms. Breakfast wasn't so great either. Staff wasn't the friendliest we encountered on the trip. But it was decent price in a GREAT location!", "Date": "April 28, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Milwaukee, WI", "Title": "“Great Location”", "Author": "Keegan_HCWI", "ReviewID": "UR104844843", "Content": "We stayed at the Smeraldo Hotel for 5 nights while visiting Rome. The location was perfect. Close to the bus system, the Pantheon and shopping. The room itself was clean and comfortable, although on the small side. The continental breakfast had a good variety of pastries, cheeses, cereal, etc.", "Date": "April 20, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "2", "Overall": "1.0", "Value": "2", "Sleep Quality": "1", "Rooms": "2", "Location": "5"}, "AuthorLocation": "Seattle, Washington", "Title": "“Disappointing... bug alert!”", "Author": "cjwms71", "ReviewID": "UR104829252", "Content": "We stayed at this hotel at the recommendation a friend who was a longtime resident of Rome and a frequent traveler. He said the hotel was wonderfully located--which it is--and that it was a great value. Charming, family run, with a friendly staff. We booked a room for three nights. Alas, that was not our experience at all. Quite the opposite. The staff was not friendly or helpful, even when we presented ourselves to them after our first night with the tell tale signs of bed bug bites on our bodies. To be fair, we cannot be certain that the bites we had were from bed bugs, as we did not see any in the room during our brief stay there. That said, the bites were text book, and they appeared after our only night in the hotel. We quickly decided to leave the hotel, but we also reported the issue to the staff. They offered to move us to a new room, but that was it. We checked out, but they charged us 50% of the room rate for the second night, and offered no refund for the first. They later agreed to refund the second night, but I have yet to see the refund posted to our credit card. Avoid the Smeraldo.", "Date": "April 20, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Location": "4", "Rooms": "1"}, "AuthorLocation": "", "Title": "“Well located dump”", "Author": "Josl71", "ReviewID": "UR101658339", "Content": "Avoid this place if you are not a local. Every single staff member was rude to all tourists, we were greeted with someone demanding an explanation about why we hadn't checked our email in the last few days (I don't know, maybe because I'm on vacation??), the keys to our room were almost thrown at us, the room stunk of sewage and they refused to give us another one even though they were not full. We learned this the next day when they were shocked to see my wife and I leaving first thing in the morning... That's when they mentioned they could have moved us the night before, which of course made things worse. It is supposed to be non-smoke and the next day we overheard another guest complaining about cigar smoke entering her room all night. The only thing they have going is the centric location, but overall, it's really not worth it. AVOID!!!", "Date": "March 26, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Ohio", "Title": "“Perfect Location”", "Author": "RamblersOhio", "ReviewID": "UR100398255", "Content": "We felt in the center of everything we wanted to see. It's just a short walk to Campo di Fiore and near the bridge to Trastavere. The staff was helpful, but don't try to ask them questions when they are checking in people and checking out others (early in the morning, generally). During the day, when they have a bit of down time is the best time to ask. We stayed a week, but didn't go up to the rooftop area until the last day--that was a mistake. Do it early and often. The worker in charge kicked us out a bit early (7:45 p.m. instead of 8 p.m.), but that was OK too. Yes, rooms are small, but why stay in the room? Breakfast was standard OK. Be sure if you take the hotel-recommended taxi to the airport that the drivers knows you know it should be 45 Euro. Ours had the meter on and it ended up being 48. Cabs from the airport at the stand are perfect (Rome City cabs) and it was 40 euro, which was less than we thought it was.", "Date": "March 16, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Boston, Massachusetts", "Title": "“Best Accommodations”", "Author": "Kelloll", "ReviewID": "UR100011727", "Content": "The staff at the Hotel Smeraldo was very accommodating. We connected especially with one gentleman who was on the front desk evenings during our stay. The hotel was clean, our room was spotless every day, fresh towels daily, and the complimentary breakfast very good. Our room was ready when we arrived at 9:30 AM so we could check in and start our exploration of Rome early. The hotel was in a very convenient location and we could walk everywhere. Only downside - our room was located on the street and was a little noisy.", "Date": "March 13, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "3.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Austin, Texas", "Title": "“Great Location”", "Author": "ConnieGroh", "ReviewID": "UR96973894", "Content": "The hotel was clean, front desk service was sometimes great and sometimes not so friendly. Breakfast was very good. The internet service was extra and is per PERSON not per room, so if you have more than one person, you will have to share a computer or pay for more than one.", "Date": "February 17, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Minnesota City, Minnesota", "Title": "“Desk service is poor, location good, clean.”", "Author": "DontwaitMn", "ReviewID": "UR88277799", "Content": "Stayed in Oct 2010. Multiple people at the front desk were not helpful in any way. I had written hem about getting soccer game tickets prior to arrival. They said they can help when we arrive. After arrival I asked about this when I arrived and someone said I couldn't get them. Then another desk person later said I could just go to the stadium. After arrival at the stadium I found out that they did not sell them there and I had to travel to another locaton about 4 KM away. I wish they would have said your on your own and they have no idea. I would have been more prepared. Every time I had a question about transportation or a question about the city I would get a short and generally unhelpful response. We also had a plugged toilet that I could not fix. I mentioned this to the staff and they seemed to get pissed off. If they could just give me a plunger, I could have solved it. The rest of hotel features were adequate to good. The breakfast was basic, nothing special but did the job. The location was very good. The room was well cleaned. The rooftop garden we went up to but never really used.", "Date": "November 26, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Frisco, Texas", "Title": "“Clean, Cozy, Quiet, Convenient”", "Author": "Mary4343", "ReviewID": "UR87378028", "Content": "Hotel Smeraldo met our needs. It was very clean and quiet. The room was small, but we were sight-seeing all day. The tiny bathroom was recently renovated... covered in marble. The free breakfast was EXCELLENT. Our twin beds were firm. We discovered the best bakery in Rome, just a few steps from the hotel entrance. The city bus and hop-on-hop-off tourist bus was three short blocks away. The hotel is One hop-on-hop-off bus stop from St. Peter's Basicila and TWO stops from the entrance to the Vatican Museum. Hotel Smeraldo sells tickets to the hop-on- hop-off bus. I've been to Rome four times and found many hotels cost a lot more than this one.", "Date": "November 17, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "3.0", "Value": "3", "Sleep Quality": "2", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Seattle, WA", "Title": "“Average hotel, perfect location”", "Author": "StacySeattle", "ReviewID": "UR86189268", "Content": "I know Rome pretty well and knew exactly what area I wanted to stay in - near the Campo de' Fiori. This hotel is about a 2 minute walk to the Campo, and therefore also very near everything else you'd want to see in central Rome. I'm a walker so I considered everything \"walking distance\". The hotel and room were very clean. The cleaning staff do a great job and I saw them working really hard every time I walked into and out of the hotel. The front desk staff were for the most part very cold and unfriendly. During my 4 day stay I only got one smile from them. Some people say Italians are unfriendly, but that's just not true... I've stayed at plenty of pensiones and small hotels with extremely friendly and welcoming staff. They helped me with questions I had and were efficient with my check-in/check-out, so no complaints about the service itself. They have an elevator but don't count on it functioning if you really need it. 3 of the 4 days I was there it was out of service for at least part of the day. Not a big deal for me personally, but it might be an important point for elderly or disabled travelers. Breakfast was minimal, but the coffee was excellent. I usually supplemented with fresh fruit from the market on my way out to go exploring. The room was perfectly fine size-wise. As many previous posters have stated, you're in the central part of a European city so you shouldn't be expecting a large room. Besides, you really shouldn't be lingering in your room while in Rome anyway! The only negative I have about the room - and this isn't uncommon in Europe either - is that the bed was insanely hard. I like a hard mattress, but this felt like I was laying on a piece of plywood. Solution? Walk tons during the day, eat a large & lengthy dinner, enjoy a lot of fabulous Italian wine... and you'll be able to sleep anywhere! :)", "Date": "November 6, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "chicago, il", "Title": "“Good Value and Great Location”", "Author": "tgfield", "ReviewID": "UR85325170", "Content": "The best thing about this hotel is the great location. It is in a nice central location and we were easily able to walk around and see all the sites, even is in walking distance to the Vatican. Another perk of this location is it is near Piazza Navona and Campo de Fiori which are good places to grab dinner or drinks. As a lot of reviews say, yes, the rooms are very small. We could not open both of our suitcases, but this didn't bother us at all, you have to realize this is a hotel in a large European city. The rooms were very clean and quiet. The hotel staff was fine. They maybe werent as personable as some other places we stayed in italy, but they were efficient and helpful enough when we asked for assistance. Overall good place, we would certainly recommend this hotel.", "Date": "October 30, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Boise", "Title": "“Great location, helpful staff, awesome.”", "Author": "MinIdaho", "ReviewID": "UR83708786", "Content": "Here is my short to the point review: Eat breakfast next door at bar rosanna. Best coffee ever. Rome is a large city the rooms will be smaller than you are use to but that is part of the fun. Go get your lunch at campo every morning it is only a 2 minute walk and a great experiance. For people that complain about internet access, you are on vacation. If you really need it ask for it. They are not opposed to it but they hate all the forms they have to fill out. As one person said it is the management. Bottom line: great location, clean, awesome locals and you will want to come back.", "Date": "October 16, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Cork", "Title": "“Good hotel in a great location”", "Author": "ManByTheLee", "ReviewID": "UR83233637", "Content": "Hotel is in a great location on a quiet street, two minutes from Campo de Fiori. We had a three bedded room for the two of us so the additional bed gave us plenty of space for our cases. The room and bathroom were very clean. Breakfast was ok but to be fair there was a good selection of food and you could eat as much as you like. The staff were very helpful. I look forward to staying there again", "Date": "October 12, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "3", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Cambridge, Massachusetts", "Title": "“the location was great..”", "Author": "Sutanuka", "ReviewID": "UR79928044", "Content": "The rooms were a bit smaller than what we'd imagined however the location was excellent. It was so convenient. The rooms were clean and comfortable.", "Date": "September 17, 2010"}, {"Ratings": {"Overall": "3.0"}, "AuthorLocation": "london", "Title": "“Very good position and clean roooms”", "Author": "bluff42", "ReviewID": "UR79085705", "Content": "We stayed at this hotel for my mother and fathers 70th birthday trip to Rome. The hotel was very well located for all the sites and although the rooms were compact they were clean and tidy and perfect for the job. There was a little roof terrace where you could sit out and enjoy a glass of wine before dinner. Most of the staff were very helpful apart from one man who was a bit grumpy, but then this is Italy ! The only disappointing thing wsa that the wi-fi was only available in the lobby seating area and not in the rooms. I would stay there again", "Date": "September 11, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Vancouver, Canada", "Title": "“Great location”", "Author": "gypsyontour", "ReviewID": "UR78678109", "Content": "I stayed at the Smeraldo Hotel in August and it was great. I would highly recommend staying here. The price was reasonable for Rome, the location was fantastic close to Plaza Campo de Fiori, Jewish Ghetto and Trastevere. This area is fantastic for restaurants and nightlife and because taxis cost more in the evening its better to stay in this area at night and visit the other places during the day (everything is still walking distance) The hotel's wireless wasn't very good and it wasn't free, but there are several options nearby. The breakfast was good (although the coffee could be better) but overall the rooms were clean, air conditioning worked well and the staff were nice.", "Date": "September 7, 2010"}, {"Ratings": {"Service": "2", "Cleanliness": "4", "Overall": "3.0", "Value": "5", "Sleep Quality": "2", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Atlanta, GA USA", "Title": "“Good location and value”", "Author": "BuzzDR", "ReviewID": "UR76527957", "Content": "Pros: The location is great and the cost was very reasonable for Rome. The lobby and the rooms were very clean, and the air conditioning worked very well. Our room was very quiet, with no street noise or noise from other customers. Cons: The staff was not helpful and seemed annoyed when we asked them questions (this was in sharp contrast to everywhere else we stayed in Italy). The included breakfast was average (the coffee, in a country of wonderful coffee, was awful). The beds were not great.", "Date": "August 23, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "5"}, "AuthorLocation": "London", "Title": "“Good value centrally located”", "Author": "Bartramboy", "ReviewID": "UR75877229", "Content": "Excellent value for Rome and great location. Room size was adequate and appeared to be recently refurbished. Breakfast was standard continental fare however with undrinkable coffee. The elderly lady helping out in the morning is the star of the establishment. Downside was staff at reception, who on the whole are a miserable bunch, reluctant to smile and when asking them for info you always had the feeling that you were interupting them, as opposed to them being there to help you. I also asked them for the nearest internet cafe, they gave me vague directions and declined to tell me that there was a computer (pre-paid cards only) hidden away in the lobby, which I discovered on our departure.", "Date": "August 19, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Clifton Park, NY", "Title": "“Perfect location at a terrific cost”", "Author": "PeterKalish", "ReviewID": "UR75160141", "Content": "We traveled to the hotel from the airport. The logistics couldn't be easier. We took a train to the Trestevere station and a tram to the Argentina stop. The hotel was two short blocks directly off the tram stop. Even with bags, it was an easy trip to the hotel. We found the room to be comfortable, although very small for a double. Our suitcases had to be placed on the floor next to the bed and we had to step over them to reach the bathroom. The bathroom was tiled in marble and was immaculate. The shower was small, but worked just fine. And the air conditioner worked great (thankfully, as the temperature was extreme during our visit). The hotel staff were helpful and the breakfast was average. We tried using the computer in the lobby for internet access (at a small cost), but it didn't work. The hotel was within 15 minute walk from the Vatican, the Forum and the Spanish Steps. It was right in the middle of everything, so we were very happy about our choice.", "Date": "August 14, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "3.0", "Value": "1", "Sleep Quality": "3", "Rooms": "2", "Location": "5"}, "AuthorLocation": "Seal Beach, California", "Title": "“Disappointed”", "Author": "MRPlayter", "ReviewID": "UR72605699", "Content": "This hotel had a good location in Rome, but the room was SMALL, the front desk never smiled, it was over-priced, but worst of all, our friends were bumped and sent to another hotel that was awful.", "Date": "July 27, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Manitowoc, Wisconsin", "Title": "“Great location and hotel!”", "Author": "muzikjunky", "ReviewID": "UR72078524", "Content": "The service was nice, the room was even better. It is located by Campo de Fiori so you can easily find fruits and vegatables and cheeses for lunch. The market stand people were very helpful even if you spoke the tiniest bit of Italian. Our internet didn't work at first (after going back to the room to get cash to pay) so the front dest staff helped for at least 20 minutes to get it going. They arranged a taxi to the airport, that was very much worth it. The breakfast was wonderful. There were plenty of sweets, yogurts, cereals, meats and drinks.", "Date": "July 23, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Dallas, Texas", "Title": "“Great Place in the heart of the Ancient City”", "Author": "architerp", "ReviewID": "UR70813036", "Content": "Albergo Smeraldo is a nice quaint little hotel in the heart of Rome for a great price. Nice clean room though your basic small euoprean hotel room. The staff was pleasant and the breakfast was a bit above average for these types of hotels. I had a single room which upon checking in, I found had a small semi-private terrace. The main roof terrace is also nice, though I did not spend much time out there. I chose this hotel for its location near the Campo dei Fiori which is one of my favorite neighborhoods. Walking distance to just about everything, Trastevere, the Pantheon, Piazza Novona, and the Forum. And, it is in a less touristy part of town which allows me to pretend I am a local, if only for just a couple of days.", "Date": "July 13, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Austin, Texas", "Title": "“Great Rome Location, OK room”", "Author": "JrMushroom", "ReviewID": "UR69782508", "Content": "The location is great, and correspondingly expensive for what you get. The shower was really small, and the bed not too comfortable. This is the only place I've stayed in Rome, so I don't know how it compares. The double-paned french windows are a nice touch; shutting them reduced the noise level of the street quite well. The roof garden isn't much. We had the breakfast once; but with such great coffee and pastry everywhere- what's the point? The staff was helpful when pressed!", "Date": "July 5, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Leeds, UK", "Title": "“Really nice hotel - great value”", "Author": "Bradford_City_Fan", "ReviewID": "UR68238918", "Content": "Spent a Saturday night here during a recent sightseeing trip to Rome. The hotel is off the main roads, at a corner of two typical cobbled Roman back-streets. It's a great base for exploring the centro storico, the area around Campo dei Fiori and the ghetto. The room was comfortable and clean, with decent aircon and a powerful, hot shower. The (English-speaking) service was friendly and very helpful. Staff were happy to call us a cab and let us leave our luggage for a few hours after we had checked out. As you'd expect at this price, no room-service or mini-bar, but there is a reasonably-priced vending machine in reception selling water, soft drinks and beer (and a nice little local bar opposite). Breakfast included decent fresh coffee, juice and bread / pastries. Nothing special but absolutely fine. I wouldn't hesitate to recommend it.", "Date": "June 21, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Mount Angel, Oregon", "Title": "“Perfection, the staff was marvelous as were the rooms.”", "Author": "TravelGramma52", "ReviewID": "UR63778800", "Content": "Though the rooms are small, they are so well planned and decorated that there was nothing missing. The location couldn't have been better.", "Date": "May 10, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "3", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Idaho", "Title": "“Quaint”", "Author": "Roena", "ReviewID": "UR60059932", "Content": "We loved this hotel. It was on a narrow street right in the heart of Rome. The hotel was clean with a responsive staff. The office staff had a city map on the counter and when we asked for directions they would pull out a pen and circle \"you are here\" and draw the path for us to walk. The woodwork on the walls was absolutely beautiful. We walked to everything in the heart of the city. We were served a complete breakfast every morning which included very good strong coffee, Italian pastries, cereal and fruit juice. Internet was an extra charge.", "Date": "March 31, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Utrecht", "Title": "“Good room, great location, worth every penny.”", "Author": "Tjall49", "ReviewID": "UR58601743", "Content": "In a quiet street, in the old center of Rome. Great for easy walking to all the highlights. Good beds, no street-noise at all. Simple but fine breakfast. Good rooms, enough space, clean, good shower, nice atmosphere. I'll be back!", "Date": "March 15, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "4.0", "Value": "3", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Salvador, BA", "Title": "“I recommend it! Location couldn´t be better!”", "Author": "Ana_bbr", "ReviewID": "UR56670522", "Content": "We stayed at the \"Dipendenza Smeraldo\" just around the corner from the main hotel and it was really nice! The building was renovated and had new rooms. We had our room cleaned everyday. The room size was nice and the staff was very polite. The location is excellent (campo de fiori), near to the main touristic points(you can go walking or by bus), next to bars and nice restaurants. I don´t know how the main hotel rooms are but I definatelly recomend the Dipendenza Hotel!", "Date": "February 21, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "4", "Sleep Quality": "3", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Newtown, Pennsylvania", "Title": "“Nice location - rude staff”", "Author": "Jennyxobu", "ReviewID": "UR55484355", "Content": "I liked the prime location and rates at this hotel so I guess I can't really complain too much. However, the staff was extremely rude and unhelpful. The hotel has an elevator but only lets you use during certain hours (regardless of whether you are carrying luggage or not). They do not offer to help with your luggage when they do not allow you to use the elevator and the rooms were not the cleanest in the world (but were satisfactory). However, on rate and location alone, this place is good. If you are not planning to spend a lot of time in the room, it is the perfect place.", "Date": "February 8, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Location": "5", "Rooms": "3"}, "AuthorLocation": "New York City, New York", "Title": "“Adorable but loud and small. Can't imagine a better location.”", "Author": "RomoRomo", "ReviewID": "UR52321147", "Content": "Outstanding location, a pizza throw from Campo De Fiore, and very close to necessary buses and trams. Stayed here for 3 nights based on a friend's recommendation. The room was small but ADORABLE. Was a great example of how much nice design can make up for a small space. Room seemed recently renovated, with marble floors and flat-screen TV. It was spotless and everything worked properly. Major problem I had was the noise... not from partying guests or outside, but from the thin door and those marble floors --could hear everything going on in the hall and water running through the pipes. Woke me up a couple times. Also found the 5 euro/hour of wifi access to be maddening --may be a Europe thing, but seemed like a bum deal. Free breakfast was modest but had good coffee and friendly service. Arranged with hotel for airport pickup, which was expensive but convenient. I don't know if a regular taxi driver would find this place, as it's on a small side street. Tiny elevator and no help with luggage. Desk service was not terribly friendly, but got me where I needed to go. It wouldn't be so bad if I had to stay here again, but I'd look for other options in the area to see if anything's better at this price range. And I'll bring earplugs and/or a runner carpet for the hallway.", "Date": "January 1, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Location": "4", "Rooms": "2"}, "AuthorLocation": "Salt Lake City, Utah", "Title": "“Very quiet but the worst bed ever!”", "Author": "MarybethJ", "ReviewID": "UR51405610", "Content": "The double-pane windows were very appreciated, as the room was extremely quiet. For a room in central Rome, it was also quite large with plenty of room to wheel our luggage around. It was nice to have all that space. However, the springs in the bed could be felt throughout the entire surface of the mattress, so it was like laying on top of some sort of torture device. Just horrible. The hotel is nicely situated, clean, offers a substantial breakfast (and they made me a cappuccino), but when you're traveling, you must be able to sleep well. This hotel must replace these awful beds. There was also a sewer-type smell emerging from the bathroom, but this was solved by leaving the fan on and the bathroom door closed all night.", "Date": "December 17, 2009"}, {"Ratings": {"Service": "2", "Cleanliness": "4", "Overall": "3.0", "Value": "4", "Location": "5", "Rooms": "3"}, "AuthorLocation": "connecticut", "Title": "“Great Location”", "Author": "11travellers", "ReviewID": "UR49654487", "Content": "We had only one day in Rome before leaving for Umbria and chose this hotel for its location. The location did not disappoint; it was perfect and the price was reasonable. The staff was OK, breakfast was sufficient but the noise in the street kept us awake a good part of the night. I would recommend the hotel but suggest that you request a rear room.", "Date": "November 20, 2009"}, {"Ratings": {"Service": "2", "Cleanliness": "4", "Overall": "3.0", "Value": "4", "Location": "5", "Rooms": "3"}, "AuthorLocation": "Scotland", "Title": "“Wonderful location”", "Author": "scottie8scotlans", "ReviewID": "UR48695221", "Content": "Small room but very clean and everything worked, heating included. Desk staff perfectly pleasant and helpful. For the location this hotel represents excellent value for money.", "Date": "November 7, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Sacramento CA", "Title": "“Awesome Historic center location”", "Author": "Travelingotter", "ReviewID": "UR47667768", "Content": "We stayed here Oct. 14-19 - great room with windows opening to street - could hear the church bells. Once you closed the windows you could not hear the street noise. Very centrally located - easy walk to Campo De Fiori, Piazza Navonna, Pantheon and Trevi. Staff was great in helping us with questions or calling for Taxis. Taxi's had a hard time finding hotel to take us back - what worked well was having a map showing the location of the hotel - some taxi's had GPS that was a blessing. Great little bakery around the corner, restaurant across the street. We would definitely stay here again. Shower was cramped but the rest of the room was good and clean. Had a small elevator. Breakfast was Ok - nothing spectacular no fruit nor eggs but they did have ham, cheese, pound cake, hard rolls, toast, juice, coffee etc.", "Date": "October 24, 2009"}, {"Ratings": {"Service": "1", "Cleanliness": "5", "Overall": "3.0", "Value": "2", "Location": "5", "Rooms": "3"}, "AuthorLocation": "Central Coast, California", "Title": "“Could have been better”", "Author": "CarmelJuan", "ReviewID": "UR47173989", "Content": "Just returned from a 3 night stay at Albergo Smeraldo. As others have noted the location of the hotel couldn't be better for sight seeing in ancient Rome. The positives for this hotel are it's location, cleanliness and price. I would rate this hotel as very good or even excellent if it were not for it's rude front desk staff. Every interaction I had with this staff was unpleasant. The prevailing attitude was that they were doing me a favor by letting me stay at their hotel and that any question or request that I had was an annoyance to them. Not even a simple \"Grazie\" when we checked out. The next time I'm in Rome I'll be staying somewhere else.", "Date": "October 18, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Location": "5", "Rooms": "4"}, "AuthorLocation": "", "Title": "“Fantastic location and comfortable rooms”", "Author": "CaptainSubtext79", "ReviewID": "UR44116968", "Content": "We had a great stay at the Hotel Smeraldo. It's a \"no frills\" hotel, but the rooms were clean, the bed was comfortable, the staff was friendly and helpful, the hotel was safe and quiet, and the location is GREAT. If you are looking for a posh, elegant hotel with lots of amenities then this is not the hotel for you. But if you are looking for a safe, quiet, comfortable hotel in the heart of Rome then look no further! We didn't plan on spending much time awake in our hotel room, so this is all we were looking for. For Rome, we felt the price was competitive for what we were looking for. And the location is hard to beat: 5 minute walk to Campo de' Fiori, 7 to Piazza Navona, 10 to Piazza Venezia, 20 to the Roman Forum, etc. We were impressed with how accessible everything was. We would likely stay at this hotel again the next time we came to Rome (which is hopefully sooner rather than later!). We found it to be a good value.", "Date": "September 24, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "3"}, "AuthorLocation": "Santa Fe, NM", "Title": "“Excellent location and great value”", "Author": "SusanLarson27", "ReviewID": "UR41366295", "Content": "The Smeraldo is perfectly located near the Campo di Fiore and in central Rome. We knew the rooms were small and this was not a hindrance as the bathrooms are nicely updated and an elevator is available to reach upper rooms. It was quiet and the front desk staff were most pleasant and knowledgeable. All in all, excellent value and without a doubt, we would book here again.", "Date": "September 13, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "3", "Location": "5", "Rooms": "3"}, "AuthorLocation": "england", "Title": "“perfect location”", "Author": "golfdrive20", "ReviewID": "UR41248305", "Content": "Great find for a stay in rome, hotel is clean and staff are helpful and friendly, yes the rooms can be a bit small but they are perfectly adequate. The thing that puts this hotel up there is the location, large square 3 minutes walk away has plenty of bars, cafes and restuarants and all the main attractions really are within walking distance or short taxi ride.", "Date": "September 13, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Atlanta, Georiga", "Title": "“Nice basic and clean rooms, great location”", "Author": "GradSchool_09", "ReviewID": "UR38261662", "Content": "Stayed at Smeraldo for 4 nights in August of 2009. Had some pretty hot weather, so we were thankful that the hotel had AC (kept us quite comfortable at night). Hotel is pretty basic. Clean room and bathroom. AC and TV. Internet is available, small on site computer station in lobby and wifi are available. Cost is extra to get on the internet- buy card at front desk. Great location, just steps from Campo de' Fiori and Piazza Navona. Also, a great bakery is just across the street from the hotel. So be sure to check that our for breakfast and/or lunch. Hotel is a short walk or bus ride to the sites. The Largo Argentina bus stop is only a few blocks from the hotel. Bus 64 and 40 are great routes. Also, within easy walking distance to the Vatican (10-15 minute walk). Front desk staff was helpful, booked us transport to airport. No problem. Only disappointing thing about hotel was its roof terrace. Not very nice, poor view. All and all and good basic, clean place to stay. Excellent homebase to explore the city (good value).", "Date": "August 20, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Boston", "Title": "“Excellant location and great stay”", "Author": "keeper616", "ReviewID": "UR36186189", "Content": "I wasn't sure what to expect after reading the mixed reviews, but I am so happy I booked this hotel. The room was spotless. The room was cleaned and fresh towels were brought everyday. The staff was efficient and helpful whenever I had any sort of request. The price on venere was superb and I could not have asked for a better location! I will definitely stay here again if I ever visit Rome again.", "Date": "July 29, 2009"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Seattle", "Title": "“Walk everywhere from Smeraldo”", "Author": "MONichols", "ReviewID": "UR35711969", "Content": "This is our third stay at the Hotel Smeraldo. As usual, it was just great. We had two twin rooms, just down the hall from each other. They were impeccably clean and the air conditioning was worth the price of the stay. Each day we walked to sights, the \"Roman Shuffle\" as it's called. We came back in the afternoons for a nap in the air conditioned rooms, then at dusk headed out the door for the great restaurants in Piazza Navona (Don Quixote is our favorite) and Campo di Fiore (we loved the namesake at the Carbonara). Both of these nighttime hot spots were less than a 5 minute walk from this hotel. Ignore the grafitti in the neighborhood and head for the Smeraldo. The front desk people are very nice if you remember this is not a concierge desk as in a 4 star luxury hotel. If they could improve the mattresses, it would be worth the extra $$$$.", "Date": "July 24, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Location": "4", "Rooms": "3"}, "AuthorLocation": "Cph", "Title": "“Can only recomend this hotel”", "Author": "Nika2005", "ReviewID": "UR35225580", "Content": "Can recomend this hotel for your stay in Rome - perfect location for most sights - rooms are not large ( we were 3 in 1 room) but then we knew that in advance and we didt go to Rome to stay in the room. Can recommend the breakfast as well - hear a lot about poor breakfast in Rome - but we found 7 euro a good buy compared to what we alternatively paid at a cafe on Campo di Fiori. Reception always seemed very busy - bur then we only needed then to hand our keys - great value for money at this hotel - would without doubt stay here again. We had a room to a backyard - so there was no noise from the streets.", "Date": "July 20, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Location": "5", "Rooms": "3"}, "AuthorLocation": "Darlington", "Title": "“Stay here! you wont be disappointed!”", "Author": "Misslollyd", "ReviewID": "UR34998221", "Content": "I checked out this hotel before booking my latest trip to Rome (have been twice before) and was abit undecided as the reviews were not great and not very recent...however me and my travelling buddie decided to take the plunge! well we decided to stay in the sister hotel which is just across the way but you deal with the smeraldo for reception etc. So glad we choosed this hotel for the following reasons it was clean, rooms were not massive but enough space for everything, towels were changed daily and room was tidied everyday which was fab, extra pillows and loads of coat hangers (which is a must for us girlies) Reception staff did seem abit stand offish at first but that soon improved. Overall I think you cannot beat this hotel for price and its fab location (just round the corner from the buzzing piazza) Would definately stay here again!", "Date": "July 17, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "2", "Overall": "3.0", "Value": "3", "Location": "4", "Rooms": "2"}, "AuthorLocation": "Los Angeles, CA", "Title": "“You can do better for the price”", "Author": "Jdr1637", "ReviewID": "UR32147889", "Content": "We stayed here at the end of our Italian trip, so its shortcomings were probably heightened in comparison with our other lodgings. The room was small and had a bad odor. The staff was minimally friendly and even gave out false information like \"No, churches aren't closed between 12 and 4.\" They are. There's a dorm, hostel feel to the place. I expected little considering the low price, but it didn't even reach my already low expectations. The location is wonderful, steps from Campo di Fiori, and the hidden aspect of the hotel -- it's located in an alley -- are definite pluses, but I believe there are better options for the money.", "Date": "June 11, 2009"}, {"Ratings": {"Service": "1", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Location": "3", "Rooms": "3"}, "AuthorLocation": "Atlanta", "Title": "“Bare bones”", "Author": "giveittomestratight", "ReviewID": "UR31669573", "Content": "I stayed at this hotel for three nights from May 29th through June 1st. It is situated close to the Campo De Fiori and Largo Argentina. The hotel is clean and the triple room had a good layout. with two beds in one area and one bed in a separate area through a hall, bathroom in the middle. The rooms are small and simple. The beds are hard. There's nothing in terms of decoration. The closets are newly buitl and very adequate, they are armoires with shelves and space to hang clothes and put your suitcase in. Small televisions in each room. The bathroom is fine, I think all bathrooms in Rome are made of marble which makes them superior to the rooms. The decor in the hotel is bare bones. The wi-fi service is only avaialbe for 5 euro per hour from the lobby, not the rooms. The terrace closes at 8:00 so we never got to see it. There is a nice restaurant in front of the hotel, trattoria moderna, which was a nice surprise. It doesn't look like much but the food was delicious. The coffee and desserts were great too. Breakfast at the hotel is okay. The service is not up to par, they really look annoyed of having to serve their patrons. I needed ice for my mother who had a swollen ankle and they said they didn't have an ice machine and to try at the restaurant in front of the hotel. There was a great shop for cheese, wine and prosciutto behind te hotel, I think the name was Rosciolli. I had a completely different experience at the hotel San Carlo near the Spanish Steps, very attentive. Of course I paid a higher price. I would not recommend this hotel to freinds or family.", "Date": "June 5, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Westwood, MA", "Title": "“This hotel is perfectly located, comfortable, and very clean.”", "Author": "Linda131", "ReviewID": "UR31337606", "Content": "We just returned from 7 nights at Hotel Smeraldo. The hotel is located within walking distance of essentially everything in Rome. It is around the corner from the Campo del Fiore with a street lined with shops, \"bars\" and vendors. The hotel has wi-fi in the lobby and provides a continental breakfast in a comfortable breakfast room. The rooms are small but very clean and the bathrooms (we stayed in two rooms) were immaculate. The windows are so soundproof we never heard any noise from the streets and the AC worked great. The location is really fabulous. We only took one bus, once, to Termini; we walked everywhere else! The staff isn't overly friendly, but they were very accommodating and were fluent in English.", "Date": "June 1, 2009"}, {"Ratings": {"Overall": "1.0", "Value": "2", "Service": "1", "Location": "4"}, "AuthorLocation": "Los Angeles", "Title": "“Disappointment”", "Author": "FrancesPatrick", "ReviewID": "UR30557267", "Content": "We recently returned from a 17 day trip to Italy. I used Rick Steves' guidebook to book hotels in Venice, Florence, Siena, Assisi and Rome. I chose the Smeraldo for location and price. We were to stay 6 nights, May 6 thru May 12. I e-mailed them directly on March 12,requesting a room. They answered promptly, with availabilty and price, advising that, \"to hold the room, send an e-mail with credit card number, information and authorization to withdraw the cost of the first night\". They noted that this deposit is non-refundable, even in case of cancellation. I complied, sent the credit card and info and kept a copy of the sent e-mail. A month later, I wrote to them again, mentioning the dates of our reservation and asking if they could book a day during our stay for a trip to the Borghese museum. The one-sentence reply, \"Yes, we can but just when you can be in the hotel.\" When we arrived on May 6, the clerks had no record of our reservation and asked to see \"their confirmation\". I produced the 3 e-mails and replies. Then, quite rudely, they said that I should have checked my bank statement for the deposit and that I should have a specific form from them. They did quickly relocate us to a nearby hotel, which had uncomfortable beds, a very basic breakfast and a very unfriendly staff. It did not have a television or an elevator (we were on third floor...they left us to carry our own bags. We requested new towels on our third day there. The maid didn't change them but they did give me some when I went down the 3 flights to get them.", "Date": "May 22, 2009"}, {"Ratings": {"Service": "2", "Cleanliness": "5", "Overall": "3.0", "Value": "4", "Location": "4", "Rooms": "3"}, "AuthorLocation": "Charleston, SC", "Title": "“It was like rudeness was their brand.”", "Author": "kRw0507", "ReviewID": "UR30315275", "Content": "We're don't choose hotels for a luxury, boutique experience and until this trip have selected them mainly based on price, cleanliness and location above all else. So when we read some negative reviews about Hotel Smeraldo, we decided it would be fine. It's in a great location (the Pantheon neighborhood of Rome), a reasonable price considering, and recently has been renovated. But it was truly uncanny how ridiculously dismissive every single member of the staff was, as if they had absolutely no time or patience for us. We split our stay in Rome, and therefore stayed at the hotel in early and mid-May; every encounter with various staff - particularly those at the front desk - was exactly the same. We had to laugh about it. When we had an issue with our room on the second half of the trip (first floor room smelled like sewer gas so we asked to be relocated), several staff members acted put out by our request for a change. Having stayed nowhere else in Rome, I hesitate to say I wouldn't recommend what otherwise is a well-managed, clean hotel with modern bathrooms, etc., but wow, this crew has the market cornered on attitude, and certainly didn't add an ounce of charm or warmth to our stay in the glorious city of Rome.", "Date": "May 19, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Atlanta, Georgia", "Title": "“Good value, Great location, service could be better.”", "Author": "ATLWanderLust", "ReviewID": "UR30211495", "Content": "I stayed in this hotel for 3 nights as part of a 2 week trip for our anniversary. I have been to Italy several times and I always like to stay near the Campo dei Fiori, but I wanted to try a new hotel since my last one left a lot to be desired. For the most part, I found the Hotel Smeraldo to be just fine. The room was nice, it was in a quiet location near everything, and for the location, I thought it was a very good value. However I think the breakfast the hotel offers at 7 euros, is not a good value. We opted to buy pastries at the bakery across the street from the hotel for 1 euro each and have cafe latte's at the cafe across the street for 1.5 euros each. We would spend usually less than 7 euros total for breakfast rather than the 7 euro per person the hotel charges. If anyone needs any fruit, there is an open air market in the campo dei fiori nearly every morning and the produce was wonderful! One word of warning: The hotel turns the power to your room off when you leave, and when we returned our first night after dinner and a night walk through Rome, the power wouldn't turn back on in our room. The man at the front desk tried to tell us it was our fault that we had plugged something in wrong and shorted the room out. We had not plugged anything in at all, we had literally dropped our luggage off and left for the day. We were eventually moved to another room, but while I was packing up my luggage in the dark (I had hung up some dresses in the closet for the wrinkles to fall out), the man at the front desk rung the room phone and asked us why were not coming down and we were wasting his time. I told him we were packing and would be down shortly and he said he didn't know what we were saying but to come down NOW. We were moved into what I assume is the handicap suite on the main floor. It was slightly larger and had no stairs, and we were fine in that room and the staff was fine from then on. But it was a bit annoying at the end of an evening when you are exhausted to have to change rooms, pack in the dark, and then be blamed for an electrical shortage there is no way you could have caused. But that event aside, I think I might stay here on a return trip, I will just bring a flashlight next time.", "Date": "May 18, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "4", "Location": "5", "Rooms": "3"}, "AuthorLocation": "Staten Island, New York", "Title": "“Not extraodinary, but location is great.”", "Author": "Dina808", "ReviewID": "UR30045818", "Content": "This hotel is your basic hotel recommended by Rick Steves. Location was excellent. Rooms were clean, but shower was small. This is pretty much the norm in Europe though and I am pleasantly surprised whenever I do get a bigger shower. Service was so so, depending on who was at the reception desk at the time. Breakfast was decent. If you are not into luxury and you just want a clean room and a shower with hot water, then this hotel is for you. After all that's what we needed and wanted. Rome was waiting for us to explore.", "Date": "May 15, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "2.0", "Value": "2", "Location": "4", "Rooms": "2"}, "AuthorLocation": "Minneapolis", "Title": "“Will not return”", "Author": "mplsJIm", "ReviewID": "UR29841822", "Content": "Good location, but walls are paper thin, and the water pipes regularly and loudly proclaimed someone above had either flushed the toilet or was taking a shower. Fairly helpful staff.", "Date": "May 12, 2009"}, {"Ratings": {"Service": "1", "Cleanliness": "4", "Overall": "3.0", "Value": "4", "Location": "5", "Rooms": "2"}, "AuthorLocation": "NY", "Title": "“Probably would stay somewhere else”", "Author": "maxmicliz", "ReviewID": "UR26827453", "Content": "While the hotel is in a great location and probably a good value considering Rome is expensive, I would probably not stay there again. The rooms were clean but the shower situation was a problem. Our first 2 nights we were in a room with a shower so tiny that even a petite person such as myself could barely fit. The water pressure was bad and it never really got hot. As a matter of fact, if you go when they have large school groups staying there you might not ever get a warm shower. The staff as mentioned here time and time again was unfriendly and curt. I'm not a high maintenance person but I do expect hotel staff to be friendly. I guess they figure they don't need my money when they get alot of school groups filling up the rooms. Which is another red flag. If you want quiet and you hit it wrong and have kids staying there you're out of luck.", "Date": "March 25, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Location": "5", "Rooms": "3"}, "AuthorLocation": "New York", "Title": "“Would stay again, Location was the best part!”", "Author": "mimi1178", "ReviewID": "UR26263173", "Content": "We just got back from a week at this hotel. The location couldn’t be beat for the price, near the Campo di Fiori and a ton of great restaurants. We could walk everywhere: Pantheon/Piazza Navona (5 min), Trevi Fountain (10-15 min), St. Peters (20 min), the Coliseum/Forum (20 min), even the Borghese Gallery (40 min). The hotel itself is missing that European charm but is still cute. Our room was small but clean, the beds were too much on the firm side for us but we slept fine since we were exhausted every night. The bathroom was small and the tiny shower was a bit of an adventure every morning. Not sure if the included breakfast was worth it, its just rolls and yogurt and coffee (as has been my experience in other hotels in Europe) but it was definitely quick and convenient. Our feeling was, when you are spending all day out sightseeing all you need is a place to sleep and shower and this was perfect. The very definition of No Frills. The other reviews on this site are spot on about the staff though. I found them to be nice and helpful if we asked questions but not forthcoming with asking us if we needed a map, directions, etc. They made dinner reservations for us every night though after I asked. Fortunately we had done our research and had a map, and we like to explore on our own. One thing they don’t tell you is that at breakfast you can order cappuccino from the waitress. We overheard someone else do it so we did it took and it was much better than the regular coffee they serve! It was little things like that that were lacking but we wouldn’t hesitate to stay here again and would recommend it to others with the few caveats I mentioned above. For us, it was exactly what we were looking for.", "Date": "March 16, 2009"}, {"Ratings": {"Service": "2", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Location": "4", "Rooms": "3"}, "AuthorLocation": "London", "Title": "“Good location, indifferent service”", "Author": "Fraze73", "ReviewID": "UR26050820", "Content": "My girlfriend and I spent 3 nights at this hotel earlier this month. The hotel is clean and the rooms are adequate although the bathrooms are a little on the small side. Where they let themselves down is on the service. It's not that they are especially rude but the staff certainly seem to be indifferent about their guests. On the plus side the breakfast was fine and about what you'd expect for a hotel in this class and the location is excellent for Pantheon, Piazza Navona etc with the Colosseum and Forum a 10 minute walk away.", "Date": "March 12, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "4", "Location": "5", "Rooms": "3"}, "AuthorLocation": "Toronto, Canada", "Title": "“Great location, average rooms and ambiance”", "Author": "jgoto", "ReviewID": "UR25184884", "Content": "This hotel is situated close to the Campo di'Fiore, making it a great location for accessing all the sights in Rome. The hotel itself is lacking in ambiance and is a bit out of date. The room size is adequate, but the bathrooms are cramped and hot water is not always available. Liked best: location, value Liked least: old bedding, small bathroom, unreliable hot water", "Date": "February 26, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Business service (e.g., internet access)": "3", "Check in / front desk": "4", "Overall": "4.0", "Value": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Brecksville,Oh", "Title": "“Roman Favorite”", "Author": "KieranR", "ReviewID": "UR22699715", "Content": "We enjoyed our 5 day stay at Hotel Smeraldo. It's location is great. The breakfasts were good. Airport pickup went well. Room was tiny, roof terrace was a disappointment. We would stay there again.", "Date": "December 13, 2008"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Check in / front desk": "2", "Overall": "3.0", "Value": "3", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Houston", "Title": "“Great Location, Poor Service”", "Author": "megt4", "ReviewID": "UR22519763", "Content": "Hotel Smeraldo has an excellent location, very convenient to many landmarks. It is also very reasonably priced for being in the heart of Rome. The rooms were fine; they were fairly comfortable, though the showers were not the best. However, I was very disappointed with the staff, they were not welcoming or friendly at all, and even very simple requests, such as an extra pillow, were greeted with irritation and exasperation. My husband and I were disappointed to be treated like this during our honeymoon, especially since we received such excellent service at all the other places we stayed.", "Date": "December 7, 2008"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Business service (e.g., internet access)": "3", "Check in / front desk": "4", "Overall": "4.0", "Value": "4", "Rooms": "3", "Location": "4"}, "AuthorLocation": "New York", "Title": "“Good Value”", "Author": "QueenBeee", "ReviewID": "UR22070073", "Content": "We arrived in early November and stayed one night before leaving Rome and then 3 nights on our return to Rome. We were 2 couples traveling together. Our rooms were in the annex. The first rooms we stayed the first night in were on a courtyard and nice and quiet. The second rooms for the last nights were on the street and noisier. We could hear our neighbors in the hotel. Both rooms and bathrooms were very small but very clean and well appointed. Pillows were a bit too firm, beds comfortable, bedding old but clean. We are use to staying in fine hotels but on this trip we were looking for inexpensive and clean. For 100euro a night this was a very good value. Not spacious luxury but clean, comfortable and nicely decorated. Front desk personal were professional. We booked directly with the hotel by phone when on-line methods indicted no availability. Rate was less than booking on-line.", "Date": "November 21, 2008"}, {"Ratings": {"Service": "1", "Cleanliness": "5", "Check in / front desk": "3", "Overall": "3.0", "Value": "2", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Las Vegas", "Title": "“Good Location, Staff was.....”", "Author": "GirlTraveler70", "ReviewID": "UR22013035", "Content": "As the other reviewers have said, the hotel is in a great location. The staff on the other hand is not terribly helpful. The person who checked us in was really nice. It went downhill from there. We received short answers when we asked questions, such as directions. We didn't request anything complicated or difficult, they just were not pleasant. However, we were expecting issues so we were not surprised. The room itself was basic and had two English channels. The bathroom while decent sized, had the smallest shower I have ever used. For those who have cruised before, it was actually smaller than a ship's shower if you can believe it. The door came together on a corner of the shower so that you had to scoot in sideways. Don't have any extra girth cause you won't make it. I dropped the soap and had to open the doors to bend over to retrieve it. I'll post pictures. Please excuse the mess we created. There was a ton of closet space. We had so much we didn't use it all. The window opened to a small courtyard below. Unfortunately the smoke from smokers downstairs came into our room. The hotel is very loud! Every voice and door could be heard in the room. We could hear everything from the people next door on our last night. The elevator is up a flight of stairs. It was super small and will hold either two people or one person with one suitcase. We ended up sending one person downstairs while the other stayed up and sent the elevator down with just suitcases. We found a grocery store about a block away that had six packs of water for 2 Euro rather than 2 Euros each at all of the tourist places. They also sell wine. The front desk had a bottle opener. The salad place near the hotel (on the main street) was good. For 80 euro cents you can get espresso at the place on the corner just outside of the front door. I wish we had known that before the last night.", "Date": "November 19, 2008"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Business service (e.g., internet access)": "3", "Check in / front desk": "3", "Overall": "4.0", "Value": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Montreal, Canada", "Title": "“Great Location, Good Choice for Value Hotel in Cenral Rome”", "Author": "Tobster2", "ReviewID": "UR21008094", "Content": "We started off our Italian vacation in Rome and stayed 2 nights at the Smeraldo Hotel in mid June 2008. As I was planning for our trip a few months prior, I quickly became very discouraged as I was researching hotels in Rome. Unless we were prepared to pay a fortune, I was not able to find a reasonably priced hotel in central Rome that was clean. Everything was super expensive and some of the lesser expensive ones (125 - 200 Euros) had very mixed and poor reviews ... small rooms and not very clean. Then I came across the Smeraldo hotel which gave me much hope. We were very pleased with our choice. This relatively small hotel basically had everything we were looking for at a reasonably affordable price (by Roman standards). It is exceptionally well located near Campo di Fiori. We walked to many of the tourist sites from the hotel. It is located in a small and relatively quiet street, a few blocks away from a main street. At night, we walked to and from the many quaint Piazzas that were found within close proximity. Right across the hotel, there is a cafe and a restaurant and right around the corner, there is a wonderful bakery that serves fresh take out pizzas, paninis and other baked goodies at excellent prices. Lots of wonderful restaurants, cafes and shops can be found within walking distance. If you enjoy eating, you must try the Ristorante del Pallaro, a wonderful restaurant serving Roman food that is 2 blocks away from the hotel. For a very reasonable set price, there is a fixed 8 course menu, including wine, served in an outdoor terrace. Service was wonderful and the food was absolutely delicious. The room as well as the bathroom at the Smeraldo were very small, one of the smallest ones I have ever stayed in, but this seems to be the standard in Rome. If you know this as the outset, you will not be disappointed. After all, how much time will you spend in your room? It had all the basic amenities and was very clean which was extremely important to us especially in view of the reviews we read of other hotels located in central Rome. The view from our window was almost non-existent. For a wonderful view, however, the hotel has a rooftop terrace. The rooftop terrace was an excellent place to relax, to enjoy the views of Roman rooftops, and to eat something you bought outside the hotel and drink a wine you purchased. Although there are some reviewers of this hotel who found the service at the front desk to be poor, the gentlemen who were there during our stay were very professional, courteous and helpful. Breakfast at the hotel was simple ... breads, salami and cheese. The juice, however, tasted like powdered juice. Upon our arrival to Rome, one of the first things we did was take a tour bus around Rome. There are many such companies that provide the hop on and off tour bus option, allowing you to visit the various sites during a 12 or 24 hour period. There are some better ones, the double decker red bus being one of the better ones and I believe the original one. This is a good way to see the various sites and decide on which ones you want to visit in more detail. We loved Rome. It was my first time and I was very pleasantly surprised. It is one of my favourite major cities in the world. There is so much to do and visit in Rome ... 2 days are not enough. I found the prices generally reasonable, better than what I was anticipating. There are good bargains to be had in terms of shopping and dining. The pizzas sold by weight at the various pizzarias located thoughout Rome were truly delicious. For those who enjoy outdoor dining, there are many choices that will satisfy your tastes. Given the hotel's central location, its reasonable price, its clean rooms, the Smeraldo, a basic 3 star hotel, is an excellent value choice and we would definitely recommend it.", "Date": "October 19, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Business service (e.g., internet access)": "4", "Check in / front desk": "5", "Overall": "4.0", "Value": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "CaWino", "Title": "“Great Value & Location”", "Author": "CaWino", "ReviewID": "UR20647503", "Content": "The Smeralo is great value. We paid 155 euro for a double room. The room was nicely appointed with cable TV, and air conditioning. A breakfast including coffee, juice, rolls, cheese, and salami was included in the price. They have a computer set-up with Internet connection for five euro per hour. It was located in a private room near the lobby. Another nice touch was the rooftop garden. It had a table and chairs with some nice views. We enjoyed several glasses of Chianti while relaxing and soaking up the atmosphere. Location: the hotel is a stones throw to Campo Fiori - less than five minute walk. Piazza Navonna was almost as close, too. There was a bakery just around the corner and several good restaurants nearby. Rome is one city where you want to stay in the center and this is about as good as it gets. The wait staff was very friendly. The front desk less so, but I wouldn't call them rude as other reviewers have. I was very satified with our four day stay and would certainly consider staying there again.", "Date": "October 5, 2008"}, {"Ratings": {"Business service (e.g., internet access)": "1", "Overall": "1.0", "Value": "1", "Service": "1"}, "AuthorLocation": "Massachusetts", "Title": "“Awful with customers !!! Cold hearted !!”", "Author": "attachphotos", "ReviewID": "UR20452663", "Content": "They DO NOT CARE FOR CUSTOMERS !! My husband and I were counting the days to our trip to tour Italy.....Unfortunately 3 days before departure I fell ill and had to be admitted to the hospital where I stayed for 2 weeks recovering from emergency surgery. My husband immediately contact all our hotels and airline companies and follow procedures of cancellation, and sent letters from the hospital to all of them. ALL waived cancellation fees since we followed procedures and provided appropriate documentation of our unfortunate and unexpected event. However HOTEL SMERALDO, DIDN'T !!!!!!!! Even though we gave them 3 days notice, called them on the phone, and sent them a letter from the hospital ....THEY DID NOT CARE !!! We were FULLY CHARGED for our room. AWFUL !!! While other hotels wished me a speedy recovery and were looking foward to accomodating us on our future trip to Italy HOTEL SMERALDO JUST SENT US THE BILL !! I am not surprised to read on other postings the the staff is rude.....be aware of shaddy hotels like this. WOULD NEVER do business with Hotel Smeraldo again !!!", "Date": "September 28, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Location": "5", "Rooms": "4"}, "AuthorLocation": "San Francisco, California", "Title": "“Great location, good value”", "Author": "wanderLust18", "ReviewID": "UR20078590", "Content": "We were happy with our stay at Smeraldo...the location is great - just a few blocks from Campo di Fiori. You can walk from the hotel to most tourist attractions (if you're up for a longish walk that is). The room was small, but clean. Had a comfy bed, air condtioning and a tiny but clean attached private bath.", "Date": "September 14, 2008"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "4", "Overall": "4.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Dallas, TX", "Title": "“Great location!”", "Author": "crlep", "ReviewID": "UR19625590", "Content": "We stayed at this hotel for a few days in the end of June and could not have asked for a better location! It was right next to Campo de Fiori and within walking distance to most of the major sites (with good walking shoes!!). The rooms were small but overall it was a great value. The rooftop terrace was really cute,especially to enjoy a glass of wine before going out to dinner! The staff was not friendly, however we still enjoyed our stay since we knew to expect that.", "Date": "September 1, 2008"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Business service (e.g., internet access)": "3", "Check in / front desk": "3", "Overall": "3.0", "Value": "3", "Rooms": "3", "Location": "3"}, "AuthorLocation": "california", "Title": "“quaint neighborhood in rome”", "Author": "areedCalifornia", "ReviewID": "UR19400563", "Content": "The smeraldo hotel is cute and expensive. We had a triple room and it was very small. The bathroom was very nice and had all that you needed. The neighborhood is old school with cobblestones, shops, and restaurants. You do have to walk a while to get anywhere. I would recommend taking the metro everywhere in Rome. Do not take taxis unless the subway is closed, you will save a lot of money. The staff was not the friendliest but not mean. If you have a question they will answer it but that is it. They have breakfast every morning which was ok. All in all I thought the location was great, quiet, and Rome is amazing you will love it.", "Date": "August 26, 2008"}, {"Ratings": {"Service": "2", "Cleanliness": "5", "Check in / front desk": "2", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Colorado", "Title": "“Comfy and Centrally Located”", "Author": "Jdani17", "ReviewID": "UR18183566", "Content": "We couldn't have asked for a better location. We were right by Campo di Fiori, great eating, shopping, entertainment. Our hotel room was a triple with three twin beds, very small beds, not overly plush but not horrible. Very small bathroom, small shower. The place is kept very clean though. The front desk staff wasn't very friendly or helpful but you don't have to deal with them too much. We stayed 4 days. It was the perfect amount of time.", "Date": "July 23, 2008"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Check in / front desk": "3", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "New York", "Title": "“Good budget choice”", "Author": "NewYorkGirlNewYork", "ReviewID": "UR18066614", "Content": "We thought this hotel was a good deal for the money (140 euros a night). We walked everywhere - colliseum, Pantheon, Travestere... There are nice cafes and bakeries in the neighborhood. At first it seemed a little noisy because you're right above the alleyway but when we closed the shutters and turned on the a/c, we could hardly hear anything. The staff wasn't particularly friendly but they answered all our questions and did call us a flat-rate taxi to the airport. Our only complaint here - the shower. I had no idea they could make them that small. Every time we used it the floor was covered with water. A really large person would truly not fit.", "Date": "July 20, 2008"}, {"Ratings": {"Cleanliness": "2", "Check in / front desk": "1", "Overall": "1.0", "Value": "1", "Rooms": "1", "Location": "2"}, "AuthorLocation": "Berkhamsted, UK", "Title": "“Hated It So Much, Had To Leave”", "Author": "YankeeInBerko", "ReviewID": "UR17603615", "Content": "Booked through Romeby.com What an awful hotel. Wouldn't let the photos fool you... The hotel is down an ally. The rooms are barely big enough for the uncomfortable bed in it, let alone for two adults and their luggage. The showers are great if you are under five feet tall and weigh less than 90 lbs. The gentlemen at the front desk were incredibly unfriendly and unhelpful. We had a car and they wouldn't even tell us where to park. We described where we had parked and they said it was fine, only turns out it was completely illegal. We had to find that out and find the local public garage on our own. Even though we booked 2 months in advance, they stuck my husband and me in the room behind reception where we could hear every single thing that happened in the lobby. There was one tiny window with bars across it. Despite the air conditioning, it was damp. We asked to change rooms and they lied to me, saying there weren't any others available. Then they showed my husband a room on the fourth floor with a single bed. We canceled our stay and went to Hotel Raphael, about 4 blocks away. It was twice the price but a true luxury experience. What a fantastic hotel! Now Smeraldo is trying to charge us £145 euro cancellation fee, which we are refusing to pay due to what we believe is false advertising. My parents and uncle stayed here and while their stay was tolerable, it wasn't great. The breakfast wasn't worth eating. To get to that roof deck (which has just one average size picnic table and a view of surrounding roof-top TV antennas), you have to walk through (literally) the hotel's drying laundry. There MUST be better hotels than Smeraldo in the same price range (recommend checking guide books such as Lonely Planet). If you have a little more to spend, then I highly recommend Hotel Raphael. It was beautiful!", "Date": "July 7, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "4", "Overall": "5.0", "Value": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Northborough, MA", "Title": "“Great stay in Rome!”", "Author": "LeslieRMH", "ReviewID": "UR17563958", "Content": "We stayed at Hotel Smeraldo for 4 nights in late June. We were extremely pleased with the hotel. Yes, the rooms are small, but they’re just fine and nicely appointed. We had a double (with a nice large bed), and the triple for our kids consisted of two separate areas, one with two beds and the other with one bed, making for a nice private area for one of the kids. This was an unexpected benefit. We had two of only three rooms on an isolated section of the first (one above ground level) floor. Since we saw the guests in the third room only once, it felt like we had the area to ourselves. (If you’re interested in this arrangement, ask for Rooms 112 and 114.) The location is absolutely phenomenal. The area is so charming and has so much to offer: central location, markets, shops, etc. It is extremely close to Campo dei Fiori; a quick walk down a street lined with shops and bars. We never ate breakfast at the hotel; if you do, you are charged 7 Euros per person. Not only was that a lot to pay (a pastry can be had from across the alley for ~ 2 Euros), but our family was out so late at night that we never would have made the breakfast (closes at 10:00 AM). All the other sites were within approximately a 30 minute walk from the hotel: Vatican City, Spanish Steps, Colosseum, Trevi Fountain was closer, and even closer yet are Piazza Navona and the Pantheon. The staff was nothing but cordial, friendly and helpful. The air conditioning was perfect. When we checked in, one of the rooms was a bit warm. They sent someone to the room IMMEDIATELY and it was fixed (just needed to be adjusted). When we returned after hours of exploring the city, the air conditioning was still running. The rooftop garden is nice; it has a canopy as protection from the sun. Unfortunately, it closes at 8:00 PM, so we weren’t able to go up after we returned from dinner. But, we got sandwiches one day from a bar across the alley and bread, cheese, salami, olives, and we ate them on the rooftop garden. I would stay at Hotel Smeraldo again without hesitation.", "Date": "July 5, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Check in / front desk": "4", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "harrogate", "Title": "“It was great - not sure what the complaints are about”", "Author": "BoulderBaehres", "ReviewID": "UR17377243", "Content": "This hotel was great. Fantastic location to everything in the heart of Rome. About 1.5 blocks from Largo Argentina where all the busses stop, so very easy to get around. We arrived at noon and were able to check in right away. The air conditioning could be adjusted as cold as we liked, so it was arctic compared to the rest of Rome. Clean, decent size bathroom, good shutters and double glazing. There's a lift/elevator, which is unusual in Europe. I wonder, if the people who have negative comments are asking too much of a 3-star hotel in Europe? We had no problems with service. We didn't pay for breakfast, but there were many cafes nearby for espresso and pastries. My only complaint was that the roof deck closed at 8:00 pm, and we never got back to the hotel that early.", "Date": "June 30, 2008"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Birmingham", "Title": "“Sound Place to Stay”", "Author": "BirminghamPaddy", "ReviewID": "UR17311731", "Content": "Yes as the previous reviews location,location, location. Staff were very friendly and even gave out maps to where you need to go for the day etc. You will not need to get a taxi anywhere if you have a strong pair of shoes. We got the shuttle bus from the Termini back to the airport for 8euro and a taxi to the Termini which cost 11 euro. PLEASE BE AWARE that all TAXI 'S charge a TOURIST rate of 5 euro when you order or hail a taxi. Would stay at the Smeraldo again although I paid 145 euro a night. Venere.com charge 90 euro!!!", "Date": "June 28, 2008"}, {"Ratings": {"Service": "2", "Cleanliness": "4", "Business service (e.g., internet access)": "3", "Check in / front desk": "2", "Overall": "4.0", "Value": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Mountain Brook, Alabama", "Title": "“Great Location, Staff A Little to Be Desired”", "Author": "Finchslanding", "ReviewID": "UR17210438", "Content": "My teenage son and I just returned from a week's tour of Rome and our tour group stayed at the Smelrado. You can't beat the location - a few minute's walk from the Campo di Fiori, 8-10 minutes from the Pantheon, 15-20 minutes walk to the Forum and Colisseum. The room was small and the twin beds hard, but we didn't go to Rome to stay in the room. We walked so much that going to sleep was no problem. One thing I did not realize until the last day is that when you turn in your room key at the desk, they switch off the power to your room - so it does no good to try and leave the air on and cool your room. So if one of your party goes down to the continental breakfast served on the bottom floor, turns in the key, and one stays in the room to finish getting ready, the power is cut! \"You must tell me if one stays in the room,\" the desk guy told me after I reported our power going out. I would agree that the staff is indifferent, not overly friendly and not particulary rude. They speak English fluently. The breakfast was included in our tour, so I don't know if that is a good bargain compared to the bakery next door. I do know that on our last morning, we got overcharged for the pastries we ordered, but just let it go since we were on our way to the airport. A great place to eat near there is La Tartaruga (tortoise) Cantina at 53 Via del Monte della Farina, about 2 blocks from Smeraldo. Excellant pasta and baked grouper. In any event, the price seems good and if you want to be able to walk to see the sights, I would recommend this hotel.", "Date": "June 25, 2008"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Check in / front desk": "3", "Overall": "3.0", "Value": "2", "Rooms": "3", "Location": "4"}, "AuthorLocation": "toronto, ontario", "Title": "“Not bad, but not great”", "Author": "bosscutter", "ReviewID": "UR16875195", "Content": "My wife and I stayed for 9 nights and unfortunately had a room facing the street. All night we heard motorcyles, cars, yelling and garbage trucks. If you close the windows it becomes very stuffy and hot, as the main desk is not into turning on your air conditioner even though you paid for it!! The room is small and bathroom clean and tiny, but hey, its Italy, it's a place to sleep and change. Breakfast is not much but will do in a pinch. The staff is definately not overly friendly, but not rude, just indifferent. The location is good, near the Campo and main thoroughfares. Overall, I think it is overpriced for the service you receive and would try another hotel in the area for our next trip.", "Date": "June 12, 2008"}, {"Ratings": {"Service": "1", "Cleanliness": "4", "Check in / front desk": "1", "Overall": "2.0", "Value": "2", "Rooms": "3", "Location": "4"}, "AuthorLocation": "London", "Title": "“Great location, shame about the staff”", "Author": "max_lk", "ReviewID": "UR16844714", "Content": "I read the previous reviews on this hotel & booked this primarily on its location. The good points about this hotel are that it's within walking distance from all main attractions, rooms are very clean, the roof garden is a nice escape after a long day walking, not at all noisy at night & the price is okay. Bad points are that the hotel staff are about the rudest & most unhelpful I've ever met. The rooms were very small & showers were tiny. If you are above 'tiny' size then you will most probably accidentally adjust the shower temperature when attempting to move in the shower! If you have no real need for service or advice & know you will be out site seeing all the time, then you may choose this purely for its location. Although I am sure there is better around. Enjoy Rome & the ice cream is fab!!", "Date": "June 11, 2008"}, {"Ratings": {"Service": "2", "Cleanliness": "4", "Check in / front desk": "2", "Overall": "4.0", "Value": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Charlotte NC", "Title": "“Great location”", "Author": "clemsongal", "ReviewID": "UR16700553", "Content": "Great location, good price. Very small room, but we didn't mind because we spent our entire time walking around Rome. The front desk staff leaves something to be desired--not overly friendly or helpful and not good about returning emails. We booked this hotel primarily for the location--in Campo de Fiori, within walking distance of all the major sites. The location did not disappoint. We would stay here again.", "Date": "June 5, 2008"}, {"Ratings": {"Overall": "2.0"}, "AuthorLocation": "Amsterdam", "Title": "“Never again”", "Author": "Anna1968", "ReviewID": "UR16235509", "Content": "I have read the other reviews after I went to this hotel. Believe it or not I wish I had done it before. OK the worst things; the reception employees do speak English but mostly Italian (by the way, we are Dutch). The rooms are very noisy, on the inside because when you close your streetside-window, you can't hear a thing from the street, but more from your neighbours. The breakfast is TERRIBLE. I always said \"what can you do to spoil a breakfast\" well after being here, everything. The orange juice is a mixture of powder and water, the coffee is heated Tiber-water, the bread is at least 2 days old. So skip the breakfast in this hotel. The beds are ok, but very very short. Long Dutch guys won't fit in it. Same as the bathroom specially the shower, there is a door around this shower corner but it closes very difficult, when it is closed you can't open it anymore.. besides that the temperature of the water changes every moment from very hot to extreme cold. And you are standing with your feet in 10cm water, having a foot bath. It is very clear that the hotel is often used by kids/teenagers being away from their parents... unfortunately there was a group when we were there. They tried to call their friends during the night, dialed the wrong number and woke us.. The hotel has 2 elevators, the one on the front is reachable by a 5-step stair and can contain 2 persons or 1 person and a suitcase. It does not reach the roof terrace because to come there you have to climb 2 stairs. Then you have a nice view on all other roofs. Finally the hotel is not cheap, the rooms are just poor and therefore the hotel is more expensive then a good 2 star hotel. it is classified for a 3 star, I would say it is a poor 2 star.", "Date": "May 20, 2008"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Check in / front desk": "3", "Overall": "4.0", "Value": "3", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Minnesota", "Title": "“Clean, and a perfect location. Staff was not very helpful...”", "Author": "midwester_2008", "ReviewID": "UR15896588", "Content": "We were across the street at the Dependence section of this hotel property. Very clean and modern rooms, convenient closets and storage. Overall, very nice. The staff were a bit stand-offish. We were trying to speak Italian, and our efforts were not appreciated. We were treated not like guests, but like pests. That being said, this is an affordable, clean, perfectly-located hotel that I would recommend for a great home base to explore Rome! Walk across the street for coffee/pastries in the morning, then down to Campo de Fiori for a piece of fruit, then head out to explore the city. There is a rooftop patio that is great for splitting a bottle of wine after a long day of walking around ancient Rome!", "Date": "May 10, 2008"}, {"Ratings": {"Service": "1", "Cleanliness": "5", "Business service (e.g., internet access)": "4", "Check in / front desk": "1", "Overall": "3.0", "Value": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Trinidad and Tobago", "Title": "“great location, but service DEFINITELY without a smile.”", "Author": "hodgki76", "ReviewID": "UR15511267", "Content": "This is a tough review. The hotel has an amazing location, a stone's throw away from the Campo Fiori and really close to Piazza Navona. The room was a decent size for Europe, with a gloriously large (for Europe) bathroom and the windows were soundproofed. Breakfast was ok. The bad. The staff, most of the front desk crew were quite standoffish - and there were several of them. At One point after arriving early in the am after clubbing, we had to argue with the front desk that we were staying at the hotel. He said no, and said you are staying somewhere else. Was he serious?? This was one incident... There was also one gentleman on the evening shift who was quite pleasant. So go figure. If you plan to sleep in, forget it, as cleaners were slamming doors and vaccuming from as early as 730 am (the doors were not sound proof). So its up to, great location, but service DEFINITELY without a smile.", "Date": "April 30, 2008"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Check in / front desk": "3", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Moultonborough, New Hampshire", "Title": "“A Little Gem in the Heart of Rome”", "Author": "GotABigDog", "ReviewID": "UR15445220", "Content": "This hotel is ideally located just a few steps from the Campo di Fiori, offering eating and shopping options throughout the day. There is a great bakery and a couple of cafes that are literally across the street. We walked to the Spanish steps, the Colosseum and the Vatican from here. Our room was comfortable, very clean, and we enjoyed the double-paned, full-size window balcony. Additionally, it was very nice to sit on the roof deck and enjoy a glass of wine in the evenings. The staff were not overly friendly, but they never refused a request or didn't answer a question. The breakfast is average, but a welcome amenity while on vacation. This is a reasonably-priced property for the location. You're not going to find better. I would not hesitate to recommend this hotel for someone looking for a convenient hotel in the heart of Rome that allows you to get a flavor of the place.", "Date": "April 28, 2008"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Check in / front desk": "2", "Overall": "2.0", "Value": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Seattle", "Title": "“Clean and reasonable for Rome”", "Author": "kfullerwa", "ReviewID": "UR14469180", "Content": "As others have said, the accomodation is clean and a good price for the heart of Rome. The staff at the front desk is pretty indifferent and sometimes downright rude. The staff at the very adequate breakfast (you are charged extra for this) is very accomodating. If you know in advance that you will probably encounter surly front desk people and you are willing to put up with that for a clean, reasonable, safe hotel, then go ahead and book. That's what I did.", "Date": "March 23, 2008"}, {"Ratings": {"Service": "1", "Cleanliness": "3", "Check in / front desk": "1", "Overall": "2.0", "Value": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "nebraska", "Title": "“Great Location --Poor Attitude”", "Author": "joyceh", "ReviewID": "UR14194759", "Content": "This hotel is right in the midst of everything. Within close walking distance to Campo Fiore. The room was small but clean and the bed comfortable. Unfortunately, they have such a poor attitude towards Americans that it's hard to get past it. They rent to college kids who are out partying all night and are loud and obnoxious when they are in the hotel. The desk clerk told my husband how disgusted he was at \"rich Americans who send their kids to Italy to be babysat by them.\" He called the girls \"whores\". There was a group of high school kids also booked there while we stayed and they were well behaved but just the large group that they were in made it quite noisy. I had to dial direct from the hotel as the Credit Card access number that was noted on the room phone wouldn't work and the desk clerk practically yelled at me to just use the 001. This amounted to a 23E phone charge for me because he didn't want to help. We would not stay here again because we prefer quite and peaceful surroundings when we travel.", "Date": "March 10, 2008"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Check in / front desk": "3", "Overall": "4.0", "Value": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Boston, Massachusetts", "Title": "“Great Location & Price”", "Author": "SkiGirl06", "ReviewID": "UR13182585", "Content": "This was a great hotel for the price and the location is very close to many area attractions. Great for getting around and centrally located. The room was bare but comfortable and clean. I have recommended to others who have since stayed there and they also loved it for the price and location!", "Date": "February 1, 2008"}, {"Ratings": {"Service": "2", "Cleanliness": "4", "Business service (e.g., internet access)": "3", "Check in / front desk": "2", "Overall": "4.0", "Rooms": "3", "Location": "4"}, "AuthorLocation": "New York", "Title": "“Good price and location, if you don't mind the unwelcoming attitude”", "Author": "Itaiphile", "ReviewID": "UR12961129", "Content": "This hotel has a lot going for it, especially the convenient central location, half way between Campo dei Fiori and Largo Argentina (where several buses stop, like the 40 that goes to Termini railroad station). It looks cleaner and more stylish than what you'd expect from a small budget hotel. It is unfortunate though that many of the staff members don't have a more pleasant attitude. When I checked in, the man behind the desk barely gave me a glance and was cold and curt almost to the point of rudeness (e io parlo italiano bene). Also the neighborhood seems to have gone downhill since I was last there in 2004 -- graffiti and garbage everywhere, even amidst nice shops and restaurants. If you're looking for a decent budget option, and don't care whether the rooms and bathrooms are small, but want to be centrally located, this is a good choice.", "Date": "January 24, 2008"}, {"Ratings": {"Service": "1", "Cleanliness": "4", "Check in / front desk": "3", "Overall": "2.0", "Value": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Southern", "Title": "“Great Location”", "Author": "LuckySouth", "ReviewID": "UR11270071", "Content": "First and foremost, one stays here because of the location. At nite it is a stones throw to the popular Campo Fiori square, the Navona Piazza, or the Pantheon area. One can walk anywhere, cobblestone streets, it really is the place to stay. Don't even think about staying on the outskirts or near the colosium. No public transportation is needed. We did take Rome Shuttle from the airport, 35 euros, and someone was waiting with a sign after our long flight. How nice! Smeraldo wanted more than 50 Euros. The room and bath were tiny, decent, no extras. I am of average height and build, maybe smaller, and I could not move in the shower. The staff don't care if you are alive, and it does make a difference. The two hotels we stayed at after this, the staff was FABULOUS. Hotel Dali in Florence, and Ca' Dei' Dogi in Venice. When you have excellent hosts, you see more, experience more, they lead you to fab bakerys, restaraunts, and so forth. I paid 100 euros a nite at Smeraldo in late November. If there was a breakfast they failed to communicate that to me. Most of our nites were quiet, but sometimes we could hear the people using dryers (woke us up), using the bathroom, and one night before we left they rented the room next to us to a group of young men, kids really, and we could hear them screaming, cussing and being obnoxious all night. The staff had to hear them also, but the staff does not care, is not helpful, and have attitude problems. They are not accomadating at all. One nite we asked for a restaurant recommendation and he pulled out a card. We went to the restaurant and it was empty, and all the others around it were busy. We did not eat there. I want to feel good about where I stay, and they just don't and won't care. Again, it does and will make a difference. (sorry about my spelling)!", "Date": "December 5, 2007"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Check in / front desk": "4", "Overall": "4.0", "Value": "5", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Washington DC, District of Columbia", "Title": "“Perfection”", "Author": "DCAbby", "ReviewID": "UR11100675", "Content": "My fiance and I recently stayed at the Hotel Smeraldo. We could not have asked for a better situation. The room is tiny, but this shouldn't deter you. If you are staying in your hotel room for more than to shower and sleep, you shouldn't be in Rome! It is charmingly European and is on a very cute little street. I'm beginning with the location because I cannot stress to you how close it is to everything. Rome is an incredibly easily-walked city. It would be ridiculous to take any type of public transportation once you are at this hotel. Our first day we were amazed at how close everything is. You can walk to the Forum, Colosseum, Spanish Steps, Trevi Fountain, the Vatican, etc. No need to cab it. Back to the hotel--I know that I have seen a review that says that they had trouble with being charged for breakfast, we did not. There were no issues whatsoever. Also, some have said that the service wasn't that great. Honestly, they may not be over the top friendly but they answer your questions and provide you service. There's no rudeness at all. We had a problem with our key late one night and they were so helpful and genuinely felt bad for our trouble (which it wasn't any trouble). The hotel has such a cute roof deck. Go upstairs one night and enjoy a glass of wine before you go out for dinner. Every inch of Rome is absolutely breathtaking and the hotel is just a place to sleep. It's safe and close to everything...everything you need in a hotel. If I can offer another word of advice...from the airport, take the train to Termini. It's the Leonardo Express. It couldn't be easier and takes maybe 20 minutes. We were somewhat mixed as to whether or not to try it and it was so incredibly easy, it would have been silly not to. It's 11 Euro and then a 6-7 Euro cab ride from Termini to just about any location in the city. you're going to spend half the money and you'll probably cut the time in half from taking a cab from the airport. Anyway, I'm so excited for your Roman vacation!!!", "Date": "November 27, 2007"}, {"Ratings": {"Service": "2", "Cleanliness": "4", "Check in / front desk": "3", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "California", "Title": "“Great Location”", "Author": "SweetPeaSanDiego", "ReviewID": "UR10965667", "Content": "We stayed at Hotel Smeraldo for 5 nights and I have to say, you can't beat the location. It is perfectly situated near Campo di Fiori and the Pantheon. The Vatican was a short walk in one direction and the Colosseum a short walk in the other direction. Saying the staff was anywhere near friendly is pushing it. I found them to be cold and uninterested in us the whole time we were there. However, the room was clean and a minimal breakfast was included in the price of the room.", "Date": "November 21, 2007"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Business service (e.g., internet access)": "3", "Check in / front desk": "4", "Overall": "4.0", "Value": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Pittsburgh, Pennsylvania", "Title": "“Nice Hotel”", "Author": "drums45", "ReviewID": "UR10574476", "Content": "I booked this hotel through WorldBy.com We stayed here 3 nights. The location is good, on a quiet little street a few blocks from Campo di fiori. There is a coffee shop and a great restaurant (Trattoria Moderna) across the street. The breakfast was average. We had a triple and a double room. The triple was small but okay. The rooms had good beds and bathrooms. There were no safe or fridge in the rooms. The staff was professional and spoke some english. This is a good hotel for the money. The room furnishings were good quality compared to other hotels in Rome I've stayed in.", "Date": "November 3, 2007"}, {"Ratings": {"Overall": "3.0"}, "AuthorLocation": "Chicago", "Title": "“Great Location, Not Great Service”", "Author": "JamesBChicago", "ReviewID": "UR10481068", "Content": "Staying at Smeraldo Hotel, in Rome, was very nice. The best part of the hotel is it's convenient location (not far from Campo dei Fiori and Piazza Navona). The room was very nice and the bathroom extremely clean. Additionally, they had a very nice breakfast to start your day and if you are at the hotel toward the end of the day, definitely use the roof garden. We met some wonderful couples while enjoying some wine. Our biggest issue was the indifference exhibited by the front desk staff. When ever you asked a question, they made you feel as though they had better things to do. While I had read other reviews warning us, I was still surprised. Also, the bar they advertise was never open (we stayed four nights).", "Date": "October 31, 2007"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Derbyshire, UK", "Title": "“very good value”", "Author": "apb0229", "ReviewID": "UR10389297", "Content": "Stayed here on holiday with my 9-y-o son, and really liked it. Yes, obviously location is perfect, but it was also clean, shower nice and warm, beds fine, space fine, and breakfast ok too. The alleged unfriendliness of staff eluded me: they seemed ok, and delightfully when we returned to our room at he end of the day my son's cuddly toy had been placed on his pillow.", "Date": "October 28, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "New York, NY", "Title": "“Best value in Rome!”", "Author": "clf2118", "ReviewID": "UR10324662", "Content": "This hotel was in THE BEST location, close to everything. The place was clean and, while the room wasn't huge, it was nice and certainly sufficient for sleeping in between touring. The bathrooms were beautiful and clean. Great value! The front desk people were very helpful, and the breakfast, although not fabulous was just fine.", "Date": "October 25, 2007"}, {"Ratings": {"Service": "1", "Cleanliness": "3", "Check in / front desk": "2", "Overall": "2.0", "Value": "2", "Rooms": "2", "Location": "5"}, "AuthorLocation": "Queensland", "Title": "“Smeraldo - just OK”", "Author": "gmjennison", "ReviewID": "UR10088619", "Content": "Location was great but that's about all. Our room was so small we couldn't fit our suitcases anywhere and the bathroom you had to nearly sit sideways on the toilet!!! It was dark and very noisy on the Saturday night. The front desk staff couldn't be bothered and when we kept smiling and being nice to them regardless they still wouldn't go out of their way to help with anything. The air conditioning could only be controlled by them so rather than freezing we had to get them to switch it off all the time. They had no idea about any of the buses to anything - they only offered an expensive (50Euro) car to the airport. For the money, not great.", "Date": "October 16, 2007"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Business service (e.g., internet access)": "3", "Check in / front desk": "3", "Overall": "5.0", "Value": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "aberdeen", "Title": "“A little gem”", "Author": "ellonsteve", "ReviewID": "UR10055505", "Content": "Searched the internet and travel guides for a recommended reasonably-priced hotel in central Rome and went for this one. We stayed for 5 nights and it was an excellent choice - fantastic location, exceptionally clean, friendly staff, great breakfasts. It also has a small roof garden which is ideal for a seat in the sun between walks - and just about everything you might want to see in Rome is within walking distance of this hotel!. We had absolutely no complaints and would (in fact will) return without hesitation. Stephen, Aberdeen, Scotland.", "Date": "October 8, 2007"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Check in / front desk": "2", "Overall": "3.0", "Value": "3", "Rooms": "3", "Location": "5"}, "AuthorLocation": "New York", "Title": "“Location is Ideal”", "Author": "LaDolceFarNiente", "ReviewID": "UR10042281", "Content": "We stayed in the Hotel Smeraldo for 3 nights in Sept./Oct. '07. The location was ideal as it was around the corner from Campo De Fiori and very close to P. Navona, the Pantheon, as well as many shops, bakeries, etc. The room was completely adequate...in fact, we thought our bathroom was quite large for European standards and it was obviously recently re-done. Water pressure was excellent and being two larger people we had no problems \"fitting\" in the shower (others had complained this would be a problem--not for us!). Yes...the room itself was tiny....but who cares? We compared it to a room in NYC....and we were rarely in there anyway. The hotel/room was clean as well. The beds could have been a bit more comfortable but after walking the streets in Rome all day one tends to just pass out regardless of the comfort of the beds...lol. When we first arrived I thought to myself, \"Uh Oh....the staff really are miserable SOB's as some people had commented\".....but after awhile they \"warmed up\" a bit and were more than helpful in arranging for our pick up to the airport the day of our departure. In fact, I recommend this service very much as the Taxi drivers can be somewhat inconsistent with their \"fairness\" in Rome. The driver arrived on time and it was a nice, comfortable car/ride. As for the breakfast....we didn't eat it....only because we enjoyed going across the street to the little cafe for our morning cappuccino and pastry. We unfortunately did not specify \"no breakfast\" upon booking so when I asked if we could delete breakfast from our room rate for the second two nights they said \"no\".....oh well...no biggie. But if you're considering booking this hotel....then definitely specify \"no breakfast\" upon reserving....the breakfasts across the street are much less expensive and the cafe doesn't charge for sitting! So....with that said....I would definitely return to the Hotel Smeraldo in the future and would recommend it to others. It's no frills.....but it's clean and the location is superb! Viva Roma!", "Date": "October 5, 2007"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Business service (e.g., internet access)": "3", "Check in / front desk": "4", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Portland, Oregon", "Title": "“Very good value”", "Author": "BlueCrow", "ReviewID": "UR8538873", "Content": "The hotel is well located, clean, and well appointed for comfort and rest. Although the rooms were smaller, they were adequate and accommodating. The breakfast offered was just right. The staff courteous. There's a nice little restaurant ten steps from the front door. True, it's no Best Western or Holiday Inn, but that just means it didn't suck like most moderately priced American hotels do. After 30 plus years travelling in Europe, we don't think you can go wrong with this little gem in the heart of Rome.", "Date": "August 29, 2007"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Check in / front desk": "3", "Overall": "4.0", "Value": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Oslo, Norway", "Title": "“Perfect!”", "Author": "NettyFletty", "ReviewID": "UR8507315", "Content": "This hotel is great for those who want a nice price and a decent hotel. It`s nice, clean, perfect location, you can walk to anything! ( with good shoes of course...) and the staff was ok. Even the breakfast was good! We had a very pleasent stay here. The only thing I did`t like so much, was the booking. I had to send my credit-card info by mail, something you normally avoid... (You can of course send it by fax, but I didn`t access to that. )", "Date": "August 26, 2007"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "4.0", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Homewood, Alabama", "Title": "“Great location, helpful staff”", "Author": "tidemom", "ReviewID": "UR8115683", "Content": "The Smeraldo is in a very good location surrounded by great restuarants, shopping, and sights. We arrived on a huge tour bus and the hotel is located on a very narrow street. The bus had to let us out a couple of blocks away with our luggage. That was the only real downside. I was in a single room which was small, but very comfortable and clean with very nice tile floors. I had a balcony with table and chairs which was a real plus and a patio/terrace just steps away from my room. The hotel staff was very helpful but they were very busy most of the time and not very friendly. I had to lay on my southern charm to get a smile. I have to say that they did help me get out of a difficult situation the day I checked out. Went to get Euros from the ATM to pay for my taxi to the airport. The ATM ate my card, leaving me with no way to pay taxi. The hotel agreed to add 50 Euro to my hotel bill and gave me back the cash for the taxi. I would definitely stay at this hotel again.", "Date": "July 14, 2007"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Check in / front desk": "2", "Overall": "2.0", "Value": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Oak Park, IL", "Title": "“Good location but a booking mishap”", "Author": "DavidandTaniaH", "ReviewID": "UR8079231", "Content": "This B&B/hotel is a good bang for your buck especially during high season. It is centrally located, around the corner from campo de fiori with piazza navona close by. The rooms were clean but with very small bathrooms. The mishap that took place was that we had changed the dates of our reservations with them only to find out at our check-in that they hadn't applied the changes to the their \"books.\" We ended up getting charmed by one of the staff members (owner?) and we shared a twin bed for a night and then got a bigger room with a double bed the following night. Overall, a good & affordable place to to stay while on foot most of the day seeing the sites.", "Date": "July 8, 2007"}, {"Ratings": {"Overall": "3.0"}, "AuthorLocation": "wisconsin", "Title": "“Good location”", "Author": "novice_anna", "ReviewID": "UR8057102", "Content": "The location of this hotel is fantastic and the price is reasonable. This hotel was clean and the air conditioning worked well. Like other reviewers have noted, the staff was crabby and this is a place to sleep- little more. We had room 206- which is about the size of cruise ship cabin. While the room met our needs we did notice the walls of the rooms were very thin. We could hear every conversation, action, etc in the room next door. Overall, a reasonably priced hotel in a great locaton", "Date": "July 4, 2007"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Business service (e.g., internet access)": "3", "Check in / front desk": "4", "Overall": "4.0", "Value": "3", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Puyallup, Washington", "Title": "“My favorite area of Rome to stay in!”", "Author": "Puyallup1", "ReviewID": "UR7961634", "Content": "The Hotel is located in the Campo di Fiori neighborhood, close to Piazza Navona, Trevi Fountain, and the Pantheon. There is a daily market in the sqare, a variety of good restaurants, fast food, laundry, internet, bakery, deli, and other interesting shops nearby. The location is very convenient for taking the tram or bus to other parts of the city. The hotel entrance and lobby are small. The staff is helpful and able to answer questions reasonably well in English. I very much appreciated that they allowed us to check in early. The breakfast is a little better than average for Italy in the variety and amount of food available. The hotel was renovated recently and the rooms are small but nice, clean, quiet, reasonably priced, and comfortable. I will definitely stay there again when I go to Rome.", "Date": "June 22, 2007"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Check in / front desk": "2", "Overall": "3.0", "Value": "3", "Rooms": "2", "Location": "4"}, "AuthorLocation": "Wausau, Wisconsin, USA", "Title": "“Good, But....”", "Author": "PeteskiWausau", "ReviewID": "UR7726710", "Content": "Booked it directly after seeing it on kayak.com. The location was great, and that was the main plus. The room was small, even by Rome standards, but the real problem was the bathroom: the shower curtain didn't quite cover the basin - and it was outside of it! Every shower lead to a small lake, even if you were careful with the flow's direction. And the desk staff? They seemed so friendly on the phone and via email, but in person? Slightly to the churlish side of indifferent, although they did answer questions. The breakfast was excellent and that staff was good. There's a nice bar across the street. I'd actually go back here if I could have a slightly larger room with a better designed shower arrangement.", "Date": "May 31, 2007"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Check in / front desk": "2", "Overall": "2.0", "Rooms": "3", "Location": "3"}, "AuthorLocation": "New York", "Title": "“Not the greatest”", "Author": "mangiamo", "ReviewID": "UR7725337", "Content": "We stayed here on the final night of a two week trip to Italy, having prepaid by CC. The people at the front desk were pre-occupied most of the time, could hardly get anyone to notice us. Room was small but that was expected, shower very tiny, and you had to watch your head as you entered the Bathroom, as there was a fixture that your head could hit. The day was very warm and we tried to use the AC, no luck. I went down to the front desk and received incorrect info on how to get it going. Went down again and eventually a worker came and got it going. Arriving back in the room later, the AC was OFF and no way was it able to be turned on. Breakfast was in a basement level rather cheerless room. Desk did come through when we asked for a cab to take us to the Airport, it came on time. We were happy to leave this hotel. First time I ever felt that way in Italy after many trips.", "Date": "May 31, 2007"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Houston, Texas", "Title": "“Wonderful stay at Smeraldo Dependence”", "Author": "marytexas10", "ReviewID": "UR7721531", "Content": "After reading some of the negative reviews on the site, I booked the Smeraldo Dependence (formerly Parione) hotel rather reluctantly. But boy, am I glad I did! We had a wonderful stay at this hotel. The room was very small, but spotlessly clean, with CNN on the TV and an ice cold A/C (and I know what I'm talking about, I'm from Texas!). We were on the 4th floor and the only noise we ever heard was the sound of church bells nearby. Our window also opened up onto a charming courtyard. The cleaning staff was fastidious and very pleasant. We checked in around 12:00 noon and our room was ready and waiting. The rate was 120 Euros per night, per Rick Steves book. (We were required to pay for the entire stay upon check-in, which I did, and we had no problems, it actually made check-out a breeze.) The man at the front desk was very nice and showed us across the street to the Dependence. As two ladies traveling alone, my primary concern was safety. We ended up feeling very safe, because the glass door to the hotel is always locked and they buzz you in only after you ring the bell and they see you through the security camera. There were also security cameras in the elevator of the building and in the hallway outside our room. The bakery (Roscioli) right next door to the Dependence is FABULOUS! Lots of locals, especially at lunchtime, getting pizzas and bread. The Campo area is right in the middle of it all. Overall, for someone looking for a clean, simple, safe hotel in a great location, I think you couldn't do any better than Smeraldo Dependence.", "Date": "May 30, 2007"}, {"Ratings": {"Service": "2", "Cleanliness": "4", "Check in / front desk": "2", "Overall": "2.0", "Value": "2", "Rooms": "3", "Location": "4"}, "AuthorLocation": "St. Louis", "Title": "“Good Location is all I can say”", "Author": "WKtraveler", "ReviewID": "UR7698022", "Content": "This hotel is in a great location and clean, but that's about it. We stayed there for 2 nights, and we were happy to leave. When we arrived it was early because of our flight, we were surprised to find out that there was no locked place to leave our luggage. Then ended up giving us one of the two rooms we reserved...but reluctantly. We have traveled in Europe before, and have experienced showers that are difficult to use....but this one had no hot water and a shower curtain constantly sticking to you throughout the experience. We had an air conditioner that worked, but my parents had one that constantly ticked throughout the night. We also met other travelers that air conditioner didn't work at all. I know Rick Steve's says this is a great deal....but I just don't get it.", "Date": "May 25, 2007"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Business service (e.g., internet access)": "2", "Check in / front desk": "2", "Overall": "2.0", "Value": "2", "Rooms": "2", "Location": "4"}, "AuthorLocation": "London", "Title": "“Barely OK - just a place to sleep”", "Author": "FoodyExpress", "ReviewID": "UR7572015", "Content": "Was here with a group for several days. The rooms were small. Ours was on a central well and was dark with no real natural light. It was however quiet, as it looked on to the centre of the hotel. Other members of our group had rooms over the street. Still small and a bit noisy if you wanted a quiet night's rest. Our room was more of a corridor, rather than a square room. The bed was really the only place to sit. The TV was old and small. The advertised air conditioning never worked. This was the same for all our party. The desk said they were waiting for it to be fixed, but it looked more like it was just turned off centrally to save money. The breakfasts were worth a miss. The orange juice was actually an orange flavoured drink - how could they do that in Rome. There was a roof terrace - not big but nice to get out of the room - nothing fancy - plastic seats. The main plus point is the location - near Navona and De Fiori. Don't plan to stay in - get out and see Rome - from dawn to dusk.", "Date": "May 9, 2007"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Check in / front desk": "1", "Overall": "2.0", "Value": "2", "Rooms": "3", "Location": "5"}, "AuthorLocation": "San Francisco, California", "Title": "“Loved the Location, only”", "Author": "sanfranciscogirl", "ReviewID": "UR7481067", "Content": "The location is the best part of this hotel experience. The hotel itself is dreary and the staff unfriendly. The rooms are small and not as clean as I had read in reviews when I was originally looking to book. The showers, which have mold, are too small for anybody who is not trim to fit into. The staff, for the most part, is unresponsive, and often rude. The location is its best attribute, within walking distance to the Colosseum, the Trevi Fountain, the Spanish Steps, Via del Corso, Piazza di Campo dei Fiori, and much more. While the price was certainly reasonable, I would not stay here again.", "Date": "April 29, 2007"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Business service (e.g., internet access)": "3", "Check in / front desk": "3", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "San Diego, California", "Title": "“Hotel Smeraldo and Hotel In Parione”", "Author": "Cal-and-Aly", "ReviewID": "UR7268032", "Content": "Hotel In Parione is the sister hotel of Hotel Smeraldo. They are located right next to one another across a small street. We were surprised at the size and style. It was small, but had enough room for my husband and I. The shower was very tiny, but do-able. The staff was polite, but not overly friendly. Their shortness really did not ruin our stay. Our room was on the first floor and it was a bit noisy with the passersby below. Next time I would request a room on the 3rd or 4th floor, where it may be slightly quieter. The breakfast is not worth it, but there is a small bar across the street that serves breakfast and coffee in the morning. Roscholi Bakery is also right next door with yummy pasteries and bread. In fact, the hotel staff told me to tell the taxi driver it was next to the Roscholi bakery because everyone knows that bakery and he wasn't kidding! It was a perfect landmark. The location of the hotel is perfect because it really is within walking distance to most attractions.", "Date": "April 1, 2007"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Business service (e.g., internet access)": "2", "Check in / front desk": "3", "Overall": "4.0", "Value": "4", "Rooms": "2", "Location": "5"}, "AuthorLocation": "boston", "Title": "“Great location, clean rooms....”", "Author": "wooble5", "ReviewID": "UR7215656", "Content": "We stayed here from March 9-13th, 2007 First I must say that the hotel was just what we expected. We had been recommended this hotel by some friends who stayed here years ago and loved it. It met our needs and was a wonderful location. I would recommend this hotel to anyone looking for a reasonably priced hotel in a good location that has clean rooms and a competent staff. We don’t regret our choice at all, and unless stumbling across a better deal – would stay here again. The hotel was always prompt returning emails. Anytime I emailed, they responded quite quickly. We used the hotels car transfer for 55€, and it was very good. Had I done my research I found there is a cheaper transfer through Rome Shuttle Limousine for 35€. But the hotel’s car service was just fine and on time. The driver spoke some, but little English, which was fun because I was able to practice my Italian. When I had called, they mentioned we could probably check in when we arrived around 9:00am however, we ended up having to wait about 2 hours. They offered to let us keep our luggage in the back sitting room, but it wasn’t secure so we opted to sit and wait. The front desk was friendly and fine. No one was rude. They were mostly helpful. The rooms were fine. Just that – rooms, no frills. Yes, the rooms were small, although large enough to be functional. Everything worked fine as well. No complaints. And the rooms were very clean. So for the location, the rooms were just what we had been looking for. The bathroom again, was small but functional. We did have problems with the water temperature. It wasn’t always hot, and would get cold during the shower and yes… the fans in the bathroom are very loud. You aren’t able to turn on the light separately, so you have no choice but to use them. And once you have turned off the light, the fan stays on for another 3-5 minutes. And I agree about the breakfasts. Not good. We were not smart enough to ask them to remove the breakfasts from our room price; we didn’t know that was an option. The breakfasts were less than mediocre and consisted of hard bread, weird ham, cheese, and orange juice that was more like tang. We skipped breakfast there and went across the street most days. We loved the little place across the street. We LOVED their fresh squeezed red orange juice, and most mornings we each ordered café latte, OJ and a pastry. For two, we usually paid about 8€. Our only other complaint was the noise. Not from the outside street… but from the other rooms. The walls were quite thin, and you could here quite a bit. I don’t believe the other guests were necessarily being loud; I just think the walls were thin. However, the noise from the street was minimal, and what we did hear was fun to hear – scooters, mainly. But none of the noise was too bad… it’s just an observation for those light sleepers out there. All that said, the location was the main perk. Very close to Campo di Fiori. Maybe a 3-5 minute walk. Also close to the Pantheon and Piazza Navona (maybe a 15 minute walk). We even walked to the Coliseum and yes, Vatican City. Although, we were quite tired after those walks. I wouldn’t necessarily call those sites walking distance, but only a little over a mile maybe. Cabs were pricy there, and a little scary (scarier than NYC cabs). So we kept cab rides to a minimum. But although it may sound like I am nit-picking, we liked the hotel a lot and would return. I was just making honest statements so that readers can read all the facts and make a well informed decision. For the price, the hotel was just right and the location was even better. As for Rome, here are my tips on Rome: We did not find it unsafe and had no problems. Favorite dinners were at Ditrambo (a great option for Sundays, since many places are closed. It was our favorite restaurant in Rome and close to the hotel) and Matricianella near the Spanish Steps. We found ordering one antipasta, two first courses and sharing a second course was the best way to keep the bill down. We also ate at Colline Emiliane, and in my opinion it was not charming and was over-rated and over-priced. Also, Rome is much much larger than other cities we visited. We probably walked 2-3 miles a day at least. We didn’t take buses or cabs much, and so maybe that is our own fault, but just a note to bring some comfortable walking shoes. Also, we did make the mistake of eating right on Campo di Fiori…awful. Our waitress was from Pittsburg if that says anything. Eat right off the square at Ditrambo or Costanza. I also wish I got to try Da Armando al Pantheon near the Pantheon, but we never did. Another thing I noticed in Rome…. Not as many people spoke English as I had expected. Everyone told me, “Oh, everyone in Rome speaks English.” Not so true. Most everyone at restaurants and hotels did… and the main tourist sites…but besides that… not so much. And not one of the cab drivers we dealt with spoke English. Luckily DH and I took a few courses last year and were in decent shape… but out of all the cities we visited, Rome was the most difficult to communicate in. Maybe we are rare… but that’s what we found.", "Date": "March 24, 2007"}, {"Ratings": {"Cleanliness": "5", "Check in / front desk": "2", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Merseyside", "Title": "“No complaints”", "Author": "MerseysideTourist", "ReviewID": "UR7191656", "Content": "Seven of us stayed here on a \"girls\" weekend away for 3 nights in 3 rooms. We had no complaints about noise or smells and all the rooms were on the first floor. We didn,t ask much from the reception staff, they were fine except for one grumpy man on the night before we left who huffed and tutted when there was a bit of confusion about the bill. The hotel is clean and comfortable in a very good location, we used the pick up service from and to the airport, it was 90 euros each way and well worth it. Weren,t too impressed with some of the places we ate in Campo de Fori and Piazza Navona, mabye we should have done more research. Don,t go to Babingtons tea rooms near the Spanish Steps, we paid 104 euros for 7 cups of tea and some not very good cake. Would stay at this hotel again without hesitation", "Date": "March 19, 2007"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Business service (e.g., internet access)": "3", "Check in / front desk": "4", "Overall": "5.0", "Value": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "San Diego, CA, USA", "Title": "“Location makes it worth it.”", "Author": "tmolta", "ReviewID": "UR7171904", "Content": "We stayed four nights here in March. The hotel is, for the most part, utilitarian, i.e., a place to get a good night's sleep. It is not fancy by any means but it is clean. Its location is what makes it great. You are smack dab in the middle of what I think is the most pleasant part of Rome: right near Campo de Fiori, and a short walk to Piazza Navona, the Pantheon, and Trastevere, three of my favorite parts of Rome. The fancy hotels on Via Veneto can't hold a candle to Smeraldo in terms of location, in my opinion. From the Smeraldo, you can pretty much walk everywhere (and we did!) A couple of things to beware of. First, the breakfast is horrible. Try to avoid buying it as part of your room rate. We had Rick Steves' current guidebook to Rome. After the first day, I inquired about excluding breakfast. They said it was included in our price. When I said the guidebook appeared to indicate otherwise, they asked if it was Rick Steves' book. I showed them my copy and they agreed to take 25 Euro off the price, per day, for no breakfast. 25 Euros was way more than needed for the three of us to have excellent continental breakfasts in the caffes nearby. Second, check out the fan in the bathroom when you check in. Others have complained about the noise and that was the first thing I noticed when I checked in. What a racket! The room next door had the same problem and they woke me up every morning just by using the bathroom. There is no \"off\" switch for the fan and despite what they tell you at the front desk, the noise never gets better.", "Date": "March 16, 2007"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Sussex", "Title": "“Just Fine”", "Author": "AcornsSussex", "ReviewID": "UR6833346", "Content": "Read the mixed reviews but booked direct anyway because we wanted somewhere central and affordable (with 5 people incl 3 children we couldn't afford the hotels on the Via Venetto!). We thought it was just fine and the location really couldn't be bettered. We had a double and an adjoining triple on the 4th floor quiet side and the room sizes were okay. It may be that some travellers from the USA aren't used to the size of european hotel rooms but I've travelled widely for business and privately and in my opinion at these rates the rooms were good. In any case, we were in them from 11pm to 8am apart from a late afternoon rest each day - you shouldn't be spending much of your time in Rome in your hotel room! The staff on the desk were, well, Italian! Which is to say they were, like the title to this short review, just fine. We really had no problems at all. To summarise, if you want a clean safe hotel in a great location at good rates, the Smeraldo should be a good choice for you. If you want 5 star service and large rooms with 5 star prices book a room at the Westin Excelsor on the Via Venetto.", "Date": "February 23, 2007"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Business service (e.g., internet access)": "3", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Aptos", "Title": "“Great Location in Rome”", "Author": "AptosLeone", "ReviewID": "UR6833079", "Content": "We spent four nights at the Hotel Smeraldo and enjoyed every minute. It's down a narrow side street, and, yes you do wonder what you are getting into upon first arrival, but once there, its a great find. The hotel is clean and remodeled and the staff was very helpfull. You need to walk up a flight of stairs to get to the elevator, but this was no big deal for us. The location can not be better. We seemed to be able to walk everwhere -- and I did one day.", "Date": "February 23, 2007"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Check in / front desk": "3", "Overall": "3.0", "Value": "3", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Chicago, Illinois", "Title": "“Ok hotel for a good price”", "Author": "ChicagoMusicFan", "ReviewID": "UR6710592", "Content": "A good price for Rome. I paid 100 Euros a night for a queen bed. They gave me a discount becuase I mentioned Rick Steves book. The location was good, near Campo de Fiori. The staff was a little rude, and was not very helpful as far as recommended sites/restaurants. It was a typical budget European hotel. The room was clean, but nothing great. It was definitely small, but that doesn't bother me. The bed was just slightly uncomfortable. The bathroom was very small, but adequate. Overall, I'd say it was a good budget hotel. If I were going to Rome, I would consider this hotel again, but I'd probably also look for other hotels with good locations in this price range.", "Date": "January 28, 2007"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Check in / front desk": "4", "Overall": "4.0", "Value": "5", "Rooms": "3", "Location": "5"}, "AuthorLocation": "wiswell", "Title": "“Wow what a location”", "Author": "ian444", "ReviewID": "UR6595252", "Content": "You cannot get a better location in Rome than this hotel 5 minutes walk from the Campo De Flori Piazza Nova, Pantheon and the River Tiber. Yes the rooms are small but clean, some of the staff can be off putting but others were very helpful. But you should not be in this hotel except to sleep, you are slap bang in the middle of the eternal city. Excellent value for money", "Date": "January 14, 2007"}, {"Ratings": {"Service": "1", "Cleanliness": "3", "Check in / front desk": "1", "Overall": "1.0", "Value": "2", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Ann Arbor, MI", "Title": "“Problem with reservation”", "Author": "treetownie", "ReviewID": "UR6553220", "Content": "Cute place, good location within Rome (although there are MANY hotels in this area). I had a problem with my reservation. My email communications with the hotel indicated I had reserved a room for 6 nights, but when I arrived they claimed to have no record of it ( a travelor's nightmare). They gave me a room for 2 nights, but the 2 gentlemen at the desk were quite disagreeable, arrogant and unhelpful. They said they would assist me in finding alternative accomodations, but clearly did not do so. I was able to find another place without any difficulty.", "Date": "January 4, 2007"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Check in / front desk": "3", "Overall": "3.0", "Value": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Los Angeles, CA", "Title": "“Good hotel, good price”", "Author": "Dreamin of Travel", "ReviewID": "UR6457938", "Content": "We stayed here in the beginning of November and had a good experience. I had read reviews on here (after booking) and read about smelly rooms on the first floor. Of course, they gave me a room on that floor but changed it to the fourth floor when I asked (i never saw, or smelled, the first room). Our room was decent size and was clean and comfortable. The location was great and we could walk everywhere. The staff wasn't overly friendly or in your face, which i prefer, but they were helpful when I had questions. They made restaurant reservations for us and they helped us find football/soccer tickets. I would stay here again, especially because the price was great.", "Date": "December 18, 2006"}, {"Ratings": {"Cleanliness": "5", "Check in / front desk": "1", "Overall": "1.0", "Value": "1", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Hondo,Tx", "Title": "“Good Hotel - But will not stay here again”", "Author": "Oliver456", "ReviewID": "UR6344432", "Content": "We stayed 3 nights in this hotel in November. The room was comfortable, the bathroom wasn't large but it was more than adequate. The place was spotless. We would not stay here again. The managers were the most unfriendly people I have encountered in the hotel business. We did not bother them with any questions. It was made very clear in the beginning they were not interested in being of any assistance. They acknowledged our presence only when we made them, by speaking to them first. The housekeeping staff was very friendly and pleasant and they do an excellent job of keeping the place clean. On our next visit to Rome we will take our business elsewhere.", "Date": "December 7, 2006"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Kildare", "Title": "“excellent value”", "Author": "kildareman", "ReviewID": "UR6321175", "Content": "We stayed for four nights.Yes it can be noisy ,but the rooms are spotlessly clean and adequately furnished.The staff were friendly,breakfast was ok and the location is absolutely superb.It would be difficult to get a better hotel at the prices they charge. It is perfectly situated for exploring rome and there are loads of restaurants and bars nearby. In contrast to some of the other comments,we found nothing negative at all . Go and enjoy.", "Date": "December 3, 2006"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "4", "Overall": "5.0", "Value": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "arizona", "Title": "“Loved the Smeraldo”", "Author": "worldroamers", "ReviewID": "UR6138768", "Content": "The Smeraldo is a charming little hotel in the heart of Rome. it is surrounded by great restaurants and trattorias, and within walking distance of many of the sights of rome, i.e. the Trevi Fountain, Campo di Fiori, and the Pantheon. Being a part of the downtown picture was important to us, and we spent hours wandering the narrow streets, stopping to enjoy gelato or panninis or just sitting on a bench watching the people. At night we frequently ate at neighborhood restaurants or the trattoria across the street which was excellent. Although the hotel is in the middle of downtown it is quiet when the windows are closed, and air conditioning is adequate. We, however, frequently left the windows open so we could enjoy the sounds of the night and the church bells in the morning. While the rooms and bathrooms are small, they are clean and comfortable. The beds were excellent, and the bathrooms in good working order. The staff was friendly and very helpful. They gave us good advice on directions and things to see as well as making sure that we were well taken care of. The breakfast was quite good and rivaled what we later found in much more expensive hotels. We hope to someday return to the Smeraldo as it was a wonderful introduction to our three week stay in italy.", "Date": "November 16, 2006"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Check in / front desk": "1", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Australia", "Title": "“Fine for 5 nights”", "Author": "rachel101", "ReviewID": "UR5985640", "Content": "I can't say that I experienced any of the issues that previous guests appear to have encountered. I booked 5 nights as part of a round the world trip and was on a budget so was worried about whether it would be a mistake. When I arrived the staff were very grumpy, but the room was large and airy with french windows overlooking the street below. The location of the hotel was excellent being within walking distance of all major sites including the Vatican City, The Trevi Fountain and the Forum and only a short stroll from restaurants and shops. Breakfast was adequate and fair....as far as you can say that about Italian breakfasts. The room was air conditioned but could only be controlled by reception which was sometimes frustrating. A perfectly fine hotel for someone looking to pay less than £100 a night in Rome.", "Date": "October 23, 2006"}, {"Ratings": {"Service": "1", "Cleanliness": "4", "Business service (e.g., internet access)": "2", "Check in / front desk": "1", "Overall": "2.0", "Value": "2", "Rooms": "2", "Location": "3"}, "AuthorLocation": "Melbourne", "Title": "“Avoid, there must be better than this....”", "Author": "Jen&Brad", "ReviewID": "UR5712826", "Content": "We stayed in Rome for 3 nights and whilst we absolutely loved Rome itself we were unimpressed with this hotel. We travelled for 6 weeks through 11 hotels and were able to pick highs and lows for all of them but to be honest this was the worst experience we had for the price that we paid. The staff were unpleasant, they made us feel as though we were imposing on them by asking questions (places to eat, local maps, etc. normal stuff we thought), we even got a few sighs out of them when we asked some of our questions. It seemed as though they had somewhere better to be. The room was exceptionally small, you could literally jump from the front door, land on the bed, step from the bed and be in the bathroom. There was no space for suitcases, no security safe, no minibar. Some of these things I'm not that phased if I do or don't get but normally there are other positives that make these things seem less significant, here there was minimal we could be positive about. The location was good but we had trouble three times with transport who wouldn't take us all the way to the door as it was more down an alley than on a main street, so we did have to walk through back streets with our luggage before getting to the hotel. I can say from a positive side was that the room was clean and it had air conditioning, but that is as positive as I get.", "Date": "August 27, 2006"}, {"Ratings": {"Overall": "2.0"}, "AuthorLocation": "sgtoca", "Title": "“Decent enough but lacked in some areas”", "Author": "sgtoca", "ReviewID": "UR5557147", "Content": "Was there for 4 nights. The rooms are small which I have come to accept for Italy. The washroom was also small and the shower really narrow and somehow kept flooding. We had asked for a room change only to be told that we can have another room for 2 nights then have to move again, hmm, not very good service, it was low season and I am certain they were not sold out so I felt they were not accomodating. The restaurants recommended by the front desk were mostly tourist traps and often we stroll to an alley away from the tourist traps to find a family owned restaurant that is far better and less expensive. We had wanted to change hotels but as we were not familiar with the city and were tired at this point after going to 3 other Italian cities, we decided to stay put. The A/C did not work very well. But the room was clean. Breakfasts was ok, simple bread, cookies, cereal, yogurt. Most Italian hotels provide similar breakfast so don't expect eggs or bacon. You can find lots of places around that serve eggs if u must have them in the morning. The hotel was within walking distance to most tourist sites, museums etc. Even walking to Ancient Rome, Coliseum, St Pietro's Basilica is doable, about 30-40 minute walk and when in Rome, u gotta walk as everywhere u turn, its a site to see, a ruin, amazing! We also did the Bus and Boat tour for one day and that was really fun, $13 per person and u get a 30-40 minute bus ride around the city followed by a half hour boat ride, great deal! If u need a change from pasta or pizza and want something light, I highly recommend a restaurant called Insalata Ricca about 5 minutes from this hotel that is amazing, They serve big bowls of salads (among other usual Italian fare) that is hearty and healthy.", "Date": "August 5, 2006"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Check in / front desk": "4", "Overall": "4.0", "Value": "5", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Tennessee", "Title": "“Perfect hotel for our group”", "Author": "bopandnana", "ReviewID": "UR5510847", "Content": "A group of us stayed at the Smeraldo in June, 2006. We were very pleased. The rooms are small but clean and comfortable. The air conditioning was invaluable in the June heat. The price was exceptionally reasonable for Rome. We enjoyed the little bar/coffee shop across the little cobbled street as well as the trattoria adjacent to it. We walked everywhere from the hotel. The location is perfect! We will definitely stay at the Smeraldo on our next trip to Rome.", "Date": "July 25, 2006"}, {"Ratings": {"Cleanliness": "4", "Overall": "4.0", "Value": "5", "Service": "4", "Rooms": "3"}, "AuthorLocation": "Shreveport, Louisiana", "Title": "“Good Stay at the Smeraldo”", "Author": "A TripAdvisor Member", "ReviewID": "UR5438666", "Content": "I stayed at the Smeraldo on my second trip to Rome. You can not ask for a better location. You are central to all the tourist sites. The Vatican and the Colesseum are about equal distance each way from the hotel and a five minute walk to the Pantheon. Also the hotel is two short blocks from a major city bus stop, and the city bus will become your friend. I know other reveiwers are commenting on the small room sizes. Americans need to face the reality that European hotel rooms are much smaller than the American hotels. So do not knock the Smeraldo for having small rooms. I have been to four European countries and they all have small rooms. The only thing we did not like about our room was the shower was small. The breakfast in the morning was plenty. The staff was able to accomodate all of our requests in English!", "Date": "July 7, 2006"}, {"Ratings": {"Cleanliness": "5", "Overall": "5.0", "Value": "4", "Service": "5", "Rooms": "4"}, "AuthorLocation": "St. Louis, MO", "Title": "“Great hotel in the middle of everything”", "Author": "A TripAdvisor Member", "ReviewID": "UR5351898", "Content": "Great location, nice clean rooms. Walk to everthing. Highly recommended. Very helpful staff. All spoke English.", "Date": "June 15, 2006"}, {"Ratings": {"Cleanliness": "5", "Overall": "5.0", "Value": "5", "Service": "5", "Rooms": "5"}, "AuthorLocation": "Williamstown, MA", "Title": "“Location, Location, Location!”", "Author": "BerkshireGal", "ReviewID": "UR5295681", "Content": "Just back from six nights in Rome and we totally loved the Smeraldo! We booked our stay through Virgin Vacations and upgraded to the Smeraldo after reading favorable comments on this website. (Thank you tripadvisor fans!) This hotel is in such a great spot -- as several earlier reviewers mentioned, you can walk to all the major sites. We are both 60+ and we walked everywhere -- never used a bus or the subway. The location in the twisty, old cobbled streets just off the Campo dei Fiori was wonderful. After a busy day sightseeing, the Campo is the perfect spot to sit with a glass of wine and people watch. Lots of great restaurants on the Campo and nearby. The hotel itself was really perfect -- very clean, recently rennovated, with a polite and helpful staff. Our room on the third floor was roomy with a king-size bed (wonderful mattress!) and lots of storage space (which is handy when you are staying as long as we did and don't want to live out of your suitcase). We were lucky to have a room that opened to the back of the hotel -- we could see one of the hotel's terraces and the dome of a nearby church from our window. We slept with the window wide open, shutters thrown out and it was as quiet as if we were in a remote Tuscan village -- hard to believe in a city as noisy as Rome! The bathroom was very modern -- small shower stall but perfectly adequate unless you are an oversize person and the water was always hot. The breakfast was great -- Continental style but who needs a heavy, hot breakfast if you are eating a big lunch (Roman style) and dinner. The breakfast room which was always busy, was bright and cheery and everyone seemed happy with the selections. We highly reccommend the Smeraldo! And, thanks tripadvisor for making our Rome adventure memorable!", "Date": "June 3, 2006"}, {"Ratings": {"Cleanliness": "5", "Overall": "4.0", "Value": "5", "Service": "4", "Rooms": "3"}, "AuthorLocation": "UK", "Title": "“Great, clean hotel - fantastic location!”", "Author": "weeangel", "ReviewID": "UR5057319", "Content": "I stayed at the Smeraldo over Easter weekend and thought, for the price, it was absolutely perfect. The hotel is immaculately clean, very queit, the rooms are typical 'Italian' size but we weren't there to be in the hotel room! It is literally two minutes stroll from Campo di' Fiori and another couple to Piazza Navona and incredibly safe, walking back at night was no problem at all. We thought all of the staff were very nice and the concierge helped us book a taxi through a company we wanted (cheaper than the hotel offering) with no hesitation, none of the gruffness other visitors report. I would definitely recommend this hotel.", "Date": "May 12, 2006"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Madison, WI", "Title": "“OK, Not Great”", "Author": "Madtowntravelgirl", "ReviewID": "UR5025966", "Content": "I spent two nights at the Smeraldo in February, 2006, with my three children (ages 13, 10, 6). The best thing about the hotel is its location near the Campo de Fiori and within walking distance of just about all the major sites. The rooms were clean and relatively quiet, although noise does tend to carry from the corridors. The problem is that they are miniscule. Even though we rented two rooms, I could hardly stand to stay in them for more than 10 minutes as there wasn't even enough room to park the luggage, let alone accommodate three sprawling kids. The double bed in my room cleared three of the four walls by only a foot. The shower stalls were equally petite. The breakfast, however, was fairly generous by Italian standards, with a selection of rolls, croissants, meats, cheeses, cereal, fruit and yogurt. There is also a very good bakery around the corner from the hotel that serves excellent slices of pizza and various breads and pastries for a lot less. The room price was a bit high in my opinion, around 170 euro for a triple. I recommend this hotel for couples or individuals traveling without children who want a great location and plan to spend only a minimal amount of time in the hotel room.", "Date": "May 1, 2006"}, {"Ratings": {"Cleanliness": "5", "Overall": "3.0", "Value": "4", "Service": "3", "Rooms": "3"}, "AuthorLocation": "", "Title": "“Clean, great location”", "Author": "A TripAdvisor Member", "ReviewID": "UR4994938", "Content": "We stayed at the Hotel Smeraldo for 4 nights in early April. While the double room we had was a little on the small side and not well lit, the bathroom was quite the opposite -- spacious by Italian hotel standards. The rooms were kept very clean. The location was really the strong point. We could and did walk to everything. It is only a couple of blocks from the Pantheon and the Campo de Fiore. I had been concerned about a possible noise issue wiith being on the 1st floor, but the windows and shutters do an excellent job of mitigating the noise, and the street is not a major thoroughfare anyway. Breakfast is about average for Italy, not the best we saw nor the worst. The problem we had was that there was an unpleasant odor with our room on the 1st floor. I had asked for a change but they could not/would not move us. My daughter took to calling it the Hotel Smelldorado. Our experience with the staff was that they were very responsive in terms of helping with maintenance needs, taxis, etc. (except for the ability to re-locate us) but they were not particularly outgoing otherwise.", "Date": "April 22, 2006"}, {"Ratings": {"Cleanliness": "5", "Overall": "4.0", "Value": "4", "Service": "4", "Rooms": "5"}, "AuthorLocation": "Yorkshire", "Title": "“Great little find”", "Author": "KelvinYorkshire", "ReviewID": "UR4973892", "Content": "We have just returned from a 3 night stay at the Smeraldo and found the hotel perfect for our requirements-great location surrounded by bars, cafes and boutiques- friendly staff who advised us on bus numbers and arranged taxis for us- adequate breakfast-clean, modern tasteful rooms (with hair dryers)and good value for money. Only down side was the air conditioning was not very effective and my parents room was on the noisier side of the street (310). The other 2 rooms were very quiet (306 and 107). A great find in a beautiful part of Rome.", "Date": "April 14, 2006"}, {"Ratings": {"Cleanliness": "5", "Overall": "5.0", "Value": "5", "Service": "4", "Rooms": "4"}, "AuthorLocation": "St. Louis, MO", "Title": "“What a perfect location!”", "Author": "jamtam", "ReviewID": "UR4972635", "Content": "We loved the Smeraldo Hotel. The location was fabulous and we found the staff to be very helpful with any requests we had. Our room overlooked a small street with a bakery, was fun to watch them making bread in the mornings. I would definitely return to this hotel for our next visit to Rome!", "Date": "April 14, 2006"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "New Jersey, USA", "Title": "“Great All Around Hotel”", "Author": "SLC24", "ReviewID": "UR4954838", "Content": "The location of this hotel was perfect. You could walk to almost everything! The rooms were very nice and clean and I found the concierge to be very helpful. I would definitely stay at this hotel again.", "Date": "April 9, 2006"}, {"Ratings": {"Cleanliness": "4", "Overall": "4.0", "Value": "4", "Service": "3", "Rooms": "3"}, "AuthorLocation": "London, UK", "Title": "“Great location”", "Author": "A TripAdvisor Member", "ReviewID": "UR4578381", "Content": "We have recently returned from Rome and overall had a great stay. The hotel is ideally located as it is within walking distance of all the sights. It is also good for restaurants and nightlife. Two things to be slightly wary of are: Room 101 - we were put in there on our first night and from the moment we walked in we could smell the drains which wasn't too pleasant and most likely the explanation for them constantly opening our window (despite it being February!). We were moved on our second day so this wasn't much of a problem however it was a nuisance having to move our bags again. The only other thing to be aware of is the taxi drivers that hang round Termini (esp when the ryanair bus gets in). From Termini to the hotel we were charged 30Euros when we returned to meet the ryanair bus we were only charged 10Euros, this was booked by the hotel!.", "Date": "March 3, 2006"}, {"Ratings": {"Overall": "3.0"}, "AuthorLocation": "", "Title": "“Note about their booking policy”", "Author": "A TripAdvisor Member", "ReviewID": "UR4415262", "Content": "Though I found B&B that is little more expensive (40 euros) the amenitites are way better (the book restaurants, museums, breakfast included, etc.). I just wanted to point out that when you book with Hotel Smeraldo not matter how far in advance (5 months for me) and then cancel your reservation the will not refund the first night so you're out $150 dollars. Most places have a 15 days policy but this place is different. I just wanted to point out this lack of flexibility for those who may not know.", "Date": "February 5, 2006"}, {"Ratings": {"Cleanliness": "5", "Overall": "5.0", "Value": "5", "Service": "5", "Rooms": "4"}, "AuthorLocation": "Glasgow", "Title": "“Excellent budget hotel”", "Author": "A TripAdvisor Member", "ReviewID": "UR4398304", "Content": "The hotel is situated in an excellent, central location within walking distance (usually 10mins) of all the major attractions. The hotel and rooms were in an excellent, clean condition. Although rooms weren't massive, they certainly accomodated 2 adults comfortably for 5 nights stay. All hotel staff spoke excellent english and were friendly and helpful at all times. Our room (210), although facing the road, was quiet and we were not disturbed from noise levels. This hotel is an excellent choice for those who want modern, comfortable and clean accomodation within walking distance of all the major attractions.", "Date": "January 30, 2006"}, {"Ratings": {"Cleanliness": "4", "Overall": "3.0", "Value": "3", "Service": "3", "Rooms": "2"}, "AuthorLocation": "London", "Title": "“Good location”", "Author": "HHOG", "ReviewID": "UR4386511", "Content": "Good points: - Central, good location - walking distance to all the main sights. - Clean. Bad points: - Noisy (e.g. vacuuming in the corridor started at 8.30am in the morning - not a place to get a lie-in. There was also quite a lot of noise from the other rooms. Very noisy fan in the bathroom). - Small rooms - hardly room to swing a cat. - No hot water on our second morning. - No atmosphere - not a place to relax in. If you just want somewhere clean to sleep in a good location then this hotel is fine. If your expectations aren't high then you will find it ok but I found it hard to get particularly excited about the place!", "Date": "January 25, 2006"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Burlington, VT", "Title": "“Wonderful hotel, great location”", "Author": "vermontsue", "ReviewID": "UR4152987", "Content": "We just returned from Rome and a five night stay at Hotel Smeraldo. The room was immaculate, we had fresh towels and sheets every day, and the staff could not have been nicer. They booked opera tickets for us and were quite friendly. We stayed in room 405 and it was bigger than some of the others, also very quiet. We paid 100 euros/night for the room, even though it was advertised for 125 euros. We asked for a discount since we were not eating breakfast. I highly recommend Smeraldo - location was perfect. We were 5 minutes walk from Campo de Fiori, and Piazza Navona and an easy walk to almost everything else (Spanish Steps, Trevi 15 minute walk tops).", "Date": "November 29, 2005"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "philly burbs", "Title": "“very nice hotel, great neighborhood, great price!”", "Author": "italchk", "ReviewID": "UR4128358", "Content": "We stayed at the Hotel Smeraldo in Rome for 5 nights in October. We paid 125E per night, a rate guaranteed if we showed them our Rick Steves Italy 2005 book which recommends it. We read all of the reviews on tripadvisor and found the hotel to exceed our expectations. Hotel Smeraldo is in a lovely neighborhood, just a 3 or 4 minute walk to the Campo de Fiori. The rooms are tastefully decorated and most of the furnishings as well as the bathroom appeared to be almost new. The bed was quite firm and we thought we would find it uncomfortable to sleep on but this was not the case. We slept fine and the firmness of the mattress did not bother us at all which was a surprise. The room was extremely clean and maid service was excellent. As suggested in the Rick Steves book, we asked for a \"quiet\" room (away from the street) and although we were told they would do their best but could not guarantee this, they accomodated us and we had very quiet room away from the street. The maid service starts by 8 a.m so if you like to sleep late you might be annoyed by the noise generated in the halls during their cleanups.They had a \"hairdryer' which is a nozzle that comes out of the wall and it blows hot air. If you need to style your hair, bring your own with a converter/adapter. Warm, hot water was plentiful if you took your shower early. Our daughter took a shower a bit later once and only got lukewarm water. Upon our return to Rome and Hotel Smeraldo (we went to Siena for several days then came back to SMeraldo for one night), we were in a room that faced the street and it was rather noisy (street traffic,etc) but we took care of this by leaving the bathroom fan on all night. This worked like a charm in blocking out the noise. THey also gladly stored most of our luggage in the luggage room for us when we traveled to Siena (we came back to Smeraldo as I previously stated) so we would not have to drag it back and forth with us. There was no charge for this. Many reviews have stated that the staff is unfriendly or rude. They were a bit aloof at times, but since I knew that this might be a problem before I came there, I decided to go out of my way and be friendly to them each time I saw them. I would greet them in Italian and smile at them every time I passed the reception desk. Try it everywhere in Italy and you will be pleasantly surprised. They speak excellent English but seemed to appreciate my effort to greet them intheir language. They always helped me with anything I needed. They are not very social,but people should not miscontrue this to mean they are rude and unfriendly.Shy and somewhat aloof at times,perhaps but certainly not rude. Read about the Italians and their customs etc before you go and don't expect everything to be like it is in the US. Breakfast is available for about 8E per person but we did not buy it and it did not look like anyone else did either. There was only one person there making coffee our first morning and no one was even there on the subsequent mornings. Walk right our the door and cross the street and take a few steps to your left and there is an excellent cafe. Very reasonable coffee and cornettos(like a croissant). Remember though, you are in Italy and will pay extra if you sit. Eat at the bar and it is very cheap. You are a 5 minute walk from the bus stop and 10-20 minutes from most of the big attractions(Pantheon,Piazza Navonna, Colosseum,etc). The Vatican would probably be the longest walk --about 20 -25 minutes maximum. If you don't want to walk it, just take the bus 64 allthough it is usually very crowded and you will probably stand. There are many restaurants in the Campo de Fiori neighborhood in all price ranges. You can also stop at one of the nighborhood shops and pick up a slice of pizza for 1 or 1.50E. If you choose this hotel, you will be pleasantly surprised. We highly recommend it.", "Date": "November 20, 2005"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "UK", "Title": "“A great find”", "Author": "A TripAdvisor Member", "ReviewID": "UR4128188", "Content": "Have just spent a very pleasant weekend at the Hotel Smeraldo. Rooms are fairly small but look newly decorated and are very clean. Great location within walking distance of all the central sites and also a good choice of nightlife areas; I would recommend heading 5 minutes walk across the river to Trastavere. At night closing the double glazed windows keeps the bedrooms nice and quiet. Breakfast is good; we had ours included in the room price, possibly as an out of season deal. Very good value and recommended. Good time of year to visit.", "Date": "November 20, 2005"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "Stone Lake, WI", "Title": "“Highly Recommend Hotel Smeraldo”", "Author": "Kirbyp", "ReviewID": "UR4033460", "Content": "We just returned form staying at the Hotel Smeraldo in Rome. The hotel is very centrally located; within minutes of the Campo de' Fiori; within walking distance of the Pantheon, Colosseum and the Vactican. The rooms are quite small but adequate. The room was clean. There was quite a bit of noise in the evenings from street traffic but I think that might be a problem most anywhere in Rome!! There are many small cafes, wine bars and restaurants close by. We opted for a little cheaper rate that did not include the continental breakfast. With all the nearby places to eat I would recommend others doing the same.", "Date": "October 18, 2005"}, {"Ratings": {"Cleanliness": "5", "Overall": "4.0", "Value": "4", "Service": "4", "Rooms": "3"}, "AuthorLocation": "Gloucester, UK", "Title": "“Compact but good value and location”", "Author": "A TripAdvisor Member", "ReviewID": "UR4005339", "Content": "The hotel was recommended by a Roman and I enjoyed my stay there. Campo de Fiori, Piazzo Navona and many other sites are within easy walking distance. Lots of nice, not too expensive restaurants nearby. The rooms were compact, as you'd expect in a Roman side street but the furniture and fittings were good quality and in good condition though the shower was a bit of a tight fit! The hotel staff were most helpful and friendly and the breakfast better than average. They also spoke good English. I would happily stay there again.", "Date": "October 10, 2005"}, {"Ratings": {"Cleanliness": "5", "Overall": "4.0", "Value": "5", "Service": "5", "Rooms": "4"}, "AuthorLocation": "South Windsor, Connecticut", "Title": "“Good hotel with great location!”", "Author": "laritrav", "ReviewID": "UR4002994", "Content": "We stayed at the Smeraldo for 5 nights and really enjoyed it!! A couple of important points: 1. don't judge a book by its cover - the outside of the hotel does not look nice (there's graffiti on the walls) and it makes it look like maybe this is not a nice place to stay. When you walk in, it's a whole different picture. They recently renovated and it is a nice, clean and comfortable hotel. 2. The bathroom is small. I am not trying to offend so please do not take this the wrong way. Realistically, if you have trouble fitting in airplane seats, you will most likely have difficulty with the size of the shower. And I find this an important point to bring up because it has such great impact on your experience at this hotel. Our room and bathroom were very small but were always clean and had been redone not too long ago. The bathroom was all marble and looked very nice. When we got there, the AC was on and it was very cold in there. We didn't find a controller in the room but were able to reach the AC by standing on a chair and turned it off right on the unit itself. Our room faced a street with a restaurant and at night it did get pretty noisy - but once you close the window, you can't hear it anything anymore and can have a peaceful night's rest. At the same time, in the evening, you get the benefit of listening to the various artists playing music for the restaurant patrons. It was very nice! The personnel at the reception desk was extremely helpful and friendly!! (and spoke English). The breakfast was great with many choices. The location is perfect!! 10 min walk to Piazza Navona; 5 min walk to Campo de Fiori Piazza; 15 min walk to Vatican; 10 min walk to Pantheon; 15 min walk to Forum/Colosseum; 5 min walk to main bus stop; 5 min walk to a bank; and many great restaurants close by. In my mind, the location couldn't have been better! So overall, great hotel with an awesome location (and good price for the location) but some considerations to space need to be kept in mind.", "Date": "October 9, 2005"}, {"Ratings": {"Cleanliness": "4", "Overall": "4.0", "Value": "4", "Service": "3", "Rooms": "4"}, "AuthorLocation": "San Francisco, California", "Title": "“Great location!”", "Author": "Hampy", "ReviewID": "UR3847714", "Content": "My friend and I stayed at Hotel Smeraldo in June 2005. The location is amazing - walking distance to all of the major sites - - right around the corner from Campo Di Fiori & a couple of blocks from Piazza Navona. The Pantheon is also about a 5 minute walk. The rooms comfortable and quite nice. The front desk staff wasn't overly helpful, but the location makes up for it.", "Date": "September 7, 2005"}, {"Ratings": {"Cleanliness": "4", "Overall": "5.0", "Value": "3", "Service": "5", "Rooms": "3"}, "AuthorLocation": "San Antonio, TX", "Title": "“Great hotel in great location”", "Author": "mharden", "ReviewID": "UR3693184", "Content": "Two blocks from the Campo di Fiori, two more to Piazza Navona...within walking distance of almost every major site in Rome, and only one block from Largo Argentina, a major point for mass transit. Yes, the showers are tiny, and the shower doors difficult to close. The rooms are adequate in size, in marble and wood, with up-to-date fixtures. The air conditioning is effective, although there is no thermostat in the room (on or off via front desk is the only option), so it can get quite cold during the night. During an afternoon siesta, the sounds from the narrow medieval alleyways below offer a pleasing ambience...at night, closing the soundproofing doors allows you to sleep through the loudest motorcycle or truck bringing in produce for the daily Campo di Fiori market. The staff is efficient, courteous and speaks excellent English. The continental breakfast is good, although you can also drop in the bakery across the alleyway, and obtain fresh fruit from the market each morning but Sunday. There is a small but picturesque rooftop terrace with a great view of the neighborhood. I dropped a coin in the Trevi Fountain, so when we return, we'll stay at Hotel Smeraldo again...", "Date": "July 22, 2005"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Liverpool,UK", "Title": "“Ideal hotel”", "Author": "egremont", "ReviewID": "UR3676336", "Content": "Spent 4 nights at this hotel at end of June beginning of July after reading previous reviews of hotel.The location was great,our room was very good,very clean,air con and very quiet.Roof terrace was unavailable unfortunately.Reception staff were fine,all spoke excellent English.Breakfast was typical Continental,no complaints and the coffee very good.Would stay here again and recommend it.", "Date": "July 17, 2005"}, {"Ratings": {"Cleanliness": "2", "Overall": "1.0", "Value": "2", "Service": "1", "Rooms": "1"}, "AuthorLocation": "Boston, MA", "Title": "“poor”", "Author": "A TripAdvisor Member", "ReviewID": "UR3660473", "Content": "AC didnt work. Please dont expect American comforts in Europe unless you want to pay though the nose. I learned my lesson. Front desk was RUDE. Im tired of people saying that its 'European' No its called customer service. We asked where there was internet service and the man said \"I dont know\". Another person staying there asked where he could rent a car and the desk person said they didn't know. Very unfriendly and rude. Room was small and shower was tiny. I couldnt even fit in the darn thing. We actually left early and went to another hotel for the remainder of our stay. Paid a little more but had a real queen bed, AC that worked and hot food for breakfast. Dont want to advertise but it was much nicer!", "Date": "July 12, 2005"}, {"Ratings": {"Cleanliness": "5", "Overall": "5.0", "Value": "5", "Service": "4", "Rooms": "5"}, "AuthorLocation": "Newcastle, UK", "Title": "“Great Value for Money Hotel”", "Author": "A TripAdvisor Member", "ReviewID": "UR3647809", "Content": "Was a little worried when we arrived at the hotel up the small alleyway in the middle of the night. But it turned out to be a in a great location only a few minutes walk form all the key places - the main piazza's, Vatican, Pantheon, Roman Forum etc etc. The hotel is simply furnished but it is spotlessly clean and all the staff are really really helpful. I would definately recommend this hotel, I will be staying here again on my next visit to Rome.", "Date": "July 8, 2005"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "wilmette, il", "Title": "“location, simple, clean”", "Author": "A TripAdvisor Member", "ReviewID": "UR3624999", "Content": "we stayed on the second floor which is the third in italy, 0 being the first floor. we overlooked a bakery that was fantastic. eat there. the locals do. the room was small and clean. shower tiny. the staff was great. no problems with the front desk. they were very efficent and did evrything as promised. taxi waiting for us on arrival. room ready when they said it would be. third bed made up for us on the last night as another was joining us. the street action is wonderful to watch, better than any tv program. the room was quiet and the air conditioner was super cold! i will stay there again and tell all to do so. the location cannot be beat. i felt like i lived there!", "Date": "July 1, 2005"}, {"Ratings": {"Cleanliness": "5", "Overall": "4.0", "Value": "3", "Service": "3", "Rooms": "4"}, "AuthorLocation": "Brisbane, Australia", "Title": "“Expensive, but Great Location!!”", "Author": "Rbdfoxes", "ReviewID": "UR3574714", "Content": "My boyfriend and I stayed at the Smeraldo Hotel from June 7th - June 12th. We are both students in our 20s and decided to splurge on a trip to Rome before I go home to the states. Our room at 140 euros a night was not the cheapest rate to be found in Rome, I'm sure, but we decided to take it because of the convenient location! It was really wonderful to be able to walk everywhere, and take a nap in the afternoon, and then walk two blocks to the Campo de Fiori for a nice long Italian dinner. We stayed in room 405 (the top floor), and our room was very large. We did peek into the rooms across the hall, and although they had little terraces, they were much much smaller than our room and they were over the street, whereas our room looked out over the other buildings (and into other apartments !). The staff wasn't overly friendly, but my boyfriend (being European) managed to convince me that they weren't being rude, they just didn't have the same American theory of customer service that I'm used to... He helped me to see that the staff was really quite accomodating, and friendly and helpful in their own way. They booked taxis for us to the airport, and happily served us from the bar, even when it wasn't officially open. There was someone at the desk 24/7 (where you are expected to leave your key when you go out). In all the hotel was very clean, the breakfast was the typical continental buffet, but the location is GREAT! I would recommend this hotel.", "Date": "June 18, 2005"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Cranston, RI", "Title": "“Satisfactory hotel with great Location.”", "Author": "polly424", "ReviewID": "UR3546735", "Content": "Comfortable stay at this hotel. It was hot while we were there and air conditioning was working well. Past hotels were meager. It was very clean and comfortable. The \"behind the scenes\" workstaff were very friendly (which made up for the lukewarm front desk, as stated by another review). Breakfast was nothing to write home about. I've had lots better. It was stated that it was a noisey hotel. I don't agree. It could depend on your room I suppose. Ours was 213 and very quiet. We were there in June which i would guess is busier than April which is when the others were there. I wished that they had internet access. (I would have been willing to pay) I have had that in past hotels and would ask that question when booking next hotel. However I would stay there again because of it's great location. We walked everywhere. There was great fresh mozzarella around the corner at a local gormet shop, and a spa where we had a massage to take care of those sightseeing feet.(ask for Melissa(?) from New Jersey, or Gloria whose an Italian with 10 Years under her belt. Enjoy!!", "Date": "June 12, 2005"}, {"Ratings": {"Cleanliness": "5", "Overall": "4.0", "Value": "4", "Service": "3", "Rooms": "4"}, "AuthorLocation": "", "Title": "“Nice Hotel”", "Author": "CalifTraveler", "ReviewID": "UR3499707", "Content": "We stayed at Smeraldo Hotel for three nights and it was nice, the room was nice and clean. The front desk was lukewarm but who really cares when you are not in Rome to see the front desk people. Thanks tripadvisor for helping us chose a nice and clean hotel.", "Date": "May 25, 2005"}, {"Ratings": {"Cleanliness": "3", "Overall": "3.0", "Value": "3", "Service": "3", "Rooms": "3"}, "AuthorLocation": "Chicago, Il", "Title": "“Just returned from Rome”", "Author": "Piaga", "ReviewID": "UR3473451", "Content": "Nice hotel, room is small, as is everything in Italy. The rate was reasonable and the staff was lukewarm. Good location, however the noise at night/early morning is unbelievable - I'm surprised I slept at all. I can't recommend it to people who want a good night's sleep - the noise outside our hotel never stopped, let alone in the hallways.", "Date": "May 15, 2005"}, {"Ratings": {"Cleanliness": "4", "Overall": "4.0", "Value": "4", "Service": "3", "Rooms": "4"}, "AuthorLocation": "Manchester", "Title": "“great locationLocated in a great position for all”", "Author": "Castello", "ReviewID": "UR3372962", "Content": "located in a great position2 minutes from the Campo Fiori. Get the train from tthe airport to Trastevere then the number 8 tram to the end of the line and you are practically outside the door. The hotel was clean , breakfast was nothing to shout home about but OK. The only down side was that the walls were so thin that when the first person was up everyone was up as you could hear every sound.All in all a good hotel I would be happy to reccomend", "Date": "April 18, 2005"}, {"Ratings": {"Cleanliness": "5", "Overall": "4.0", "Value": "5", "Service": "5", "Rooms": "4"}, "AuthorLocation": "Washington, DC", "Title": "“Wonderful stay at Smeraldo”", "Author": "Tines0110", "ReviewID": "UR3284868", "Content": "We would recommend this hotel to anyone. We stayed for six nights/seven days and really enjoyed our time at the Smeraldo. The location was EXCELLENT. Every major site was within walking distance for the average walker--the hotel is an equal distance from the Vatican, the Spanish Steps, and the Coliseum. Good restaurants, ATMs, nice shops, tabacchi (for phone cards, stamps, and postcards) were all within two blocks of the hotel. The rooms were impeccably cleaned everyday with all towels changed everyday and all the little soaps and shampoos refilled. The breakfast each morning was more than adequate and an excellent way to get ready for a long day at the sites--no hot food but a good array of baked good, cereal, yogurt, etc. Room 100 was slightly small for two people but all European hotel rooms are I suppose, and the bathroom was quite large. The only complaint that we had was that the room was quite damp and a bit cool in the evenings even with the heat on, but other rooms did not seem to have this problem. The staff isn't particularly friendly, but always willing to try and help. For great food at a good price try S. Anna's Ristorante (just a few steps away to the right!) and for cheap food try Insalata Ricca right off Corso Emmanuel a couple blocks away.", "Date": "March 18, 2005"}, {"Ratings": {"Cleanliness": "5", "Overall": "5.0", "Value": "5", "Service": "5", "Rooms": "5"}, "AuthorLocation": "Columbus. OH", "Title": "“Perfect place for 1st trip to Rome”", "Author": "Bearcat", "ReviewID": "UR3275365", "Content": "Stayed at the Hotel Smeraldo for five nights in March 2005. The hotel met of exceeded or expectations in every category. The room was clean and a decent size for two with ample closet space, shower was small but that is expected in Europe right?. Hotel arranged airport pickup and return (55E/48E) and followed up to make sure there were no problems. Didn’t have to walk more than about 200 yards to find a great restaurant each night. Able to walk to all the major sights, ~30 minutes to either the Colosseum or Vatican. Can’t comment on the breakfast as we were out the door each morning but, there is a decent coffee shop across the alley and several automated teller machines in the area. Everyone on the staff we encountered was English speaking and we did not find anyone unwilling to help no matter what the question or request. Our room faced the interior of the building and noise was not a problem at all. Not fancy but it was clean, helpful, inexpensive, and in a great location. We will definitely stay at the Smeraldo again when we return to Rome.", "Date": "March 15, 2005"}, {"Ratings": {"Overall": "1.0"}, "AuthorLocation": "philadelphia, pa", "Title": "“Rude!”", "Author": "cargio17", "ReviewID": "UR3272260", "Content": "We were late arriving to our hotel by several hours. When we arrived the man at the front desk actually yelled at me that I was late and it was past check in. He had booked our room and charged us. He said that the hotel was competely booked up now, but he would help us find another hotel in Rome. I was furious I left and found a delightful place a couple of blocks away. I dont understand why he was yelling at me when he got my money, and the money of who ever was staying in our room. Very poor customer service.", "Date": "March 14, 2005"}, {"Ratings": {"Cleanliness": "4", "Overall": "4.0", "Value": "4", "Service": "3", "Rooms": "3"}, "AuthorLocation": "west chester, PA", "Title": "“the perfect location for your first visit to roma!”", "Author": "A TripAdvisor Member", "ReviewID": "UR3194370", "Content": "I stayed here for five nights in Feb 2004 and enjoyed it tremendously! It's location is perfect!! I was a few blocks away from the campo de fiorio - with it's sunday morning market - and well within walking distance to all the main sights. And How wondeful to hear the street musician playing his accordian just outside my window! A wonderful mom-n-pop leather shop was cattie-corner to the entrance and my morning capucino shop was on the way to the piazza. all in all, for my first european vacation, this hotel was awesome. I have recommended the hotel smerlado t to many of my friends who are traveling to rome!", "Date": "February 15, 2005"}, {"Ratings": {"Cleanliness": "5", "Overall": "5.0", "Value": "5", "Service": "4", "Rooms": "4"}, "AuthorLocation": "Seattle, WA", "Title": "“A gem!”", "Author": "sman415", "ReviewID": "UR2988482", "Content": "We loved our (4 days plus one day) stay at this charming hotel. Though the room was very small, the bed was firm and spacious for two. The room was also warm and quiet, so we slept well. The staff was very helpful, and even stored our winter clothing for 10 days while we travelled to Africa. We found it convenient for us to travel to and from the airport by train (FM 1, 5 Euros; and Tram 8, 1 Euro per person) and it took about 50 minutes each way and was fun (we didn't have too much luggage). The hotel is well-located in a charming neighborhood, two blocks from Campo dei Fiori and its daily market til 2pm, and another three blocks to Piazza Navonna. (Everything seems like just a short walk in Rome, but wear shoes with good support, because of the uneven cobblestones.) It is also two blocks from an internet cafe (on Via Arenula), one short block from an ATM, and a short walk across the Ponte Sisto from Trastavere neighborhood. I was generally pleased with the unexceptional breakfast, finding the granola and yogurt a nutritious way to start the day, augmented by ham and cheese slices when I was hungrier. But do leave room for the antipasto misto della casa at L'Orso 80 and the gelato at Gelateria della Palma.", "Date": "January 7, 2005"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "Glasgow, Scotland", "Title": "“Great value for money”", "Author": "A TripAdvisor Member", "ReviewID": "UR2967050", "Content": "Stayed at the Smeraldo for 4 nights prior to Christmas. At a rate of 100 euros per night for the room incl breakfast it's fantastic value for money. The room we stayed in (111) had clearly been recently refurbished and was very nice, albeit on the small side. The location is perfect with all the must see tourist sights within easy walking distance. The Vatican museums are probably the furthest away of all, but is no more than a 20 minute stroll away. Would thoroughly recommend staying at this hotel. Enjoy Rome it is a truly spectacular city!", "Date": "December 31, 2004"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "Surrey UK", "Title": "“perfect for a stay in Rome”", "Author": "Suzetim", "ReviewID": "UR2864716", "Content": "We stayed here after reading all the reveiws. It is in a great locations, we could walk all over Rome from here, nowhere was too far. Great for walking out at night to and getting to buzzzing squares. Would highly recommend. The staff were helpful, but not too smiley. Breakfast was nothing special very basic really, but loads of places to eat locally. The rooms were very clean and ours was a good size, we were in 306. They will arrange taxi to pick up from airport, cost was about 45 to 50 euros.", "Date": "December 5, 2004"}, {"Ratings": {"Cleanliness": "5", "Overall": "5.0", "Value": "4", "Service": "5", "Rooms": "4"}, "AuthorLocation": "Basingstoke", "Title": "“Brilliant Location, good hotel”", "Author": "WhereNowBasingstoke", "ReviewID": "UR2832361", "Content": "We stayed 4 nights at the Smeraldo in late October, following a recommendation in the London \"Daily Telegraph\". The hotel arranged a car to pick us up at Fiumicino (55 euros) - which was probably just as well as, although we quickly got used to the geography, finding the hotel the first time would have been interesting. We were very pleased that our triple room had a separate area for the single bed, giving some privacy. Room was recently refurbished and comfortable: and, yes, the shower is small - but that's fairly normal in Europe (and the water was plentiful and hot - which is less normal!!). Although we had the windows open, external noise was not intrusive and, although nosie reverberated in the public areas, there were only 2 other rooms on our landing, so the impact was minimal. Breakfast was excellent - but beware day-old bread on Sundays - and the breakfast room can be mayhem if a tour party is in! We found the reception staff generally very helpful. The location is superb - we were able to walk everywhere without using public transport. The bakers round the corner is brilliant (try their pizza slices) and there's an abundance of restaurants nearby (although better value is probably found slightly away from Campo d' Fiori and Piazza Navona - we liked the Monserrato in the street of the same name). We'd have no hesitation in returning to the Smeraldo.", "Date": "November 18, 2004"}, {"Ratings": {"Cleanliness": "4", "Overall": "4.0", "Value": "4", "Service": "3", "Rooms": "4"}, "AuthorLocation": "Knoxville, Tennessee", "Title": "“Location, location, location!”", "Author": "Tenoka2000", "ReviewID": "UR2826408", "Content": "Just returned from 10 days in Italy, (wife, me and my mother) we rented a double and a single room and stayed our first three days in Italy at the Smeraldo Oct 31, Nov 1&2. The Hotel was super and the price is right. Having now stayed in several other italian hotels of comparable price, this one was a good value. We found the front desk help to be extremely helpful, for example my mom anticipated that she would be wiped out from the flight over and had asked me to reserve a room for an additional night so she could check in immediately at 9am when we arrived. They informed me that they were booked solid but when we arrived they had her room ready and she was able to check in and go to sleep. (This saved her about 105euros). Yes the Hotel is loud, I don't think italians sleep. We had a room off the main road and had the windows cracked open to keep things cool. The baker across the street begins his day at 4am and scooters pick up fresh breads to deliver to hotels at 5am and you can set your watch by it. Also the hotel is nestled between two churches with great bell towers. In every city we stayed in the church bells go off vigourously at 7am so everybody gets up! Needless to say with two sets of bells it was pretty well heard but hey, it gets you up and youre here to see the City not sleep anyway right? Location, location, location!! This place is literally a 20 minute walk from the Vatican, Roman Forum, Colleseum, everything you want to see when you're there. This also saves you bucks as you can walk or drop a whopping 6 euros to taxi wherever you want to go. Check out Rick Steve's guide book and do the evening walking tour to the Spanish Steps via the Pantheon and Trevi Fountain, again you're in the Campi di Fiori at the hotel so it's a great 90 minute stroll and is beautiful! I will stay here again when I return with my daughters (but with no air conditioning I'll go in Nov or April).", "Date": "November 15, 2004"}, {"Ratings": {"Cleanliness": "3", "Overall": "2.0", "Value": "3", "Service": "2", "Rooms": "2"}, "AuthorLocation": "Nashville, TN", "Title": "“mixed feelings”", "Author": "A TripAdvisor Member", "ReviewID": "UR2800471", "Content": "We stayed at the Smeraldo for 4 nights beginning October 25, 2004. The hotel's strongest point is its location, close to the Campo de' Fiori, Piazza Navona, etc. The hotel staff was competent if not overly friendly. The room (a double) was OK, although the bed and pillow were like cement and the shower was the size of a phone booth (literally!). The biggest drawback was the NOISE! Not the outside noise as the windows did a good job on reducing that but the inside noise. You could hear conversations easily through the walls as well as bathroom sounds you'd rather not hear. The noise from outside the room in the hallway was unbelievable. In addition, there were tour groups booked during our stay and the breakfast room was pretty much unavailable. So, while the location is great we wouldn't stay here again.", "Date": "November 1, 2004"}, {"Ratings": {"Cleanliness": "5", "Overall": "4.0", "Value": "5", "Service": "3", "Rooms": "3"}, "AuthorLocation": "Pine River, Minnesota", "Title": "“Location, Location, Location!”", "Author": "John_Z_MN", "ReviewID": "UR2718058", "Content": "The Smeraldo is a sparkling clean back alley place near the Campo de' Fiori. The rooms and bathrooms are small but well kept and the main sites of Rome are walkable if you're in any kind of shape. The staff was a little abrupt but the rooftop patio (bring your own wine in the evening) and the neighborhood of shops, bakeries and restaurants more than made up for any slights. This would have been a 3 but for location and value (E120) we give it a 4.", "Date": "October 16, 2004"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "Washington, DC", "Title": "“Just Wonderful”", "Author": "A TripAdvisor Member", "ReviewID": "UR2695683", "Content": "The Hotel Smeraldo is perfect. It is in a central location right down from a major bus stop where you can catch a bus to just about anywhere (Rome's busses are surprisingly easy to use) and they sell bus tickets at the desk so you don't have to go to a Tabacchi. Despite its central location, it is in a quiet little corner of the area with only a small amount of noise from passing pedestrians (and no car noise). The hotel is beautiful, especially the circular staircase, the rooms are small but clean with no smoke smell (a huge issue with other hotels in Italy), and the breakfast is fairly comprehensive with muesli and yogurt available in addition to pastries. The desk staff was always nice. For the price, this is an incredible value and I would definitely stay there again.", "Date": "October 11, 2004"}, {"Ratings": {"Overall": "1.0"}, "AuthorLocation": "Austin, Texas", "Title": "“Bait and switch?”", "Author": "good2be", "ReviewID": "UR2686885", "Content": "We made reservations over 4 months ago for Hotel Smeraldo for 3 rooms. Upon arrival, we were told that only 2 of the 3 rooms would be available and that they had made reservations at a hotel nearby for the other room. Fortunately the other hotel was just around the corner however we were very disappointed to be switched to a lower end hotel (2 stars maximum) and expected to pay the same price. Only when we refused, were we offered a lower price. The staff at Smeraldo were not friendly or helpful. I recommend you keep looking unless location is the only thing you care about when staying in Rome.", "Date": "October 10, 2004"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "", "Title": "“Great hotel - Great location”", "Author": "A TripAdvisor Member", "ReviewID": "UR2619105", "Content": "My wife and I just got back from 5 nights at the Smeraldo Hotel. It was a perfect hotel! I would gladly stay there again. Price was reasonable and the location is perfect. Walking to the Vatican, Coliseum, Spanish Steps all took less than 20minutes. You can't drive or park in this town, so having someplace to stay that's central is a must. Keep in mind this is Europe, so the rooms are a bit small compared to the States and the showers are even smaller. I've been all around Europe on business and this is a typical room setup...actually a bit larger than most. I highly recommend this hotel. Also, get a good map of Roma before you leave....and a compass.", "Date": "October 4, 2004"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "Bryan, Texas", "Title": "“A great hotel”", "Author": "A TripAdvisor Member", "ReviewID": "UR2610412", "Content": "This is a very good hotel. It is centrally located, walking distance from Piaza Navono. The staff is extremely friendly, polite and helpful. Breakfast was included in the price and was delicious I highly recommend it to everyone who is on a tight budget, but still expects a nice service.", "Date": "September 30, 2004"}, {"Ratings": {"Cleanliness": "5", "Overall": "5.0", "Value": "5", "Service": "5", "Rooms": "4"}, "AuthorLocation": "Columbus, OH", "Title": "“Great little hotel”", "Author": "A TripAdvisor Member", "ReviewID": "UR2601898", "Content": "A great place to stay. Clean, nice rooms; friendly (and VERY helpful) staff; and great location! We went to Rome for part of our honeymoon- and this hotel was an excellant choice for us.", "Date": "September 26, 2004"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Yorkshire", "Title": "“Little Gem”", "Author": "Will_Travelll", "ReviewID": "UR2580501", "Content": "I did not stay at this hotel, but it was my second choice and as I wandered about town I came across it and took a look. The hotel is down an uninteresting side street, and close to a small piazza with a cafe at one corner. The hotel looks wonderful for its type, a small foyer & nice reception. The receptionist was kind and let us look around the hotel and even showed us one of the rooms. Unless we were especially shown the best room it was a goodly size, clean and had a lovely en-suit room. There are two small roof gardens, one had a good view of the roof tops and Domes which speckle the Roman skyline. It's position in Campo Di Fiori is not spectacular but is close to all the main sights. Night life might be a problem for those wanting such. Nearby there is De Campo Dei Fiori and not so far away is Piazza del Rotunda and Piazza Navona. During the day you can easily walk to all the major places of interest. The hotel is great and even greater is the price. Don't expect a 5*, it is at the top of its range, but expect good value, especially if you are not seeking a bustling night life. I shouldn't write about this hotel. I don't want it to get too full. This place is terrible, trust me I'm a traveller.", "Date": "September 17, 2004"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "UK", "Title": "“Good for the money”", "Author": "OxfordGirlOxfordUK", "ReviewID": "UR2528365", "Content": "We stayed for four nights 8th - 11th Sept. in room 100. Room was small but very clean, bathroom larger but water tepid after 09:00 (!) Breakfast perfectly acceptable with rolls, pastries, cake, jams, honey, nutella, cereal etc. Staff very pleasant and helpful. Fantastic location.", "Date": "September 13, 2004"}], "HotelInfo": {"Name": "Smeraldo Hotel", "HotelURL": "/ShowUserReviews-g187791-d236151-Reviews-Smeraldo_Hotel-Rome_Lazio.html", "Price": "$117 - $216*", "Address": "<address><span rel=\"v:address\"><span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">Via dei Chiodaroli 9</span>, <span class=\"locality\"><span property=\"v:postal-code\">00186</span> <span property=\"v:locality\">Rome</span></span>, <span class=\"country-name\" property=\"v:country-name\">Italy</span> </span></span></address>", "HotelID": "236151", "ImgURL": "http://www.venere.com/img/hotel/6/8/2/1/281286/281286.jpg"}}