{"Reviews": [{"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "3.0", "Value": "4", "Sleep Quality": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "", "Title": "“Clean/Affordable”", "Author": "Posted by an Easytobook.com traveler", "ReviewID": "UR127186774", "Content": "Rooms are small, but overall satisfied for the price. The hotel is located in a good area with plenty of restaurants in walking distance.", "Date": "April 3, 2012"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "4", "Overall": "3.0", "Value": "4", "Service": "3"}, "AuthorLocation": "Chicago, Illinois", "Title": "“Very small Room”", "Author": "canarycat13", "ReviewID": "UR117992740", "Content": "This hotel is in a great location although it took me a while to find it when I got off the tram. My room did not look like any of the pictures. It was a single room and incredibly small. It was cleaned everyday but they had strange towels that were more like table cloths. It was fine for me since I was only in the room to sleep.", "Date": "September 12, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "4.0", "Value": "4", "Service": "3"}, "AuthorLocation": "Oslo, Norway", "Title": "“Good location, room and service”", "Author": "Jan S", "ReviewID": "UR117896667", "Content": "* Good location in Trastevere. Walking distance to most part of central area. * Italian breakfast with juice, tea, apples, croissants, jam, some bread, and good italian coffe on request. * The room was cleaned and the bed was made every day. * Some problems during check out and payment. Caused a 20 minutes delay.", "Date": "September 10, 2011"}, {"Ratings": {"Cleanliness": "1", "Sleep Quality": "1", "Overall": "1.0", "Value": "1", "Service": "1"}, "AuthorLocation": "London", "Title": "“One of the grossest places I've stayed in for years”", "Author": "BudgiesLondon", "ReviewID": "UR117197776", "Content": "I stayed at this hotel 7 years ago, and also 10 years ago where I was given beautiful rooms and star treatment. Not so this time! Apparently, there's new management who only has ownership of the first floor. What this means is tiny poky old dirty rooms smack bang on top of the square - not that gentle view that I was hoping for. And certainly not that lovely space and cleanliness I was expecting. There are stains on the sofa (if you'd call it that?) and the blinds. The airconditioning is noisy and doesn't work properly. I generally forgive these little things for the sake of a perfect location - but there is just too much compromise here. The staff were very rude, one of them didn't (refused to) speak English - again, never normally an issue particularly as I am a visitor in the country, but icing on the cake type of situation. My request to change rooms were met with glazed eyes and a swift \"no sorry nothing\". And for the price? Waooo, to be sure, this was not a cheap room at over 155EUR a night. Granted, I wasn't expecting 5 star luxury, or even close as I'd stayed there before, but I could've done without the stains, the rudeness, the noise and the pokiness. Again, please note, I was not expecting luxury here. I knew this was basic accomodation. But basic does not need to equal to being ripped off, dirty or uncomfortable. Sorry, this was gross! I don't think I've ever written such a bad review before.", "Date": "August 24, 2011"}, {"Ratings": {"Cleanliness": "1", "Sleep Quality": "1", "Overall": "1.0", "Value": "2", "Service": "3"}, "AuthorLocation": "New York City, New York", "Title": "“Don't Bother!”", "Author": "ab2160763", "ReviewID": "UR115172324", "Content": "After checking into a hotel well past it's prime, we gently informed the desk that our room was extremely noisy at night because of the stalls outside of our window that held the goods for the daily market. The air conditioning did not work well so we had to open the window. The people at the reception desk stated that they would check on the temperature of the room, but yielded no results. The 1950's look does nothing to capture the harm of Roma or Trastevere. Pick a different place and save yourself the hassle.", "Date": "July 8, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "4", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Keene, New Hampshire", "Title": "“Perfect local experience”", "Author": "cszdancer", "ReviewID": "UR115082581", "Content": "The Trastevere neighborhood is as the guidebooks say \"Roma's Greenwich Village\". There is a real sense of integrating into the 'hood. The hotel is clean, a helpful staff with tips for navigating the city on foot or by bus. The rooms are clean and basic, with comfortable beds. Spend your travel money on the great trattorias that saturate the neighborhood! Some reviews say the walls are thin-- not our experience! However,the neighborhood wakes early with the set up of the local market in the square behind the hotel, and as with any neighborhood, there are night sounds of people laughing, the trattoria just up the street is lively well beyond midnight, etc. Good guides in the city will tell you about the Tratevere area and suggest it for the local feel and great food. They are right!! Any return trip made to Roma will definitely involve a stay in this sweet, accommodating, no nonsense hotel.", "Date": "July 6, 2011"}, {"Ratings": {"Cleanliness": "3", "Sleep Quality": "3", "Overall": "4.0", "Value": "4", "Service": "3"}, "AuthorLocation": "Melbourne, Australia", "Title": "“Basic hotel in a wonderful area of Rome”", "Author": "anelyn00", "ReviewID": "UR112717367", "Content": "The hotel is ideally located in the Trastevere area of Rome, which has a village-like feel and has lots of fantastic restaurants (particularly recommend Da Vittorio which is just around the corner). It is within easy walking distance to the main centre of Rome however will need a short bus ride to the Vatican. The room we stayed in was fairly basic, pretty clean and had an attached bathroom. Breakfast was included and consisted of pastries, cereal and juice. Coffee is made-to-order. We easily managed to reach Rome airport from the hotel although we only had 2 roller suitcases. It involved a short walk to the tram stop and then a train ride to the airport.", "Date": "June 11, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "3.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "NJ", "Title": "“Good Value”", "Author": "Burnzi", "ReviewID": "UR110242049", "Content": "We stayed in the Annex. Our room was clean and roomy. I was interested in a reasonably priced room to come back and sleep and this is what I got and I was not unhappy with it. i love the area, it really is less touristy and they have some dynamite restaurants in the area. It is bohemian, so if you are into the very best, don't bother with the Annex but if you want a good price, it is here. The staff was always accommodating. i would stay here again.", "Date": "May 28, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "2", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "3"}, "AuthorLocation": "Montpelier, Vermont", "Title": "“Stay here if you have to, but look elsewhere first”", "Author": "RandRfromVT", "ReviewID": "UR102911009", "Content": "I'm a bit torn, b/c the people running this young hotel are so nice and tried to be helpful. But in the end, what they were dealing with was awful. Notably, we did not stay in the rooms of the hotel off the main entrance, but in the near and far annexes. The room in the near annex smelled like mold, was stuffy and felt unclean. And the shower was broken. We switched on the second day to the far annex, which was better from smell perspective, but completely lacked air, b/c there was no outside window, just a transom over the door. I didn't know they allowed rooms like this in countries with a fire code. This just seemed like a fire trap. But we gritted and bore it for 2 nights b/c everything in Trastevere, where we really wanted to stay, was booked up b/c of the Rome Marathon that weekend. Again, things were mostly clean, the breakfast was passable, and if you are looking for a cheap place to stay in Trastevere, this would not be bad. Though you might insist on a room in the main entrance of the hotel. Those might be better. Internet via iPhone was unreliable. Had not been anywhere else on trip.", "Date": "April 5, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Cardiff", "Title": "“Not luxury, but great!”", "Author": "TomPea", "ReviewID": "UR97730209", "Content": "We weren't expecting luxury, and this is a fine little 2/3-star hotel. We had a room with bunks for our kids and it was an okay size. Had quite a good view over piazza. Had very effective fridge in our room. Breakfast was a little basic and repetitive, but did the business. Staff pleasant and did their job just fine. Had 5 pizzas in 5 nights and funnily enough the best one was in Pizza Roma, located on ground floor of same building! In terms of location: can't beat it if you want to be in the heart of a villagy feeling, safe area packed with nice little bars and restaurants. Small local supermarkets really cheap. We were with our two young children and still the area felt very safe. No evidence of crime at all. Yes, loads of grafitti, but seems a general Rome issue to me. Main Rome problem: getting ripped off with table prices at bars. Shame. Other than that, great place. Loved Colosseum, Piazza Venezia and zoo/park. Buy a 'Roma Pass' at airport: good value as gives you 2 free entries (to major sites) plus free travel for 3 days. Kids under 10 travel free on public transport. That's it really!", "Date": "February 23, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "2", "Sleep Quality": "3", "Rooms": "2", "Location": "3"}, "AuthorLocation": "Mill Creek, Washington", "Title": "“Thin walls, no English TV”", "Author": "goodtrip12", "ReviewID": "UR88462287", "Content": "Overall our stay was pleasant enough though the location was in the graffiti-saturated area of Trastevere. The biggest disappointment was the paper-thin wall between our bathroom and the neighboring one. No bodily function went unheard. The breakfast consisted of carbs only. We had to supplement it with our own purchased meat and cheese. (tricky with no fridges in the room) The bed was clean and comfortable but the space was so small there was hardly any room to open 2 suitcases. Found only one bug, a silverfish in the desk drawer, but those can crop up anywhere.", "Date": "November 28, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Ottawa, Canada", "Title": "“Just okay”", "Author": "cooperfelice", "ReviewID": "UR83320761", "Content": "I found this hotel to be nothing special, the front desk staff were kind but sort of bland and the rooms were drab, so overall between the rooms and staff the place is not overly warm or welcoming. What it lacked in certain areas, it didn't really make up for in others. I guess we had been spoiled for our previous two weeks in Italy. We had stayed in more family run accommodations, where they are more concerned with making your stay great. I don't know what other hotels are like in Rome so I am not sure if this is a good value for its location. We walked to the Colisiem on the first day and then after that we just opted for the double decker tour bus for a 2 day period and were able to get around on that, hopping on and off as we liked. That stop was about a 15 minute walk from hotel. It was a good value at around 53 euro for the four of us. Trastevere is a lovely area to walk around, so we did enjoy our walk to and from the bus stop each day.", "Date": "October 13, 2010"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Overall": "2.0", "Value": "2", "Sleep Quality": "1", "Rooms": "1", "Location": "4"}, "AuthorLocation": "Arbon, Switzerland", "Title": "“Mixed Reviews for a Reason”", "Author": "frogoasis", "ReviewID": "UR70115214", "Content": "Soooo..read the reviews for this hotel carefully. This hotel is not for everyone. Two tips for an OK stay at this hotel 1) when you make a reservation, tell them in advance that a room on the ground floor in the annex (aka Dungeon) is not acceptable. 2) when you arrive, ask them to show you your room before you agree to take it. The 'annex' is less than a one star hotel and will give you nightmares forever. The 'apartments' are strange. I tried to like them, but ultimately couldn't. I've traveled around the world and I'm quite happy with simple hotels but this is by far the worst hotel I've stayed in. A truck stop in Rochester New York has held the record for the past 15 years! Trastevere is a great location and I would stay in the area again but not at this hotel. Rome is an expensive town, just shell out the extra euro and get yourself a decent room. It can make or break the trip.", "Date": "July 8, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Potomac, Maryland", "Title": "“charming hotel!”", "Author": "Ann100610", "ReviewID": "UR68351079", "Content": "this hotel was highly recommended to us for the hotel and its neighborhood. when we inquired for availability, the main hotel was booked but they offered us the annex a block and a half down the street. it was unusual in that we had a key to the main door, a key to an area of four accommodations and then a key to our \"room\". upon entering, the large updated bathroom was to our right, straight ahead a small sitting room with single bed and tv. continue through the sitting room and up curved stairs to the room. the bed was very comfortable and the air conditioner was very good. we overlooked a kind of cement courtyard that was essentially a small, cozy, private area for surrounding apartments. the entire set-up was not for anyone wishing a standard experience but my husband and i loved it. somehow this unique setting made us feel part of the wonderful trastevere neighborhood. in the mornings we walked to the hotel for the continental breakfast, past shops and amongst the locals beginning their day. after long days walking and touring rome we chose to eat each dinner in the neighborhood. every source i saw raved about the restaurants and the atmosphere in trastevere and they did not overstate. i cannot recommend trastevere and this hotel highly enough for anyone wanting a vacation that has you come away with a sense that for a few days you really lived in rome.", "Date": "June 22, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "2.0", "Value": "3", "Sleep Quality": "2", "Rooms": "2", "Location": "5"}, "AuthorLocation": "Co Clare", "Title": "“Great location, friendly staff, paper thin walls!”", "Author": "Katmul", "ReviewID": "UR63148232", "Content": "Stayed one night in this hotel. More like a small two star type hotel. Staff very helpful and very friendly. Room was basic but clean with view over market area, however, the walls are paper thin and you can hear conversations of guests in next rooms and also if they leave their extractor fan on in their bathroom it will keep you awake all night. Hotel location is excellent, just a stroll across the bridge to the centre of historic Rome. Trastevere itself is a fabulous area, with narrow little streets, great cheap restaurants and lots of bars with happy hours. Would recommend this area for visits to Rome.", "Date": "May 3, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Boston, MA", "Title": "“Great neighborhood, near everything, clean, and pleasant service”", "Author": "boston_to_rome", "ReviewID": "UR61668798", "Content": "Hotel is located in Trastevere neighborhood near shopping, restaurants, cafes, bars, and much nightlife. Hotel is clean and safe and within walking distance of ALL major sites. Rooms are small, but no need to spend time in rooms in Rome! Staff are incredibly pleasant and front desk staff are extremely helpful. No italian is required.", "Date": "April 16, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Location": "5", "Rooms": "4"}, "AuthorLocation": "New York", "Title": "“Feel of B&B with the amenities and services a traveler needs”", "Author": "MariposaNYC", "ReviewID": "UR52174800", "Content": "This is the kind of hotel I'm always searching for when I travel: small enough to feel cozy, but professional and big enough where you can ask the desk for help with directions, restaurant suggestions, and tips on things to do. I am also always hunting for that area to stay in that's close to the sights, but not in the main tourist hub. For instance, I live in New York and am baffled that people want to stay anywhere near Times Square...but it seems most tourists stay near there. Instead, I like to find the cute residential neighborhood that's still close to things, and that's what I found at Hotel Trastevere (pronounced tras-TEV-eh-ray). I was pleased that on our first trip to Italy ever and on the first leg of the trip that we stayed at this hotel. The experience we had at Hotel Trastevere helped set the tone that we'd have a great rest of our trip. Notes: -Clean, large room (Room. 13) -All the fixtures and furniture are very basic, nothing cute or charming to ooh and ahh about, but no big deal (I knew what I was getting from the pictures) -Our view of the square was indeed a view of the square, but also in my view was the roof of a storage shed that spanned much of the square. Not a dealbreaker...just good to know in advance. -Amandus was so great. We asked him 20 questions a day and he patiently highlighted our map each time with his multiple highlighters (never seen anyone quite so dedicated to his highlighters...it works.) -Pain chocolat (and more) for breakfast every morning? Yes, please! Loved that. -The one down side for me here was that the two twin beds smushed together would not actually stay together.", "Date": "December 30, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Location": "5", "Rooms": "4"}, "AuthorLocation": "India", "Title": "“Warmth and support of the front desk staff”", "Author": "amoeba22", "ReviewID": "UR51997095", "Content": "This is a nice hotel tucked in a small by lane in the Trasvetere area of Rome. The rooms were clean, comfortable and spacious (compared to British hotels!). The location has immense value for tourists since it is quiet but within a short walking distance of the major attractions of the city. We were very impressed with the personal support and care extended to us by the front desk staffed by Natalie and Amandeus. Our luggage was lost in transit and we were quite stranded and desperate to contact the airline while not wanting to miss out on the tourism for the short stay. Both Natalie and Amandeus followed up with the airline and our schedule was not affected in any way (except that we did not have fresh clothes!). Such personal care has immense value when you are in a foreign land. The breakfast was minimal ut there were many cafes and restaurants around the hotel. We were very happy with our stay here and strongly recommend it to all travellers.", "Date": "December 28, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "2.0", "Value": "4", "Location": "4", "Rooms": "2"}, "AuthorLocation": "San Diego, CA", "Title": "“Cheap for a reason”", "Author": "sonogil", "ReviewID": "UR48074932", "Content": "I stayed here because it was very inexpensive, which was the main draw. However, it was hot and we ran the air conditioning through the night. The next day we got a note saying this was inconsiderate to the other hotel guests because it was loud, and they shut the air conditioning off for our room. The next 2 days we had trouble sleeping because it was so hot in the room. Also, the walls are so thin I could hear a conversation people had in a room in the courtyard. Besides this the staff is helpful though and they offer free breakfast.", "Date": "October 29, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Minneapolis", "Title": "“Fabulous neighborhood; skip the tourist spots and stay here.”", "Author": "Europeanvacationfan", "ReviewID": "UR46454415", "Content": "Loved staying in a \"real\" neighborhood, rather than near a tourist site like the Vatican or Pantheon. The location is just south of the river; pretty simple to get to via public transportation from the airport (once you get over the fact that streets change names every block or so you'll be fine). One of the hotel staff spoke perfect English and was an NFL fan! Very helpful, as were the staff at each hotel we visited. We had the most unusual room: 3 levels, albeit small, with some kitchen facilities. Between the daily market outside our windows and the church with a square behind us, we felt like we were truly in an Italian city. Plus, we could walk everywhere.", "Date": "October 10, 2009"}, {"Ratings": {"Service": "2", "Cleanliness": "4", "Overall": "1.0", "Value": "1", "Location": "5", "Rooms": "1"}, "AuthorLocation": "San Francisco", "Title": "“Do not trust this hotel”", "Author": "josephk26", "ReviewID": "UR33066825", "Content": "Do not trust this hotel to give you a decent room. I stayed at the hotel in June 2009. The hotel has expanded by renting additional annex rooms in the neighborhood. I was placed in one of these. The room was a damp ground floor location. It was the first time in my long travelling life that I was given a room without a window, without any natural light and outside air! At 80 Euro/night, this was outrageous! I used to stay at this hotel and it was fine. Unfortunately the owners have become greedy as a result of their guidebook listing. If you stay at the hotel, demand to see your room before you register, and do not stay in one of their annex rooms. Demand the main building only.", "Date": "June 24, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "earth", "Title": "“Could not have asked for more!”", "Author": "bronson777", "ReviewID": "UR31710512", "Content": "We thoroughly enjoyed our stay at the Hotel Trastevere. The price was excellent at E105, including \"all you can eat\" breakfast. We stayed 4 nights in a room overlooking the piazza and then the last 2 nights in an interior room (at a reduced rate of E80). We didn't spend much time at the hotel, so we didn't mind the cramped quarters in the second room. However, the rooms were clean and the service was excellent. The staff was always patient, helpful and accomodating. The free breakfast was excellent and the wait staff at breakfast were wonderful in making lattes, cappuccinos, etc. without end - some mornings I ordered 3! All without charge. Any deficeincies in the room or hotel brought to their attention, they quickly remedied. It was the best hotel service I have ever experienced in my three trips to Europe, especially when you consider the price of the rooms. We enjoyed the location and found easy to access public transportation to all sights in Rome from our hotel. We made our own way via train and tram to and from the hotel & airport at a significantly reduced cost E6.50 per person; great for those trying to save euros. It only took about 40 minutes from the airport to the hotel via public transport. We visted the open-air produce market on the piazza and purchased fruit for a picnic. We had laundry done nearby at reasonable price and found several places to access the internet. We would not hesitate to stay there again", "Date": "June 6, 2009"}, {"Ratings": {"Service": "2", "Cleanliness": "5", "Overall": "3.0", "Value": "3", "Location": "5", "Rooms": "2"}, "AuthorLocation": "NY", "Title": "“Good location, small rooms”", "Author": "jenbrown23", "ReviewID": "UR30619489", "Content": "The location of this hotel is fantastic - it's not in the historic center, but a more residential neighborhood with a farmers market just adjacent to the hotel. The rooms are small and the bathrooms are smaller, but that's not a big deal in a large city such as Roma. A small breakfast is included.", "Date": "May 23, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Chicago, Illinois", "Title": "“Great hotel in a FABULOUS neighborhood”", "Author": "cass03", "ReviewID": "UR29931294", "Content": "Hotel Trastevere was amazing. I stayed in the annex with 2 of my friends and it was like we had our own little apartment in Rome. We really felt like locals! The room was clean, the beds were soooo comfortable that I actually miss them, the bathroom was clean and everything worked well. Within easy walking distance to all the great restaurants and bars in Trastevere as well as the Piazza. I'm in love with this neighborhood, and this hotel. Just across the river... central rome and all of the historical sites and monuments, also all within walking distance. Though we did opt for cabs \"home\" after a long day of walking central rome.", "Date": "May 13, 2009"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "Sugar Land, Texas", "Title": "“Pleasant hotel, really felt like we were staying in Rome”", "Author": "Houston120", "ReviewID": "UR27527612", "Content": "Our family of five including 3 kids ages 10,12 and 14 spent 4 great nights in a loft apartment at the Hotel Trastevere. Access was through the building next door, so it really felt like we had our own Roman apartment. Our building had a small elevator (2-3 persons max). We then had to pass through a second locked door down a hallway to our apartment. We joined the rest of the hotel guests in the small breakfast room in the main building for breakfast. Great cappuccino at breakfast! The loft was on three levels, tucked into the attic eaves - first level had a double bed and a kitchenette with table, second had a single bed and access to the (small!) bathroom, and third had another double bed. The lofted levels are open to the main living area below. The kids thought this was really great - they liked watching the TV downstairs through the railing - Mom thought the stairs were a bit scary - I would not recommend them for a family with very young children, but my kids did fine. Our window opened onto a nice square with a small playground and a morning market that we enjoyed viewing. Rooms were clean and basic. Linens were the typically Italian Bath sheets, rather than fluffy towels, but that was OK with us. Hot water was limited in the water heater, so we tried to spread out showers after my 14 year old daughter complained about having to take a cold shower - poor baby! The hotel location was very nice, and the staff was friendly and helpful. It was a block or two to the main Piazza in Trastevere, Santa Maria in Trastevere - this was a great spot to people watch and relax. We walked to most Rome sights easily, and learned to navigate the local bus routes for a change of pace (Vatican Museum was easy to get to on bus!) - this was really easy, we just purchased day passes at the small Tabac shop around the corner. We didn't really use the kitchenette except for keeping a few things cold in the refrigerator - still, nice to know we could. Wireless Internet was available on your own computer in he hotel lobby proper, but no access from our room.", "Date": "April 6, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Oklahoma", "Title": "“Unique, great location, wonderful experience.”", "Author": "JamesBrickman", "ReviewID": "UR25015504", "Content": "The hotel was difficult to find at first - it is on a one-way street and this area of Rome is known for it's maze-lake streets. But other than that, it is actually very centrally located - on three different \"trips\", we were able to walk (with young children...) to the Pantheon, the Colosseum, and the Vatican in less than 30 minutes. The neighborhood is pretty normal, there is a nice little park behind the hotel where our kids played on the jungle-gym. Now that I think about it, it reminds me a little of a residential neighborhood in New York City, with some businesses, lots of restaurants, lots of apartments, and our little hotel. We stayed in one of the apartments, which is located in the adjacent building. The service was exceptional, all of the staff spoke English, and the one who checked us in was so proficient, I (wrongly) assumed he was an American. He was able to give us lots of advice about the best ways to go, and had a complimentary map with many of the sights listed on it. The breakfast was pretty good, with fresh cappuccino or espresso, juices, an assortment of pastries, cereal, bread, and fruits. The apartment was somewhat unusual, but given that it was easily able to accommodate our family of 6, was perfect. This was everything I wanted in a hotel - I will definitely stay there again when we return to Rome.", "Date": "February 23, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "3", "Check in / front desk": "4", "Overall": "4.0", "Value": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Bainbridge Island WA", "Title": "“Very basic, but clean and friendly”", "Author": "RJTA", "ReviewID": "UR20967710", "Content": "Most of the reviews reflect our experience as well. This hotel is very basic in most ways - rooms small, I could barely get in and out of the shower (I'm a long way from thin, but not huge either), breakfast offered very few choices. But the AC worked, the front desk was always welcoming and helpful, we didn't find any cleanliness problems, and the location is really great - on the edge of all the Trastevere activities. You can walk to many of Rome's attractions and come back to lots of wonderful restaurants in the neighborhood of Hotel Trastevere. (Don't miss Bir & Fud for gourmet pizzas and a serious selection of beers/ales - for a splurge go to Glass.) We had a very positive experience here and (with warnings) will recommend it to friends.", "Date": "October 17, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Check in / front desk": "3", "Overall": "4.0", "Value": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Calgary", "Title": "“perfect true feeling of Rome.”", "Author": "PerryThompsoncan", "ReviewID": "UR18502353", "Content": "We stayed here for 2 nights. We enjoyed being walking distance to some of Rome's most Famous sights. There is some great little restaraunts around the corner in both directions. I highly recommend it.", "Date": "August 1, 2008"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Check in / front desk": "3", "Overall": "3.0", "Value": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "London, United Kingdom", "Title": "“Basic but just what we needed”", "Author": "Chachmoohach", "ReviewID": "UR18234764", "Content": "This is indeed in a great location and Trastevere area is THE place to stay in Rome - good restaurants, bars and away from tourist traps. Staff were friendly, rooms were basic but clean. We wanted somewhere decent and safe to put our heads down, as we knew we wouldn't be in the room much. There is so much to see and do in Rome that unless you are on honeymoon you just need a place to sleep. Would recommend if you want great location, budget accomodation, and friendly staff. If you are looking for pretty decor and luxury go elsewhere.", "Date": "July 25, 2008"}, {"Ratings": {"Cleanliness": "1", "Business service (e.g., internet access)": "1", "Check in / front desk": "5", "Overall": "1.0", "Value": "1", "Rooms": "1", "Location": "5"}, "AuthorLocation": "Miami, FL", "Title": "“Hated this dump”", "Author": "Dirk-26", "ReviewID": "UR17793335", "Content": "This is a dump. The location is great. The price was ok, I guess. This place was so nasty and uncomfortable that we even checked out a day earlier. The bathroom was nasty and small with some sliding door, barely hot water, a clogged drain and a cheap plastic shower curtain with mushrooms growing on it. The room / apartment whatever you want to call it was spread out over 3 levels. On the first level is a formica kitchen, which we did not use, a shaky table and a hugely uncomfortable bed. On the second level which is accesible by means of a shaky staircase is the famous bathroom and on the third level is the attic with 2 shaky beds and where the temperature must have been an easy 120 degrees. All in all an experience to forget ! Recommended only for those whose alternative is to sleep under a bridge.", "Date": "July 11, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Business service (e.g., internet access)": "3", "Check in / front desk": "4", "Overall": "5.0", "Value": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Manila", "Title": "“Good Location, not too touristy!”", "Author": "ERZ", "ReviewID": "UR17474825", "Content": "For its price, this is a very good deal in Rome. It is no where near the train station but is near the track of a tram Very close to a lot of reasonably priced restos, internet cafe, and laundromat. Not very touristy but a lot of the tourist attractions are close enough that you can walk them like trevi fountain, spanish steps etc. This is also very close to places where locals hang out. Neighborhood is not too quiet but not noisy either. There is a pizerria right by its corner where the servers are very cute. :o) Will definitely stay here again when I go back to Roma. The only complaint I have is that you can hear everything that's happening in the corridor and they can hear the sounds you make in the corridor from the room we occupied. Guests were considerate though so we were not disturbed frequently.", "Date": "July 2, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "3", "Business service (e.g., internet access)": "3", "Check in / front desk": "5", "Overall": "4.0", "Value": "4", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Charlottesville", "Title": "“Simple, Clean and Incredibly Nice Staff”", "Author": "boehnkek08", "ReviewID": "UR17348494", "Content": "I stayed here for 3 nights in June. The first two were in the Annex which I found to be decently large given European standards. It was clean and quiet. The 3rd night was moved the the main hotel and the room was similar to the annex, but maybe a bit smaller. The staff at the hotel was incredibly nice and helpful. I thought it was a good value for Rome right now and in a nice, cute location.", "Date": "June 29, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Check in / front desk": "5", "Overall": "4.0", "Value": "4", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Brithish Columbia", "Title": "“Nice hotel - perfect location”", "Author": "mamiem", "ReviewID": "UR16840222", "Content": "Stayed three nights at the Trastevere in May and we were very pleased with our choice. The neighbourhood was recommended to us by someone who knows Rome, and we were glad we stayed there. The room was not large, but very adequate - make sure you ask for a Superior room. Amandus was always helpful with suggestions and directions. He gave us a wonderful route to walk to the Vatican. We walked everywhere from the hotel, but for those who need to, buses and trams connect easily everywhere from Trastevere. From the airport, we took the M train to the Trastevere station, and then the #8 tram to the hotel. A good map of Rome was very helpful to find our way. There are many good reasonable restaurants right around - go to Da Ivo for great pizza, and Cape de Fero is half a block from the hotel and serves delicious authentic Italian dishes with great service and reasonable prices. Trastevere is a lively neighbourhood, feels very genuine, and the Trastevere rate can't be beat. We would certainly stay there again.", "Date": "June 11, 2008"}, {"Ratings": {"Service": "3", "Cleanliness": "2", "Check in / front desk": "3", "Overall": "2.0", "Value": "2", "Rooms": "2", "Location": "4"}, "AuthorLocation": "Minneapolis, Minnesota", "Title": "“A bit of a disappointment”", "Author": "trainer5740", "ReviewID": "UR15873784", "Content": "We stayed at the Hotel Trastevere for the last 2 nights of a 2 week trip to Italy. Before writing this review, I went back and re-read the other reviews, wondering if there was something I missed. I just didn't find this to be the fabulous little place so many other reviewers did. Maybe it was just bad luck on our part. The room itself is perfectly adequate in size, with 2 typical characteristics that we came to expect in Italy: small bathroom and terrible bed. It was similar in size to our hotel room in Florence. The difference that caused me to rate this 2 levels lower, however, was two-fold: 1) Our window faced the square behind the hotel. To say that this square is noisy in the evening is an understatement. Our first night there was Sat. night. Even with the windows shut tight, we were kept awake by the diners outside. We were finally able to fall asleep despite the noise, but were jarred awake by \"closing time\" some time after midnight. Sun night was not quite as bad, but it still kept us awake. If you're a light sleeper or need quiet to fall asleep, this isn't the place for you. 2) I don't think I'm a particularly picky person when it comes to bathrooms, as long as it's clean. What I can't abide is mildew. The cracks in the shower surround were covered in mildew, and there was mildew on spots on the surround wall itself. The tile in the shower had 2 holes where a rack had probably been located previously; the holes hadn't been caulked, and I kept thinking about the volume of mold that was likely behind those tiles. To cap it all off, the drain was seriously clogged, to the point where I was standing in water up to my ankles and had to turn off the shower every so often so as to not risk flooding the bathroom (even when taking quick showers). The bathroom alone really turned me off the place. I realize we should have brought the issues to their attention, but we were only there for 2 nights, and after 2 weeks of travel I wasn't up to trying to communicate \"mildew\" and \"backed up drain\" across languages. In retrospect, I really wish we'd booked someplace a bit more expensive but also a bit quieter. We did love the neighborhood, just not the hotel.", "Date": "May 9, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Check in / front desk": "5", "Overall": "4.0", "Value": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "New York, NY", "Title": "“I will never stay anywhere else.”", "Author": "The_Tiny_Guide", "ReviewID": "UR13698978", "Content": "I have more to say about Trastevere and the hotel at my blog! The Tiny Guide. First of all, let me say that when you go, trade your incisors for a chance to stay in Trastevere. Trastevere sits just across the river (walking distance!) to many of the historic sites in town and at the Vatican, but it is not so close that you can smell the other tourists Pantene and Old Spice. We selected, after lots of research, the \"budget\" Hotel Trastevere. For €150 per night (Feb rates), we rented an apartment that technically sleeps 5, but would have been much better sleeping two. The whole affair is a three-story room, with two loft sleeping areas stacked on the main living space (and third sleeping area) In one corner is a modest kitchenette. The bathroom is up one flight of stairs. It sits RIGHT next to the second floor sleeping area. This was a bit of a problem, as the men I was traveling with (one in his 60s and one very spry in his 70s) had to get up during the night to go potty. The floor squeaked, the door banged. Not so good. OK. Enough whining: The tall windows featured a view of Piazza San Cosimato. In the piazza every morning but Sunday, you'll find a small, bustling open air market full of seasonal, regional produce, kitchen knick-knacks and flowers. From my noisy second floor twin bed, I had an amazing view of it in the morning. Hard to beat. A fridge! We had a fridge! Though last year, My friend and I took to storing our cheese out on the windowsill (we traveled in winter then as well) having a fridge was very handy for storing our delicious snacks. That said, an icebox is not essential. Snacks in Rome pretty much beat snacks everywhere else - pizza, oranges, pizza, prosciutto, pizza, cheese. You can't find this stuff at all hours, though, so fridge good. If we were a party of two, and no one had to a) sleep by the bathroom or b) make coffee while I was still sleeping, I would have noting negative to say. BEWARE PRISSY PEOPLE: The apartment is a little shabby, it's not the Ritz. I personally couldn't give a crap about ugly coverlets or tape on the showerhead. It's clean and the staff is very very helpful Trastevere is an amazing place to be, and so fun to come home to in the evenings. Don't bother with the breakfast in house. Up the block at Bar Er Trasteverino you can get a darn good cappuccino and a delicious custard-filled croissant for €1.60 (written €1,60 in Italy)", "Date": "February 20, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Check in / front desk": "4", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Newport News, VA", "Title": "“Great Location/Neighborhood”", "Author": "waterlgged", "ReviewID": "UR13359566", "Content": "We selected this hotel as we had spent time in Trastevere the last time we were in Rome staying with friends. Only spent one night in the hotel, and it was definitely up to par. Nice clean rooms/bathroom, great location, and friendly staff. We were headed to the airport before breakfast was served in the morning so can't comment on that. Public transport is nearby with the H bus taking you to Termini, or the Tram to go to Trastevere train station. Paid about 110 euro I believe.", "Date": "February 7, 2008"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Check in / front desk": "4", "Overall": "4.0", "Value": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Cork, Ireland", "Title": "“What a location”", "Author": "cobhtraveler", "ReviewID": "UR11032742", "Content": "TheHotel Trastevere was recomended to us by a friend who had stayed there in 2006 and what a great choice he made.The hotel is small but it has that homely feel about it.The room was clean and tidy and the little dining room for breakfast was just great. Trastevere is a web of cobbled streets and lovely restaurants ,and at night time the place is buzzing with athmosphere.It was our first time in Rome and we will be back to sample the lovely Hotel Trastevere.", "Date": "November 24, 2007"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Pittsfield, MA", "Title": "“Great Place to Stay”", "Author": "guychris", "ReviewID": "UR10066647", "Content": "We stayed at the Hotel Trastevere in September. It is in a lovely and quiet part of Rome. The area is full of wonderful restaurants and bars and everyone comes out at night!! The hotel is small, and therefore able to cater to its guests. The staff, especially Amandus, was extremely polite and helpful. We were able to walk to all of the major sites from the hotel. The breakfast is basic but the capincino was the best we had!! I would recommend the Hotel Trastevere to anyone who wants to stay in Rome. The location is just perfect", "Date": "October 11, 2007"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Business service (e.g., internet access)": "3", "Check in / front desk": "4", "Overall": "4.0", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Denver, Colorado", "Title": "“My first choice in Rome”", "Author": "Haaland", "ReviewID": "UR10055807", "Content": "I've rated this hotel earlier, and seeing that my first review was a bit short and MIGHT be misunderstood by other readers, I find myself writing another. First of all, I give this hotel top rating on location. Mind you, this is out of my needs, wich is to stay in Trastevere. I don't mind travelling around rome by bus or by walks. If you need a hotel in 5 minutes walkingdistance from \"everything\", you might want another hotel. The furnitures are a bit quint, the noise from the streets in mornings during weekdays a bit annoying. The cleanliness is great, the space is great, the price is great, frontdeskhelp are welcoming with good englishskills. Breakfast served is quite basic, with good croissants. 3 minutes walk fram a tramline wich is served constantly, the ride to Torre Argentina is 5-6 minutes long. From Torre Argentina, you can reach every site by foot except Borghese and the Vatican. Good extension by bus from Torre Argenting to the Vaticans (buss 40, a ten minutes ride). Good hotel for romantic getaway, and travellers searching for a clean place to sleep. Dont viist the restauraunt by the same owner. If you mail the hotel asking for offers better priced than prices from internet site, you will be offered \"economy rooms\". Do not book such a room, while they are very dissapointing. Go with the rooms as qouted online.", "Date": "October 8, 2007"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Melbourne, Australia", "Title": "“Our home in Rome!”", "Author": "Gary_Walsh", "ReviewID": "UR8547908", "Content": "This was our second time in Rome, and we couldn't dream of staying somewhere else. Trastevere is where you want to be at night. All the locals come to the area, as it is known as having the best food in Rome. We booked the apartment at Hotel Trastevere for this trip for four nights, but we had to check out and move to two double rooms, as the top level of the apartment was just too hot. It would probably be ok in winter, but I'd suggest staying away in summer, as the A/C just doesn't get to the top. We had a fan, but all this did was blow hot air around. The rooms are clean, pretty spacious for European standards (smaller than standard US rooms) and the beds are very comfortable. The bathrooms are pretty standard, but clean and well kept. Breakfast isn't the best, unless you have a sweet tooth. Pastries are provided, but these are all very sweet. You also have your choice of coffee, and you can have some fruit, or toast (when I say toast, I mean packaged toast... you'll see when you get there) with jams. The staff at Trastevere I have found to be the most helpful and friendly in Italy. They made our stay VERY pleasant. We've stayed twice, and if we return to Rome we're sure to visit again.", "Date": "August 30, 2007"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Check in / front desk": "5", "Overall": "4.0", "Value": "5", "Rooms": "3", "Location": "5"}, "AuthorLocation": "London", "Title": "“Very good base”", "Author": "CallieFoster", "ReviewID": "UR8185030", "Content": "This hotel is a very good base and although it is basic, with a very sweet breakfast, it makes no difference as there is so much to see in Rome and all we wanted was a place to rest our sore feet. Would really recommend staying in Trastevere, especially for the buzzy nightlife and less tourists - would also highly recommend the seafood restaurant in the same building as the hotel but on the other side - walk round the hotel, along the top of the square and it's on your right. Quite pricey but best meal we had.", "Date": "July 19, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Houston, Tx", "Title": "“Wonderful Place!”", "Author": "Orogeny", "ReviewID": "UR7872736", "Content": "Our group of 4 spent 4 nights at this hotel and loved it! The location is wonderful and convenient to many of Rome's sites. There are numerous restaurants nearby and the area felt safe even at night. We were in one of the apartments and we had ample room. The apartment is a three-level affair with a double bed and kitchenette on the lower level, the bathroom and closets on the second level and a loft bedroom with a double bed on the third level. Breakfast was very good and included pastries, juice, fruit and, best of all, endless capucinos! If we ever get the opportunity to travel back to Rome, this will be the first place we call.", "Date": "June 18, 2007"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Check in / front desk": "4", "Overall": "4.0", "Value": "4", "Rooms": "3", "Location": "4"}, "AuthorLocation": "New York, NY", "Title": "“Great Neighborhood, Clean Basic Hotel”", "Author": "FlexibleYuppie", "ReviewID": "UR7853260", "Content": "My husband and I had a great time at Hotel Trastevere. The hotel has a cute lobby with a small dining room. Our room was next door on the ground floor facing the street, but it was still quiet. The room has basic decor. Beds were comfortable, bathroom clean, large window, air conditioning and TV. Also, the building was very secure. Staff was friendly and spoke English. They had yummy pastries for breakfast with cafe, tea, orange juice and some fruit. We loved the location. Great restaurants. People say it's like the Greenwich Village, but it's much nicer and cleaner - more like the West Village but so much better. Tram nearby, but can walk to the Pantheon by foot in about 20 minutes. Great value.", "Date": "June 15, 2007"}, {"Ratings": {"Overall": "2.0"}, "AuthorLocation": "London, United Kingdom", "Title": "“Great location, friendly staff but basic accommodation and breakfast”", "Author": "Tangy20", "ReviewID": "UR6837101", "Content": "My boyfriend and I stayed here between 4th-8th February this year for our first trip to Rome. We took a cab from Termini but the cabbie had trouble finding the hotel as the Trastevere area is a maze of little roads. So there we were dumped in the middle of one of the many cobbled streets. Thank god for my guidebook and map - the geek that I am! The hotel itself was as you would expect from a 2 star hotel - the entrance was simple and ancient - it would not have looked out of place 5 thousand years ago along with the Forum and the Colloseum. We were shown to our rooms and I have to say, I was very disappointed. The rooms looked much nicer on the website, and having stayed at a friend's apartment once in Italy I was looking forward to the traditional tiled or parquet floors and dark wood interiors of Italy. Instead it reminded me of the accommodation I stayed in once on a school trip to France when I was 12. The rooms were very basic - the bathroom was reasonably modern, but there were hardly any hangers in the \"wardrobe\" and we only had one TV channel the entire holiday. Yes, I know we're not there to watch telly but who doesn't like a bit of CNN or BBC World in the background when they're getting ready?! That aside, I can sleep anywhere so it wasn't an issue for me... unfortunately it was a different story for my boyfriend who was kept awake by the sound of revellers outside. Now we like to go out ourselves, but the sound of someone throwing up the contents of a good night out right outside your window doesn't quite have the same calming effect as lavendar. The next morning we were faced with breakfast - both my boyfriend and I are big fans of the \"hotel breakfast\". We love a big free buffet of hot and cold food that you stuff yourselves with and steal a couple of apples and pastries for the rest of the day (you didn't read it here). I had expected something very basic thanks to trip advisor, but my boyfriend had the shock of his life when faced with croissants and er, dry biscuits? Yes, this was our breakfast. Not even fruit, or yoghurt - the bog standard continental offer. Disappointed and unfufilled, we weakly embarked on our first full day in Rome.... OK, so far I have been complaining so here are some pros. The staff were very friendly but my boyfriend makes friends everywhere he goes so this isn't the best guage. The location of the hotel is in Trastevere, an area known for its restaurants which is why we chose to stay here. We like the idea of going out for a meal and drinks afterwards without the worry of getting a cab home. We met a couple whilst dining one night who were booked to stay in another hotel that was billed as being close to St. Peter's but was actually about 8 miles from anything central, including Trastevere. They had to cab it to and back every night. The price wasn't bad either - 95 euros per night for the room but you kinda get what you pay for i.e. basic accommodation. On our second day, we needed to get up early to visit the Vatican City. As we were slow in getting up, I remarked that we really only had 10 minutes to eat breakfast to which my boyfriend replied \" there isn't 10 minutes worth of breakfast to eat there\" and remained grumpy again for the rest of the day (men and their stomachs!). On our last day our lovely \"Roman Holiday\" was slightly marred by an incident. My boyfriend accidentally left his watch behind in the room when we were checking out - he thinks he left it on the bed. He only realised this when we were spending our last few hours exploring. When we went back to pick up our luggage in the afternoon, we asked if anyone had seen anything whilst cleaning up our room but the reception guy said nothing had been handed in. He was even kind enough to go upstairs and have a look around the room - new people had checked in so we weren't allowed to have a look. My boyfriend is convinced the cleaners took the watch, but there is no proof and I think it could have been anyone who had access during those 6 hours... Nonetheless, the hotel experience overall was fine and didn't affect our enjoyment of Rome. I would reccommend this hotel to budget travellers, and maybe groups of friends. However, we have vowed we will always stay in at least a 3 star hotel from now on!", "Date": "February 25, 2007"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Check in / front desk": "4", "Overall": "4.0", "Value": "4", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Stanford, CA", "Title": "“Charming Hotel in a Bustling City”", "Author": "katied626", "ReviewID": "UR5514673", "Content": "My husband and I stayed here for 2 nights at the end of May. We were actually in town for a wedding and hadn't set up accomodations for after the wedding (I know, bad idea for Europe in the summer!). We found the hotel in our AAA book and were relieved when they had a room. I'm not entirely sure how the hotel is split out because on the 1st night we stayed in a building 1 1/2 blocks away from the hotel lobby. It was next to a very popular restaurant and unfortunately there was no AC so we had to open the windows and deal with the noise. The 2nd night we switched rooms to a building that was next to the main lobby. This was much better. The room was slightly bigger (however it's Europe so expect smaller than normal rooms compared to hotels in the US), had AC, and was much quieter. The breakfast was good (croissants, fruit, etc) and the front desk was helpful, although if you want to check out earlier than 8 am, you should let them know the night before so someone is staffed. The location was safe and for the overall price I think the hotel was a great find, considering most other hotels are far more expensive, especially in summer. I would stay there again but definitely make sure to ask for a room that's closer to the hotel lobby for a more sound rest!", "Date": "July 27, 2006"}, {"Ratings": {"Overall": "1.0"}, "AuthorLocation": "Chicago, IL", "Title": "“Unreliable car service caused us to miss our flight!”", "Author": "bananaorama", "ReviewID": "UR5507999", "Content": "Don't stay at this hotel! We arranged a car service to drive us to the airport at 3:30 am to catch a 6:20 am flight back to the U.S. The car service never showed up and the man working at the front desk was extremely unhelpful and unresponsive. He sent us out to the taxi stand when no taxis were in service that night due to a strike. We ended up walking all the way to the train station in the middle of the night to find that the first train didn't leave until 5:52 am so by the time we got to the airport we missed our flight. We ended up paying hundreds of euros to change our flight and stay an extra night at a hotel since our new flight didn't leave until the next day. Upon returning to the U.S., we informed the hotel about our experince and never got a response or an apology. Don't stay at this hotel!", "Date": "July 25, 2006"}, {"Ratings": {"Cleanliness": "5", "Overall": "5.0", "Value": "5", "Service": "5", "Rooms": "5"}, "AuthorLocation": "Bedford, UK", "Title": "“Brilliant place !”", "Author": "A TripAdvisor Member", "ReviewID": "UR5296694", "Content": "We were in Rome recently for our honeymoon and whilst we werent able to book a room in the hotel itself (May is apparently a very busy month in Rome) we were offered a deal on one of the four apartments the hotel owns. The apartment is actually one very tall room which they have cleverly split into three sections. Double bed and kitchen area on first level; bathroom, wardrobes and pull out single bed on the second level and another double bed right in the roof. The apartment had a brilliant view over Piazza San Cosimato and was really light and airy (there was air conditioning as well). We would definitely stay here again - the place was great and the staff are really friendly. The breakfast was great as well with fresh pastries from a local pasticceria and very nice coffee. The location is brilliant - we walked everywhere from here to all the sites, though there is lots of public transport if you want. As for food, there is plenty of choice around Trastevere at many different prices. Cant wait to go back !", "Date": "June 4, 2006"}, {"Ratings": {"Cleanliness": "3", "Overall": "2.0", "Value": "3", "Service": "2", "Rooms": "1"}, "AuthorLocation": "Fife Scotland", "Title": "“re-defines the words basic accomodation”", "Author": "A TripAdvisor Member", "ReviewID": "UR4721740", "Content": "This hotel is well situated and is staffed by professional pleasant caring people but the actual accomodation was incredibly basic and poor, the price although not overly expensive did not reflect the quality of the accomodation and facilities offered, needless to say we could not recomend it.", "Date": "March 21, 2006"}, {"Ratings": {"Overall": "3.0"}, "AuthorLocation": "Cornwall, UK", "Title": "“Ideal hotel ideally situated”", "Author": "bodwenb", "ReviewID": "UR4121627", "Content": "Not the easiest place to find, but when you eventually find your way through the maze of delightful little alleyways that is Trastevere, its a little gem. The first room that I stayed in had a small problem with a leaking pipe, but the staff were friendly and moved me to another room without question. Reasonably priced and ideally located to enable visits to all of the major sights within a 30 min walk, I would definately stay here again.", "Date": "November 16, 2005"}, {"Ratings": {"Cleanliness": "5", "Overall": "5.0", "Value": "5", "Service": "5", "Rooms": "4"}, "AuthorLocation": "Maine", "Title": "“A gem of a hotel”", "Author": "jaysmom4285", "ReviewID": "UR4027363", "Content": "I just returned from a week's stay in Rome at the Hotel Trastevere. The hotel is a real gem, in a great neighborhood, and at a bargain price (105 Euro a night for me and my friend). The rooms would not be considered luxurious by American standards, but they are comfortable, very clean and have everything you would need. Our room looked out onto the Piazza di Cosimato. Hotel staff spoke excellent English and were very pleasant and helpful with suggestions. The neighborhood is totally charming, filled with small shops and places to eat and explore. It was just a few minutes' walk to the Viale de Trastevere and a bus or tram could take you across the river. The Forum area was an easy walk across the river as well. We walked around a great deal fairly late at night and always felt totally safe. If you're looking for a good hotel at a very reasonable price, don't be afraid to try this one. I'll post some pictures if I can ever figure out how!", "Date": "October 16, 2005"}, {"Ratings": {"Cleanliness": "2", "Overall": "2.0", "Value": "2", "Service": "2", "Rooms": "2"}, "AuthorLocation": "Knoxville, TN", "Title": "“Where is the \"lovely\" and \"quaint\"????”", "Author": "tmynatt", "ReviewID": "UR3550629", "Content": "We had a cramped room for 4 and \"lovely\" view of an alley. According to the email I received from Amandus Ludovisi of Hotel Trastevere, our room had a view of the interior courtyard. Look at my accompanying pictures if you want to see the REAL courtyard. There was also a motorcycle repair facility which seemed to be housed on the ground floor of this place. I opened one of the doors and you are immediately in the greasy repair shop complete with pinup calendars of nude women. The hotel had a \"smell\" about it, too. It was not disgusting, but it was NOT a clean smell by any means. I guess you get what you pay for in Rome. I knew that Hotel San Francesco in Trestavere was a bit more expensive and that's part of the reason I chose Hotel Trastevere. We did not stay for breakfast so I cannot comment on that. Also, Trastevere is not exactly a convenient place to stay, and it doesn't look much different than the other gritty parts of Rome. There is still grafitti everywhere and the Tiber River is just a muddy old polluted river. I can't imagine taking a dinner cruise down the Tiber...of all places. I guess the main point is that Hotel Trastevere is a decent 1 night stand sort of place. If you're going to spend any length of time at all I would vote for Hotel San Francesco. Actually if you are going to spend 3 or more days just rent an apartment in the Campo dei Fiori area like we did for our 1st 4 nights. Campo dei Fiori is MUCH more convenient to see sights than Trastevere.", "Date": "June 14, 2005"}, {"Ratings": {"Cleanliness": "4", "Overall": "4.0", "Value": "4", "Service": "3", "Rooms": "4"}, "AuthorLocation": "NYC, NY", "Title": "“Great Location - Great Value”", "Author": "A TripAdvisor Member", "ReviewID": "UR3504426", "Content": "My son found me this hotel near where he was living in Trastevere. I found it to be clean, safe, and spacious. I did reject the first room I was shown that had no view at all, and opted for an apartment they owned a block away. It made me feel as though I too lived in Trastevere! I had no phone, which in my case, was a bit of a drawback. The surrounding area can be noisy at night, but it's livliness and plentiful places to eat is part of what makes this part of Rome so desirable. It has an atmosphere not unlike Greenwich Village, NYC. I recommend buying snacks such as cheese and salami at the nearby Antica Caciara at Via S. Francesco a Ripa 140, run by Roberto and his wife. They will vacuum pack cheese to take home too. They speak no English, but pointing works. Dinner in the Jewish Ghetto at Da Giggetto is always a treat. It's a lovely walk to get there. Da Ivo for Pizza is among the best in Rome and always jammed, also on the Via S. Francesco a Ripa 158", "Date": "May 27, 2005"}, {"Ratings": {"Overall": "2.0"}, "AuthorLocation": "Perth, Australia", "Title": "“Don't leave valuables in your room”", "Author": "A TripAdvisor Member", "ReviewID": "UR3398939", "Content": "Stayed at this hotel which is located in an excellent area for exploring rome. Price of the hotels is good. Rooms are clean and comfortable. Very noisy when other guests come home late. Halls echo badly. My passport went missing while staying at this hotel. Realized that the passport had gone missing after leaving the hotel. Contacted the hotel and they were un-helpful and could not find. Mysteriously showed up some 5 weeks later after I had replaced the passport, made a police report and returned home. Never received the passport back. Beautiful city Rome and a fantastic place to visit....however lots of immigrants selling prada handbags and needing passports.", "Date": "April 22, 2005"}, {"Ratings": {"Overall": "3.0"}, "AuthorLocation": "Essex, England", "Title": "“Good Value for Money”", "Author": "A TripAdvisor Member", "ReviewID": "UR3327648", "Content": "I stayed here in May 2003. I travelled alone and was given a tiny room in an annexe down the road from the main hotel. It had a shower and was clean and tidy but no window, only a skylight. The noise travelled between the rooms a lot too. Having said that, I remember the staff were nice and the very basic breakfast (a croissant) was helped by the excellent coffee. It's best to eat out somewhere for breakfast - there was a superb bakery / general store around the corner with lovely friendly staff. The area is lively with some good and not too expensive restaurants. All the sites are in 20-30 minutes walk. I would certainly stay here agin and intend to this year.", "Date": "April 4, 2005"}, {"Ratings": {"Cleanliness": "4", "Overall": "4.0", "Value": "4", "Service": "4", "Rooms": "4"}, "AuthorLocation": "London", "Title": "“Lovely hotel, great location”", "Author": "Bubbachumps", "ReviewID": "UR3325344", "Content": "We stayed here for four nights in February and loved it. The room was huge, simply furnished and overlooked the square. It felt very Roman and was almost like living in your own appartment! The staff were helpful and the location second to none. Bang in the middle of pretty Trastevere with its delightful bars and restaurants, and only a short walk over the river to Campo dei Fiori and the centre of town.", "Date": "April 3, 2005"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Shepperton, Middx", "Title": "“Great Hotel”", "Author": "mariaShepperton", "ReviewID": "UR3282699", "Content": "We stayed in March 2005 and this was our second stay at the hotel. Last time we stayed in the main part of the hotel but this time we were in the building next door which seems to house some hotel rooms and some appartments. It is serivced by a lift but is much noisier than the hotel so next time I will ask for a room on the hotel side. However, we do feel that some noise is to be expected in a city hotel which offers excellent value for money. The staff are very friendly and are happy to provide an endless supply of cappucinos at breakfast!!!!! The hotel is in a lovely location and all sites are easily accesible, we travel the whole city on foot but there are good transport links nearby if required. The room was large and clean, but the shower bracket was broken so the shower had to be hand held. [we actually used some tape to fix it to the wall to enable us to have a proper shower]. Overall the hotel is a great place to stay and in our opinion offers great value for money. We will definitely stay here again. We would highly recommend: 1. Ivo restaurant, Via di San Fransesco a Ripa 158 2. Alle Fratte di Trastevere, Via delle Fratte di Trastevere, 49/50 [closed on Wednesdays]", "Date": "March 17, 2005"}, {"Ratings": {"Cleanliness": "3", "Overall": "4.0", "Value": "4", "Service": "4", "Rooms": "3"}, "AuthorLocation": "Bristol, UK", "Title": "“A delight...what more could you ask for?”", "Author": "Marudiman", "ReviewID": "UR2809754", "Content": "We've just returned from staying at the Hotel Trastevere in Rome. It was, overall, a decent place to stay in an excellent situation. We were close to the tram and bus links, and only a short walk from the major tourist attractions. Plenty of cheap(ish) eating places around, too. It was also a cheap place to stay (we had a family room, so the two children were also in the same bedroom.) The room was clean and large enough. So, what more could you want? Well...our sleep was badly disrupted by a group of schoolage children - not young,late teens - who came back near midnight and were very noisy. I had to go out and get the nightwatchman and ask him to quieten them down. This barely worked, though the next night, the earplugs did! The view of the market square was not great, but this is a working area, filled with bustling Roman life, so that wasn't a problem. The staff were very helpful, and all spoke some English. For what we paid, for the situation...I would happily recommend this hotel for families visiting Rome.", "Date": "November 6, 2004"}], "HotelInfo": {"Name": "Hotel Trastevere", "HotelURL": "/ShowUserReviews-g187791-d236150-Reviews-Hotel_Trastevere-Rome_Lazio.html", "Price": "$119 - $152*", "Address": "<address><span rel=\"v:address\"><span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">Via Luciano Manara 24-25</span>, <span class=\"locality\"><span property=\"v:postal-code\">00153</span> <span property=\"v:locality\">Rome</span></span>, <span class=\"country-name\" property=\"v:country-name\">Italy</span> </span></span></address>", "HotelID": "236150", "ImgURL": "http://media-cdn.tripadvisor.com/media/photo-o/01/be/85/0e/hotel-trastevere-thumbnail.jpg"}}