{"Reviews": [{"Content": "LOVED IT!!!!       Bathroom", "Date": "Dec 26, 2008", "ReviewID": "UR164304102", "Ratings": {"Service": "5", "Business service": "4", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5", "Value": "5", "Rooms": "4", "Location": "5"}, "Author": "VicksMadrid"}, {"Content": "Close to Christmas market The hotel is situated very close to the Hauptwache underground station, if booking with Hotels.com ignore the directions they give as they are wrong, instead leave the underground at the Rossmarkt exit and the hotel is opposite the exit, the entrance is tucked away next to a shop, the reception is accessed via a lift The hotel is well situated if going to the Christmas markets, no more than a 10 minute stroll away. There are a few restaurants close by and the ones we tried were fine. The hotel is very clean, good value for money and the staff friendly, breakfast is typical continental fayre and provides a good start to the day. The rooms are not huge, but have all you would expect in a typical budget/business hotelIf I was going back to Franfurt I would return to this hotel.", "Date": "Dec 19, 2008", "ReviewID": "UR376327330", "Ratings": {"Service": "3", "Business service": "3", "Cleanliness": "3", "Check in / front desk": "4", "Overall": "3", "Value": "3", "Rooms": "3", "Location": "5"}, "Author": "Wafto"}, {"Content": "Very Poor Service I booked this hotel over 2 months in advance to meet up with some friends in Frankfurt at the end of November.When we arrived at the hotel that we were told that we had been moved to another hotel for first night and would have a place in Hotel Zentrum the following day. No explanation or apology was given for this change of plan.The new hotel was in a pedestrianised area (approx 700m away) and could not be reached by taxi. We were sent off on foot with our luggage and a map which the receptionist had marked incorrectly (I can only assume deliberately) showing the new hotel to be much closer than it actually was. When we eventually found this hotel it was adequate but of a much lower standard than the hotel we had booked.When I complained at Hotel Zentrum the receptionist was barely civil and offered a free beer for my troubles....at 10am!The room in the Zentrum (when we eventually got there) was fine but the bathroom fittings were cracked and the cistern took about a half hour to fill. I found the service very unprofessional and would certainly never go back again.", "Date": "Dec 2, 2008", "ReviewID": "UR160575553", "Ratings": {"Service": "3", "Business service": "-1", "Cleanliness": "3", "Check in / front desk": "1", "Overall": "1", "Value": "2", "Rooms": "2", "Location": "4"}, "Author": "oldpapi"}, {"Content": "hated the zentrum We stayed for one night in this hotel. It is awful, the management is rude and the rooms are very shabby. cigarette burns and stained carpet shabby. The sheets had worn holes in one set. The ceilings are low and the decor is very tired. The bathroom floor was like a swamp with the water moving away from the drain hole. I can only say that yes this is in a good location but there are a lot of other hotels nearby, ones i wished we were staying in! The overnight stay couldn't have been over soon enough!", "Date": "Nov 5, 2008", "ReviewID": "UR368023480", "Ratings": {"Service": "1", "Business service": "1", "Cleanliness": "2", "Check in / front desk": "1", "Overall": "1", "Value": "1", "Rooms": "1", "Location": "4"}, "Author": "pixelgurl"}, {"Content": "Veru pleasant Very very pleasant hotel, comfortable, friendly and kind reception, tasty breakfast, 褋lean room with bathroom. Suitable variant for the 3*** class.", "Date": "Oct 8, 2008", "ReviewID": "UR648803904", "Ratings": {"Service": "5", "Business service": "2", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5", "Value": "4", "Rooms": "5", "Location": "5"}, "Author": "nikolskij"}, {"Content": "Excellent Location I stayed in Frankfurt (as a tourist) for three days during the second week of July. This was my first trip to Germany. I was going to Asia and had taken a stopover at Frankfurt to visit nearby attractions. From a tourist point of view there is not much to see in Frankfurt. You shouldn't miss the Main river, Main tower (observation platform), Romer, Zeil, and Alt Oper. You can complete your tour of the city in 4-8 hours. I chose this hotel entirely for its location and I was not disappointed. The hotel is located right in the centre of the city and you can walk to all attractions by foot. The nearest train station is just nearby (as the hotel website justifiably says 50 m). I was a bit skeptical about the Main Station area where you can find many hotels at a cheaper rate. People had given mixed reviews: some weren't bothered by the seedy neighbourhood, while some said it should be avoided. I didn't venture out of the Main Station, so I can't comment. I think if you want to stay overnight in Frankfurt (e.g., if you are making a connection next day), then it is fine to stay near the Main Station. As a tourist you would like to stay near the centre of the city and the Main Station is about 2-3 kms away.The first day I checked in I was given a room facing the courtyard. The room was unusually warm. It was a hot day (26 C). However, I later realized that the heater was on and I couldn't switch it off. I spent the night in that room anyway. I asked the hotel staff to give me two fans. That didn't help much. Also, the TV remote didn't work. Next morning I switched rooms. This time I got a much better room facing the street and it wasn't hot. I still needed the fan (but now I was comfortable).Amenities are limited. I found it strange that the room didn't have an alarm clock. Generally, clocks are integrated into the TVs in European hotels. Internet is extra. The bed was okay. The bathroom was neat and tidy. Overall, the room was not luxurious, but had all basic necessities (at $95/night this is okay, I guess). Breakfast buffet was fine. Hotel staff were courteous and very helpful.You can take the S-bahn (S8 or S9) from the Frankfurt airport (below terminal 1 section B) directly to the Hauptwache station. Make sure you have cash. The ticket machines only take notes and coins. The train to Frankfurt city usually arrives on platform # 1. Mastering the subway (U-Bahn, S-Bahn, Regional Express, etc.) will take time, if you are not familiar with the system. All machines have an English version; so that should help. However, I strongly suggest that you do some research on how to use the machines and ride the trains before arriving. At first it could be challenging, however, after a few trips you will have no troubles.You can easily do day trips to nearby cities and towns. I went to Cologne (Koln) and Heidelberg. The Inter City Express (ICE) from Frankfurt to Cologne takes only an hour and a half [Speeds of up to 300 km/h]. Inter City train takes 50-80 minutes from Frankfurt to Heidelberg. There are other trains as well (Regional Express, S-Bahn, etc.) which could take a little longer. If you visit Heidelberg, you can also visit Stuttgart which is 50 minutes away. Be punctual as the trains will always leave on time. You can save on ICE ticket prices if you purchase them in advance (up to 50%). For other trains, pre-booking same day return trip may not yield savings. Also, make sure you reserve your seat for trains, when given the option. This would save you the hassle of fighting for an empty seat. Cost 4 euros per return trip and I believe is worth it.", "Date": "Jul 14, 2008", "ReviewID": "UR792729846", "Ratings": {"Service": "5", "Business service": "3", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "4", "Value": "3", "Rooms": "3", "Location": "5"}, "Author": "Sigmetrics"}, {"Content": "Excellent Value Hotel in a Great Location       Hotel exterior as viewed from the top of Main Tower", "Date": "May 30, 2008", "ReviewID": "UR123501265", "Ratings": {"Service": "4", "Business service": "1", "Cleanliness": "5", "Check in / front desk": "4", "Overall": "4", "Value": "5", "Rooms": "4", "Location": "5"}, "Author": "Astuteboy"}, {"Content": "great hotel, great location This hotel has a great location with the metro right outside your door. In the heart of the Zeil shopping district and walking distance to the Romer area of Frankfurt. Clean, good sized rooms and an excellent breakfast included.", "Date": "Feb 8, 2008", "ReviewID": "UR761811694", "Ratings": {"Service": "-1", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "4", "Value": "-1", "Rooms": "-1", "Location": "-1"}, "Author": "mavis123"}, {"Content": "sehr einfaches Hotel preis leistung schlecht   showReview(18539133, 'full');", "Date": "Jul 23, 2008", "ReviewID": "UR310259888", "Ratings": {"Service": "4", "Business service": "-1", "Cleanliness": "2", "Check in / front desk": "-1", "Overall": "3", "Value": "-1", "Rooms": "3", "Location": "-1"}, "Author": "lass="}, {"Content": "Somos un matrimonio de...   showReview(17740144, 'full');", "Date": "Jun 9, 2008", "ReviewID": "UR796890971", "Ratings": {"Service": "5", "Business service": "-1", "Cleanliness": "5", "Check in / front desk": "-1", "Overall": "5", "Value": "5", "Rooms": "5", "Location": "-1"}, "Author": "lass="}, {"Content": "Gerne wieder   showReview(16599018, 'full');", "Date": "May 8, 2008", "ReviewID": "UR619185008", "Ratings": {"Service": "4", "Business service": "-1", "Cleanliness": "4", "Check in / front desk": "-1", "Overall": "4", "Value": "-1", "Rooms": "3", "Location": "-1"}, "Author": "lass="}, {"Content": "Abbiamo soggiornato per la...   showReview(16728327, 'full');", "Date": "May 1, 2008", "ReviewID": "UR353925429", "Ratings": {"Service": "5", "Business service": "-1", "Cleanliness": "4", "Check in / front desk": "-1", "Overall": "4", "Value": "4", "Rooms": "5", "Location": "-1"}, "Author": "lass="}, {"Content": "Lage, Fr眉hst眉cksbuffet, Sauberkeit - Klasse   showReview(14725901, 'full');", "Date": "Mar 25, 2008", "ReviewID": "UR927231653", "Ratings": {"Service": "5", "Business service": "-1", "Cleanliness": "5", "Check in / front desk": "-1", "Overall": "4", "Value": "-1", "Rooms": "3", "Location": "-1"}, "Author": "lass="}, {"Content": "Ottima locazione, molto...   showReview(13930021, 'full');", "Date": "Feb 25, 2008", "ReviewID": "UR737829662", "Ratings": {"Service": "3", "Business service": "-1", "Cleanliness": "4", "Check in / front desk": "-1", "Overall": "4", "Value": "4", "Rooms": "4", "Location": "-1"}, "Author": "lass="}, {"Content": "Veramente sporco, ma in una posizione eccezionale   showReview(13983622, 'full');", "Date": "Feb 15, 2008", "ReviewID": "UR383941080", "Ratings": {"Service": "2", "Business service": "-1", "Cleanliness": "1", "Check in / front desk": "-1", "Overall": "1", "Value": "-1", "Rooms": "1", "Location": "-1"}, "Author": "lass="}, {"Content": "Gut   showReview(13198694, 'full');", "Date": "Jan 6, 2008", "ReviewID": "UR235433335", "Ratings": {"Service": "5", "Business service": "-1", "Cleanliness": "5", "Check in / front desk": "-1", "Overall": "5", "Value": "-1", "Rooms": "5", "Location": "-1"}, "Author": "lass="}, {"Content": "Sinceramente perfetto...   showReview(11442856, 'full');", "Date": "Sep 19, 2007", "ReviewID": "UR670894628", "Ratings": {"Service": "5", "Business service": "-1", "Cleanliness": "5", "Check in / front desk": "-1", "Overall": "4", "Value": "3", "Rooms": "5", "Location": "-1"}, "Author": "lass="}, {"Content": "Zentrales Hotel   showReview(11434093, 'full');", "Date": "May 11, 2007", "ReviewID": "UR272485604", "Ratings": {"Service": "4", "Business service": "-1", "Cleanliness": "4", "Check in / front desk": "-1", "Overall": "5", "Value": "-1", "Rooms": "4", "Location": "-1"}, "Author": "lass="}, {"Content": "Il punto forte di questo hotel...   showReview(11442857, 'full');", "Date": "Feb 6, 2006", "ReviewID": "UR589577715", "Ratings": {"Service": "3", "Business service": "-1", "Cleanliness": "4", "Check in / front desk": "-1", "Overall": "3", "Value": "2", "Rooms": "3", "Location": "-1"}, "Author": "lass="}], "HotelInfo": {"HotelURL": "http://www.tripadvisor.com/ShowUserReviews-g187337-d236681-r23009416-Hotel_Zentrum_Hauptwache-Frankfurt_Hesse.html", "HotelID": "236681", "Price": "$237"}}