{"Reviews": [{"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Herndon, VA", "Title": "“A Good Place for a Reasonable Price”", "Author": "rldonovan", "ReviewID": "UR126941434", "Content": "My wife and I recently stayed at this hotel. I travel frequently on business and usually select the upper range of hotels. The Nardizzi Americana is not a Marriott Resort, etc. However, it is typical of a reasonably priced hotel in a large city, very comparable to a number of hotels where I have stayed in New York City. The room was large enough, it was clean, it appeared to have been recently refinished. We had a room with a window that opened onto a courtyard and the noise level was quite acceptable. The walls are thinner than a top-flight hotel, but not to the extent that one hears every noise next door. I must say the staff was helpful and friendly, and seemed to enjoy talking to us. The breakfast was not at all bad for Italy -- they don't do American breakfasts there. There was cereal, a couple of kinds of fresh pasteries, juice, milk, and a coffee machine with several types of coffee, including American style. The breakfast was generally well stocked, even when busy. Our only complaint was that there was a light burned out in our bathroom that caused my wife some issues applying makeup and, although we asked more than once, it was never replaced. Really though, we enjoyed our stay and thought the place was pleasant and an outstanding value for a downtown hotel in a large city.", "Date": "March 29, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Oxford", "Title": "“Stayed twice in last 6 months - and will stay again”", "Author": "VitoOxford", "ReviewID": "UR126811915", "Content": "Excellent location - you can walk from Termini, restaurants, grocery, Borghese and on and on and on. The staff is helpful, and the rooms are clean and comfortable. Free wifi in the lobby. The coffee at breakfast is from a machine - so plan to get a great espresso while you are out and about in Rome.", "Date": "March 28, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Palma de Mallorca, Spain", "Title": "“Clean, good location, great service”", "Author": "lilypond_808", "ReviewID": "UR126382464", "Content": "I was a little worried when I was planning my trip to Rome last year, after reading so many reviews about many hotels failing to provide what was expected. So I took a chance with Nardizzi. I was pleasantly surprised! The Hotel is located at the end of a steep road (via Firenze) and it is on the 4th floor of a huge building. It's within walking distance of Termini Railway Station (although I took a bus), of the Metro Station (Piazza de la Reppublica) and many bus lines. The service at check-in was excellent I didn't get the name of the receptionist but he was really helpful with all our questions, he spoke English and Spanish to us. He showed us to our room himself. Our room was big enough, and very clean. The bathroom was spacious and the beds comfortable. Take into consideration that spaces in Europe (in general) are much smaller than in America for example. The room ha a TV, and I don't remember if they had English speaking channels or not, because I was so tired when I got back at night! Who has the time to watch TV? They had free wifi to use at the reception, which was helpful. Breakfast was OK, if you want better coffee you can pay a little more, or just go down the street to a cafe. They had fresh croissants and bread with butter and jam, which I liked. One day we walked from the Hotel to Fontana di Trevi, it was not that long, and we took pictures along the way. If you want to use the buses, just go down the street and there are several buses that can take you closer to the center and to St Paul's Cathedral. Overall I had a great time, I had more than what I expected.", "Date": "March 20, 2012"}, {"Ratings": {"Service": "2", "Cleanliness": "1", "Overall": "2.0", "Value": "1", "Sleep Quality": "3", "Rooms": "2", "Location": "4"}, "AuthorLocation": "Glasgow, United Kingdom", "Title": "“Potential to be good but fall's short”", "Author": "charlene1873", "ReviewID": "UR124061125", "Content": "Having just returned from Rome, I am not one of these people with extremely ridiculous standards and I knew I'd booked a 2 star hotel so wasn't really expecting much however I was disappointed with the standard of room that we did get. There was several things that I'd warn about before booking. The hotel has the potential to be great as it's in a great location next to the underground, the Termini and Via National. The free breakfast was great and even the old crazy lift added character to the place. When we arrived it was a fairly simple check in process, the reception desk was helpful enough and we were taken to our room. The room was a double which in turn was 2 single beds pushed together, it faced another building across the way so there was no view. The roof had extreme dampness marks on it and the window pane of the french doors wasn't attached to the actual wood so the glass flapped about. In the summer warmer months this wouldn't have been an issue but it was January and pretty cold. The shutters over the window don't keep any of the heat in so it was a really cold room. The bathroom was fine apart from the toilet coming away from the wall everytime you sat on it and it filled the bathroom floor with toilet water which wasn't pleasant. We'd also asked for a non-smoking room but people smoking in the next room meant that we could smell all the smoke. Becase of the vents it was like they were smoking in your room. I complained about all of the issues and didn't really get anywhere as their English wasn't great, one of the desk people came in and sprayed fabreeze everywhere which just made it worse so we had to open up the windows and the room ended up freezing again. The cleaners made a fair attempt at keeping it clean but just folded up our old towels instead of replacing them and given that we stayed for 6 nights I had to ask for some new towels. I hate to moan but it just fell short and had the potential to be a wee gem if it just tightened up on attention to detail.", "Date": "February 3, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Atlanta, Georgia", "Title": "“Excellent location and comfortable room”", "Author": "jezebellejade", "ReviewID": "UR123421236", "Content": "Excellent location in Rome. Near the train station and busy Via Nazionale, but on a quiet side street. Small, slow lift, and the alternate climb up 4 flights of stairs can be tiring. However, staff was helpful and room was comfortable with free wifi.", "Date": "January 21, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Location": "5"}, "AuthorLocation": "Geneva, Switzerland", "Title": "“A comfortable room with a Great Location”", "Author": "Daniel B", "ReviewID": "UR122988680", "Content": "Ok so i read some reviews about this property prior to booking this and after staying here, some other reviews make some valid points but... Yes the lift is small but we were both able to fit into it with our two quite large bags, it did take a little shuffling around but we made it work as it beats walking up four flights of stairs. Yes the Wifi \"DID\" work in our room and it was also \"FREE\" unlike alot of other places in Europe that charge approx 3 euro per hr. Yes the rooms are small but who comes all the way to Rome to sit on the end of their bed all day?? We used the room to wash-up, sleep and somewhere to leave our bags. Our room was serviced everyday and the hotel allows you to leave your (large) key at reception, rather than having to worry about it on the street. The boys that ran the reception were awesome, were friendly and happy to have a chat with you. The showed us some good areas to eat and drink and where to spend new years. They also showed us to the nearest laundromat. The location is great, right near the main train station and just off Via Nazionale.Another great thing about the location is that we booked alot of tours as it was our first time to Rome and we were able to walk to all our pick-up areas (apart from Vatican City). the breakfast was simple but nice with a wide range of different pastries and spreads & cereals. The only thing that we found a 'con' was that there was someone smoking in the corridor or room next to us and it smelt as if they were in our room. Nothing to harp on just had to open a window (in winter) The last thing is that the City of Rome charges tourists to stay in the city. 2 euro per person per day. This is not governed by the hotel so they do request cash for this payment.", "Date": "January 12, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "3.0", "Value": "4", "Sleep Quality": "3", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Lakeland, Florida", "Title": "“Budget hotel with a nice interior”", "Author": "MarbleOwl", "ReviewID": "UR122190629", "Content": "I personally knew the hotel since my first trip with parents when I was 8 years old. The Hotel has an excellent location near the Termini station, but without the noise and people movement associated with it, and it is also very near to a subway station, which makes it interesting for a city visit. The rooms have been refurbished internally, and they face on a nearby Mounted Police headquarter, you'd be delighted to watch the guards riding their horses every morning at 8 o'clock. The only drawback is the rooms are relatively small (but acceptable for Rome), and the breakfast is quite basic.", "Date": "December 28, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Dayton, Ohio", "Title": "“Great Budget property”", "Author": "Beverly M", "ReviewID": "UR120655756", "Content": "Stayed at the Nardizzi for 2 nts and it is conveniently located to Termini station. About a 10-15 minute walk. Staff friendly and helpful, property clean. Breakfast just cereal and a sweet, but adequate. Would stay here again.", "Date": "November 16, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Michigan", "Title": "“Rome Hotel”", "Author": "schmunkie", "ReviewID": "UR119486029", "Content": "This hotel is in a fantastic location! It is very basic, but great for the price. You will need to go up two small sets of steps to get to the elevator, but after that, there is no problem. We would stay here again anytime. Our room was 406 and we had a view of a beautiful courtyard of any embassy across the street. We would not hesitate to stay here again.", "Date": "October 19, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "4.0", "Value": "3", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Cincinnati, Ohio", "Title": "“Convenient to Termini Station and other sites”", "Author": "FrqtTrvlr14", "ReviewID": "UR119365460", "Content": "This was our first stay at this hotel, we've been to Rome many times before. The hotel is a bit worn, but a good value for budget travelers. The rooms are large, the staff friendly, and the breakfast nice. It's a ten minute walk from Termini station, and about 15 minutes to Trevi Fountain, Spanish Steps, and other sites. They have wireless, but no public computer to use.", "Date": "October 16, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "3", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Vancouver, Canada", "Title": "“Two star hotel with a three or four star service”", "Author": "CBRRyder", "ReviewID": "UR119252460", "Content": "The hotel is located on the top floor of a private building off of the main road. My first impression was the thought of how nice and quiet to lodge here for a week. The only noise you will hear was the morning Italian opera singing from the Korean church below. Occasionally, you can hear kids running around late at night. Hey who wouldn’t be excited to be in Rome? I shared the room with my friend. We had a much bigger room compared to the last hotel we stayed. Our room was at the end of the hall so we didn’t encounter any loud neighbours. The Italian hotels are very simple and clean. Most hotels have marble floor so you might want to bring your own indoor slippers. The bathroom had a shower stall that was just big enough for one person. The hot water can get really hot. I really enjoyed it compared to the lack of hot water experience in Indian hotels. All Italian bathrooms have a bidet for washing your buttocks, but we used it differently. Streets in Rome have very old cobble stone and it can be very hard on your feet. The bidet was the perfect solution to relieve the soreness. Hotel didn’t provide much free toiletry products. We used mostly products we brought with us. There was a heated towel rack but I don’t think it was working. Maybe it’s only turned on for the cold winter. The AC controller dialler was removed so you cannot control the temperature. It’s all on or nothing. We slept ok under the AC. It did get a little cold at night for me but my friend didn’t find it was too cold with the AC on. Our beds were two single beds pushed together. We were only given one big bed sheet and a blanket so we kept our beds pushed together by sharing the bedding. Closet space was plenty for the both of us. They provided nice wooden coat hangers. We used them mostly for our hand washed personal clothing items. The safety lock is not electronic but rather opened with an old key. It’s quite small mounted into the wall. It was big enough just to fit the passport and wallet. Our section of the corridor always smelled really good. The lights were energy efficient as it was motion sensor controlled. I like that about Italian hotels. Everything is efficient and reserves energy. The complimentary breakfast was simple. They provided cereal, milk, tea, coffee and water. There were pastry but no other hot food was prepared. Would I stay again? Yes in a heart beat! Wouldn’t you want to stay at a place where you feel welcomed and safe? Even the cleaning ladies were really nice and helpful. I didn’t know what they were saying but they always provided what we needed on a daily basis. There’s so much to offer with this hotel.", "Date": "October 13, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Sleep Quality": "4", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Rio de Janeiro, RJ", "Title": "“Outstanding hotel”", "Author": "fernandeskiko", "ReviewID": "UR119033571", "Content": "Its different. If it's good or not ? Depend your mood. The arrive can surprise, it's a old building, doesn't seems a hotel. In the first floor there's a church and a living room with an old, manual and tight elevator . There's noboby to recept you down there. But as soon as you reach the fourth floor bravely (yes, the elevator can scare you) you gonna find a pleasent reception. The hotel is small but confortable. The location is good, walk distance to railway, metro and bus stations. Go with a good vibe and you gonna enjoy.", "Date": "October 7, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "3", "Overall": "1.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Kingston, Canada", "Title": "“unfriendly staff”", "Author": "macnstac", "ReviewID": "UR118570008", "Content": "Front desk staff was terribly unfriendly and unhelpful. Lobby is located on the 4th floor and the elevator is tiny. If you're checking in with more than 2 bags, or a baby stroller (as in our case) you might have to make a couple of trips. There are a lot of hotels on Via Firenze, and you'd be better off choosing one of the others.", "Date": "September 25, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "4.0", "Value": "4", "Service": "4"}, "AuthorLocation": "California", "Title": "“A return trip”", "Author": "Ollie076", "ReviewID": "UR117478045", "Content": "We had stayed here twice before on previous Rome trips and found this budget hotel was again excellent value. It is in a good location not far from the railway station as well as being within walking distance of most of the main sights. This time we stayed twice. First on arrival in Rome and then came back for a second visit after two weeks in Tuscany. On the second occasion they upgraded us to more expensive rooms at no extra charge because we had been stayed there previously. We found the staff very helpful and intend using them again on future visits to Rome.", "Date": "August 31, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "", "Title": "“Ignore bad reviews - LOVED it!”", "Author": "SunSpangles", "ReviewID": "UR117097702", "Content": "We stayed here when our usual Roma hotel was full. We were a little worried when we arrived and seen the elevator as we thought we may have dropped a clanger....but when we got upstairs we entered the open air reception where we could sit and have a drink (and a cigarette!) We were even more surprised when we went to the rooms - they were actually lovely and the beds were clean and comfortable. Yes, not the most luxurious of rooms in the world but good enough! And it's not far to walk to the main attractions so no worries there. Honestly...this hotel is quirky and we loved it. (oh and we didn't die in the lift!!)", "Date": "August 22, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Renton, Washington", "Title": "“Loved it! great value and service, highly recommended”", "Author": "giulia g", "ReviewID": "UR116503482", "Content": "The staff was extremely friendly, the owner was lovely and the room was clean and quite. The location is great (5 min by foot from Termini station) and the price is reasonable. Breakfast is served in a delightful patio (fresh pastries were YUMMY!). IHighly recommended!", "Date": "August 10, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "3.0", "Value": "4", "Service": "3"}, "AuthorLocation": "Madisonville, Louisiana", "Title": "“Quiet & Comfortable”", "Author": "skyhawk13", "ReviewID": "UR116161490", "Content": "This hotel is on the 4th floor of a large building and is small and intimate. There is an elevator but it is only for 2 people. The staff is friendly and helpful. The location is convienent to the Metro and bus lines. The breakfast was included and was served on an open veranda. It was nothing special but what you expect in Italy.", "Date": "August 2, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "4", "Overall": "4.0", "Value": "4", "Service": "4"}, "AuthorLocation": "Napa, California", "Title": "“Good choice for location and price.”", "Author": "canaclay", "ReviewID": "UR115896029", "Content": "Finding a reasonable hotel in Rome at the last minute is a challenge. I found this hotel on the web, and was more than pleased with it. It's in a good location, top floor of an old building, accessible by marble stairs and a wonderful funky old elevator, Room itself was spacious, modern, and had a nice view. Breakfast included, but it was the serve yourself type typical of many moderate hotels these days. Free Wifi in public spaces, but if you aren't European, take your own adapter. (And it is fairly close to the rail terminal; don't be scammed by a taxi driver. Take the metro.)", "Date": "July 28, 2011"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Overall": "2.0", "Value": "3", "Location": "5", "Rooms": "2"}, "AuthorLocation": "", "Title": "“Wouldn't stay here again”", "Author": "AJbull", "ReviewID": "UR115805954", "Content": "Overal I didn't enjoy my stay here. I've only stayed in one other hotel in Rome so I can only compare with that one plus the many others I've stayed in around Italy, particularly southern Italy. Our room is a reasonable size for the price, but prob in the worst section of the hotel. We can hear everytime the people around us use the bathroom, walk in hallway etc. The room itself has not much in it. One bedside bench, a bench holding the tv, and a tiny cupboard with a tiny safe box. The tv dosent work well, and neither does the hair dryer (at all) Wifi only accesible in the lobby, and cuts out regularly. Breakfast is poor, especially the coffee ( from a sort of vending machine) which was annoying seeing that I got no sleep in the room. The location is great and I guess the price justifies the hotels offerings. Me, I wouldn't come back.", "Date": "July 26, 2011"}, {"Ratings": {"Cleanliness": "3", "Sleep Quality": "2", "Overall": "3.0", "Value": "3", "Service": "2"}, "AuthorLocation": "Gainesville, Florida", "Title": "“Not very friendly; BAD mattresses”", "Author": "beckym1313", "ReviewID": "UR115320430", "Content": "Inexpensive, good location, good air-conditioning. Staff not very helpful to non-italian speaking tourists. The mattress had large sunken areas from previous use and desperately needed to be replaced.", "Date": "July 13, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "4.0", "Value": "4", "Service": "4"}, "AuthorLocation": "Saint Augustine, Florida", "Title": "“A great stay”", "Author": "JBecht", "ReviewID": "UR114015862", "Content": "We booked this hotel mainly because of the Rick Steves' travel guide recommendation. After booking, we were a bit hesitant about what we'd find there, after reading some traveller reviews of the property. We were pleasantly surprised once we arrived. Yes, this hotel is up 4 flights of stairs, but there is a lift that works just fine. The staff were courteous. The room was great - no smells and very clean. AC worked well. There is a common area on the terrace that was a great place to rest and regroup from sightseeing. Breakfast was fine - quality and quantity (not the best, but not bad either). We had room #8 on the same level as the checkin/breakfast area and it had a nice view of the courtyard and was well decorated/functional. I would confirm the room rate / tax situation up front, we were asked to pay for the tax at checkout in cash which seemed odd.", "Date": "June 17, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Phoenix, Arizona", "Title": "“Safe, secure, friendly - great hotel!!”", "Author": "RobinT30", "ReviewID": "UR113813128", "Content": "We just left the Hotel Nardizzi and enjoyed every minute of our stay. The staff was incredibly friendly and very professional. They all were quite helpful as well as charming. Continental breakfast was yummy. The room was quiet and comfortable. The location was perfect! I would stay here again without hesitation.", "Date": "June 16, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "2", "Overall": "2.0", "Value": "3", "Sleep Quality": "2", "Rooms": "1", "Location": "4"}, "AuthorLocation": "Livingston, Montana", "Title": "“Not impressed!”", "Author": "Janellbelle", "ReviewID": "UR109248829", "Content": "My husband and I stayed here the first place of our two week Italy trip. I booked because of Rick Steves and I liked the pictures on their website. This hotel was really strange though. We had to go up three flights of stairs just to get to the reservation desk, the other choice was a death trap elevator! Then once you get to the reservation desk, the two different people were not too friendly to us. I really got the feeling that I was bothering them by talking to them, so I stayed out of their way. They also proceeded to yell at another customer while I was waiting in line to get info on the internet (which was not working too well when we were there). When we walked down another flight of stairs to our room (very strange layout), our room was dark, depressing and old. The shower head would fly off the stand while we were trying to shower and would get water all over everywhere and the bathroom kept giving off whiffs of sewer smell that you could smell all night while laying in bed. The one morning we were there, we woke up and breakfast was all gone besides 2 crusty old rolls. They said that we were at the tail end of their breakfast at 9 am! There wasn't even any water for us left. And they acted like it was a big pain when we asked to get us at least some extra water. I was not impressed and not sure what Rick Steves sees in the place?!? It was hard to even communicate with them about anything that we needed! Would not stay again!", "Date": "May 21, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "2.0", "Value": "2", "Sleep Quality": "1", "Rooms": "2", "Location": "4"}, "AuthorLocation": "sutton", "Title": "“souless even just for sleeping in”", "Author": "gillsha", "ReviewID": "UR97988115", "Content": "Direction given by the hotel from the train station were abbismal,ended up walking in completely the wrong direction(and i can read a map if thats what you are thinking!!!) Arrived there around 10pm front door locked so rang the bell but be careful there are 2 hotels in the building,no answer just the door opening electrically.When you eventually get inside the reception is on the 4th floor but you have to find the lift!!!! We were taken to our room after booking in but if you have any sort of disability dont use this hotel as our room was then down 3 flights of stairs which do not have a lift to this floor so when you want to go for breakfast or to leave the hotel you have to go back up to the fourth floor to go back down in the lift as most of that side of the hotel is private apartmnts,hope that made sense.The room was a good size except it was colder in the room than outside and the air con didnt work.The walls are also paper thin as in the room next door the occupant had his tv on all night so as we couldnt sleep for the cold it wouldnt have mattered as the noise from next door would have kept us awake!! Also im not sure what the sheets and pillowcases were washed in but the smell coming from them made me feel sick all night coupled with the smell of drains coming from the bathroom.The breakfast was a free for all and there werent enough tables.So all in all i would say dont choose this hotel even if it is in a good location for everything.PS i am not a fussy traveller but i really was disappointed with this hotel.", "Date": "February 25, 2011"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Overall": "3.0", "Value": "2", "Sleep Quality": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Paris, France", "Title": "“found small camera in the room!”", "Author": "bacon89", "ReviewID": "UR94687823", "Content": "The location of the nardizzi is good, it is easily accessible from the station, the Trevi fountain, shops and food. The room was a decent size for 4 people, however the TV didn't work. Upon inspecting the TV, we found a TINY little hidden camera, attached to the front, facing the bed! We immediately covered it up. The electricity in the whole room blew when we turned on the light in the bathroom. You must leave the key at reception, which i understand is so you dont lose it, but as we already had a funny feeling about these guys (all men behind the desk) we didnt feel too secure. Came to use the internet, there was no Wifi available in the rooms, and couldn't use it in the lobby because their network could only handle one computer at a at time...including theirs! When asked, they said \"it can't handle too many computers, and we have our connected and our iphones'. yeah, wasn't too impressed with that as every other one had wifi in the rooms. I wouldn't stay there again. breakfast was okay, not amazing.", "Date": "January 27, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Cincinnati", "Title": "“Met our needs”", "Author": "KatieXU", "ReviewID": "UR85607719", "Content": "Convenient location within walking distance to most major sites (except the Vatican). Standard European breakfast (all carbs, but good selection). Very helpful staff. Very basic room, but clean. Only minus was that our bathroom smelled a bit like sewage so we kept that door shut. Some pluses: a nice sitting area that we brought food back to one evening for dinner, a computer for public use (very slow, but nice to have)", "Date": "November 1, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "3", "Sleep Quality": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Istanbul, Turkey", "Title": "“excellent”", "Author": "gokhan_10", "ReviewID": "UR84881114", "Content": "thank you for your great hospitality and friendship .. next time i'm sure i'll stay at your place..", "Date": "October 26, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "4"}, "AuthorLocation": "San Mateo, California", "Title": "“I would never stay here again!!”", "Author": "Bissell1", "ReviewID": "UR82504235", "Content": "We arrived in front of a large building in Rome, Italy. The plaquard on the wall said Hotel Nardizzi on one side and Hotel Oceana on the other. We walked up four steps and headed down the hallway towards the elevator. We loaded all of our luggage into the elevator and took it to the fourth floor to check in. We exited the elevator, only to be met by the manger who told us to get back in the elevator with our luggage and head to the first floor. Once on the first floor, we had to schlepp our luggage up one flight of stairs to get to the \"wing\" where we would find our room. We had to buzz the front desk to get access to the \"wing\" who monitored comings and goings via a camera. Once in the \"wing\" we walked down a long hallway to the end and entered the door to our actual room. The room was a \"triple\" which is what I requested, however, the room was very, very small with dirty linens (one of the sheets had blood on it), the air conditioning did not work and the tv was mounted so far up the wall, you could barely see it. The bathroom was really not any better. The shower did not have long lasting hot water so we had to stagger showers, etc. On the 3rd floor of this old building is another hotel called Hotel Oceana. I have no idea what that was like but I would never go back. All night long, I worried about cockroaches or some other rodent crawling across my bed. If I could have clicked my heels two times and made myself disappear I would have. The reason we did not move hotels is because I booked these all through STA Travel who assured me these were great, reputable hotels. Let me assure you this was not and was more like a student hostel. I do not recommend you book this hotel at all. You will be charged outrageous prices for nothing more than a dump. Do you research and steer clear from this hotel.", "Date": "October 7, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "4"}, "AuthorLocation": "MX", "Title": "“worst hotel ever”", "Author": "MOE7Mx", "ReviewID": "UR82363057", "Content": "Really poor service... if it could be called so, WiFi having trouble all the time, computer always semm to be broken... dirty rooms, microscopic showers... think twice before choosing it.", "Date": "October 6, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "2.0", "Value": "2", "Sleep Quality": "3", "Rooms": "2", "Location": "3"}, "AuthorLocation": "Melbourne", "Title": "“Ok the first time, not so good the second”", "Author": "Kask_8", "ReviewID": "UR82143897", "Content": "First time we stayed at the start of our holiday, the room was on the fourth floor near the reception, small (which i believe is typical of rooms in Rome), a bit worn, but clean with comfortable beds. when we stayed again at the end of the holiday we were on the first floor which could only be accessed by stairs, the room was extremely small, and bathroom had mould all over one corner of the ceiling, and smelled very mildewy, so not good. The staff are OK, and basically courteous, but the feeling you get from Italians is that they don't really care about hospitality. The breakfast was pretty meagre - the worst for the trip. The building is fairly decrepit, which is pretty typical of places in Rome. Not much in the area by way of restaurants either. Suggest waiting for the off-season to get cheaper rates at a better hotel, or avoiding Rome altogether.", "Date": "October 5, 2010"}, {"Ratings": {"Overall": "1.0", "Value": "1", "Service": "1"}, "AuthorLocation": "Firenze", "Title": "“Rude and without care”", "Author": "bluemoonfirenze", "ReviewID": "UR79334669", "Content": "I got as far as trying to book a room at this hotel for a non-Italian speaking friend who was looking for a budget room in Rome. She had written an e-mail to them, per their request, to book a room with them and they had not answered, so we phoned. The clerk who answered was rude and could not have cared less about the booking. His behaviour on the phone was so unpleasant that I recommended that my friend look elsewhere for her hotel room. I would never spend money in a place that clearly cares so little for its patrons.", "Date": "September 13, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "3"}, "AuthorLocation": "Milwaukee, Wisconsin", "Title": "“Great room”", "Author": "travellady808", "ReviewID": "UR76378917", "Content": "We stayed for three nights. The rooms were spacious and clean. The bathroom had great water pressure. The hotel offers a breakfast near the desk on an outside terrace. We would recommend this hotel for the price, location, cleanliness. Most of the staff was very friendly.", "Date": "August 22, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Jackson, Wyoming", "Title": "“so close to the station”", "Author": "spencer888", "ReviewID": "UR74032852", "Content": "this hotel is really a few minutes away from Stazione Termini ; staff very helpful and breafast in the morning very rich. Very close also to the metro stop. A good place to stay in Roma", "Date": "August 6, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Denver, Colorado", "Title": "“Good location, reasonable price”", "Author": "DenverMike10", "ReviewID": "UR70342567", "Content": "Pretty good location, in the middle of almost everything. Only took the subway to the Vatican, and we walked back. Close in walking to most other sites. No really good restaurants near by, but the city is walkable from this location. Close to the train station so that was nice. Very comfortable and a good breakfast in the morning. The room made it feel like a 3 star hotel, big, spacious, clean, and very comfortable. Overall a solid value in an expensive city.", "Date": "July 9, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "2", "Overall": "2.0", "Value": "2", "Sleep Quality": "2", "Rooms": "1", "Location": "3"}, "AuthorLocation": "michigan", "Title": "“Small rooms, poor showers, worn furnishings”", "Author": "michigantraveler05", "ReviewID": "UR70315606", "Content": "We traveled with a family of five (three children) and found this to be barely adequate. We don't expect plush surroundings when we travel. Clean and comfortable would be great. This hotel wasn't quite there. We had a family room with one queen, one single and an adjoining room with bunk beds. The bed quality was ok but the room was never cool. The furnishings needed a serious updating and more lighting. Quite unlike the public areas where were bright and airy, the rooms were dark and sweltering. OK - it was Rome in July but the air conditioning just didn't keep up. And the shower in the adjoining family room leaked horribly into the hallway. It was unusable. Plus, there was black mold on the ceiling in the other bath room. Also, the breakfast breads were apparently kept in a closet with cleaning supplies like mops and buckets. Advertises internet service but it never worked for us and the one public computer seemed broken. Staff was friendly and helpful. Location was ok (10 min walk to the metro) but I think you could do better.", "Date": "July 9, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "3", "Sleep Quality": "5", "Location": "5"}, "AuthorLocation": "Auckland Central, New Zealand", "Title": "“Great but watch price”", "Author": "TravellingHolly", "ReviewID": "UR65851097", "Content": "Hotel was easy to find, in a nice street, very quiet, quaint. Room was very clean, shower small with hardly any water pressure. Staff friendly and helpful but make sure you know the Italian names of the attractions you want. We wanted to find the ruins of the old city wall surrounding Rome, but they could understand what we wanted. Fortunately walking the city we found them any way. Biggest dissappointment was checking out and finding out the rate we had booked 110 euro per night was a \"cash\" rate and when we paid by visa it went up to 125 euro per night!", "Date": "May 30, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "2", "Location": "4"}, "AuthorLocation": "pittsburgh, pa", "Title": "“convenient and good deal for the price”", "Author": "hes_10", "ReviewID": "UR65299378", "Content": "very convenient to everything in rome. breakfast was very nice and adequate. staff was very helpful and friendly, with one exception. room was a little small and not very soundproof, but very clean and adequate for price by european standards. bed and bath were nice. need a newer and larger elevator.", "Date": "May 25, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Boston, Massachusetts", "Title": "“good location”", "Author": "lex021", "ReviewID": "UR62939042", "Content": "good location, very very close to the main railway staion,this small but nice hotel is very confortable. Staff very nice. we will come back", "Date": "May 1, 2010"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Overall": "2.0", "Value": "2", "Sleep Quality": "3", "Rooms": "2", "Location": "5"}, "AuthorLocation": "Bluffton, SC", "Title": "“I recommend you think twice before staying here...”", "Author": "migosurf", "ReviewID": "UR62321754", "Content": "I am writing this negative review so i can help prevent someone from having an unpleasant time like we did at this hotel. First we stayed here because it was highly recommended in Rick Steve's book and had great location. In fact we walked with luggage to train station in 15 minutes. Let me describe what happened and you be the judge. At the hotel we took a tiny elevator to 4th floor where we checked in. We were taken down to the 1st floor, room 101 by a man who identified himself as a Palestinian and we are carrying luggage. The room stank like old mildew, it was awful smell. We tried to stay as we were exhausted from grueling 6 hour train trip and early morning rise. We then tried the bed, which was two double beds semi-connected that kept separating, making it impossible to sleep. After 2 hours we gave up and asked for another room. The same guy said no other rooms were available except a new remodeled superior room with up charge, because since we tried to sleep in the bed he wanted payment or up charge. By now I was starting to get angry as we had stayed in several hotels in Italy, all with good results. His boss told him to give us the so called upgrade room, room I think 306. The room thankfully smelled better and was slightly bigger and nicer. Now remember we are lugging our bags up and down many stairs and elevator through all this nonsense and bone tired At bedtime we tried to turn heater on as we were very cold. Heater finally came on next day after visit by the “guy” and his boss. Then oh goody, the shower would not make hot water and took forever for that to be corrected. Then the same shower flooded over into the unit and out into the hall way. This went on for 2 nights before they fixed all this misery. The Palestinian guy became cold towards us, unresponsive and would not look at us when we turned room key when we would leave to go out, like we were the problem. In closing there are many places to stay in Rome and I advise you to do your home work as this place is not anywhere I will ever stay when we return. I hope this helps. By the way, I warned the guy who checked us in that I planned on writing this review, to which he responded by email that he had done everything he could to make us happy, which trust me he did not.", "Date": "April 24, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "4", "Sleep Quality": "2", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Albuquerque, New Mexico", "Title": "“Fantastic Location”", "Author": "tigerpaws", "ReviewID": "UR59011842", "Content": "Stayed here in early February for a quick trip to Rome. Charming hotel on the 4th floor near shops, restaurants and transportation. Good value for the money and they served a continental breakfast with cereal and pastry. Easy short walk to station to get the hop on hop off bus which we used for our main transportation. Free internet in lobby and very pleasant staff. Rooms could use a makeover. My room was switched the first night due to faulty closing drapes and the room they gave me was much better.I would stay here again for the location but I would make sure I got a decent room.", "Date": "March 19, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "4", "Sleep Quality": "2", "Rooms": "3", "Location": "5"}, "AuthorLocation": "California", "Title": "“Great location but you get what you pay for.”", "Author": "imhere47", "ReviewID": "UR55183356", "Content": "We chose this hotel based on a guide book and expected a lot more. The location is close to public transportation but if you have a room at the back of the hotel on the Via Settembre side it is VERY noisy due to traffic. Our room was small, the shower door only opened 12\", the A/C didn't work and breakfast was free for a reason - very poor selection and the same every day. The ancient elevator worked about 75% of the time and we didn't find out until we were leaving that there is a second, much nicer elevator. One floor down is the Hotel Oceania, about 30 euros more but worth it for all of the comforts they provide. It has a nice, inviting reception area, large, beautiful rooms with working A/C, nice sized bathrooms and most of all QUIET.", "Date": "February 4, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "2", "Overall": "2.0", "Value": "4", "Location": "4", "Rooms": "3"}, "AuthorLocation": "New York City, New York", "Title": "“Good Location and Price, Poor Service”", "Author": "mlwtravel", "ReviewID": "UR54919415", "Content": "Overall a good experience. We had a decent sized group and were not treated very well by the staff.", "Date": "February 1, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Location": "4", "Rooms": "4"}, "AuthorLocation": "Nashville, TN", "Title": "“Good value, nice hotel...”", "Author": "LHSNash", "ReviewID": "UR53088356", "Content": "We stayed here on the first leg of our trip through Italy. For the price, we found this to be a very nice hotel. The staff were friendly and helpful, the breakfast was decent, and the room was actually rather spacious and had its own, clean bathroom. It was a little bit of a walk to all of the main attractions, but very close to the train station, which was nice for carrying baggage. I would stay here again.", "Date": "January 10, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "4", "Rooms": "4"}, "AuthorLocation": "Detroit, MI", "Title": "“Great value, friendly staff, very pleasant.”", "Author": "KSDetroit_MI", "ReviewID": "UR48038334", "Content": "Getting upgraded to the \"room superior' when we checked-in was a nice surprise. This hotel was clean, quaint and very pleasant. The friendliness of the staff made us feel welcome and comfortable. The breakfast was adequate to get your day started (no meat, no fruit), but very fresh pastries/croissants. The lift (elevator) was a little different for us, but it was no problem after the second time. We loved the little terrace area - great to sit down and have a glass of wine after a busy day of sight seeing. When we visit Roma again, we will definitely stay at this hotel and hope to greeted by our friends at the Hotel Nardizzi.", "Date": "October 29, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "3", "Location": "3", "Rooms": "5"}, "AuthorLocation": "Philly", "Title": "“Surprisingly nice with huge bathroom- request Room #1”", "Author": "HuskerRodge", "ReviewID": "UR47742619", "Content": "Stayed here based on Rick Steve's referral but was a little worried after several bad reviews posted on here recently. I was actually presently surprised, and the room we were given (room #1) we were told was just recently renovated. The room itself was very nice and overly spacious for Rome standards, and our bathroom was out of sight. Of the five non B&B's we stayed at during our 2-week vacation in Italy, this room had by far the best bathroom of all of them. It was spacious, all tile with an arched ceiling... and best of all, the shower was huge, all tile as well and had dual shower heads (one on each wall). That's right... DUAL SHOWER HEADS! Our bathroom alone was bigger than the room we had in Venice and it reminded me of a bathroom I've had at fancy hotel suites in Vegas. The hotel staff was very curteous and spoke great English. When they sent me my RSVP, their blurb said they were a 5 minute walk from the train station. I would say it's a 10 minute walk if you are in a hurry, but closer to 15 if you are just casually making the trip with a bag or two. Overall location puts you within 20-25 minute walk to probably all sights except the Vatican, which you can get to via subway from metro stop 2 blocks away. If I was going back to Rome soon and wanted to stay near the train station, I would stay here again. One downside - the elevator/lift from ground floor to 4th floor was built to hold 2 people and a bag or two max. Maybe this is standard for old buildings in Rome, but I was surprised at how small it was...", "Date": "October 25, 2009"}, {"Ratings": {"Service": "2", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Location": "2", "Rooms": "1"}, "AuthorLocation": "Madison, WI", "Title": "“Awful -- Stay Elsewhere”", "Author": "Kim_in_Madison", "ReviewID": "UR47354074", "Content": "My wife and I stayed here for two nights on a three-week trip through Italy and it was by far the worst place we stayed in. The bathroom, specifically the shower, was disgusting. There was an old, torn white plastic shower curtain covered in mold. I was honestly afraid to take a shower the second day, and actually would have felt cleaner had I not showered during my stay here. The floor we were on was so noisy (it was a couple floors below the lobby and therefore people had to buzz themselves in through a hallway door), and I could hear literally everything in the neighboring rooms. It felt like we were sharing our room with everyone on our floor. This was also the most expensive place we stayed during our 3-week trips, and we had some lovely hotels in other cities. So what I am basically saying is, you can do much, much, much better than this hotel. Don't stay here.", "Date": "October 20, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "3.0", "Value": "3", "Location": "5", "Rooms": "3"}, "AuthorLocation": "vancouver, BC", "Title": "“reasonable hotel for the money in Rome”", "Author": "byaffe", "ReviewID": "UR46036449", "Content": "hotel is the fourth floor of an old lovely building. Lobby area and rooms are quite spartan. But reasonable value for Rome. I chose it because of Rick Steeves; expected more frankly. Breakfasts were quite good. But not even a box of kleenex in the room, let alone a clock or a lamp. Wine service afternoons/evenings for 3 euros/ glass was great.", "Date": "October 6, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "scotland", "Title": "“highly recommended!”", "Author": "catiaScotland", "ReviewID": "UR38616077", "Content": "I have to disagree with the first few reviews. We had an amazing time in Nardizzi Americana Hotel and we would definately goo back if we are ever in Rome again and would highly recommend it to anybody. I have to admit my initial reaction when i walk through the main door and the lift wasn't the best...it looked old and dated. My opinion quickly changed when we were greeted by lovely reception staff who were very kind, helpful, friendly and spoken very good english. Our room was very nice... it looked as if it had been renovated recently. Good air con and room very clean and comfortable. There wasn't much choice for breakfast but it was more than enough for us. Staff was very helpful and went out of their way to answer your questions. We wanted to visit the Jubilee church which I don't think it's that a touristic place and its quite far out, we asked them how to get there and after them making some phone calls they were able to give us the exact bus/ metro directions/ stops to get us there. They also recommended nice local restaurants. But for me the best think of all was the location. You can pretty much walk to all the touristic attractions and for those that don't like to walk there is a metro station just 2 mins from the hotel that is very easy to use . I would advise you to get a Roma pass- it cost 23 euro but that allows you to use buses and metros for 3 days, as many times as you like and you get your first 2 sightseeing places for free. Highly recommend specially if you don't like to walk. Termini station is a bit of a distance but getting the metro is only one stop away. Was very impressed with it, specially after the time we had in a horrible hotel in Florence that claimed to be a 3 star", "Date": "August 24, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "2.0", "Value": "1", "Location": "5", "Rooms": "1"}, "AuthorLocation": "Virginia", "Title": "“Don't Stay Here!”", "Author": "beachbunnyVirginia", "ReviewID": "UR38441021", "Content": "We stayed here one night based on Rick Steves recommendation in his Rome 2009 guidebook. \"33 pleasant, air conditioned rooms and a delightful rooftop terrace is an excellent value.\" I need to disagree with all of those claims. It was a very unpleasant end to a fabulous 2 1/2 stay trip in Europe. We took the train from Venice to stay overnight in Rome to catch a flight to the U.S the following morning. We stayed here because of its proximity to the Termini. First of all, it was more than the 10 minute walk claimed by Rick Steves. It was very disappointing. The rooms are strange to say the least. We had a queen bed and two twin beds. The room was ugly. The bathroom was clean, but that's about all I can say. Actually that's the only good thing I can say, is that the place was clean. The A/C was a joke. There was some air blowing around, but it was not cool AT ALL. We slept on top of the sheets. The head of the bed was lower than the foot. The TV worked sporadically, not too big a deal since we don't understand Italian, but still it should have worked. The rooftop terrace is not \"delightful\". It's just an open area with some tables. No view. The hotel is on the fourth floor of the building. They advertise a \"lift\". It's probably 100 years old and miniscule. We only had 3 pieces of luggage and once the two of us and our luggage got in we had to twist ourselves into pretzels to get the door closed (and we are small people). And it was stifling. The common areas are not air conditioned at all and it was very hot that day. We asked for water. They said they would get us some, not bothering to tell us that there was a machine in the hotel that dispensed cold water. They never specified there was a charge for the two small bottles they brought us, but there it was on the bill the next day 2 euros each. There seemed to be a lot of young (18 to 25 year olds) there. I guess it's ok for them, but still there are nicer places that are a better value out there. There is a hotel on the third floor that you have to pass on your way to the Nardizzi Americana called the Oceania also recommended by Rick Steves. We passed by and drooled. Beautiful carpets, beautiful doors to the rooms, elegant, and it looked like it was cool inside. Probably the air conditioning worked. It only cost a little more. I would take a chance there if I needed a place to stay in that area again. But it's not that close to the train station and there's really nothing much around. At the beginning of our trip we spent 3 days in Rome and stayed at the Teatropace 33 very near the Piazza Navona. It was absolutely fabulous and only cost a few dollars more than this joke of a hotel, the Nardizzi Americana. We should have gone back there. We had planned to walk back to the train station the next morning to get the airport shuttle, but it was too far so we just took a taxi which we could have done from the lovely little Teatropace 33. The Nardizza Americana also didn't give us the complete discount we had agreed to on the phone, but it wasn't worth arguing about 10 euros. We just wanted to get out and leave that bad memory behind us.", "Date": "August 22, 2009"}, {"Ratings": {"Service": "1", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Location": "3", "Rooms": "3"}, "AuthorLocation": "Paris", "Title": "“Perfect the 1st night, Nightmare the 2nd night because of surbook”", "Author": "Kenavoparis", "ReviewID": "UR37898731", "Content": "We booked this hotel on their website because of the good critics we read. When we arrived they told us that they have a computer problem and so we can only stay one night in this hotel. The 1st night was great : big room (room #1), big shower, mid quiet and nice breakfast on their terrace under sun. We noticed the rooms are not equal as we saw another room much smaller... The 2nd night they moved us on another hotel of the same group : Hotel Santa Prassede. The room are dark, very small, the shower is dirty and the double bed very small. It was a shame to be moved in this hotel. We were not happy and they moved us in another room of the same hotel but bigger but very noisy as it was near the avenue. So be careful of surbooking and do not accept to be moved in another hotel.", "Date": "August 17, 2009"}, {"Ratings": {"Service": "2", "Cleanliness": "2", "Overall": "3.0", "Value": "3", "Location": "4", "Rooms": "3"}, "AuthorLocation": "Baltimore", "Title": "“You can do better in Rome!!”", "Author": "kermie53", "ReviewID": "UR34218784", "Content": "We found this hotel through the Rick Steves' guidebook but, like others have said, we're pretty sure Rick must have a share in this hotel because it really shouldn't be recommended! Out of all the places we stayed in Italy (Venice and Florence), this was our least favorite and the cost was similar to other places in the country. The pros of this hotel, in our opinion, were the location and the room size. The location was easy to get to from the Termini train station but also an easy walk to Trevi Fountain, Spanish Steps, and Colosseum. The only time we took public transportation was to Vatican City. The room was also big by European standards, with high ceilings and plenty of room to walk around the bed. The a/c also worked well in our room, although I heard several other guests at the front desk saying theirs wasn't working. The cons were pretty much everything else, specifically the staff, breakfast, and room smell. Our room was on the \"third\" level of the building - basically when we came in, we went up to the 4th floor to get our key, and then had to walk down 2 more flights of stairs to get to our room. I'm not sure how the rooms on the other levels were, but our room had a constant sewage/sulfur smell that I'm guessing is from the water in the bathroom. It was pretty pervasive and not pleasant. The room also had construction going on RIGHT outside the window, so it was impossible to leave the window open during the daytime without hearing a jackhammer. The breakfast was not the best, especially compared to other places we'd stayed. Only pastries/doughnuts and cereal. The coffee and \"juice\" were from a machine, which was disappointing considering we were in Italy. The staff overall were not particularly helpful and sometimes rude. For example, my fiance asked the staff person at the front desk if he could make a dinner reservation for us. Instead of calling the restaurant himself, he simply dialed the number and wordlessly handed the phone to my fiance. That is not service!! We were also very disappointed with how our check-out was handled. If you have a quoted rate from them, be prepared to show ALL paperwork saying that this is your rate! We had received a quote from them and had the email, but also wanted to pay in cash, which, according to the Rick Steves' book, would warrant another 10% off. The staff person told us that the cash discount only applied to the rate in Rick's book...something that is never stated anywhere. He grudgingly gave us the 15% off because we stayed 5+ nights but demanded to see where it said it in the book repeatedly. We were running to catch a train and couldn't haggle forever so we took that. Overall, you can definitely do better when in Rome. I wouldn't stay here again. Hope this helps!", "Date": "July 8, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Vancouver", "Title": "“Kind staff. You little oasis in Rome!”", "Author": "yvrnyc", "ReviewID": "UR32307557", "Content": "Great location, unbelievably kind staff, renovated rooms, free internet! I planned to stay at Hotel Nardizzi for one night and then get out of Rome. Unfortunately, I was pickpocketed at Termini (don't feel dumb for using a money belt at Termini-I'm a very experienced traveller and I got duped) on my way to Siena. I went back to the hotel, knowing that their kind staff would allow me to use the internet and cancel my cards, etc. They were amazing! So sympathetic and kind. They allowed me to stay there that night, even though they knew at the time I had no money. They checked up on me, did what they could to help me with cancelling my Siena reservation, gave me a great rate on the room that I ended up needing for the week while waiting for replacement credit cards, and so much more. I just can't say enough about how kind the staff is at this hotel. The first night I was in the older portion of the hotel. It was clean and nice, but a little on the noisy side with a busy street not far away. In the newly renovated side, the rooms are lovely. The air conditioners rumble a little, but they drown out whatever courtyard noise there is. I'm a light sleeper and had no trouble sleeping with air con on and my earplugs. Breakfast is not gourmet, but is certainly enough to get your day started. The stairs are numerous, but that's what justified the gelato in my mind... There is an elevator, but it's old and tiny. However, before you drag your suitcase up 6 flights of beautiful marble stairs, walk straight down the hallway from the main doors and look on your left halfway down. It's not obvious where the lift is when you arrive, but it's there! Rome can wear you down-you do have to be on your guard and deal with the grit and heat and traffic. It's nice to come back to a hotel with staff who care and have your own little oasis. Everything is easily accessible from Nardizzi and Via Firenze is a nice, calm find in the middle of busy Rome!", "Date": "June 14, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Location": "4", "Rooms": "3"}, "AuthorLocation": "New York, NY", "Title": "“Excellent value”", "Author": "j2dtravels", "ReviewID": "UR31763836", "Content": "Chose this hotel through Rick Steve's guidebook and Tripadvisor reviews. Met our budget and schedule. Reasonable walk from Termini Station. Arrived early morning and were able to drop off our luggage. Appreciated elevator! Staff helpful with directions and suggestions. Comfortable open-air public areas with free internet service. Enjoyed afternoon wine and morning breakfasts at the terrace tables. Triple room clean, well-lighted, with phone, and beds comfortable. We looked out onto street and walled garden across street. Location within two minutes' walk of Bernini's Ecstasy of St. Theresa at Santa Maria della Vittoria! We appreciated the location's proximity to all modes of public transportation and were able to travel quickly to all corners of Rome.", "Date": "June 7, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Location": "3", "Rooms": "4"}, "AuthorLocation": "Minneapolis, MN", "Title": "“Wonderful Little Hotel”", "Author": "BlindGuide", "ReviewID": "UR31010736", "Content": "A fantastic little hotel! I am a sighted guide for a blind gentleman, and the staff of the Nardizzi was so very helpful and courteous. We had one of the newer rooms, and with the exception of the view of the Italian Defense Ministry (we were asked not to take pictures!), most everything was spectacular. Extremely close to the Termini, as well as a quick walk to a nicer shopping/resturaunt/cafe area. An absolute must for budget conscious travelers to Roma. My only real issue was the internet connection, while free, was down quite a bit, which was mildly problematic, but certainly not a deal breaker.", "Date": "May 28, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Location": "4", "Rooms": "4"}, "AuthorLocation": "Seattle", "Title": "“Good value & Great service”", "Author": "FrugalMamaCojo", "ReviewID": "UR30748518", "Content": "Located on a quiet street in a safe area, this hotel is classic European accommodation but cannot be compared to U.S. hotels. It's a good value and clean. The staff is extremely courteous and helpful. There are exactly 143 steps to the hotel, from the sidewalk at street level, so it's quite a hike. But if you're unable to carry your luggage that far, there is a decrepit elevator which gets it (and you) there. (You're in Europe, so don't expect a Hilton... you're not paying that much!) It's great that they have free internet service - first come, first serve and their breakfast is totally adequate.", "Date": "May 25, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Terceira Island Azores", "Title": "“Great location, pleasant staff”", "Author": "debraj0305", "ReviewID": "UR29294792", "Content": "I stayed in this hotel with my mother & 18 month old daughter for 5 nights. Our room was pretty big and they included a crib at no extra charge. The bathroom was a bit of a squeeze, but we managed just fine. The staff accommodated our every need and recommended wonderful restaurants. They even had a map of the city for us, which was a lifesaver for me. Breakfast consisted of pastries, cereal, jams/jellies, coffee, cappuccino, hot chocolate, hot tea. They advertised wireless internet, but I was never able to access it on my laptop. They did have a computer in the lobby free of charge to check email and surf. The elevator/lift was very small and a bit slow, but we managed to fit 3 adults and a child in there somehow. I'd rather have a small elevator then have to climb up & down all those stairs (hotel was on the 4th floor). You could walk up to the rooftop for a wonderful view and it seemed to be a great place to sit & relax with a cup of coffee or glass of wine. The staff was great and always gave my daughter cookies whenever they saw her. Overall we had a great experience at this hotel and would definitely stay again.", "Date": "May 4, 2009"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "Denver", "Title": "“A+ would stay again!”", "Author": "morningbird303", "ReviewID": "UR24775110", "Content": "I was very skeptical when booking this hotel in Rome. Believe me, I worried about everything from location, language (we do not know a lick of Italian!), staff, breakfast, safety, leaving our room key with the front desk., buzzing in after hours.... but my boyfriend, 32 and I, 27 were truly delighted with this hotel & it’s staff. In summary Hotel Nardizzi was a gem & we couldn’t have asked for more perfect/safe location, clean comfortable amenities, helpful/friendly staff at such a reasonable price. If you are looking for a US style hotel, this is not it. If you have a US breakfast expectation/appetite…..this is not it. And I warn you: If you are over 240lbs, 6’, you most likely will NOT fit in the shower …..however if you want a quaint Roman experience this place is a winner. For those of you that want more details & travel tips please read on: We booked last minute, about 10 days prior to arrival. We were able to get the best rate by booking 6 nights directly through the hotel's website [--] (~$95USD/72euro per night in Nov 08). I called the hotel the day prior to our check-in and the hotel cheerfully confirmed our reservation in fluent English...which was very comforting. I explained we'd be arriving in the AM & asked them if we could store our luggage safely until the 1pm check in time, they agreed without hesitation. We arrived at the airport early Saturday morning, around 8am. From the airport we took the Leonardo Express train to the Termini Station ($9.50USD each, at the airport train station there are ticket kiosks that accept credit cards & an ATM for easy access to Euros) we arrived at the Termini in about 35mins without any issues or concerns. (we were told to be aware of pick-pocketers in Rome, so be mindful/aware of that during your stay, although we did not experience any issues at all during our stay) We walked the 5 or so blocks from the Termini Station to the Hotel Nardizzi. Follow the directions from the Termini posted on the hotel's website as they are perfectly clear and accurate. The walk from Termini to Hotel Nardizzi took us about 20 mins, taking our time. As with most of Europe, keep in mind a lot of the are cobblestone and you will have to navigate your way through the crowds, if you choose this route make sure your luggage is manageable. It would be much longer walk if you happened to break a wheel on a 50+lb suitcase…you know what I mean! When we arrived at the hotel's building I was relieved. (the hotel/hostels that are located really close to the termini are look pretty bad) Hotel Nardizzi’s building was in great location on a quiet, safe street . Everything that first-time tourists want to see is within a 20 minute walk of this hotel. (more on that later) The building has a large door that is locked at night, there is a buzzer if you need to be let in after it is locked. Which upon booking I thought would be an issue (we are not used to that in the US) but the front desk is staffed 24hrs and the desk clerk was always happy/helpful no matter what time we buzzed. The ground level of the building has an Opera, 2nd floor appeared to be residences, 3rd floor Hotel Oceana (also appeared equally nice, but more expensive than Hotel Nardizzi) then you can take an awesome little Lift (or stairs) to the Hotel Nardizzi that is on the 4th floor. The lift is VERY small, I’d guess easily over 100 years old but we personally thought it was sooooo neat. Again, it wouldn’t be good if you have lots of luggage. We arrived at the Hotel Nardizzi about 9am and were cheerfully greeted by the front desk. We planned to just drop off our luggage at the hotel and head out adventuring in Rome until the 1pm check-in. But were delighted when the front desk clerk said they had a room for us to check into. The room we checked into was VERY small, with just enough room to walk around the double bed, a built in closet w/safe, 2 drawers and small bathroom containing a very small shower. Although small, the room and bathroom were spotless, bright & very comfortable. We threw our small luggage under the bed (really nowhere else to put them) , quickly freshened up and were enjoying Rome within an 90 mins of landing at the airport, very nice. When we returned to our room Saturday evening we could hear the singing from the Opera downstairs, it was really beautiful. The next morning we were pleasantly greeted by the Hotel Staff, and had a self-serve breakfast with a choice of cold cereal, croissants/rolls/toast (very good) and machine-dispensed coffee, coco, orange & mixed juice. The breakfast selection was so-so, mostly carbs (no protein-meat/ or eggs) but is definitely all a person needs until lunch time. The breakfast eating area is very pleasant, clean with lots of sunshine. There are also tables outside to eat and/or smoke. When leaving the hotel you must leave your room key with the front desk, which was a bit strange for us. But the keys have sensors on them & are fairly large. They would be a pain to carry around all day….and probably not cheap if you lost it & had to pay to replace it. So leaving it with the front desk is probably for the better anyway…plus there is a safe in the closet for valuables. Anyhow, when we prepared to leave, the front desk clerk offered to move us to a different room. Initially we declined as we were perfectly satisfied with our cozy little room and didn’t want to be an inconvenience…after all we had things to do! But the front desk clerk insisted that the new room would be bigger more comfortable for our extended stay (6 nights) and there would be no additional charge, so we agreed. We quickly packed our luggage so that the staff could move us to the new room once it was cleaned & ready. That evening when we returned to the hotel the front desk clerk gave us our new room key. We were delighted, the room was nearly double the size of our initial room with a table/2 chairs and was also very clean/comfortable with our luggage waiting. During am/pm rush-hours you could hear the volume of the traffic since the window faced the street however at night it was not at all bothersome. While in Rome, if your time is limited or you don’t want to walk everywhere (which you could do, if you wanted) to) . I suggest buying a bus/subway map for about 6 euros & purchasing a few tickets at one euro each. Tickets are good for a single way 75 min trip on the bus and/or subway. You can by tickets at shops/street vendors/restaurants, just ask chances are they have them. Any bus that says Termini or Barberini stations will get you back to the Hotel Nardizzi. You can hop on/off busses with the crowds of locals however always have a ticket in your wallet (unstamped) just incase you do get checked. I hear it’s a $50 euro fine, payable on the spot if you get caught on the bus without a ticket. In the whole 6 days we were never asked to show our ticket or see anyone else get asked to show their ticket. What I am saying here is don’t waste your money on expensive taxis or tourist passes if you don’t have to. Visit http://www.rome.info/metro/ for a subway map, its only two lines therefore not that hard to master: Subway/Metro A: From the Hotel Nardizzi board the subway at Barberini or Rupublica stations you can arrive at the Spanish Steps via the Spanga station, San Petro station to see the Castle, & the Cipro station to see the Vatican within 10-15 minutes. Important: You do not need to pay for a tour to get a good seat in the Papal Audience on Wednesdays. On Wednesday morning about 7am catch the subway or a bus from the Barberini station over to the Vatican, about 10 -15 min ride. There will be staff handing out FREE paper tickets to the people lining up. About 7:30am the staff opens the gates to St Peter’s square & you can get easily a seat in the first few rows, if you arrive early. However if you are like me & want to get tickets before hand, just submit a request online to the Santa Susanna church they will hold tickets for you in your name. You will need to pick them up at the Santa Susanna Church on Tuesday evening or early Wednesday morning (the Church is only 2 blocks from Hotel Nardizzi) & is very neat on the inside too. Just pick up the tickets from the table & leave a small donation for their efforts and your peace of mind. They speak fluent English if you have questions. The Cappuccin Crypt or “bone chapel” is beneath the Santa Maria Church (Our Lady of the Conception of the Capuchins) is only about 5 blocks from Hotel Nardizzi, near the Barberini station & Hard Rock Café. Very cool place, not very well known, and only requires a small donation for entry….it took us 4 days and asking about 50 people just to find it under our noses! Subway/Metro B: Coliseum: Board the subway/Metro B at Termini station, exit at the Colosseo station. (2 stops) It is worth paying for an English speaking tour to get into the Coliseums. We paid $10 each to bypass the 90minute wait, well worth it, even though the tour-guide & radios really wasn’t great. Catacombs/via Appia Antica: Board the subway at Termini station, exit at the Pyramid station. Walk across the street from the station & wait by the newsstand to get on bus 118. (about 20 minute bus ride from Pyramid station, outside the Roman city walls) the driver will tell you the best place to get off the bus, just ask. We went to the Christian catacombs, it was 10 euro per person that included a mandatory English speaking guide. Make sure you visit the restaurants in Campo de Fori. Very good local food. Yes…incase you were wondering we drank the tap water, ate all kinds of local food and didn’t get sick. But on our 6th day we ended up craving beef landed ourselves at the Hard Rock café (near Barberini station) for a good ol’ juicy American burger…haha. ;) Give yourself extra time to get back to the airport for your return trip. The Leonardo Express train departs every 35 minutes from the Termini station to the airport starting at 5:50am & takes 35 mins. Getting from the Train/ to the airline check in was a little tricky for us, just ask the staff..... it saves time/stress. Hopefully this helps the other first time visitors to Rome….(I sure wish a posting like this existed before I booked my trip!) ....Remember, just because you have money doesn’t mean you have to spend it on things you don’t have to, just to see the sights. Have a good time. Ciao!", "Date": "February 19, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "2", "Check in / front desk": "3", "Overall": "3.0", "Value": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Sussex, New jersey", "Title": "“When in Rome??”", "Author": "TheCards", "ReviewID": "UR23143587", "Content": "Stayed as part of a Rick Steves tour. Our room was down two hallways and at the end of the hall. Windows did not close tightly. Room was adequate as was the bathroom. Was large compared to some of our other rooms had enough space to get around in and for the luggage. As we were at end of hall probably made our room quieter than average. Bed was comfortable and we slept OK. Breakfast was the worse on the tour but hotel staff was helpful. Elevator was old and creaky, when tour arrived group transported luggage up in it and most everyone else walked the stairs. Location was good, upon arriving tour had to walk 2 blocks to hotel because of a demonstration in progress. Location of Hotel near Dept of Defense meant good security for the area.", "Date": "December 31, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Business service (e.g., internet access)": "4", "Check in / front desk": "4", "Overall": "3.0", "Value": "3", "Rooms": "2", "Location": "3"}, "AuthorLocation": "Melbourne, Australia", "Title": "“Lovely Hotel”", "Author": "adriana1188", "ReviewID": "UR22929332", "Content": "We stayed at Hotel Nardizzi Americana in June for 3 days. It was a little difficult for us to find, but we eventually got there. The hotel is a little old and run-down, however this didnt worry us much as it blends in with the rest of Rome. The rooms are cosy and small. We didn't mind so much as the only time spent in our rooms was when we were sleeping. The only problem was the hairdryer which was a nuisance to use. But we later found that these are the same in all hotels. The breakfast room is lovely, and the food was great. The staff were also very friendly and accomodating.", "Date": "December 22, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Business service (e.g., internet access)": "4", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Montana", "Title": "“I love Rome!”", "Author": "CmeGoAgain", "ReviewID": "UR21316787", "Content": "I love Rome! This is my second trip to Rome and my first time staying at the Nardizzi. Hopefully it won't be my last. Our room was clean and the beds were comfy. The breakfast every morning was good. However, the highlight and big selling point of the Nardizzi is the staff. The men that work here and took care of us were fabulous. They directed us to some phenomenal restaurants that were within walking distance and resonably priced. They were helpful with answering our questions about Rome and making sure we were comfortable. Thank you Nardizzi for making our time in Rome wonderful!", "Date": "October 27, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "3", "Overall": "3.0", "Value": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Northport, NY", "Title": "“OK place, good location”", "Author": "SoLucky2Travel", "ReviewID": "UR21015446", "Content": "Stayed here for the last 2 nights of our 17 day Rick Steves' tour and it was my least favorite place. The elevator was so slow and creaky that we usually walked all the way up to the fourth floor. Breakfasts here were the least enjoyable of all the hotels on our tour, though the open air breakfast area was pleasant. Free internet access in the lobby was a nice bonus. Our room was clean, comfortable, and quiet, though small as is so often the case in European cities. The location is very convenient to everything, including the train station, so it makes an ideal base of operations for a stay in Rome.", "Date": "October 19, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Business service (e.g., internet access)": "3", "Check in / front desk": "5", "Overall": "5.0", "Value": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "south wales", "Title": "“nardizzi a winner”", "Author": "hughesy_8", "ReviewID": "UR20981238", "Content": "the hotel is 5 mins from the trevi a must see,and 20 minute walk from the colosseum. if you go to the vatican use a tour guide well worth the money about 25euros each, or you will get lost in there.although the hotel is not the biggest on the planet it is clean and friendly, located on the 5th floor of a large block you can use the lift 2people at a time really old but full of charm just what you,d expect in rome. when you leave the hotel turn left its the best chinese restaurant in rome 20yards down the road a further 20 will take you to the cafe bar on the corner open all night where you can sit in romes main street and people watch,a great sport.on the whole use the hotel as a base if you want luxury go elsewhere if you want good cheap clean and peacefull stay there i would recommend it and plan to go back as soon as possible. ciao", "Date": "October 18, 2008"}, {"Ratings": {"Service": "2", "Cleanliness": "1", "Business service (e.g., internet access)": "2", "Check in / front desk": "2", "Overall": "1.0", "Value": "1", "Rooms": "1", "Location": "2"}, "AuthorLocation": "Bennington, Nebraska", "Title": "“How did this make it into Rick Steves' book?”", "Author": "PlainsWoman", "ReviewID": "UR20870694", "Content": "We stayed here 3 nights, 2 of which were with a tour and the last on our own, figuring that it would be easiest to stay in one place and not have to pack, move luggage and thus get extra time to see the sights. So, we ended up paying 102 euros cash for our last night. By big city European standards, this was a \"big\" room. It had A/C, which kinda-sorta worked. (More on that later.) It had a double bed, which you could walk all the way around, without having to turn sideways. The tv was on the wall. There was a ledge running the length of the wall opposite the bed, underwhich you could put your luggage. The ledge dropped down to desk height for about 4 feet, and there was a chair, creating a working surface. There were two corner niches by the beds, acting as night stands. No alarm clocks or phones in the rooms, but some kind of radio, with a very bright LCD light. The double bed was two twins with one sheet over them, and sagged horribly in the middle of each. The pillows were flat and hard. The sheets were coarse. One small twin blanket stretched across the width of the bed. The underside of the bedspread was stained, so I pushed that off of the bed promptly. The floors were tiled and patterned to look like wood and hadn't been swept or mopped in a while. Everything put down on the floors promptly became dirty. We could not walk barefoot in the room, even after a shower. The shower had a raised pattern of bumps on the floor for drainage that made it painful to stand in. The sink had two mirrors, as it was set in the corner of the bathroom. It had no stopper. The stopper seemed to be lying in the bidet, which didn't appear to be working. The toilet ran, and had been running for some time, based on the stains in it. No amenities other than two tiny bars of soap. No Kleenex. Housekeeping seemed to consist of emptying the trash and refolding the towels and making the bed. No washcloths, of course (this is Europe), but the face cloths were dish towels! To turn on the electricity in the room, you had to put your room key in a slot by the door. No key, no electricity - no A/C while you were gone. So, the maid would throw open the windows and let in all the bugs and humidity, so by the end of the 3rd day, those coarse sheets were unbearable to sleep in. The walls were paper thin. Someone sneezed in the next room; I said \"bless you\" and that person said \"thank you\". The hallways are tiled with a mosaic pattern down the middle, so any rolling suitcase makes a loud racket - so latecomers wake anyone sleeping. Doors open and close noisily. There is a door to the breakfast area and lobby that can be closed - we closed it to cut down on the noise since we were so close - and people kept propping it open. We probably got 4 hours' sleep our first night there. Breakfast was not good caffeine, lousy juice, spoiled milk on the 2nd day, cereal and pastries. We bought breakfast outside the hotel it was so bad. The breakfast area itself is pleasant - it opens to a courtyard below, that is, of course, undergoing construction. The hotel is on the 5th floor - tiny elevator should be used to send up the bags. We counted 144 steps from the street. There is Internet access in the lobby, but all the 20 year olds were hogging it for their life-and-death Facebook updates. I had to get up at 5 a.m. to check in for our flight back home. Staff is great when the tour guide is around. Once the tour guide left - well, suddenly their English isn't so great and they have \"deals\" for you. For example, the law in Rome is that it is a flat 40 euro rate for the taxi to the Fiumicino Airport. Front desk guy said no, I was wrong, there were surcharges for luggage, and that he had arranged a minivan for me - only 50 euros. I said no, 40 euros and that I would use the other 10 euros for breakfast. (There are no surcharges for luggage.) One of our tour group people couldn't afford to stay another night at the Nardizzi - they sent her off to a hostel that required a 2 night stay - but she didn't find that out until she got to the hostel! But the Nardizzi had successfully gotten rid of her. Last example - one of the staff was answering a question on how long it would take to walk from the hotel to Vatican City. \"15 minutes.\" Heck no, it takes 15 min. to get to the Trevi Fountain or to Santa Maria Maggiore or to Termini Train Station! It's a good 1 hour walk and that's only if the Italians in front of you are walking, not strolling. They have wine for sale to drink in the hotel, but there's a neighborhood bar/minimart just down the street with tables outside that has better quality wine for much cheaper. And no view of construction! None, and I repeat none, of the other members of our tour had a good experience in this hotel. One person wanted to get a set of wrenches to dismantle the bed frame to put the mattresses on the floor to sleep. The hairdryer died on another. We all ran out of hot water about 3 minutes into our showers. (So we learned to shower fast.) Others couldn't get the A/C to stay on. (It's on a timer - you just have to push the power button 3 times to keep it on.) Another person turned on the hairdryer and the electricity for her room and all the rooms around her cut out. All noted the bad housekeeping and poor quality of sheets and towels. All noted the terrible noise. This was a 2 star hotel. Hate to see a 1 star! And to think that Rick Steves recommends this and actually sends his tours here.", "Date": "October 14, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Business service (e.g., internet access)": "4", "Check in / front desk": "5", "Overall": "4.0", "Value": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Toronto", "Title": "“Great location and price!”", "Author": "Peys", "ReviewID": "UR19577110", "Content": "After reading reviews on the Nardizzi, we booked our room for 6 nights through the Nardizzi website. There are tons of deals that can be found on their website especially in the low season! We got our room (with a double bed and a twin bed as well) for 60 euros a night. The hotel was great. It was a great location, closeby to the train station and all the sites, and breakfast was included. It was a simple breakfast of bread and butter, pastries, coffee and juice. The dining area was lovely, and there were a PC with free internet and there was free wireless as well (in the lounge and reception areas, not the bedrooms) The only English language channels were BBC and MTV, which is better than nothing. Overall a great staff and a great experience!!", "Date": "August 31, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Business service (e.g., internet access)": "4", "Check in / front desk": "4", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Ontario", "Title": "“A little bit of Italy”", "Author": "4away94", "ReviewID": "UR19518343", "Content": "We really liked this hotel. It was close to the train station but on a quiet street so that we were no disturbed by street noise. Quaint elevator. Indoor open courtyard on the 4th floor for breakfast. Air conditioned. I would recommend this hotel.", "Date": "August 29, 2008"}, {"Ratings": {"Service": "1", "Cleanliness": "3", "Business service (e.g., internet access)": "1", "Check in / front desk": "1", "Overall": "1.0", "Value": "1", "Rooms": "1", "Location": "2"}, "AuthorLocation": "Seattle, WA", "Title": "“Horrible Staff, Horrible Experience”", "Author": "NateK", "ReviewID": "UR19047505", "Content": "My wife and I recently returned from a 3.5 month trip around the world and our worst lodging of the trip, out of 20+ hotels, was the Hotel Nardizzi. We stayed here because of Rick Steves' recommendation and that was our first mistake. Prominently displayed on the hotel's front desk is the 2006 and 2007 Christmas cards from Rick Steves' family. The hotel is clearly living off of his recommendation and care little for their customers. Our room lacked a safe, working shower, telephone, working t.v. and was located in the adjacent building outside the hotel. When we told the hotel staff that the basic amenities from our room were missing or not working they immediately launched into why it wasn't their fault. They took us to two dirty rooms, which guests were still using, and showed us one with a wall safe and the other with a working phone. We really didn't care at that point and just wanted them to know that our room was not ready to service customers and should be fixed. The free continental breakfast was also the worst of our trip. They put water in the milk to dilute it because we think they ran out midway through the morning. By 8:30 a.m. all of the pastries and fruit juice were gone. We brought this up to the staff and they immediately blamed it on a group of backpackers who were staying at the hotel. Again, we didn't care who was at fault, we just wanted the problem fixed. If anyone stays at the Hotel Nardizzi after reading our trip advisor review... you have been warned.", "Date": "August 17, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Check in / front desk": "3", "Overall": "4.0", "Value": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Jackson, Mississippi", "Title": "“Good Value, Italian Style”", "Author": "Engrpas", "ReviewID": "UR17585682", "Content": "We traveled with out two adult sons and rented two rooms for 3 nights, on the recommendation of Rick Steves' book. This was our first night in Italy and I have forgotten just how small tourist hotel rooms in Europe are. I travel extensively on business and stay in more American style hotels, but at twice the cost. However, by Italian standards, this was not bad - the rooms are tight but adequately equipped, the breakfast is good and served in pleasant surroundings. The staff was helpful and the bill was to the penny what was quoted and they did not squawk when I paid with American Express. (Some hotels will accept your reservation with Amex, but want payment with Visa or MC - or cash). I don't think you can find much better value in Rome, particularly within walking distance of the Termini station.", "Date": "July 6, 2008"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Business service (e.g., internet access)": "4", "Check in / front desk": "3", "Overall": "2.0", "Value": "2", "Rooms": "2", "Location": "3"}, "AuthorLocation": "Arlington, Virginia", "Title": "“Family rooms are a mixed bag”", "Author": "cynthcore", "ReviewID": "UR17231161", "Content": "We were a group of five people traveling together - 2 moms with our 3 young kids. We reserved a family room, which we were told was actually two regular rooms that were connected. Instead, when we checked in, we found a triple room and bath and a very small room, big enough for only a small bunkbed, with another bathroom. After a lot of protesting on our part, the manager put us in another family room that was like a suite - a triple room with a sitting room that converted into two very narrow twin beds, not really suitable for adults. We should have booked separate rooms, but were hoping to have a suite or room to accommodate our group to make traveling with the kids a little easier. The rate for the family room was only slightly lower than if we had booked separate rooms. Breakfast pastries were fine - no fruit or meat or cheese. Coffee and juice were from machines. The juice was not really juice, and the coffee was disappointing, considering we were in Rome. I did not like the location because only a few sites are in close proximity - Quirinale, Santa Maria Maggiore, and Trevi. Visiting other Centro Storico sites requires buses or lots of walking. Several guests were protesting charges during our stay. Staff referred us to restaurants nearby that were very sub-par. I would stay elsewhere next time.", "Date": "June 25, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Check in / front desk": "5", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Sherwood Park, Alberta", "Title": "“Good, small hotel with grrrreat staff”", "Author": "MAG_87", "ReviewID": "UR16293640", "Content": "We stayed at this hotel for a week before we went on a 2 week Mediterranean cruise, then stayed at another close to the airport for 5 days after the cuise.This hotel was in a great location, close to the Trevy Fountain, pretty close to everywhere. The staff were helpful, they gave us a map and showed us where everything was (they gave us directions to the \"Roma Store\" so we could buy soccer tickets) They have a computer in the lobby, it was very cheap too. The hotel was on the third floor, with a small lift, but they had stairs too, we jsut took the stairs, they were faster, and less scary!!!It was good value, my only complaint was that our bathroom had a weird smell, sort of like vegetable stew, mixed with orange... But it was a very nice room other than that. A must-do while your there is go to a Roma game, it is an experience! You won's know until you go!! The continental breakfast was delicious, the blood orange juice was delicious, and the croissants, hot chocolate, cappicinos, and coffees we great too. IT is good before a big day of touring!", "Date": "May 21, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Business service (e.g., internet access)": "4", "Check in / front desk": "5", "Overall": "3.0", "Value": "3", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Pawleys Island, South Carolina", "Title": "“Small but relatively close to everything.”", "Author": "JPSaleebyMD", "ReviewID": "UR15327589", "Content": "Found the hotel on the net. Travel agent suggested a hotel of similar caliber but for much more $$$. We decided based on the web site and online comments to try out luck. The hotel is located on the 4th floor of a building. I believe there is another hotel on the 3rd and a church on the ground floor. While we were there they were singing Opera in the church practicing for a performance (such a nice touch). The staff was excellent (Razi (sp) and Sammy were so kind and helpful). The breakfasts were pretty good and gave us a jump start on the day. Beds were a bit too firm (mattress was somewhat thin). But all in all a good experience. They do have internet access which is free. A big plus for us. The elevator is quite small (really a 2 person unit).... so if you have lots of luggage you will need to make a couple of trips.", "Date": "April 24, 2008"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Business service (e.g., internet access)": "2", "Check in / front desk": "1", "Overall": "1.0", "Value": "1", "Rooms": "2", "Location": "1"}, "AuthorLocation": "Tennessee", "Title": "“Okay if you can find absolutely nothing else!”", "Author": "travelingchick42", "ReviewID": "UR14913673", "Content": "Well Rick Steves must be a co-owner of this property to recommend it! First the entrance was not street front, but three floors up at the end of the hall. The \"lift\" was a death trap with a sagging floor and the stairs left you out of breath. You have to ring a bell at the entrace to open the door, proceed up three complete flights of steps (what we Americans would consider 6 flights since they were split flights) just to get to the registration area. Our room was kin to a women's prison dorm room with a faulty shower and shower door to boot. The door would not completely close, so you soaked the bathroom floor, which would not have been a problem if you had plenty of towels. Fresh towels were not an option although the bed linens were clean. The hairdryer would randomly fall off the hook during the night and caused quite a start. I did not sleep at all and kept \"guard\" while my fellow travelers rested. It was such a bad experience that we took a train the next night and forfeited our room that had been pre-paid. Would not recommend this \"hotel\".", "Date": "April 9, 2008"}, {"Ratings": {"Cleanliness": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "poole,Dorset", "Title": "“Charming Italian hideaway”", "Author": "HiggleDiggle", "ReviewID": "UR14091191", "Content": "Had read some bad comments re the Staff. Couldn't disagree more! All the Staff bent over backwards to help us, giving us individual, marked up maps, booking a super restaurant when we arrived late(Thanks Sami!) Helping us to understand the Roma pass and find the Tourist info,bringing us wine and serving it so courteously etc etc.Loved being in such an atmospheric little hotel as opposed to an international chain. The girls' room was beautiful with fab views to watch the ceremonial changing of the guard in the morning at 7am. Also a brill locatio as others have said. Safe area 3 mins from the underground and walking distance fron the Colosseum, Trevi fountain etc. Overall a very successful stay!!", "Date": "March 6, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "2", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Budapest", "Title": "“Nice place, nice people!”", "Author": "kemet", "ReviewID": "UR12878672", "Content": "I had a wonderful vacation in Rome, and an excellent accomodation in Hotel Nardizzi. The has a very good location, just few steps from quirinale or barberini, close to the piazza republica metro station, and also close to the bus station, and of course to Termini. So the location is excellent. The hotel is in a huge building which was build by the american methodist church. The entrance is at the 5th floor, where you have to go with a small, but comfortable elevator. The staff of the hotel was wxtremly helpful and nice. We arrived at 9 in the morning, so our rooms werent ready yet, but they took our luggage in the room, and when we asked where can we have the breakfast they offered us, free of charge, to have the breakfast over there. Thanks a lot Mario! We were 3 adult persons, so i was afraid, that the room will be to small for us, but i had a nice surprise to see, that we got a huge apartment, with to separate room, and with a nice bathroom. I booked the room by internet, and contrary to what i read over here, that the hotel did not give back that amount of money which they are tooking when you make the reservation, they showed me the receipt which proved, that they put back the money. Also they explained me, that with this operation, they are just checking if the credit card is ok. So i didnt had to worry about this. The staff are realy nice and helpful, the rooms are clean. We had two tv-s in the room with italian and english chanels. For the price which we paid, we got excellent services. I reccomend this hotel to young couples and famylies also.", "Date": "January 22, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Business service (e.g., internet access)": "4", "Check in / front desk": "5", "Overall": "5.0", "Value": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "usa", "Title": "“Nardizzi is a great place”", "Author": "Spainbound3333", "ReviewID": "UR12188264", "Content": "The Nardizzi is a great place. We had a quad room which was very clean and neat. Although the deco is \"minimal\" the value for the money is exceptional. The staff was more than helpful with everything - reservations, directions, etc. and the location makes it easy to get around. One word of caution: The hotel is located on the 5th floor of a very large building. The \"lift\" is small and very old. If you don't want to walk up the stairs, you sometimes have to wait for the ride up.", "Date": "January 1, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5.0", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Manchester", "Title": "“A hidden little Italian Gem”", "Author": "matador66", "ReviewID": "UR11672375", "Content": "Arrived 9th Dec approx 3 hrs before booking in allowed, the staff took our luggage and held it for us, after taking lunch we arrived back at the hotel to find our luggage had already been placed in our room. The staff were really helpful and showed us all the sites to visit on a marked up map, with the best way of seeing them. The hotel room while small was very clean and modern looking with a tasteful decor. Our room was cleaned and tided daily, our Jim Jams and coats were hung up along with clean towels. The Sat TV was very basic with poor picture quality, however it did show at least two English speaking channels. The breakfast was fantastic and a good choice of breakfast items, you can also have as much as you like, the same goes for the fruit juice and coffee. I will revisit this hotel again as it's location to the Termini, shopping and sites is so central and easily assessible to all the major tourist attractions.", "Date": "December 18, 2007"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Business service (e.g., internet access)": "3", "Check in / front desk": "4", "Overall": "3.0", "Value": "3", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Cleveland, Ohio", "Title": "“Centrally-located Nardizzi”", "Author": "kat517", "ReviewID": "UR11129060", "Content": "My husband and I stayed at this hotel from November 17 to November 20, 2007. We also stayed here per Rick Steves' recommendation, and a holiday card from him is on display in the lobby. If you are lookon a budget, this is your place. The location on Via Firenze is great - it's safe; near local restaurants and pubs, and around the corner from the metro. The hotel staff was friendly. The breakfast consists of cereal, breads, rolls, coffee and juices. We had a nice hot chocolate and espresso. It was off-season so the outdoor breakfast area was sealed. I'm sure mornings here are fantastic in warmer months. To comment on other reviews, the bathroom towels were small and a bit rough, but our bathoom was clean. If you're looking for a decent low-cost, centrally-located hotel, Nardizzi may be for you. We recommend this hotel for those on a budget, but if we visit Rome again we may spend a bit more but stay in the same area.", "Date": "November 28, 2007"}, {"Ratings": {"Service": "1", "Cleanliness": "2", "Check in / front desk": "1", "Overall": "1.0", "Value": "1", "Rooms": "2", "Location": "3"}, "AuthorLocation": "Canada", "Title": "“Stole our money-do not stay here!!!!!!”", "Author": "Exchange07", "ReviewID": "UR10862617", "Content": "DO NOT STAY HERE...Please read this review. We booked this hotel after reading the \"good\" reviews on trip advisor and had a TERRIBLE experience. The hotel charged our credit card a fee as a security but didn't refund the full amount before we came. We assumed that our final bill would be credited the same amount. However, upon checkout when we alerted the front desk about this problem they became irate. The male staff member yelled at us in front of the entire breakfast room accusing the credit card company of the error. We said that our credit card company would only believe the error if they had proof that the full amount had been refunded however, apparently it is their practice not to document such important transactions. After an incredibly long and drawn out argument we paid the full fee. The staff was disgusting and it became quite apparent that they did not care about their customers in the slightest. The more recent reviews of the hotel are accurate. Our room had no heat, the television didn't work, the bathroom was dirty and we were given dish towels as bath towels. We would NEVER stay at this hotel again.", "Date": "November 16, 2007"}, {"Ratings": {"Service": "1", "Cleanliness": "2", "Business service (e.g., internet access)": "2", "Check in / front desk": "1", "Overall": "1.0", "Value": "1", "Rooms": "1", "Location": "4"}, "AuthorLocation": "Los Angeles, California", "Title": "“Caveat Emptor”", "Author": "synthesis", "ReviewID": "UR10751589", "Content": "Based on Rick Steves' recommendation, I booked this hotel for three nights in November for my husband and me. From the beginning of our stay, it was a very negative experience. After some confusion about the rate, I decided to book the hotel for our stay in Rome. (The Rick Steves rate was actually higher then their posted rate on their website. When I pointed this out to them, they begrudgingly agreed to the lower rate, but were clearly unhappy that I had discovered this.) Upon check in, we were shocked at how rude the person at the check in counter was. This same treatment continued with each interaction we had with him and several others. They acted like they were doing us a big favor when we asked for information or directions. The front desk jockey even refused to make a restaurant reservation for us for the next night. He told me to do it myself! The room was very small and utterly without charm. The bathroom was incredibly small allowing for use by only oner person at a time. The shower door was broken to the point of not functioning. To their credit, when I informed them about it, they repaired it speedily. As someone else here mentioned, the towels are more like giant dishtowels. A minor annoyance: CNN did not work any of the three nights we stayed there. The first night we were there, I was told they were repairing it and it would be functional the next day. It still wasn’t working the morning we left. There has to be a better budget choice in Roma. Next time I will do more research before I book a hotel there. Makes one wonder if Rick Steves is getting some sort of kickback from this place.", "Date": "November 11, 2007"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Business service (e.g., internet access)": "2", "Check in / front desk": "4", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Baltimore, MD", "Title": "“Good location”", "Author": "clurmani", "ReviewID": "UR10650994", "Content": "My family was able to get two quad rooms. The location was ideal - within walking distance of the train station and metro. The room was a bit tight, but since we weren't spending much time in the rooms. There was a computer in the lobby for internet but it was only free for 10 minutes before you needed to pay. The breakfast was decent. Staff was very helpful. The elevator is very small to get up to the 5th floor.", "Date": "November 6, 2007"}, {"Ratings": {"Overall": "1.0"}, "AuthorLocation": "California", "Title": "“I'm sure Rick Steve's got better treatment than we did”", "Author": "Gr8tworldtravler", "ReviewID": "UR8752266", "Content": "First the good. The place is in a great location as far as walking to the various sites and or catching the metro or bus. Now the bad, As my wife and I checked in, I asked for some information on the map they gave me at the desk. The desk clerk told me to go to my room and relax and when I was ready to go see the site's to come back and he would show me. Very Rude! We were ready to start site seeing immediately because we only had limited time in Rome. He then escorted us to our room after letting us know that the Rick Steve's price we were quoted was which was 90 euro was now 120 euro for a double. The only reason we were staying at this hotel was on Rick Steve's recommendation. To park our car was another 25 euro a night. Also beware, Your room key is your power (electricity) so when you leave the A/C shuts off. So NO nice cool room to return to. It takes at least 3 hours for the room to start feeling comfortable. The towels are aweful they feel like those rough towels we use in our kitchen. But they will dry you off with some effort. Our nightmare revealed itself at 10:30pm when we returned to our room \"which was sweltering\" after a long day of walking around rome enjoying the sites. We were hot and sweaty and ready for a shower. The Shower nozzle was so dirty the water squirted everywhere but on the person trying to take a shower. Then the drain was clogged so the water overflowed onto the bathroom floor. We tried to call the desk for assistance and no answer! No problem we decided since the hotel was booked full that we would find another hotel in the morning. We felt surely who ever cleaned the shower last knew the problems with the shower head and the drain so we felt it better to move on without complaining just advising them of the need to check the rooms a little more through before placing customers in them. We advised the front desk that we would only be staying one night we told him of the problem and that it needed some attention. He then began to yell at Me and My wife telling us it was our problem and that he was going to charge us for the nights we booked. After arguing for about 30 min the conversation was going nowhere! He wanted cash and we would not give it to him, He had our American Express Card on file so eventually we had had enough and we took our luggage and left. I went to get the car while my wife waited for me by the curb. About 5 minutes later while my wife was waiting for me the Clerk came down from the 4th floor tried to take her purse, She resisted and was very scared. He then grabbed her suitcase and took it. When I returned my wife was distrought to say the least and at this point I started looking for the police. I had no luck finding one so I returned to the hotel and saw my wifes suitcase in the lobby. I walked up grabbed it and the clerk ran around and tried to rip it out of my hands. We now were in a tug of war in the lobby with people watching onward. It was a very unnerving and a lot of drama. All of it which was totally uncalled for and could have been resolved without incident had the clerk appologized for our inconvience and understood we were the customer and we had a bad experience at his hotel and were moving on. No need for the verbal abuse he put me and my wife through. It was a scary situation to be in also being in a foreign country. It was the first time I didn't feel safe on our month long trip to Europe! I would not recommend this hotel to anyone ever. The management needs a lesson on anger management. Just because your told of a problem with your room in your hotel don't take it personal it's no grounds for the treatment we received. NO CLASS AT ALL!!!!", "Date": "September 18, 2007"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Business service (e.g., internet access)": "4", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Los Angeles", "Title": "“Great place, no complaints...”", "Author": "California2985", "ReviewID": "UR8701405", "Content": "We found this hotel in Rick Steve's guidebook and were not disappointed. The rooms were huge and clean (with AC), the location was good, and the people working at the desk were very helpful. The breakfast was simple, cereal, breads, croissants, coffee, and juice, but it was typical of all the places we stayed in Italy. It was served on an outdoor patio that was really nice. The neighborhood is a short walk to sights and to a metro that can take you to some of the ones that are further out. I gave the hotel five stars keeping in mind the price. For its price, it is a great place to stay and I highly recommend it. We would definitely stay here again and I really can not think anything that is wrong with it. My only recommendation is to buy a map when you get into Rome. Generally I have no problem reading maps, but we did get lost using the one on the Hotel's website. It was too simplified and it took as longer to find the place than it should have. Also, if you are older, there are a lot of steps to the hotel and the elevator was not one I would want to use all the time. I used it when I had my luggage, but otherwise preferred to walk.", "Date": "September 12, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Florida", "Title": "“Awesome place”", "Author": "jaditz", "ReviewID": "UR8697386", "Content": "Stayed here for 3 nights with my sisters and absolutely loved it. The people are so nice, the location is awsome and the accomodations pristine. After staying in hostels it was nice to have a private bathroom in our room. You leave the key at the front desk when leaving, but this is pretty standard for Europe. Also, when entering the room you have to insert a part of the key for power - it helps the hotel save on energy costs, particularly when you are gone for the day, but also means it will take a while for the a/c to cool the room when you return. However, I found this same practice in other countries. One plus about this place is it does have elevator access, albeit the elevator is small and quaint - something out of a 1950s movie, but it works and saves you from hauling your luggage up 5 flights. The breakfast provided was one of the most substantial we found - cereal, bread, coffee, juice, etc. There's a delightful terrace where you can have supper - we brought pizza back one night. Another plus, is in the reception area is a computer with internet access. THe location is awesome, within walking distance of a bus and metro stop. The street was quiet and I did not feel unsafe coming back to hotel late at night as the Defense Ministry is nearby.", "Date": "September 11, 2007"}, {"Ratings": {"Service": "2", "Cleanliness": "4", "Check in / front desk": "4", "Overall": "3.0", "Value": "3", "Rooms": "2", "Location": "5"}, "AuthorLocation": "Washington, DC Area", "Title": "“Serviceable and Central, But”", "Author": "Felix_That_Cat", "ReviewID": "UR8688244", "Content": "We've stayed in Rome a number of times. This was the first time we tried the Nardizzi (Rick Steves recommends it and he usually doesn't steer us too far wrong). As others note, it's in a great location near Termini--so you can easily jump the metro, or take a (speedy) twenty-minute walk to the Forum or Trevi. We brought the whole family, so we opted for a quad (140 euros per night). The rooms were large and quiet and the included breakfast was great--but no Nutella! Two things concerned us: (1) The air conditioning worked fine in the hallway but the room was another story--we were sweltering, and requests to fix the problem didn't really get us anywhere. (2) We were told on checkout that our rate was a cash-only rate, which would have been fine if it had been mentioned anywhere in the email traffic, but I don't make it a habit of carrying 500 euros with me, so we had a few awkward moments before the guy at the desk decided to relent. I'm not sure we'd come back--I give top points to folks who can provide the key elements necessary for a good night's sleep, and an 85-degree room isn't one of them--but the location is excellent and the staff clearly is trying hard.", "Date": "September 10, 2007"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Check in / front desk": "4", "Overall": "5.0", "Value": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Leicestershire", "Title": "“An excellent hotel in a great location!”", "Author": "w00w00", "ReviewID": "UR8433673", "Content": "We stayed in this hotel through a travel agent. It was better than what we were expecting for a 2 star. Our room had a corner view of the main street below which was lovely. The room was clean and ample big enough. The towels are thin and i would suggest taking your own, but you do get 4 to use. The lift, although a bit scary, is part of the history of the building and fascinating. I would defo go back to this hotel in Rome. Very convenient location and near to major bus routes and metro stops. Lovely people.", "Date": "August 16, 2007"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Business service (e.g., internet access)": "4", "Check in / front desk": "4", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "mrsjlo", "Title": "“Great find, very nice people and great price!”", "Author": "mrsjlo", "ReviewID": "UR8393011", "Content": "I found this hotel thru the Rick Steve's book and they will give you a great discount (I think it was 15% off) for bringing his book and referencing it. That was a great deal. I was really glad that they had a computer for guests to use for free and also sell great bottles of wine at happy hour. Decent breakfast but there are better options on the same street cafes for 2euros. definitely try the pizza place on the same side of the street about 1/2 block down, its awesome! great lunch for 5euros. would stay here again.", "Date": "August 11, 2007"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "American in Heidelberg", "Title": "“It was great!”", "Author": "ronrit", "ReviewID": "UR7193296", "Content": "This was an excellent hotel, great location, knowledgeable and pleasant staff, and a wonderful deal. We were very happy with the rooms which were decorated nicely and clean. The hotel was very conveniently located. The staff went out of their way to give us advice and make sure our stay was a nice experience. I recommend this hotel highly.", "Date": "March 20, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "2", "Check in / front desk": "4", "Overall": "5.0", "Value": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Brooklyn, NY", "Title": "“Great place to stay in Rome!”", "Author": "JuliaBklyn", "ReviewID": "UR6940605", "Content": "Very nice rooms! Great bathroom, comfortable enough bed, good closet space. The location can't be beat! Breakfast is sparse-- mostly just croissants and coffee from a machine... but reasonable, I suppose. It is located right off Via Nazionale (close to Piazza Republica) and was a great base to see Rome. I would definitely stay here again. Christmas photos of Rick Steeve's family from the past few years hung in the foyer. Don't worry if the person checking your in seems a bit pushy at first, it may just be the way of the Romans. We thought Samy was sketchy upon arrival but he grew on us by the time we left. All-in-all, a great value for 80Euro/night in Rome.", "Date": "March 9, 2007"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "West midlands", "Title": "“A great stay”", "Author": "L82", "ReviewID": "UR6704184", "Content": "Great location within 10 mimute walk of Termini, Spanish steps, and Trevi fountain. All other sights easily accessible by metro system. Hotel basic, yet good standard for 2 star, rooms are clean and comfortable. Pick up a map from reception and they will try and answer any questions about the local area you have. I would suggest you use the stairs as the lift is a bit dodgy, if you stay there you will see this for yourself!! Breakfast just bread and crossiants on the roof terrace, nice setting, typical Italian style. Would stay there again.", "Date": "January 27, 2007"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Business service (e.g., internet access)": "4", "Check in / front desk": "4", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Midlands,England", "Title": "“Value for money in Rome”", "Author": "muss57", "ReviewID": "UR6436395", "Content": "Returning to Rome for the 1st time in 32 years I chose to stay in this hotel because of the good reviews left by others and the comparitively realistic cost when compared to most others in Rome. We were not disappointed with the hotel. The 'unique lift' is certainly that and the friendliness of the reception staff is also something that is pleasant without being overpowering. Make sure you take the full address details as the building although large was not immediately evident to our taxi driver. The hotel is on the fourth floor and if you are scared by small lifts that resemble building hoists this may not be the place for you as the stairs are lenghthy due to the height of the ceilings on each floor of this multi-purpose building which contains, two churches, two hotels and private living accommodation. The rooms were pleasant although ours did not have the promised hair drier and the shutters to the front window were not operable. We had a very large bed and the sheets were spotless as were the other facilities such as the bathroom-which had a lovely warm shower. Breakfast was as we expected-simple but the croissants were delightful. Overall I would recommend this hotel to anybody seeking a location close to the attractions of Rome in a relatively quiet and clean area.", "Date": "December 13, 2006"}, {"Ratings": {"Cleanliness": "4", "Business service (e.g., internet access)": "3", "Check in / front desk": "4", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Baltimore, MD", "Title": "“Would definitely stay there again.”", "Author": "Reussite1", "ReviewID": "UR6230779", "Content": "I was very pleased with this hotel for the price. We were in a good central location, the place was kept immaculately clean and the hotel staff were so helpful and friendly. Especially Luccia, as another reviewer mentioned below (what a cutie too!). Right down the street is an awesome cafe and a fabulous pizza/pasta joint called \"Punto e Virgola\". We could've eaten lunch there every day! All in all a great value.", "Date": "November 28, 2006"}, {"Ratings": {"Service": "2", "Cleanliness": "4", "Business service (e.g., internet access)": "3", "Check in / front desk": "2", "Overall": "2.0", "Value": "2", "Rooms": "3", "Location": "2"}, "AuthorLocation": "Austin TX", "Title": "“OK, but not a great value”", "Author": "Gilanah", "ReviewID": "UR6079291", "Content": "At breakfast, there's a self-serve machine that makes miserable cappachino. The elevator up was a bit frightening. We were misled about the location when we booked it; not as close to Termini as advertised. Our window opened up onto a street with constant traffic. Internet access is only available through a computer in the lobby, but they did let me use it for a few minutes for free. Overhead the staff giving good recommendations for restaurants to other guests, but they tried to pressure us into some packaged bus tour with dinner. Cleanliness is nice, but the smell of ammonia was overwhelming when we arrived.", "Date": "November 6, 2006"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Business service (e.g., internet access)": "4", "Check in / front desk": "5", "Overall": "5.0", "Value": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Alberta", "Title": "“Best Service”", "Author": "Eveleigh", "ReviewID": "UR5717210", "Content": "We arrived at the hotel Nardizzi before 8AM on a Sunday morning. Our train came in early and we were hoping to drop our bags at the hotel until we could check in at 3 or so. The gentleman at the desk not only stored our bags for us but also invited us for a complimentary breakfast. He then went out of his way to offer us a map of things to do/see while we were in Rome. He then indicated that he would have the staff get our room ready as soon as possible so that we could check in early. After a morning of sightseeing we went back to the hotel and our room was ready by 11:30AM. Our experience at the Nardizzi continued in this manner for the duration of our 4 night stay. ALL the staff members were exceptional! The room was great. Location is superb (10min from train station; 5 min to metro) All the sights were within walking distance (though we did take the metro to the Vatican) Overall, the hotel was very good. The staff excellent. I have stayed over 2000 hotel nights in the past 20 years or business and pleasure. The staff at this hotel are surely in the top 5% of those hotels. I would return without question.", "Date": "August 28, 2006"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "Minneapolis", "Title": "“Great friendly service”", "Author": "11annk", "ReviewID": "UR5562865", "Content": "We spent 3 nights and booked directly through their website. They had a great deal called \"overbooking\" and we paid half the normal price. We highly recommend this deal offered during high season only. They guarantee some central accomodations at one of their partner hotels if the Nardizzi is full at the time. We were a little skeptical of this deal at first but it actually works. As it was, we managed to stay at the Nardizzi, but it became very clear that they would have put us in a taxi (paid by them) to another central hotel in Rome. All the other alternative locations were good. Mario, the guy at the front desk, was very helpful and gave us great friendly service. He is very good at explaining the details of the overbooking deal in case someone has any specific questions. The hotel is centrally located, close to the railway station, quiet and overall very pleasant. It's on a fourth floor but there is an elevator. Overall, we highly recommend it, and if you can try the overbooking deal. It worked for us.", "Date": "August 6, 2006"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Business service (e.g., internet access)": "3", "Check in / front desk": "4", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "St. Louis, Missouri", "Title": "“Had a nice time”", "Author": "jgklein1994", "ReviewID": "UR5509320", "Content": "We read about the Hotel Nardizzi Americana in Rick Steves guidebook, and the hotel gave exactly what was promised. The staff was courteous and nice, they kept the rooms very clean, and the terrace was very nice. The continental breakfast was slightly disappointing, with not much selection. The internet access was convienent and useful (We live in St. Louis, Missouri, USA, and we were in Italy while the big storm hit St. Louis and knocked out 500,000 homes power-It was good to know what was going on back at home). The air conditioning did not work very well-we had it on 13 celsius the entire time and I don't think it got below 20 or 25. It was still fairly comfortable. We enjoyed our stay.", "Date": "July 25, 2006"}, {"Ratings": {"Cleanliness": "1", "Overall": "1.0", "Value": "2", "Service": "1", "Rooms": "1"}, "AuthorLocation": "Miami, fl", "Title": "“Good location but hotel has bad services”", "Author": "A TripAdvisor Member", "ReviewID": "UR5359094", "Content": "The room is small....The bathroom smelled like sewage...The breakfast is poor...The cleaning is horrible especially allergic to dust. The bedsheets smelled bad and the towels. The elevator sometime did not work (Walk up five floors!).", "Date": "June 18, 2006"}, {"Ratings": {"Cleanliness": "4", "Overall": "3.0", "Value": "3", "Service": "3", "Rooms": "3"}, "AuthorLocation": "Ipswich, United Kingdom", "Title": "“What you need, where you need it”", "Author": "Carpender", "ReviewID": "UR4932869", "Content": "We found this hotel through TripAdvisor, stayed for 6 days as tourists, and are now checking the details for a friend. Excellent position. Room very clean, large enough, good shower-room & toilet. Staff & service satisfactory. No problems with noise. We were on the top floor, and the lift was out of order a couple of times, which can be serious if, like me, you're a pensioner with sciatica! Central heating didn't work, though the system was on for the building, and our requests for attention didn't get anywhere. Breakfast was average by Italian standards (that is, poor by most other European, English, and American standards!) but at these prices ... and anyway, who builds a holiday in Rome around the breakfasts? The whole area is buzzing with little cafes, so no real problem. All in all, we got what we paid for, fair accommodation, at a fair price. We didn't stay there on our second trip, but might do so for our next!", "Date": "April 4, 2006"}, {"Ratings": {"Cleanliness": "4", "Overall": "3.0", "Value": "2", "Service": "3", "Rooms": "3"}, "AuthorLocation": "San Diego", "Title": "“Not a bad place”", "Author": "ERRN95", "ReviewID": "UR4831403", "Content": "We stayed at the Hotel Nardizzi after seeing it Rick Steve's Book. Make sure you have the hotel address when you are trying to find it, because signage is pretty basic, and it is one of a couple of different hotels in the same building. The coffin size elevator is a memorable item in itself. The hotel is located on the fourth floor, and if anyone leaves the elevator door open, the elevator won't come back down. The room was clean and comfortable enough. Breakfast was basic and OK. Kind of pricey hotel for what you get though, but I guess all hotels in Rome are expensive. I'd try the Oceana Hotel next time, looked nicer and they are supposed to have world famous coffee. It is in the same building, down a floor from the Nardizzi. Close to Metro, which was very easy to use. Night clerk recommended a restaurant which was pretty mediocre. When I saw him later, I asked him if his brother owned the place, and he admitted that it was his brother in law.", "Date": "April 3, 2006"}, {"Ratings": {"Overall": "2.0"}, "AuthorLocation": "Hawaii and Ohio", "Title": "“Great Location/Fair Hotel”", "Author": "romebound", "ReviewID": "UR4410176", "Content": "We stayed here for 3 nights Oct.2005 after a 12 day Carnival cruise. The train and subway are close. We could walk to Trevi Fountain, Coluseum, and Spanish Steps. Our room was on 4th floor and the elevator is very old fashion. Breakfast was just enough to get started. Some of the staff were not willing to help us contact a priest at the Vatican who we were supposed to meet. It is a safe area but accomodations were fair.", "Date": "February 2, 2006"}, {"Ratings": {"Cleanliness": "4", "Overall": "3.0", "Value": "4", "Service": "3", "Rooms": "3"}, "AuthorLocation": "", "Title": "“Good budget hotel”", "Author": "A TripAdvisor Member", "ReviewID": "UR4243584", "Content": "We have just returned from a four night stay in Rome and found this hotel ideal for people looking for a good value deal in a centrally located area. Our room was clean and the Bathroom shower gratefully recieved after some chilly days sightseeing. Staff were polite, the breakfast was basic but pleasant, the only real niggle was the dreadfully loud air conditioning system which also didn't really heat the room efficiently. All in all I can say that I have stayed in worse hotels with more stars that this - If you are on a budget you could do far worse.", "Date": "December 15, 2005"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "Champaign IL", "Title": "“Excellent Value”", "Author": "lms347", "ReviewID": "UR3539278", "Content": "We stayed at the Hotel Nardizzi Americana in Rome Italy for 2 nights in May 2005. This hotel was a great value. The room was beautifully decorated for a 2 star hotel and the breakfast in the morning was one of the most extensive continental breakfasts we encountered in Italy. The hotel management could speak Engish well and were extremely helpful with helping us find our way around or answer questions. The only caution is that they have a set of rooms about 2 floor below the main hotel--this is where we stayed. There doesn't seem to be any elevator to them, but the steps aren't steep. The best part is that it's walkable from the train station and there is a metro stop just a block or so away.", "Date": "June 8, 2005"}, {"Ratings": {"Cleanliness": "4", "Overall": "3.0", "Rooms": "5", "Service": "4"}, "AuthorLocation": "", "Title": "“Touristy...very unlike most of italy”", "Author": "A TripAdvisor Member", "ReviewID": "UR3515882", "Content": "My mother and I stayed here after a week-long tour of Florence and Siena. The hotels we stayed in the other two cities, Soggiorno Battistero in Florence and Albergo Bernini in Siena (both quaint and excellent), but the Hotel Nardizzi was quite different. The rooms are very American like (which, granted, is given in it's name), including electric door keys, an elevator (\"lift\"), air conditioning (which we had problems getting to work), and (*gasp*) a television. If you're looking for a place to stay that is clean, high-class, and touristy, this is your place. However, this hotel is not indicative of most of Italy, which is more rural, quaint, and...European! I can't say I know what other Roman hotels look like, so I have nothing to compare our experience there with, but next time I would stay somewhere with more character.", "Date": "June 1, 2005"}, {"Ratings": {"Cleanliness": "1", "Overall": "1.0", "Value": "1", "Service": "1", "Rooms": "1"}, "AuthorLocation": "west sussex", "Title": "“Unbelievably Bad”", "Author": "Caperintheuk", "ReviewID": "UR3317748", "Content": "We stayed at this hotel for 3 nights in February as a recommendation from friends who had been to Rome before us. Since we have the same taste and standards, I felt comfortable booking the hotel without doing the usually research and review searching that I normally do. WHY did I listen to our friends??? It is true that the location is very good for walking to all the major attractions but the hotel was pitiful. The room was small, dark and smelled of sewage. The constant noise in the hotel was sometimes unbearable with the front desk staff chatting very loudly non-stop all night. The stone hallways echo, not only voices, but the footsteps of everyone passing. The heat in our room was not working and we asked the front desk staff to fix it and they did not. As well, we had party revellers that were moving beds from one room to another at 1:00am down the hall from the front desk and the staff did and said nothing. My 6'4\" husband had to put the scare into them and he went directly to complain and they said there is nothing they could do! Who is running this hotel anyway?? I have noticed comments that they arrange for transport to the airport, which is true. Our driver decided to take a friend along for the ride who talked non-stop arguing in Italian (the charm faded after the first 5 minutes) on his mobile phone for the 45 minute commute to the airport while the driver played his new CD so loud that I couldn't hear my husband talking to me. I would rather have taken the train!!!! If you are going to Rome I would look at hotels in this area, as we did see many. But please stay away from this one if you are over the age of 20.", "Date": "April 1, 2005"}, {"Ratings": {"Cleanliness": "4", "Overall": "4.0", "Value": "4", "Service": "4", "Rooms": "4"}, "AuthorLocation": "West Midlands", "Title": "“Great Budget hotel”", "Author": "A TripAdvisor Member", "ReviewID": "UR3263691", "Content": "The hotel was in a good location, easy walking distance from Termini, with metro stop (Repulblica) just round the corner. The room was quite small, but clean and recently decorated. Breakfast was basic but adequate. Hotel located on 4th floor, and the lift was small but reliable. I will definatley recommend this hotel for a good base for a short stay in Rome.", "Date": "March 10, 2005"}], "HotelInfo": {"Name": "Nardizzi Americana", "HotelURL": "/ShowUserReviews-g187791-d237192-Reviews-Nardizzi_Americana-Rome_Lazio.html", "Price": "$92 - $204*", "Address": "<address><span rel=\"v:address\"><span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">via Firenze, 38</span>, <span class=\"locality\"><span property=\"v:postal-code\">00184</span> <span property=\"v:locality\">Rome</span></span>, <span class=\"country-name\" property=\"v:country-name\">Italy</span> </span></span></address>", "HotelID": "237192", "ImgURL": "http://media-cdn.tripadvisor.com/media/ProviderThumbnails/dirs/43/ff/43ff804f72035ca392c8b1cc93506b481large.jpg"}}