{"Reviews": [{"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "New York City", "Title": "“Most helpful staff”", "Author": "marlowe42461", "ReviewID": "UR105906979", "Content": "Beautiful hotel in green leafy neighborhood, great place for a morning run. Parks nearby. Quiet, great night's sleep. Front desk staff extremely helpful and friendly. Hotel restaurant a little pricey.", "Date": "April 28, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "3", "Overall": "2.0", "Value": "2", "Location": "1", "Rooms": "2"}, "AuthorLocation": "washingt", "Title": "“bad location; unhelpful service”", "Author": "mag921", "ReviewID": "UR34233811", "Content": "This hotel is right next to the Teknon medical clinic and seems to have capitalized on that to attract patients/visitors. It's set in a residential neighborhood near Sarria. Getting back and forth to central Barcelona was time consuming (metro or bus) and not cheap in a taxi. The rooms are OK and modern, as is the lobby, but the front desk staff were generally unhelpful and the breakfast was bad and expensive.", "Date": "July 8, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "4", "Check in / front desk": "5", "Overall": "4.0", "Value": "4", "Rooms": "5", "Location": "4"}, "AuthorLocation": "London", "Title": "“Excellent small hotel with friendly staff”", "Author": "boslon", "ReviewID": "UR8452415", "Content": "We had a very pleasant two night stay at the Tura de Vilana. The hotel and rooms are exceptionally stylish and clean. The staff was friendly and went out of their way to point us in the right direction for sightseeing, restaraunts, etc. The hotel is located in a quiet upscale residential area and is about a 10 minute taxi ride to the centre (La Rambla). Maybe not the best place if you want to be in the centre of the action, but great for a quiet night's sleep after a night out in Barcelona. There are two metro staions within about a 10-15 minute walk and the hotel also has a underground car park (€8,00 per night). The rate was €214 for two nights including breakfast. We would definitely go back when next in Barcelona.", "Date": "August 19, 2007"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Seattle, WA", "Title": "“Very stylish small hotel”", "Author": "A TripAdvisor Member", "ReviewID": "UR1108057", "Content": "Stayed here in May of 2001--my first (and so far only) trip to Europe. It was a business trip and the hotel was picked not by me, but by a company I was visiting in the area. It is a small hotel of 20 rooms, built sometime in the 1990s as far as I could tell. The interior decor was contemporary and somewhat minimalist, kind of like Scandinavian but with a more Mediterranean color scheme. I love the marble which seems typical of Barcelona interior design. My room was rather small (compared to what I'm used to in America) but perhaps average size for Europe. It was attractive, and sparkling clean. The large marble bathroom was especially nice. It took me a little time to figure out the light switches, which were actually electronic pushbuttons. You have you insert your room key in a slot in order to have power to your room. I had the buffet breakfast every morning. It was outstanding! Tasty meats, fresh fruit and stellar pastries. The torta (like a big omelet cut into wedges) was one of my favorites. Great croissants too. It was a few blocks to the FGC (subway) station to downtown. There were a number of restaurants close by... I enjoyed El Trapio which is just about a block away for more formal dining, and Crep Nova for a casual meal (pizza was good). There were some minor drawbacks--the elevator was very slow, and sometimes the front desk staff was nowhere to be found. But all in all I was impressed. I'd like to try the Hotel Arts downtown, a highrise by the waterfront (at least twice as expensive), but Turo de Vilana is an excellent choice, especially for the price. I would definitely return.", "Date": "June 25, 2003"}], "HotelInfo": {"Name": "Hotel Turo de Vilana", "HotelURL": "/ShowUserReviews-g187497-d237154-Reviews-Hotel_Turo_de_Vilana-Barcelona_Catalonia.html", "Price": "$121 - $186*", "Address": "<address><span rel=\"v:address\"><span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">Vilana, 7</span>, <span class=\"locality\"><span property=\"v:postal-code\">08017</span> <span property=\"v:locality\">Barcelona</span></span>, <span class=\"country-name\" property=\"v:country-name\">Spain</span> </span></span></address>", "HotelID": "237154", "ImgURL": "http://media-cdn.tripadvisor.com/media/ProviderThumbnails/dirs/47/29/4729cbec2c2d54b20a1e40f4e9dc86211large.jpg"}}