{"Reviews": [{"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Sleep Quality": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "surrey", "Title": "“Completely Central”", "Author": "stickiesurrey", "ReviewID": "UR128333177", "Content": "We stayed here for four nights......finding it through the British Airways web site.The hotel itself is in an amazing position for seeing all the sights in Venice.....a few hundred yards from St Marks Square and the Doge's Palace,about 5 mins walk fro the Rialto Bridge and right in the middle of the shops and restaurants.They only do bed and breakfast....breakfast the usual continental....good coffee,croissants and other pastries,cheese,ham salami,yoghurts,preserves and breads,and there is a mini bar in the room for cold drinks(not at rip-off prices either)However,we wanted a coffee when we came in late on evening and bought one at the kiosk opposite the hotel and my husband was told in no uncertain terms that no food or drink bought outside was allowed in the hotel,even though there isn't room service available.Bit of a cheek we thought and others were doing the same thing.....if they don't want people doing that,then they should do room service. It is classed as a three star hotel,probably because there is a 'phone in the room,plus a mini-bar and air conditioning(essential in the summer) and a 'bath' as well as a shower.Our bathroom was small to say the least.....the 'bath' was a type of hip bath that you squatted in(no room to sit down properly) with a slope...you had to stand in the plug end of it to have a shower and stretch over the loo to actually get in(no handles on the wall).When you sat on the loo you could put your forehead on the wall opposite ...the room was only about 6feet by 3ft 6inches maximum,but having said all that it was very clean,and tons of very hot water.The bed was large and comfortable.Quiet at night......friends of ours had a room facing the alleyway with the shops and said that it was quite noisy,so the room is quite important.(their bathroom was bigger and so was the room) Altogether it was a very convenient hotel,and we would recommend it for a short beak.", "Date": "April 22, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "3", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Loughborough", "Title": "“Fantastic location”", "Author": "H.Fitz", "ReviewID": "UR127597071", "Content": "We enjoyed our stay at Hotel Orion, it was no frills but in fact it was much better than we expected given the price. The location is absolutely fantastic - just around the corner from San Marco. As a consequence, it can be a bit noisy from the street below but it was a small price to pay for being so central. The staff were friendly and the room was clean and quite spacious - although the bed and pillows were a bit hard! I'd stay there again if I went back to Venice.", "Date": "April 10, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Sydney, Australia", "Title": "“Simple, clean and close to San Marco! Great value for money!”", "Author": "Christine R", "ReviewID": "UR124900591", "Content": "This hotel has a simple layout, is clean and is well located. I would stay here again. It's great value for money! It was perfect for us because it is close to Venice's main attractions. The hotel is only few minutes walk to San Marco, St Marc's Basilica and about 10 minutes walk to the Rialto Bridge. We stayed here during Carnivale which is a busy season and crowded with people so it was great to have the hotel near the festivities as there are not many public toilets around. The hotel is also close to the San Marco water bus stop so it was convenient to arrive and exit, especially since it was just a weekend trip for us. The bed was comfortable and the bathroom was clean. The bathroom can only fit one person at a time as it is a little on the small side but that didn't bother us as this is standard for Europe. What I loved was that it had a heated towel rack so that we had warm towels straight after our shower. This also helped to heat up the room. There are stairs so if you have a lot of luggage, be prepared to carry it up. The staircase is narrow. We packed light in Venice because we learned from last time that it is hard to get around with too much luggage. Also if you are a light sleeper, you will also hear your neighbors walking up the stairs of the hotel at night so you might be woken up if they are noisy. Breakfast is ok, but the hotel is inexpensive so I think that makes up for it.", "Date": "February 20, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "3", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Prague, Czech Republic", "Title": "“What a location for this kind of money...”", "Author": "David_PRG85", "ReviewID": "UR124577439", "Content": "Generally I was very satisfied with this hotel. Value for money is amazing. It's literally one minute walking distance from San Marco. Staff was extremely fast and polite, especially in the restaurant during our breakfast. The only negative point was an immense smell from the drain in bathroom - however, this is quite typical problem in Venice, since they don't have proper sewer (city on the sea).", "Date": "February 14, 2012"}, {"Ratings": {"Service": "2", "Cleanliness": "2", "Overall": "2.0", "Value": "3", "Sleep Quality": "1", "Rooms": "2", "Location": "4"}, "AuthorLocation": "Riga, Latvia", "Title": "“Neiesaku Å¡o vienÄ«cu!”", "Author": "Ieeva", "ReviewID": "UR120378833", "Content": "Breakfast was poor. Stale bread, with cheese and cheap drumstick. Croissant. No sound insulation. Whatever you do, hear all the adjacent rooms. And also you have to listen to what your neighbors involved. Not lift, narrow stairs. Bed sleep, all night room pot is leaking water. Recommend extra, but get the comfort to enjoy the city!", "Date": "November 9, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Horsham, United Kingdom", "Title": "“Small but friendly, great location”", "Author": "Sussex_Adventurer", "ReviewID": "UR119887569", "Content": "We stayed for 3 nights and found this hotel met our needs for a quick city break in Venice. Great location (one minute's walk from St Mark's Square) and surrounded by shops, and right opposite an excellent patisserie. The service was friendly but not intrusive. No lift and you have to breathe in to make your way around the breakfast room, but those are the trade-offs for being in such a central location in such an expensive city. Given that this hotel is right in the heart of Venice, you have to expect a degree of street noise and small rooms and bathrooms, but we felt that the location, polite service and a decent breakfast more than made up for this. Would stay here again.", "Date": "October 30, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "2.0", "Value": "3", "Location": "5", "Rooms": "2"}, "AuthorLocation": "", "Title": "“It was too small and no lifts”", "Author": "Sympos", "ReviewID": "UR119207112", "Content": "Acknowledging space is a premium in Venice, the room we had on 4th floor was too small. Bathroom extremely small. Could not even dry myself. Also WiFi charges very expensive.", "Date": "October 11, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Yorkshire, England", "Title": "“In the heart of the city!”", "Author": "NicR4", "ReviewID": "UR119129610", "Content": "Hotel was good value. We got a water taxi and had to navigate ourselves there which was reasonably easy. The receptionist couldn't have been more helpful. Our room was on the 4th floor. Only downside was there was no lift-my poor husband had to lug the cases all the way up. The room itself was fine. Small but just what you needed. It looked out onto a bustling square. The bathroom was like a wetroom it was clean and had a powerful shower. The room was clean and tidy and the bed comfy. The hotel is about 1 minute away from St. Marks Square so you couldn't ask to be any closer. Breakfast was good but there was a limit on the chocolate croissants-1!!", "Date": "October 10, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "3.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Brighton, United Kingdom", "Title": "“Short stay”", "Author": "trevor p", "ReviewID": "UR118422933", "Content": "The location cannot be beaten. Rooms somewhat small but you only really need a bed and shower/toilet anyway. Ample breakfast. On the downside, rooms are on three floors and there is no lift. Disabled be aware.", "Date": "September 21, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "4"}, "AuthorLocation": "london, uk", "Title": "“Very sweet hotel in a fantastic location”", "Author": "dreamgirl81", "ReviewID": "UR117954592", "Content": "We booked this hotel through British Airways (suprisingly cheaper that other websites...) after reading the reviews on Trip Advisor and it didn't disappoint. It has the most fantastic location right in the middle of the little venice streets, about 2 mins walk to St. Marks Square. We had a lovely room (gorgeous shabby chic matching desk, wardrobe, beside tables and bed painted with flowers) and the most amazing shower (even though as its a \"wet room\" bathroom- everything does get wet!) Air conditioning, TV and fridge all worked fine. Breakfast was basic but good. The staff were quite friendly and there was no problem us checking in 2 hours early at no extra cost. Highly recommend this hotel to anyone visiting Venice- we will certainly return to it when we next go there!", "Date": "September 11, 2011"}, {"Ratings": {"Cleanliness": "2", "Sleep Quality": "2", "Overall": "3.0", "Value": "3", "Service": "3"}, "AuthorLocation": "Los Angeles, California", "Title": "“Mediocre hotel, the location can't be beat!!”", "Author": "Calibunga", "ReviewID": "UR117825938", "Content": "I LOVE the location of this hotel! It is so easy to just run down and grab food and run back up. It's basically right smack down in the bustling streets of Venice. The hotel was also pretty easy to find. Go through the clock tower of San Marco square, make an immediate right, and left on the first STREET (there is a small alley way before the street, don't go through there), and you'll the Hotel Orion sign on your left. It's surrounded by 2 gelato stands. The best gelato we tasted in Venice was the one next to the hotel on the north west side. Leave the hotel reception desk, turn left, and it's the gelato shop on the corner on the left side (same side as hotel orion reception desk). Their 1 scoop is actually a 1.5 scoop. It looked humongous compared to the ones we got by the San Marco square (which had nasty gelato). This gelateria are super generous and nice. The hotel is somewhat comfortable. We took the option to not eat breakfast and saved 15 euros per night. Totally worth skipping breakfast to go down to a nearby cafe and order something good. There were three of us, and they put us in an \"apartment\" for 2 nights. The apartment looked kind of creepy. It looked interesting in the photos online, but when we walked in, it actually had a \"creepy\" feel to it. As the other reviewers say, water flows down to the bathroom floor (because of the way the bathtub is tilted, water from the shower head flows down along the sides of the bathtub), so the entire floor become wet. It dries up pretty fast though in the summer heat. I'm sure this would not be fun during the winter though. We also had red bumps that appeared on our bodies as well, and there are mosquitos, which seem pretty standard for Venice. There is AC (the AC box is connected high on the wall, but water drips from it). PROs: LOCATION LOCATION LOCATION. smack down in the middle of the action. super convenient to get to the shops/food. Best gelato we've tasted on this trip is next door. CONs: not much of an AC - just blowing cool air, but better than nothing. Bathroom floor becomes wet when you shower. We had bumps/bites appearing on our bodies during our stay. room had a \"creepy\" feel. Beds are uncomfortable. So yes, there are more cons than pros, but the pro is just so good, that it makes the other cons bearable. I cannot describe how good the location is.", "Date": "September 8, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "4", "Overall": "4.0", "Value": "4", "Service": "4"}, "AuthorLocation": "", "Title": "“So lucky to find this hotel!”", "Author": "cubsfan0121", "ReviewID": "UR116026116", "Content": "What a fantastic location! Steps away from San Marco Square, 5 minute walk to the Rialto Bridge, and many great restaurants near by. We tried to check in very early, but our room was not ready. So they stored our luggage and provided us with a bathroom to freshen up. Very welcoming staff. Room was small (compared to US standards) but very clean! The bathroom was very small but clean. Did not see the breakfast room. The AC worked well. Would stay here again.", "Date": "July 30, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Location": "5", "Rooms": "5"}, "AuthorLocation": "", "Title": "“Great location, clean, and quite room with A/C”", "Author": "MrBuffet72", "ReviewID": "UR114965471", "Content": "This hotel has a great location, only a couple of minutes from San Marco, the rooms a well maintaint, good value, great services.", "Date": "July 2, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "4.0", "Value": "5", "Service": "4"}, "AuthorLocation": "Sydney, Australia", "Title": "“Would Stay Here Again!”", "Author": "Sanjra11", "ReviewID": "UR114854725", "Content": "Service was decent enough, didn't take much notice as we were out of the hotel most of the time. Breakfast was small - but very Italian (Italians don't believe in big breakfasts) Hotel location was perfect, right near St Marco's Square so always easy to find your way back! The hotel is 2 star, so you get what you pay for... But i would give it another star. It was a far better stay then other 3 star hotels i've stayed at.", "Date": "June 29, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "3.0", "Value": "4", "Location": "5", "Rooms": "3"}, "AuthorLocation": "", "Title": "“Clean friendly staff, a 2 star but nearly a 3!”", "Author": "Constanttravelman", "ReviewID": "UR114722611", "Content": "Overall good, fantastic location! And I mean fantastic right in middle of action just of San Marco square. Rooms were clean, ours very small, tiny wet room with shower room 33, but perfectly adequate. Breakfast a little basic, everyone raves about it on here but in my opinion there could have been more choice. A very minimal continental was offered! Staff friendly, overall good. Would stay again.", "Date": "June 24, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "malaysia", "Title": "“Right in the Middle of Everything”", "Author": "Drwan", "ReviewID": "UR113533757", "Content": "We stayed at the Orion for two nights and its right in the middle of everything.. Nice hotel and very nice staff.. breakfast was super.. will be back", "Date": "June 14, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Seattle, Washington", "Title": "“A little more but TOTALLY worth it.”", "Author": "Sounderspa59", "ReviewID": "UR99994553", "Content": "After staying in a crappy place I block away, I was pleasantly surprised at the overall quality of this hotel. Excellent room, service, 100% available staff, and awesome breakfast. The breakfast cafe is to die for. All over a street with great views. I will definitely return.", "Date": "March 13, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Gold Coast Australia", "Title": "“The heart of Venice at your feet”", "Author": "misstiatokyo", "ReviewID": "UR86706717", "Content": "Hotel Orion is hard to find, like everywhere in Venice! Once you are there you are greeted by cheerful staff, beware, no elevator so not for those who are infirm or elderly. We stayed for 2 nights and our room was clean and comfortable. The shower, as previous reviews mentioned has no shower tray so the whole bathroom becomes very wet when you take a shower. This was a minor inconvenience to be so central. The room was small and of course had a charming view of one of Venice's small alleyways. We found shopping near the Hotel to be cheaper than anywhere else after checking prices near Rialto Bridge. I would stay here again as the location is so good and the rooms were clean and serviced daily. We enjoyed breakfast each morning in as part of our stay too. The staff were helpful and friendly", "Date": "November 11, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Sleep Quality": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Lafayette, CA", "Title": "“Great Location”", "Author": "veniceLafayette_CA", "ReviewID": "UR86306112", "Content": "The location of this hotel is great, less than 5 minutes from St. Marks Square. We had a double room on the top floor. It was good exercise for us every day and night. Had a great view of a small intersection with a church, Cartier store and other shops. When the windows were closed it was very quiet. It's true about the shower water covering a lot of the bathroom floor, but it wasn't too bad. Breakfast was fine for us and the service was good. Staff was friendly.", "Date": "November 7, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Pembroke Pines, Fl", "Title": "“Excellent location and good value for Venezia.”", "Author": "mgouker", "ReviewID": "UR84824649", "Content": "This hotel is less than one hundred meters from Piazza San Marco. From the outside it looks like it may be 100s of years old, but inside it is clean and well-maintained. There is no elevator, but that was not a big deal to us. Once we arrived in the room we found excellent accommodations, very comfortable and tidy. It overlooks the tiny street Calle San Bosso, which has a lot of pedestrian traffic and stays noisy until 23:00, but who cares about sleeping early in a city as lovely as Venezia. Our room was adjacent to the timbered overpass. If you are in Venezia and are looking for a practical place to stay but still be comfortable, give the Hotel Orion a look.", "Date": "October 25, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "3", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Sydney", "Title": "“Nice hotel, excellent location.”", "Author": "AndyHSydney", "ReviewID": "UR83281156", "Content": "We stayed here and found the hotel quite pleasant and in an extremely good location sheer meters from Piazza San Marco. The staff are wonderfully helpful and speak English very well. The rooms are on the small side, but that is normal for Venice. There is a breakfast served and it's good enough. Overall I would recommend this hotel to anyone wanting a break in Venice as the price Vs location is hard to beat.", "Date": "October 13, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "3.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Lytham St Annes", "Title": "“Just about OK!”", "Author": "PennyBLythamStAnnes", "ReviewID": "UR81006223", "Content": "We spent 4 nights at the Orion last week and found that a lot of the comments we read here to be true. Without exception the staff were great. All on reception were very helpful, pleasant & did help us with our luggage. Anyone who is slightly infirm please ask for a room on a lower floor. We were on the 4th floor - no lift - so after a day walking around Venice those stairs seem very steep!! The room was small but adequate , very clean & once you have sussed out the shower the bathroom is fine. Just make sure that you clear anything dry before your shower as the water goes everywhere! Breakfast just about passes the adequate mark! Croissants delicious!", "Date": "September 26, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "2.0", "Value": "3", "Sleep Quality": "2", "Rooms": "1", "Location": "5"}, "AuthorLocation": "Bremen", "Title": "“Mixed impressions: central location, small and stinky room. Average service & breakfast. Too expensive?”", "Author": "zimbabwe4ever", "ReviewID": "UR75400132", "Content": "Hi all, well as is often the case, being fair while assessing value for money of any hotel is difficult, as such an individual assessment is normally based on one's own traveling experience and comparison with other locations. Having said that, in August 2010, we spent an extended weekend at this hotel and below is the summary of what we liked/disliked: + central location near St. Mark's Square; + small but good breakfast (though sweet \"Italian\" only); + apparently friendly staff at the reception; + functioning air conditioning, which you really appreciate when being in summer in Italy! - cleanness is only seeming or partial in best case (staircase, bathroom), whereas bed covers & towels are for some reason stinky; - nobody cleaned the room properly during our stay, although we towels were exchanged and beds made; - thin walls, you can hear people walking up and down stairs, talking in their rooms, showering, etc. - no cheese, ham or eggs for the breakfast. The only \"orange\" juice provided was simply undrinkable. - Double rooms are very SMALL. However, in order to make money they put an additional bed in already narrow rooms and sell them as triple rooms - fraudulent, isn't it? Everything was very narrow, walking was simply impeded. Please beware that the fotos show you the hotel rooms of larger size than you'll probably get once there. My conclusion is that this hotel is NOT the best value for money, but alas, I cannot yet compare it with other hotels in Venice, as it was our first visit there. If you're single/couple and are looking for a not very expensive stay in a small room in the city centre, if you have no special requirements regarding cleanness/smell and like sweet breakfasts, then you should probably go for it, but it's definitely not a pleasant family hotel. Hope my review will help you in making a good booking decision!", "Date": "August 16, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "York", "Title": "“Lovely hotel, very central”", "Author": "YorkAmber", "ReviewID": "UR70878097", "Content": "We stayed here for a week in early July. Very nice hotel, good sized quiet room very clean and a good sized bathroom. Breakfast was included and this was also very good. Quick service and plenty to eat. Close to all the sights. Would certainly recommend. clean batroom t at the", "Date": "July 14, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Melbourne", "Title": "“Comfortable, Clean and friendly”", "Author": "lemaCheT", "ReviewID": "UR66525770", "Content": "Located in a perfect location in the heart of Venice just off San Marco square, we had a fantastic two nights here at the end of May. The majority of the staff over the weekend were absolutely wonderful and always pleased to help and assist us. The rooms were clean, tidy and basic, and we would definitely stay there again.", "Date": "June 5, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "3", "Overall": "2.0", "Value": "2", "Sleep Quality": "1", "Rooms": "1", "Location": "4"}, "AuthorLocation": "London", "Title": "“Valuables at risk”", "Author": "UkSazzleb", "ReviewID": "UR63215379", "Content": "The Hotel Orion has a very good location and although everything about this small Hotel was basic, it was clean. Thatâ€™s the good side, now for the badâ€¦ 1. Unfortunately we were located on the second floor, the same floor as the breakfast room, which meant that from 8am when breakfast started we were woken by the noise of plates banging and people chatting. Not a problem if you are an early riser but on holiday you expect some relaxation time. In fact the walls are so thin that I donâ€™t think it mattered which floor your located. I heard the man next door snoring and wardrobe doors being closed â€“ so bring your earplugs! 2. DO NOT leave your valuables in your room. Itâ€™s sad that you have to take them everywhere with you but they are not safe in this Hotel. An expensive and sentimental item of mine went missing from our room which I put in one of my bags. It didnâ€™t leave the Hotel on me or in my hands so the fact that it just disappeared left me very suspicious! The Hotel staff were not very helpful at all, making out as if they were the oneâ€™s being victimised when it was in fact me who was very upset. When we said we were going to write this review and complain to our holiday representatives, we were threatened by talk of lawyers and told they would â€œkick our buttsâ€�. Not nice at all, in fact I was completely disgusted! We got the impression customer satisfaction is not important at the Orion and repeat custom is not a priority due to the amount of tourists that visit Venice each day. Such a shame that our holiday ended on such a bad note, we loved Venice but just wished we had stayed elsewhere.", "Date": "May 4, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "melbourne, australia", "Title": "“very good value for money,clean and tidy,great location”", "Author": "Diana1205", "ReviewID": "UR60375091", "Content": "Hotel orion is a very small hotel in the heart of venice just a short walk from the san marco plaza. The rooms are an average size but there is not lift so be prepared to carry you own bags p the stairs. I found one of the reception staff quiet abrupt but otherwise very helpful. the breakfast was ok and plentiful. The safe in our room was not available as they didn't have a key for us and the internation power plug didn't work either. Overall for the price they charge i do not think you could go wrong with this hotel", "Date": "April 5, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Melbourne", "Title": "“Local Experience”", "Author": "tomskis", "ReviewID": "UR58934317", "Content": "A stay at the Orion is a cjance to be immersed in the local culture. While the room was small (typical); the style and location provides everyhting for anyone not requiring a 5 star level for accommodation. The location was particularly good - central for all directions and destinations. Breakfast only. Only two nights on this occasion, but OK for longer.", "Date": "March 18, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Location": "4", "Rooms": "4"}, "AuthorLocation": "Australia", "Title": "“Clean friendly, location and value”", "Author": "anthroAustralia", "ReviewID": "UR53875234", "Content": "I didn't really enjoy Venice very much but I was very satisfied with the Hotel Orion. It's in a great location just off the Piazza San Marco. It is spotlessly clean and the service is helpfully and friendly with reasonable english. The breakfast is basic Italian, but satifactory. The rooms are not massive but are clean, effectively appointed and well maintained. I feel that the Hotel Orion is good value for what it is (a 2/3 star hotel in Venice) and is a pleasant place to stay. I would have no hesitatation in recommending it to someone who was looking for a hotel in Venice in that bracket. My only criticism is the expensive and not very fast internet. I think they could do better here.", "Date": "January 19, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Location": "5", "Rooms": "3"}, "AuthorLocation": "Brisbane", "Title": "“I love Hotel Orion”", "Author": "MarkCollier", "ReviewID": "UR50476337", "Content": "We stayed at Hotel Orion in September 2006 and had a fab time. Recently we had our house broken into and they took a very lovely little gold enamel ring that I bought from a shop just near Hotel Orion, but I cannot remember the name of the shop. I would really love to hear from people who may have shopped there so I can get the name of the shop and possible contact number so I can buy another ring. The shop was on the opposite side to the street,, but still in Spadaria. It was only about 3 doors down. It sold a lot of different gold enamal pieces. I would really love to hear from people who may know this place. Thanks", "Date": "December 2, 2009"}, {"Ratings": {"Service": "2", "Cleanliness": "2", "Overall": "3.0", "Value": "3", "Location": "5", "Rooms": "2"}, "AuthorLocation": "atlanta, ga", "Title": "“Great Location”", "Author": "zeebraaman", "ReviewID": "UR49629241", "Content": "The location of this hotel if great. Just a few steps from St. Mark's square. The rooms are small and the walls are very thin. We kept getting woken up by people slamming their doors. The breakfast is good. The desk staff is so so. The young man at the desk on the weekends is great and very helpful The older gentlemen is very surly. I asked for directions from him, when I got confused he just started yelling at me. I am not sure if we'd go back to this hotel based on the price and service. Plus the noise. it's a 50/50 decision.", "Date": "November 20, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Sydney", "Title": "“Great location, staff and boutique hotel”", "Author": "scottdamion", "ReviewID": "UR48087626", "Content": "After parent in-laws stayed here and recommended on to us we couldn't have been more happy. The hotel is very very small... but that just adds to the romance of what Venice is all about. We were on our honey-moon trip, shortly after checking in a bottle of champagne was delivered to us as a celebratory gift. Our room was on the 5th floor (I think) which is a walk up with no lift - be advised if stairs are a problem for you, request down low or this is not the place for you. Breakfast was lovely as was the breakfast room and the location is fantastic.. although the hoards of tourists in the square can become very tiring. Staff were always attentive and willing to direct us to the quieter parts of Venice for non-touristy restaurants. I would return here. Not a single complaint.", "Date": "October 29, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Boston, MA", "Title": "“Great location in a great city”", "Author": "claza_9", "ReviewID": "UR45356559", "Content": "Located about halfway between Piazza San Marco and Rialto, Hotel Orion was the perfect base from which to enjoy Venice. We did not stay in the hotel proper, but in an apartment located a few doors down (breakfast was in the hotel). The room was huge and included a microwave and small fridge, couch, table & chairs, plus a desk & chair. Bathroom was also large. The design of the tub was such that no matter what, when you shower, water would end up on the floor, but, thankfully, there was a drain in the middle of the floor. The hair dryer was fairly ineffective, but that was just a minor inconvenience. Stefano and Matteo at the front desk were extraordinarily helpful and patient. Despite its location so close to the tourist-y areas, our room was very quiet. The air conditioning was not particularly strong (which seems to be the norm in Italy), but adequate. Breakfast was the typical fare (croissants, pastries, ham, cheese, cereal).", "Date": "September 28, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Location": "5", "Rooms": "2"}, "AuthorLocation": "London", "Title": "“Location Location Location”", "Author": "carolinebr3", "ReviewID": "UR43047491", "Content": "The hotel came to my expectation. It was a pre cruise visit and I stayed two nights. Very easy to get to from San Marco Airport. 10minutes walk under the shades (no shuttle bus) to the water and took the ALILAGUNA to San Marco. There are 3 lines. The fast and expensive one (25 euros) or two others (13 euros) taking over an hour. As it was my first visit to Venice, I decided my holidays started from the minute I got on board and enjoyed the ride via Murano and other stops on the way. Stop at the 2nd stop in San Marco ( not Zaccaria. The stop is just pass the square) If you follow the hotel direction, very easy to find. 5/10 minutes or so, through the Torre Dell' Orologio, 1st right then 2nd left. Hotel is further along, near the end on the left. I am a single traveller but I got a double bed with a window facing San Zulian Church/ square on the 3rd floor. I was help with my suitcases. Room was small but big enough. Yes the bathroom is small and a bit passÃ© but nothing wrong with it. Breakfast was also adequate, fresh pastry (yes only one) and bread + cereals and tin fruit. I did not mind, I did not go to Venice to have a feast. I loved Venice. I loved the location, so close to everything. I felt safe. I had to pay as soon as I checked in. I paid cash so I hope I will not have the problem other guests had. I am still waiting for my credit card statement! Overall a very pleasant stay. I will add that there is NO transfer from San Marco direct to the Stazione Marittima on week day. Apparently only on saturday! I took a waterbus to Piazzale Roma and then walk for 15mn to the Marittima. Not the best but it was ok. I was too excited to care. One can get a cab for 10/15 euros from Piazzale Roma.", "Date": "September 20, 2009"}, {"Ratings": {"Service": "1", "Cleanliness": "2", "Overall": "1.0", "Value": "1", "Location": "4", "Rooms": "1"}, "AuthorLocation": "boston", "Title": "“PLEASE BEWARE”", "Author": "biancarussells", "ReviewID": "UR38774433", "Content": "We stayed in this hotel,first we had booked 2 months in advance and for 2 quadruple rooms,stefan(works morning with glasses) send and conformed it,when we arrived he was shouting that he did'nt see my mail and he later realise he had conformed 2 quadruple rooms ,but now he has 1 room triple and one quadruple we were 2 families with 2 small children we had no choose ,we had to sleep in a small room for 3 ,but he charged us for quadruple room.This guy has anger issues. We paid him in cash,when we came back yesterday and saw he has also charged our credit card bill $340+10( exchange charge),when i called him ,he started to shout even though i was polite as i wanted to clear this issue,but he just hung up,so please beware giving your credit card as i am trying to resolve this by my bank,this was suppose to be a vacation,but now i have to run around resolving it. Another thing the don't have elevated so we had to carry everything to the 3rd floor.", "Date": "August 25, 2009"}, {"Ratings": {"Overall": "3.0"}, "AuthorLocation": "Australia", "Title": "“GREAT LOCATION SMALL ROOM FRIENDLY STAFF”", "Author": "ShaneandRose", "ReviewID": "UR35892417", "Content": "This hotel was only 1 block from the action - St Marks Square. All the shops, cafes, restaurants and transport were just outside the door. The breakfast was good and the breakfast lady extra generous with the croissants. (You were usually only allowed one!) The desk staff were friendly, kind and helpful. The room and bathroom were small but warm. There was a TV but no lift. The bed was only a double bed. When you opened your window in the Hotel Orion you couldn't help but be swept up in the buzz of this vibrant, romantic city.", "Date": "July 27, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "NE England", "Title": "“We'll definitely go back to this hotel!”", "Author": "PatandJo", "ReviewID": "UR29476940", "Content": "We stayed for four nights - a lovely hotel, excellent value for money for a hotel so close to both San Marco and the Rialto. Nothing was too much trouble for the staff - they carried our suitcase up to the room, arranged an early breakfast for us on the day we left and even wished one of our party a happy birthday when they saw the date of birth on her passport!! We were able to come and go as we pleased - very useful for dropping off shopping during the day! Having stayed in many budget hotels in Europe we were very impressed with breakfast - fresh bread rolls and delicious pastries ( why would you WANT more than one?) as well as a wide range of other items. We can't recommend this hotel too highly - if you want a reasonably priced very central hotel. It is the perfect base for exploring this wonderful city and we intend to stay there the next time we visit Venice.", "Date": "May 6, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Location": "5", "Rooms": "3"}, "AuthorLocation": "hoddesdon", "Title": "“basic but comfortable”", "Author": "steve010Hoddesdon", "ReviewID": "UR28694780", "Content": "The hotel is in a great location a stones throw from St Marks Sq ,and easy walking to Rialto Bridge , Bedrooms are small but tidy , breakfast is continental croissants rolls, ham and cheese coffee etc , so don't expect bacon and eggs , and you only get 1 croissant you have to pay extra for more which is a bit mean , Staff very friendly , and there is no drinks bar , only downside was the church opposite ,that rang the bells at midnight and 7 o'clock in the morning , ok if like my girlfriend can sleep through a hurricane , all in all a great little hotel but if you like a bit of luxury you will have to spend a bit more .", "Date": "April 24, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Scottish Highlands", "Title": "“Central location ideally situated for everything”", "Author": "Bonnevillebiker", "ReviewID": "UR27794097", "Content": "Our stay at Hotel Orion was wonderful. Staff could not have been more friendly/helpful - booking trips/excursions for us. Rooms meticulously serviced daily. Plenty to eat with many choices at breakfast.", "Date": "April 11, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Business service (e.g., internet access)": "3", "Check in / front desk": "4", "Overall": "4.0", "Value": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Melbourne", "Title": "“Fantastic location, friendly staff”", "Author": "CZAustralia", "ReviewID": "UR21689267", "Content": "I loved this hotel! It is in the heart of Venice, being just a hop, skip and jump from St Mark's square. Stay here if you want to be in the heart of a magical city, value cleanliness, expect friendly service and can afford to pay a moderate price. Don't stay here is you expect five star accommodation. There were three of us staying in the room on the first night, and two of us for the remaining four nights. The staff kindly arranged it so we would not have to change rooms, so we has a large room for two people for the majority of our stay. Cleanliness could not be faulted. I was very impressed with the staff. They were helpful when we had a change in the number of people staying in the room, and provided honest appraisals of restaurants, suggesting that we travel further away from the hotel to get better quality and cheaper food. They were always pleasant and friendly. I was particularly grateful to the waitress in the breakfast area, who let us have breakfast outside of breakfast hours because of our early departure. Breakfast was standard for Europe, but adequate. They do serve you your pastry, so don't try to help yourself. There is an additional charge if you want an extra pastry. Go early if you want a cream-filled pastry, as these were the most popular. Unfortunately, there was no lift. As we were staying on the fourth floor, this meant lugging our heavy suitcases up the very narrow staircase. Not much fun, but to be expected in a less expensive European hotel. The other minor issue was noise. You can hear people walking up / down the stairwell during the night, but we didn't go to sleep until after 11.00pm, and the noise had settled by that time. We had a very annoying neighbour who unfortunately decided to speak on her phone at 2.00am in the morning whilst in the hallway, which did wake us. The beds were acceptable in terms of comfort, but not brilliant. This was my second time to Venice, and staying in the heart of Venice made this a memorable and enjoyable experience. Being able to walk by St Mark's square by night as the orchestras play out front of the cafes, devouring a gelati, strolling by the canals... Ahh.... A truly magical experience. Remember that, given its location, this is a very cheap hotel, so don't expect all the bells and whistles. Instead, enjoy and soak in the atmosphere of being in the heart of one of the world's most beautiful cities. As for finding your the hotel, it was very easy if you have directions! Face the basilica. On your left, you will see a big clock tower. Walk through the clock tower, and turn RIGHT down the FIRST street. Then turn LEFT down the FIRST street (there is a shop on the corner that sells toy cars). You will see hotel orion on your left side, about 50m down the street. It has a lamp above the door, and is across the street from a food store. It is a 2 min walk from St Mark's square.", "Date": "November 10, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "3", "Check in / front desk": "4", "Overall": "4.0", "Value": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Jacksonville, FL", "Title": "“Nice Place”", "Author": "citrob", "ReviewID": "UR20888722", "Content": "The other reviewers are right on target: location is fantastic, friendly staff, and nice breakfast. But I had to really think about whether to give 3 or 4 stars. The bed and pillows weren't very comfortable and it can be a bit noisy. Noise levels really depend on the courtesy of other guests. Also, our shower was a bit awkward with the molded seat/bathtub configuration. I expect and am used to small European showers, but standing and exiting this shower was difficult. However, I give 4 stars for location, value, and cleanliness. It's easy to get to, it was nice to have clean towels everyday, and price was reasonable. And as for bed comfort, falling asleep is made easier by walking around Venice all day and into the evening.", "Date": "October 15, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "4", "Check in / front desk": "5", "Overall": "4.0", "Value": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Northants", "Title": "“Great location”", "Author": "BruceNorthants", "ReviewID": "UR20450850", "Content": "We have just returned after spending four nights in Venice, what a lovely city to explore! Hotel staff were really helpful and friendly, the breakfast room is quite small but offers a nice breakfast and the rooms were cleaned daily to a high standard. The hotel is in a really good central location which is great for getting around the city and seeing what Venice has to offer although it is also the most expensive area in Venice too!! If you don't want to pay the high tourist prices avoid the restaurants close to the hotel, we asked the man on reception where the best places to eat were and he gladly told us which area to go to. The rialto market is worth a visit if only to get some cheaper bottles of drink etc. The public transport ie the water buses offer a fantastic way to get around the city they run all day long till the early hours and have a regular timetable running every few minutes.", "Date": "September 28, 2008"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Business service (e.g., internet access)": "2", "Check in / front desk": "3", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Airlie Beach, Australia", "Title": "“Great location”", "Author": "croftonMelbourne", "ReviewID": "UR20356369", "Content": "We stayed at Orion Hotel for 3 nights. We are a mature couple who like to explore on foot, getting the real flavour of a city, its people and culture so we tend to research the location where we wish to stay thoroughly. We describe ourselves as backpackers at heart who have matured to enjoy reasonably comfortable accommodation. We chose Orion because it is conveniently located near St Mark's Square and within easy walking distance of reasonable quality, low cost restaurants (if there is such a thing in Venice) and to the Rialto area. The hotel staff were always helpful and enjoyed breakfast in the breakfast room (but don't try to help yourself to a second Danish pastry!!!. Desk staff helped with local tour bookings and directions. The room was comfortable, bathroom was clean, a fridge in the room and air conditioned. The room was serviced daily and whilst our chosen price range does not provide 5 star sparkle, the hotel was clean and comfortable with a good shower. We will return to Orion without hesitation.", "Date": "September 24, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Florida, USA", "Title": "“Great location/Great Staff”", "Author": "OnePlanetgirl", "ReviewID": "UR17772899", "Content": "Ten of us stayed for 2 nightsin in June, 2 quadruples and one double room. All of the rooms were simple but much bigger than expected, specially for a quadruple in Italy. The rooms were very clean . We booked this hotel because of the price, location and as its recommended by Rick Steves. We were not disappointed. The breakfast room is small but food was fine.Thebest part, was the friendliness of the staff. Our party of 10 had to leave early in the moning to catch the train. Our departure was before the breakfast room opened. Upon informing the front desk staff of our departure time, he proposed delivering breakfast to go. The staff delivered 10 individual bags of non perishable food the night before our departure. It included cookies for the kids. We ate this breakfast on the train and were really appreciative of their generosity. I would highly recommend this hotel.", "Date": "July 11, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Scotland", "Title": "“Great location”", "Author": "miffi28", "ReviewID": "UR14100435", "Content": "The Orion Hotel is in a fantastic location you really couldn't ask for better, our room was spotless and so was the bathroom although the shower was very small but we had such a fantastic time it wasn't really an issue! The staff are really friendly and helpfull and the breakfast in the morning was lovely. I have not long returned home after spending the weekend in Venice with my boyfriend and I would definately recommend the Hotel Orion to stay in. I read some of the reviews before I went and was a bit worried about the noise that had been reported but we were never really bothered by noise, I suppose it really depends on how easily annoyed you are, the bells in the morning were far noisier but added to the experience! I can't praise the Hotel enough and Venice itself is absolutely stunning albeit very expensive but worth the money", "Date": "March 6, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "3", "Check in / front desk": "5", "Overall": "2.0", "Value": "3", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Birmingham", "Title": "“Excellent Location, Pity About the Noise”", "Author": "TheGreatFlyingKiwi", "ReviewID": "UR13087327", "Content": "This Hotel has a lot going for it considering the great staff and ideal situation. However, three of the four nights we resided at Hotel Orion were disturbed by noise, not from outside but from inside the hotel. The stairwell (there is no lift) is completely open and not far from the rooms above. Everyone who came into the hotel had to go up the stairs (our room was on the first floor) and the click-clack of shoes on the hard surface wasn't something that could be ignored easily. On top of this, guests thought it was acceptable to talk loudly while going up the stairs and outside the rooms. This wouldn't be so bad if the stairs weren't so close to the rooms (there are no real corridors, just the stairs). The phone at reception also rang a couple of times at very early hours of the morning. Again, the open plan of the stairs meant this noise reached our room quite loudly The room was nice, just enough for hat we were doing, although the only English channel was CNN (I am so over the US Presidential elections.) Breakfast was simple, nice and got us started in the morning. The ladies in the breakfast room were great, helpful and proved that staff are the best part of this hotel. I wouldn't stay there again... just because of the noise factor but did have a great time in Venice nonetheless.", "Date": "January 29, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "London", "Title": "“A Gem of A Hotel”", "Author": "Zyryab", "ReviewID": "UR13019277", "Content": "This little hotel deserves more than the two stars awarded to it. The rooms could easily be 3 or 4 star. The best thing about this little place is the fact that it is so central. It sits literally two alleyways behind the main Piazza San Marco and in the middle of the shops that continue towards the Rialto area. You can easily walk past it and miss it -- the entrance is very narrow from the main alleyway -- but inside it is very smart and looks like it has been done up recently (smart marble etc.) We had a double-bed room with an extra single bed for our toddler. The rooms were immaculately clean; there was a flat screen tv (about 15 Italian channels plus CNN; warddrobe was a bit small; the ensuite bathroom was fully functioning: very powerful shower; hairdryer and a bide (for those who use one). When we went it was very cold (about 2-3 celsius), so it was nice to have the electronic climate control heater which you can adjust to your liking. Breakfast is in a room on the second floor (8-10am): you take your place at the table and a lady brings you a selection of brioches to choose from and takes your hot drink order; in front of you will be a tray of jams, butter, cheese triangles, nutella, edam, pate, various teabags (herbals etc). and a basket of bread rolls. This seems to be a family-run hotel and they are all extremely helpful and delightful -- on the night we arrived, they happily gave us a carton of milk for our daughter. There is no lift, but we didnt need one and we always left the pushchair on the ground floor, everytime we came back in the evening. Again, it is perfectly placed because you could be shopping on one side of town (mid-January is sales time in Italy!), drop off your bags at the hotel and carry on to the other side. Also on the day of departure our plane was at 8 in the evening (hotel check-out is at 11:00am) but they let us leave the bags without a fuss (we actually came back a couple of times and stuffed the bags with more shopping even though we had checked out). I would recommend this hotel for singles, couples and small (3person) families who do not want to spend on 3or 4star places. Would definitely return if ever in Venice again!", "Date": "January 26, 2008"}, {"Ratings": {"Service": "2", "Cleanliness": "4", "Check in / front desk": "4", "Overall": "3.0", "Value": "3", "Rooms": "4", "Location": "5"}, "AuthorLocation": "washington", "Title": "“Nice Location”", "Author": "Gotravler", "ReviewID": "UR10557189", "Content": "The Orion was in a nice location. We had a nice room, but have to agree on the shower issue. A big clue was a drain in the middle of the bathroom floor. The shower was small and the curtain around it didn't really hold in much water, so water went everywhere. Also, no lifts and hauling luggage up and down the staircases was not fun. The hotel staff was friendly, but not very helpful on some information. They gave up directions to the Post by telling us it was an old building by the Rialto Bridge and was not marked. We never did find it, but on the last day, I found one right off San Marcos on the way to the water bus. They also provided train times for me, but none of those trains left from the SL station in Venice, so I ended up waiting two hours at the train station for the only train heading back to Rome. Because of the misinformation, I am not sure if I would stay there again or not as I don't know if they purposely misinformed us or were clueless.", "Date": "November 3, 2007"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "merseyside", "Title": "“very good hotel experience.”", "Author": "sultana_7", "ReviewID": "UR10080291", "Content": "We have just returned from a 5 night stay at this hotel. I found on line directions under the clock tower 1st right 2nd left towards the end of the alley just before the arch with a lantern over the door so it was very easy to locate. It was thoroughly excellent. The staff were very friendly and helpful and worked in a very quiet way. The breakfast in a well appointed although small dining room on the 2nd floor was superb value with an excellent variety of choice including cereal and cream cakes! Breakfast was priced at 6 euros if you hadn't got an inclusive price and it was far superior to breakfasts we were served for 8 euros in some French hotels during August this year. The room was small but very clean and comfortable with a mini bar, safe , and air conditioning although not needed in October. It was calm and quiet so sleep was not disturbed by noise from the street below.There were fluffy clean towels every day and the en suite shower room although small was perfectly adequate.The shower was pretty good although on occasions the temperature could change. For a Venice hotel it was excellent value in a great position within the city and I could thoroughly recommend it.", "Date": "October 15, 2007"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Check in / front desk": "4", "Overall": "3.0", "Value": "3", "Rooms": "2", "Location": "5"}, "AuthorLocation": "Northants UK", "Title": "“Great Location but absolutely tiny”", "Author": "nuttah", "ReviewID": "UR10066339", "Content": "Having chosen the cheapest hotel from the BA Holidays website for Venice and after having read the other reviews on here, I was slightly apprehensive about what this hotel would really be like. Firstly, its easier to find than you think. Walk under the clockface on San Marco and turn back on yourself when you reach the Cartier shop - the hotel doorway (and it is only a doorway) is almost opposite a small bar and a wonderful shop selling sweets and biscuits and melted chocolate by the cupful! This hotel is TINY! It is in a good location, right on the busy shopping street and literally 2 minutes from San Marco. The reception is all pale marble and there is a tiny courtyard out the back for smokers. Our room was on the 1st floor and it was extremely small. It was, however, clean and as there had been lots of rain over the previous days, there was a useful mosquito repellant left in our room. The air conditioning was fierce and also did a good job of killing any bugs in the room at night. The bathroom was a cupboard. The shower/bath had a nasty slope in it which was pretty dangerous as you couldn't really see it before you stepped in and I slipped a couple of times. The toilet seat was broken and the extractor fan sounded like a freight train running through the building. Not a great experience. Towels and toiletries were provided and were all fine. We found the hotel reception very polite and had no problems checking in or checking out and the 1 item we had from the minibar (Yes there was a minibar!) they forgot to charge us for. All in all this was an adequate hotel but still pricey for the size and quality. I would pay more to stay in a 3* hotel further away from San Marco next time. Venice is a great city though and we had a wonderful time overall.", "Date": "October 11, 2007"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Check in / front desk": "3", "Overall": "3.0", "Value": "3", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Northern California", "Title": "“Cute and convenient with great cappuccino's!”", "Author": "jamie_sommers", "ReviewID": "UR8368284", "Content": "This hotel was charming and we really loved the breakfast -- in a cute room that actually arches over the street. The cappuccino was lovely. However, other people who have written reviews here must have had better rooms than we did. Ours was quite small and the bathroom was funky. It was a small room containing all of the basics, except that the shower was just a shower head mounted on the wall -- you closed a little curtain on a track and took a shower in the middle of the bathroom -- no little curb to keep the water in or anything. The result is that if you showered you got the entire bathroom floor soaked. The curtain also tended to close in on you, which was icky. It was already so humid outside! Drying took a long time. Also, our room was right through the wall from the breakfast space -- luckily they didn't start breakfast until later in the morning than would be the case in the US -- so it didn't disturb us too much. We were pleased that the air conditioning worked well -- it was VERY hot while we were there, so it was a huge relief. Also, the room didn't smell musty or anything, which is really quite amazing.", "Date": "August 7, 2007"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Business service (e.g., internet access)": "3", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Melbourne", "Title": "“Gorgeous hotel, great location and very friendly staff!”", "Author": "NalaMelbourne", "ReviewID": "UR8272512", "Content": "Hotel Orion was such a gorgeous little hotel. The location was absolutely perfect, 1 minute walk to St Mark's Square and 5 minute walk to Rialto Bridge and right in the heart of all the designer shops! The staff were really friendly and helpful and possibly among the nicest hotel staff we met on our 6 week holiday around Europe. We found our triple room fine for three people, we understood that it was a little bit smaller than normal due to Venice being a small island and everything being quite packed in, so that was fine. The room was very well air conditioned which was great because it was very hot when we were in Venice. Our bathroom overlooked the cute little street below the hotel and we could see St Mark's Basilica from our window. It really was beautiful. Breakfast was okay and compared to all the other breakfasts we had on our holiday it was probably one of the most stingy in terms of what you got - you were limited to 1 croissant or muffin each and if you wanted more you would have to pay. But you could have other things like yoghurt and cereal as well and it would all fill you up fine. The coffee here was probably the best coffee we had in Europe! I would highly recommend this hotel to anyone, it was beautiful, really cute, lovely staff and perfect location.", "Date": "August 1, 2007"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Check in / front desk": "4", "Overall": "4.0", "Value": "3", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Peoria, Illinois", "Title": "“Tiny Shower, Big Service”", "Author": "gb1967", "ReviewID": "UR8214772", "Content": "My family checked into two triple rooms at the Hotel Orion this July. The rooms were large and very clean. The third bed in each was little more than a glorified army cot. My 4 year old decided it was ok for a Barbie doll, but she opted to cram into bed with her dad. The double bed was two twin beds pushed together, but made separately. Ok for us, but it wouldn't be optimum for a couple on a romantic get-away! The bathroom was clean and not too small but the shower was a joke. The bathtub was the perfect size for a small child but in no way the right size for an adult. We did not have a shower curtain; we had a folding \"door\" that was not on a track and could only be opened or closed from outside the tub. We tried one shower with that thing closed but it made it impossible to even turn around. After that we just did our best not to spray water all over the bathroom. The morning after checking in, we learned that there had been a problem with the credit card used to reserve the room months in advance. The clerk tried to reach us but could not. While he technically could have given away our rooms, he trusted us and held them for us even though we arrived much later than expected because of train delays. That alone made the showers easier to deal with. Plus, the price (150 euros a night per room, breakfast included) made it alright. I don't know that I'd want to spend more than a few days there but it's a great location, clean and has a good staff for anyone needing a place for a short trip to Venice.", "Date": "July 22, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Business service (e.g., internet access)": "3", "Check in / front desk": "5", "Overall": "4.0", "Value": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Sydney Australia", "Title": "“Nice little hotel - quiet a surprise”", "Author": "cheedz", "ReviewID": "UR8054736", "Content": "ok at first you think oh no what have i done the hotel is tiny and shabby looking from the outside. Then you go up lots of stairs to your room - which is quiet big for a european hotel room. It is clean and the views are nice. Service was great - room was clean and best of all it was dirt cheap and located in the heart of venice - you honestly cant ask for more! Stay here and you wont be disappointed!", "Date": "July 4, 2007"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Business service (e.g., internet access)": "3", "Check in / front desk": "4", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Middlesbrough", "Title": "“Simple but best”", "Author": "Gadgy", "ReviewID": "UR7940181", "Content": "Nice hotel well situated but only for those who like a cosy comfortable atmosphere.I'ts tiny entrance in a side street ,almost off St Marks square ,could easily be missed but look for the lantern above the door to easily locate it.A small vestibule leads to a surprisingly spacious interior.We had a top (4th) floor room which was clean and suited our short stop over with ensuite facilities.The shuttered windows looked out to views of the meandering shopping street below and across the rooftops to St Marks domes. If you like picturesque this is the place.But be warned after a day out tramping the city it's a long haul up to the 4th floor as there is no lift.Breakfast was continental style in a spotless, inviting ,dining room on the 2nd floor (maybe a tip for those who like to be handy ).I'd love to go back again and I would take the 4th floor again just for the utter romance of the rooftops of the city.The local small eating places are excellent value for snacks, look for the ones that have doormen or gondolieres taking their break inside.", "Date": "June 20, 2007"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Business service (e.g., internet access)": "4", "Check in / front desk": "5", "Overall": "4.0", "Value": "4", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Albany NY", "Title": "“Lovely”", "Author": "LoveToTravelAlbanyNY", "ReviewID": "UR7795458", "Content": "Hotel Orion is lovely . . . . nestled on a relatively quiet (as Venice goes) street, it is very comfortable and provides a nice base for activities. The rooms are small but very clean and very comfortable. The staff are friendly and accomodating. Breakfast was very nice. I would definitely recommend this hotel. We found that the OASIS restaurant (behind the Bascillica) was excellent! Great, fresh organic food and reasonably priced!!", "Date": "June 6, 2007"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Business service (e.g., internet access)": "4", "Check in / front desk": "4", "Overall": "4.0", "Value": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "London", "Title": "“Fabulous Location....”", "Author": "Bella1968", "ReviewID": "UR7478306", "Content": "The Hotel Orion is smack bang in the middle of everything, just 1 minute or two from San Marco square and within easy reach of the vaporetto, Rialto bridge, shops and everything. The people on the front desk (open 24 hours) were friendly and keen to help. The hotel is small and tall.. so you normally have stairs to climb. We were on the 2nd floor, so that wasn't too bad. The rooms were totally adequate, clean and fresh. The bathroom is again adequate. Breakfast was served from 8am to 10am in a room on the 1st floor. the staff would seat you at a table and provide you with a croissant or pastry, 2 bread rolls and a hot drink of your choice. If you want any additional hot drinks, there is a charge. cereal was also available. A nice selection of individual cheese portions and jams are also provided. I would recommend the hotel mainly for the prime location. I felt really safe in Venice, even walking around at night, through the dimly lit alleyways... everyone MUST go to Venice....", "Date": "April 28, 2007"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Inverness Scotland", "Title": "“Great Hotel Great Location”", "Author": "Keith P", "ReviewID": "UR7351148", "Content": "Just back from four nights stay in the Orion. Great experience the staff were excellent and coped well with our lack of Italian as tehy all had excellent English. We were in the apartment San Marco which gave us a very private and quiet room. The street noise is to be expected in these narrow streets. The decor was very clean and simple and the facilities all worked well. It seems to have been refurbished very recently. The location is excellent a short walk from St Marks so central to everything and easy to find. From the square under the blue clock turn right take the next left past the toy car shop and about 200 yards ahead opposite ice cream shop. Break fast very busy and croweded but adequate and staff again very helpful in supplying what you request, even when requested in English. Well worth a stay.", "Date": "April 14, 2007"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Check in / front desk": "4", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Sacramento", "Title": "“I recommend Hotel Orion”", "Author": "SusieTraveler", "ReviewID": "UR7348453", "Content": "We (two of us) stayed at this small hotel in March 2007. The service was courteous, breakfast (8-10 am) was included. Location is great--5 minutes of walk from either Piazza San Marcos or Rialto area, close to Grand Canal ferry stop. Room was clean and streets around us are safe and stores upscale.", "Date": "April 13, 2007"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Check in / front desk": "4", "Overall": "3.0", "Value": "3", "Rooms": "2", "Location": "5"}, "AuthorLocation": "South of France", "Title": "“Great Location !”", "Author": "travel&co", "ReviewID": "UR7197444", "Content": "The location is great ! Less than 5 min from San Marco Plaza, it's ideally ! The personal was pleasant and friendly but our room was small and the bathroom even more ! The breakfast was good but nothing too fancy. No noice from the street but sometimes we were sharing much more with our room neighbours than excepted... Nevertheless, we enjoyed our stay, mainly because of the great location !", "Date": "March 21, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Ireland", "Title": "“Excellent”", "Author": "shanshan4ever", "ReviewID": "UR6688209", "Content": "2 mins from st mark sq. excellent location. room was very clean and new. staffs was very good. good value", "Date": "January 24, 2007"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Check in / front desk": "4", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "London", "Title": "“Perfectly good tourist hotel for exploring venice”", "Author": "jimthetraveller", "ReviewID": "UR6081106", "Content": "This hotel is perfectly located for a short visit to Venice. We stayed for 2 nights. The hotel is located in the maze of streets just to the north of St Marks Square (From the square, go under big blue clock, take the first right and second left by a shop with toy cars in the window, the hotel is end the end of this shop lined ally just before you get the arch. In fact our room was in the arch. Look out for the light above the door). So the location is excellent, 2 mins from San Marco, near shops, canels and a lovely 15 minute walk from the Rialto bridge as well. There was some confusion at check-in. Originally placed in a large twin as soon as we unpacked we were moved to a very small double (something to do with bookings in a similar name) which wasn't a great start. However when we returned home later the Hotel had left some complimentry Asti for us which was very nice and made up for the confusion. The room itself was small but very clean and in a good state of repair. Note there is no lift but there is a porter. We didn't use the breakfast room. The staff were friendly. Being November it was a bit chilly but the hotel was very warm with thick double glazing and very dark shutters. Also the windows keep the noise of the streets below (and church opposite) completely out. This hotel is perfect for a short visit to Venice as if you want to be in the heart of the city and will not spend time in your room. We will use this hotel when we return to Venice.", "Date": "November 7, 2006"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Check in / front desk": "4", "Overall": "4.0", "Value": "3", "Rooms": "4", "Location": "5"}, "AuthorLocation": "South Carolina", "Title": "“Good location”", "Author": "jaredw", "ReviewID": "UR6063699", "Content": "As far as Venice goes, I guess you can't beat Hotel Orion. Clean room, nice staff, good location, etc. The rooms were small, but that's just Europe. We only stayed one night, so it served the purpose wonderfully.", "Date": "November 6, 2006"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Check in / front desk": "3", "Overall": "4.0", "Value": "3", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Brisbane", "Title": "“Great location”", "Author": "RicandKathy", "ReviewID": "UR6012579", "Content": "We caught water public transport (1 hr 20 min trip) from the airport to Piazza San Marco and the hotel is an easy, flat 10 minute walk from the wharf. It is also a 10- 15 minute walk with luggage from the Grand Canal which has public transport to the railway station, but there is one bridge with approx 20 steps to cross on the way. The reception staff spoke English. Our room was very comfortable and of about 3 star standard. The bathroom was clean but the two level bath made standing while showering a hazardous exercise. I would not recommend this for people with balance problems- also there was no lift access to the rooms. The breakfast was of a good standard as was the coffee. We would recommend this hotel for the location.", "Date": "October 25, 2006"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Check in / front desk": "3", "Overall": "4.0", "Value": "3", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Sydney, Australia", "Title": "“Gorgeous Hotel...”", "Author": "prisky", "ReviewID": "UR5954459", "Content": "This is one of the best hotels I have stayed in while travelling around Europe. The room was not a standard, it was a superior/deluxe located on another building about 5 metres from the main building. Location wise, this hotel is perfect. 5 minutes for St Marcs square. There a many many restaurants and shops within a few steps. The room itself was very posh, with gorgeous furniture. The bathroom was one of the biggest I saw during my 3 weeks of travelling. Breakfast was tasty with the basic continental breakfast. The staff were very friendly and helpful. I would recommend this hotel to anyone. Great Place!", "Date": "October 14, 2006"}, {"Ratings": {"Overall": "3.0"}, "AuthorLocation": "Bolton, UK", "Title": "“Great location, great value for money!”", "Author": "burndenrover", "ReviewID": "UR5763052", "Content": "As other people have mentioned this hotel is in a great location. The staff are very efficient - especially the cleaning staff - and will go out of their way to help if necessary. The rooms are fine, with the benefit of air-conditioning which allows you to close the windows at night. The shutters outside are also useful if you do not like too much light too early! We had a problem though with storage space which was minimal and as we were there for a week we ended up utilising one of our suitcases, which was far from ideal. As has also been mentioned, the shower room is very small but you do get used to it. It helped that it was kept spotlessly clean. A bath mat would have been useful as the tiles get damp with the steam from the shower and if you did not dry your feet properly you could have problems on the tiles in the bedroom! Also, the toilet seat was loose and, although we mentioned it a couple of times, it was still loose when we left. The main problem we encountered was due to the lack of sound insulation in the hotel. When we were trying to get to sleep we were disturbed by the sound of banging doors, drawers being slammed shut and even the conversations of the people in the surrounding rooms (even the ones above!). This was at times between 12.30am and 4 am (!). I realise that if the other guests had had the courtesy to consider others and keep unnecessary noise to a minimum then there would have been no problem but, unfortunately, some people are inconsiderate and the hotel should have taken this into account. All in all it is a lovely little hotel in a great location and I will definitely recommend it to others. One hint - buy a Venice card. You can order them online to collect when you get to the airport. You can get one that includes travel to and from the airport by Alilaguna. It will save you time and money on waterbuses and entrance to museums and churches. Also, get out and explore. We found some delightful little places hidden away ffom the main tourist areas with some bars and cafes that were little gems.", "Date": "September 2, 2006"}, {"Ratings": {"Cleanliness": "5", "Overall": "4.0", "Value": "5", "Service": "5", "Rooms": "4"}, "AuthorLocation": "Cincinnati, Ohio", "Title": "“Great location!”", "Author": "tazi1221", "ReviewID": "UR5464213", "Content": "While in Venice we stayed at the Hotel Orion. The hotel was very clean, and were wonderful about our arrival very late at night. We stayed on the 4th floor, which was quite a few steps with our luggage as there was no lift. It was not bad if you can handle taking your luggage up once and down once! The beds were very firm, and the bathroom very tine (not unusual in European hotel rooms). We did have trouble getting hot water and any water pressure in the shower sometimes, but we just rolled with it. The best thing about this hotel is that its location absolutely cannot be beat!!! It is just seconds off of St. Marks Square. Actually staying in Venice at night is worth it because you can experience the romance of Venice without all the crowds and tour groups. We enjoyed listening to the orchestras in the Square late at night. A great restaurant if you are looking for a recommendation: Ristorante al Paradiso. It is just over the Rialto bridge to the left on Paradiso. Phenomenal food- the best we had in Venice!", "Date": "July 13, 2006"}], "HotelInfo": {"Name": "Hotel Orion", "HotelURL": "/ShowUserReviews-g187870-d237373-Reviews-Hotel_Orion-Venice_Veneto.html", "Price": "$87 - $260*", "Address": "<address class=\"addressReset\"><span rel=\"v:address\"><span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">San Marco Spadaria, 700/A</span>, <span class=\"locality\"><span property=\"v:postal-code\">30124</span> <span property=\"v:locality\">Venice</span></span>, <span class=\"country-name\" property=\"v:country-name\">Italy</span> </span></span></address>", "HotelID": "237373", "ImgURL": "http://media-cdn.tripadvisor.com/media/ProviderThumbnails/dirs/db/03/db0381177f74551e7bcf3f54af4b124f7large.jpg"}}