{"Reviews": [{"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "3", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Yorkshire", "Title": "“Fab hotel”", "Author": "LottieJPops", "ReviewID": "UR128157150", "Content": "We have just returned from a four night stay at this hotel and we were very pleased. We had room 234 and it was huge! Lovely view of Centraal Station out of the window. Staff were pleasant and we had a huge, delicious breakfast. Extremely good value for money, we stay in Amsterdam regularly and the room we had last time (in a different hotel) was about the same size as the bathroom here! Five minutes from the centre of Amsterdam and the trams are just round the corner. Would stay here again.", "Date": "April 19, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "5"}, "AuthorLocation": "southampton, england", "Title": "“Hotel was ok, the staff was rude”", "Author": "syazwanii", "ReviewID": "UR127928743", "Content": "The hotel was fine, but the staff was very annoying. . I did send an email to the hotel, asking for a baby coat for my 1 year old daughter. But, during the day I checked in,he did shout at me and was very angry about my 3 years old son. I showed to him the regulation stated in booking.com website saying that ALL children less than 4 years old can stay for free when using the existing bed. He said 'I don't care !' . I don't understand how people could entertain their guest in that manner. He really spoiled my holiday, and for the rest of my life, I swear to God, I won't stay in that hotel anymore.and for those who want to spoil their holiday, they should stay in that hotel.", "Date": "April 15, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "2", "Sleep Quality": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Mafikeng, South Africa", "Title": "“Can recommend”", "Author": "Johann0909", "ReviewID": "UR126905117", "Content": "Good location for a city visit. A bit on busy side of town for us but we had a nice, clean quad room with large bathroom for the 4 of us for 1 night before leaving for Germany the next day. Breakfast was a bit on the thin side, but sufficient. Can't say anything bad about the Hotel.", "Date": "March 29, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "", "Title": "“Excellent budget hotel”", "Author": "Awfy", "ReviewID": "UR124792424", "Content": "Perfect location near to main station, good breakfast included, pleasant bar in brown cafe style, not luxurious but good value for money.", "Date": "February 19, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Location": "5", "Rooms": "3"}, "AuthorLocation": "Wigan", "Title": "“Great location”", "Author": "Stetcg", "ReviewID": "UR124755750", "Content": "Decent hotel clean with the basics you need in a great location opposite Central Station on the edge of the Red Light Area. The guy on reception is quite a character and may not be to everyones taste but we loved him. All in all worth a stay if your in the Dam for a few days.", "Date": "February 18, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "", "Title": "“Clean, Large Rooms, In the Heart of Town, Where Jazz Trumpeter Chet Baker Spent His Last Evening On This Planet.”", "Author": "Doodyjazz", "ReviewID": "UR124540734", "Content": "Prins Hendrik Hotel is situated right across from Centraal Station, and at the Northern end of Zeedijk (Sea Dike) Straat, you can get anywhere in the country from here, easily. Very old part of town, just out the front door at Sint Olofspoort stood the first gate to the city, close to the Red Light District, but not too close. Surrounded by many cafes, restaurants, shops, music cabarets, and sights to see. They have a wonderful breakfast, and a restaurant just down stairs (try the Erwtensoep or \"Snert;\" Dutch pea soup)that has ample terras and indoor seating, as well as a cafe (bar) that connects to the lobby. The rooms are \"large\" for Amsterdam standards, kept very clean, and have lots of windows to watch the action outside, and let in a cool breeze. I have been lucky enough to stay in room 210, the \"Chet Baker Room,\" twice now. For Jazz fans this is a sacred place, as it is where trumpeter Chet Baker unfortunately fell from the window to his death. There is a small plaque outside on the wall commemorating him, hard to find, but this is definitely the room where he stayed his final day on Earth. The Proeflokal (tasting house) \"de Oovievaar\" is directly to the right as you go out the front door, one of the best places in all of Holland for trying Dutch and Belgium genevers. Also right across from here is \"Int de Aepjen,\" perhaps the oldest Brown Bar in town, even though this fact is up for debate. Walk down Zeedijk Straat and you will find plenty of places to eat, as well as endless cafes, and maybe a coffeeshop, keep going South and you will end up at the Nieuwmarkt, another interesting part of town. For being so close to Centraal Station this place is quiet enough to get a good nights sleep. The staff is very pleasant and can help you with directions etc. It is very hard to not have a fun filled stay at this place. Highly recommended!!!", "Date": "February 13, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Ballymoney, United Kingdom", "Title": "“Great location”", "Author": "frankieglenda", "ReviewID": "UR123637529", "Content": "I went to Amsterdam with four work collegues at the beginning of Dec and stayed in the Hotel Prins Hendrik. Great location, just opposite to Central Station and very close to all the main attractions. The hotel is just on the edge of the Red Light District but don't let this put you off as it is far enough away if you want to avoid it, but would recommend a walk around. Never did I feel threatened or frightened in any way, has to be experienced!!! The city is fab, yes there is the coffee shops if thats your thing but they certainly aren't in your face. Great cafes, bars and shops. Hotel is a little dated but that just adds to the charm of Amsterdam. We stayed in a room which accommadated 6 people, it was spacious, clean and warm. Breakfast had a good selection of food to cater for both British and Continental tastes. Great wee bar just round the corner called The Old Nickel Hotel. Live music at the weekends and very \"oldy worldy\" and cosy, and stays open into the wee small hours. Overall I would recommend this hotel for a short stay, go with an open mind and you will certainly enjoy Amsterdam. I will certainly be back ASAP!", "Date": "January 26, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "3.0", "Value": "2", "Sleep Quality": "4", "Rooms": "3", "Location": "2"}, "AuthorLocation": "Aylesbury, United Kingdom", "Title": "“Mixed reviews”", "Author": "l0vet0travell0ts", "ReviewID": "UR123485120", "Content": "I was in Holland on business and had to stay in Amsterdam for one night during my travels, i booked this hotel as it was right next to Central train station. My room was quite dated in the decor, but was clean. The staff were very friendly there too. Attached to the hotel is a small bar with a pool table downstairs. It was quite nice and clean too. If i was going back there i would probably stay at a hotel in a different location. But i guess it just depends what you want to be close to, if your looking to be near the RLD then this would suit you well!!", "Date": "January 23, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Wroclaw", "Title": "“OK”", "Author": "Pawel_EPWR", "ReviewID": "UR123019433", "Content": "The hotel was located right next to Amsterdam Central station and was only a 5-minute walk from Dam Square. The staff were polite and very helpful. The inclusive breakfast was very good, both in variety and quantity. The room was very big and comfortable. A bit noisy. WIFI service is mediocare with connection problems.", "Date": "January 13, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "2.0", "Value": "1", "Location": "1", "Rooms": "3"}, "AuthorLocation": "", "Title": "“I would not recommend and would never return.”", "Author": "Geoffroy46", "ReviewID": "UR123008315", "Content": "The room was noisy almost all night because of its proximity to a noisy street. For a quiet night's sleep and a good location, I recommend a hotel somewhere near the Singel Canal.", "Date": "January 13, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "4", "Sleep Quality": "2", "Rooms": "2", "Location": "5"}, "AuthorLocation": "Auckland New-Zealand", "Title": "“Average hotel - Excellent Location”", "Author": "sandluc", "ReviewID": "UR121443438", "Content": "I stayed here early November and although t wasn't my choice of hotels, overall it was not too bad. The hotel itself is very basic and I wouldn't recommend it for anything other than a place to crash at night right in the middle of the city. It is also very noisy well into the early hours of the morning so wouldn't recommend for light sleepers. My room was tiny,but my colleague's was literally twice the size and was on the same rate. A bit random. Both were clean and well heated but certainly no luxury. The owner seemed quite perplexed when I asked if I could use an iron - apparently none on site. Then location is certainly the best aspect of the hotel - right next to central station and close to plenty of restaurants and bars. The red light district, museums and shopping areas are all easy walking distance too. The area is fine and didn't feel unsafe at any time of the day or night. The breakfast that is included in the rate is very reasonable and there is a great little coffee shop next door for a decent brew. I wouldn't stay here again by choice, but for the money and location I think you could definately do a lot worse.", "Date": "December 6, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Location": "4", "Rooms": "5"}, "AuthorLocation": "", "Title": "“Top notch!”", "Author": "jackherer30", "ReviewID": "UR121078662", "Content": "Just returned from a 3night break at this hotel,and i can honestly say its probably the best value i have had in Amsterdam ever,think every six weeks or so for the past decade.the rooms must be seen to be believed.they are huge!we had apt 1 on the second floor.the breakfast was buffet style and tasty,previous reviews mentioned a rude receptionist but the three different lads behind the desk during my stay were sound lads,the other guests were a friendly mix of folks too.i highly recommend this place and ill be back in January keep up the good work.as a sidenote beer lovers should check out the adjacent old nickel bar.its beer list Will make you drool!", "Date": "November 27, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "3"}, "AuthorLocation": "Paris, France", "Title": "“Avoid”", "Author": "vittoParis", "ReviewID": "UR120083143", "Content": "Too expensive for what you get. Too expensive for people on a tight budget. Old Dutch houses ? Not even a hint of charm.", "Date": "November 2, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Liverpool", "Title": "“Midweek break”", "Author": "LiverpoolEagles", "ReviewID": "UR119390740", "Content": "We've just returned from a midweek break in Amsterdam staying at this hotel, ideal location across the square from the Central station (5 mins walk ) nearby to Dam Square shops and all attractions,huge variety of restuarants and bars all within walking distance get yourself a 24 hour pass for the Tram they will take you all over the City hop on & off reasonably priced, If you plan to visit the Ann Frank House book your ticket on-line and avoid the queues. Couple of things to point out no Tea/Coffee making facilities or Hairdryer in the rooms otherwise enjoyable place to stay we would stay there again", "Date": "October 17, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "2", "Overall": "3.0", "Value": "3", "Sleep Quality": "2", "Rooms": "3", "Location": "2"}, "AuthorLocation": "Adelaide, Australia", "Title": "“Avoid Red Light District Area Hotels”", "Author": "gemski88", "ReviewID": "UR118548667", "Content": "I wanted to stay central and completely misinterpreted where the central area of Amsterdam was. If you are planning a trip and are not particularly into what the RLD has to offer then my advice is to definitely steer clear. In relation to this hotel - You get what you pay for - hotel is located on the outskirts of red light district - wouldn't recommend staying in this area of Amsterdam at all. Didn't feel safe at all due to location and service. Rooms smelt. Breakfast was surprisingly ok. Would recommend for a short stay - if anything, and only if your interests are those which lie within the red light district. A dingy part of a beautiful city. Sandwich bar next door is the only place that felt clean enough to eat in the area.", "Date": "September 24, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Tighnabruaich, Argyll", "Title": "“Love this hotel - now booking for 3rd time!!!”", "Author": "kskaren41", "ReviewID": "UR118517523", "Content": "I have just returned from Amsterdam to Glasgow having stayed at the Prins Hendrik Hotel for my 2nd time in 9 months and I'm just about to book up again. The hotel is in a perfect location, just oposite Central Station making it easy for travel to airport and right in the heart of all the hustle and bustle of Amsterdam. The staff are very polite and friendly, the rooms are large, very clean and comfortable, cleaned every day by very friendly housekeeping staff, I feel right at home here. Internet conection to room at 5 euros for a day, brilliant! Breakfast is my favourite time of the day at the Prins Hendrik, a wonderful spread of continental meats, cheeses, pastries, breads, I don't know where to start each morning, it's fabulous and sets you up for the rest of the day! Very reasonably priced compared to other hotels that I have looked at. Part of the joy of visiting Amsterdam for me is knowing my accomodation is going to be what I expect it to be, the Prins Hendrik is most definitely my favourite hotel in Amsterdam! Thanks to all staff for yet again making my stay a most pleasurable one, Karen", "Date": "September 24, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "2", "Sleep Quality": "2", "Rooms": "2", "Location": "4"}, "AuthorLocation": "Adelaide, Australia", "Title": "“Pretty as a picture -from the outside”", "Author": "Sarget", "ReviewID": "UR118407459", "Content": "My husband and 19yo daughter and I were travelling through Europe in June 2010. We booked a triple room which appeared (for the location within walking distance to the train station and central ferry tours and night life) was quite reasonably priced if you book direct with Hotel. However, the photos show limited rooms and overall was very dissappointing. Outside the \"fairy-light\" night pictures make the Hotel look very impressive however once inside the whole place is very ordinary. To get to your room is a trial, once you take the lift to your floor you then need to navigate stairs to your room, and then once inside your room there are more stairs -bizarre set up. The room itself is very basic with tubular steel beds to sleep up to 5 people which would be a plus for larger family or backpackers hostel style accomodation but remember this Hotel is quite expensive. The room is quite large and open with limited old furniture and TV. The bathroom is tiny. Breakfast was included in the price and was sufficient with the usual coffee, toast and cold selections. This Hotel was the most expensive of our whole trip including UK where we stayed in a Castle, London, Edinburgh, Barcelona and Paris and clearly overpriced for facilities. Book it for convenience if you are not staying long and are in a large group wanting to party for the weekend!", "Date": "September 21, 2011"}, {"Ratings": {"Location": "5", "Overall": "2.0", "Value": "2", "Service": "4", "Rooms": "2"}, "AuthorLocation": "Alfe Menashe, Israel", "Title": "“Hotel of contradictions”", "Author": "Thats_10", "ReviewID": "UR118098772", "Content": "We were 5 days in that hotel for a business conference. The hotel has some contradictions within it. It means that some of the things are really good and some are really bad. lets start with the good ones. The room is very clean. the service is served every day with no surprises (and its good). the location is excellent because its less than 100 meters from central station, where all the trams, buses and trains (easy to come easy to come back). The stuff is very welcome although the person in the reception insisted on taking the money in cash (or in credit, but immediately). our complains that the last payment (1/3 of it) will be payed in cash or in credit card only at the end of the order and meanwhile he will take empty credit card voucher (like it is managed by everyone) were decisively denied. so, if you plan on cash and coming to this hotel, you will have to pay cash or immediately charged in credit card at the start of the order for all the time you will stay there. beside that, the stuff were friendly. Breakfasts are good! There are some defects as well: the entry to the room comes as several steep stairs (about a meter high) so it is strange. when you climb about these stairs you will get a very spacious room. the stairs are not suitable for handicap. the room is actually quite pleasant but the windows are barely open (only to a small crack. so if you want some fresh air, you won't get it here. The bath is big but 2 comments: there are no hangers at all in the bath so you have to put your towels and clothes on the toilet chair's cover and also the shelf under the mirror is tiny. we were 2 persons in the room and we barely managed our stuff on this tiny shelf. there is no alternative wherer to put your stuff beside the tiny shelf. there's neither kettle nor cups so forget about coffee in early mornings unless you go down to the coffee shops in the street. the last hallucinatory problem is the mirror which stands in oblique line simply because the wall of the room is like this. so you can stand in front of the mirror and see only your shoes (in the best case).... To our question, they brought us ,immediately i must say, some smaller mirror, not connected to any wall. Summary: There are quite good things about the hotel like location (best) and cleaniness, but the noise from the street is quite hard. the other \"strange\" things, togather with the lack of devices in the bath, caused us to decide that next year we will be in another place, probabely in this surrounding. one more thing, they have great humour, one of us got an orange juice with a tiny bug/muskito and the waiter didn't become confused and said, \"thats mother nature...\". he promised us the next bug (in the next cup) on the house...", "Date": "September 14, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "3", "Overall": "3.0", "Value": "3", "Service": "4"}, "AuthorLocation": "Manchester", "Title": "“Good Value & Location”", "Author": "Hel1982", "ReviewID": "UR117636006", "Content": "This hotel was facing the train station and close to all tourist attractions. Room was spacious and clean, and the price was reasonable. Only downside was the steep staircase to get to the room", "Date": "September 3, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "4", "Overall": "3.0", "Value": "2", "Service": "4"}, "AuthorLocation": "Leicester", "Title": "“Expensive for merely clean and adequate”", "Author": "leicestermancunian", "ReviewID": "UR116657592", "Content": "I paid 95 euros per night for a single room here. I had a twin room on the first floor probably would be 120 euros if two sharing (according to hotel price list). The room was clean and well serviced but rather dark, the window overlooking a tiny yard with a huge service pipe taking up most of the space. The decor was tired, really needing an update, and there was a small wet room but with the sink inside the actual bedroom. No hairdrier or extras apart from a soap dispenser, not even a hotel leaflet to say about room service or anything. I could smell cigarettes faintly and overheard the receptionist say to someone that there are no non-smoking rooms. I thought it was a lot of money for what I consider fairly basic accommodation. The breakfast very good though and we spent time in the bar and had a good meal in there. The location is also excellent. Wouldn't go back though.", "Date": "August 13, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Location": "5", "Rooms": "3"}, "AuthorLocation": "London, United Kingdom", "Title": "“Perfect budget stop over”", "Author": "Foodbuff81", "ReviewID": "UR116476660", "Content": "Debauche holiday - check Perfect location - check Clean - check Cheap- check If thats all you need its perfect. If your looking for something more civilised and upmarket in this area stay at the NH across the road.", "Date": "August 9, 2011"}, {"Ratings": {"Cleanliness": "2", "Sleep Quality": "1", "Overall": "2.0", "Value": "2", "Service": "2"}, "AuthorLocation": "London, United Kingdom", "Title": "“Dont stay here...”", "Author": "sgoldthorpe74", "ReviewID": "UR115759624", "Content": "We had a room on the first floor, which was awful i had about 2-3 hours sleep a night at most. it was so noisy you couldnt go to sleep whatever time of night it was, we tried mid night, 3am, 1.20am on different nights and it was still very very noisy. The room was very stuffy and needed the window open but we definitly couldnt open it. One bedside light didnt work and was dangerous, the first night we had no hot water (they confirmed an ongoing problem) and the shower leaked so bad we had to get extra towels to mop the bathroom floor. It was very dangerous. The towels we were given were the most disgusting I have ever seen and made me gag and were covered in marks some of which looked like blood to me but i cant be sure. Maybe they gave us old towels as they knew they were for the floor but even so no respectable hotel should have given these out. The location is brill for the station and going out but then id rather be a bit further out and be able to sleep at night. I have stayed in better hotels for a lot less....", "Date": "July 25, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Newcastle, United Kingdom", "Title": "“Loved it, would love to go back”", "Author": "charliejovi", "ReviewID": "UR114917359", "Content": "Literally just got back today and felt I had to leave a review. Live in the uk and just did a mini cruise a night on the ferry, night in hotel and another night on the ferry. I work with adults with learning disabilities and myself and a colleague accompanied 7 of the on the trip. The hotel was clean and comfortable and more than adequate. The quad room was huge, never seen such a huge room. What made our stay was the staff at the hotel, they could not of been friendlier if they tried. They were friendly helpful attentive chatty, full of advice and very supportive of myself and my colleague. They made time for our clients and I could not be happier with the service we recieved. I`ve read quite a few bad reviews on here and I can honestly say it wasnt our experience at all. Our lads had a home away from home during our stay and I will reccomend this hotel to friends and family alike and if im ever in Amsterdam for a personal trip I`d book this hotel in a heart beat, even my 13 yr old daughter. Thankyou very much to the staff and owners of the hotel and if the manager/owner reads this all your staff who were on duty 28th and 29th June 2011 deserve a huge amount of praise, not one of them found us troublesome and every single one of them went out of their way to make our short trip an enjoyable one", "Date": "June 30, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "2.0", "Value": "2", "Location": "4", "Rooms": "2"}, "AuthorLocation": "Riebeek Kasteel, South Africa", "Title": "“Disappointing”", "Author": "JohanMoolman", "ReviewID": "UR106546683", "Content": "This was one of the most disappointing hotels that I have stayed at. Cannot fault cleanliness and friendliness of staff but I should have guessed all may not be to my liking when I was asked to settle the account up front. That has never happened to me before. After staying in an excellent hotel in Rotterdam, a very good hotel in Amsterdam a few nights earlier on Queens Night, a superb hotel in Luxembourg the weekend before, this one certainly was disappointing. location is excellent but rooms are not up to standard.", "Date": "May 2, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Gloucestershire", "Title": "“Excellent Stay”", "Author": "edwards133", "ReviewID": "UR103201119", "Content": "Arrived at 10.30am well before check in time, this wasn't a problem to the fabulous receptionist. He sat us down in the sunshine, we had a drink & a toasted sandwich, half an hour later, we were in our room & ready to explore Amsterdam. The hotel provided us with a street map on arrival, that was really handy as we set off to explore. This hotel, is opposite the railway station but far enough away for noise not to be a problem. We had room 108, 1st floor on the front of the building, room & en-suite were lovely & clean, it could have done with a lick of paint to freshen it up but it was perfectly clean, as was the bedding & the towels. Hotel is very quirky, it's spread across 4 traditional dutch houses so very higgldy piggldy but quaint. The room could have done with coffee making facilities & a hairdryer which are generally standard in any hotel nowadays. It wasn't a huge problem though, a hairdryer could be obtained from reception for a small deposit which was refunded when the hairdryer was returned to reception. ALL of the staff were extremely helpful, pleasant, good humoured and generally made our stay very pleasant. This included the lovely lady working the bar (I apologise for not knowing her name but do know she has twin grandchildren!). The breakfast staff, waiting staff, cleaning staff in fact everyone was truely lovely. I think I'm in love with Dutch people! Breakfast was absolutely fine, plenty of juice, coffee, boiled eggs, cold meats, cheeses, salads, bread, toast, jams, fruit, cereal, scrambled eggs, beans ..... The price seems a bit steep & to be honest if it had been in the UK I would have expected a more luxurious hotel for the money but you are paying for location, it's an excellent spot for getting out and about. We did buy a tram ticket one day but didn't really get value for money out of it as it was so easy to walk everywhere we wanted to get to. This was probably helped by 3 days of early April sunshine, might have been different if it had rained! Great place to stay for a city break & I wouldn't hesitate to stay there again if I was to travel back to Amsterdam.", "Date": "April 7, 2011"}, {"Ratings": {"Overall": "2.0"}, "AuthorLocation": "Bristol", "Title": "“Check out your room.”", "Author": "nickdaviddavid", "ReviewID": "UR100986159", "Content": "Good enough hotel but the room we were given was not worth one star let alone three. The basic furniture was tatty, the shower was either too hot or too cold and the only bathroom extras were shower caps and soap. Add to this an impossibly narrow circular staircase and you can see why that I would advise anybody who is offered room 31 to run (unless they actually relish staying staying in what appears to be staff accomodation.", "Date": "March 21, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "3.0", "Value": "4", "Sleep Quality": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Derbyshire", "Title": "“Charming and convenient hotel, but some serious problems found”", "Author": "CRobDerbyshire", "ReviewID": "UR89050875", "Content": "The Prins Hendrik Hotel is in a terraced building, a short walk from the Amsterdam Central train station. I stayed there for one night in November and chose it as a reasonably priced 3-star hotel with breakfast included. The reception desk was manned by excellent English-speakers who I found to be very welcoming and friendly. My room was on the second floor and luckily there is a lift - the stairs are very steep and shallow for big-footed people like me, so felt unsafe (the staircase also smelt strongly of cigarette smoke). The room itself was very unusual with great charm. The door opened to steps leading up to a hallway, with the bedroom at the end and the bathroom on the left. This set-up had the feeling of a small apartment (but without a kitchen). It was a twin room, partially in the roof space with three windows onto the narrow street at the back of the hotel and another window in the roof. The room was very spacious and the furnishings were reasonable, with heavy wood furniture. There was a wall-mounted LCD TV (not widescreen) with channels that included BBC1 and BBC2, but the picture was very grainy (obviously not digital). There were no tea/coffee facilities in evidence. The room was not the warmest place for a snowy night in November (the wall-heater was small for the room size and didn't seem to be on). The bathroom was warmer and was again roomy, with both a bath and shower (over). I was quite satisfied with this room until I pulled back the bedspread of one of the beds to find a stained sheet, which was definitely not acceptable. I therefore used the other bed but found there was insufficient bedding for such a cold night. Another serious grievance with this room was that the electrical plug for one of the bedside lamps had no cover and was therefore dangerous. Breakfast was available in a bar/diner with a traditional, rustic feel and was completely self-service. The range of food was good and could not be faulted. I must stop short of giving this hotel a 100% recommendation due to the serious problems that I found in my otherwise charming and pleasing room. If staying at this hotel, I advise you to inspect your room thoroughly before deciding whether to accept it.", "Date": "December 5, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Sleep Quality": "3", "Rooms": "4", "Location": "4"}, "AuthorLocation": "greece", "Title": "“back to the 80's”", "Author": "sx_Greece", "ReviewID": "UR84434730", "Content": "I have stayed in a building right next to the main one, from the outside it looked excellent but when theyâ€™ve opened me the door I saw a narrow spiral stair that I had to climb with my luggage. Thank God I just had to climb till the first floor, but still it wasnâ€™t that easy. The roomâ€™s decoration is the same since the 80â€™s, old furniture that gives you the impression of an old shabby room. Not that clean, but new towels and sheets. Rather nice breakfast and good location. A typical example of a hotel in Amsterdam. For sure it doesnâ€™t worth the 95-125â‚¬ per night, but this is Amsterdam. No matter what hotels will keep on being over booked.", "Date": "October 22, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "2.0", "Value": "2", "Sleep Quality": "1", "Rooms": "1", "Location": "4"}, "AuthorLocation": "London", "Title": "“Very basic”", "Author": "Seefdeacs", "ReviewID": "UR77930165", "Content": "Location close to the train station, but felt it was a very basic hotel for the price. The bathroom was a small shower room and my room backed on to a VERY noisy street.", "Date": "September 2, 2010"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Sleep Quality": "1", "Rooms": "1", "Location": "5"}, "AuthorLocation": "Thailand", "Title": "“Nice location but once is enough”", "Author": "EdgeThailand", "ReviewID": "UR72943139", "Content": "Pros. Great location. Near the railway station, red light district, city centre. Helpful, pleasant desk staff. OK breakfast buffet. Cons. Very hot in July. No air-con or fan, window opened a small slit. Uncomfortable. The great location in the middle of everything means it was very noisy. Party-goers from the red light district and weed coffee shops loud until the breakfast buffet opened. Add traffic and tram noise. Sadly the room had no noise protective blinds or even double glazing. Forget resting here. Few frills, just a room.", "Date": "July 30, 2010"}, {"Ratings": {"Service": "2", "Cleanliness": "2", "Overall": "2.0", "Value": "2", "Sleep Quality": "1", "Rooms": "1", "Location": "4"}, "AuthorLocation": "London, United Kingdom", "Title": "“Great Location- BUT!”", "Author": "norwoodboy73", "ReviewID": "UR72222569", "Content": "OK first this hotel is in a great location but i found the room was small with a view of a brick wall, no air con so had to have window open so was noisy and i got bit to death. The service was not too good a bit grumpy to be honest also be aware the breakfast starts at 0800 at week-ends not 0700 so if you have early flight you miss out. If you wanted a safe you had to rent it which i thought was tight for a 110 euro per night room also the toilteries were very basic so to sum up i think you can get better hotels for the money around the area and that is what i would do next time.", "Date": "July 25, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "5"}, "AuthorLocation": "MERSEYSIDE", "Title": "“Ideal Location”", "Author": "MerseysideAjs", "ReviewID": "UR71119727", "Content": "Just got back from staying at Hotel Prins Hendik for 3 night's, I would stay at this hotel again. I had read lot's of reviews and asked advise on forum, I found this hotel to be basic but clean, room was cleaned daily staff were very helpful breakfast was good. I felt very safe in this hotel it is in a really good locaion over the road from train station and within walking distance of tourist attraction's", "Date": "July 16, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Maastricht", "Title": "“Centrally located”", "Author": "cancerain", "ReviewID": "UR68951686", "Content": "Its location was the biggest factor in my choice to stay in this hotel. Rooms were small but adequate for a single person but a bit smelly. It was quite though with no traffic distractions. Great buffet breakfast to start the day- they even packed it for me when I had to leave early for my flight. Good seating outside on the pavement with a cup of hot coffee and people watching.", "Date": "June 28, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Petworth ,West Sussex", "Title": "“Great Allrounder”", "Author": "Hunter006", "ReviewID": "UR68312636", "Content": "Great Hotel with friendly staff clean rooms and good location every thig you need for a great stay in Amsterdam. This is all i can say about the hotel, Can think of any bad point apart from the stair as our room which was located in the annex away from the main hotel it was a tight spiral stair case but out of 3 nights i cant remember 2 so wasnt a problem. Would use again and recommend.", "Date": "June 22, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "3.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Nairobi", "Title": "“Great Location, Nice Hotel”", "Author": "Nairobi75", "ReviewID": "UR67547790", "Content": "Stayed there at the end of May, 2010. Nice hotel in great location, right opposite the central train station and conveniently located. From there one can organise tours to the rest of the city. Nice staff and rooms were spacious and comfy.", "Date": "June 15, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Warrington, United Kingdom", "Title": "“Fab Location!”", "Author": "iKirsty", "ReviewID": "UR66977665", "Content": "We stayed at the hotel for 1 night on 7th June 2010. The room was huge for just the 2 of us. It is directly over the road from Centraal Station and a 2 minute walk to Dam Square. Cannot fault this hotel really and will be going back", "Date": "June 9, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Cape Town", "Title": "“Good Hotel in the middle of everything”", "Author": "CTPtraveller", "ReviewID": "UR65585379", "Content": "We stayed at Hotel Prins Hendrik Hotel from the 4th to the 8th of May. The hotel is set in the middle of everything from Dam Square to the famous red light distric. The room we stayed in, a room that sleeps four, was huge compared to the other European Hotels we stayed in. The staff was friendly and really made our stay very pleasant. Breakfast was very good with a wide variety of breads, cereals and cold meats. Also in was very nice to come back to the hotel in the evening and have a cup of \"Koffie verkeerd\" which is coffee with milk. The hotel also has a pool table which was also very nice. The hotel staff was also very kind in storing our luggage on our day of departure while we did our last bit of sight seeing", "Date": "May 28, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "4", "Sleep Quality": "2", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Long Beach, California", "Title": "“Excellent Location and staff. OK hotel”", "Author": "QguyLB", "ReviewID": "UR62780301", "Content": "April 8 - April 13 You can't beat the location of this hotel. Right across the street from the main train station \"Centraal Station\". There are great sights and activities within a short walk of the front door of this hotel. The Hotel is acceptable. The room was tiny, but most older hotels in Europe are of this standard. The bathroom was small and water from the shower, which is only divided from the rest of the space with a shower curtain, would cover half the bathroom floor. You had to sit on the toilet at an angle to have enough room for your knees. It was an experience! But was not a great inconvenience. The bed was acceptable and the shower always had hot water. The reception staff was friendly, as were the maids. The Breakfast, included in my room rate was decent. A good variety of breads, meats, cheese, cereals, hard eggs, juices and coffee. Internet is available at a price, as is also the standard in Europe it seems, pricey, and for me almost a necessity. I was on floor 1, and appreciative for the lift with my bags. The lift was tiny, but helpful. I took the stairs any other time which can be tricky with their narrow steps. The noise from the street was sometimes annoying. It is Amsterdam after all, and not known to be a lazy, sleepy kind of town.", "Date": "April 29, 2010"}, {"Ratings": {"Service": "2", "Cleanliness": "2", "Overall": "5.0", "Value": "2", "Location": "1", "Rooms": "1"}, "AuthorLocation": "Vancouver", "Title": "“Location \\location Location”", "Author": "anninvan", "ReviewID": "UR47173878", "Content": "Charming, clean, hotel, large roms by any standard. Staff friendly and helpfull. A real taste of old Amsterdam. The breakfast has everything you need to start the day in this amazing city. When I come back I will stay here and would recomend this little hotel to everybody. Excellent value, so close to evertyhing my girlfriend felt safe and cared for. Ann McCallum Vancouver, BC", "Date": "October 18, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "alabama", "Title": "“Simplemans Hotel”", "Author": "simpleman59", "ReviewID": "UR46157711", "Content": "This hotel is just the best . 09 will mark my 4th pilgramage to the new city of enlightinment Amsterdam and my 4th stay at the prins hendrick. Nice clean rooms big bath and a shower that never runs out of hot water. And right in front of central station and right around the corner to some of Amsterdams finest and most spiritual coffieshops . Everything is located in this area ( Anne Frank house,Dam Square, old church, bulldog 1 and 2, ect,,,", "Date": "October 8, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Location": "4", "Rooms": "4"}, "AuthorLocation": "WE11RN", "Title": "“Pleasant stay.”", "Author": "WE11RN", "ReviewID": "UR46054991", "Content": "We stayed here twice this trip to Amsterdam. First for 5 nights in a great room way up on the 4th floor. After 3 nights in Brussels we were back for 2 more nights in a nice room on the 3rd floor. At first glance I was skeptical, the lobby was a little old and a little tired. The elevator had a strong smell of floral disinfect. The room was plain, but great! Clean, as was the lobby, had a great view of Central Station, side walk cafes, and shops. The bath room was tiled floor to ceiling, with a nice big tub,and spotless! It was located close to Central Station, which is good for catching the train and trams. There are lots of shops, resturants and coffee houses (if that is your desire) within a short walk. The free breakfast was tasty and filling. And the bartender chatty and friendly. The fellows who worked the front were friendly and helpful. I would definitely stay here again. But fellow American, if you are wanting an American style hotel-it's not. But, if you look past the odd, it's a great place.", "Date": "October 7, 2009"}, {"Ratings": {"Service": "2", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Location": "2", "Rooms": "1"}, "AuthorLocation": "Mount Airy, MD", "Title": "“What a disappointment.”", "Author": "pintodoug", "ReviewID": "UR36124397", "Content": "Frankly I am stunned that this place has received any positive reviews. If this is a three star hotel McDonalds is fine dining. Dirty run down undersized lobby is your introduction. Rooms are furnished like an old Hotel 6. First 2 rooms we were given reeked of sewer gas. Third was a smoking room. Finally got a normal smelling room on 4th and last attempt after threatening to walk. Desk friendly but tried to sell us canal cruise with obvious conflict of interest. Had a quad and room size was good but far from comfortable. Beds and pillows were GARBAGE. Furniture and carpet old and run down. Bathroom needed renovation long ago. Paid 180 euros for a night and felt ripped off. NO WAY is this a three star hotel. Paid the same rate for The Vermeer Inn in Delft the night before (fabulous) and difference was night and day. Overall I felt like I had been fleeced. Unless you are used to staying in Hotel 6 you will be disappointed.", "Date": "July 29, 2009"}, {"Ratings": {"Service": "2", "Cleanliness": "4", "Overall": "3.0", "Value": "4", "Location": "5", "Rooms": "2"}, "AuthorLocation": "Leiden", "Title": "“Inexpensive & adequate with a great location”", "Author": "redrocklobster", "ReviewID": "UR30534817", "Content": "pros: Comparatively inexpensive and extremely convenient for a short stay in Amsterdam coming in and out of Central Station. Comfortable enough for the price. Great location if you want to be near the action. cons: Room rather smelled (and not of weed, just general musty old smell). Something made me itch in the night (sheets?) -- but not badly. booking.com said there was wifi available at an extra charge but there was not. Desk staff asked to leave message for a friend who was coming but that friend waited around a half hour before asking herself if there was a message (i.e., no proactivity on part of staff).", "Date": "May 22, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Ireland", "Title": "“Fantastic location and staff”", "Author": "lizdunne", "ReviewID": "UR29069862", "Content": "Myself and 2 friends (all women) just got back from a 3 night stay at the prins hendrick. The location was fantastic, come out of central station, head left and its across the road, perfect. There's lots of bars and restuarants within a stones throw away, it's about 3 minutes to the red light district, 5 mins to dam spare, perfect. The decor is a little tired but it was spotlessly clean. The 3 of us shared a room and it was massive. I've stayed in the dam a number of times and this room was absolutely humungous by other hotel standards. The price was very resonable and included the city tax and a lovely continental breakfast. There was a bit of street noise at night but nothing that would overly bother you and in fairness who comes to amsterdam to sleep! The bar is lovely and have to say we had a right laugh with the barman Frank. There are a couple of tables outside and as the weather was beautiful we sat outside the bar all night having a few beers. All of the staff couldn't do enought to help, whether it be booking tickets or offering advice on where to go. They were just lovely. So, in conclusion, I think this is a gem of a hotel. It's close enought to the madness but far enough away not to be bothered by it. It's not the exactly the ritz but the price, location and staff more than make up for it. I will definately stay here again.", "Date": "April 30, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Location": "5", "Rooms": "3"}, "AuthorLocation": "aberdeen", "Title": "“Excellent staff”", "Author": "ootmaheed", "ReviewID": "UR27699216", "Content": "Stayed at the Prins Hendrik for Holland V Scotland football match. On our arrival we were greeted with a very warm welcome. We were given apartment 1 which was on 2 floors and even had a kitchenette. The apartment was very clean and spacious and nice view of Central station from upper floor. The staff at the hotel were extremely helpful, polite and friendly (Especially Nils and Gerald)., who also welcomed our friends (who were not staying there). Would not hesitate staying there again.", "Date": "April 9, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Manchester", "Title": "“Excellent location, clean room & top staff”", "Author": "Boynster", "ReviewID": "UR25506422", "Content": "Just got back from 3 days staying at Hotel Prins Henrik with freinds. Got a quad room and it was clean, comfy and not nearly as noisy as reveiws lead you to beleive. 5 min walk from station so very convenient. The brekkie was okay and in line with a 3star but the staff were best thing about the place. Matt on reception bent over backwards to make our stay as good as it was, including sorting out a bucket of ice for the champagne we had brought with us (& necked in the room once chilled) from UK. The bar offers good beers and overall I was impressed and will book here again. Left our un-used skunk with barman to pass onto Matt when his shift started. Enough said. Tony B & freinds", "Date": "March 3, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Business service (e.g., internet access)": "1", "Check in / front desk": "3", "Overall": "2.0", "Value": "2", "Rooms": "2", "Location": "4"}, "AuthorLocation": "Glasgow", "Title": "“Not quite a 3 star experience”", "Author": "gillhan", "ReviewID": "UR23020680", "Content": "This hotel was chosen for me on account of its location, which is very central and certainly suited to exploring the city. However, much of what I read in other reviews was borne out by my experience; the staircase was tricky, the whole place needed a lick of paint, the smell of 'exotic' smoke permeated the building, the bedding was less than fresh smelling (with multiple cigarettes burns!) and the breakfast wasn't worth bothering with. I would say that the place seemed particularly suited for group (stag or hen) trips, where exploring the cafes and the red light district might be a priority. However, budget travelers looking for a central location may find the place meets their needs providing their expectations are more two star than three!", "Date": "December 26, 2008"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Check in / front desk": "4", "Overall": "4.0", "Value": "4", "Rooms": "3", "Location": "4"}, "AuthorLocation": "London", "Title": "“Great value for money in a good location”", "Author": "LondonSolo_traveller", "ReviewID": "UR21891114", "Content": "Stayed for a long weekend in this hotel. It was one of the more affordable options but nevertheless the hotel was clean and comfortable, the reception staff were very helpful, the bed was comfortable, and I was not disturbed by other residents. There were some noisy groups of people staying in the hotel but the soundproofing was very good so I was not disturbed. It was across the main road from Central Station so in a great location.", "Date": "November 16, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "United States", "Title": "“simplemans hotel”", "Author": "0u812ic", "ReviewID": "UR21160471", "Content": "The very first trip to amsterdam i chose this hotel.the place is ve ry clean big rooms nice clean bath and ashower that never runs out of hot water great breakfast and right around the corner to some of amsterdams best coffieshops .I made a promice to myself that i would return every year that iam able 08. will make my third visit to the city of enlightingment to get amstterdamaged", "Date": "October 24, 2008"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Business service (e.g., internet access)": "3", "Check in / front desk": "2", "Overall": "2.0", "Value": "2", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Gold Coast", "Title": "“Great Location”", "Author": "Peterobina", "ReviewID": "UR20741667", "Content": "Great location, good breakfast, and a larger than average room. However, the rooms need refurbishing and street noise will not allow much sleep. Most hotels on our 2008 European trip now have double glazed windows and they are needed here. Also I didn't like the set-up of the reception desk, as you can't see them process your credit card.", "Date": "October 8, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Business service (e.g., internet access)": "3", "Check in / front desk": "5", "Overall": "5.0", "Value": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Fairfield, California", "Title": "“What a location!!!!”", "Author": "isthatuitsme", "ReviewID": "UR19672621", "Content": "Stayed 3 nights and had a great time. The hotel location was great. Right across the street from Central Station and right at the bottom of the red light district and all those lovely coffee shops. We booked a twin room and was surprised when we where given a very large quad room. The staff were friendly and helpful. Have been to Amsterdam three times and this is by far the best place that I have stayed for a reasonable price. Will be going back to Amsterdam and will be staying at this hotel again. Only negative was the noise from the street in the morning. Had to close the windows in the early hours cause of the road works and restaurant deliveries but the location made up for it!", "Date": "September 2, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "4", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Sweden", "Title": "“Just wonderful”", "Author": "1globetrotterSweden", "ReviewID": "UR18705248", "Content": "Stayed here for one night in july. Got a great price for a wonderful clean big double room on the fourth floor with wonderful beds, big bathroom, 40 channels on the tv and a great buffe breakfast in the morning. Very close to Central Station, Center and Red light disctrict. What mote can you ask for. I'm very satisfied with the hotel, staff and the surroundings. Stay there!", "Date": "August 7, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "3", "Business service (e.g., internet access)": "3", "Check in / front desk": "5", "Overall": "4.0", "Value": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Ma, USA", "Title": "“New Year's Trip”", "Author": "jeni41702", "ReviewID": "UR18568015", "Content": "My family, friends and I rented this hotel for a 5 day stay for New Years. We were traveling with a party of 13. We first arrived at the hotel 2 hours early. We were allowed to drop our bags underneath the staircase. I was a little nervous about leaving my belongings but when we returned to check-in we found all of our bags to be in order. The rooms seem pretty standard as far as 2-3 stars in Amsterdam go. My friends got to stay in a sweet room facing out the front of the hotel. We enjoyed many nights in the hotel bar. The bartenders that served us were great. They also exchange money but for a high exchange rate and would suggest exchanging money before arrival. We had a great time and we're glad we stayed at this hotel.", "Date": "August 3, 2008"}, {"Ratings": {"Overall": "3.0"}, "AuthorLocation": "scotland", "Title": "“Prinz Hendrick Hotel”", "Author": "donnerkebab", "ReviewID": "UR15998790", "Content": "For value and location i think the Prinz Hendrick would be hard to beat, its decor is a bit tired but i have paid an awful lot more and stayed in worse hotels in Amsterdam. We had six twin rooms booked all were about the same. Each room was quite spacious and bright and all of them were clean. Housekeeping was done daily and they did a great job. The staff in the hotel were all very friendly and accomodating and in true dutch style you never felt anything other than a sense of calm. The roads situated around the hotel can be very noisy with late night revellers returning home so its not for the light sleepers or familys. I fully intend to re book for next year and would reccommed it to friends.", "Date": "May 13, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Business service (e.g., internet access)": "3", "Check in / front desk": "3", "Overall": "4.0", "Value": "3", "Rooms": "5", "Location": "5"}, "AuthorLocation": "belfast", "Title": "“Don't be put off”", "Author": "belfastgal", "ReviewID": "UR15027762", "Content": "I stayed in this hotel for 2 nights/3 days at the end of March this year. Having booked the hotel for 18 girls travelling for a birthday weekend I was terrified after reading some of the reviews and in a panic tried to book somewhere else due to the proximity to the red light district & reviews on cleanliness.... Im glad I wasn't able to find somewhere else! We all had a great stay & a great weekend!! This is not a hotel for a romantic break or family holidays or for business travellers who need comfort but for singles or carefree couples its perfect for exploring the city. Just across the road from the central train station (around 4 euros each way for 15 min journey to/from airport) & lots of tram stops its ideally located. On the map it appears right on the edge of the red light district, which in a way it is, but its far enough away that we never felt insecure or in any danger. Nearly everything in the city centre is within walking distance so long as you have a pair of comfy shoes. The hotel wasn't stylish but all 5 of our rooms were very clean & we had plenty of room. The bathrooms were spotless & the rooms were tidied each day. The stairs were indeed a nightmare but we didnt have to use them as the lift was always in perfect working order. Breakfast was fairly good and the hotel bar was cosy & friendly. The hotel staff were all very nice except for the guy at reception on the day we checked out who was very rude to 1 of the girls but otherwise we have no complaints at all. I book weekends away for my friends all the time & usually go for budget hotels. Some reviews seem to think that this hotel was overpriced.. we paid approx Â£90 each (with the current exchange rate) for our stay but the central location meant we didn't have any other expenses eg. taxi fares which for such a large group could have been a nightmare. I cannot comment on the parts of the hotel located further down the street as we were all in the main building but we all had a very comfortable happy stay at this hotel & would certainly use it again.", "Date": "April 14, 2008"}, {"Ratings": {"Cleanliness": "1", "Check in / front desk": "3", "Overall": "1.0", "Value": "1", "Rooms": "1", "Location": "1"}, "AuthorLocation": "Pontyclun, Wales", "Title": "“Should charge by the Hour”", "Author": "draig", "ReviewID": "UR14894069", "Content": "This is an unpleasant hotel, the warning is that you have to pay in full when you check in!! The staff seem friendly enough but everything else is grotty. The rooms are quite large but I was right on street level and you don't get much sleep on a Friday night this close to the Red light area. The bathroom had thick black mould in the corners and smelt fausty. The covers on the bed were stained. My colleague's room was in the same state and we didn't bother with breakfast, not wanting to try the hygiene of the kitchen. We were very pleased only to have been there for 7 hours!! The NH chain of hotels are so much better!!", "Date": "April 8, 2008"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Check in / front desk": "3", "Overall": "2.0", "Value": "2", "Rooms": "2", "Location": "5"}, "AuthorLocation": "Berkshire", "Title": "“Definitely not suitable for young families - we were assaulted”", "Author": "Familyoffoureaster", "ReviewID": "UR14510456", "Content": "We didnâ€™t stay in the main hotel but in an annex just along the road. Access is via a very steep spiral staircase, too narrow to ascend if you have a large suitcase, which we fortunately didnâ€™t. There is no fire escape. We were on the third floor facing the main street and very noisy, but we were sort of expecting that; the room was very basic but adequate and clean. On the second night of our stay we were kept awake into the small hours by a lot of noise from the occupants of the third floor room. We thought they were having a party â€“ music, shouting, thumps on the ceiling. My husband went up and asked them to quieten down, which they didnâ€™t do. He then went down to reception along the street (our phone didnâ€™t seem to work) and the night porter came and had a word with the people who turned out to be just four girls making all that noise. The noise continued, though not quite so loudly and this time I went up, very angry because our weekend was being ruined and my older daughter was still awake. It was now 2am. The four girls told me I had â€˜no rightâ€™ â€“ they were doing nothing wrong and when my husband came up to back me up they assaulted both of us â€“ I have cuts and bruises to my arm. My husband has scratches all down one side of his face and a torn shirt. They were very large beefy girls, very powerful. They kept saying â€˜your children will have nothingâ€™ and tried to push us over the stair-rail. We managed to get downstairs and my husband went to reception to call the police. My older daughter was hysterical. Amazingly the hotel allowed the girls to stay on, so we had to barricade ourselves in for the night. We could have brought charges of assault against them but that would have been be difficult and lengthy, so we settled for them paying for my husband â€˜s torn shirt (a feeble trade off). In the event they refused to pay and we had to get the police involved again. The hotel moved us to a room in the main hotel for our last night. It was like a show room in comparison - Beautiful bathroom and insulated against noise. We also felt a lot safer. The hotel staff were all very pleasant, but I am stunned and amazed that they should allow violent people to stay on in their hotel. We tried to play down the whole incident with our children, but cannot recommend this as a family establishment.", "Date": "March 25, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "newtownards", "Title": "“fantastic!!!”", "Author": "Donnado_8", "ReviewID": "UR14156535", "Content": "I was travelling with a group of four girls one of which has wrote the review previous to this. Having read the negative comments I felt I needed to back her up and support the Prins Hendrick. Its as simple as this if youre looking for cheap accomodation in the center of Amsterdam with excellent staff then this is the place to come. I cant comment on the stairs as I never actually used them, as there is a perfectly good and always working elevator I didnt see the need, in fact I couldnt even tell you where they are! The room was excellent the bathroom was just refurbished and was spottless. The room decor was lovely and most importantly clean, there was 4 single beds with ample room for us all including table and chairs and t.v. What more could you want!!! Location ! excellent! Straight across the road from centraal station, dam square is around the corner and the red light district is around the next! To be honest we thought we were staying in Dr Whos Tardis every time we turned a corner we where back at our hotel, impossible to get lost. Its even within walking distance to Anne Franks House, What more could you want! Breakfast was exactly what they stated continental although the scrambled eggs were great and toast was self service. If youre looking for a fry then there is a cafe round the corner doing english breakfasts, although we never tried it. The staff are excellent I honestly dont know what the other comments are about. On arrival we were met by the owner who was not only really nice but also very informative regarding places to eat and directions etc. We actually talked about a comment on trip advisor and he felt very cheated to say the least. We in total met 5 staff including the excellent bar staff but a special mention has to go the lovely young guy who was on the graveyard shift who we unfortunately didnt get his name. Would I go back again? Absolutely in fact we are planning for next year already!! I would have no problems recommending this hotel to any-one, its a great hotel in a great location with great staff.", "Date": "March 9, 2008"}, {"Ratings": {"Service": "2", "Cleanliness": "2", "Business service (e.g., internet access)": "1", "Check in / front desk": "2", "Overall": "2.0", "Value": "1", "Rooms": "1", "Location": "4"}, "AuthorLocation": "Wavy", "Title": "“What I've come to expect in Amsterdam...”", "Author": "Wavybabe", "ReviewID": "UR13697294", "Content": "Just back from 5 nights in the Dam staying at the Prins Hendrik. Having been to Amsterdam a few times before I wasn't expecting much from the hotel, which is just as well. When we arrived we were told our room wasn't actually in the hotel but in the apartments just across the way. I didn't really have a problem with this until I saw the stairs! An extremely narrow and steep spiral staircase which was as difficult to get up as it was back down again. I managed to cut my hand on the rail on first attempt. It is also wooden with no carpet and very noisey when people are going up and down. The room was dark and gloomy with very low ceilings, the decor was very dated and cheap looking. The \"double bed\" was actually two narrow single beds pushed together. One sheet and a very light blanket was all that covered each bed - you didn't even get to share a duvet. I was quite annoyed about this as we had arrived on valentine's day and it wasn't exactly romantic! The bathroom was adequate with a decent sized bath and ok shower. The rooms do get cleaned daily and although there were stains etc on the carpet and everything was tatty, it did seem clean. Breakfast was ok for us; a couple of options on cold meat and cheese, scrambled and boiled eggs, beans, cereal, breads and fruit. The staff are a bit hit and miss. We asked if we could leave our bags on the day we were departing the night before and told there was nowhere to put them but on the day a friendlier chap showed us a space under the stair where other people had also left their luggage. On the up side, the location is great, central for everything. The pea soup ordered from the bar was fab and the bar itself was friendly, busy and with a good atmosphere. Paying a Â£120 a night I would really look hard and fast for a better hotel for my money next time.", "Date": "February 20, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Business service (e.g., internet access)": "1", "Check in / front desk": "2", "Overall": "3.0", "Value": "3", "Rooms": "3", "Location": "5"}, "AuthorLocation": "London", "Title": "“Ideal for cramming people in rooms!”", "Author": "DJ FearRoss", "ReviewID": "UR13346811", "Content": "Not a bad hotel. OK, it's not a 4 or 5 star hotel, but it is what it says it is. Look at the hotel photos on the website, they don't show the most modern of rooms, what you see is what you get. We went on a stag weekend and it met all our requirements. The night staff were sometimes quite unpleasent to us, but then sometimes really nice is. It just varied. And 'yes' you do have to pay before checking out. The day staff were really friendly, no problems at all, the pub/restaurant was great. Food was good. Only thing was, that as this is an old hotel you had to pay separately, no adding the bill to your hotel bill. I would like to mentioned again, that the staff at this hotel are brilliant and we joked around with them alot and made our stay pleasent. (I think the people here are complaining about are the actual older owners) Breakfast was included, but not all that. Nothing really wrong with it, but looked rather dull. The location is excellent, 2 min walk opposite the Central Station. Great cause the train from the airport terminates here and only takes about 15mins.", "Date": "February 7, 2008"}, {"Ratings": {"Service": "1", "Cleanliness": "3", "Check in / front desk": "1", "Overall": "1.0", "Value": "1", "Rooms": "2", "Location": "4"}, "AuthorLocation": "Galway", "Title": "“Horrible Hotel RRRun”", "Author": "MissyGalway", "ReviewID": "UR12014444", "Content": "I travel 2/3 times a year to Amsterdam for business (floristry trade).I choose this for location and my usual place was booked out. It looks good on the website but it was a nightmare. I was travelling on my own but i booked a double room as hotels in Holland can be small due to building styles. I was greeted at reception by the rudiest and most aburt person i have ever met.I was scolded for taking a double room even though i had paid a double rate.The door to the stairs was locked so i had to use the lift that was fine but it felt like i was entering a jail. The room was clean but very old furnishing and a stale horrid smell mmm the windows were broken and could'nt be opened and the radiator was on full blast and the piece to adjust it was broken, i asked nicely at reception to be told \"not my problem\". The bathroom well we won't go there.If i had not paid in advance i would have ran. Breakfast was basic and scarce. I arrived back at 12noon on the nose i had everything packed, i was met by the same rude person at reception to be told my luggage was outside in the hall.I went to my room to find two housekeepers going through one of my bags and i asked politly was there a problem one of them shouted at me that they needed to clean the room. I checked out and i was so relieved,i have never stayed in such a depressing and creepy place in all my life or have i ever been treated in such a manner.If you like me are a female solo traveller i would not stay here i felt so unsafe at times i sat up most of the night and my door was banged on several time and the only thing keeping it shut was a brass chain", "Date": "December 28, 2007"}, {"Ratings": {"Service": "4", "Cleanliness": "2", "Business service (e.g., internet access)": "3", "Check in / front desk": "3", "Overall": "4.0", "Value": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Edinburgh, United Kingdom", "Title": "“Great budget hotel”", "Author": "CatatonicZombie", "ReviewID": "UR10549040", "Content": "I booked with a little trepidation after reading some of the negative comments on Hotels.com, but when I actually got here I was very pleasantly surprised. I had booked a single room, but was assigned a three-bed apartment to myself! This consisted of a fairly large lounge/sitting-room (with a single bed tucked away in a corner), and a separate double bedroom with an en-suite bathroom which was accessed by a fairly steep set of steps. My apartment was especially large but the rooms seem to be quite large in general from my observations - I was able to sneak glances into a few rooms while they were being tidied and they seemed reasonably generously sized on the whole. The decor, it has to be said, is a bit tired and could do with freshening up in some spots. There were also exposed gas and water pipes in the stairwell up to the bedroom which were painted white to match the stairwell and did not detract from the overall look of the apartment, although those of an aesthetically delicate nature would not like them. The furniture was also slightly worn and faded; my couch had a small cigarette burn on one arm. I would also caution elderly travellers that the hotel also has a lot of steep stairs but only one small elevator. The beakfast buffet was OK if unspectacular, the usual European selection of sliced meats, cereals, bread, crackers, drinks and scrambled eggs. There is also a bar attached to the hotel which looked OK, not just a typical bland hotel bar, although I never actually tried it. The hotel is very close to Centraal Station, giving easy access to travel links for Amsterdam and beyond. It's also within easy walking distance of the Red Light District, Dam Square and Nieuwmarkt. Overall a good budget hotel, ideal for groups looking for cheapish accommodation, but not for those such as honeymooners looking for a 'special' experience. I would happily stay here again.", "Date": "November 2, 2007"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Check in / front desk": "4", "Overall": "4.0", "Value": "3", "Rooms": "3", "Location": "5"}, "AuthorLocation": "cork", "Title": "“Good location”", "Author": "eoin240803", "ReviewID": "UR8448313", "Content": "The hotel is in a great location, not even 5 minutes walk from Central Station. The rooms are fine if it is just a bed for the night you are looking for. Realy good for groups, but I wouldn't bring a family there. Smoking (of any sort) seems to be quite acceptable there so keep that in mind if you are a non-smoker. The food in the bar/restruant is realy good and the staff are very friendly. There is a terrace (great for people watching) right outside the hotel and you can order food from the restruant to eat outside in a relaxed and chilled atmosphere. Don't expect luxurious rooms but they are comfortable and a great base if you want to spend your time exploring/experiencing Amsterdams attractions.", "Date": "August 18, 2007"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Check in / front desk": "4", "Overall": "4.0", "Value": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Sydney", "Title": "“Great location”", "Author": "Dawn50", "ReviewID": "UR8446520", "Content": "We are Australians and we stayed in this great little hotel in November 2004 and we found it to be very good. Sure it is a bit noisy given its location to Centraal Station but its accessibility to downtown Amsterdam must certainly outweigh the noise issue. We loved the restaurant connected to the hotel and seeing it was almost winter when we were there, we ate there almost every night.", "Date": "August 18, 2007"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Check in / front desk": "4", "Overall": "4.0", "Value": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "england", "Title": "“great for group bookings”", "Author": "roddyf", "ReviewID": "UR8128777", "Content": "Great for stag dos / group bookings. Very good location main station only a 2 min walk away, and hundreds of bars / coffeshops few hundred yards away. Hotel only of OK standard inside but fine for a couple of days if you are there with friends. Check in very quick and all staff helpful. Never made breakfast but people who did said it was OK. Bar next too hotel good, quick helpful service.", "Date": "July 16, 2007"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Business service (e.g., internet access)": "4", "Check in / front desk": "4", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Wales", "Title": "“Friendly and clean”", "Author": "simey692", "ReviewID": "UR7704864", "Content": "Stayed for a long weekend at the prins hendrik from 17-20 may 07 and found the hotel to be very good, we had 3 single rooms and I had the smallest out of the 3 but it was clean and tidy and was fine, the other 2 single rooms had a double bed and 2 singles in the other. The breakfast was buffet and was cold meats, cheese, scrambled eggs, beans, toast, cereals and coffee/ tea, it was quite nice. The staff were very friendly and the hotel is situated right in the heart of the city, just opposite the centraal station. The only downside is there did seem to be a lot of noise outside the hotel, I noticed this on the first night and it did bother me, i didn't ntice it so much on the other 2 nights but I'm not sure if thats because I was very tired and got used to it or because it wasn't as bad as the first night. To anyone thinking of booking the hotel I would recommend it, there is a lift and safe facility and I would stay there again.", "Date": "May 27, 2007"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Business service (e.g., internet access)": "4", "Check in / front desk": "4", "Overall": "3.0", "Value": "3", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Maidstone - Kent", "Title": "“Nothing Bad”", "Author": "Weekend_explorer", "ReviewID": "UR7580366", "Content": "10 of us arrived in Amsterdam for two 50th's. Hotel was booked on-line using previous references on Trip Advisor. Hotel was 5 minutes from Centraal Station and was ready for us when we arrived. Work over the canal is only weekdays and starts at 8.00am with pile driving which can be noisy. Very near to Red Light District (5 mins), Dam Square (10-15 mins) and Van Gogh/Anne Frank musuems (20 mins). Had a meal in the hotel restaurant one night and the steaks, pork fillet and rack of lamb was excellent. Monk fish and garlic gamba prawns were nothing special but the waiter Petr was excellent. Did not meet any rude receptionists - all we spoke to were excellent and COR was very helpful. Found lift to be OK but agree stairs were very steep - but that is all over Amsterdam. Stayed in rooms 219,220,221, 108 etc. and found them all to be of generous size. Did not find out about the annex. Bar was OK and stayed open to 3.00 am - no trouble on closing early as in earlier reports. Not the cheapest though but not the most expensive either. Found the evening bartender (Volker) a bit abrupt at times and did not like opening another bottle of wine and was found dodgy on measures. Daytime lady bartender( poss Judi) was excellent. Due to central location near bars and Red Light district can be noisy with groups singing as they are walking past up unyil 5 O'Clock in the morning. Lots of sports bars nearby so don't worry about missing any sports events on Sky. Watch out for the bikes! - you sometimes find yourself walking down a bike lane without realising it. Visit the Sea Palace floating Chinese restaurant in the harbour - not cheap but well worth a special experience. If you want to travel on the canal's buy a 24 hour canal pass to all four routes which lasts until midday next day.", "Date": "May 10, 2007"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Check in / front desk": "3", "Overall": "2.0", "Value": "2", "Rooms": "2", "Location": "2"}, "AuthorLocation": "London", "Title": "“Prins Hendrik Hotel - Amsterdam”", "Author": "Burywood", "ReviewID": "UR7416003", "Content": "Pleasant hotel with good service. There's some work being done on a new metro station for the Centraal Station which can start quite early in the morning (and is very noisy) -- this is possibly the reason they want full payment for your stay in advance. The hotel is very central and can be quite noisy at night. Breakfast is basic and includes the usual fayre of cheese, ham, eggs and bread products. The lift is dodgy and drainage is a problem (slight whiff). Stairs are not an option -- very steep.", "Date": "April 22, 2007"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Check in / front desk": "3", "Overall": "3.0", "Value": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "wigan", "Title": "“good location”", "Author": "sandymoo", "ReviewID": "UR7368549", "Content": "This hotel is in a great location just across from central station. The double room was quite small and nothing like the picture provided by the hotel (why do hotels do this, if they show a picture of a huge fancy room and then give you a small standard room you will feel a little disapointed) but the room was very clean which can sometimes be a concern in Amsterdam, the bed was comfortable, the shower was hot. This isn't the hotels fault but there was huge building works going on across from the back of the hotel, across from our room, this started at about 7.30am and was very noisy The hotel could have warned us about this. We didn't complain as we were only there for two nights but I think it would have been a problem had we been staying any longer. The staff were friendly and polite.", "Date": "April 16, 2007"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Check in / front desk": "2", "Overall": "1.0", "Value": "1", "Rooms": "1", "Location": "5"}, "AuthorLocation": "Cardiff", "Title": "“Avoid if booking a Single room”", "Author": "Cantonian", "ReviewID": "UR7153319", "Content": "Chosen for its location which was excellent. Single room was very small. The shower room/toilet provided a new experience :- to shave or wash you had to stand in the shower which was immediately in front of the wash basin. Nowhere to hang wet towels The room like many others fronted the street and the noise was troublesome throughout the 3 nights I stayed. The breakfasts were quite good. One of the reception staff was rude but the others were pleasant. Had I not prepaid, I would have left this hotel either on arrival after inspecting the room or certainly after the first nights noise.", "Date": "March 13, 2007"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Business service (e.g., internet access)": "3", "Check in / front desk": "4", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Dublin", "Title": "“Great Location, spacious rooms, ideal for a group”", "Author": "DubNiall", "ReviewID": "UR6800604", "Content": "A large group of us were in Amsterdam for a stag last weekend and stayed in this hotel. We could not have made a better choice. Arriving late with a group of thirsty lads, it was important to get checked in, and out on the town as quickly as possible. The hotel is right across the road from Centraal station and we spotted it straight away. We were all checked in within about fifteen minutes and ready to hit the pubs. Again we found ourselves in the perfect position, with the hotel just around the corner from the RLD where a lot of the pubs and coffee shops are located. The hotel is about 10 minutes walk from Dam square and very close to trams and taxis to explore the city further, should you feel the inclination. We booked both twin and triple rooms and all were clean and very spacious. One of the twins (324) was in the annex and was more like an apartment with its own kitchen (minus a fridge). All of the rooms had a table and seating area, a TV with BBC as well as local channels, and some radio stations. Unfortunately I canâ€™t comment on the breakfast as I never made it, but I have been informed by other members of the group that it was good. The bar adjoining the hotel is a traditional Dutch â€˜brown barâ€™ and was perfect for an ice cold beer in the afternoon. I found that the staff were excellent, and were available to answer any queries before, during and after our stay there. After a quick poll of the group, some minor complaints were: - Only one key card per room â€“ awkward if you arrive home at different times. - The hotel bar closed fairly early and was not available for residents after hours. (Not a major issue as there are many bars within two minutes walk.) - The check out time of 11am is too early â€“ 12 would be better. Overall I would definitely stay here again and recommend it to anybody heading to Amsterdam in the future.", "Date": "February 16, 2007"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "Blackpool", "Title": "“Brilliant”", "Author": "daveoliveruk", "ReviewID": "UR6782006", "Content": "The hotel is located in an ideal place. Good food, helpful staff and very spacious room. It was quite noisy at night times but this is understandable considering the hotel is right on the edge of the red light district. Would recommend!", "Date": "February 12, 2007"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "groningen", "Title": "“storm!”", "Author": "johannesGroningen", "ReviewID": "UR6629020", "Content": "January 18th 2007 I was trapped by a big storm in Amsterdam and could not leave the city anymore. I was not the only one. Many people were looking for a hotel. So was I. I was lucky to find shelter in Hotel Prins Hendrik, just opposite the central railwaystation. The persons in charge were friendly and helpful. The room was extremely pleasant, spacious and tidy, with a perfect view on a beautiful spot of Amsterdam. Nevertheless the room was quiet. I enjoyed my stay and will certainly return! Anja van Berkum, The Netherlands", "Date": "January 20, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Derbyshire", "Title": "“Fantastic Hotel”", "Author": "Cherry1", "ReviewID": "UR6086935", "Content": "I have never been to Amsterdam before & researched & asked many questions on Trip Adviser before coming to Amsterdam. Prins Hendrik was recommended to me. We arrived later than expected due to a delayed flight & also we got on the wrong train from the Airport to Central Station. (Therefore didn;t arrive till after 11pm) Prins Hendrik is literaclly a 5 minute walk from Central Station & very easy to find. When I first saw the hotel, I thought it would be very noisy, but far from it, there was no noise at all. Mattijs greeted us in reception & advised us on where to go straight away if we fancied going out. Which we did. The hotel room was huge, very spacious with plenty of storage space in the room for our belongings. The beds were very comfortable with very large comfy pillows. Breakfast is served in the morning until 10am. There was a good choice for a continental breakfast, fortunately I bought some Tetley teabags with me, as I didn't like the tea, but that is just my taste. The hotel is fantastically situated near everything you would want to do & see. When I arrived at the hotel, I mentioned that the hotel was recommended to me from someone from TripAdviser & Mattijs made us most welcome, searched on the internet for restaurants for us, advised on the best places to go, it was a very nice personal touch. I can't wait to re-vist Amsterdam, but will only stay at Prins Hendrik. The best hotel, with the best Service & the Best reception staff - Sante (Cheers) Mattijs. x x x", "Date": "November 8, 2006"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Zumbrota, Minnesota", "Title": "“Good choice to stay at”", "Author": "tlmeyer", "ReviewID": "UR5722817", "Content": "This was the perfect place for us to stay in Amsterdam. It was me, my wife & 2 young adult daughters. The location is perfect, close to the train station & many places in Amsterdam. The room was very nice. We got the top floor room with 4 beds. It was large for Europe & nice view. Small but adequate bath. Most the workers were very nice. One guy seemed crabby all the time but we only had to walk past him. Don't recall the exact price but recall it was worth the money. The morning breakfast was excellent.", "Date": "August 29, 2006"}, {"Ratings": {"Service": "1", "Cleanliness": "5", "Business service (e.g., internet access)": "4", "Check in / front desk": "4", "Overall": "3.0", "Value": "4", "Rooms": "3"}, "AuthorLocation": "UK", "Title": "“Nice enough place”", "Author": "BarBar777", "ReviewID": "UR5557814", "Content": "Quite a nice hotel in general. Its 2 minutes away from Centraal station. Canal cruises. All the cuisine you could want. Chinese, indian, thai, english and more. Coffee shop just round the corner literally 2 minutes walk with good prices. Hotel could do with air con and a fridge. Rooms are cleaned on a daily basis and someone comes round to check to see if your happy. A continental breakfast is served from 7am-10.15am they have a bar and a resteraunt quite reasonable prices. The staff are helpful and your allowed to smoke in the rooms. Smoking is practically accepted everywhere in Amsterdam even in McDonalds. The red light district is also about 3-4 minutes walk round the corner of the hotel and is well worth visiting. The only things you have to mind is which way the trams, bikes and cars are going and then your safe lol. Overall I rate thias hotel 3.5/5 and to try and get a good deal on the rates go to easytobook got 3 nights for 330 euro for 2 sharing which is less than there own website rates", "Date": "August 5, 2006"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Business service (e.g., internet access)": "3", "Check in / front desk": "3", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Rome", "Title": "“Good choice for guys”", "Author": "Daphiel", "ReviewID": "UR5510162", "Content": "Prins Hendrik hotel is an economic good choice for your holiday in Amsterdam. Is near the central station (less than 1 km) and up Warmoestraat for smokers wanna visit coffee-shops, TV is included in the room, breakfast 8-10 a.m., it's a clean place and the staff is cordial and patient. The solution for 4 guests is the more economic.", "Date": "July 25, 2006"}, {"Ratings": {"Cleanliness": "5", "Overall": "2.0", "Value": "3", "Service": "4", "Rooms": "2"}, "AuthorLocation": "Yorkshire, England", "Title": "“Reasonable hotel, shame about the noise.”", "Author": "A TripAdvisor Member", "ReviewID": "UR5458150", "Content": "Beware: Very central, but lots of street noise and no double glazing. Take your earplugs. I wasn't happy about the first room we got, number 217, overlooking the Station. It was very big, but basic, with nowhere to put clothes and the most uncomfortable bed I ever had. I had to put the mattress on the floor to be able to sleep. However the next day Cor the receptionist arranged for us to change rooms to one at the back, number 221, that was a lovely room, modern and well fitted. So if the room you get isn't satisfactory, asked to be swopped. I found the staff to be friendly and helpful. The breakfast room was dingy but that is the style for Amsterdam and the food was OK if uninspiring.", "Date": "July 12, 2006"}, {"Ratings": {"Cleanliness": "3", "Overall": "1.0", "Value": "1", "Service": "1", "Rooms": "3"}, "AuthorLocation": "Chesham England", "Title": "“Pretty Awful”", "Author": "StuartJG", "ReviewID": "UR5222040", "Content": "Stayed at the Prins Hendrick for two nights on business trip with my wife. Location very good. Reception staff need a lesson in manners. Room was not in main building but across the Street, wouldn't have been a nice loaction for a lady on her own. Tip if you check in, don't have Room 37. Room good size and very spacious bathroom and to be honest all very clean. Breakfast was shambolic. Really scruffy dingy breakfast room, staff not interested. Poor selection, really help yourself situation. clearing tables etc Cups, no saucers. Never bothered the second morning checked out early and had good breakfast at airport. Astronomical cost 130 euros a night ( Â£93). Have stayed at many hotels in over 40 countries and this has got to be the worst. Avoid at all cost.", "Date": "May 26, 2006"}, {"Ratings": {"Cleanliness": "3", "Overall": "3.0", "Value": "2", "Service": "3", "Rooms": "2"}, "AuthorLocation": "Italy", "Title": "“OK by Amsterdam standards”", "Author": "Karena_Italy", "ReviewID": "UR5014000", "Content": "I had a lot of difficulty trying to find a room in Amsterdam one weekend in April. I normally book through one of the travel websites but on this occasion, none of them gave me anything within my budget for the dates requested. I therefore e-mailed nearly 80 hotels and B&Bs (I'm not joking) and got positive replies from only 3 or 4, among whom was the Prins Hendrik. So I definitely did not choose this hotel based on reviews or anything. And for â‚¬150 per night for a double I thought it was expensive. As mentioned by other reviewers, the hotel is convenient to get to upon arrival at the Centraal Station. Our room was very big actually but it was extremely dated and not well-maintained (toilet flush was coming apart), our wardrobe also acted as a storage room for the hotel (an unused bidet and a toilet were stored away in there!). There was no finesse to the place at all, e.g. different parts of the curtains were made of different material. There were some stains on the duvet but let's not get into that. The room was cleaned everyday to a good standard though, and they changed our towels everyday. Our room overlooked the main road and so yes, it was fairly noisy... but we were so tired from walking around all day round Amsterdam we hardly noticed it after we hit the sack. Our bed was also quite far from the window which helped. The guy at reception told us that breakfast was very good, and I guess it was, for 3* standards. We had cold cuts, bacon and scrambled eggs, cereals, jams and different breads, coffee and tea, and juice. Only oranges for fruit. There were lots of tables for breakfast so am not sure why some people complained abt not having seats. All in all, I'd say that looking around at some of the other hotels around Amsterdam, the Prins Hendrik was about average. I get the feeling that Amsterdam is such a popular place for weekend visitors that these 2* and 3* hotels have no real interest in really offering something special to their guests.", "Date": "April 27, 2006"}, {"Ratings": {"Cleanliness": "4", "Overall": "4.0", "Value": "3", "Service": "3", "Rooms": "4"}, "AuthorLocation": "brighton uk", "Title": "“Great hotel well worth it”", "Author": "seebass", "ReviewID": "UR4999412", "Content": "Me and my friend stayed at prins hendrik in february 2006 and the room was very good. It was not attached to the hotel which was a bonus because we like to smoke the weit and no one minded about that never made it to breakfast so i cant comment on it but i am staying there again in june of this year just because i thought it was a very nice hotel. The location is probably the best point to it 10m from warmoestraat and centraal station which makes it very easy to find when checking in. Next time i will try the breakfast and ill let you all know if its worth it. No kettle in room so no tea and as im english thats just not right you need a cuppa in tha morning.", "Date": "April 24, 2006"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "shropshire", "Title": "“excellent hotel”", "Author": "cockatoo", "ReviewID": "UR4831821", "Content": "Clean, Good food, Excellent staff, Very freindly people. good value for money as everything included (breakfast & taxes). Good location, just opposite central station and tram station and around the corner for everything else. Excellent selection of tourist information in the foyer and in rooms. you must go on the walking tour, buy a guide of old city from hotel reception.", "Date": "April 3, 2006"}, {"Ratings": {"Cleanliness": "5", "Overall": "4.0", "Value": "3", "Service": "4", "Rooms": "5"}, "AuthorLocation": "Dublin, Ireland", "Title": "“Great location, fabulous hotel”", "Author": "A TripAdvisor Member", "ReviewID": "UR4518828", "Content": "I'd stayed in this hotel from 22nd Feb to 24th Feb 2006. The hotel is directly facing the train station. Five minutes walk to Dam Square, Red Light District and Chinatown. I booked a triple room and we got a room on the second floor. Very spacious room and the bathroom is very big for my sister to move around in her wheelchair. Our room is to the front and overlooking Centraal Station. Breakfast was really nice. The only problem was the window is not double glazed and in the morning the traffic noise can be a little annoying.", "Date": "February 25, 2006"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Donegal Town, Ireland", "Title": "“Warm, friendly staff.”", "Author": "MARTINMAC", "ReviewID": "UR4422369", "Content": "Enjoyed our short stay, friendly relaxing atmosphere, central location excellent, staff pleasant and helpful. Rooms basic, but more than adequate for our needs Would definitley come back.", "Date": "February 6, 2006"}, {"Ratings": {"Cleanliness": "2", "Overall": "3.0", "Value": "2", "Service": "4", "Rooms": "3"}, "AuthorLocation": "Manchester, UK", "Title": "“Worth the money”", "Author": "AC_manchester", "ReviewID": "UR4398282", "Content": "2 friends and i stayed @ this hotel over christmas. you get what you pay for and this is true @ prins hendrik, the room are clean, bathroom clean. the staff friendly! infact I booked directly (at a discounted rate) from the hotel then searched the internet and found the same hotel cheaper hotels, printed off the better price/rate and the gent who checked us in was kind enough to call the manager and get us the better rate. dont expect your getting a 5 or 4 star hotel cause you wont! its not its a 3 star! having said that the breakfast was better than a 4 star where i stayed in Jan 05. the location is very close to centraal train station. it can get noisy (outside) but if ur hotel room and not out enjoying urself stay @ home! all in all the staff make this hotel, they are friendly enough but dont be late for brekkie cause they dont play that! and dont expect the world of this place cause its a place to sleep eat breakie. they do have comfie couches @ the front desk.", "Date": "January 30, 2006"}, {"Ratings": {"Cleanliness": "1", "Overall": "1.0", "Value": "1", "Service": "1", "Rooms": "1"}, "AuthorLocation": "USA", "Title": "“Avoid the Prins Hendrik unless you want a dirty, noisy room”", "Author": "A TripAdvisor Member", "ReviewID": "UR4300863", "Content": "My husband and I visited Amsterdam in September for 4 nights. We chose to stay in the Prins Hendrik after reading some of the positive reviews on this site. However, the only positive thing we can say about this hotel was that it was close to the train station. When we arrived at the hotel, we observed that the lobby was small and not particularly inviting, but we still hoped that the room would be nice. We were very disappointed. The room was filthy; the towels were grey from being so dirty, and were so worn out you could see through them. The bathroom was dirty, the bedding was shabby, and there was tons of noise in the room from the street. We were so disgusted with our room that we actually left the Prins Hendrik and went to another nearby hotel, which was much nicer for basically the same price. I would recommend that other travellers look elsewhere than the Prins Hendrik.", "Date": "December 26, 2005"}, {"Ratings": {"Cleanliness": "3", "Overall": "4.0", "Value": "3", "Service": "3", "Rooms": "4"}, "AuthorLocation": "wales", "Title": "“very good”", "Author": "A TripAdvisor Member", "ReviewID": "UR3289033", "Content": "Clean and comfortable, large rooms, excellent hot/cold buffet breakfast included.", "Date": "March 20, 2005"}], "HotelInfo": {"Name": "Hotel Prins Hendrik", "HotelURL": "/ShowUserReviews-g188590-d237575-Reviews-Hotel_Prins_Hendrik-Amsterdam_Noord_Holland.html", "Price": "$120 - $340*", "Address": "<address class=\"addressReset\"><span rel=\"v:address\"><span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">Prins Hendrikkade 52 - 57</span>, <span class=\"locality\"><span property=\"v:locality\">Amsterdam</span> <span property=\"v:postal-code\">1012 AC</span></span>, <span class=\"country-name\" property=\"v:country-name\">The Netherlands</span> </span></span></address>", "HotelID": "237575", "ImgURL": "http://media-cdn.tripadvisor.com/media/ProviderThumbnails/dirs/a0/7f/a07f053239c236bd9bfd584f701d966a7large.jpg"}}