{"Reviews": [{"Content": "Amazing staff, made our stay We loved our stay at this hotel. Perfect location and the amazing staff really made our stay. A nice desk clerk recommended two amazing restaurants and places to go out at night after. The guy really went out of his way for us letting us use his computer at the front desk to check internet. Then another staff member was so worried we wouldnt get a message from a friend she kept checking to see if we were back until we got it. They were all so nice. While the second floor of a walk up and a shower over the toilet may not be ideal for many older travelers, the price plus the service made it just perfect for us. I highly recommend it.", "Date": "Nov 11, 2008", "ReviewID": "UR842505196", "Ratings": {"Service": "5", "Business service": "-1", "Cleanliness": "4", "Check in / front desk": "5", "Overall": "5", "Value": "5", "Rooms": "3", "Location": "5"}, "Author": "rachelia18"}, {"Content": "Perfect Location We actually stayed in the apartment behind the hotel. We think it was just converted to an apt from possibly being a shop of some sort. The entrance was all glass with an awning, like a store, but they had big curtains to give you privacy. It was so far into the courtyard, nobody came by anyways. We don't think all the renovation work was completed as some stuff seemed unusual, like machinery in the corner and odd chemicals under the sinks. However it was huge! It was very clean!! It was extremely private and quiet!! It had a living room with sofa bed and a big bedroom, kitchen and bathroom. The oven wasn't working yet. The fridge was the biggest I saw in Italy. We really enjoyed it. The breakfast at the hotel was better than most in Italy. Croissants, cereal, fruit, juice, bread, and cakes. The staff was very helpful. The location is excellent; a very quiet street but 3 minutes from the Duomo and several churches that gave free concerts every night. and other night activites.", "Date": "Jul 18, 2008", "ReviewID": "UR941730559", "Ratings": {"Service": "5", "Business service": "2", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5", "Value": "5", "Rooms": "5", "Location": "5"}, "Author": "ampanmangal"}, {"Content": "Not coming again I didn't like this hotel at all. First, the shower was right in the middle of the bathroom were everything get wet since it doesn't have curtain. Sometime the water didn't drain well and we end with a mini pool in the bathroom. The room was a little opaque. The hotel was at the third floor, for them at the second floor. The hotel was at walking distance from the Duomo, Galleria and Uffizi. Be careful when you are taking the bus, can get a little confusing, at first we were toward the other way, we return to the Duomo and walk to the hotel. I will not return to this hotel.", "Date": "Jun 17, 2008", "ReviewID": "UR437622238", "Ratings": {"Service": "-1", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "2", "Value": "-1", "Rooms": "-1", "Location": "-1"}, "Author": "kariluz"}, {"Content": "A quiet place in the heart of Florence Spent 4 nights here in mid-May in a room with 3 beds, although we had requested a double room. The room was very large, light and airy. The hotel is far from glitzy but there were so many things we liked about it:- great central location- room facing a very quiet courtyard- great management and employees- nice breakfastRight across from the hotel there is a small bakery selling two-bite pizzas with great toppings - if you stay there, try the sauteed onions or the porcini.Nice place, will stay there again.", "Date": "Jun 9, 2008", "ReviewID": "UR615451051", "Ratings": {"Service": "5", "Business service": "-1", "Cleanliness": "4", "Check in / front desk": "4", "Overall": "5", "Value": "4", "Rooms": "4", "Location": "4"}, "Author": "travelz0ne"}, {"Content": "Good Budget Option We just returned from 5 days in Albergo Chiazza - yes it is 2 flight walk up - but this was no problem for me and my daughter - we travel light and are in good-ish shape. The room was comfortable - it was cold when we first arrived, but after the heat came on the rest of the time was fine. It was quiet in general. The staff were pleasant, the room cleaned well every day. There was an a/c and a TV in the room, but we didn't use either - so I can't comment. The beds were comfy, the bathroom was as others described with a shower not enclosed by anything but a curtain - BUT - the water pressure was good and the water nice and HOT - can be difficult to find in budget hotels. Breakfast was good, although after 5 days, I was looking for a little more variety - maybe a banana or cheese here and there - not really a big issue though. The staff arranged to have a cab meet us at the crack of dawn (6am) to go to the airport and thankfully it was there with time to spare. The location was fantastic - we were two women alone and did not feel unsafe once, even late at night. There is apparently a good restaurant across the street, but it didn't look like it would fit our budget, so I didn't try it - it seemed very popular with locals though. In short, they offered us a great price with perfectly adequate accomodations, safe, clean, quiet and hot water which enabled us to visit for 5 days -- bellissimo!", "Date": "Feb 6, 2008", "ReviewID": "UR629047785", "Ratings": {"Service": "5", "Business service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "4", "Value": "4", "Rooms": "-1", "Location": "5"}, "Author": "Pennystinker1"}, {"Content": "Great place to Stay I was about sick reading some of these crybaby reviews about the Albergo Chiazza...My fiancee and I styed there in June for 3 nights and had a great stay. On our 2 week trip to Italy, this was probably the best place we stayed. I liked it so much I recommended it to my sister and she stayed too (and loved it). I should mention that we were on a tight budget, but we ddi stay at 3-4 other places at around 80-120 Euro/night and this was the most for the money.Location:Superb. Not right in teh heart of the city center (ie, Duomo), but only about a 10 minute walk. Its actually close to the Accademia (David) and not far from Uffizi, either. Plus, it gets you to side of town you might not otehrwise go to. Tucked into an alley way with a real Italian neighborhood feel--it really worked for us!Staff:some of teh most pleasant people we met. it wasnt crowded when we were there so we got the royal treatment--like a personal concigere. breakfast was great tooRooms:Now this was probably the only place I stayed with AC the whole time and it was great. Much better than a hostle. we had no issues with the AC working, although I do not recall a control unit in teh room. The bed was fine...no real memory of it though. The shower was down the hall for us, but we knew that going in so it wasnt bad (or different from pretty much anywhere else we stayed).", "Date": "Feb 2, 2008", "ReviewID": "UR926913205", "Ratings": {"Service": "5", "Business service": "-1", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5", "Value": "5", "Rooms": "5", "Location": "5"}, "Author": "FLguy22"}, {"Content": "I can't belive that!!!!!!! I booked a room for 5 nights in this hotel back in May for a trip in May. As my plans changed I had to cancel the 5 nights. They were able to charge all amount due. I can't belive that!!!!!!!", "Date": "May 26, 2007", "ReviewID": "UR149775019", "Ratings": {"Service": "1", "Business service": "1", "Cleanliness": "1", "Check in / front desk": "1", "Overall": "1", "Value": "1", "Rooms": "1", "Location": "1"}, "Author": "sanrocco"}, {"Content": "excellent budget hotel we have just returned from a 4 night stay at the Chiazza with a group of friends. For a budget hotel it was excellent.It was in a really good location, very clean ,adequate breakfast and the staff were very helpful. We felt extremely safe in the area even late at night. If you are just looking for a place to rest your head at night, nothing fancy, you will certainly not be disappointed in booking the Chiazza. Florence, by the way, is a lovely city.", "Date": "Oct 11, 2006", "ReviewID": "UR348202508", "Ratings": {"Service": "4", "Business service": "3", "Cleanliness": "4", "Check in / front desk": "4", "Overall": "3", "Value": "3", "Rooms": "3", "Location": "5"}, "Author": "dovedale"}, {"Content": "Mosquitos of Florence My wife has already reviewed this property (Not as advertised) and although I agree with what she wrote, I think our experience was even worse than she described and would like to add a few comments of my own.We spent several weeks travelling throughout Italy, staying mostly in moderately priced hotels in good locations. I picked the hotels we stayed in and my criteria were that they had to be within walking distance of the main sights, have air conditioning, and be reasoonably priced. I knew it would be hot and Italy and I knew that air conditioning was uncommon and would cost extra. I was willing to pay extra for it and based on these criteria, I picked Chiazza for our stay in Florence. Although almost all the hotels we stayed in turned out to be great, Chiazza was a disaster.I had never been to Florence before and was worried about choosing a place that would be too far to walk to the city center. I don't like taking buses, even in the states, so I didn't want to have to use them in Italy, nor did I want the cost or hastle of using taxis. Chiazza's location was excellent, close enough to everything that it was a short walk, but not so close that you hear noisy carousing outside your window. I can't complain about the location except to say that I needn't have worried so much about being that close to the city center-- we could have stayed farther away and still been within a reasonable walking distance.The air-conditioning, which I viewed as essential when selecting our hotels, did not work at any point during our stay, nor did the staff seem to find this unusual or make any great effort to fix it. In fact, they claimed they HAD turned it on, despite the fact that the room did not get any cooler. We ultimately had to resort to opening the windows. That would have been fine, if it had actually cooled the room (it did a little, but not to the point of being comfortable). Worse, though, was when I started hearing the mosquitos buzzing about our room as I attempted to sleep. Having been compelled to open the windows to cool the room off, we now had to contend with mosquitos. I didn't realize I needed to bring mosquito nets on a trip to Florence. I hate mosquitos. I really, really hate them. Trying to sleep in the sticky summer heat was one thing, but it was impossible to get any proper sleep while I listened to the mosquitos buzz around our room. In retrospect, I probably should have gone to an Internet cafe and found us another hotel in Florence. The possibility of doing that did not occur to me at the time, though.There are probably people reading this who think I am making a big deal over nothing. For some people, air-conditoning is just a luxury and mosquitos might be annoying but aren't a big deal. But it was a big deal for me and I chose this hotel over other cheaper hotels because it had air-conditioning and because I wouldn't have to worry about spending the night being devoured by bloodthirsty insects. I paid extra for that and didn't get what I paid for.So, if you don't care about air-conditioning, I would recommend choosing one of the many cheaper hotels in Florence that don't have air-conditioning. If you do want air-conditioing, then you should pick a different hotel, which might cost more but will actually give you what you want. The only person this hotel would appeal to might be a gambler-- who wants to pay extra on the off chance that they might be luckier than we were.", "Date": "Sep 11, 2006", "ReviewID": "UR862158494", "Ratings": {"Service": "1", "Business service": "1", "Cleanliness": "2", "Check in / front desk": "1", "Overall": "1", "Value": "1", "Rooms": "1", "Location": "5"}, "Author": "idomeneus"}, {"Content": "Great hotel for the location and price I was really happy with this hotel. It was close to the duomo (6 minute walk), it had AC in the room, was very reasonably price, was safe for a single female traveller, and had a great breakfast. Another perk is that I showed up early in the morning, and they were able to accomodate me to the room which really helped since I was exhausted from the travel. Definitely recommend it!", "Date": "Aug 12, 2006", "ReviewID": "UR277373976", "Ratings": {"Service": "-1", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "5", "Value": "-1", "Rooms": "-1", "Location": "-1"}, "Author": "Dittosparkle"}, {"Content": "Great on a budget We stayed for 3 nights at the Albergo Chiazza and had a very pleasant stay.The hotel itself is in a great location - about 5 minutes walk from the Duomo. It is also on a pedestrianised street (or as 'pedestranised' as you can get in Italy!) so we didn't have any noise in the room at night. Be aware that the hotel is up two flights of steps, but we managed to walk from the train station to the hotel with our backpacks and survive! The staff were all friendly and helpful, and spoke decent English. The breakfast selection was perfectly adequate, with a nice selection of cakes, which was a treat for us!Our room itself was fine, we had a large double room with ensuite. As already mentioned in other reviews, our bathroom wasn't great...it was quite small and dark, and as the shower is open we found that a long shower tended to get water all across the bathroom floor. We didn't have a problem with the temperature in our room, as we had a large opening window with a flyscreen. Apart from that, the room was clean and well presented.Overall, good value and quality for a hotel of this rating.", "Date": "Jul 8, 2006", "ReviewID": "UR192776850", "Ratings": {"Service": "4", "Business service": "-1", "Cleanliness": "3", "Check in / front desk": "-1", "Overall": "4", "Value": "4", "Rooms": "4", "Location": "-1"}, "Author": "julesguest"}, {"Content": "Not as advertised On the plus side: good location, a few blocks from the Duomo and Campanile. For a budget option, it didn't feel particularly unsafe or dirty. It's fairly unattractive on the inside (ugly bedspreads, puke-colored floors) and up several long flights of stairs when dragging luggage, but I more or less expected this for the price we paid. It was fairly quiet at night.Absolutely unacceptable is the fact that we chose it because it advertised air conditioning, and it emphatically did not have air conditioning. There was a bit of a run-around on the first night we got there about it, with one of the girls at the front desk mentioning something about having to ask the day manager. They claimed they turned it on, but our room never got one jot cooler. This might have been all right, since it was only the beginning of June, but the windows lacked screens. When we opened the windows in absolute desperation for some air, we were visited by every insect in Florence.Other problems: the breakfast was standard Italian fare, which would have been fine if the milk products had been properly refrigerated. The staff was indeed multilingual, but not particularly helpful. The shower is one of those European deals, with a shower head on the side of the wall and no stall. (Not a big deal if you're expecting it, but we weren't.)When we checked in after getting off a very delayed train, we learned that if we'd been just a few minutes later, the hotel would have closed, locking us out without accommodations for our first night in Florence. Be sure to arrive before midnight if you don't want this to happen to you.I used to edit budget Italian travel guides, and believe me when I tell you that there are better budget options out there, even in Florence. This is one of these places that looks great on the website but ultimately disappoints in almost every way.", "Date": "Jun 27, 2006", "ReviewID": "UR626174781", "Ratings": {"Service": "2", "Business service": "-1", "Cleanliness": "4", "Check in / front desk": "-1", "Overall": "2", "Value": "3", "Rooms": "2", "Location": "-1"}, "Author": "A TripAdvisor Member"}, {"Content": "Stay away!!! I booked a room for 2 nights in this hotel back in Feb for a trip in June. As my plans changed I had to cancel the 2nd night. I was only obliged to give 24 hrs notice but I gave them 1 weeks notice. They cancelled the booking for both nights saying that the would not be able to rent out the room for one night only. Absolute nonsense. They were able to charge a massive fee for the rooms as it is a holiday in Florence. Steer well clear. Very amateurish.", "Date": "Jun 18, 2006", "ReviewID": "UR367358295", "Ratings": {"Service": "-1", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "1", "Value": "-1", "Rooms": "-1", "Location": "-1"}, "Author": "lisbon1967"}, {"Content": "Okay, but some problems The hotel is in the heart of everything, but this also comes with a downside as there are quiet a few dodgy characters around. I can't say I felt that safe during our stay. Breakfast is just okay. The service was good, the girls were friendly and helpful. There's an internet connection in the hotel also and it's fast which is rare in Florence, so that's a plus. The rooms are ok, the bathrooms are an add on so they're tiny and uncomfortable. To be honest, I'd skip Florence all together and stay in nearby Tuscany, you're much more likely to enjoy your experience there and you can do a day trip to Florence to see the sights which is all you need.", "Date": "Jun 18, 2006", "ReviewID": "UR532773789", "Ratings": {"Service": "3", "Business service": "-1", "Cleanliness": "2", "Check in / front desk": "-1", "Overall": "3", "Value": "2", "Rooms": "3", "Location": "-1"}, "Author": "TripAdvisor1"}, {"Content": "Wonderful time We stayed 5 nights in the Chiazza, and were happy with the whole experience. Family run by a very nice couple (English isn't perfect, but all their employess speak it fine), who go out of their way to provide a friendly environment. Breakfast is a major cut above hotels costing twice as much in Rome (only thing we can compare to)--fresh croissants, great coffee (your choice if you want Espresso or American style), fresh fruit, tiramasu! Very helpful and friendly at the desk. And of course, great location and great price. The rooms vary radically in size, so if it's important to you ask for a larger room. The apartment on the courtyard is worth the little extra money if it's available. Yes, it's a 2 star hotel so don't expect luxury, but if you want honest value and friendly people, this is your place.", "Date": "Jun 9, 2006", "ReviewID": "UR847694494", "Ratings": {"Service": "4", "Business service": "-1", "Cleanliness": "5", "Check in / front desk": "-1", "Overall": "5", "Value": "5", "Rooms": "4", "Location": "-1"}, "Author": "A TripAdvisor Member"}, {"Content": "Great Budget Option, Wonderful Location We did a lot of searching beforehand and this was by far the cheapest double with private bathroom we could find in Florence. The rooms were a little outdated (wood paneling, 60's decor) and the TV had only one channel and static, but we didn't expect a television at all, so that was not an issue. The bathroom was bizarre, but aren't all European bathrooms I suppose. The staff was WONDERFUL and really accomodating. We could walk everywhere, to all the museums, to and from the train station (a bit lengthy, but not bad, even with our HUGE bags). We enjoyed this hotel and it was a steal for the price.", "Date": "Mar 28, 2006", "ReviewID": "UR393977401", "Ratings": {"Service": "4", "Business service": "-1", "Cleanliness": "3", "Check in / front desk": "-1", "Overall": "4", "Value": "4", "Rooms": "3", "Location": "-1"}, "Author": "kh80"}, {"Content": "A Florentine find!!! I stayed in the Albergo chiazza hotel in october 2005. It is a two star hotel but i would consider it a 3 star. It is located very near the duomo which is a big plus. The hotel is clean and the rooms are quite big. Breakfast is sufficient and it is very quiet at night time. There is also off street parking. The hotel is situated on the 3rd and 4th floor of a 4 storey building. This shouldnt put anyone off since it is in such a great location.", "Date": "Jan 29, 2006", "ReviewID": "UR663409118", "Ratings": {"Service": "-1", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "4", "Value": "-1", "Rooms": "-1", "Location": "-1"}, "Author": "SMurphyDublin"}, {"Content": "What a Bargain!!!! This hotel was absolutely fantastic, right in the centre of Florence only a 2 minute walk from the Duoma and a short taxi ride from the station (cost about 8 Euros). I booked the hotel on Venere and it was only 60 Euros per night for a double/twin room (including continental breakfast - which despite not having a huge choice was tasty!), Chiazza was a really nice and very clean hotel (room cleaned daily), the staff were really helpful and hotel had internet access very helpful if like us you are planning your onward jorney as you go! The only downside is that the hotel is on the third floor so be prepared to have to walk your luggage up some stairs! Would highly recommend this hotel! :-)", "Date": "Aug 25, 2005", "ReviewID": "UR418619155", "Ratings": {"Service": "-1", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "5", "Value": "-1", "Rooms": "-1", "Location": "-1"}, "Author": "LozzieL"}, {"Content": "Solid budget option The good:- Location - the hotel is right in the heart of town. Very close to the Duomo and other attractions.- Clean rooms- Price (very cheap, especially given where it's located in town)- Pretty good breakfast included in room price- Internet access, although it's a bit priceyThe bad:- Although the hotel claims all rooms have TV, mine did not. But it's better to be out exploring Florence than inside watching TV anyway. No major loss.- Some rooms don't have independent A/C (they're connected to the central A/C system instead) - mine was a bit warmer than I would have preferred, although it wasn't unbearable.The ugly: -Some rooms have their own bathrooms; I would strongly recommend these. The shared bathroom for the other rooms may save some money, but it has a very odd setup (the shower is next to the toilet, so only one person can be in the room at a time) that isn't very helpful.Overall: If you're willing to pay a hair more to get a room with its own bathroom, then this is a very strong budget option with a great location.", "Date": "Jul 27, 2005", "ReviewID": "UR757826027", "Ratings": {"Service": "4", "Business service": "-1", "Cleanliness": "5", "Check in / front desk": "-1", "Overall": "4", "Value": "5", "Rooms": "3", "Location": "-1"}, "Author": "A TripAdvisor Member"}, {"Content": "Molto gentili e disponibili   showReview(21539251, 'full');", "Date": "Nov 4, 2008", "ReviewID": "UR811828614", "Ratings": {"Service": "4", "Business service": "4", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "4", "Value": "4", "Rooms": "4", "Location": "5"}, "Author": "zedas4"}, {"Content": "Cumplieron ampliamente con lo...   showReview(21391962, 'full');", "Date": "Oct 13, 2008", "ReviewID": "UR559166704", "Ratings": {"Service": "4", "Business service": "-1", "Cleanliness": "5", "Check in / front desk": "-1", "Overall": "4", "Value": "5", "Rooms": "5", "Location": "-1"}, "Author": "lass="}, {"Content": "LA QUALITA' DELL'HOTEL E...   showReview(20628816, 'full');", "Date": "Sep 22, 2008", "ReviewID": "UR853359859", "Ratings": {"Service": "3", "Business service": "-1", "Cleanliness": "3", "Check in / front desk": "-1", "Overall": "3", "Value": "3", "Rooms": "4", "Location": "-1"}, "Author": "lass="}, {"Content": "H么tel bien situ茅, 脿 20mn 脿...   showReview(20548830, 'full');", "Date": "Sep 20, 2008", "ReviewID": "UR971332050", "Ratings": {"Service": "4", "Business service": "-1", "Cleanliness": "4", "Check in / front desk": "-1", "Overall": "4", "Value": "4", "Rooms": "4", "Location": "-1"}, "Author": "lass="}, {"Content": "D茅passement des attentes: non...   showReview(19492940, 'full');", "Date": "Aug 7, 2008", "ReviewID": "UR818440539", "Ratings": {"Service": "4", "Business service": "-1", "Cleanliness": "4", "Check in / front desk": "-1", "Overall": "4", "Value": "3", "Rooms": "5", "Location": "-1"}, "Author": "lass="}, {"Content": "Si no tienes un sitio mejor...   showReview(19190048, 'full');", "Date": "Jul 21, 2008", "ReviewID": "UR592675180", "Ratings": {"Service": "3", "Business service": "-1", "Cleanliness": "3", "Check in / front desk": "-1", "Overall": "2", "Value": "2", "Rooms": "3", "Location": "-1"}, "Author": "lass="}, {"Content": "Das einfache Hotel liegt in...   showReview(16732076, 'full');", "Date": "May 26, 2008", "ReviewID": "UR267905265", "Ratings": {"Service": "5", "Business service": "-1", "Cleanliness": "5", "Check in / front desk": "-1", "Overall": "4", "Value": "5", "Rooms": "5", "Location": "-1"}, "Author": "lass="}, {"Content": "Bon petit B   showReview(16731435, 'full');", "Date": "May 4, 2008", "ReviewID": "UR911352590", "Ratings": {"Service": "5", "Business service": "-1", "Cleanliness": "5", "Check in / front desk": "-1", "Overall": "4", "Value": "5", "Rooms": "3", "Location": "-1"}, "Author": "lass="}, {"Content": "H么tel familial tr猫s sympa   showReview(13274391, 'full');", "Date": "Jan 25, 2008", "ReviewID": "UR240840243", "Ratings": {"Service": "5", "Business service": "-1", "Cleanliness": "4", "Check in / front desk": "-1", "Overall": "4", "Value": "4", "Rooms": "4", "Location": "-1"}, "Author": "lass="}, {"Content": "Ottimo hotel centralissimo...   showReview(13222923, 'full');", "Date": "Jan 23, 2008", "ReviewID": "UR393292687", "Ratings": {"Service": "4", "Business service": "-1", "Cleanliness": "4", "Check in / front desk": "-1", "Overall": "4", "Value": "5", "Rooms": "5", "Location": "-1"}, "Author": "lass="}, {"Content": "Chambre correcte. Seul...   showReview(12778897, 'full');", "Date": "Jan 9, 2008", "ReviewID": "UR234271226", "Ratings": {"Service": "3", "Business service": "-1", "Cleanliness": "4", "Check in / front desk": "-1", "Overall": "3", "Value": "3", "Rooms": "4", "Location": "-1"}, "Author": "lass="}, {"Content": "Kann dieses Hotel sehr...   showReview(11353631, 'full');", "Date": "Dec 5, 2007", "ReviewID": "UR906853836", "Ratings": {"Service": "5", "Business service": "-1", "Cleanliness": "5", "Check in / front desk": "-1", "Overall": "5", "Value": "5", "Rooms": "4", "Location": "-1"}, "Author": "lass="}, {"Content": "Hotel molto ben situato: a...   showReview(11353630, 'full');", "Date": "Dec 4, 2007", "ReviewID": "UR358059349", "Ratings": {"Service": "5", "Business service": "-1", "Cleanliness": "5", "Check in / front desk": "-1", "Overall": "4", "Value": "5", "Rooms": "4", "Location": "-1"}, "Author": "lass="}, {"Content": "Addetti professionali e molto...   showReview(12649026, 'full');", "Date": "Dec 2, 2007", "ReviewID": "UR356558190", "Ratings": {"Service": "5", "Business service": "-1", "Cleanliness": "4", "Check in / front desk": "-1", "Overall": "4", "Value": "4", "Rooms": "5", "Location": "-1"}, "Author": "lass="}, {"Content": "L'hotel 猫 molto centrale...   showReview(11353636, 'full');", "Date": "Nov 18, 2007", "ReviewID": "UR315756762", "Ratings": {"Service": "4", "Business service": "-1", "Cleanliness": "4", "Check in / front desk": "-1", "Overall": "4", "Value": "4", "Rooms": "3", "Location": "-1"}, "Author": "lass="}, {"Content": "Nous avons pass茅 3 nuits 脿...   showReview(11353635, 'full');", "Date": "Nov 18, 2007", "ReviewID": "UR693182784", "Ratings": {"Service": "5", "Business service": "-1", "Cleanliness": "5", "Check in / front desk": "-1", "Overall": "5", "Value": "5", "Rooms": "3", "Location": "-1"}, "Author": "lass="}, {"Content": "Al efectuar reserva no quedo...   showReview(11353638, 'full');", "Date": "Oct 20, 2007", "ReviewID": "UR890900751", "Ratings": {"Service": "2", "Business service": "-1", "Cleanliness": "3", "Check in / front desk": "-1", "Overall": "2", "Value": "2", "Rooms": "3", "Location": "-1"}, "Author": "lass="}, {"Content": "Nous avions choisi cet h么tel en...   showReview(11353637, 'full');", "Date": "Oct 18, 2007", "ReviewID": "UR585116600", "Ratings": {"Service": "4", "Business service": "-1", "Cleanliness": "4", "Check in / front desk": "-1", "Overall": "4", "Value": "4", "Rooms": "4", "Location": "-1"}, "Author": "lass="}, {"Content": "Firenze...   showReview(8840074, 'full');", "Date": "Sep 21, 2007", "ReviewID": "UR722587675", "Ratings": {"Service": "5", "Business service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5", "Value": "5", "Rooms": "5", "Location": "5"}, "Author": "nica8890"}, {"Content": "Excellente adresse pour un deux...   showReview(11353639, 'full');", "Date": "Aug 29, 2007", "ReviewID": "UR569137952", "Ratings": {"Service": "5", "Business service": "-1", "Cleanliness": "4", "Check in / front desk": "-1", "Overall": "5", "Value": "5", "Rooms": "5", "Location": "-1"}, "Author": "lass="}, {"Content": "Klasse! Dieses Hotel liegt nur...   showReview(11353641, 'full');", "Date": "Aug 5, 2007", "ReviewID": "UR372766107", "Ratings": {"Service": "5", "Business service": "-1", "Cleanliness": "5", "Check in / front desk": "-1", "Overall": "5", "Value": "5", "Rooms": "5", "Location": "-1"}, "Author": "lass="}, {"Content": "Buen hotel si se quiere eatr en...   showReview(11353643, 'full');", "Date": "Jun 5, 2007", "ReviewID": "UR909403425", "Ratings": {"Service": "4", "Business service": "-1", "Cleanliness": "5", "Check in / front desk": "-1", "Overall": "4", "Value": "4", "Rooms": "5", "Location": "-1"}, "Author": "lass="}, {"Content": "Hotel al 2掳piano di un vecchio...   showReview(11353646, 'full');", "Date": "May 9, 2007", "ReviewID": "UR888599563", "Ratings": {"Service": "4", "Business service": "-1", "Cleanliness": "5", "Check in / front desk": "-1", "Overall": "4", "Value": "5", "Rooms": "5", "Location": "-1"}, "Author": "lass="}, {"Content": "Les g茅rants sont tr猫s gentils...   showReview(11353645, 'full');", "Date": "May 3, 2007", "ReviewID": "UR958402475", "Ratings": {"Service": "5", "Business service": "-1", "Cleanliness": "5", "Check in / front desk": "-1", "Overall": "5", "Value": "5", "Rooms": "5", "Location": "-1"}, "Author": "lass="}, {"Content": "Excellent voyage, bon accueil...   showReview(11353632, 'full');", "Date": "Apr 22, 2007", "ReviewID": "UR714138367", "Ratings": {"Service": "4", "Business service": "-1", "Cleanliness": "5", "Check in / front desk": "-1", "Overall": "5", "Value": "5", "Rooms": "5", "Location": "-1"}, "Author": "lass="}, {"Content": "Situato vicinissimo al centro...   showReview(11353633, 'full');", "Date": "Apr 19, 2007", "ReviewID": "UR604842779", "Ratings": {"Service": "5", "Business service": "-1", "Cleanliness": "5", "Check in / front desk": "-1", "Overall": "5", "Value": "5", "Rooms": "5", "Location": "-1"}, "Author": "lass="}, {"Content": "La camera non 猫 male, ma nella...   showReview(11353634, 'full');", "Date": "Apr 13, 2007", "ReviewID": "UR435414149", "Ratings": {"Service": "3", "Business service": "-1", "Cleanliness": "3", "Check in / front desk": "-1", "Overall": "2", "Value": "3", "Rooms": "2", "Location": "-1"}, "Author": "lass="}, {"Content": "Un buon albergo a conduzione...   showReview(11353644, 'full');", "Date": "Apr 12, 2007", "ReviewID": "UR555922883", "Ratings": {"Service": "4", "Business service": "-1", "Cleanliness": "4", "Check in / front desk": "-1", "Overall": "3", "Value": "4", "Rooms": "4", "Location": "-1"}, "Author": "lass="}, {"Content": "1er s茅jour 脿 Florence et dans...   showReview(11353647, 'full');", "Date": "Mar 12, 2007", "ReviewID": "UR512441493", "Ratings": {"Service": "5", "Business service": "-1", "Cleanliness": "5", "Check in / front desk": "-1", "Overall": "5", "Value": "5", "Rooms": "5", "Location": "-1"}, "Author": "lass="}, {"Content": "Il rapporto...   showReview(11353649, 'full');", "Date": "Feb 1, 2007", "ReviewID": "UR201902847", "Ratings": {"Service": "5", "Business service": "-1", "Cleanliness": "4", "Check in / front desk": "-1", "Overall": "5", "Value": "5", "Rooms": "5", "Location": "-1"}, "Author": "lass="}, {"Content": "PERSONALE GENTILE, CAMERE AMPIE...   showReview(11353648, 'full');", "Date": "Jan 28, 2007", "ReviewID": "UR125922834", "Ratings": {"Service": "4", "Business service": "-1", "Cleanliness": "5", "Check in / front desk": "-1", "Overall": "4", "Value": "5", "Rooms": "4", "Location": "-1"}, "Author": "lass="}, {"Content": "Ottimo albergo situato in pieno...   showReview(11353650, 'full');", "Date": "Nov 13, 2006", "ReviewID": "UR589439235", "Ratings": {"Service": "4", "Business service": "-1", "Cleanliness": "5", "Check in / front desk": "-1", "Overall": "4", "Value": "4", "Rooms": "5", "Location": "-1"}, "Author": "lass="}, {"Content": "Onestamente un Hotel, Con poche...   showReview(11353651, 'full');", "Date": "Oct 5, 2006", "ReviewID": "UR734392748", "Ratings": {"Service": "3", "Business service": "-1", "Cleanliness": "3", "Check in / front desk": "-1", "Overall": "3", "Value": "4", "Rooms": "3", "Location": "-1"}, "Author": "lass="}, {"Content": "Pareja de espa帽oles jovenes de...   showReview(11353652, 'full');", "Date": "Oct 4, 2006", "ReviewID": "UR292328966", "Ratings": {"Service": "5", "Business service": "-1", "Cleanliness": "4", "Check in / front desk": "-1", "Overall": "4", "Value": "4", "Rooms": "5", "Location": "-1"}, "Author": "lass="}, {"Content": "Ok per un breve soggiorno. 2...   showReview(11353655, 'full');", "Date": "Sep 11, 2006", "ReviewID": "UR873775536", "Ratings": {"Service": "4", "Business service": "-1", "Cleanliness": "5", "Check in / front desk": "-1", "Overall": "4", "Value": "4", "Rooms": "4", "Location": "-1"}, "Author": "lass="}, {"Content": "Tr猫s bon s茅jour dans cette...   showReview(11353654, 'full');", "Date": "Aug 31, 2006", "ReviewID": "UR766109891", "Ratings": {"Service": "5", "Business service": "-1", "Cleanliness": "5", "Check in / front desk": "-1", "Overall": "5", "Value": "5", "Rooms": "5", "Location": "-1"}, "Author": "lass="}, {"Content": "L'h么tel est id茅alement situ茅...   showReview(11353653, 'full');", "Date": "Aug 28, 2006", "ReviewID": "UR307272925", "Ratings": {"Service": "5", "Business service": "-1", "Cleanliness": "5", "Check in / front desk": "-1", "Overall": "4", "Value": "4", "Rooms": "4", "Location": "-1"}, "Author": "lass="}, {"Content": "Hotel 脿 taille humaine tr猫s...   showReview(11353656, 'full');", "Date": "Apr 1, 2006", "ReviewID": "UR409321176", "Ratings": {"Service": "5", "Business service": "-1", "Cleanliness": "5", "Check in / front desk": "-1", "Overall": "5", "Value": "5", "Rooms": "4", "Location": "-1"}, "Author": "lass="}, {"Content": "70 euros et deux 茅toiles cela...   showReview(11353657, 'full');", "Date": "Mar 6, 2006", "ReviewID": "UR599153633", "Ratings": {"Service": "2", "Business service": "-1", "Cleanliness": "3", "Check in / front desk": "-1", "Overall": "2", "Value": "1", "Rooms": "2", "Location": "-1"}, "Author": "lass="}, {"Content": "POSITIF:TRES BIEN PLACE(centre...   showReview(11353659, 'full');", "Date": "Mar 1, 2006", "ReviewID": "UR445453218", "Ratings": {"Service": "5", "Business service": "-1", "Cleanliness": "5", "Check in / front desk": "-1", "Overall": "5", "Value": "5", "Rooms": "4", "Location": "-1"}, "Author": "lass="}, {"Content": "Non posso dire di essere...   showReview(11353658, 'full');", "Date": "Feb 22, 2006", "ReviewID": "UR216801760", "Ratings": {"Service": "2", "Business service": "-1", "Cleanliness": "3", "Check in / front desk": "-1", "Overall": "2", "Value": "2", "Rooms": "1", "Location": "-1"}, "Author": "lass="}, {"Content": "La stanza a 1 letto 猫 molto...   showReview(11353660, 'full');", "Date": "Jan 31, 2006", "ReviewID": "UR807524486", "Ratings": {"Service": "4", "Business service": "-1", "Cleanliness": "4", "Check in / front desk": "-1", "Overall": "4", "Value": "4", "Rooms": "3", "Location": "-1"}, "Author": "lass="}, {"Content": "La chambre est spacieuse,le...   showReview(11353661, 'full');", "Date": "Jan 3, 2006", "ReviewID": "UR981617501", "Ratings": {"Service": "4", "Business service": "-1", "Cleanliness": "5", "Check in / front desk": "-1", "Overall": "4", "Value": "4", "Rooms": "5", "Location": "-1"}, "Author": "lass="}, {"Content": "Un excellent rapport...   showReview(11353662, 'full');", "Date": "Dec 21, 2005", "ReviewID": "UR350329740", "Ratings": {"Service": "3", "Business service": "-1", "Cleanliness": "4", "Check in / front desk": "-1", "Overall": "4", "Value": "5", "Rooms": "3", "Location": "-1"}, "Author": "lass="}, {"Content": "Petit hotel tr猫s bien situ茅 au...   showReview(11353663, 'full');", "Date": "Nov 1, 2005", "ReviewID": "UR940221990", "Ratings": {"Service": "3", "Business service": "-1", "Cleanliness": "5", "Check in / front desk": "-1", "Overall": "4", "Value": "4", "Rooms": "4", "Location": "-1"}, "Author": "lass="}, {"Content": "Nettes, kleines Familienhotel...   showReview(11353665, 'full');", "Date": "Sep 11, 2005", "ReviewID": "UR474303562", "Ratings": {"Service": "5", "Business service": "-1", "Cleanliness": "5", "Check in / front desk": "-1", "Overall": "5", "Value": "5", "Rooms": "4", "Location": "-1"}, "Author": "lass="}, {"Content": "Nuestra estancia fue muy...   showReview(11353666, 'full');", "Date": "Aug 30, 2005", "ReviewID": "UR828320949", "Ratings": {"Service": "5", "Business service": "-1", "Cleanliness": "5", "Check in / front desk": "-1", "Overall": "5", "Value": "5", "Rooms": "5", "Location": "-1"}, "Author": "lass="}, {"Content": "La camera singola 猫 realmente...   showReview(11353664, 'full');", "Date": "Jul 28, 2005", "ReviewID": "UR799781463", "Ratings": {"Service": "1", "Business service": "-1", "Cleanliness": "3", "Check in / front desk": "-1", "Overall": "2", "Value": "1", "Rooms": "2", "Location": "-1"}, "Author": "lass="}, {"Content": "CENTRALISSIMO! ABBIAMO AVUTO...   showReview(11353667, 'full');", "Date": "Jul 27, 2005", "ReviewID": "UR752115788", "Ratings": {"Service": "5", "Business service": "-1", "Cleanliness": "4", "Check in / front desk": "-1", "Overall": "5", "Value": "5", "Rooms": "5", "Location": "-1"}, "Author": "lass="}, {"Content": "Preiswertes,zentral gelegenes...   showReview(11353669, 'full');", "Date": "Jun 12, 2005", "ReviewID": "UR324790546", "Ratings": {"Service": "5", "Business service": "-1", "Cleanliness": "5", "Check in / front desk": "-1", "Overall": "5", "Value": "5", "Rooms": "5", "Location": "-1"}, "Author": "lass="}, {"Content": "L'hotel ne correspond pas du...   showReview(11353671, 'full');", "Date": "Dec 28, 2002", "ReviewID": "UR993431981", "Ratings": {"Service": "2", "Business service": "-1", "Cleanliness": "3", "Check in / front desk": "-1", "Overall": "2", "Value": "1", "Rooms": "4", "Location": "-1"}, "Author": "lass="}, {"Content": "EXCELLENT RAPPORT QUALIT茅 PRIX...   showReview(11353672, 'full');", "Date": "Oct 11, 2002", "ReviewID": "UR233146314", "Ratings": {"Service": "4", "Business service": "-1", "Cleanliness": "4", "Check in / front desk": "-1", "Overall": "4", "Value": "3", "Rooms": "5", "Location": "-1"}, "Author": "lass="}], "HotelInfo": {"HotelURL": "http://www.tripadvisor.com/ShowUserReviews-g187895-d237513-r21751086-Chiazza-Florence_Tuscany.html", "HotelID": "237513", "Price": "$109"}}