{"Reviews": [{"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Stoke-on-Trent", "Title": "“Exactly as described - chic and basic”", "Author": "sdb_wm", "ReviewID": "UR127799473", "Content": "A lovely unpretentious hotel, friendly staff, quiet clean room, simple modern furnishings and the website description is accurate. We had a room on the third floor with canal views and it was worth paying a little more for this. It was exactly what we'd hoped for.", "Date": "April 13, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "3", "Rooms": "5", "Location": "5"}, "AuthorLocation": "High Wycombe, United Kingdom", "Title": "“Chic, quaint, but more than basic! The perfect accomm for our weekend away.”", "Author": "DanAndLiz L", "ReviewID": "UR127618653", "Content": "Situated less than 5 minutes walk away from Amsterdam Centraal Train Station, this hotel was perfect my boyfriend and I's short weekend away. Hotel staff on reception were extremely friendly and helpful, offering recommendations for the best coffee houses and restaurants in town. The fact that the reception is open 24/7 is also a plus. Breakfast was downstairs in a little kitchenette, where they offered a help-yourself selection of toast, jams, marmalade and a coffee machine. This was explained on the website and was exactly as expected so nothing to complain of from our end! Some couples brought cheese and ham along with them as well to the breakfast, but toast + jam suited us just fine. The coffee machine was available all day which was great for a quick pick-me-up latte as you're walking past to your room! Our room was the attic room, which was so lovely and surpassed our expectations. A good size, extremely clean and it provided the basics for what we needed for our short weekend away. The shower in the en-suite was my highlight; a huge walk-in shower occupied half the bathroom! I would say the only downside, (and the reason why we are giving it a 4/5 instead of 5*s is the \"double\" bed, where being typically European they have pushed two beds together, which rolled away from each other quite easily during the night meaning you have to utterly jump ship if you want a cuddle! For me, it was the little touches in the hotel such as the cutesy soap packet message (see picture), the decor of the sofas downstairs and the random shoe buffering machine which added a quirky humour and quaintness to the hotel on Herengracht Street. For me, I thought it more than catered to our needs and surpassed our expectations and was perfect for our weekend away. As for those who reviewed it more negatively I can only imagine they stayed for longer than a couple of days and could understand that the not-so-extensive breakfast would become a little tiring. I would recommend this hotel for couples who are on a budget, want to have great location close to restaurants/coffee shops/canal/train station, and aren't staying longer than a couple of days (ideally).", "Date": "April 10, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Location": "4", "Rooms": "4"}, "AuthorLocation": "", "Title": "“Goog hotel, walking distance to everywhere!”", "Author": "MelbCHick81", "ReviewID": "UR127445177", "Content": "Nice clean and as the name says basic hotel, no frills but it's got all you need. We got the XL room and it is massive! A bit of a climb to our room so not for the unfit, only have to go up to the room a couple of times a day anyway. Good location close to the central station, friendly staff. I would stay here again.", "Date": "April 8, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "2.0", "Value": "2", "Sleep Quality": "3", "Rooms": "2", "Location": "4"}, "AuthorLocation": "michigan", "Title": "“Where is the chic?”", "Author": "eded2005", "ReviewID": "UR127114605", "Content": "This is a very basic place -- and that is all. Close to the central train station and facing a nice canal (but with lots of rooms in the back, with no view, and steep steps up to the 3rd floor). Got a tiny room and the toilet was outside the room, with no heating in cold winter -- even though it said in the reservation that it was a \"room with a bathroom with shower\". Give me a break. Never again!", "Date": "April 2, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "washington DC, District of Columbia, USA", "Title": "“great location, nice staff, good room”", "Author": "juliehudson1215", "ReviewID": "UR126241726", "Content": "Our room had not yet been updated to the Chic and Basic style, so I cannot comment on what the better rooms looked like, but our room was clean and completely comfortable and fine -- didn't seem old and grungy at all. The beds are comfy and linens are nice. We also had the bonus of a private outdoor patio with a table and two chairs. The staff are very helpful too. But by far the best part is the location. Very close to the train station, but far enough away that it's not dangerous or touristy. It's on the edge of the Jordaan, which is a lovely neighborhood. So it really felt like we were close enough to the hustle and bustle but on a quieter side street that felt safe and is just beautiful. I would definitely stay here again on my next trip.", "Date": "March 17, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "3", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Rouen", "Title": "“A good place to stay”", "Author": "Sarah N Posted by an Easytobook.com traveler", "ReviewID": "UR125878239", "Content": "The hotel is very well located, we could go anywhere by foot. Our room had a nice view on the canal and was clean but it was not as design as the pictures on the website (we chose the vintage room, that's why I think). However i really enjoyed my stay,especially the nice staff, the free breakfast (hot beverages and toasts) and the free internet access.", "Date": "March 10, 2012"}, {"Ratings": {"Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Cincinnati, Ohio", "Title": "“Basic Boutique-Attitude+Great Location=Wonderful Stay”", "Author": "RegionalRoadie", "ReviewID": "UR125164581", "Content": "Chic & Basic Amsterdam came recommended from a friend who travels solo frequently (as I do too). He told me about its great location and that he would recommend it to me. I read the reviews and saw commenters that fell into two distinct categories: *Those who felt the product was over promising (perhaps that was the Chic in the title that did that?) *Those who felt the location was superb even if the rooms are quite small. My one night stay in December right before Christmas was very pleasant. The rate was very fair as I suspected occupancy was low. The quick take is that I was very pleased and I would definitely stay there again. For starts the hotel is a very short walk from the Central Station. I would say 8-10 minutes depending on how much luggage one is toting and how bike traffic is encountered. The next observation was the serenity of the Herengracht canal which the hotel faces. The canal and surroundings make for lovely ambience. The lobby visually has the sleek and basic signature of a hotel trying to be a boutique. The furnishings are IKEA-like, basic, but uncluttered. THe check-in was very quick. Luckily, I was traveling light because there are lots of stairs to negotiate to get to the rooms. Be prepared to make a few trips if you're toting lots of luggage as there is no elevator. My room was perfect. It was small but cozy (sorry I can't recall the room number). The room was ideal for someone seeking day sleep after a long flight because there were no windows, only a skylight that had it's own drapery to effective block out the sun. The single bed was comfortable. There was a small desk and \"enough\" space left over bearing in mind I was a solo traveler and I didn't have that much luggage to start with. The bathroom facilities were great and since I'm a stickler for shower water pressure, it was a relief to see there was plenty of that too. I'm still using the great smelling body wash that is provided under their own Cheap and Basic label. Where can I order more? My comings and goings from the hotel were always met with upbeat staff at the front desk. I walked all over Amsterdam until 0100 and never did I have any safety concerns as Herengracht is clearly a very upscale area and the hotel entrance is well lit. The hotel's location is really a big selling point to me. Everything downtown and as far as Leidesplein are within easy walking distance. The neighborhood felt very quiet and yet very close to the action. My only complaint echoes those of others in that the breakfast offerings are pretty meager. Sure, the continental breakfast is free but I merely gave it a side glance on my way out. The slim offerings of bread, a toaster, and some jam hardly seemed worth the while. The hotel shines in location and it's understated but chic lobby feel. This hotel in my view is then a basic but unpretentious boutique-esque property. The lobby and check-in area is not substantial in size, so if it's a W Hotel abuzz with hipsters and mood lighting you seek, this hotel by design doesn't have those trappings. However, for an active traveler who appreciates a degree of value, quick access to downtown, the train station, and rooms that have character I would strongly recommend this hotel.", "Date": "February 25, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Basel", "Title": "“Best possible hotel for our stay!”", "Author": "Franziska J Posted by an Easytobook.com traveler", "ReviewID": "UR124614060", "Content": "A short walk from the train station led us to this great hotel along the historical Herengracht. Reception staff was always friendly and keen to help. Some may say that the breakfast is too limited, but for myself and for the price I had to pay for my two night stay bread with butter and jam plus a wide selection of different teas and coffees was just right!", "Date": "February 15, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Dublin, Ireland", "Title": "“Good one for a short stay”", "Author": "catareenas", "ReviewID": "UR123862703", "Content": "Tiny but clean rooms, good value for money, great location (close to train stn), overlooking a canal.", "Date": "January 30, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "3", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Dartmouth, Canada", "Title": "“Cozy little room in a great location”", "Author": "Nick_and_Michael", "ReviewID": "UR123709968", "Content": "We stayed at the chic and basic in a basement room for 3 nights. Overall, I quite liked the hotel. It's very much what the name implies, a stylish place with all your basic needs. We would stay again. Pro's: -Great location just a few minutes walk from central station but not in the thick of the touristy area -Modern style -Lovely coffee bar that was always open for a quick pick me up -Helpful staff -great shower in the bathroom Cons: -the \"free continental breakfast\" was extremely sparse. Toast and jam. -The upkeep was a bit to be desired in a few areas (dents in walls, computer in lobby wasn't always working etc...) -Room was tight (we were ok, but some would find it too small) -Wifi didn't work in our basement room -The bed was two twins on casters that rolled a bit...not the best for snuggling!", "Date": "January 27, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "kent", "Title": "“Loved the chic and basic”", "Author": "KentLucy", "ReviewID": "UR122977873", "Content": "This hotel is in a fab position, right on one of the canals and within walking distance to all the main attractions! the hotel is small but it's Amsterdam! most rooms are small- look at the buildings! the view from the room is great which made our stay really pleasurable! Definitely stay here for a really great value stay in a beatiful city!", "Date": "January 12, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "London, United Kingdom", "Title": "“Quirky and cool”", "Author": "lovelifeholiday", "ReviewID": "UR122836761", "Content": "Very clean hotel, downstairs has a seating area and free coffee and tea. We stayed in a large vintage room, quite quirky with bats and butterflies painted on the wall. The room had a fantastic view over the canal but was small. However for the rate we paid you cannot complain! Fresh towels every day although the maid tended to come at around 10am and if your having some big nights in amdam like we did, then it's a bit of an unwelcome call!! The room was very homely though with a nice big radiator that you could switch on whenever you like, it felt like we were staying in someone's house which was really lovely. Was a very pleasant stay, friendly staff and good location!", "Date": "January 9, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Location": "5", "Rooms": "3"}, "AuthorLocation": "Milton Keynes, United Kingdom", "Title": "“Great hotel, great price, great location”", "Author": "Afw1980", "ReviewID": "UR121677712", "Content": "We were recommended this hotel by a friend and what a find indeed, the place was great value for money (we paid â‚¬75 per night) very central, central station 8 mins walk, Anne Frank and flower Market 10min walk, red light district and dam square 6min walk and jordaan 5 min walk! Area very quite but close to all the main attractions, toast and spreads available self serve in the morning all Inc in price, tea and coffee and free Internet available all day and also free wifi codes available from reception! All trips and bike hire can be organised through reception too! Only downside was our room was very small (although the bed was very comfortable!) but if you are anything like us we don't go on city breaks to spend it in a hotel room but just to lay your head for the night! Also very close to a very trendy coffee shop called amnesia which played some great beats and bob Marley tunes but wasn't too touristy and the staff were very friendly and helpful. To get to it turn left out of the hotel and it's by the 2nd bridge on the same side of the road! All in all a great hotel and great location!", "Date": "December 12, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Manchester, United Kingdom", "Title": "“Excellent staff - excellent location.”", "Author": "j24681177", "ReviewID": "UR121222976", "Content": "Just got back from 2 night stay- hotels was in ideal position.5 - 10 min walk from everywhere. Room was a bit small and right up in the rafters but it was very clean and modern. Also very quiet. Cannot comment on the breakfast as we failed to get up either morning. Coffee facilities a nice touch though. The staff were the most friendly i have ever encountered. At 100 eur0s a night i was a bit pricey but unless you want to stay in a dormortory with shared facilities you have to pay a little more ... free internet available in lounge also...", "Date": "November 29, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Bristol, CT", "Title": "“Great location, simple”", "Author": "sam1am", "ReviewID": "UR120937640", "Content": "The name did describe (mostly) this hotel. Definitely basic; and mostly trying to be chic. We stayed in an 'updated' room, which was small (not much bigger than the bed), but clean and did what it needed to. Found the sayings on soap, shampoo, room keys, etc. very amusing! Walking distance from the Central Station was great; we stayed here on the night prior to leaving (via the airport) and it was fast and easy to walk to the station and take a train to the airport.", "Date": "November 22, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "3", "Location": "4"}, "AuthorLocation": "York, United Kingdom", "Title": "“What it says on the tin”", "Author": "Stewie M", "ReviewID": "UR120327209", "Content": "I stayed here for a long weekend of boozy debauchery in Amsterdam. The room was small but Chic and perfectly clean. The rate was equally small. It's in the centre of Amsterdam so food or drink is irrelevant. The staff were sweet (and rather pretty). So we thought they delivered exactly what they claimed.", "Date": "November 8, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "3"}, "AuthorLocation": "Toronto, Canada", "Title": "“Dirty and loud - not worth the money!”", "Author": "lela_b_2010", "ReviewID": "UR119705862", "Content": "This place was at a good location, close to the train station, but that's about the only good thing about it. The hotel is currently under renovation, had we known, we wouldn't have stayed here - they started banging and drilling at 8 am!! Our room was not yet renovated - however, it was horrible looking - very small, and really, really dirty. I understand that eventually it will get renovated, but I did not want to pay 130 euro a night to sleep in a dirty room. It was a complete rip off. The bathroom was insanely small as well - you can't sit on the toilet unless one of your shoulders is hitting the sink. I've travelled to Europe before, and I've seen small rooms before, but give me a break - at that price to have it that small & dirty is just unacceptable. There were cobwebs in our room, obviously they did not care to clean it for the guests. Would never go back to this place, and I hope the rest of you don't wast your money on this place.", "Date": "October 25, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "2", "Overall": "2.0", "Value": "1", "Sleep Quality": "3", "Rooms": "2", "Location": "4"}, "AuthorLocation": "Toronto, Canada", "Title": "“Not worth the money”", "Author": "SJamesM", "ReviewID": "UR119529150", "Content": "My boyfriend and I only stayed here one night, but the pictures definitely look better than the reality. Our room was the size of the double bed, and the hallways reminded me of a university residence hall. There was dirt smeared all along the wall going up the stairs, and the overall feel of the hotel was very run down and dirty! The bathroom was fine though, no complaints there. The location was great, situated along a gorgeous canal in the jordaan, which is the best area to stay in amsterdam. Free internet is offered in the lobby. We overpaid for this hotel, and would not stay here again.", "Date": "October 20, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "3.0", "Value": "2", "Sleep Quality": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Melbourne", "Title": "“Chic and basic is what you get”", "Author": "tonyb82", "ReviewID": "UR119410424", "Content": "This hotel is precisely as it's name suggests, chic and basic. The rooms are clean and there's free coffee and tea (decent coffee) in the lobby area 24 7 . The room we had was on first floor overlooking canal. Wouldn't want to be there if it's really hot as there is no ac but been Amsterdam I wouldn't imagine this been a big problem. My only critique would be the breakfast which was TOO basic...just bread and some jam spreads. I understand they want to be basic and all but for the price we paid, over 100euros, at least offer a croissant or something other than just sliced bread. We got bikes from the hotel which i recommend as it's the best way to explore. Awesome location for getting around.", "Date": "October 17, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "northern ireland", "Title": "“quirky but perfect for amsterdam”", "Author": "noodles70", "ReviewID": "UR119084887", "Content": "first visit to amsterdam with a friend on a city break,(and weather was in the 20's on our visit which was a huge bonus), and found this super place to stay. its about a 10 minute dander from the train station and main tourist area, but where its situated itself, is quiet and very relaxing, over looking a canal. the area feels very safe to walk about even at night. we had a twin room at the top of the house( 3 flights up the winding stair case) so had a good workout of the old calf muscles over the weekend!! not ideal for anyone with mobility problems, think you might have a problem too if suffering from vertigo, so would be worth actually phoning the hotel when booking a room to get one nearer the ground floor if you cant manage alot of stairs. i would also think that if you have been eating the dear old space cake at the coffee shops, your head would be spinning a bit by the time you would get to the top of the house! the hotel is chic and basic, with white paintwork throughout, which really could do with a freshen up ( well... white paintwork only stays like that for a short time after painting before scuff marks start to appear) so i would call it more shabby chic, but the marks etc did not put me off the overall appeal of the hotel. the twin room we had, was big enough for what it was needed for, looked out the back of the hotel, the beds were really comfortable,sheets all nice and clean the bathroom was compact but had a brilliant shower( i want to replace my home shower for the hotels!), fresh towels, soap and shower gel was a nice wee touch. wee flat screen tv which had english channels( any soap addicts will still be able to watch their fav soaps in the evening!), the staff were very helpful , the communal area past reception was nice and airy, and there was a pc that could be used to access the internet/e-mails, which was free. another corner of the communal area was used in the mornings for breakfast, bread ,butter ,toaster and small selection of jams available( the butter was foul... more like a greasy lard type margarine ( stick to just jam on the toast!) also use of the coffee machine which did filter coffee right through to cafe lattes, also a great selection of teas, and this you could access 24/7. the hotel is also handy as a base for walking around the city. in a nutshell, i would definitely use this hotel again and hope to return to amsterdam again in the future. notes about the city :- very accessable on foot to see everything, the canal trips are pricey and if youre on a budget, save yourself the expence and use your feet instead!, watch out for bicycles, theyre everywhere so watch out when crossing roads etc, the cafe culture is fab, though typical of anywhere in europe, its not cheap 5 euro for a glass of wine, 2.50 euro for wee bottles of coke/water/ juice. i would reccomend getting a bottle and when finished drinking, keep and refill with water from the water dispenser in the hotel as on a hot day and walking around everywhere, you get thirsty. if you like cocktails, go to the house of bols, 11 euro in, learn a bit of the history of the distillery and then finish up in the bar where you get a free cocktail and 2 free shots( you can also buy more cocktails for 5 euro each) this is just down the road a bit (5 mins walk)from the Rijksmuseum ( a nice wee hour looking at vemeer and rembrants amongst other pieces of art) ann franks house is also close enough to walk to and very interesting( whilst in the short queue for it , was interested to overhear a canadian ask another person in the queue'' so this ann frank, is she quite famous?'' anyway well worth the hour or so learning all about this young girl and what her experiences were during WW2. the main square is also nice to walk to, the royal palace is an impressive building and there is a great atmosphere. of course you have all the tacky shops selling souvenirs, sex shops, cheese shops( yummy trying out different cheeses on offer) but there is plenty of clothes shops ( H&M flagship store near the square) and in the posh shopping area you have all the big designer labels if you have the money to blow there! the red light district is worth a walk through in the evening, if only to shake your head and think the girls should consider their career options! if you decide that amsterdam is a place to visit , you wont be disapointed, and if you want a hotel that is close to everything then chic and basic is the one you want.", "Date": "October 8, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "4.0", "Value": "5", "Service": "3"}, "AuthorLocation": "Dundee, United Kingdom", "Title": "“Does what is say's on the tin.”", "Author": "SuperDuff", "ReviewID": "UR117904196", "Content": "We stayed here as a couple December 2010/January 2011 over New Year. We had a room that was a little dated but was cleaned daily with a nice little ensuite. The room we had was very dated compared to the hotel lobby and kitchen area - not sure if it was under going a redcoration or what but everything was always very clean. Downstairs had toast and tea/coffee making facilities but we ate out of the hotel for the majority of our trip. It is in an excellent location 5 minute walk from Central Station, very close to all the attractions of Amsterdam, our room had a fantastic view over the Canal outside.I would recomment this hotel if you are going for a short break to Amsterdam.", "Date": "September 10, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Location": "5", "Rooms": "4"}, "AuthorLocation": "", "Title": "“Nice”", "Author": "E011984", "ReviewID": "UR117421252", "Content": "It definitely lacks the chic of it's brand mates in Barcelona or Madrid. Quite ordinary design and very limited breakfast. Still probably the best option in Amsterdam thanks to its canal views, friendly staff, and perfect location - close to the train terminal , major attractions, yet unexpectedly quet", "Date": "August 29, 2011"}, {"Ratings": {"Cleanliness": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Almeria, Spain", "Title": "“Lovely hotel”", "Author": "Bwh_11", "ReviewID": "UR117371435", "Content": "I was in this hotel during 4 days, and it was perfect. Staff is really kind,they help us in any moment. Breakfast for free and also tea and coffe. Internet too for free. The hotel is only 5 minutes from central station, and it is placed in the best area of Amsterdam, in the city center.Very nice room, so clean and beatifull with canal view. In my opinion, the hotel style is great, it is different, and prices are ok.", "Date": "August 28, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "4.0", "Value": "4", "Service": "4"}, "AuthorLocation": "Chicago, Illinois", "Title": "“Convenient, comfortable”", "Author": "robmh", "ReviewID": "UR117311974", "Content": "This is a small hotel located about a 5 minute walk from the Central Station in a quiet neighborhood in Amsterdam. The staff is friendly and the rooms are simple and clean. Most rooms tend to be a little small but are generally a pretty good value. They provide a breakfast which unfortunately is only bread/toast and jelly/jam but there are plaves to eat nearby. They also offer free wireless internet.", "Date": "August 27, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "4.0", "Value": "4", "Service": "4"}, "AuthorLocation": "", "Title": "“The name says it all, excellent location”", "Author": "NikiCoogeeAustralia", "ReviewID": "UR116740969", "Content": "We loved staying here for 3 nights, the location was really close to all the shops, coffee shops and mayhem, but far enough out of there for peace and quiet. You could go the other direction from the touristy part (where we found some local markets, sort of on the way to Anne Frank's house) and experience more of the lifestyle of Amsterdam. Wondering through the little streets and canals was just awesome. The room was basic and had a fabulous view over the canal. The stairs were really narrow and steep so if you may need a bit of muscle to get upstairs if you have heavy bags, we had backpacks and it didn't bother us. Staff were helpful, no problems there. The only negative I have to say is there was no safe in the room and the shower didn't have a screen or curtain so the whole bathroom floor got wet everywhere so that was a bit weird. I liked the selection of pillows available too, the only problem was the staff at the time couldn't find the one I wanted. Apart from that everything was great! p.s Vondel park is a bit of a walk away which we did but you can catch a tram there, its the best park, its like their beach, so chilled out and absolutely beautiful.", "Date": "August 15, 2011"}, {"Ratings": {"Cleanliness": "1", "Sleep Quality": "2", "Overall": "2.0", "Value": "2", "Service": "3"}, "AuthorLocation": "ottawa", "Title": "“definitely not chic and a little less then basic”", "Author": "beverley_atkinson", "ReviewID": "UR116344702", "Content": "Amsterdam is an amazing city and well worth a visit. We stayed at the Chic and Basic for four nights. The location was perfect, on a canal and close to everything. But I was shocked at actually how basic the room was. First of all the bed took up the majority of the room. There was barely enough space to walk around the bed, the shower had no edge around it so the water spilled on the bathroom floor, there was a portable fan in the closet (air conditioning),breakfast was bread and jam and coffee, water was in what looked like a cooler but was actually coming from a pipe in the wall. If you just want a place to crash and you are young enough not to let the lack of ameniies bother you the location is perfect but if |I have the privledge of visiting this amazing city again I will pay the extra euros for better accomodations.", "Date": "August 6, 2011"}, {"Ratings": {"Overall": "3.0"}, "AuthorLocation": "New York", "Title": "“Very disappointed second visit”", "Author": "catsinbrooklyn", "ReviewID": "UR116130695", "Content": "Stayed here for three nights in July 2011. I loved it last year when I stayed up in the top room with a canal view last time so decided to come back, but this time with my low budget, I stayed at a 'traditional' (not redecorated in 'Chic and Basic' style) room. A big mistake. Very dark and tiny, a carpet was very dirty, a tiny closet filled with junks (such as a big ironing board and a fan), a broken safe box. It was just depressing. Yes, 60 euro difference and completely different rooms. Staffs are still the same - young, pleasant, helpful. Free coffee all day is nice. Still, a big disappointment. Good I booked at another hotel (Hotel Sebastians) in the same neighborhood for the last two days in Amsterdam. Although I didn't particularly like their decor, for 5 euro less, I go so much more there. Chic and Basic .... if you are going to stay here, stay at the top Canal view room. Other rooms...maybe not.", "Date": "August 1, 2011"}, {"Ratings": {"Cleanliness": "3", "Sleep Quality": "3", "Overall": "3.0", "Value": "5", "Service": "3"}, "AuthorLocation": "Stockholm, Sweden", "Title": "“Very basic... and a little chic”", "Author": "Veronica80", "ReviewID": "UR114869814", "Content": "Hotels in Amsterdam is not cheap. This hotel has a reasonable price and has an excellent location near the central station but still in a very nice area, Jordaan. The rooms (we chose a L) are of a good size and reasonably clean. The \"continental breakfast\" was toast and jam, with coffee or tea, which was kind of a let down. But, at this price and location, it's a great hotel.", "Date": "June 29, 2011"}, {"Ratings": {"Cleanliness": "2", "Sleep Quality": "3", "Overall": "3.0", "Value": "5", "Service": "4"}, "AuthorLocation": "Tampa, Florida", "Title": "“Name of hotel should emphasize basic”", "Author": "MM_World_Travelers", "ReviewID": "UR114682074", "Content": "Pros: 1) The location of this hotel is superb. It's less than a 10 min walk from Central Station, yet sits on a quiet canal street away from the hustle and bustle. My wife and I stayed 3 nights and felt safe in the neighborhood. 2) This was one of the best values we could find in town as everything in Amsterdam is ridiculously expensive. 3) They have bicycle rentals on site with prices that are in-line with other bike rental places. Very convenient as we rented them first thing in the morning at the front desk and returned them at the end of the day. Bikes are a must in this city, if not for the convenience, then for the experience! Cons: 1) As for the rooms, they are extremely basic, with typically small European sized room and bathroom. There were stains on the walls that weren't very pleasant to look at, but whatever, it didn't get us down. 2) We were there in May, the air-conditioner in the room wasn't on, not even for a fan. This made it a litle hard to sleep as there was no air circulation. We were on the first floor and did not feel comfortable leaving the window wide-open. 3) No breakfast So overall, I would recommend this to anyone traveling on a budget with low expectations.", "Date": "June 23, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Location": "5", "Rooms": "4"}, "AuthorLocation": "", "Title": "“Very satisfied.”", "Author": "lanie", "ReviewID": "UR112668348", "Content": "Location was perfect, close to central train station, awesome view of canal, quiet street, most affordable, very clean, nicest staff @ front desk, very helpful.", "Date": "June 11, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "3", "Overall": "3.0", "Value": "3", "Service": "3"}, "AuthorLocation": "Vienna", "Title": "“Average”", "Author": "Travel_Aficiondo", "ReviewID": "UR111576239", "Content": "It was ok. Clean and location wise very good.But not chic, my room was furnished in the early ninties and then someone painted supposedly funny stuff on the dark wooden furniture. Basic, yes. Chic, not so much.", "Date": "June 5, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "4", "Service": "5"}, "AuthorLocation": "Perth, Australia", "Title": "“Awesome little hotel”", "Author": "Lacey082", "ReviewID": "UR111213686", "Content": "This hotel is located right on a canal in Amsterdam so our room had a great view (although our other friends' rooms did not have any views). From the hotel you can walk or bike to most tourist destinations like Anne Frank House, Dam Square, Red Light District. The hotel itself is clean and yes, chic and basic. It's quite modern yet simple, but it has everything you need including free WIFI. Breakfast consists of just toast and jams and coffee. There is free drinking water too. There were a few different options for types of rooms when we booked. We booked the medium room and it was all we needed. The reception were extremely helpful with where to eat and go out. But we found people in Amsterdam were all helpful and friendly! Amsterdam is a beautiful city and staying here was perfect as it was modern, clean, had a great location and the staff were very friendly.", "Date": "June 3, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "3", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Jacksonville, Florida", "Title": "“Awesome staff, funky decor”", "Author": "cmorta", "ReviewID": "UR110029257", "Content": "I stayed at Chic and Basic with my fiance for 2 nights during the last leg of our summer Eurotrip. After staying at a series of quaint and demur hotels, Chic and Basic was extremely refreshing. Upon entering, we were immediately in the \"Amsterdam\" frame of mind. The staff was exceptionally friendly and helpful, and the decor was upbeat and modern. The location was superb... right on one of the prettiest canals, and mere blocks from most attractions and areas of interest. If you're focusing your trip around the Heineken tour or Museum district, this may a *bit* too distant for walking... but doable if you're up for it! Finally, the kitchen downstairs was a WONDERFUL bonus! The simple breakfast was so convenient, and the 24 hour coffee/espresso machine ALONE makes my stay at Chic and Basic totally worth while. One word of warning: the facility does not have AC, so this may not be the bets choice in the dead of summer. Otherwise, I would not hesitate to recommend Chic and Basic.", "Date": "May 26, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Melbourne", "Title": "“Great room, great price”", "Author": "da33Melbourne", "ReviewID": "UR106169909", "Content": "You can walk from this hotel to everywhere in amsterdam. The room was very nice and staff very friendly. It was hard work getting the suitcase up the narrow stairs, but that's only 1 minute of pain for a nice hotel.", "Date": "April 30, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Barcelona", "Title": "“Romantic weekend in Amsterdam”", "Author": "Bplanet", "ReviewID": "UR106155049", "Content": "I went with my girlfriend for a couple of days and we really enjoyed a wonderful stay. We had a room with big windows overlooking the canals(imagine the romantic iluminated canals during the night!), and the city center was just 5 minutes by walking. The Front Desk staff were totally helpful and friendly. We always received a big smile after any little question we had. For sure, we will choose this hotel again for our next stay in Amsterdam!.", "Date": "April 29, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "3", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Calgary, Canada", "Title": "“Friendliest staff ever”", "Author": "CY2", "ReviewID": "UR105089596", "Content": "Excellent place to stay for a discount price. We arrived at 7am straight from the airport and the staff were very accommodating, we helped ourselves to the breakfast bar while they checked us in (very) early so we could get a power nap before exploring the city. The room was small and at the top of a very steep set of stairs but it had everything we needed. We loved everything about Amsterdam, including the Chic & Basic!", "Date": "April 22, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "3.0", "Value": "4", "Sleep Quality": "3", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Dusseldorf, Germany", "Title": "“Perfect location, basic ammenities”", "Author": "Marisa_L99", "ReviewID": "UR103284858", "Content": "I wanted to stay somewhere in Amsterdam that was inexpensive, especially safe and very close to the train station as I was traveling by myself. I booked this room after reading reviews on trip advisor and was for the most part satisfied with my stay. The hotel was a 5 min walk from the train station, walking distance to many attractions, yet tucked away on a quiet street. The staff were very friendly and accommodating and referred to me by my name when I returned at the end of the day. I did have two slight complaints about my stay. The first was that my room was not renovated like those pictured on their website. I had a note in my room apologizing for not having the renovated room and it also stated in the note that a buffet breakfast was currently not being served. My rate stated that a continental breakfast was included, yet the only thing that was provided was toast and coffee. I have been to many hotels in Europe and knew not to expect an American style hot buffet, yet I would not call toast a continental breakfast. Both those complaints being said I would still use this hotel for brief stays such as this was as it's clean, in a great location, affordable, and has friendly staff.", "Date": "April 8, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Location": "5"}, "AuthorLocation": "London", "Title": "“Great location, friendly staff what more could you want?”", "Author": "eccentrick", "ReviewID": "UR101559181", "Content": "I stayed at this just last week. Great place to stay, free breakfast and internet. Just have to wait for everyone to log off so you can get on. Even books to read if you don't want to sightsee in a number of languages. Coffee and tea available all the time as well - free! Really close to everything as well.", "Date": "March 25, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "2", "Location": "5"}, "AuthorLocation": "UK", "Title": "“Location is superb”", "Author": "DebNJohn", "ReviewID": "UR99412176", "Content": "The friendliness and helpfulness of the staff more then makes up for the dingy room we had. We were in room 211, small, as per normal. No view - but next door to smoking area ( which was convenient for us). Room cleaned everyday, no quibbles about fresh towels, in room coffee/tea replenished every day. Lobby is lovely with free internet access, a kitchen for use with hot coffee on tap all day. The coffee is FRESH, ground, and just lovely. You pay 2/3 euros per cup everywhere else so we made full use of this. Basic breakfast, toast, butter and jam FREE -which helped us save money. Location is superb, five minutes from train station on a lovely canal street. Never bothered by noise from traffic or party goers. Close to everywhere. Will stay there again ( though not room 211) and have looked into their branches in other cities. Highly recommend.", "Date": "March 8, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "3.0", "Value": "4", "Sleep Quality": "5", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Minneapolis, Minnesota", "Title": "“Basic, no-nonsense room, charming and not American by any means.”", "Author": "n8andm", "ReviewID": "UR97494441", "Content": "We stayed at Chic & Basic in 2008 in the large suite off to the side of the main hotel. It looked like we lived there, it has a a separate, private entrance with no hotel markings. The bed was okay, the closet was dark, the furnishings were Ikea but the room was large. The bath was large and Mediterranean themed, kind of old with dated tile and fixtures. Not a glamorous room, but great for maybe backpacking? We were also given the option of staying on the top floor for them same price, it had a better view but you had many flights of narrow stairs to climb. I do not recommend this place for your average over-weight person who travels with a lot of luggage. It's charming and they have an instant espresso machine that we really enjoyed. The convenience and location are great.", "Date": "February 21, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "London, United Kingdom", "Title": "“Clean, friendly, modern and great location.”", "Author": "prudence22", "ReviewID": "UR96739138", "Content": "This lovely hotel is a 7 minute walk from the station and 2 minutes from the start of all the restaurants, bars and coffee shops. When we arrived we were greeted by a friendly member of staff who very kindly upgraded us to a canal room! Only reason being, they were fully booked the day we arrived and said they were alot quieter the following day so we could have a better room, which was lovely so we stayed in the room we booked for the first night and upgraded the following nights. All the staff were very friendly and the hotel was absolutley spotless, and you don't get cleaners knocking on your door in the morning! They just simply wait til you have left. The area was quiet yet very close to everything and rooms were lovely and clean with a nice personalised letter, waiting on the bed welcoming you to Amsterdam.", "Date": "February 15, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Birmingham", "Title": "“Excellent value for money”", "Author": "JAPL01", "ReviewID": "UR96734718", "Content": "We stayed at the Chic and Basic over Valentine's weekend. We had booked a Medium Vintage Room several months earlier,. When we arrived, we were told that we were being 'upgraded' for our second night, but not the first night, since the room wasn't available. When we were taken to our room, it was soooo tiny, you could hardly move around the double bed. We then told the receptionist that we would like to take up their offer of an upgrade for the second night and we questioned whether the room we had been shown was a 'Medium Vintage' room, we were assured it was. Anyway, we do think that we were in a lesser room than the one we booked for the first night and that the 'upgrade' was really just moving us to the room we should have been in, but who knows. On a plus note, the hotel is in an excellent location. The hotel staff were all extremely friendly and helpful, even when I emailed a couple of questions before we arrived. The rooms (both of them) were spotlessly clean and the beds were really comfortable. My husband and I would def. stay at the Chic and Basic again and would recommend it to friends, but ask for a decent sized room!", "Date": "February 15, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Corsica, France", "Title": "“Travel guide”", "Author": "drix666", "ReviewID": "UR94432155", "Content": "The first time to visit Amsterdam was not easy for us. Everything was strange but the staffs became our guide. They was very friendly and helpful, gave us a map and introduced about some attractions in Amsterdam. The room was large and clean in quiet environment. I recomment this hotel for all to stay.", "Date": "January 25, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Hove", "Title": "“Quircky and fun”", "Author": "MonicaW_8", "ReviewID": "UR94250466", "Content": "Very nice place in Central Amsterdam, quiet, really cute and quircky decor and rooms are very comfortable. great mattrass and good sleep.", "Date": "January 24, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "3", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Birmingham, United Kingdom", "Title": "“Chic & Basic - what more could you ask for”", "Author": "PJL1981", "ReviewID": "UR93866392", "Content": "Travelled to Amsterdam for the first time with my girlfriend in order to celebrate her birthday. Identified the hotel on TripAdvisor prior to booking. Hotel is in an excellent location on the canal, nestled between the traditional houses/apartments. Only a short 10 minute walk from central station, 5 minutes from the main drag (trams, shops, etc), less than 15 minutes to Anne Frank's House, and less than 10 minutes to the Red Light district. Rooms were quite basic: bed, flatscreen tv, bathroom/wetroom, hairdryer, hanging rail for clothes, but decorated simply & tastefully. The views of the canals from our room were very postcard picturesque. No set breakfast to speak of but toast & condiments were available in the morning, whilst hot/cold drinks were available around the clock in the kitchen. The little contact I had with the staff was pleasant and their non uniform policy gave the hotel a very relaxed feel. My girlfriend & I both enjoyed our stay in the hotel & would stay again. The only negative are the perilous staircases. If you want a room with a view you're going to have to take on the narrow stairs (traditional in this sort of building), which seem to get steeper the higher you go as there is no lift available.", "Date": "January 20, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "London", "Title": "“Cool small hotel, smart choice for a short stay”", "Author": "SSEFC", "ReviewID": "UR92857863", "Content": "Stayed here a couple of times when visiting Amsterdam for work, as it was recommended by colleagues. Easy walk from Central Station and handy for my work in the Jordaan area, which itself is very cool with great cafes and bars. This is a very smart choice, with a boutigue feel but without the high price. Steep stairs to my room, no view but modern, classy and comfortable. Good amenities e.g. big shampoo/gel bottles to take away! Healthy self-serve breakfast (in a lounge area) is extra but (good) coffee is free. No 'service' to speak of, one or two stern and efficient staff at front desk, but you are not paying for service.", "Date": "January 14, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Singapore", "Title": "“Fantastic place (but pack light - killer steps)”", "Author": "Dannex", "ReviewID": "UR90584308", "Content": "I was in Amsterdam for 3days/2 nights and I stayed at this hotel for a couple of reasons. a) Recommendations from fellow TA members b) Price c) Location It was along Herengracht, one of the many canals in Amsterdam. Coming out from the Central Station, head west straight into the beginning of Herengracth and you will get there in less than 10 mins walk (provided you don't lose your way). The hotel looks good even from the outside, and they have very friendly English speaking staff manning the counter most of the time I was there. It was situated right beside the canal and it is very pretty and calming, unlike the hotels in the middle of the town where traffic becomes a concern. Because I arrived earlier and the rooms weren't ready yet, they provided left baggage service FOC. Rooms were pretty good, my only gripe was there was no heater near the balcony door. It was pretty damn cold at night (during winter). Beds were clean, room service was provided too. Overall it was a good stay, reasonably priced and I would love to give a well deserved praise to the hotel management for keeping up the standard.", "Date": "December 23, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Palermo, Italy", "Title": "“chic and more than basic”", "Author": "Pantheramed", "ReviewID": "UR89261299", "Content": "We booked a room to mounths earlier paying in advance, thanks to this we obtained a good discount. It has a great position, near the central station. The room was clean and conformed to the description of the website. The toilette was not very big, but confortable use (Per gli italiani l'unica cosa che mancava era il bidet ). The staff has been kind and polite and we loved the coffe machine everyone can use it 24/7...", "Date": "December 7, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "3", "Sleep Quality": "3", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Hereford, United Kingdom", "Title": "“Does what it says on the tin.........”", "Author": "sarah197832", "ReviewID": "UR87142782", "Content": "The Chic and Basic is the 6th hotel I have stayed in within Amsterdam and I would probably rate location and cleanliness as the best I have stayed at. It is a ten Minute walk from Damrak and also in a nice quiet area and it felt very safe. The room was on the small side but Amsterdam is notorious for it's small rooms thats what you get, but it was very clean.The bathroom was ample for two of us,the bed was ok bit hard for my liking but each has their own idea of comfort so...The staff were friendly on the reception the lady doing breakfast shouldv'e been a bit more friendly in my opinion,a good morning would be nice but she was very busy doing the washing up ect.Which takes me on to the one thing I think lets this hotel down hugely.....The \"breakfast\". It was jam and bread-not toast-bread.This to me is not breakfast not even continental.Fair enough there was a toaster there but to wait 10-15 mins for it to turn slighlty toasted is not my idea of fun!I believe a good breakfast is needed to start your day off with all the sightseeing /cofeeshops wandering around it is imperative-it just let it down.If you have booked a room and breakfast is extra do not bother that is my advise.The coffee machine is a fab idea and comes in very handy!! All in all I really liked the Chic and Basic and would recommend it minus Brekkie!!", "Date": "November 15, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "UK", "Title": "“Enjoyed our stay”", "Author": "mighty_zarquan", "ReviewID": "UR86644739", "Content": "Loved the look and style of the hotel, nice touches everywhere, a lot of thought has gone into it. Rooms were compact but clean and stylish. Staff helpful. Free internet PC, coffee machine and shoe shiner. Breakfast is toast and a croissant if you are lucky. Quiet location but only 5 minutes walk from the station and nightlife. All in all we thought it was great value for money.", "Date": "November 10, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Aylesbury, United Kingdom", "Title": "“Good Hotel - Chic and Basic - Small but beautifully packaged.”", "Author": "missvee79", "ReviewID": "UR85760709", "Content": "Stayed at this hotel in September 2009. Travelled with a firend (two girls) and stayed here for three nights. Hotel is clean, modern, bright and fresh. Staff very friendly and accommodating. Gave us a free breakfast (not sure if they meant to), looked after our bags as we arrived very early and left late. Very small room and shower room, but was enough for our needs. A rail with hangers, rather than a wardrobe and literally a bed and somewhere to put your book/keys/phone and nothing else, so suited to travellers who travel light/hand luggage only. But you are in Amsterdam! You aren't going to be in your hotel room other than to wash/sleep. Free coffee machine was a godsend. Would recommend to those who dont take everything but the kitchen sink, who dont' mind basic, but still want to feel like a grown up and not slum it. Large window looked out onto the street/canal so careful unless you are comfortable flashing Jo Public.", "Date": "November 2, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "2", "Location": "5"}, "AuthorLocation": "New York", "Title": "“Great location, friendly helpful staff, \"chic & basic\" truly sums it up!”", "Author": "mcg1881", "ReviewID": "UR85372485", "Content": "I stayed here with my brother for 2 nights in October. The hotel is located very close to the train station which was convenient, especially because we arrived late in the evening. It's situated on a charming side street, right on the canals, away from the crazy tourist sections - yet it's close enough to walk to most sites should you choose. The hotel name sums it up - truly chic and basic. The lobby is very modern, bright. The people at the desk were very friendly and helpful - which was a relief as we were coming from Paris, where that is not always the case. 24 hour free coffee & tea from a very fancy machine that makes cappuccino, espresso, regular coffee. The complimentary breakfast does the trick - meats, cheese, pastries, breads. Also, yogurt & granola, hard boiled eggs. The rooms are tiny - Very Important: be sure to ask for one that has been remodeled. Not all have gone through the process yet. Ours hadn't at the time, which is why I had to give a low rating under the \"rooms category\". It's a tough pill to swallow knowing you're probably paying the same nightly rate as the people next to you, and they are sleeping in a remodeled room. Oh, and free wireless for our entire stay! After paying upwards of 5 euros for an hour of wireless at other hotels in Europe, this was such a treat! All in all, the hotel was a delight and great for the money.", "Date": "October 30, 2010"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Overall": "2.0", "Value": "1", "Sleep Quality": "3", "Rooms": "1", "Location": "4"}, "AuthorLocation": "Poole", "Title": "“This is a hostel not a hotel.”", "Author": "robinsonm008", "ReviewID": "UR83832125", "Content": "As a relatively frequent visitor to Amsterdam, I know that hotels are expensive for what they are. This hotel was very disappointing. The medium room that I booked was horrible. Tiny, dingy, the toilet had a pipe attached to which was a shower head and that was the ensuite. The sink was in the bedroom as there was no roon for it in the toilet room. Moved to a vintage room, no window at all, broken safe, horrible brown carpet, dingy and small, all for 110 euros. Don't be seduced by the breakfast. Either sliced brown bread or white bread, which you could toast and that's it. Machine coffee that tasted cheap. Juice on Friday and then none. No extras at all, not even an egg! Location is nice and quiet.", "Date": "October 17, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "3", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Los Angeles, California", "Title": "“Nice hotel”", "Author": "VovaPutin", "ReviewID": "UR83253374", "Content": "The room was small, but the service was excellent, great value. Staff is very friendly and helpful. Liked free internet and coffee machine. Parking on the street in front of the hotel was 45 euro for 24h, but there are cheaper options available.", "Date": "October 12, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Colombia", "Title": "“Great if you pay for XL room”", "Author": "katrios", "ReviewID": "UR82741513", "Content": "We stayed in a XL room for three days. The room was in the first floor of the next building of the hotel and it was really nice because of the wiews of the canal. The room was huge and the bathroom too. The room needs an extra lamp. The hotel offers caffe and bread every morning. Nice staff. The hotel is more basic than chic, but the place it's perfect for visiting Amsterdam. Tip: There is a great restaurant called: De Keuken van 1870 at: Spuistraat 4. It's very close to the hotel. They serve traditional food for a really good price.", "Date": "October 9, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Oro Valley, Arizona", "Title": "“thumbs up”", "Author": "pedsnp", "ReviewID": "UR81519721", "Content": "Great little hotel in a convenient location. Fits it's name althought I think it is a step up from basic. Friendly helpful staff, and the coffee pot is always on.", "Date": "September 29, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Dorset, England", "Title": "“Fabulous hotel”", "Author": "2921", "ReviewID": "UR77815940", "Content": "We have just stayed here over the UK Bank Holiday weekend, what a gem, perfectly located only 5min walk from the station (by far the easiest way to travel into the city) and in a beautiful spot. Everything was very accessible and well within walking distance. The rooms small but perfectly formed, although the room my daughter had at the back didnt have a window that you could see out of and was rather warm (but she's all freezing anyway, so loved it). We had a room over looking the canal and what a beautiful view. All the rooms were very clean and well presented. Breakfast was only toast but free and a nice extra that we were not expecting and free tea and coffee at anytime. The staff were all very friendly and very helpful, would definately stay here again, and shall try the one in Barcelona, our next mini break!", "Date": "September 1, 2010"}, {"Ratings": {"Service": "2", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "2"}, "AuthorLocation": "Windsor, United Kingdom", "Title": "“Terrible Hotel: Avioid!”", "Author": "jimmyfloyd33", "ReviewID": "UR76749441", "Content": "Without doubt the WORST hotel room I've stayeed in! Dirty, cramped, noisy and felt un-safe. I have to say the staff are very friendly, but that does not compensate for the appalling room. The tiny room's walls were covered in black marks (when someone had tried to swing a cat maybe?), a tiny dest and wardrobe all-in-one, and windonws looking up onto the street - yes, UP onto the street as room is below street level. The old windows do not seem secure, and without a room safe I took all valuables with me when I left the hotel. The bathroom's light switch was broken and had to be pushed about a bit before the light came in. The bathroom walls were full of random drilled holes for no apparent reason. What's the point in having 4 types of pillow on offer when the basics aren't in place! Was booked for a business trip for 2 nights and arrived at 10pm tired and ready for bed. Awful night's sleep, so left the next morning and stayed the next night at a hotel for the same price 5 minutes away which was a far better experience! Do youself a favour - go elsewhere when visiting Amsterdam!", "Date": "August 25, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "New York City, New York", "Title": "“perfect location”", "Author": "zhosze", "ReviewID": "UR76232494", "Content": "It is as the name suggested, it is basic and pretty cheap for being so central and right by the canal. The location could not be more perfect, it is on one of the most picturesque part of the city (Joordan) and it's only a 5 minute walk to the train station. The staff were very friendly and helpful. Rooms are small but clean and more than adequate. Alas breakfast was only toast, but it was free and the endless supply of very good coffee was a plus. We had a wonderful stay.", "Date": "August 21, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Sleep Quality": "3", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Brussels, Belgium", "Title": "“Nice Boutique hotel, very good location!”", "Author": "michaelvdm", "ReviewID": "UR73594365", "Content": "The room looked nice and clean. Trendy hotel with good breakfast and super location in the town center.", "Date": "August 3, 2010"}, {"Ratings": {"Overall": "3.0"}, "AuthorLocation": "New York", "Title": "“'Chic' and 'Basic'”", "Author": "catsinbrooklyn", "ReviewID": "UR71870046", "Content": "The hotel name says it all. PRO: great location (in one of the most beautiful areas in Amsterdam), 'chic' furnishing/decor (even though it's IKEA-ish) fast free internet in a lobby (Mac) CON: a little overpriced, breakfast (I hate that machine made coffee, please at least give us freshly brewed coffee...), bathroom walls peeling, amenities not refilled (had to use one tiny soap for three days)", "Date": "July 22, 2010"}, {"Ratings": {"Service": "2", "Cleanliness": "4", "Overall": "3.0", "Value": "2", "Sleep Quality": "4", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Chennai (Madras), India", "Title": "“Good but could have been better”", "Author": "tenvsrini", "ReviewID": "UR71319891", "Content": "Chic&Basic is a cosy little hotel about 10 minutes' walk form the central station. We arrived early for check in. Our room was not available, so we were offered the option of checking in to a smaller room and moving to our chosen room the next day. We took it, and except for the first day, were happy with the spacious room. Breakfast was included with the reservation, but there wasn't much variety on offer - we had to make do with just bread. There coffee machine in the lobby was a welcome amenity. There is no restaurant or room service, so we had to go out for all our meals. The staff at the reception were friendly and eager to help, but did not always have the information we were looking for. The problem with the hotel is the staircase. There are no lifts - and with a room on the third floor, we had to carry our heavy bags up the extremely narrow staircase. So narrow, in fact, that we feared for our safety while walking up with our hands full. We talked to other guests and they felt the same way too. We booked through the hotel's website at an advance purchase rate, but left with the impression that there might have been better options closer to the city centre.", "Date": "July 18, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "los gatos", "Title": "“what a find !!!!”", "Author": "trixieLosGatos", "ReviewID": "UR70840346", "Content": "we really enjoyed this hotel. the location was great and we had the most wonderful room - the top floor with a marvellous view. the help could not have been more helpful ! they carried our luggage up five flights of stairs with a smile...... they recommended local restaurants..... and they suggested a picnic and supplied the directions to the park and the glasses/knives/napkins we would need. we heartily recommend this hotel and would stay again with great pleasure.", "Date": "July 13, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "3", "Overall": "3.0", "Value": "4", "Sleep Quality": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Kenya", "Title": "“Exactly what it says - \"Chic and Basic\"”", "Author": "RunningDogYankee", "ReviewID": "UR70305782", "Content": "I love a hotel that lives up to its name, that is well placed, good value for money, and doesn't pretend to be anything more than what it says. I've been coming to Amsterdam for years and finding that right balance between price, location, and accomodation can be difficult. I highly recommend this hotel because it meets the minimum 2 - 3 star criteria in a 4 star location. It's located right on the Herengracht canal, away from the tourist carnaval and noise, but right around the corner to convenient restaurants and other attractions near the center. Best of all the room I had faced onto the canal (although in the summer time it can get a bit hot with the sun shining into it). it's cozy and situated right in a quiet neighborhood. The only down side is the 3:00 pm check in time, which is a pain for jet lagged travellers arriving in the morning. Still, I give it a thumbs up!", "Date": "July 9, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "3", "Rooms": "3", "Location": "5"}, "AuthorLocation": "washington dc", "Title": "“Very Adequate”", "Author": "amber12", "ReviewID": "UR66677624", "Content": "Stayed here Tuesday and Wednesday, June 1-2, 2010. We payed a little extra for a room with a canal view. It was very small, but very clean. Nice view and extremely convenient to Central Station and anywhere you would like to walk. I would definately stay here again, but be prepared for the small size.", "Date": "June 6, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Mumbai, India", "Title": "“Comfortable hotel room in convenient location.”", "Author": "SonaG", "ReviewID": "UR65225590", "Content": "I stayed at this hotel for 4 nights earlier this month. It is an easy walk (about 5-7 minutes) from the Central station.....located in jordan....not right in the middle of the tourist ares at the same time not very far from them.The staff is welcoming and ready to answer all questions patiently. Based on the reviews here, I had booked a medium modern room and was happy with it. It was comfortable even with its very basic furniture. The bathroom had only a shower (wish it had a bath) but was spotlessly clean and the shower provided lovely hot water with good force. The toilet was separate, across the room. The bed was big and comfortable since I had booked a medium room in spite of being a solo traveller....but I found it too soft for my liking. Breakfast only included sliced bread, butter and jam......one was welcome to use the automatic coffee machine any time during the day. Free use of internet on the computer in the lobby was a big advantage. It was cold and rained during most of my stay and I was able to borrow an umbrella from the hotel. This was my second trip to the city.....highlights this time included visits to the keukenhof, delft, utrecht and the hague. For the first 2 days I assumed the piled up garbage was a result of the ever increasing tourists and other people in the city....later realised that there was a strike on and unfortunately that tainted the impression a visitor may have of the city. Overall, I had a good trip......would not hesitate in recommending this hotel.", "Date": "May 24, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "2", "Sleep Quality": "1", "Rooms": "1", "Location": "4"}, "AuthorLocation": "Hamburg", "Title": "“Friendly & basic, rather than chic”", "Author": "TravellingScribe", "ReviewID": "UR64391952", "Content": "Picked this hotel for its style/cost/location ratio and found it OK but hardly stylish or chic. Staff are very friendly and helpful and I appreciated being able to check in on arrival (around 11 am) rather than waiting until the 3pm advertised check-in (which is too late - hotels are pushing this time further and further out). Room and bathroom were spotless, bathroom in fact seemed newish, but the layout of the room was most peculiar - no windows, only a massive skylight that took up half the bedroom ceiling and which allowed at least 3 sets of windows from other sections of the hotel to look down into my room. A curtain could be pulled across the middle of the room, dividing the bed area from the table, tiny wardrobe and TV area, and that allowed the only privacy possible so one had to duck behind the curtain to change clothing in the narrow strip of floorspace by the bed. This curtain was also the only way to darken the room for sleeping. To cross into the bathroom at the opposite side one had to be fully clothed... a most peculiar set-up and the cute painted monkeys on the walls didn't make up for the inconvenience of this, nor justify the hotel's claim to be chic! I was tempted to ask for a room change but I was only there 3 days to catch up with friends so spent little time in the room and frankly I have never found hotels in Amsterdam to be up to much. I had booked a double room despite travelling alone & am very glad I did as the one I got was small enough (there would never have been enough wardrobe space for 2 people to hang even one change of clothes each) and I hate to think what a single would have been like. The bed was firm enough for a decent sleep but the foam pillows and foam-type duvet filling were not very pleasant but seemed clean. Some reviewers from a while back have mentioned breakfast but a note handed into my room after check-in advised that there is no longer a buffet breakfast available - all one gets is supermarket sliced bread, a toaster, butter pats and 3 types of jam. The DIY coffee machine makes excellent coffee however. The location is the best part - far enough away from the really squalid parts of Amsterdam around Dam Square yet easy enough to walk to most attractions. Would I stay there again? No. But then I rather hope I won't have to travel too often to Amsterdam in the future. This time it was suffering from a garbage strike and the piles in the streets were getting higher and higher and beginning to smell - just as well the weather was cool. But even without this problem this city is, unfortunately, getting grubbier and sadder as the years go by.", "Date": "May 17, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "3", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Adelaide", "Title": "“Great place to stay”", "Author": "AdelaideNev", "ReviewID": "UR64095744", "Content": "We stayed at the Chic & Basic in early May. This is a fantastic hotel. Their attitude is second to none. Breakfast is free - There is a kitchen & you make your own coffee & toast with choice of 3 jams. Internet access is free. Rooms are modern & clean. The hotel is very central, you can walk to the city centre & railway station. Nothing was too much trouble - I would certainly recommend it.", "Date": "May 14, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Atlanta, Georgia", "Title": "“I PUFFY HEART THIS HOTEL!”", "Author": "Gamxiated", "ReviewID": "UR62203067", "Content": "Puffy Heart is such a cute way to describe this hotel because it is in such an amazing location and really stand true to the style of Amsterdam CHIC & BASIC. The hotel is literally located 5 minutes walk from Central Station right next to the Herengracht Canal. Amsterdam can look spread out on the map, but from this hotel everywhere is walkable. Around the corner of the hotel starts off with a row of coffeeshops that takes you to an alley of shops, delis, and more coffeeshops. Dam Square is walkable from Herengracht and from there you an walk to RLD, then end it in Damrack. With the hotel being close to Central Station, not only can you take a train to any parts of Europe, but shuttles to other parts of Holland, and canal tour boats to the rest of Amsterdam. I would hightly reccomend getting the Medium Modern Hotel Room, although small, it was enough space for 2 people and 2 large luggages, good use of small furnishing, and comfortable/cozy stay in Amsterdam. Expedia has the best price for this hotel. Our room was in the top part of the hotel, the attic, since there was an extra set of stairs to get to the bedroom. The reception was great with a welcoming letter directed to the guest including a brown paper bag with soap, shampoo, and two types of water (sparkling and regular). The lobby is really comfortable and love the kitchen with the free coffee, espresso, cappucinno, tea, and water. The staff were so friendly, just like the rest of the people of Amsterdam. Now the negative, no elevator. Prior to my departure, this is what I reccomended when I filled out the review at check-out. If you look at the buildings of Amsterdam they are very narrow. Yes, the stairs were very narrow and after going up 3 floors to find another set, you gasp for more air. Hopefully one day they can build an elevator for guest to use to get to their floor. Chic & Basic was a second choice from the Bellevue and was very glad this hotel was the winning choice. There is no doubt I would come back here again next time I go to Amsterdam based on the location, value, friendly staff, comfortable stay, and cutesy of it all. P.S. FREE WiFi! BON VOYAGE!", "Date": "April 22, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Sleep Quality": "5", "Rooms": "2", "Location": "5"}, "AuthorLocation": "Marietta, Georgia", "Title": "“Great location but beware the Vintage rooms”", "Author": "Steph V", "ReviewID": "UR61309316", "Content": "We booked this hotel based on its proximity to the train station and the website's description of the rooms as \"...guest rooms are brand new, modern and at the same time comfortable\". I can assure you that our room was nowhere near new (see pics). The walls were beyond overdue for a paint job...plain pewter or tan walls would have been an improvement over the Smurfs, clowns, and circus flags that we had to look at. Despite a small, cramped room with a poor set up, the bed was comfortable and the shower had good pressure. The public areas of the hotel are clean and modern and the breakfast was good. Beware of steps - our room was up one flight of very narrow, treacherous steps. We needed a shower and a nap by the time we got our luggage hauled up! I would stay here again but only in a Modern room (which cost more).", "Date": "April 14, 2010"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Los Angeles", "Title": "“Charming, location, friendly, loved it!”", "Author": "CaliforniaEd", "ReviewID": "UR60290946", "Content": "Located a few hundred meters from the train station. Turn right out of the station before crossing the canal and walk across the canal in front of the Ibis Hotel, then under the major street, all on a ped/bike path. Avoid traffic! Five to ten minutes! Nice old hotel with small rooms and steep winding stairs and great canal views. Our top floor room, 131, was quiet, and the beds were great.. Free internet station downstairs. Nice friendly staff. especially Jenny and Palerma. Breakfast kind of steep and skimpy. We were referred to Pancakes! at 38 Berenstraat. About 10 small blocks, walking past teh Anne Frank house. Great pancakes! Didn't open unti l10am, like most places.??", "Date": "April 4, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Dubai", "Title": "“A perfect stay in Amsterdam begins here”", "Author": "smolinskisr", "ReviewID": "UR59223720", "Content": "The chic and basic hotel in Amsterdam was a great find. If you're going to Amsterdam, this is really the best place to stay, it's right in the center but on a quiet canal. Price was great, and we rcommend taking the breakfast. The rooms are very well kept and have just the right combination of decorations. Everything is clean and tidy, and the staff is excellent. Especially the manager, he was very helpful with just about any request we had.", "Date": "March 22, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "4.0", "Value": "4", "Location": "5", "Rooms": "3"}, "AuthorLocation": "Milano", "Title": "“Very chic and eco-friendly hotel just in the heart of Amsterdam”", "Author": "martiago", "ReviewID": "UR52104197", "Content": "It's a lovely little hotel right on the canal, in a quiet and elegant street. It's a five minute walk to Central Station and another 15 minutes to most any other spot in the city. We stayed at fourth floor, in a very nice room, total white. Every morning we had the old canal houses just in front of us and it had such great charm. The staff was nice and smiling, good breakfast in the morning and free internet all day long.", "Date": "December 29, 2009"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Lambertville, New Jersey", "Title": "“Nice location and good value”", "Author": "trinzeon", "ReviewID": "UR50970476", "Content": "Stayed here first time December 09 and very happy. Room is modern/chic and small. free coffee and internet access. Great location on Herrengracht. 10 minute walk from Centraal. Very friendly and accomodating staff. good size bathroom. No lifts to upstairs rooms. Will.make this my regular stay in A'dam.", "Date": "December 9, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Location": "4", "Rooms": "4"}, "AuthorLocation": "Washington, DC", "Title": "“Great place to stay in Amsterdam”", "Author": "Sarahpo77", "ReviewID": "UR50741519", "Content": "I only stayed there for a night, and the staff was extremely nice (they even upgraded my room, which was gorgeous), the bed was wicked comfortable, and the location is great if you're looking to take in the sites of the real Amsterdam. It's a bit of a walk (and what a scenic walk it is) to Dam Square, coffee shops, etc. So if you're looking to get a real taste of beautiful Amsterdam, stay here.", "Date": "December 6, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Location": "5", "Rooms": "5"}, "AuthorLocation": "", "Title": "“Great location, comfortable hotel...I'd stay here again in a heartbeat!”", "Author": "Flatlander3", "ReviewID": "UR49124168", "Content": "After scouring Trip Advisor for hotels in Amsterdam my friend and I settled on this one. It was a little more than we wanted to pay but it had a private bathroom (which is hard to come by in Amsterdam apparently!). By private I mean in the room but also with a door. We noticed MANY hotels in Amsterdam have the bathroom in the room but either no door or a glass door! The location could not have been better. A 5 min walk from the main train station and in a cozy, quiet neighborhood away from the tourists (Jordan). Great local boutiques, restaurants, cafes and bars all within walking distance. The room was small but clean and we had a beautiful view over the canal. Staff was cheerful and helpful and even helped us with our bags up the steep flight of stairs (steep stairs appear to be unavoidable in Amsterdam if you stay in one of these canal front hotels). Overall I was really happy with our choice and would stay here again!", "Date": "November 13, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "1", "Overall": "4.0", "Value": "3", "Location": "5", "Rooms": "5"}, "AuthorLocation": "San Francisco, CA", "Title": "“Truly chic design, but needs some cleaning”", "Author": "celloflo", "ReviewID": "UR46234260", "Content": "For our honeymoon, we were lucky enough to get one of the coolest rooms at this hotel, which was essentially in the attic of a canal house. It was intimate with the pitched ceiling and canal view, but chic with the white plastic rocking chairs and halogen lights. It was by far one of the coolest rooms we have stayed in at a hotel, but there was quite a bit lacking in cleanliness. The white modern furniture could have used some cleaning, and the tables generally looked worn. Given the unusual configuration of this particular room, the toilet and shower were in windowless enclosures, where there was a air vent. The vent in the toilet area allowed small (harmless) moths to fly in which was somewhat off-putting. I counted up to 6 moths in there at a single time, and there were always a few hanging out on the walls. On to the shower... The shower vent clearly wasn't doing a very good job because there was mildew on the ceiling. All in all, we enjoyed our stay and loved our room, despite having to ignore the bathroom and shower issues. I think the situation is different for every room though. There is 1 computer with internet, and unlimited use of their fancy espresso drink maker. I loved being able to bring a small pot of tea up to my room every night.", "Date": "October 8, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Location": "5", "Rooms": "3"}, "AuthorLocation": "Cesena", "Title": "“Very cute hotel in a very cool location!”", "Author": "Simone17", "ReviewID": "UR45713759", "Content": "We stay in a canal room room, very romantic! Modern, stylish and very good value for money. Is not for you if you don't like climbing stairs!", "Date": "October 3, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "4", "Rooms": "4"}, "AuthorLocation": "Columbus", "Title": "“Surpassed expectations”", "Author": "wolverine2007", "ReviewID": "UR43944635", "Content": "This hotel is ideally located near the train station but in a beautiful street in the Jordaan neighborhood. The amenities are more than you would expect at this price point - free internet, wi-fi throughout the hotel, friendly service, and clean and comfortable rooms with great showers! We will definitely stay here again the next time we come to Amsterdam.", "Date": "September 23, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Location": "3", "Rooms": "4"}, "AuthorLocation": "London", "Title": "“Room with canal view”", "Author": "gronros", "ReviewID": "UR39769139", "Content": "I have stayed at Chic & Basic Amsterdam several times during the last couple of years. Most of the rooms are great but once they put me in a windowless cramped room on the ground floor (try to avoid that one). If you decide to spend a bit more money on the room you get a great view over the canal. The rooms are very minimalist with just the bed, a stool and some hanger for your clothes so don't expect luxury. Interior color throughout the hotel is white which makes everything look very clean. Some nice trendy details make it all work very well. Good breakfast.", "Date": "September 4, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Location": "5", "Rooms": "4"}, "AuthorLocation": "South East London", "Title": "“Excellent value for money”", "Author": "Stephanie058", "ReviewID": "UR38557289", "Content": "This hotel is in a great location right by the canal and although describes itself as basic provides all that is needed for a comfortable base whilst staying in Amsterdam. The room was small but very clean with all the usual facilities such as a hair dryer, iron ect. The decorations were great, querky and very well done. There were tea and coffee making facilities in the room but also free tea and coffee and a water machine in the main area. The breakfast was excellent value for money and provided a better breakfast than I have had in some hotels recently which have a much higher star rating. All the staff were very friendly and really helpful. I would definitely go back there if I return to Amsterdam.", "Date": "August 23, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Calgary, Canada", "Title": "“Excellent stay”", "Author": "kismet33", "ReviewID": "UR35776925", "Content": "My friend and I stayed here for 10 days in June. Recommended by a colleague of mine who stayed there with her family. Truly enjoyed our stay, we had the large modern room, which was very clean and spacious. Like the name of the hotel, it is chic and basic. Very good breakfast in the mornings, and free internet access. The staff was great, friendly and helpful! Very convenient location. Short walk from the train station. Short walk to restaurants and shops. Would definitely stay here again and recommend to all my family and friends. Loved Amsterdam!", "Date": "July 25, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Houston, Texas", "Title": "“I will ALWAYS Come Back to This Hotel”", "Author": "tadpole1995", "ReviewID": "UR35304105", "Content": "I stayed in a medium \"basic\" room, but it was anything but. The room was a nice size considering it was in Europe. I had a full bathtub, sink, desk, nice bed and AWESOME canal view (see photos). It's a hop, skip, and a jump from Amsterdam Centraal Station (I walked, rolling a full suitcase), and is within walking distance of several great bars, restaurants, and the Anne Frank House. The clientele is young but not too young, hip but not too hip. So really anyone will fit in, especially since the price is right. The staff were friendly and helpful and non-pretentious. I personally caused a blackout on my floor and the guy from the front desk didn't bat an eye when called up to help me (and everyone else) out, even though it was 2 am. They even set up a projector in the lounge so we could watch the Michael Jackson memorial on CNN.com. Free cappuccino machine (this really helped me out during a personal crisis) Free internet computer Free wi-fi A lot more than you'd get at most hotels. I later stayed at the Renniassance and it paled in comparisson. Based on some of the reviews, it seems to be a hit or a miss with the type of room you get. But all else makes up for it, and no one else I ran into in seemed to have issues with their room. Everything else about this place will certainly keep me coming back for future trips...it's part of the reason I fell in love with Amsterdam.", "Date": "July 20, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "3", "Location": "5", "Rooms": "3"}, "AuthorLocation": "Corpus Christi, Texas", "Title": "“Our \"home base\" in Amsterdam”", "Author": "WItraveler333", "ReviewID": "UR31484041", "Content": "This is the second time we have stayed at Chic and Basic on both ends of our European trip. While all the comments about small rooms and steep stairs are accurate (over time we've stayed in 4 different rooms on different flours), we have found this hotel very much to our liking. The location is great - quiet neighborhood overlooking a canal and only a few blocks from the train station. We have had very positive interactions with the staff. They have let us check in early, kept our bags in a secure location after checkout and until we were ready to actually leave Amsterdam, and allowed me to \"hang out\" in their lobby when I had an injured foot and couldn't join my husband walking around the city. The breakfast is quite good compared to many other hotels and the free internet in the lobby is appreciated. Before we found Chic and Basic we had stayed at several other hotels near the train station. We feel much more comfortable here - it's more like a \"neighborhood hotel\" than a \"train station\" hotel. When we know we are flying in and out of Amsterdam, one of the first things we do is make our reservation here.", "Date": "June 3, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "2.0", "Value": "2", "Location": "5", "Rooms": "1"}, "AuthorLocation": "Vancouver, BC", "Title": "“You better like who you are traveling with!”", "Author": "EuropeanTraveler09", "ReviewID": "UR30406406", "Content": "The best thing about this hotel is the location. That is where it ends though. We checked in at 7pm at night and stood outside in the rain because the front door was locked. After half a dozen buzzes someone came to let us in. We were quickly taken to our \"room\" which was outside of the main building and literally outside with no covering. We were let into our little cell, which was no bigger than 7 by 7 feet! The bathroom door couldn't open properly because it hit the bed. The bathroom was fine and clean for the most part. We were also able to hear what appeared to be a very private conversation between the people in the room next to us. We were also told that breakfast was served in the morning, which turned out to be quite good. However, be warned, it appears to be a buffet breakfast, which is offered by most European hotels. However upon checkout we were told that we had to pay for it. We had no problem with that, but they probably should have mentioned it! We will not go back and suggest that you don't bother either.", "Date": "May 20, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Location": "4", "Rooms": "4"}, "AuthorLocation": "Yorkshire", "Title": "“Great hotel - the name says it all !!!!”", "Author": "YorkshireNic", "ReviewID": "UR29762483", "Content": "My partner and I stayed at this lovely hotel for 4 nights at the beginning of May. We were welcomed to the hotel by the receptionist who then escorted us up to our room. The room was spacious, the room had 2 single beds, spare fold up bed, a small balcony, window, cupboard/wardrobe, iron, ironing board, hair dryer, tv, welcome pack (bottled water, soap, shower gel, hotel info). The room was larger than expected and even had a small balcony, it was very small but still a great bonus. It would be great when the weather's a bit warmer. The bathroom was extremely clean, walk in shower, large sink and toilet. Lots of towels, changed when needed. The hotel has a computer in the reception / lounge area with free internet access, there's also free coffee and water, there's a secure luggage storage area which alson has safes which are free to use, staff keep this area locked so it's secure. Staff were very friendly and even offered umbrellas when it was raining. The hotel is only 5 minutes walk from the Centraal Station, really nice location. Overall a great hotel and I would stay there if I ever return to Amsterdam.", "Date": "May 11, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Location": "5", "Rooms": "3"}, "AuthorLocation": "Doha", "Title": "“Great location”", "Author": "dohadiverdiva", "ReviewID": "UR29691503", "Content": "Chic & Basic was a lovely laid back little hotel. Fantastic location by the canals, friendly staff. Rooms weren't great but fine for a few days. No room service but you can help yourself to coffee, tea or chocolate from the kitchen any time of day or night. Would recommend it to people visiting Amsterdam for a few days. Not wheelchair accessible and not good for elderly people or small children. However I'd definitely stay there again.", "Date": "May 10, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Location": "5", "Rooms": "3"}, "AuthorLocation": "SYD-LON-MUC", "Title": "“Nice Area Nice Hotel Chic & Basic”", "Author": "k1w1brad", "ReviewID": "UR29528261", "Content": "Stayed here with my wife. Lovely hotel in a nice area. Easy 5/10 minutes walk from Centraal Station. Easy to find. Great view from rooms on the river. Stairs are a little steep. Note that if they haven't mentioned that breakfast is included do not assume. But for â‚¬7.50 I couldn't argue with the Cold Cut Buffet with all the usual bread, cheeses, Juices etc. Only a 5 to 10 minute walk from the Red Light District and close to Tram Stops. I wouldn't hesitate to stay here again. Location is good for some nice restaurants and bars around the Jordaan Area. To get a feel of what the area is like see the following links: http://www.jordaaninfo.com/ http://www.amsterdam.info/jordaan/ The room is cosy but the bathroom is more of a 2 star rating at best. No shower curtain so water pretty much goes all over the bathroom. Other than that the room itself is fine and comfortable with a 3 to 3.5 star rating. We had room 321 which is the one pictured on their website. I have attached photo's from the room to give you and idea. Apologies for putting the pics of the bathroom up but would rather you all see what it is like prior to getting there. Service was great. Free internet access. We checked in online and they were happy to print out our boarding passes free which was a nice touch as some places I have stayed at charge it to your room or even charge you at the business centre. I gave a 3 for the Room due to the bathroom. The room itself nice. All in all I would be more than happy to stay ere again.", "Date": "May 7, 2009"}, {"Ratings": {"Service": "1", "Cleanliness": "3", "Overall": "2.0", "Value": "2", "Location": "5", "Rooms": "2"}, "AuthorLocation": "UK", "Title": "“The good, the bad and the ugly...”", "Author": "Lollapot", "ReviewID": "UR28239495", "Content": "The Good...Check in staff member was very friendly, location excellent and the reception and communal areas very nicely decorated. Bed comfortable and room clean. The Bad...Room had a tiny, cell-like single window that was also filthy dirty, allowing very little natural light in. Showering was difficult because the shower partition was broken and half missing, allowing the bathroom to become soaked. Bathroom a bit mildewy. If you're over 5'9'' you won't be able to stand in the bath to shower. The ugly.. Late arriving guests were allowed to make a great deal of noise until 1am. When staff were politely approached to assist, they were downright rude and unhelpful. The staff member that checked us out on the morning of the 4th of April was particularly unhelpful, rude, unfriendly and really needs some training in how to deal with customers. She expressed no regret or apology for the problems we encountered. We were offered a discount but I would have been happy with a polite apology and friendly service! Perhaps we were just unlucky - there are some great aspects to this hotel and the breakfast buffet was lovely but there is no substitute for basic, polite service.", "Date": "April 17, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "5.0", "Value": "5", "Location": "4", "Rooms": "5"}, "AuthorLocation": "Parabiago, Italy", "Title": "“Highly recommended stylish hotel”", "Author": "worldcitizen31", "ReviewID": "UR27924278", "Content": "Chose this hotel for its very good price and stylish all-white rooms. We spent 3 nights here in February 2009 and were highly satisfied with the service: staff is friendly and helpful, breakfast (7,50 â‚¬) was very good, fresh and abundant. At any time of the day and night, you can go to the lobby for a free cup of tea/coffee/water and there's also free internet connection. Our Room was well-sized, with a window overlooking a \"hanging garden\" and a cozy balcony on the back; bathroom, although without window, was spotless clean. Another plus was the location: at a walking distance from city centre and station but on a very quiet and romantic canal. Would come back for sure!!!", "Date": "April 13, 2009"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Overall": "3.0", "Value": "1", "Location": "4", "Rooms": "1"}, "AuthorLocation": "Manchester", "Title": "“It's not entirely chic and basic”", "Author": "chocks76", "ReviewID": "UR27872638", "Content": "We stayed at Chic & Basic from Good Friday to Easter Sunday 2009. We'd booked based on various reviews but also due to what we saw on the hotel website. The rooms are sold as modern and comfortable. The fact is that not all of the rooms are like this. We had booked a medium room via easytobook.com When we arrived and checked in, we were taken to a first floor room. For those who have problems climbing stairs, please note that the stairs were extremely steep. The room didn't represent what the photos show on any of the websites (travel agents or the hotel site.) The hotel's own website makes no reference to the 1970's decorated rooms with murals of bunting and the Smurfs (!) on the walls. The room was dark, with brown carpets and it looked like a child had been drawing on the walls. We therefore disputed the booking and what we'd been promised and were given the response of \"sorry we're full, and you didn't request a Chic & Basic room.\" We did book Chic&Basic - that's why we were standing in the hotel and also why they had a record of our booking. After much debate and negotiation we were given a small modern room on the ground floor. This was accessed via a door leading to an outside corridor with puddles on the floor. It had a very small window and no natural light. It was extremely small and the bathroom (shower and toilet) was tiny. Despite this, it was very clean, had a flat screen tv and a welcome pack (bottled water, shower gel and soap.) There was noise from an extractor fan at all times which could be annoying for light sleepers. Breakfast is served until 10.30am and has an ok selection of breads, cheeses, meats and fruit. Tea, coffee and water are available all day and for free. The majority of the staff were very helpful and friendly. They allowed us to check in early and store our bags once we'd checked out. The location of the hotel is superb. It's quiet whilst only being minutes from Centraal Station. If you get a decent room with a canal view, then it would be good value for money. I'd advise that you check with them directly before you book that the modern rooms are available, and that you request and receive confirmation of exactly it is you want.", "Date": "April 12, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Location": "5", "Rooms": "4"}, "AuthorLocation": "London, United Kingdom", "Title": "“Friendly and Comfortable”", "Author": "LSETerp", "ReviewID": "UR27359303", "Content": "My roommate and I went to Amsterdam for a few days, and since this hotel was about the same price as a hostel we stayed there. It's in a great location a short walk from Central Station, and on a very quiet street. We stayed in one of their medium modern rooms, which had a giant canvas photograph as the headboard/light that had different colored lights behind it (they also have \"vintage rooms\" that are just like any other hotel.) The size of the room was comfortable for two people, and we had plenty of space to move around. The best part about this place was the feeling of hospitality. There was always someone at the reception desk, and at any time of the day or night you could come to the lobby for a glass of water or free cup of tea or coffee from the machine that made lattes, espresso, and pretty much any other kind of coffee you could want. There is also a computer with internet access that you are free to use, and a comfortable lounge area to hang out. The staff is friendly and attentive, and made us feel welcome. One thing I will point out is there is no elevator and the stairs are steep, so anyone with mobility problems would have difficulties. Otherwise a great place to stay!", "Date": "April 3, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "1"}, "AuthorLocation": "Norge", "Title": "“wonderfull breakfest”", "Author": "SII_And_Andreia", "ReviewID": "UR26805105", "Content": "I love stay in this hotel, the staff were grait. The breakfest was perfect, lot of delicious cheese and all we need !!! aple pai, chocolat kakes, yumm plus plus.I have been two time already in Amsterdan cause I was invited for back with a group of friends, and we stay in diferent hotell and both were grait, but the diference betwen them was the location, Chic & Basic is clouser of train station and a lot of things, we just need walk feew min to get what we need, like restaurants, live music, night clubs etc. I could stay again if I back in Amsterdan. Amsterdan centrum definitely is not a place to come with kids, then I recomend to adult only. Room: Good bad, but the room were cold for me, and quite small...But was enough for the price.", "Date": "March 25, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "5.0", "Value": "4", "Location": "5", "Rooms": "4"}, "AuthorLocation": "London", "Title": "“Great location - very Amsterdam”", "Author": "wimbledon04", "ReviewID": "UR25993563", "Content": "2nd time I stayed on a business trip. Love the location and canal side atmosphere. Staff are very friendly, efficient and laid back, rooms quite small but very clean and comfortable and the best automated latte I have come across. Sets you up nicely for the day.", "Date": "March 11, 2009"}, {"Ratings": {"Service": "1", "Cleanliness": "5", "Overall": "3.0", "Value": "3", "Location": "5", "Rooms": "3"}, "AuthorLocation": "east midlands", "Title": "“great trip shame bout the messy hotel service!”", "Author": "airgurl", "ReviewID": "UR25011476", "Content": "i booked this trip as a surprise for my boyfriends 21st birthday. chic and basic took my fancy as the hotel to stay in as it was a good proce and in a very good location for the station and center etc, however when we first arrived we were told that the room i had requested on booking was no longer avalible as they has just found a wasp nest in it. me and my boyfriend didnt mind this as we fiqured well it cant be helped its not the hotels fault. the room we got placed in was down a outside passage way with no outside window, it was a shockinly small room for the amount i had payed, then next day as we were leaving the hotel to go out we were stopped and told we had to move rooms as the room we were in was booked for someone else for that night. we were told we would not have a room untill 3pm that day. when we got back we had a second room which was a lovely room with a canal view (which i had requested before) however it had two single beds. so we settleed into our new nice room however the room i requested origianlly was just next door, and there certianly was not a wasp nest in there as there was a coulpe staying in that room. yet again when we left the follwoing moring we were told we had to move rooms again. so back to the small room downstairs. and then moved again for our fianl night. so overall we didnt have a hotel room from 10-3 every day. we moved a total of 4 times in 5 days the only offer we got of compensation was breakfast and we were lied to about the room i had requested and told was availble 3 mounths prior to our visit. its a shame to have such hassel on a hoilday. the hotel was nice all be it if your not messed around so much. we will not be staying here again", "Date": "February 23, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "PR", "Title": "“Loved this modern yet cozy place!”", "Author": "nagisa_chan", "ReviewID": "UR24202649", "Content": "I stayed recently in this hotel with my husband for a couple of days and it was a very good experience. We enjoyed a lot the modern style and I specially liked that I could go to the lobby at any time and get myself a cup of coffee or tea for free! The lobby was a nice place to hang out or internet. In case you don't have your own laptop there is a computer in the lobby for the guest's use. Our room was very pleasant with nice furniture and the bathroom was very clean. Breakfast was every morning and a great variety of fruit! The staff was friendly and extremely accommodating. I would recommend this place to anyone!", "Date": "February 4, 2009"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "Minneapolis", "Title": "“Charming Boutique - Great Location”", "Author": "gopherstateguy", "ReviewID": "UR23912548", "Content": "My wife and I booked our stay directly with the hotel and let them know that we'd only have two nights to stay in Amsterdam at the tail end of our honeymoon and they were extremely cooperative. They upgraded us to one of their \"best\" suites and presented us with a free bottle of champagne as well upon arrival. The previous reviews about the stairs are spot-on because they are very steep and lots of them! One other minor issue we had was the angles in the room we stayed in (top floor, probably used to be the attic?) and how many times we could have knocked ourselves out if we didn't duck at the correct time. What it came down to for us, was this was our kind of place because it felt very original and matched the neighborhood scene that we were looking for. I wouldn't recommend this to everyone, especially older folks or conservative individuals. The style is modern and clean, but not necessarily deluxe or comfortable. We loved the staff - especially one of the late-night attendees, who helped us when we stumbled back to the hotel after too many amstel lights and prepared us the most delicious microwave thai peanut noodle dish and ham and cheese sandwich with a free half bottle of wine (that we probably didn't need, but appreciated). He was super nice and glad to be helping us out, which my wife thought was the sweetest thing. Overall, we couldn't have been happier and we're extremely glad we picked this hotel.", "Date": "January 26, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "derry ireland", "Title": "“Freezin in amsterdam”", "Author": "baldy60", "ReviewID": "UR23379625", "Content": "We spent four very cold but lovely days in amsterdam. What a beautiful city and a wonderful way to spend the new year. I had read several good reviews on chic and basic i was not disappointed very bright cheery reception area with free coffee machine which was perfect for cold days. Our room was only one on ground floor which meant we didnt have to climb all those steep stairs we had no view though but we didnt mind, the room was small but spotlessly clean beds changed every day, bathroom spotless as well, i think this is one of cleanest places we have ever stayed. The only thing i would say against it is breakfast is rather pricey for what you get, a cooked breakfast is same price in the town. Beautiful quiet location only few minutes walk from central station and very close to dam square.", "Date": "January 8, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "hull", "Title": "“great hotel and location”", "Author": "hotelobsessive", "ReviewID": "UR23083429", "Content": "stayed one night having booked over the phone with the hotel. The booking went smoothly. The hotel was as it says in the name, and done very well. It is in a traditional canal house. We had a canel view room and the bathroom was excellent. Breakfast was good and there was a computer with internet access. Staff were helpful and polite. Location is excellent 5 to 10 minute walk from the train station and at the top of the nine alleys area. Beware though there is no lift.", "Date": "December 29, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "london", "Title": "“Recommended by my dentist.....”", "Author": "jajalondon", "ReviewID": "UR22337414", "Content": ".... but then he is from Amsterdam! He also recommended the area - Jordaan - in general: still part of \"Old Amsterdam\" and great for just schmoozing around. The hotel is wonderfully located: nearby is a street with bakeries, delis, \"coffee\" shops,and restaurants; you can walk from the station:it's 0-6km. If you do take a taxi, beware of the drivers who claim not to know where the hotel is: the street number is 13-19. Public transport is a five minute walk away. I had a spacious room (Room 401) with its own front door, so I could pretend to be a real Amsterdammer. It hasn't been given the \"chic and basic\" treatment yet, but was cheap and cheerful - light, spotless and with a huge window overlooking the canal.Comfortable beds. Breakfast was fine and excellent cappucinos, lattes etc. ( and I do mean coffees) are available 24/7 in the dining area. Staff are terrific: young, mostly Dutch, energetic, helpful, relaxed and genuinely welcoming. I wouldn't stay anywhere else!", "Date": "December 1, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Business service (e.g., internet access)": "4", "Check in / front desk": "5", "Overall": "4.0", "Value": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Dublin", "Title": "“Exactly as the name says”", "Author": "robcheetham", "ReviewID": "UR21786770", "Content": "Stayed for one night. Great location; less than 10 mins from the station and max 15 mins to Dam Sq (and thats at a real leisurely pace). Located in a quiet street just far enough away from the tourist track to have shops and restaurants residents would use. But close enough that you can be in the middle of town in minutes. Hotel overall is very clean; it has a white, modern minimalist interior. Rooms aren't large but big enough for a double bed and 2 people not to fall over each other. Each has a slightly different theme (mine was Sports; with rackets, balls, etc painted in corners). Nothing dramatic but makes the hotel a memorable part of break unlike the bland chains. Incredibly friendly staff; couldn't do enough to help. Take their recommendations as to local restaurants. Suggested a fantastic Thai restaurant just around the corner for us. Breakfast is well worth the extra charge. Only thing to highlight is that the stairs are all quite steep. Nothing ridiculous but might be a concern for parents with small children, etc. As for me will definitely be staying at the Chic & Basic when I go back to Amsterdam in the New Year.", "Date": "November 12, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "4", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Washington DC", "Title": "“Nice little place”", "Author": "DanPL", "ReviewID": "UR21036273", "Content": "Well located, trendy and at a reasonable price. Not as nice as the â€œchic and basicâ€� in Barcelona, but it still stands up to its name.", "Date": "October 20, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Melbourne, Australia", "Title": "“great hotel, perfect base to explore Amsterdam”", "Author": "dr_abacus", "ReviewID": "UR20949679", "Content": "my wife and i spent 3 nights at the Chic and Basic and we enjoyed it very much. The hotel is in a good location (no dodgy stuff next door) and is a short walk to almost everything in Amsterdam that you would want to see (and some of the things you might not want to see too :-). The breakfast is excellent, and they will do you laundry for just 10 Euro! All you have to do it drop it off at reception and you get it back in the evening. It was also handy to have access to the internet via the free PC in the reception area.", "Date": "October 17, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Business service (e.g., internet access)": "4", "Check in / front desk": "4", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Vancouver, BC", "Title": "“Travel Light? and Chic?”", "Author": "Makena07", "ReviewID": "UR20457845", "Content": "Chic and Basic, as its namesake, is chic and basic. Located close to the train station, this is a great place to stay if you enjoy boutique hotels. We had canal side rooms, which had large windows opening to fresh air and great views. Welcomed with a personal note and welcome pack, the chic white rooms were clean and a good size (although basic- ie., no closet, sitting area). Our room was on the third floor (after two treacherous stair ways-the stairs are unduly steep, short-runs with high-rises, and twist! upwards). It was very difficult to get our luggage up the stairs, and we would only recommend this hotel if you travel light, and are young and able (older folks would have trouble with the steep stairs). The bathrooms are large, but the showers are not separated from the rest of the bathroom (everything get wet when you shower - the toilet, sink, towels and floor, no matter how careful!). The breakfast is solid value, and the staff are really helpful - with luggage storage and arranging bike rentals from the hotel directly). This is a true \"boutique\" hotel - great if you enjoy a little different room layout, and enjoy the \"chic and basic\". If you like the little extras in a luxury or business hotel, this may not appeal to you at all. We had a problem with moquitoes coming into through the windows, and the citronella plug-in didnt do much.", "Date": "September 29, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Melbourne, Australia", "Title": "“Value for money”", "Author": "NS007", "ReviewID": "UR19284687", "Content": "After reading reviews on here we decided to book in for 3nights. The hotel was excellent, about 5-10min walk from the main train station and a similar distance to Dam Square. In a quiet street overlooking a beautiful canal. Our room was in the attic which was a bit of a pain as there are no elevators and quite a few narrow tight stairs. Some would have trouble negotiating these stairs and would no doubt be upset about it, but you take the good with the bad when travelling in europe. The room was quite spacious with a large double bed, large shower and toilet... both of which were clean. We also had a mini lounge area that consisted of 2 hard plastic funky chairs and an lcd monitor with free cable... lots of channels included, including the adult channel which was good for a laugh. The staff were excellent! very helpful and spoke excellent english. Breakfast was your standard euro breaky with meats cheese breads and cereals. The free wifi was also a nice touch for those travelling with iPhones or laptops. All in all we enjoyed our stay at the chic n basic and would no doubt go back in the future", "Date": "August 23, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "2", "Check in / front desk": "5", "Overall": "5.0", "Value": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Hong Kong, China", "Title": "“Clean, tidy, small, Amsterdam style”", "Author": "subtarget", "ReviewID": "UR18633936", "Content": "Although the landmark red lip sofa 's missing from the front, we managed to find it after getting off the street cars. It was stacked in the back, as it turned out. As promised it was very recently renovated; it was refreshing to step inside the property. Staff were very friendly and showed us to our room in no time. Although there was a bit of struggle carrying the heavy bags up flights of stairs. We booked the large room with canal view. It was not the one on top floor, but still had a good view of the canal and streets. The room was clean and tidy. We didn't bother turning on the sensational colorful lights; just sat down and watched Tv. Though small, the room was well equiped. For our package, breakfast was included. There was bread, cereal, ham, cheese, boiled eggs, fruit. All were fresh and excellent. Online access was limited during our stay, because the main computers broke down, we had to use one at the cafe with a cable connecting to the front reception. There was only one computer available for all the customers of the hotel; I had to resort to uploading the photos to facebook at night as it took a few minutes. Other than that, I had no complaints. Hopefully it will be fixed by the time you read this. I would like to thank the staff for their kind help during my stay.", "Date": "August 5, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Check in / front desk": "5", "Overall": "4.0", "Value": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Jakarta,Indonesia", "Title": "“Nice for Budget-Tight travellers”", "Author": "M_Pranolo", "ReviewID": "UR17801656", "Content": "As I used to stay in hotels in Asian countries, I would consider that this hotel has a very small room. But, I think this is quite common in europe. Chic-n-Basic Good: - Clean - FREE and fast Wireless internet access - Nice and very cute soaps and shampoos with all the writings on them. I would think that this hotel is properly managed and thought of. We had a welcome package with 3 bottles of mineral water, 1 soap and 1 shampoo. It also comes with a welcome letter stating about the 'house rule' with the internet access code. - FREE WATER!! yes, it might be redicilous, but, hey...get all you want before you go away with the bike - FREE COFFEE all day long...nice cofee machine (not the cheap one). Check out my pictures - Location...Location..Location. It's true that it's very close from the train station. Euro 10 only to get from station to the hotel and vice versa. It's walkable distance from the hotel. However, beware that your luggage's wheel might go bad since the pathway is very uneven. I would rather take a Euro10 taxy to avoid my wheels being spoiled.It only takes 3 minutes by bike to the Daam and Royal palace (also where the madam tussaude is). - Warm and Family feeling in the hotel. Nice people serving you will answer all your questions and needs (thanks for scotch tape Cynthia.....thanks for the trip advise Ginny) - Whole day bike rental is only Euro 10. Bad: - Very small room - We actually needed to 'support' the big window with a couple of wooden brick in order to make it open. - NO AC (who needs one when it's winter anyway) - Seperate toilet and bathroom. - Steep stairs - We need to ask the reception to open our door manually (this happens to many people staying there..not only us) since they claim that they are fixing the lock system. hmm..it's OK..but it's a bit troublesome to keep asking the reception everytime we wanted to go into the room. We had a false fire alarm when we stayed there (it was around 2am) and everybody ran out of the building. However, the management claims that it was somebody taking a shower and trigger the alarm. We had quite a nice experience there overall. Thank you for the hospitality.", "Date": "July 12, 2008"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "AZ", "Title": "“Terrific room, good breakfast, lovely neighborhood”", "Author": "AZflier", "ReviewID": "UR17618098", "Content": "We stayed one night at the Chic and Basic. Easy walk from the train station with our rolling bags. Lovely residential neighborhood right on a canal. We had a great room - large and airy, big windows, very nice bathroom with a door, comfortable bed, flat screen TV. Yes, there were steep stairs, but the staff offered to help with the bags. Breakfast was included in the price and was very good - cheeses and meats, breads, yogurt. We did a lot of walking and found the location to be very convenient. I would stay there again.", "Date": "July 7, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Capitola, California", "Title": "“Nice basic hotel with excellent location!”", "Author": "InTwoPlaces", "ReviewID": "UR17408867", "Content": "We always stays in Amsterdam on our way back to US. This hotel is one of the best hotel we have found in this price-class. (We paid Eur 135 without breakfast.) The location is great and the walk from the train-station is a short 5-10 minutes walk. The surroundings is nice and it's easy to walk to bar's restaurants and coffee-shops. The receptionist was very friendly and the room was basic, but clean and quiet. (We stayed on the 2nd floor). The only draw-back is that the stairs is very narrow and steep, it's very difficult to bring a large suite-case up the stairs.(That's the case in a lot of hotels in Netherlands) We didn't have breakfast, it didn't look any special to us, but we enjoyed the free coffee 24/7. Now we now where to stay next time!", "Date": "July 1, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Business service (e.g., internet access)": "4", "Check in / front desk": "4", "Overall": "4.0", "Value": "3", "Rooms": "3", "Location": "5"}, "AuthorLocation": "England", "Title": "“It does what it says on the tin”", "Author": "TravelcrazyEngland", "ReviewID": "UR17106924", "Content": "It is exactly what it says it is Chic - painted white and very minimalist. Modern reception lounge Basic - nothing more than you need. Some rooms apparently don't have bathrooms. Our room did have a bathroom but no door (not overly ideal!) The key thing about this hotel is it's location, it is so central. It is just a stones throw from the train station, you can easily wheel your suitcase there if you know where you are going. It is very close to a nice shopping and cafe area and some fantastic restaurants are nearby. We went to Christophe's (highly recommend it) it is the best meal we have had to date. Breakfast is basic, but more than adequate, fresh coffee seems to be available all day via the machine, as is water. Internet is also available in the same area. This hotel has very clever use of space. The rooms up the top are lovely, but beware, as with all buildings in Amsterdam, very steep stairs!!", "Date": "June 21, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Business service (e.g., internet access)": "4", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Oslo", "Title": "“Amazing hotel!”", "Author": "Josalia", "ReviewID": "UR16961724", "Content": "WOW! This is an amazing hotel in every way: Picture this: You walk from Central Station to the hotel within 10 minutes which is ideally situated along the canal Herengracht. As soon as you enter the hotel everything is made easy for you: a quick check in and the friendly staff shows you around in their lovely hotel! They booked us fabulous restaurants and gave us very usefull recommendations for shows, bars and shopping. You feel very well appriciated in this hotel and the chic&basic staff knows really the best places in town! We stayed for 4 days and we never got bored: First day we rented the bikes from the hotel. On the last day we even made a tour by the chic&basic boat along the canal!! AMAZING it is! We can certainly recommend this hotel to everybody! I would like to thank all the chic&basic staff for the wonderfull time we have had! J&R", "Date": "June 16, 2008"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Business service (e.g., internet access)": "3", "Check in / front desk": "5", "Overall": "3.0", "Value": "2", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Chicago, Illinois", "Title": "“Non Smoking, Not Completely True”", "Author": "AlexRobin", "ReviewID": "UR16121135", "Content": "This was the most expensive hotel we stayed in our Netherlands and Belgium trip but then again most of the hotels in amsterdam were very expensive on those dates. We paid 140 euros per night without breakfast and I really wasnt that happy about the place. No refrigerator in the bedroom, bedroom was small, walls were too thin, you can hear everything, above, beside and around you and the worse thing is that I smelled smoking in the other room. When I asked the front desk he said that they have smoke alarms and it would sound if someone smoked in their rooms. We stayed in room 312 and our french neighbors were huffing and puffing through the wee hours of the morning. We hate smokers and that really pissed us big time. As a warning, if you have kids, dont leave them with the remote because there is a porn channel. That might be good for adults :) The room is modern with contemporary hip design. It reminds me of the paramount hotel in NY with its all white simplistic clean line look. Now for the good, Jessica who helped us on our arrival was fabulous, she provides great service and gave a wonderful restaurant recommendation, MUDERS which means mother. This place is not your fancy place but your local comfort food place, oh so yummy. You need reservations to get in and you need to be careful when you look for this place because there are no big signs. we walked past this place 5x, can you believe that? They have free internet connection in the lobby. If they truly get strict with the smoking and if the rates is less than 100 euros, I will recommend this place and even come back", "Date": "May 16, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Check in / front desk": "5", "Overall": "3.0", "Value": "3", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Calgary", "Title": "“OK Hotel...”", "Author": "HockeyMark", "ReviewID": "UR15897735", "Content": "My wife and I have just completed our 5 week honeymoon trip to Western Europe...I boooked the majority of our hotels with information from Trip advisor... We stayed at Hotel Chic & Basic for 2 nites in April...This hotel was ideally situated on the Herengracht canal, 5-10 minute walk from the train station. The centre of Amsterdam is not very big, and everything was within walking distance of this hotel. We booked this hotel directly for a rate of 140 Euros a nite...(The most expensive on our trip)...The hotel is quite nice, I'm not sure why it's only listed as a 2 star (maybe because it doesn't have an elevator???)...The are several steep stairs at awkward angles throughout the hotel, which is standard for Amsterdam... Our room was a spacious 2 story room with some widowmaker stairs leading to a bathroom...(Be careful if you've had a few Heineken's...hehehehe) Our room did not come with a view of any sort...There was a little window up by the ceiling... There was a 24 hr cappuccino/espresso machine and internet available in the lobby...Breakfast is served in the lobby for an additional 7.50 Euro...The staff was wonderful and helpful... Don't get me wrong this is a nice place to stay and we enjoyed our time in Amsterdam...However, looking back, I'm not sure this place offered the best bang for our buck...", "Date": "May 10, 2008"}, {"Ratings": {"Overall": "2.0"}, "AuthorLocation": "London", "Title": "“Staff were very very good”", "Author": "Iainlonuk", "ReviewID": "UR15833198", "Content": "On entering the Hotel, The staff were so so helpful and friendly,The breakfast was ok in the morning, I found the hotel very expensive for what you get, The Rooms were spotless, How ever we had a ground floor room and you could hear everyone having breakfast and talking in the morning, So try and get a room away from the ground floor.", "Date": "May 9, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Cluj-Napoca, Romania", "Title": "“Perfect”", "Author": "Merllinn", "ReviewID": "UR15199271", "Content": "It was great. Although a 2-star hotel, everythink was great. My partner and I had a mini-suite on the top floor and we were amazed how cosy it was. The bed was confortable and the most important thing is that every corner of the room was very clean. Perfect location (5 minutes walk from the station) and great staff. The price seemed a bit high for a 2-star hotel but we didn't regret it at all. Next time I will be in Amsterdam I will surely book this hotel.", "Date": "April 21, 2008"}, {"Ratings": {"Service": "3", "Cleanliness": "2", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "2.0", "Value": "3", "Rooms": "2", "Location": "4"}, "AuthorLocation": "Yorkshire", "Title": "“A little disappointed”", "Author": "Abby12345", "ReviewID": "UR15161061", "Content": "Was a little dissapointed with the hotel, Staff were very pleasant and it was in a excellent location however the room was very small although the bedding was clean and the shower also there was a lot of marks on the walls that let this room down ( In nee of a paint i think) also you are lead to believe that the breakfast is free which isnt the case i think they need to change the wording on the rooms welcome note. Also room was nothing like picture of room shown on internet with nice pic behind bed . we had a pic of a glass and a newspaper on our wall ???? Also net curtains could do with a good clean and the view from our window was a dead plant in a plant pot", "Date": "April 20, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Northern California", "Title": "“Great Location & Value”", "Author": "LJar", "ReviewID": "UR15090995", "Content": "I was looking for a comfortable room with a spectacular canal view in Amsterdam's Jordan neighborhood, and I found one at Chic & Basic. A quick 7-minute walk from Central Station, the hotel sits near the corner of two canals and within reach of several cafes, shops and tourist attractions. The hotel staff was extremely friendly and helpful. Their breakfast is one of the best we've encountered in Amsterdam (both in options and value). An epresso machine in the main lobby is available 24-hours per day for guests, offering free tea, coffee, espresso, latte, cappuccino, etc. A basic kettle with coffee and tea supplies is also provided in each room. Free internet access and room service are also a plus. The beds were extremely comfortable, and the towels soft. Navigating the narrow and steep stairs will be difficult for those guests lugging large bags. However, the view gained from the top floors is truly wonderful (and the rooms are far more quiet in comparison to those near street level). If you are looking for 4-star accommodation at a 2-star price, Chic & Basic is the place for you. Enjoy!", "Date": "April 16, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "3", "Business service (e.g., internet access)": "4", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "3", "Location": "5"}, "AuthorLocation": "London", "Title": "“hidden treasure”", "Author": "LondonLupe", "ReviewID": "UR14689877", "Content": "Its like a hidden treasure at the Canal Herengracht!: BEAUTIFUL! Never found any other hotel in this city which has such a perfect location, helpfull and warm staff and all that for a good price! Its a mix of design, surprising details in an truely unique Amsterdam house, I just LOVED it!", "Date": "March 31, 2008"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Business service (e.g., internet access)": "4", "Check in / front desk": "5", "Overall": "3.0", "Value": "3", "Rooms": "2", "Location": "5"}, "AuthorLocation": "london", "Title": "“chic and small”", "Author": "clivebear", "ReviewID": "UR14404088", "Content": "3 of us stayed for a weekend my room was a small single-even the xl rooms are small,not worth the money and nowhere does it say you pay for breakfast!! staff great except breakfast staff who never smiled once not worth the money", "Date": "March 20, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Business service (e.g., internet access)": "4", "Check in / front desk": "4", "Overall": "3.0", "Value": "3", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Barcelona, Spain", "Title": "“great location - beautiful and modern”", "Author": "mmhbcn", "ReviewID": "UR14071531", "Content": "The hotel is located in Jordaan, beautiful district with very cozy restaurants. The hotel has modern looks, great breakfast, and the staff are nice and friendly. I stayed in room 342, which is in the third floor, and has two twin beds. The room was OK, but I do have to say that each bed was extremely small!!!! 68 cm wide (which is very small) I actually asked the staff if this was normal, and they said that in Amsterdam hotels it is normal. Apart from this, I would recommend the hotel, but I would make sure, before making the reservation that they book you a room with normal sized beds. Oh, also, the room rate doesn't include breakfast (which was 7 euros, more or less)", "Date": "March 6, 2008"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "Paris", "Title": "“Just excellent”", "Author": "SandrineParis", "ReviewID": "UR13879415", "Content": "My husband and I stayed 3 nights at Cheap and Basic and I recommend it without any kind of doubts. It's just excellent. The staff was extremely friendly. Breafkast was really good and the location is great. The room was clean, completely new and modern. You don't believe that 's just a 2 stars hotel!!!", "Date": "February 27, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Ireland", "Title": "“Fab Hotel, will be back again”", "Author": "bagel75", "ReviewID": "UR13062390", "Content": "Just back from a weekend in Amsterdam staying at Chic & Basic with family group. I knew from talking with staff before we arrived that we'd be looked after and we were. It was a special surprise trip for our mother and they looked after her so well giving her the best room in the hotel overlooking the canal. Our rooms were less Chic and more Basic then hers, but perfect for our short stay. Location was perfect, just short walk from central station, cafes and main attractions. Staff booked fabulous restaurant for us and arranged taxi's etc, and couldn't have been more helpful. Breakfast was surprisingly nice and better than most continental B+B offerings. Canâ€™t wait to go back for longer next time and will be staying in Chic & Basic again.", "Date": "January 28, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "4", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Durham, United Kingdom", "Title": "“Chic but not too Basic”", "Author": "Gutterheart", "ReviewID": "UR13041898", "Content": "What a fab little hotel! About 5 - 10 mins walk from Centraal station /RLD/ all the noise and action, yet it's sooo quiet and peaceful. Staff absolutely superb - meet and greet with a coffee (much appreciated as it was snowing when we arrived!); excellent english and a fund of useful info. The rooms are small but perfectly designed. Bathroom is a wetroom with separate wc. The rooms on their website are the ones you actually get (not some super upgraded version like on some websites) with the lightbox headboard and everything. Everything is ultra ,modern and well designed, and the proprietors are rightly proud of the place. One really nice touch is the availability of fresh coffee/tea/hot choc at any hour in the lobby lounge area - another thing that adds to the very civilized feel of the place. There's free net access in the lobby as well if you feel the need to browse with your coffee. Can't praise this lovely little hotel enough - more that excellent value for money - we'll be back!", "Date": "January 27, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "nottingham", "Title": "“fantastic value for money”", "Author": "silversurfer52", "ReviewID": "UR12402232", "Content": "very good value for money. great location, great service, great room, great breakfast wish there was one of these hotels in every city", "Date": "January 7, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Chiccag", "Title": "“Loved the Modern Feel”", "Author": "EuropeTraveller2007", "ReviewID": "UR11079173", "Content": "We just returned from our week long trip in Europe. We booked a triple for 3 nights (Nov 20-22). The hotel is only a 10 minute walk from the Centraal Station. It took us longer because we missed a canal. But it is very, very walkable with wheeled luggage. I was impressed when we walked through the front door. The lobby and lounge is very cool. It has a modern minimal look, but is very comfortable. The staff was very nice. They had us sit down, got us coffee and or tea, while they did the check-in proceedure. They showed us the room. This might be the only small issue I had with the hotel. They did not have an elevator, but I think this is very common in Amsterdam. To get to the room we had to go up a very steep winding staircase. It was not really that bad. My 75 yr old father with knee problems was able to do it, but it was a little bit of a challenge, and if you travel with anyone that has limited ability here will be an issue. The room was very cool. Again minimal and modern but clean and looks like it could be in a design magazine. Breakfast was provided in the morning, and was pretty good, coffee/tee machine, cereal, meats, cheeses, hard boiled eggs, croissants. Overall more than you would expect from a continental breakfast. Hotel location is pretty good, it is no more than a 15 minute walk to just about any tourist attraction you would want to go to. Staff was very helpful with directions and recommendations on where to go. The hotel was perfect and we had a great time.", "Date": "November 26, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "3", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Heredia, Costa rica", "Title": "“Loved the place”", "Author": "gojaincr", "ReviewID": "UR10803128", "Content": "A friend, my partner and I were in Amsterdam for five nights. We booked both a single and a double-bedded room. My bias is to stay in small properties (less than 30 rooms) and Chic and Basic was more than a pleasant surprise. This is my third trip to Amsterdam and I have stayed in the Grand Tulip (200+) and in a canal house on previous trips. One of the gems of the hotel is its staff - more about that later. With the exception of housekeeping, everyone was fluent in English - my native language and some were fluent in spanish - the native language of my partner and my friend. Housekeeping had a perfectly good understanding of english - significantly better than my non-existent dutch! First the location. C&B is conveniently positioned facing the second canal - Herengracht - within a short walk to Cental Station and the major tram/bus routes in the city. The character of the neighborhood in which C&B is located is very quiet residential yet within two blocks are an excellent restaurant (just across the pedestrian bridge on Broeweurgraht (sp)) and a neighborhood coffee shop. Two more blocks and there is a secondary shopping area with an abundance of restaurants/retail locations (but not the cookie cutter stores seen in most major cities that cater primarily to tourists). And the location of the hotel is within a ten to twenty minute walk to any of the active night life, restuarants, museums and typical shopping fare. As indicated in other posts, the rooms are smallish. If you plan on staying in your room most of your stay in Amsterdam, then this is not the property for you. Neither of the two rooms we booked had an area separate from the bed for writing or reading - less of a problem when traveling alone but problematic if traveling with another person and on different sleep schedules. The ability to read in bed is futher limited by an absence of reading lights - the room is either fully lit or dark with no in between possibilities. A common area is available for guests to take advantage of flat writing spaces as well as providing complimentary wifi if you have your own computer. Adjacent to the common area is a computer with high-speed and complimentary internet connectivity. The rooms and bathrooms were spotlessly clean - kudos to the housekeeping team. And each of our rooms had excellent hot water heat, plenty of water pressure and large windows that opened easily. The windows included both sheer curtains for filtered light and a curtain to darken the room considerably when sleeping during the occassional afternoon nap. The only \"weathered\" look in the hotel was the carpet leading to the rooms. It appears the carpet has remnants of last winter's snow and boot traffic. The carpet appears to be in good shape but not as clean as it could be and certainly not as spotless as are the rooms. And while speaking of stairs - they are typically Amsterdam - a cross between stairs and a vertical ladder. The self-serve breakfast offers an ample selection of fresh fruits, cheese, juices, hard boiled eggs, cold cuts, etc. The bread an role variety was exceptional and an apple tart can only be described as \"european\" - excellent flavor, texture and not ruined with sugary sweetness. But for the three of us, the most important element of our stay was the staff in the hotel. They were extraordinarily helpful and friendly - it was as if we were staying with friends and not interacting with the typical stadoffish clerks in larger hotels. Indeed, one evening we were invited to go \"local\" with a member of the staff. We in turn have invited their staff to visit with us whenever they come to Costa Rica. If going to Amsterdam again, this would be my first choice.", "Date": "November 13, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Seattle, Washington", "Title": "“Great hotel!!”", "Author": "IUBBFAN", "ReviewID": "UR10483741", "Content": "We stayed here in September for 2 nights and just loved the hotel. The staff could not be faulted, they were friendly and helpful with every request. The location was great too, just a short walk from Central station in a very nice part of Amsterdam towards the Jordaan area. We had a Calal view room on the first floor and it was just what we expected from a Amsterdam hotel. It wasn't too small, and had enough room for our luggage and still be able to move around! I would definitely stay here again when I return to Amsterdam.", "Date": "October 31, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Auburn, NY", "Title": "“Very pleased....”", "Author": "Chippy78", "ReviewID": "UR10426332", "Content": "My boyfriend & I booked Hotel New Amsterdam online a couple months before our planned stay of August 26-29, 2007. When we arrived on what we thought was the street where our hotel was located after approx. a 10 min. walk from the train station, we walked by Chic and Basic, wondering if that was our hotel. Well luckily one of the employees saw us walking back & forth looking confused & came out to see if we were looking for Hotel New Amsterdam. He then told us it had changed ownership & had a new name. At first walking in there I was slightly disappointed, I had loved how quaint & unique it had looked before when we reserved it. We had the mini-suite on the top floor and I must say in the end I was not disappointed. The rooms had all been re-done. Our room was very clean, smelled of fresh paint, sparseley finished but had everything we needed. The bed was sooo comfortable. The stairs as you keep reading in these reviews were a killer! We had 3 very steep flights to our door, then once we unlocked our door had another flight actually into our room. Climbing them was almost like climbing a ladder!! The view out our window was fantastic. Breakfast was simple but sufficient & the staff was happy to hold our bags on the day we checked out as our flight did not leave till 10pm that nite. The location was perfect, close to everything but far enough away to be nice & quiet in a nice residential neighborhood. So although this was not the hotel we expected when arriving in Amsterdam, it did not disappoint at all. The only thing I can say I did not like was the tacky red lips shaped seat outside in front of hotel. I avoided having that in my pictures b/c it looked so cheap. But that really didn't deter from the wonderful time had here. Would DEFINITELY recommend this hotel!!", "Date": "October 29, 2007"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "Sao Paulo, SP", "Title": "“Splendid”", "Author": "Freddy532", "ReviewID": "UR10342075", "Content": "Chic and Basic was very charming, in an excellent location and on a quiet beautiful road, with a B&B feel but with the amenities of a boutique hotel (relaxing lounge music, Wi Fi, great cappucino machine, etc.), and above all, fantastic service by their reception / managers. Knowledgeable and attentive professionals like Ferdy make Chic and Basic a great option for different categories travelers to Amsterdam.", "Date": "October 26, 2007"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Check in / front desk": "3", "Overall": "4.0", "Value": "5", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Devon", "Title": "“Would stay again”", "Author": "burroontour", "ReviewID": "UR10174514", "Content": "Just got back from Amsterdam after a 4 night stay, staying with friends for 3 nights at The Flying Pig Hostel Downtown and then staying for one night with my boyfriend at Chic and Basic for a little bit of a treat before heading home. Chic and Basic is probably a good way of summing up the experience. The only information we were given on check in was the time of breakfast and that we could use the internet for free. I'd read about the free coffee machine but was not introduced, I'm also not sure what happens if you want an alcoholic drink (though I saw some spirits at breakfast behind the counter!). There was also a sauna but again no idea if you were allowed to use it or how you would go about it! Saying that the hotel is modern and clean, room fine (proper double bed, not 2 singles as is often the way). We were in room 111 on the first floor, canal view, stairs ok, I've seen much steeper!. Small room, small bathroom but good shower. Tea and coffee facilities and TV. Main positive was the breakfast which is the best I have had in Amsterdam. Having stayed at about 5 hotels in Amsterdam I would say this has many positives going for it for a small hotel in a traditional Amsterdam building. Good location near central station but near enough away from the Red Light district for my liking. Good bars and restaurants nearby. On a quiet canal which is lovely for walking along, very romantic! A good value hotel, I'd be interested in staying in a larger room though if I returned, especially if for more than a night or two.", "Date": "October 20, 2007"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "4.0", "Value": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "San Francisco Bay Area", "Title": "“Chic....and basic it is.”", "Author": "WorldTraveler1945", "ReviewID": "UR10062939", "Content": "Basic it is. No elevator, no reading lights, no closets, no shower curtin, limited tv channels, steep stairs (not recommended for people with disabilities. And, not sure you could put two people in a room comfortably. That said. Great location & staff. Good competitive rate. Decent breakfast. Internet terminal for guests and all the coffee you want. Recommend highly if you are an independent traveler looking for a great Amsterdam experience!", "Date": "October 10, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "4", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Chicago, Illinois", "Title": "“Love this hotel!”", "Author": "ChrisChicago38", "ReviewID": "UR10056063", "Content": "Four of us stayed here. The staff was extremely friendly and helpful. The hotel is clean and stylish. Very gay friendly and close to everything...bars, shopping, canal cruises, Red Light District. Would definitely stay here again.", "Date": "October 8, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Melbourne", "Title": "“Stylish, convenience, helpful staff - what a great place!”", "Author": "PoosieMelbourne", "ReviewID": "UR8875284", "Content": "If you're after a unique hotel which differs from the mainstream then book this place! Our room was everything we hoped for - it was on the top floor overlooking a canal and encompassed really smart design. The welcome bag was a great touch - great tolitetries! The breakfast was brilliant and included in the price - lots of choice. The free internet access was a welcome bonus as well. The location is really handy - it's in Jordaan, a really cool part of Amsterdam which was close to the centre but not in the middle of it, and was about a 5-10 minute walk from the train station. One word of caution - the stairs to our room were really narrow (not unusual for Amsterdam) and it was hard to carry heavy suitcases up the stairs. The staff were more than happy to help out but ask for a room on a lower floor if you're mobility-impaired.", "Date": "September 24, 2007"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Atascadero, California", "Title": "“Treated great at Chic and Basic.”", "Author": "TravelingFamily003", "ReviewID": "UR8824512", "Content": "We booked this hotel when it was called Hotel New Amsterdam. When we arrived it was called Chic and Basic. My husband and I and our two daughters had to have two rooms to accommodate us. The rooms were pretty small, as were the bathrooms. Both rooms were up quite a few stairs. The views out the rooms were of the canal, so that was very nice. The location was great, especially with it's easy walk to the train station. The staff in the hotel was absolutely wonderful to us, especially when they carried out suitcases all the way up the stairs. Great espresso machine. Overall, just really nice experience, mostly because of the great staff. We did not like Amsterdam very much, but we liked Chic and Basic.", "Date": "September 20, 2007"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Business service (e.g., internet access)": "4", "Check in / front desk": "4", "Overall": "5.0", "Value": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "CA", "Title": "“Perfect Stay in Amsterdam”", "Author": "KBrooner", "ReviewID": "UR8726612", "Content": "We were so happy we chose Hotel New Amsterdam (now Chic + Basic) for our 3 night stay in Amsterdam. The hotel is a 10 minute walk from Central Station and is located canal side on one of the most beautiful canals. We decided to pay a little extra for the canal view room and it was worth it!!! We left our windows open the whole time and enjoyed the sounds of Amsterdam. Our double room was great, a little small, but enough room for everything. The bathroom was clean and nice too! The stairs are a climb, but part of the fun. Every morning we ate breakfast at the hotel (included) it was really nice. Bread, rolls, cereal, fruit, cheese, meat, yogurt, juice, coffee and water. We loved the 24-7 coffee machine to make espresso or cappucinos, the water jug and computer to use. The staff was very helpful with all of our questions. We would stay here again!", "Date": "September 16, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "victoria", "Title": "“loved this newly named hotel”", "Author": "VictoriaTravellover", "ReviewID": "UR8504087", "Content": "We booked two nights in the Hotel New Amsterdam and arrived to find it has a new name - Chic and Basic - part of a small European hotel chain. The lounge/breakfast room was very chic and modern with real espresso and lattes available to guests any time of day. The staff was immensely helpful and friendly and the breakfasts fresh and tasty. We had a lovely large room overlooking the canal with a good sized ensuite bathroom and comfy beds. The only disadvantage of this lovely hotel is that there is no elevator and 36 steep steps to our room. However, the desk clerks carried our luggage up and down and housed it in a secure room on our last day as we went sightseeing before our flight left for Canada. One of the desk clerks invited us for a private tour of the canals on his motor boat. We settled on 60 Euros for an hours trip but we had such a wonderful time travelling around the city and getting to know our guide while enjoying the wine and picnic dinner he brought along that the journey ended up being three hours. We suggested to him that he could offer tours to other tourists - we were his first clients. Don't let the many stairs deter you from staying at Chic and Basic. It's a super hotel on a very quiet canal just a 5 minute walk from the Central Train Station.", "Date": "August 25, 2007"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Business service (e.g., internet access)": "4", "Check in / front desk": "5", "Overall": "4.0", "Value": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Boston, Massachusetts", "Title": "“One of my favorite hotels, hope that doesn't change...”", "Author": "sirtravel", "ReviewID": "UR8228348", "Content": "This has been one of those \"finds\". I have stayed here about four times in the last two years and I have always enjoyed my stay. While the rooms are on the small side (even by European standards), they are comfortable. The location cannot be beat -- sitting at the intersection of the Herengracht and Brouwersgracht it is one of the prettiest parts of the canal rings. And it is literally less than 10 minutes walk to the Central Station. But on my last visit I see that the hotel management has changed hands and it is now part of a Spanish chain called \"Chic + Basic\". The hotel was in a flux period as they are renovating some of the rooms, but the staff remains the same and they are very good and friendly! Let me tell you my what I see as the potential upside/downside of this management change. First the style is changing from quaint contemporary Dutch to modern and austere. Immediate upsides -- they seem to be renovating many of the rooms and while they were OK they are starting to show their age; free computer access in the lobby with wifi in the rooms. My concern is that you will see the prices start to rise, but some small increase might be expected. Finally, the continued saving grace is the location and the staff. The staff remain the hotel's single most valuable asset. I hope that doesn't change.", "Date": "July 24, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Chicago, Illinois", "Title": "“Great stay at Hotel New Amsterdam”", "Author": "TX_Longhorn99", "ReviewID": "UR7970875", "Content": "My best friend and I selected this hotel based on other Tripadvisor reviews and were definitely not disappointed! It is in a very central area of town within walking distance of everything (some are longer walks than others!) - Niewmarkt, Red Light District, shopping areas, Van Gough Museum, Ryksmuseum, a couple of blocks away from the Anne Frank House, and close to many coffee shops and restaurants. Better yet, we took the train in from Schipol to Centraal Station (about 4 Euros), and the hotel was about a 10 minute walk from Centraal (handy b/c we had to lug a ton of luggage). The staff was super friendly and very helpful. As other people mentioned, they will hold your luggage for you in a locked room if you arrive early. We stayed in room 121 (a canalside double, on the 3rd floor, I think), which we had to walk up some narrow & steep flights of stairs. This was not a problem, as the staff carried our luggage up the stairs for us. The room was very nice and clean and was an excellent value for Amsterdam. As in most of Europe, there is no central air conditioning, but the temperature was very mild during our stay and did not cause any problems. There is a hairdryer in the bathroom, but be sure to bring your own soap & shampoo (they provide shower gel). There is free coffee 24 hrs a day (from a fancy coffee machine), free high-speed internet access in the lobby, and complimentary breakfast, which consisted of pastries, toast, fruit, hard-boiled eggs, cereal, several types of juice, milk, and coffee. Very tasty! We had a very nice experience here, and would recommend to anyone!", "Date": "June 23, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Business service (e.g., internet access)": "4", "Check in / front desk": "5", "Overall": "4.0", "Value": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "", "Title": "“Great location and staff”", "Author": "Jakedoc", "ReviewID": "UR7684245", "Content": "Stayed post cruise and enjoyed our stay. We arrived at approximately 10 AM and staff stored our luggage until our room was ready. Short 10 minute walk from Centrael station and located on a canal. Centrally located for a lot of sites. We were given an option for a smaller room with quite a large discount and took it. Small room on third floor, but good beds and we used room for just sleeping anyway. Staff carried luggage up for us. Had good nite sleep. Good Breakfast. While walking to Centrael station after check-out, a staff member getting off work offered to help with our luggage to the station since he was going that way. Nice gesture. Would definitely stay there again. Only problem I can forsee is someone with disabilities with the small stairs.", "Date": "May 23, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Business service (e.g., internet access)": "3", "Check in / front desk": "5", "Overall": "4.0", "Value": "4", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Sydney, Australia", "Title": "“Nice Hotel, but small things to work on.....”", "Author": "Blueram", "ReviewID": "UR7565621", "Content": "Nice tidy hotel, great location, breakfast, coffee machine and friendly staff. The only conâ€™s were room was small and walls are thin. The room (photos in the below reports with the monkeyâ€™s on the wall) we had included a large sky light window which allowed all the other guests in the higher floors a direct view of or room and partially of the bed. Even though there was a curtain that we could use to shield the bed you would have thought that management would at least frost the window and still have the benefits of the additional light from the skylight. I guess that is Amsterdam for you â€“ there is a view in every window ï�Š ï�Š", "Date": "May 8, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "3", "Check in / front desk": "5", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Hershey Pa", "Title": "“Super service”", "Author": "cdeast", "ReviewID": "UR6803274", "Content": "The staff was friendly and went out of their way to make our stay enjoyable. Great restaurant suggestions. Carried luggage to and from room because of steep narrow stairs. Looked up helpful information on computer. Very knowledgeable about their city. Comfortable room overlooking a canal. SMALL bathroom. Good breakfast including hard boiled eggs, fruit ,cereal, meats and cheeses, rolls, and fresh sqeezed orange juice. On a quiet street, which is only a ten minute walk from the central train station . Starting the week of Feb. 19th, and continuing for about 6 weeks, they will undergoing renovations.", "Date": "February 16, 2007"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Montreal, QC, Canada", "Title": "“Fantastic time!”", "Author": "neuronx", "ReviewID": "UR6750742", "Content": "We stayed at this hotel in early May and had an incredible time. The staff are extremely nice, and are always trying to please! The breakfasts were way above average (best we had in our whole Europe trip) and the rooms are lovely. We had a room with balcony on the 3rd or 4th floor which was superb. Great place to eat strawberries and cream! And the free drinks all day long.... yumm....", "Date": "February 6, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Riverside, CA", "Title": "“We loved it!”", "Author": "RickSEuroTraveller", "ReviewID": "UR6719660", "Content": "My husband and I loved this boutique\"ish\" hotel. We travelled for 5 weeks after leaving this hotel and this hotel remained in our thoughts throughout the whole trip. I loved the all you could drink espresso drinks in the lobby and the fresh circulated water. The hotel staff are SUPER friendly. We stayed in the \"parrot room\" - which happens to be the biggest room. This room had a lovely patio for us take in the fresh air. The bathroom is very small, but we dont spend a lot of time in there anyway! The bed was comfortable! Thank you New Amsterdam for a great stay!", "Date": "January 31, 2007"}, {"Ratings": {"Service": "2", "Cleanliness": "2", "Business service (e.g., internet access)": "2", "Check in / front desk": "4", "Overall": "3.0", "Value": "2", "Rooms": "2", "Location": "4"}, "AuthorLocation": "queensland", "Title": "“Clean and good location but aimed at gay community.”", "Author": "dingoQueensland", "ReviewID": "UR6595196", "Content": "The staff were friendly and helpful. The room was comfortable but small. We believe they cater for a gay market, whilst this does not bother us at all, we did find the explicit gay pornography left in the common areas offensive and gave the hotel a seedy element. We would feel the same way about heterosexual material being availabe in the same way. Would not stay there again based on this.", "Date": "January 14, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "4", "Check in / front desk": "5", "Overall": "4.0", "Value": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Durham, UK", "Title": "“Very Good Hotel”", "Author": "Malts", "ReviewID": "UR6440576", "Content": "Arrived at the hotel very wet as it was peeing down and did for most of our vacation but that didnt put us off!! We arrived very early at the hotel as our flight landed at 8.30am and they couldnt do enough to accommodate us with warm drinks and a comfy seat! Our rooms were almost ready so we hung around and were unpacked and back out to hit Amsterdam by 11am! The rooms are small but adequate and our friends managed to get the attic suite with a bedroom and seating area. The stairs are very steep and narrow and by the end of 4 days our legs were aching but you have to do it!!! There are no lifts in these old buildings. We didnt find noise an issue from our 3rd floor room - the only noise we could hear was the rain! The breakfasts were good. Freshly squeezed orange juice, cereals, eggs, cheese, ham, fruit and various freshly baked breads and rolls. The coffee is also really good and service very attentive. In fact all the staff are excellent and so friendly. Nothing was a problem and they went out of their way to speak to you on your way in and out of the hotel. The location of the hotel is also very good. About 5 minutes to Dam Square and the train station and 20 mins to the Southern Belt. We found the whole experience really good and would return to the hotel and recommend to others. Another good point, they have loads of umberellas which were needed during our stay!", "Date": "December 14, 2006"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "Southampton", "Title": "“New Amsterdam Hotel”", "Author": "MET-BAR-MUSO", "ReviewID": "UR6348250", "Content": "We have just come back from the New Amsterdam Hotel. It was our second stay there in 18 months. Superb very helpful staff. Nice modern, recently refurbished hotel. Excellent breakfast, excellent coffee, and the room was perfect. We have stayed in many hotels over the years and this ranked among the highest quality we have experienced. The room faced the canal and was a good size with a good sized bathroom. It was all nicely modern with an oldie worldie feel. We have stayed in room 321 both times and I understand that there are some sub-standard rooms in the hotel so if its free 321 should be your first choice. The Location is perfect too, nice quiet canal walks and, within 2 minutes there is a fine \"coffee shop\" and a further 2 minutes, all the shops. Harlemer street is very close by too with lots of nick-knack shops and supermarkets and excellent restaurants. Hotels in the dam can be a bit hit and miss but room 321 in the Hotel New Amsterdam is a hit every time.", "Date": "December 8, 2006"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Tulsa, OK", "Title": "“Absolutely the best hotel in Amsterdam!”", "Author": "chihuahua_star", "ReviewID": "UR6307987", "Content": "I don't see how anyone could have any complaints about this fabulous hotel! Sure, the rooms are small, but this is Europe, and we did pay only 100 euro/night! Good things: -SUPER nice staff. Always helped with every need, even carried my very heavy suitcase up the narrow stairs for me =) -GREAT breakfast. Fresh squeezed juice, eggs, meats, cheeses, ect. -Free coffee anytime, from an awesome machine that could make anything from a macchiato to espresso. -Extremely clean rooms and bathroom. -Terrace to go out and sit at night with a glass of wine or a coffee. -Perfect location. Quiet residental street, but only a 1-5 minute walk to the more bustling areas. I could go on and on about this hotel. I have traveled through Europe since I was quite small, and this is the 1st hotel that I know for a fact that I will return to. I will never stay anywhere else in Amsterdam. Some tips: -Eat at the resteraunt right accross the little pedestrian bridge by the hotel. It is fantastic, quiet, and reasonably priced with great food. -Visit Albert Hejin supermarket, they have great little snacks. -Anne Frank house and Van Gogh museum are must-sees. This hotel is only 2 streets over from the Anne Franks house (and visit on a weekday - we had no wait!). We had a great time and can't wait to go back. We loved this hotel so much that we are sending them a Christmas card. Please stay here, you will not be disappointed.", "Date": "November 30, 2006"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Check in / front desk": "4", "Overall": "4.0", "Value": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Chipstead", "Title": "“Great canal view”", "Author": "CR5", "ReviewID": "UR6136862", "Content": "Booked for a canal view back in July but given some reviews were a little apprehensive that we would get one. Did we? Oh yes. We had the top floor in the attic area like a suite. Odd layout with separate toilet in one room and shower in another room. But 2 TV's (where else do you get 2- one for each room?) although not many channels Doors opened to reveal a view of the canal. Superb view and location and tea/coffee maker. Chuck in the tea and coffee on tap downstairs and its was a great hotel. Breakfast was OK although very basic. OK, some of the fixtures and fittings are a little dated but the quirkiness is its charm and to be honest I have been on six trips this year and I felt at home here. Try and get the canal view and if you can get the top floor suite (cost me Â£250Euros for 2 nights) then it is well worth it. Location is superb, less than the 10 mins walk from station as it says on website. More like 5/6 mins. Easy walk to the red light district and main sights.", "Date": "November 16, 2006"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Check in / front desk": "4", "Overall": "3.0", "Value": "3", "Rooms": "2", "Location": "4"}, "AuthorLocation": "Jersey City, NJ", "Title": "“Decent but not fantastic”", "Author": "Traveling_Woozles", "ReviewID": "UR5968930", "Content": "Hotel New Amsterdam is a decent place to stay. It has a really nice location, right on a canal and is near to most activities. Good restaurants and coffee shops near by. The rooms are small but clean. I actually enjoyed the narrow staircases and the opportunity to see and live inside one of the beautiful historic buildings in Amsterdam. I will say that the bathroom is interesting with one room for the shower and sink and a separate, very small room for the toilet. We booked through the tourist office. (3 euro pp to book) and the rate was 100 euro a night. It did include breakfast but it was nothing impressive. All in all I enjoyed the hotel, the staff was friendly and the location was good. I would recommend them for a stay but would be a better deal at 70 to 80 euro a night.", "Date": "October 18, 2006"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "4", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "austin, texas", "Title": "“highly recommended”", "Author": "jrmintz", "ReviewID": "UR5823630", "Content": "I stayed here for 4 nights in August and have lovely memories. The room was comfortable, modern, clean and quiet. The staff was very friendly, helpful and made me totally feel at home as a solo female traveller. It was a delight to see a smiling face at breakfast and when coming to and from the hotel!", "Date": "September 21, 2006"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Israel", "Title": "“Fabulous Hotel!”", "Author": "ly_ly38", "ReviewID": "UR5811977", "Content": "My friend and I chose the Hotel New Amsterdam after extensive online research, and after cancelling a reservation at another hotel after reading too many negative reviews. We loved the Hotel New Amsterdam! The location was excellent - centrally located between the Center and the Jordaan neighborhoods and we walked all over the city from there. Despite the location, the neighborhood itself was very quiet, which was something we'd really wanted. The staff was excellent. Everyone was extremely helpful and very friendly, and they really helped to make our stay absolutely perfect. When we arrived at the hotel after a sleepless night of traveling, they carried our suitcases up to our room for us after bringing us each the coffee of our choice. I'd also emailed them several days before to let them know we'd be arriving early and to ask if it would be possible to check in straight away, and they made sure that we were able to do so. The hotel was clean and quiet, and the room was perfect (though admittedly, the shower pressure wasn't great). The guys always had excellent touring and restaurant suggestions as well, and really seemed to enjoy interacting with the guests. I can't emphasize how wonderful this hotel was.", "Date": "September 18, 2006"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "3"}, "AuthorLocation": "los angeles", "Title": "“appreciated the extra help in our time of need”", "Author": "mahatma", "ReviewID": "UR5779338", "Content": "i have been to amsterdam twice previously and know my way around the city center. i was taken to the hotel by my partner for my birthday. we arrived at a lovely old canal house in an area of old houses, some made into hotels, some as professional business locations. it is a 5 minute walk from the central station. i would recommend a location a little closer to the museum areas so that you don't have to use the trams as much. this hotel has a nice continental breakfast with a machine that dispenses fresh orange juice. another machine makes espresso/cappucino by pressing buttons. most excellent as it is available 24 hours. the first room we had was up 2 flights with narrow steep stairs. not for the vertically challenged. the room was small but very comfortable. two twin beds put together created a lot of bed space that was appreciated. excellent shower. on our second day in amsterdam i was accidentally tripped and tore a calf muscle. the hospital put it is a cast and i was to be immobile for the next week. we only had two days remaining in amsterdam. the staff moved us to the ground floor and took every effort to make the remaining portion of our stay as comfortable as possible, including helping me go up and down the few steps to our room. all members of the staff receive the highest marks. they went so far as to allow us to stay in the second room for a longer period of time (as our trip was to extend following the time in holland) if we could not arrrange an earlier flight. when we arranged the earlier flight they released us from any further room obligation.", "Date": "September 8, 2006"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Check in / front desk": "5", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Brighton,England", "Title": "“Superb hotel-great service”", "Author": "rickythegoat", "ReviewID": "UR5711537", "Content": "Returned yesterday from a 2 night stay at the Hotel New Amsterdam with my wife and 11 year old son and have to say what a joy it was,from the initial welcoming cup of tea to the final goodbye it was a superb experience. The hotel is very centrally located just a 10 minute walk from the Central Station and next to a charming canal and although the rooms are on the small side(we had the mini-suite in the loft which had a tricky low ceiling! and generally traditional Amsterdam hotels are on the small side) they are beautifully decorated and very cosy with high quality furnishings.Just look out for the steep stairs if you have large suitcases it can be hard work! The breakfast was typically continental with cold meats,cereals and a lovely selection of bread ,fresh juice and good coffee etc.served in a smart little dining room with a tv showing BBC news. What set this place apart for me was the service from all the staff who went out of their way to help and make us feel special-we have used many hotels in the US and Europe and can honestly say this hotel is right at the top when it comes to service,nothing was too much trouble. Would not hesitate in returning to this hotel.", "Date": "August 26, 2006"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "3", "Check in / front desk": "5", "Overall": "4.0", "Value": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "san jose ca", "Title": "“great place”", "Author": "cruisesetc1", "ReviewID": "UR5699172", "Content": "We loved this hotel. It's kind of funky because it's a couple of canal houses put together but the staff couldn't have been nicer. We went with my two kids and their friends so we had 3 rooms. My husband and I had the canal view which I loved and the kids had interior views that were basic walls. These all would have been great in normal circumstances but we were there in a heat wave so got a little toasty in the rooms but not their fault. A couple of fans might have helped but no one was prepared for the 96 degree weather. The location was fantastic, you could walk to the train station and all the main spots and you could catch the canal boats at the train station and get a day pass which gets you all over by boat. We had a car so they have a lot you can park at for a fee of I think about 20.00 per day. I would gladly recommend this hotel and would go back again.", "Date": "August 22, 2006"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Check in / front desk": "5", "Overall": "4.0", "Value": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "sangio2006", "Title": "“Very good experience here”", "Author": "sangio2006", "ReviewID": "UR5616869", "Content": "We stayed at the New Amsterdam for 4 nights this past April. The staff were very friendly and helpful. Breakfast was quite good. Absolutely great location at the corner of the Herengracht and Brouwersgracht canals. Easy walking distance to everything, but very quiet. We had the room on the first floor (second floor to the North Americans) facing the canal. It has a fantastic view, but we couldn't enjoy it much because the room is too small to sit and lounge. It's barely larger than the bed. But, it was clean and the bed was comfortable. And we spent most of our time away from the hotel in any event. We would stay there again, but I think I'd ask for a larger room.", "Date": "August 16, 2006"}], "HotelInfo": {"Name": "Chic & Basic Amsterdam", "HotelURL": "/ShowUserReviews-g188590-d238569-Reviews-Chic_Basic_Amsterdam-Amsterdam_Noord_Holland.html", "Price": "$128 - $193*", "Address": "<address class=\"addressReset\"><span rel=\"v:address\"><span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">Herengracht 13-19</span>, <span class=\"locality\"><span property=\"v:locality\">Amsterdam</span> <span property=\"v:postal-code\">1015 BA</span></span>, <span class=\"country-name\" property=\"v:country-name\">The Netherlands</span> (Formerly &quot;Hotel New Amsterdam&quot;)</span></span></address>", "HotelID": "238569", "ImgURL": "http://media-cdn.tripadvisor.com/media/photo-s/02/47/4f/e4/renovated-lage-double.jpg"}}