{"Reviews": [{"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Bern, Switzerland", "Title": "“Tiny bathrooms, otherwise very nice”", "Author": "nubuk", "ReviewID": "UR128432084", "Content": "The hotel is well located and just a few meters away from the water bus station and some hundred meters from the beach. It is in a calm and peaceful area of venice (Lido Island). Rooms were perfectly clean and staff was extraordinary friendly. However, if you are taller than an average italian you'll find yourself quite uncomfortable trying to squeeze in and sit straight on the toilet... an alternative is the bathroom close to the lobby. Be advised that if you stay more than one day in venice you'll want to take a multi-day water bus pass which already pays off by getting to Lido (where the hotel is located) and going back. Water taxis are much more expensive and not extremely faster. You can get a water bus that directly brings you to the airport (rate from lido: 15â‚¬) or you can take the bus (rate 5â‚¬) leaving and going to p.roma. If you have a water taxi multi-trip ticket its is cheaper (10â‚¬) to go by bus - you however will lose around 15-20mins.", "Date": "April 23, 2012"}, {"Ratings": {"Overall": "1.0", "Service": "1"}, "AuthorLocation": "London, United Kingdom", "Title": "“Rude and shocking customer service...”", "Author": "J B", "ReviewID": "UR122314340", "Content": "Receptionist slammed the phone down on me and refused to provide any information about the hotel...I decided to book this hotel. Before going ahead with the booking, I called the hotel directly to find out about transport links between the airport and the hotel. The hotel receptionist was extremely rude and advised me that he was not an information desk and he was unwilling to provide me with any information not only about the transport but also about the hotel itself, referring me to their website instead. Before I managed to respond, his last words were \"goodbye\" before he hung up on me. Just shows you how much they care about their potential guests. I will definitely not be paying them to treat me that way. Pathetic!", "Date": "December 31, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "sheffield", "Title": "“Quaint hotel”", "Author": "cazSheffield", "ReviewID": "UR120399418", "Content": "Perfect location, only a few hundred yards from the water bus station and visible from the station so you can save a fortune in taxi fares. The hotel is clean and comfortable. Although the furnishings are mainly old this gives the hotel character. The staff were all helpful and gave advice re; places to see, directions etc This is a good budget choice. However, we skipped breakfast as it was over priced even for Venice Would definately stay again", "Date": "November 9, 2011"}, {"Ratings": {"Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Delray Beach, Florida", "Title": "“GREAT LOCATION / GREAT SERVICE!”", "Author": "David M", "ReviewID": "UR119973515", "Content": "We stayed at Hotel Helvetia for just one night before boarding a cruise ship. It was an easy Valporetto (boat taxi) ride from the Marco Polo airport. The water taxi stop on Lido Island is just a 2-3 minute walk to the hotel. The hotel was so easy to get to. It sure beats dragging your luggage through the small streets and over the bridges in Venice! The hotel is located right on the main strip where all the restaurants and bars are located. Lido island is beautiful and peaceful. It is a nice alternative to overcrowded Venice. A quick 10 minute boat ride puts you in the heart of Venice. The room was clean and the bathroom was large compared to other places that we stayed. The best part of our stay was the hospitality. All the staff members were friendly and helpful. We had a luggage bag full of gifts (including wine and olive oil) that we could not take on the cruise with us. When we found out that the luggage storage at the train station would not hold the bag for a week while we were away, the hotel staff graciously told us that we could leave it in the front office and pick it up when we returned from our cruise. When we returned, the bag was waiting for us. They went over and above to help us out and I really appreciated that. I plan on returning to Venice someday and will definitely stay at Hotel Helvetia again!", "Date": "October 31, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Maastricht, The Netherlands", "Title": "“Great Option in Lido”", "Author": "Fernando84", "ReviewID": "UR119812633", "Content": "Quaint hotel in central Lido, really close to vaporetto terminal. Rooms were clean and comfortable! The area is also nice, with lots of restaurants around.", "Date": "October 27, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "New Jersey", "Title": "“Hotel Helvetia, Lido Italy-Fantastic!”", "Author": "Chavelle", "ReviewID": "UR119642823", "Content": "We stayed for 3 nights at the Hotel Helvetia on Lido Island in Venice, Italy. Staff was wonderful! Very clean, great breakfast service. No problem to leave our bags for a few hours after we checked out. Felt safe and secure at this location. Extremely easy access to the vaporetto stop and nearby restaurants.", "Date": "October 23, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "3.0", "Value": "4", "Sleep Quality": "3", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Yorkshire", "Title": "“Convenient, clean and comfortable but expect to pay extra for eggs and yogurt”", "Author": "YorkshireRosie", "ReviewID": "UR119622547", "Content": "The hotel is well positioned only yards from the boat stop which goes to Venice from the Lido. We booked 'deposit not refundable' and got what must have been the smallest room in the hotel. It would have been better if we had had a whole room instead of what appeared to be half. The double bed was pushed up to the wall, so I had to climb over the bed to get out. The shower room was tiny and we could hear the people next door using the loo when we were in bed. We were expecting a safe in the room but there wasn't one. The satelite tv only had news programmes in English. The continental breakfast was plentiful but if you wanted eggs or yogurt you had to pay extra! The Lido is quiet with hardly any traffic, lots of restaurants and shops. A boat ticket is essential, they charge E33 for 3 days unlimited use. The Lido is quiet with hardly any traffic even though their are lots of restaurants and shops. It is a nice area to stay as it is easy to get to Venice and the airport by boat but not as crowded as Venice.", "Date": "October 23, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Kelowna", "Title": "“Lloyed and Joyce from B.C. Canada”", "Author": "RetireeKelowna", "ReviewID": "UR119531525", "Content": "We were travelling around Italy for 3 weeks with another couple. I found this hotel just on the internet. We were very pleased with our stay in this lovely hotel for three nights. The front desk staff were very knowledgable and very helpful. We found the rooms to be very comfortable clean and nicely furnished. The breakfasts every morning were superb. The location was perfect - close to the beach and restaurants. I would not hesitate to recommend this hotel to anyone. When we do come back to Italy we would definitely try and book here.", "Date": "October 20, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "3", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Bath, United Kingdom", "Title": "“A great base for a rest and sightseeing”", "Author": "swilkins", "ReviewID": "UR119351310", "Content": "I stayed at the Hotel Helvetia for a week in October 2011. The location of the hotel on the Lido di Venezia island offers the best of both worlds - a \"home\" away from the crowds of Venice, where you can enjoy the quiet and have a rest, but close enough to the main sights of Venice (by waterbus, which leave every 10-15 minutes and take about 20 mins. to reach St Mark's Square). Buy a 72 hour travelcard for 33 Euros for unlimited travel on the waterbuses around Venice and buses on Lido. This does not include the direct waterbus service to/from Marco Polo Airport, which costs 15 Euros one way (buy a ticket in the airport arrivals hall). The hotel itself is located on Lido's main shopping street, which is only one minute away from the waterbus terminal. The road, and in fact the whole area, is charming, and not busy with traffic at any time. It is not a large area however so do not expect a lot of nightlife. There are probably only about 15 restaurants in the area, mainly offering Italian cuisine, but there is also a Chinese and Indian restaurant (not tried). I had some very nice pizzas though. There is a supermarket almost opposite the hotel, which is handy for buying water and snacks. The beach is a 10-15 minutes walk away, at the end of the same street. The hotel has a traditional, old-fashioned feel to it, which made a pleasant change from identical chain hotels. Staying in a single room it was not of course very large, but more than adequate. It was nicely decorated, had ample storage, good lighting, a comfortable bed, and a modern bathroom with shower cubicle, everything working perfectly and kept impeccably clean. In fact, the maids deserve a special mention because I have rarely seen a room left so clean every day - never a crease in the bedding or a spot on the carpet, and supplies (shampoo, soap etc.) were replenished when needed and towels changed regularly. All staff in the hotel were very friendly and helpful - from the front desk, to the dining room staff and maids - and all spoke good English. The inclusive continental breakfast served daily offered a nice start to the day, with a range of cereals, rolls, croissants, meats, cheese, fresh fruit etc. Only one odd thing to be aware of: you pay extra to have boiled or scrambled eggs or even a yogurt. If you stay in any hotel in Venice remember to keep some spare cash for when you check out as there is a new city tax to pay. It varies according to location (Lido is cheaper than Venice)and star category of hotel. For this hotel it was 2.10 euros per day. I enjoyed my stay greatly and would have no hestitation in recommending this hotel.", "Date": "October 16, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "3", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Newcastle, Australia", "Title": "“Great value and Lido is a fantastic spot to stay”", "Author": "NewcastleDazza", "ReviewID": "UR119338544", "Content": "Spent 3 nights here in late September. Location is great - less than 1 minute from the Vaporetto stop and from there only about 10 minutes to St Marks Square. Room was nice - dated decor but immaculately clean. It's kind of quaint. Lido is fantastic - plenty of cafes, bars etc and a haven from the madness just across the water. The one negative of the hotel was that the beds have seen better days. Certainly not the most comfortable beds unless you like a really soft bed. Breakfast was adequate and included in the rate. At $90 AU a night in peak season I doubt you'll find much better value.", "Date": "October 15, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "3", "Rooms": "4", "Location": "5"}, "AuthorLocation": "El Paso, Texas", "Title": "“Clean rooms, nice staff, but rooms a bit small!”", "Author": "SunCity08", "ReviewID": "UR119280949", "Content": "Clean rooms, but the rooms are small. The staff was very friendly. The front desk booked our gondala ride. Great location....it was wonderful walking around Lido in the evening. The area is very safe. Its a quiet little island near Venice. The neighborhood seems like it is mostly locals that live there. The beach is about a 15 minute walk away. The beach has a lot of seashells if you like to collect but also a lot of seaweeds. There is a little canal that runs through Lido. Getting to Venice and the main canals is about a 10 minute boat ride. There are different boat rides some are longer if you want a scenic route. I would definitely stay there again mostly for the location.", "Date": "October 14, 2011"}, {"Ratings": {"Service": "2", "Cleanliness": "4", "Overall": "1.0", "Value": "3", "Sleep Quality": "2", "Rooms": "2", "Location": "4"}, "AuthorLocation": "Wales", "Title": "“VERY DISAPPOINTED No breakfast included as stated when booked”", "Author": "WelshLady69", "ReviewID": "UR118826231", "Content": "Stayed at this hotel for 5 nights , good location for the water buses to Venice but really has annoyed me that we were asked to pay 10 euros per person per night for continental breakfast even though this had been booked previously. When I questioned this and showed the receptionist my receipt which clearly stated 'VAT and breakfast included' he waved his hand and just dismissed this as being wrong. I had read reviews from others that this had happened to so knew that arguing would get me nowhere. When returning home I checked the hotels website and under the section of FAQ's read 'Is breakfast included in the price? A. When booking directly through this site a full continental breakfast is available. Why would this hotel deliberately mislead the customer in this way. If there has been confusion with other customers in the past why dont the hotel change their paperwork and website so as not to mislead the customer. i would have thought the hotel would not want to leave themselves open for complaints in this way. I will never trust booking directly with a hotel again, with an agent I suppose there would be some comeback.", "Date": "October 1, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Yorkshire", "Title": "“my 4th visit”", "Author": "Pauline777Yorkshire", "ReviewID": "UR118559540", "Content": "I love going to stay at the Hotel Helvetia, Venice Lido, as it feels like home from home. The staff are so welcoming to see us back, and we look forward to our next visit. We went to investigate the beach club, where you can pay to go for the day, and although it was closed for the season, we were able to look around, and will definitely have a day there next year. You can get the bus to it from near the Hotel, and if you have a travel card, can use that on the bus. Another nice trip using your travel card, is to Chioggia, which is bus/ferry/vaparetto ride, and where shopping is a lot cheaper than Venice.", "Date": "September 25, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Valley cottage, ny", "Title": "“Great location and price.”", "Author": "Vacalover225", "ReviewID": "UR118531321", "Content": "The most disturbing part of the hotel Helvetia is that on my confirmation print out it CLEARLY state that breakfast was included in the rate. However, it became obvious to me that is just false advertisement. The woman that checked us in, along with another fellow refused to uphold its promise. She was rude and condescending using terms like \"you people\" which made me wonder what exactly is she trying to say. Coincidentally, there was another group of tourist checking in at the same time as my husband and I and they were having the same problem where their confirmation says breakfast was included. It was disturbing to experience this during the check-in process. Even having and showing the printed copy they refused to acknowledge it. It seemed as if they have this issue all the time but since they offer a good rate they expect you to deal with it because you have no other choice. We eventually just had no other choice but to give up. Other than that our stay was pleasant. This hotel is in a really good location. Close to public transportation, the beach, and plenty of shops. The price was very good.", "Date": "September 24, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Miami, Florida", "Title": "“Great location and helpful staff”", "Author": "dlaosa", "ReviewID": "UR118505705", "Content": "I was just at this hotel with my husband is great location we arrive at the airport like around 7:30pm and by the time the vaperetto left the airport is was like 8:00pm we found the hotel right away great location el lido is great they have great restaurant with reasonable prices the staff at the hotel are great in particular a lady with long blonde hair (can't remember her name) she speaks fluent English and would be able to help you I recommend this hotel 100 percent", "Date": "September 23, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "3", "Overall": "1.0", "Value": "1", "Sleep Quality": "2", "Rooms": "1", "Location": "3"}, "AuthorLocation": "London, United Kingdom", "Title": "“Rudeness like I have never experienced before!”", "Author": "Katy P", "ReviewID": "UR118441095", "Content": "I have to be careful with this review as when I got back from holiday I wrote a letter of complaint to the hotel and I was threatened with their lawyers if I wrote my opinion on Trip Advisor. But I have decided to take that risk. We too had the misunderstanding about breakfast at check in. When we booked the hotel there were no reviews on trip advisor that mentioned this. We assumed that when it said \"All rates include Breakfast and VAT\" on our confirmation email, we would get breakfast. This was not true and naturally we argued our case, as it was clearly stated, only to be treated like we were cheap people trying to get freebies from them. I can say without a doubt I have never been spoken to in such a rude, patronising manor, the whole thing has upset me quite a bit. There was another couple, from America, checking in at the same time, who had exactly the same problem who also argued with the lady. When we asked if we were the first people to ever make this mistake in thinking breakfast was included in this rate she said we were. However, other reviews on trip advisor show me this is not true. We would have booked the room with or without breakfast as it was a very good price for the location but the way the misunderstanding was dealt with was unacceptable. I asked to speak to the manager and was told he was on holiday. I have now found out from email correspondance with them he was there all along and \"watched your theatrical scene from the reception, and did not intervene since he understood that you and your friends were creating the bad performance in front of other clients only to obtain the favours.\" So he is a manager who refuses to speak to guests with a complaint who are paying in stay in his hotel? After this episode we felt shunned by all the staff in the hotel, as if they wanted us out as soon as possible, and we felt very helpless about our rights. We didnt want freebies just an appology for the misunderstanding and an explanation. We had saved up for a while for this short trip to celebrate my mums 60th birthday, we just wished we had saved a bit extra and stayed somewhere else.", "Date": "September 22, 2011"}, {"Ratings": {"Location": "4", "Overall": "4.0", "Value": "4", "Service": "4", "Rooms": "3"}, "AuthorLocation": "Colchester, United Kingdom", "Title": "“2 Night Stay”", "Author": "WandaJ1962", "ReviewID": "UR118207700", "Content": "We decided to try a hotel on the Lido this year instead of choosing our regular hotel on the Riva degli Schiavoni in the Castello region of Venice as it was fully booked. Hotel Helvetia was around 20 Euros a night cheaper with no compromise on quality, comfort or friendliness. The location was ideal being on the Lido which is simple to access and within a stone's throw of the valperetto stop taking you directly to St Marks Square, Piazza Roma or Burano. It was also local to a supermarket, numerous bars & restaurants, the hotel's own access to a private beach and also to the public beach which has a bar, cafe and ample seating allowing you to either sunbathe, swim or just sit and enjoy a drink and watch the world go by after a long tiring day in Venice itself. If you have a valperetto ticket you can also take a ride by bus to the part of The Lido where the film festival is held. The continental breakfast offered by the hotel is more than adequate to set you up for the day and you can enjoy a reasonably priced glasss of wine in the hotel garden in the evening (but beware of the mossies!!!) A thoroughly good, clean hotel with friendly staff in an ideal location.", "Date": "September 16, 2011"}, {"Ratings": {"Location": "4", "Overall": "3.0", "Value": "1", "Service": "1", "Rooms": "2"}, "AuthorLocation": "Scarborough, United Kingdom", "Title": "“Stolen key”", "Author": "ladycaptain2", "ReviewID": "UR118198015", "Content": "I most certainly would not recommend this hotel. There is a distinct lack of customer relations. Myself and two friends,all mature ladies, stayed at this hotel at the beginning of September. One morning we found ourselves looked IN our room and had to ring for assistance to be released. After hours spent searching the room for the key to no avail, the only conclusion we could draw was that the key had been left on the outside the night before and persons unknown had taken it. We were duely presented with a bill for 150 euro's, which we had no other option but to pay. The management said if the key came to light they would reimburse us. I have since e-mailed the hotel stating that on advice given on our return, they had no right to charge such an exorbitant amount as we could find no mention of a charge being made for a missing key. Quite frankly the reply I have received beggers believe, I did say I had e-mailed Venice Tourism and would be writing a review on tripadvisor, where incidently I found this hotel, their response, tough and you can tell who you like. Does this sound like damage limitation? It has completely spoilt our Venice experience, In future I will take more notice of any criticism posted on tripadvisor, there certainly was plenty for this hotel.", "Date": "September 16, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "London, United Kingdom", "Title": "“Excellent value and convenient location”", "Author": "Cracker72", "ReviewID": "UR117720608", "Content": "We were looking for a budget hotel with traditional styling and Helvetia fitted the bill perfectly. Pros- Spotlessly clean room, bathroom and all public areas of hotel, comfortable bed, quiet location and good air con/ceiling fan/shutters meant that it was refreshingly cool after a hot and busy day sightseeing. The location is a stone's throw from the vaporetto stop and supermarket is just opposite so very convenient. Cons - only that the room was extremely small and the bathroom very narrow, having said that all the plumbing worked well with an excellent shower. In all I was very impressed and found the staff friendly. I was worried before the trip having read some unfavourable reviews but would certainly use this hotel again. We didn't have breakfast as not included in our room price but this was clear when booking and it meant we could get an early start with sightseeing before the day trippers and we stocked up with rolls and delicious salami from the supermarket over the road for our picnics.", "Date": "September 5, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "4.0", "Value": "4", "Service": "3"}, "AuthorLocation": "Cambridge, United Kingdom", "Title": "“Absolutely fine”", "Author": "markdowling21", "ReviewID": "UR117656610", "Content": "We arrived here a bit apprehensively, having read so much criticism on TripAdvisor, but in fact it was fine. The room was big enough for the four of us, more so than we have encountered with some hotel chains in England, and the bathroom too was a very good size. Breakfast was more than adequate â€“ a variety of hot and cold drinks, ham, cheeses, croissants, rolls, cake, all eaten in a pleasant outside area. As others have said, the location was excellent for getting into Venice or to the beach, and it was very quiet both internally and externally. Perhaps the staff werenâ€™t gushing (but neither were Venetians generally), but they were perfectly polite and competent. All in all, good value.", "Date": "September 4, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "5", "Overall": "4.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Levittown, New York", "Title": "“Great Hotel, Must stay here!\"”", "Author": "NYTravelGirl11756", "ReviewID": "UR117546752", "Content": "Front desk staff was wonderful and very helpful. Helped to make us feel very welcome from the start. Hotel is in a great location and the best value by far. Would recommend hotel highly for location to ferrys, and short 10 min walk to free beach. Hotel has beach towels for $2 euros a day. Rent the bikes right across the street-to get to know the island-only 4-16 euros an hour depending on a single bike or family bike for 4 adults/2 children Great outside seating to the right (the bounty bar) where you can drink wine or heinekens for only 5 euros , and complementary potatoe chips. Great gelatto right across the street. Pharmacy right down the boulevard on the right if you forget shampoo, razors or toothpaste. Best pizza/pasta and prices in comparison to Venice. Stayed in both places, and would definitely return to the Lido and stay again in a heart beat! Tourist tax started 8/24- but isnt that bad- $2 euro a person/per day per adult, max 5 days. Must be paid in cash at the end. We were 2 adults, one 16 yr old, and one 5 yr old. There was something for everyone in this hotel/location. Far better choice to stay here if you have kids.", "Date": "September 1, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "4.0", "Value": "5", "Service": "4"}, "AuthorLocation": "Santa Cruz, California", "Title": "“We loved it and we will be back”", "Author": "Veetsala", "ReviewID": "UR117545499", "Content": "Hotel Helvetia is a small albergo *** close to the vaporetta dock and five minutes walk to Lido Beach. It is comfortable, clean and the management is very helpful. They serve breakfast which is excellent as well. Moderate cost.", "Date": "September 1, 2011"}, {"Ratings": {"Cleanliness": "3", "Sleep Quality": "3", "Overall": "3.0", "Value": "3", "Service": "4"}, "AuthorLocation": "Singapore, Singapore", "Title": "“Pleasant Stay!”", "Author": "SnowMelt", "ReviewID": "UR116839858", "Content": "Location: Hotel Helvetia was rated as 3 stars hotel and it is located in Lido Island, away from the main tourist spot which is known as the Venice Island. It is near the beach area and many family gathers here. It is a peaceful island where many people rent and cycle here. It is definitely not a shopping place. Hotel Helvetia is easy to find because it is quite near the boat station which is about 5mins walk away. To go to Venice Island, it only take 4 stops to arrive. Many restaurants are available near the hotel too. Opposite the hotel, there is a supermarket which make it convenient for us to buy things too! Room: With the price we paid, my hubby and I find the room affordable and acceptable. It is not a big room but I think it is just nice for the two of us. Toilet is clean but abit small but we have no issues about it. Overall, the room is clean but the carpet is abit mouldy. Do take note that they do not provide kettle and minibar in the room. Overall, we enjoyed our stay here! Service: Hotel staffs are friendly and helpful. We have no problem with their service. There are wireless Internet/computer station but it is chargeable.", "Date": "August 17, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "3", "Overall": "4.0", "Value": "3", "Service": "5"}, "AuthorLocation": "San Diego, California", "Title": "“Great Hotel! We will go back!”", "Author": "Joan G", "ReviewID": "UR116781496", "Content": "I was very surprised to see all the negative reviews about this hotel. The location on Lido was great. All restaurants and the beach were in walking distance and Lido was not overcrowded with tourists. The staff was pleasant and courteous. Every time we had a question about restaurants or events on Lido they were helpful and responsive. The breakfast was not very good for our American tastes, but we decided to bring fresh rolls from the Billa supermarket across from the hotel. The quadruple room was pleasant, clean and quiet. The size of the room was not a big deal since we spent most of our time in Venice and at the beach. Overall we had a great vacation and would definitely go back to stay at Hotel Helvetia.", "Date": "August 15, 2011"}, {"Ratings": {"Cleanliness": "3", "Sleep Quality": "1", "Overall": "2.0", "Value": "1", "Service": "2"}, "AuthorLocation": "London, United Kingdom", "Title": "“Decieving Hotel, DO NOT GO!!!”", "Author": "Ayan D", "ReviewID": "UR116470577", "Content": "Me and my family of four stayed at Hotel Helvetia in a family room. This hotels idea of a family room is a double bed room with two folding beds cramped into the roome. The room was horrid, there was absolutaly no moving space, to get to a bed you have to crawl over another bed. We couldn't stand to stay in the room for long so we checked another double room for 80 euros. The hotel provided a continental breakfast, the breakfast was horrible, it had stale bread and cake. The pre-paid breakfast doesn't even cover all of the food, you have to pay 2 euros to get a yougurt and 4 euros for scrambled egg.", "Date": "August 9, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "2.0", "Value": "4", "Service": "1"}, "AuthorLocation": "Ottawa, Canada", "Title": "“Probably Wouldn't Return”", "Author": "Europe_Bound_2010", "ReviewID": "UR116433537", "Content": "I'll start this review off by stating that I fully expect hotel management to disagree with any critiques that I have of this hotel and our stay that seem negative, given how other reviewers have been responded to. I would hope, however, that those reading this review consider my comments to be constructive criticism of the areas that could use improvement, and realize that I do list positive aspects of our stay as well and wish to provide a fair and balanced review of our experience with this hotel. First, what drew me to this hotel was the great price that I was able to secure by booking far in advance. At the time, the hotel seemed to have very positive reviews on TripAdvisor. Like other reviewers who started to comment on this hotel more recently, although my reservation was for room only I was under the impression that it came with a continental breakfast given the wording on the website at the time of booking. I thought by 'room only', it meant that I was getting the continental breakfast, and I chose not to purchase any additions such as the buffet breakfast, fruit baskets or flowers in the room upon arrival. Having read reviews after I booked and leading up to my arrival I fully expected to encounter problems at check-in, and was not surprised when I was given the script of how I booked room only and it was to cost extra for breakfast. I was then told a price for a continental meal, and although I can't remember what it was anymore, I remember it being exceptionally expensive for what is to be included in continental. We didn't have a positive first impression after check-in, made to feel like we were expecting too much for so little, yet we had the evidence printed out with us on our booking that breakfast was included in ALL bookings made through their website. We instead went to nearby cafes for a fraction of the cost, or headed to the grocery store across the street to pick up fresh fruit before heading into Venice for a day of sightseeing. It should be noted that food in the rooms is strictly prohibited, a first-time encounter for us in our travels around Italy. We arrived at our room, which was small. I fully expected this from the previous reviews, and since it was an economy I wasn't too surprised. This wasn't an issue for us since we spent very little time in our room anyways. If you have lots of luggage though, you may consider upgrading as it was difficult to even comfortably place two small suitcases and still maintain adequate walking room. We noticed immediately that the bathroom light was not working. We tried it a few times, left the switch on for a few minutes thinking if it was energy efficient perhaps it was just taking a little bit to get going. No such luck. We went to the front desk and given a look like we were just making this up, and told that we would have to wait two hours for it to be investigated. There is no window in the washroom, nor was it positioned in a way that we could get adequate light to enter from the window in the room. Two hours to change a lightbulb seemed unreasonable, considering guests typically like to freshen up when arriving after a long day of travel. When we went back to the room from reception we tried the switch off and on a few more times while getting settled in, and suddenly it decided to work. We informed the front desk who made us feel like we were a huge inconvenience. Light switches would be difficult to improperly use and are the same in Italy as in Canada, so clearly there was a problem with the bulb and not us (it was most likely loose upon our arrival and something shifted causing it to suddenly work). At this hotel you have to leave your key when you come and go, which we have encountered before. Typically not an issue but a few times we had to wait. One time, without yet stating our room number we were handed someone elses key. This had me concerned that someone could take advantage of this and would have access to our room while we were out. We never left valuables in our rooms because of this. The hotel has a sign that if you dont need fresh towels and in the interests of being environmentally friendly leave them on the towel rack. We did this, having only used them once, and they were replaced anyways - except for the day they were taken and not replaced! We regretfully had to go down to reception and request towels. At this point we were feeling very unwelcome (by the tone and expression used when addressing us) and were not given an apology, just a comment that they would inform housekeeping. Air conditioning had not yet been turned on, so we left the fan on and windows open so that we could return to a cool space. It was mid-May and already very hot out. On this day we had already returned once after housekeeping had been through, so there should have been no reason for someone to have entered our room at this point. The window was shut, including the shutter, and the fan was off when we entered. The room was hot and stuffy with no air cirulation, and took awhile to cool down. It's not my first time to Italy, and I have never encountered hotel staff coming in during the middle of the day to shut windows (on a sunny day with no forecast of rain, might I add) and to turn off fans when it is hot outside and no airconditioning is turned on. This hotel does have many advantages working in its favour. It's within close proximity to the Vaporetto stop, from which it is a short waterbus ride to Venice (about 15 minutes to St. Marks square). We purchased the three day pass in advance online and received a discount, so transport was very cheap. Having stayed in Venice near St. Marks on a previous visit, I wanted a quiet place away from all the tourist commotion to return to at night. Lido was perfect for this and I would definately return to Lido again. The rooms seemed clean, and as I commented on before the size of the room didn't matter to us and was expected. They have larger rooms on offer, so I appreciated the variety and the fact that they took budget travellers into consideration. Overall, however, I would likely look elsewhere if I were to return to Venice or Lido. If I encountered another amazing deal for this hotel and other's weren't available, perhaps I would return, but only if no other options were available in my pricerange. It's not the worst place I have stayed: it's clean and close to transport options. But that is the extent of it. The way we were treated by staff throughout our stay made us feel uncomfortable and unwelcome, and for this we would likely not return.", "Date": "August 8, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "4.0", "Value": "3", "Service": "4"}, "AuthorLocation": "South Wales, UK", "Title": "“Great!”", "Author": "WelshmamOF2", "ReviewID": "UR116312810", "Content": "Great location for staying on the Lido - couldn't fault it. But if you want to see the old Venice you will have to pay 6.50 Euros one way on the vaparetto (water bus) per person so for us, as a family of 4, it was about Â£50 for a day return from the LIDO to the island. However if you want a beach hol with the occassional visit to Venice centre then this hotel is perfect. The rooms were of ample size and clean. The hotel could do with some updating in terms of decor and didn't like being charged 2 euros for a yoghurt for breakfast and 2 euros for eggs ?? The hotel directed us to their beach which was a bus ride away and very quiet when we were there but that wasn't a bad thing at all. Would stay here again.", "Date": "August 5, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "4", "Overall": "4.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Sofia, Bulgaria", "Title": "“Good value for money”", "Author": "SilvinaFurnadzhieva", "ReviewID": "UR116277190", "Content": "Cozy, close to all important spots - the Lido beach and the vaporetto stop leading to Venice, very nice and professional staff who speak perfect English. The only downsides are the small rooms and tiny elevator. Another plus is Hosteria el Canton - a small restaurant and bar located just between the hotel and the vaporetto stop on the same side of the street - it is open from early in the morning until late at night and serves tasty pizzas and sandwiches at bargain prices.", "Date": "August 4, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "4", "Overall": "4.0", "Value": "5", "Service": "4"}, "AuthorLocation": "Fife, Scotland", "Title": "“Impeccable service, clean and reasonably priced”", "Author": "wee_hammy", "ReviewID": "UR116144792", "Content": "We booked this hotel as we were coming over for a family wedding in Venice and as we had a one year old dughter, couldn't afford to stay at the more expensive hotel chosen by other family members. After reading some of the recent reviews, I must say that I became a little anxious that we might have to pay again for our breakfast, or if that I wouldn't be allowed to plug in my hair straighteners for fear of them being snatched off me and kept behind reception with all the travel irons! Thankfully, there were no such problems. The staff were friendly and attentive, the young lady with the short hair helped us every morning with the baby seat at breakfast, and reception staff called and tried to book a restaurant for me as I'd been before years ago but couldnt remember where it was or whether to book or not.... The room was a little tired if I'm honest, but was clean and well maintained. Thank goodness for the air conditioning also, as my little girl was struggling with the humidity outside. We had a room overlooking the back of the hotel and it was very quiet, we werent disturbed at all during our 3 night stay. If I could pick on one thing, I'd say it was a bit strange to be asked to pay extra if you want a yoghurt with your breakfast.... You also had to pay extra if you wanted scrambled eggs, which would be fair enough if you are having them cooked to order. HOwever, on emorning my husband and I had them and they were rubbery and lukewarm as they had been sitting on a hotplate for ages. We didnt bother having them again. Overall, I'd give this hotel a good review, it's minutes from the main ferry/taxi terminus for Lido and was a very reasonable price.", "Date": "August 2, 2011"}, {"Ratings": {"Cleanliness": "3", "Sleep Quality": "2", "Overall": "1.0", "Value": "1", "Service": "1"}, "AuthorLocation": "London, United Kingdom", "Title": "“Avoid this place!”", "Author": "marsenal", "ReviewID": "UR116081226", "Content": "Having traveled extensively and stayed at numerous hotels throughout Italy, this was by far the worst experience of the lot. Overall the quality of the hotel was poor (I understand that hotels in Venice are expensive especially in July but it was still very poor). The rooms were very small and beds uncomfortable. The additional beds that were brought into the rooms were extremely uncomfortable. The breakfast that was included excluded eggs and yoghurt for which you had to pay extra. Most importanly though the front office staff were not helpful, unfriendly and plain rude. I would definitely not recommend anyone staying at this hotel.", "Date": "July 31, 2011"}, {"Ratings": {"Cleanliness": "3", "Sleep Quality": "2", "Overall": "2.0", "Value": "2", "Service": "3"}, "AuthorLocation": "Monterey, California", "Title": "“Shabby place, cheap furniture, awful coffee, rude manager/owner, never again”", "Author": "KGC1", "ReviewID": "UR115984262", "Content": "The only good thing about the Helvetia is the location. Very close to the vaporetto and also close to the public beach (someone said private beach???). At the public beach it will cost you 15 euros to rent one lounge chair and an umbrella. If you don't pay you are not allowed in that area. Closer to the water it gets very crowded. The Helvetia does not have a private beach. The single rooms at the Helvetia are ridiculously small. More like a big closet than a room. The furniture is of the worse quality and the walls are paper thin. No refrigerator. The elevator is usually out of order and is really tiny. The air conditioning runs very cold or not at all. At least that was in my room. Asking them to repair something is a waste of time. They just ignore you. The employees are very nice, the problem is the owner, she says no to everything so the staff has to comply or lose their jobs. (This last I was told by three staff members.) The manager, who is also the owner, is extremely rude and incompetent. I had a reservation and she argued that it was not there. That was because I had made it well in advance, good I had the copies from Booking.com, and they hike up the prices during the Biennale and the Film Festival. Breakfast was awful! Worse coffee in town. And this is Italy!!!! For the same price there are other hotels like the Venezia 2000 that are much, much better, or if you stay in Venice, it is only a short boat ride to the Lido. I won't go back there.", "Date": "July 29, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "4", "Service": "5"}, "AuthorLocation": "Leicester", "Title": "“great hotel!”", "Author": "SamLeicester", "ReviewID": "UR115717988", "Content": "This was in a great location; 1 minute off the boat and you're there. the staff were very friendly and helpful. Breakfast can be eaten in the walled garden at the back, which is nice and shady and covered in flowers. The only down-side was the fact that I paid for a superior room; which turned out to just be a slightly bigger than standard room. Wouldn't recommend paying for the superior option, but the room itself was very clean and had air-con plus a fan. If you keep on walking up the street (with the hotel on the right hand side) you'll come to a pizza take-away place on the left hand side. It had a big white printed board with all the different options on - this is a fab place; freshly made pizzas at bargain prices. Their large (and I mean large!) pizzas were about 10 Euros each, bargain. There are loads of ice-cream places on this side of the road too. Keep an eye on the prices; they vary from 1 - 3 euros for a small cone, so don't pay more than 1 Euro each! The beach is a great place to spend a few hours after a busy day sightseeing and there's a large free public beach and the sea was lovely for a paddle. Be prepared to pay out for the water buses. I hadn't appreciated the daily rate and after a few days previously in Milan (where the metro is super-cheap) the water buses seemed very expensive. Overall i loved Venice; there was something to see round every corner. Be prepared to get lost, but just keep walking! Pizzas places were great for selling large slices of Margarita for 2 Euros each; that and a 1 euro ice-cream meant lunch could be very cheap if you're on a budget.", "Date": "July 24, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "4", "Overall": "4.0", "Value": "4", "Service": "4"}, "AuthorLocation": "Paris, France", "Title": "“Great location and we will be back!!”", "Author": "HandJ2006", "ReviewID": "UR115099403", "Content": "Hotel Helvetic locates in Lido, off central Venice just 5-10 mins by water bus. It's a lovely and friendly hotel. We arrived at the st Lucia station and take water bus route 1 to the hotel. The bus travelled through the grand canel and the scene was breathtaking! If you need a quicker way can try bus route 52 which cut through the small stops and reach lido just under 30 mins from the train station. hotel locates at the main street just a steps away from the waterbus station, which is very convenient. Hotel we booked including continental breakfast and there were choices so it's good. There is a pie ate beach and garden. Adding more to the location, is the ice cream shop next-door and a bistro gastronomic shop a hundred metres down to the hotel. We found our local supplies!! We also tried the cycling hiring point just opposite the hotel. It was such lovely experience to explore the local living, as well as the quietness and space, and easy access to the town centre. The room is fairly small and there was no safe in the room, compared to most of the hotel we stayed but we will still come back for a visit! Thank you hotel Helvetic for the lovely time we had!", "Date": "July 6, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "4", "Overall": "4.0", "Value": "4", "Service": "4"}, "AuthorLocation": "Riga, Latvia", "Title": "“We liked it very much and we would choose this hotel again.”", "Author": "DaceG", "ReviewID": "UR115085516", "Content": "We liked everything: Location of the hotel. Clean and fresh, although simple, rooms. Breakfest in the backyard. Reasonable breakfest with ham, scrambled eggs, yogurts and apples, fresh coffee. Lido island as a relaxing place with beach to spend the nights and sometimes days, if too tyred from the crowds in Venice old town. tip: spend 1/2 a day on Lido island, rent a bike and drive through the island to the golf club direction, making stop in Malamocco's tratoria specialising in fish. Actually, better spend a whole day on Lido!", "Date": "July 6, 2011"}, {"Ratings": {"Cleanliness": "3", "Sleep Quality": "3", "Overall": "3.0", "Value": "2", "Service": "2"}, "AuthorLocation": "South Africa", "Title": "“I should have trusted my instincts”", "Author": "PonkySouthAfrica", "ReviewID": "UR114861228", "Content": "I had read reports by other travellers, saying rooms included breakfast on internet when you book it, but when you get there, they say it doesnt, but thought - well it is so clear on the internet that it does include breakfast, that there is no way it can happen to me. Well it did! As soon as we arrived at reception and started booking in, we were told....' you know this doesnt include breakfast'. Oh yes it does, I say, presenting my print out of my booking where it states breakfast included. Oh no it doesnt I am told, surely you must realise at this price it doesnt include breakfast.. I point out that it states it on the paper. They just stick to their guns and deny it. At the same time, another guest is complaining about the wifi, which is expensive, and although they have paid, they cannot access it. Another receptionist is being extremely rude to them at the top of his voice. At 2 different times during our stay we heard staff being extremely rude to guests booking in about the same story with the breakfast and a third guest complaining about the quality of the room. The hotel would be good value for money if it included the breakfast, but without it we could have stayed at a better quality hotel for the same price. It is a pity because it is well located and reasonably clean and neat but walls very thin and our room was quite small although the other members of our family, the room was slightly bigger. There was a public transport strike the day we left, and we were very annoyed that although the hotel MUST have known about it the previous day, they only put a notice up the morning of the strike which meant that guests couldnt make provision for the extra time it took travelling to the airport. I wouldnt stay here again purely because of the deceitfullness of their booking policy and the rudeness to guests that I witnessed. They WILL put a reply to this denying it and saying that we misread the booking receipt but believe me, I have the paper and can prove it. We are positive people so would not let this upset our holiday but be aware of it. It is worth staying on Lido cause it is only a short distance by Vaporetto and you can buy a 3 day pass which makes affordable and nice to be able to get away from the hustle and bustle.", "Date": "June 29, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "4", "Overall": "4.0", "Value": "4", "Service": "4"}, "AuthorLocation": "Redhill, United Kingdom", "Title": "“Perfect for a breakaway”", "Author": "bschaldon", "ReviewID": "UR114713221", "Content": "We spent 3 nights here - I paid for a Superior room with Lagoon view (for my wife's birthday surprise). The room was large and light with a large comfortable bed, and a nice big bathroom (bath w shower). Everything very clean, although the room furniture was cheap chipboard and the decor somewhat sparse. Our room overlooked the road at the front, and you could just about see the lagoon off to the side. A bit noisy at night, but shutting the windows blocked that out. There was a ceiling fan and a quiet A/C unit. In all a pleasant room that would have been exceptional with a more tasteful decor. Breakfast was self-service, and perfectly adequate in the continental style although my wife missed having fresh fruit (there were a few apples). Found it hard to cope with smokers at breakfast! Staying at the Lido was a good decision, escaping the heaving bustle of Venice every evening. We'd certainly consider going back to the Helvetia if we visited again.", "Date": "June 24, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Memphis, Tennessee", "Title": "“Hotel Helvetia Holiday”", "Author": "georgehighway", "ReviewID": "UR114003315", "Content": "Hotel is across St. Marc Square lagoon, they have private beach and big garden. Rooms are both with air cond. and fan.", "Date": "June 17, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "4", "Overall": "4.0", "Value": "5", "Service": "5"}, "AuthorLocation": "cambridge", "Title": "“Nice Place to stay”", "Author": "Venlover", "ReviewID": "UR113800870", "Content": "we stayed at the helvetia for the second time. The price this time was very good and it not included the breakfast, but this was our choice to save some money! the hotel rooms are small but spotlessly clean, however for the price we paid I would not expect nothing different! the staff is really helpful and corteous, they are ready to help if you need. the location is perfect, only 10 minutes from Venice, and few steps from the beach. Internet is not cheap, but if you buy 20 hours the cost is 12 euros, cheaper then other internet cafe' in Venice! However on holiday I would avoid the use of mobile and internet, you don't really need that! The hotel beach is about 10 minutes by bus or bike from the center, you can rent chairs and spend all day there, really nice and relaxing. Helvetia It's a good hotel at a reasonable price, we will be back!!", "Date": "June 16, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "London, United Kingdom", "Title": "“Great hotel with private beach”", "Author": "McDexters", "ReviewID": "UR113719215", "Content": "We had great stay at Helvetia, the room was spaciosu and we had a bathtub in the bathroom, in the evening my wife and me sat on the balcony overlooking the island, my children enjoyed their private beach and excellent breakfasts in their picturesque garden, the hotel is only a few minutes from Art Biennale, we will go back there next summer.", "Date": "June 15, 2011"}, {"Ratings": {"Cleanliness": "3", "Sleep Quality": "3", "Overall": "2.0", "Value": "2", "Service": "1"}, "AuthorLocation": "London, United Kingdom", "Title": "“Loved Venice - but not this hotel.”", "Author": "Vicki432", "ReviewID": "UR113430298", "Content": "We booked this hotel way in advance of our trip round Europe on the basis of Trip Advisor reviews and wish we hadn't; feeling slightly dubious reading recent reviews before we embarked on our trip and witnessing the unprofessional, sarcastic and somewhat rude responses posted by management to reviewers complaints did not fill us with hope. We booked an economy double through Expedia and were spoken to and treated as if we were not only stupid but the scum of the earth. The reception staff were nice enough upon check-in, but when we returned as there was a problem with our room, all hell broke loose. One man, who I am presuming was the most senior on duty, possibly even the manager, advised that they had no other rooms available and, after checking with the receptionist that we had been in the room less than 5 minutes, advised that if we were unhappy we should leave immediately and they would inform Expedia who would refund our payment. During this time he also told me that I should shut up as I had had my turn to speak and he was informing me of hotel policies; despite not listening to what I had said or looking at the invoice I attempted to show him to confirm what we were saying. After advising that I did not wish to spend my first hours in Venice looking for alternative accomodation, we returned to our room to contact Expedia, at which point the man from downstairs called the room to repeat his 'hotel policies' but also advised he could move us the following day. This we declined after reading reviews on here of housekeeping removing items belonging to guests (as per Italian law?), we decided we did not want anyone from the hotel in our room during our two night stay. All this negativity marred our first impression of Venice, and was compounded with the fact the private beach advertised by the hotel was at a supplement (for deck chairs/umberellas etc) and breakfast was at an extortionate rate of 10E for continental and 15E buffet. The best thing about this hotel was that it was less than a minute to the Vaporetto station and from there a pleasant journey on the water to the main sights. Lido was a great place to stay with regards to several well priced restaurants only minutes away and a supermarket across the road. We loved Venice, but not this hotel; the attitude of one individual spoiled the experience for us and turned what should have been a pleasant 2 night stay into the worst we had throughout our 6 week tour around Europe.", "Date": "June 14, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "3", "Overall": "1.0", "Value": "1", "Sleep Quality": "2", "Rooms": "2", "Location": "3"}, "AuthorLocation": "Torrevieja", "Title": "“Don't book this Hotel!!!”", "Author": "Gaz056", "ReviewID": "UR111926521", "Content": "A party of eight had booked a room on this Hotel's website, which clearly stated a full continental breakfast was included. However, on checking into the hotel we were told that breakfast was not included even though we had written proof. We asked to speak to the manager and was told he would not be there until Monday, this was Thursday, only to be confronted a few minutes later by someone claiming to be the manager. He was extremely rude and started shouting at us threatening to throw us out of the Hotel. On finally arriving to our rooms one member received a phone call from him shouting and insisting we go down to apologise. Had we had alternative accommodation we would have left instantly this somewhat marred our first impression of Venice and couldn't wait to leave.", "Date": "June 7, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "4", "Overall": "5.0", "Value": "5", "Service": "4"}, "AuthorLocation": "Encinitas, California", "Title": "“The hotel was in a great location. Very safe and comfortable! Would stay there again!”", "Author": "painter72", "ReviewID": "UR111894555", "Content": "We enjoy walking in the area and eating ice cream and watching people..", "Date": "June 6, 2011"}, {"Ratings": {"Service": "2", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Location": "5", "Rooms": "2"}, "AuthorLocation": "Dusseldorf, Germany", "Title": "“an average hotel at a nice place”", "Author": "paulovisconti", "ReviewID": "UR111394700", "Content": "we went to biennale 2011 and looked for a place to stay. a friend pointed us to helvetia so we took it since we were a little late for regular booking and helvetia had vacancies.... the rooms are very small. the furniture ist old and looks like it was made in the late 70ies. the matress is too soft to sleep longer but that makes you leave bed early, tho. breakfast looks nice, but if you look closer they serve instant coffee wit some overcooked eggs and cheap, sugared orange juice. nothing what you would be used from italian cuisine. today in the morning it was quite busy so the waiters were putting tablets on my table showing me that it was time to leave. well, asmi said the breakfast wasnt that good so i went without fussing. the rooms are very noisy. you can hear roommaids vacuuming thru the whole floor, even people talking from neighbouring rooms can be heard clearly. verdict: cheap hotel with good location to vaporetti. dont expect too much and read the other review where those people got ripped off with that \"broken\" bathroom sink. make sure you get some kind of signature before leaving....", "Date": "June 4, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "3", "Overall": "3.0", "Value": "4", "Service": "3"}, "AuthorLocation": "Raisio, Finland", "Title": "“Nice and cosy hotel”", "Author": "dahlgnik", "ReviewID": "UR111184030", "Content": "Service was good and friendly. If we needed help we got it right away. Room was quite small but can accommodate two people comfortably. Bathroom was clean and there were a bathtub with shower and it was quite big despite that the hotel is in Europe. Room was cleaned every day, sheets were changed every other day. Detergent they used to clean the room smelled bad but we could survive of that. Location was excellent. Hotel is situated on the main street of Lido Island and there was only a minute walk from the Vaporetto (water bus) station. We did not try the breakfast. Price variated from 10 euros (continental) to 15 euros (buffet).", "Date": "June 2, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Doylestown, Pennsylvania", "Title": "“A pleasant stay at Hotel Helvetia”", "Author": "lindbic", "ReviewID": "UR109724575", "Content": "We just returned from a one night stay at this hotel, prior to boarding a cruise from Venice. The Lido is a beautiful town, easy to get to by water taxi, and the hotel is less than a block from the stop. The staff was friendly, the room was clean and the bed comfortable. We were very happy with our choice of hotel and location.", "Date": "May 24, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "", "Title": "“Friendly hotel, great location”", "Author": "camcourt", "ReviewID": "UR109203126", "Content": "I have just returned from a weekend break. Having never been to Venice before I didn't know what to expect. I had single occupancy of a double room, everything worked and the showers were brilliant and the room and bathroom were spotless. Spale on Reception was very informative and his English excellent. I travelled with a group there were 12 of us in total. On the Saturday morning Spale organised for us to have our breakfast in the garden so we could all sit together, the weather was good so it was perfect. The breakfast was lovely you could have as much as you wanted - but there's only so much a person can eat! My friend Pauline who organised the trip couldn't have picked a better location for the water buses. It took 10 mins to St. Marcs Square - there are some really nice islands to visit. The hotel recommended places to eat nearby,which were all good. Don't hesitate to use this hotel.", "Date": "May 21, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Manchester, United Kingdom", "Title": "“Ideally situated hotel - Ensure you get what you pay for.”", "Author": "bevblako", "ReviewID": "UR109023858", "Content": "This is a nice hotel which enjoys a fantastic position only a minutes from the water bus stop in Lido Venezia. The hotel was very clean and the check-in process wasquick and easy. We paid for a superior room which the website states has a shower and bathtub and larger beds. The 1st room we were given had a bathroom (the size of a large cupboard) with only a shower. I went to reception to query the room we were provided and we were quickly moved to a larger room with a large bed and a bath and shower.The hotel website advertises a private beach. However, when I enquiried how to get there I was advised that it wasnt open yet !! There is no mention of it being closed on the website. Luckily there is a public beach which we were able to use. We arrived on a Monday and on the Tuesday we asked reception if we could leave our laptop in the safe. A notice in the hotel advised not to leave valuables in the room and to give to reception for safekeeping. The lady on reception gladly took the item and advised she would keep it safe. However, on the the next day when we asked them to look after it again we were advised by a different receptionist to leave it in our room as 'this was safer than behind the reception'. On Wednesday (the day before we were leaving) we requested our key from reception and was advised that they had removed our travel iron from our room WITHOUT PERMISSION as it was against Italian law to keep them in hotel bedrooms !!! They refused to return the iron until our check-out. There was no signs telling us irons are not allowed and the iron was in the same place on Tuesday when the room was cleaned and was not removed. It is of concern that staff are removing guests items from their rooms without permission. We loved our stay on the Lido but feel the hotel should provide what they advertise on the website and should be consistent with their rules and regulations.", "Date": "May 20, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Yorkshire", "Title": "“my 3rd visit, and can't wait to go again!”", "Author": "Pauline777Yorkshire", "ReviewID": "UR108785870", "Content": "12 of us stayed at the Hotel Helvetia, on the Lido, the best place to be in Venice. It's more spacious and calmer, and you get a fantastic view of the whole of Venice from the waterfront. When the weather is fine, breakfast is served outside in the pretty vine-covered courtyard. But the breakfast room itself is also very nice, with crisp table-cloths, a good selection of food, and attentive staff. The hotel is a few steps from the vaporetto stop, then a 10 minute, spectacular trip across the lagoon. The staff, especially Spale, are wonderful and helpful. We were there 3 nights, and each night they recommended a different restaurant for all of us to fit in comfortably, and booked a large table for us.Not one complaint, from 12 people, says it all!! The APT travel ticket includes the buses on the Island, and you can use it to catch the number 11 bus, which connects with ferries, from outside the Hotel, to Chioggia.", "Date": "May 18, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "2", "Overall": "1.0", "Value": "1", "Sleep Quality": "2", "Rooms": "1", "Location": "5"}, "AuthorLocation": "Brussels, Belgium", "Title": "“Insurance Fraud”", "Author": "missselfridges", "ReviewID": "UR106505657", "Content": "We stayed in this hotel on 24th April until 26th April 2011. The first time we arrived to check in the hotel, something weird with the system. The guy at the counter were asking us the passport. This was fine but the weird thing was, he asked to hold the passport and told us to return the passports in like 30 minutes later. Passport is something valuable and important and other party should not hold the passport . An hour later, we returned to the counter and demanded the passport and he returned it to us without any scenes. On the first night of our stayed in the hotel, we bought a pizza to be eating in the room but an old lady with biker's jacket sound us with a rude voice and action. she told us that we could not bring foods to the room. Seriously, we did not see any notices or hotel's rules for forbidden bringing the foods to the hotel until the next day a new notice was displayed at the counter saying about the forbidden of bringing foods to the room. With a toddler it was impossible for not bringing foods to the room.we were not cooking in the room just bringing pizza! The hotel said only small amount of water is allowed to the rooms! On 23rd april, we told the staff that we will check out very early in the tomorrow morning so we settle the bill by cash on the evening of 23rd april at the counter and the funny thing was, we only received the receipt in the next morning (24th april 2011) simply because only one person was allowed to write the bill! A day of our departure, 24th april 2011, we checked out at 6.55am and returned the key at the counter. Nobody was available to checked the room before we left since they lack of staffs to do so and it was the hotel fault for not having enough staffs. In the afternoon on the day of our departure, the hotel sent an email to my hubby saying that we damaged the sink in the room ( see, the simply made a false allegation and took advantaged from our early departure by saying nobody was checking the room when we left!) . They tried to find a reason by saying we were breaking the sink . It was totally false allegation. We left the room as the day we entered it. Sink is not something easily to break and the hotel asked euro 195 to be transferred to their account as a cost for replacing a new sink. We refused to pay them since we did not make any damaged to the hotel room. We only stayed in the hotels for having showers and sleeping. The rest of the day we went out for sightseeing. Plus, what is the heck of us to break their sink. The hotel kept emailing us about forcing us to pay the damage by suggesting and assuming that we have an insurance to cover the payment that we made, if we paid the price that they asked for repairing the sink. It is absolutely clear that the hotel is trying to force us of making a false claim to our credit card insurance. Today, on 2nd May 2011 we received an email from the hotel saying that they have already charged our credit card for the amount of Euro 195 and demanding our home address to send the bill so that we can claim from insurance with the bill. Nothing is good about this hotel except the location. The owner is rude, the rooms is small, the furniture is old and lousy. The system is outdated etc. And the worst is they are making money from charging the customer by charging our credit card for something damage that we have never done. If anybody knows where or any bureau to report about this hotel and the insurance fraud, please let us know. Thank you!", "Date": "May 2, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Nottingham, United Kingdom", "Title": "“Great experience and great choices”", "Author": "LovelyToGo", "ReviewID": "UR106436018", "Content": "We just came back from visiting Venice. Staying at this hotel has certainly made the trip much more pleasant. First of all, it is less than 5 minute walk to the hotel after coming out from the Lido waterbus stop. That's a big plus, after seeing how some of the people needed to drag their lugguage up and down numerous bridges when staying at the main island. Also, it is easy access to the beach which makes the children very happy. The hotel room is big and it is comfortable for four of us staying in the room. The bathroom is very modern. After seeing some of the toilets in Rome and Venice, going back to the bathroom in the hotel is even a nice and relaxing experience. The only thing I found a bit strange is the arrangement for the breakfast. I booked the family deal available on the hotel web site. When I went to breakfast on the first day, I was told that my booking did not allow us to have eggs and yogurt or I need to add extra 2 EURO. This is not what I expected and I couldn't remember seeing this on my booking. Given all the choices available, eggs and yogurt are literally the only two extra items excluded. We do feel that this makes it unnecessarily complicated. We would recommend the hotel to include the costs for all inclusive breakfast. Given the 1 or 2 EURO differences in the hotel bill, that's minimum. Yet, when we were told about paying for this 1 or 2 EURO at the breakfast, it just seems a bit awkward. Lastly, it is not just this hotel but other Italian hotels. They all expected the guests to leave the keys when we went out. We don't mind doing that. Yet, with young children, we at times need to go back to the hotel room many times before going sightseeing. Keep getting keys and returns keys seems to be a bit more work than necessary.", "Date": "May 2, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Carlisle, United Kingdom", "Title": "“excellent hotel good value for money”", "Author": "sandrapow", "ReviewID": "UR105682748", "Content": "we have just come back from a 3 night stay at the Helvetia. We were a group of 10 all in our mid 50,s to 60 and have travelled to many parts of the globe we all thought the Hotel was excellent .The rooms although small were spotless and all the staff were friendly and helpful. A special thankyou to the matradee at breakfast who tried very hard to seat us all at one table but was thwarted by inconsiderate customers, he was very apologetic. The Hotel is well situated on the Lido and a short walk to the beach where you can get nice wine and pizza. Venice is lovely but expensive Â£1.50 for a pee!! Staying on the Lido you have the best of both.", "Date": "April 26, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "ilfracombe", "Title": "“enjoyed our return visit”", "Author": "vfreak", "ReviewID": "UR105621451", "Content": "lovely little hotel with extremeley friendly and helpful staff. very convienient for the water bus stops to venice and the islands. Rooms are small but very adequet and clean fresh linen everyday will definately return", "Date": "April 26, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Chatham, United Kingdom", "Title": "“had a great stay”", "Author": "bills60", "ReviewID": "UR104565378", "Content": "just got back from venice and had a great time with my wife and another couple we where unsure of our travel arrangements booked through expedia but had a great time. the rooms are small but are really clean and very comfortable the breakfast was ample and the staff very friendly the whole trip was great the water taxis where easy to use and the hotel is perfectly located for you to get all other venice, the beach is at the end of the road you can see st marks square from the hotel all be it from a distance but this ment you could get into the hustle and bustle of the city with ease yet get back to the hotel where it was more relazed would recomend this hotel to anyone.", "Date": "April 18, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "3.0", "Value": "2", "Sleep Quality": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Campinas", "Title": "“Much taxes for simple things.”", "Author": "samzalak", "ReviewID": "UR104407983", "Content": "When I reserved the hotel I read the breakfeast was included but when I arrived on hotel the breakfest was not included, the parking was expensive (15 euros/day), the A/C was not working and no one offered our water mineral as courtesy as I readed after and finally the WIFI was too expensive (18 EUROS by 20hours). The hotel it's clean, very well located and the receptionists are too nice. The only problem really was the extra taxes ( breakfest, parking and wifi). There's a lot of places to eat near the hotel (breakfest, dinner, lunch), a good way it's buy a vaporetto's pass for the days ( all young people have a discount <30 years). I would suggest for everyone try to find a hotel with wifi, breakfest and parking included, it's a best way.", "Date": "April 17, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Hastings on Hudson, New York", "Title": "“Looking Forward to Staying Here Again”", "Author": "EL23", "ReviewID": "UR96359767", "Content": "Well situated and convenient to water taxis, restaurants, shops and public transportation. Hotel staff was extremely friendly and helpful. Our rooms were small but clean and well kept. Public areas were spacious and also well kept. There is also a lovely courtyard area with seating for breakfast. We especially appreciated that hotel guests have access to a private beach. We have stayed at other hotels on Lido but have never returned to them, but we look foward to staying at Hotel Helvetia again on our next trip to Lido.", "Date": "February 12, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Toronto, Ontario", "Title": "“Great, affordable and lovely stay!”", "Author": "IheartNO", "ReviewID": "UR87547397", "Content": "This hotel is just off from Venice on the island of Lido. At first I was skeptical about staying out of Venice, but I am so glad we did. Lido had lots to offer as well as a BEACH! It is beautiful and you would not get that in Venice. The transportation to Venice is simple (a boat that acts as a bus going from stop to stop) but does cost 6.50 each way. My partner and I stayed here for 4 days and visited Venice only once and found it to be enough. The hotel itself was very nice. It has private washrooms large and safe windows, internet, televisions as well as a communal terrace. I loved getting a little reading done there in the afternoon while relaxing with some delicious wine. The breakfast that was included was excellent as well. It was self serve and had meat, cheese croissants, breads, juice , tea and other delicious snacks including cake! The staff was very helpful too. And our rooms were cleaned everyday. Definitely recommended!", "Date": "November 18, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "2.0", "Value": "5", "Sleep Quality": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Oslo", "Title": "“A decent budget hotel for Venice!”", "Author": "d1gital", "ReviewID": "UR85288930", "Content": "We stayed in this hotel for three days during a private trip to Venice. The hotel is located not in Venice but on the island Lido. The location of the hotel is excellent. Because it is not in the Venice old town, the prices are decent, and it is about 2 minute walk from the water tram stop. In the neighborhood there is a post office and a Billa market, so budget travellers may buy cheap food there. The hotel itself is clean, has an elevator, but the rooms are unfortunately small. The main issue are the bathrooms which are equipped okay, but the shower faucet is not movable, which is a big issue for some people. The bed was comfortable, but was taking up most of the room, which made the room even smaller. A wall-mounted TV had around 20 channels, some of them in English. The hotel does provide an Internet connection, but you have to pay to access the network. The breakfasts are standard continental type, nothing fancy. The interesting thing about them are the waiters who can be asked to prepare different types of coffee, something they happily do. The service in the hotel is very good. We had a large number of questions, every one of which was answered expertly at the reception. We were correctly guided and helped, even though our questions where sometimes very specific. The staff speak very good English, which is not always the case in souther European hotels. Generally, I would recommend this hotel for budget travels or city-breakers, however be aware that it is closed for every winter (from late October till April), so no stays are possible then.", "Date": "October 29, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Bognor Regis, United Kingdom", "Title": "“GOOD VALUE HOTEL,FRIENDLY HELPFUL STAFF”", "Author": "hansoncats", "ReviewID": "UR84818631", "Content": "Stayed 3 nights-Nice welcome-Rooms clean but basic-Stafff spoke good english and were helpful.Hotel 150 yards from WATER BUS TERMINAL-Run every 10 MINS or so-We bought the 72 hour pass which proved very convenient although no one ever checked tickets-[must validate before travelling-]Visited islands of Burano/Torcello and Murano-Lovely places ROXY restaurant up from hotel on lhs very good Continental breakfast good-10 euro,15euro for +eggs/fruit/yogurt-but cheaper in nearby cafes/snack bar next door. Cheapest way to get from Airport is via bus no 5 and then water bus no 52 or no 1 which is slower but takes you along Grand Canal and is great way of seeing Venice for the first time", "Date": "October 25, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Helsinki, Finland", "Title": "“Very nice hotel”", "Author": "sakari1", "ReviewID": "UR84736893", "Content": "We (a couple plus 60 ) visited Venice during the extended weekend from Friday morning to Monday evening and at the middle of October. We enjoyed our vacation very much. The ocation of the hotel is great almost all the boats from the City come there so you do not have to care in which boat you jump. They all take you to the Hotel, there is under 5 minutes walk there. You can even see the hotel from the waterbus stop. The hotel was cleaned up every day, there was also nice bathroom. The staff was very nice and helpful. We had no problems what so ever. When we had left the hotel at the airport I noticed that I had forgotten my camera somewhere. I called to the hotel and they had found it in the lobby. They sended it back to us in Finland. So we were very pleased and if possible we will go back for longer period of time", "Date": "October 25, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Moscow, Russia", "Title": "“Good value for money”", "Author": "AnnaRomanova", "ReviewID": "UR84410697", "Content": "A very nice and comfortable hotel, located just at vaporetto station. The staff is helpful and kind. Hope to stay there once again!", "Date": "October 22, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "5", "Sleep Quality": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Florianopolis, Brasil", "Title": "“Good value and location, clean and confortable room”", "Author": "Virginia_Brasil", "ReviewID": "UR84263963", "Content": "The location was great: just 1 min walking until the vaporetto station and the price was reasonable and much cheaper than the hotels located near the Grand Canal. The room was clean and confortable. There was a bathtube, which was relaxing after walking the whole day. The staff at the reception was polite, BUT I have to say that I really disliked the treatment one day during the breakfast. It was a little past 10 am (note that the breakfast is until 10:30 pm!), but they started to clear the table, colecting the food and turned off the lights. It was very unpleasant. But demanding this type of kindness maybe is too much in Italy, where they seem not to have good manners classes at school... a shame.", "Date": "October 20, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Geneva, Switzerland", "Title": "“Great !”", "Author": "Aragorn53", "ReviewID": "UR84229510", "Content": "Nice hotel, clean, 1min away from the ferry, great staff and very good price. Would easily recommend it to my friends.", "Date": "October 20, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Trondheim, Norway", "Title": "“We would love to come back”", "Author": "Paal_Kielland", "ReviewID": "UR84183138", "Content": "Me and the Mrs stayed for 3 nights. The hotel was perfect for us, good location, easy to find (important if you don't know the city!), good breakfast, the room and bathroom was large enough and the hotel service was excellent. Even if the hotel is situated on Lido and not in the main city, the location is very good. Only 10-12 minutes with the vaporetto to St. Marco. (Maybe 15 min). We loved to stay there and would like to come back some day. We had a Superior room", "Date": "October 20, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Location": "3", "Rooms": "3"}, "AuthorLocation": "", "Title": "“Clean but small room. Bathroom extremly...”", "Author": "A TripAdvisor Member", "ReviewID": "UR83631044", "Content": "Clean but small room. Bathroom extremly small but the shower was a good size. Staff very helpfull and friendly. Good location to the ferry stop only 1 min walk. Advisable to get the day pass. We stayed for 3 days and got the 3 day ferry pass for 33 euro well worth it as used the ferry a lot. Otherwise the ferry would be 6.50 per trip. Overall a very nice friendly and clean hotel.", "Date": "October 15, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "South African in the UK", "Title": "“Perfect location to explore Venice from! Wouldn't consider staying anywhere else”", "Author": "SATravelbug2010", "ReviewID": "UR78260192", "Content": "A lovely hotel! It is perfectly located on the island of Lido, a few meters away from the vaporetto stop. Do not worry about the hotel being located off the mainland, it is so quick and easy to get to places like St. Mark's Square (only 10 minutes by vaporetto), the Grand Canal, the islands of Murano and Burano etc. It is also easy to get to and from Marco Polo airport. Purchasing a VENICE card, (offers unlimited travel over a specified period) is a very affordable way of getting around. The hotel is perfect to explore Venice from. It is clean, newly furnished and the staff are excellent! We arrived at 3am after serious delays and the concierge was so friendly and helpful. All the staff were welcoming and offered great advice. The island of Lido is a pleasure to stay on. It is a welcome break from the crowds on the mainland. I would highly recommend eating on Lido- the restuarants far exceed the 'tourist' restuarants on the mainland. They offer good quality food at reasonable prices in a lovely setting. I can only recommend Hotel Helvetia very highly. It is a great hotel at an affordable price.", "Date": "September 4, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "2", "Overall": "2.0", "Value": "1", "Sleep Quality": "2", "Rooms": "1", "Location": "2"}, "AuthorLocation": "Atlanta, Georgia", "Title": "“Smallest dingy room ever, nickel n dime you”", "Author": "hunnypuppy", "ReviewID": "UR77164677", "Content": "Tinyiest freaking room - got lucky with a top floor which was slight bigger bathroom and a better view then my brother was wanted to jump out of the window (if he could fit through it). The service was terrible, located on a remote island can only get there by public ferries. The hotel is very close to the ferry which was good but there are no decent place to eat nearby. all touristy crap food.", "Date": "August 27, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Helsinki", "Title": "“Superb price for a quality stay”", "Author": "jeespox", "ReviewID": "UR76645949", "Content": "We stayed three nights in a superior room with lagoon view. The room was nice, spacious and very clean. The place wasn't a kind of a design hotel, but the hotel looked nice inside. Our room was quite basic, but it was much better than I expected for the price paid. We had a view over the lagoon, but it was a straight view only from the room's toilette. To see the San Marc's square from the room you really had to lean out of the window. Towels were changed every day and even the bathroom tiles were spotless. The service was very polite, and we got really good service even though we are silent and a bit stiff Finns. The breakfast was good and plentiful by Italian standards, not just a croissant with coffee. There were ham, cheese, marmalades, yoghurt, tee, coffee, cereals, different breads, cakes, croissants, orange juice and apples. Also good rye bread was on offer, which was quite a surprise. The orange juice was really bad, but everything else tasted good. We would have loved to have some more of fresh vegetables or fruit in the table. The breakfast was really nice, but a bit basic. The neighbouring church starts to ring it's bells quite early, at 9 in the morning, but I wasn't bothered by that. I assume that you can avoid a bit of that and the street noise by taking a room which doesn't have windows facing to the street. The location of the hotel is really near the main vaporetto stop in Lido, it's really easy to get in there. Overall, our stay was great. Everything worked well, room and staff was awesome. Many thanks to Hotel Helvetia.", "Date": "August 24, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "London, UK", "Title": "“Well located and nice hotel”", "Author": "WorldHopperEU", "ReviewID": "UR76642127", "Content": "Helvetia is a family-run hotel very well located both for Venice visitors as well as beach activities. It is a no-frills and authentic traditional Italian hotel, with a nice vintage touch. Rooms and bathrooms are spacious and clean, equipped with A/C wich is essential in summer months. The staff is friendly and English and French proficient. You get this personal touch you blatantly miss in multinational chains. Prices are particularly attractive, given the extremely good location of the hotel. Rooms on street side may be noisy (windows are single-glazed not isolated), so ask for a courtyard room if you want quiteness, but then you'll miss the view on the laguna and the unique Venice skyline. Breakfast is served in a nice backyard, and meets all standards. Some fresh fruit (as well as not-sweetened-organe juice) would make it even better - their absence is surprising. The hotel also offers wireless Internet access for 12 euros for 20 hours - metered, meaning that this should be enough for several days of use. The hotel is ideally located on the main streets, with tens of shopping and eating places to choose from, and walking distance to both venice boats and a nice white sanded beach. I would recommend this hotel for its good location, cleanliness and competitive prices, which makes it a good base to both visit Venice and enjoy its beaches.", "Date": "August 24, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Tarnow", "Title": "“Fantastic place, good value”", "Author": "Pipog", "ReviewID": "UR74583006", "Content": "Fantastic location - 1 min. from vaporetto stop and 10 min. from the beach at main street with many bars and restaurant. Very nice breakfast served in rhe garden. Room cleaned every day - new bath towels - 3 or 4 per person changed every day. Airconditioned rooms. Very nice and frendly staff.", "Date": "August 10, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Location": "5", "Rooms": "4"}, "AuthorLocation": "England", "Title": "“Ideal location”", "Author": "Christe", "ReviewID": "UR72028276", "Content": "Fantastic location. On the main street, minutes from the vaparetto. Breakfast is ample and is served outside in the courtyard, which is lovely and cool despite the scorching weather. Had a room with a balcony which was large considering the price we paid. Spent all day on the private beach which was quiet compared to the public beach. Just one last thing - all the staff were friendly and helpful, which made a refreshing change.", "Date": "July 23, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Boca Raton, Florida", "Title": "“wonderful hotel”", "Author": "lorimu1", "ReviewID": "UR71383914", "Content": "The hotel was 3 minutes away from the vaporetto stops so this made it very covenient. The rooms and the bathrooms were large and comfortable. The staff was nice and helpful. Breakfast in the garden was nice. Plenty to eat.", "Date": "July 18, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "2.0", "Value": "3", "Sleep Quality": "1", "Rooms": "1", "Location": "5"}, "AuthorLocation": "Long Island, NY", "Title": "“Very disappointed.”", "Author": "AvgMom2", "ReviewID": "UR70066396", "Content": "We stayed here for three nights in June. We are a family of four and I made a reservation for a superior quadruple room. When one sees the word â€œsuperiorâ€�, one assume the room would be better than average. Our room indeed had four beds (with two twins pushed together to create one queen bed), but they were squeezed into a little space that left very little legroom to walk around. The walls were paper thin. We were on the second floor and could hear every noise coming from the street very loudly and very clearly. It was also very difficult to use the room key. Besides being ridiculously heavy, you need to use it to lock from inside the room. (There was no security bolt from inside.) The bathroom was large but had no ventilation. The toilet seat wasnâ€™t secured properly, so every time you sit, it moved. Of course, not everything was bad for staying at the hotel. Some positive points are: 1) it was affordable, 2) it was near vaporetto, and 3) they had a wonderful breakfast, and 4) the housekeeper(s) was very thorough in cleaning the room every day. Would we be staying here again? Probably not. The hotel was affordable, but more than anything else, we need a good night sleepâ€¦and that was something we didnâ€™t have.", "Date": "July 7, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Brentwood, United Kingdom", "Title": "“Good Location near to vaporetto stop”", "Author": "purlywhirly", "ReviewID": "UR69113865", "Content": "Friendly and attentive staff, always willing to help. We booked a superior room and had a bowl of fresh fruit and mineral water every day - very welcome when returning from a hard day's sightseeing! The fruit disappeared after the first day, but as soon as we told them that it was meant to be every day, they were very apologetic and we immediately got a fresh supply, and thereafter every day. Bathroom was very modern and buffet breakfast as you would expect - plentiful but no hot food except scrambled egg if you were early enough. The breakfast went on to 10.30 a.m. so never any rush, and eating out in the patio courtyard was lovely. Very convenient for the varporetto stop, beach and various restaurants, many of which had a 2 course tourist menu at a reasonable cost. Wine also a lot cheaper than in the restaurants in main Venice. We had a very pleasant stay and could find no bad points.", "Date": "June 29, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Yorkshire", "Title": "“another lovely stay”", "Author": "Pauline777Yorkshire", "ReviewID": "UR69110269", "Content": "Another lovely stay at the Hotel Helvetia, on Venice Lido. Much nicer than staying in the crowds, but only 10 minutes across the lagoon to St. Mark's Square. It's like 2 holidays in one. The staff at the Helvetia are so friendly, and always have time to answer your questions. The place is immaculate, and it was delightful having breakfast in the garden this time. Looking forward to my next visit!", "Date": "June 29, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Perth", "Title": "“Great choice for short stay in Venice”", "Author": "BoonyPerth", "ReviewID": "UR65543942", "Content": "My wife and I really enjoyed 2 days pre and post cruise at this Hotel. The location provides a quiet and relaxed base and easy access to the tourist hot spots. Lido and the area adjacent to the hotel is clean, safe and has a relaxed,seaside feel. The staff at the Hotel were friendly,helpful and welcoming. Our room on the 4th floor was clean, well maintained and comfortable. The hotel has a quaint, old world charm and the staff seemed justifiably proud of its 3 star status. Breakfast was provided in a lovely dining room and again the service was friendly and warm. Although not a huge selection there was always plenty to eat and it was fresh and nicely presented. We would certainly recommend this friendly hotel to those looking for a good value, comfortable option out of the hussle and bustle but with good access.", "Date": "May 28, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "vancouver, canada", "Title": "“Comfortable hotel away from the crowds”", "Author": "cutiegirl", "ReviewID": "UR65413571", "Content": "My partner and I stayed here for 4 nights in May. We booked a prepaid non-refundable double room online through their website for about 75â‚¬ per night including breakfast. Our reason for visiting Venice was to go kayaking and our trips left from the Lido so we only searched for hotels on that island. Helevtia's prices were very competitive and the included breakfast made it one of the least expensive options. We were a day late arriving because we missed our train from Paris, so arrived at the hotel around 10:30AM. We were offered breakfast (which is served until 10:30AM in the dining room) before checking in. The breakfast was very good; continental style with eggs, cold cuts, cheese, preserves, fruit, yoghurt, cereal, juices, tea and coffee... The dining room staff were very friendly and the selection of foods was good. Our room was on the second floor. It was small but comfortable, the bathroom was quite large with shower and bidet. Room was quiet, especially with patio door and shutters closed. The front desk staff were helpful, giving us some restaurant recommendations and transit info. We got to know them quite well as you must leave your room key at the desk when you go out! The location is great, right on the main street (it's not a very busy street!) and only about 2 blocks from the vaporetto stops. I would recommend, especially if you are able to book in advance and pre-pay.", "Date": "May 26, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Darlington", "Title": "“A Great Location”", "Author": "Bubbles1612", "ReviewID": "UR63404437", "Content": "My husband and myself went to Venice with our friends for 3 nights. Having looked at the prices of hotels on Venice Island we decided on the cheaper option of Venice Lido - what a great decision. The hotel is literally a 2 minute walk from the boat stop, just across the road. The hotel staff were very friendly on arrival and showed us directly to our rooms. Our room was small but had a goodl view over to St Marks Square (we were on the 4th floor, room 57). The room was clean and tidy, just what you need for a short break. The beach is only a 5-10 minute walk from the hotel, at the other end of the street. As it was early May when we visited it was quiet but I bet it would be very busy at the height of the season. The hotel is situated on the main street street with plenty of bars and restaurants close by but still quiet on an evening. The nightlife was limited, bars closing around 11 p.m. but we did find a bar that was open until 2 a.m. (not that we stayed that late). Staying on the Lido was an excellent decision as during the day you could get a ferry over to the hustle and bustle of Venice, packed with tourists and on an evening relax on the quiet Lido. I would recommend this hotel to anyone wanting to visit Venice - well worth the money - not 5 Star but it has everything needed for a City Break. The breakfast was included and consisted of ham, cheese, scrambled eggs and the usual breads and pastries. The orange juice is delicious. A great way to start the day. Be prepared - take plenty of money as Venice is very very expensive - but the sights are worth it.", "Date": "May 6, 2010"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "", "Title": "“Nice and clean ...”", "Author": "surrealistka", "ReviewID": "UR62233370", "Content": "Very friendly place on the island of Lido (Venice night shelters). Ideal for individual tourists. Friendly and helpful staff. Rooms very clean and functional. Good breakfast. The downside is very little parking. Generally OK. I recommend this hotel!", "Date": "April 23, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "2", "Overall": "1.0", "Value": "1", "Location": "3", "Rooms": "2"}, "AuthorLocation": "Bristol", "Title": "“Awful Awful Awful”", "Author": "waveslave1080", "ReviewID": "UR49168931", "Content": "We booked online at 40 Euro a night for a double room. When we arrived they said the CC had been declined. They were extremely rude, even after we discovered they had entered the expiry date incorrectly. They only had a more expensive room available (75 euro) and as it was late we had no option than to stay. The new room was actually two single beds not a double as they had stated. When I asked them why they hadn't called me (as I had placed my phone number on the booking and even left a message saying we were on our way and would arrive at 9pm) the very rude man said \"We don't waste money on phone calls to declined credit cards.\" I was disgusted by their contempt of customers or potential customers. If the service hadn't been so bad and the room a double as stated, it would have been fine... But instead, it was unpleasant. Venice itself was stunning though... just the most beautfiul, haunting city... throw away the map and get lost away from the main tourist throng... I would advise to stay on venice and pay a bit more.", "Date": "November 14, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Location": "4", "Rooms": "4"}, "AuthorLocation": "Toronto", "Title": "“Great price for a good hotel”", "Author": "kclaudia", "ReviewID": "UR48791388", "Content": "I thought the Hotel Helvetia was great value, especially when I later saw the much smaller rooms I had booked in Florence and Rome. I stayed in room 45, a single room on the third floor (there's an elevator) with a comfortable double bed, desk, armoire, and luggage stand/coat rack. The bathroom with shower was small but clean and modern. The hotel's laundry service is expensive but came in handy for getting my jeans washed and pressed (which cost 6 euros). The front desk staff were friendly and helpful, especially the two women who were there in the daytime. The breakfast buffet is generous, and when I had to leave before 7:00 a.m. on my last day, the desk arranged for me to be able to grab a quick cappuccino and roll before going. The hotel is a few steps from the vaporetto stop, and boats come by frequently. On the main street the hotel faces, I had no luck finding a decent restaurant that wasn't a tourist trap. I had better luck going down one of the side streets, where more of the locals eat and shop, or you can find more options in the main part of Venice and then take the boat back to Lido. Everything else is very handy to the hotel--the supermarket up the street a bit, the post office around the back, and tobacco stands across the street selling stamps and everything else. All in all, I really liked the hotel and the location.", "Date": "November 8, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "3.0", "Value": "4", "Location": "4", "Rooms": "3"}, "AuthorLocation": "Wales", "Title": "“Clean, compact and convenient.”", "Author": "Crochetcymru", "ReviewID": "UR47159060", "Content": "The Hotel Helvetia is just a short distance from the water bus stop so it is easy to reach St Marks Square. Our room, number 33, was very compact. There was very little room to move in the bathroom and the toilet was only inches from the wall. The walls seemed very thin as we could hear lots of sounds from the next room. The room was very clean and fine for a short stay. Breakfast was adequate. I agree with previous comments about the coffee, I couldn't drink it. I would recommend the hotel as a good value base to anyone wanting to explore Venice.", "Date": "October 18, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Location": "4", "Rooms": "3"}, "AuthorLocation": "UK", "Title": "“Nice hotel-terrible coffee”", "Author": "AnonUK_9", "ReviewID": "UR45603489", "Content": "The rooms are old fashioned, but clean. There was air conditioning but it hadn't been switched on before we arrived so the room was alittle stuffy. The bathroom was large- which is unusal for hotel bathrooms- and the shower was decent enough to wake you up in the morning. Basic TV set - the only english channel was CNN. The staff were friendly and helpful. The room we stayed in was on the street side and was therefore occasionally noisey. Breakfast was a choice of ham, cheese, jam, tea, coffee (which was really really awful) and orange juice. The hotel is in a perfect location near the vaperetto stop and is an Idea getaway from the narrow streets of Venice. There are a few decent restaurants close to the hotel and the main street is nice to have a post-dinner stroll on. Considering the price (and the average cost of hotels in Venice) the hotel offers value for money and does what it says on the tin.", "Date": "October 1, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Location": "4", "Rooms": "4"}, "AuthorLocation": "Toronto", "Title": "“Great break from the main island!”", "Author": "Exchangers", "ReviewID": "UR39776945", "Content": "The rooms at this hotel were adequate. Free breakfast. Very helpful staff. Close to the water taxis. I would definitely recommend staying on this island. It's a lot quieter and a nice break. The beach is also great. Not crowded at all. We had a great time!", "Date": "September 4, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "4", "Location": "5", "Rooms": "3"}, "AuthorLocation": "London, UK", "Title": "“Good hotel - beware of fine print though”", "Author": "WorldHopperEU", "ReviewID": "UR39738209", "Content": "We stayed in a 4 bedded room with our children. The rooms (and in fact the hotel as a whole) are quite old-stylish, but clean. Rooms are air conditioned, which is essential in summer months. Bathroom is ok and clean. Minimum service (no minibar, no room-service, basic TV set - remember to ask for the remote when you check in!), but English proficient and relatively friendly and helpful staff. The room we stayed in was on the street side and was therefore quite noisy (windows vibrate with busses/truck pass by, and voices/noise from next door's bar terrace) - I was advised do ask for a \"quite room\" next time. A nice backyard is used as breakfast space. Buffet offers relatively limited choice (ham, cheese, jam, tea, coffee and -bad- orange juice as well as some danish) Be aware that yoghurt and fruit are charged extra, depending on your room rate! (we had booked a promotional web-price - and they charged us 2 euros per yoghurt!!) It also offers wireless Internet access only at the outrageous price of 12 euros per day.. The hotel is ideally located on the main streets, with tens of shopping and eating places to choose from, and walking distance to both venice boats (be aware that it will cost you 7 eur per ticket!) and to the sea - side. To sum up, I would recommend this (\"no frills\") hotel for its good location, cleanliness and competitive prices, which makes it a good base to both visit Venice and enjoy its beaches, but not if you are looking for a romantic and quite get-away.", "Date": "September 4, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Wiltshire", "Title": "“A relaxing and friendly atmosphere, professional and courteous staff”", "Author": "WiltshireKenny", "ReviewID": "UR38569505", "Content": "This Hotel is on the Lido, which suited us, being away from the hustle and bustle of the main island. This is reflected in the reasonably priced rooms. The air conditioned reception area has a lounge and small bar. Our room was very comfortable, with both air conditioning and ceiling fan. The bathroom was a good size, complete with bidet and a decent shower. The continental breakfast buffet was consistently good, the staff always attentive. We ate breakfast outside in the courtyard garden. Leaving the Hotel it is only 5 minutes walk to the vaperetto - a boat ride of about 15 minutes to the main island. A weekly ticket will cover you for all destinations and costs about 50 euros. After long days out sightseeing we returned to the Hotel to freshen up. Looking for somewhere to eat in the evening, leave the Hotel and turn right on to the main street, where you will find numerous good quality restaurants. To sum up, the Hotel Helvetia was a pleasant and comfortable experience.", "Date": "August 23, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "4"}, "AuthorLocation": "UK", "Title": "“A fantastic hotel in a super location.”", "Author": "sunshinegirl67", "ReviewID": "UR38370172", "Content": "The location of the hotel is great. Situated on the main street of the Lido with bars, cafes, ice cream stalls and shops on the doorstep. Two minutes to the vaporetto stop for boats to Venice (10-15 mins away) and a ten minute saunter to the beach. The beaches are free if you just want to put a towel down on the sand but for 13 Euros you can hire a lounger and umbrella for the day on the public beach at the top of the road. The hotel has an old fashioned charm but is spotlessly clean. My room was scrubbed to a shine when I returned every evening. The room was small and the bathroom tiny but it had everything I needed. Air con, fan, TV and hairdryer. Breakfast was much better than any other hotel I have stayed in in Italy. As a single woman holiday-maker, the hotel and location was great but it would also be perfect for families and couples. I asked for a quiet room and had a room at the rear. No nice view, but it was quiet. I would definitely recommend this hotel especially as it only cost Â£32 a night!", "Date": "August 21, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Hertfordshire", "Title": "“Nice Hotel, ideal location”", "Author": "cazrox", "ReviewID": "UR37343052", "Content": "I checked reviews for this Hotel before booking and was generally pleased with what I read so I went ahead and booked our family holiday. However, after booking I was starting to feel a little apprehensive when I read later reviews. How unneccessary!!!!!!! The hotel is perfectly based for anyone wishing to visit Venice and the lagoon islands. It is a 2 minute walk from the hotel to the vaporetto stop and then 10 minutes to San Marco. Route number 1 (which goes along the Grand Canal - stunning at night!) runs every 10 minutes up until 9pm and then approx every 20 minutes thereafter. Lido beach is about a 5-10 minute walk and was very clean (although watch out for the jellyfish during the hot weather as my daughter learnt to her detriment!!!) The hotel was extremely clean. The room was cleaned EVERY day and the bedding and towels were also changed daily. The room was a lovely size considering there were 4 beds and although it was facing the main road, we had a stunning view of St Marks from our bedroom window which more than made up for the noise!! Breakfast was very basic but adequate - it was a typical continental buffet of cold meats, cheese and croissants. It has a lovely courtyard where we had breakfast most mornings. ALL the staff were friendly, helpful, and polite. My family and I had a great time and can't fault our experience with this Hotel. I would recommend it to anyone.", "Date": "August 11, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Location": "5", "Rooms": "3"}, "AuthorLocation": "London", "Title": "“Exactly what we wanted”", "Author": "changemaker", "ReviewID": "UR37138511", "Content": "It's very clean, the staff are really, really helpful and it's got a nice spacious ground floor lobby/bar/restaurant/garden - much better than three stars I've been in on the Venice mainland. My friend and I were looking for a clean, plesant hotel that was really well placed for exploring Venice and the outlying islands and for doing the Biennale. It's just by the waterbus ferry with direct routes to St Mark's (10 mins), the Giardini (5 mins), the station, the airport and the islands as well as having a good supermarket, bank, shops and restaurants a minute's walk away and the beach 5 mins away. Evening views from the Lido across to Venice as the sun sets are stunning (not from the hotel itself but close). As a midprice option it's very good. Our rooms were small, it's true, but with spotless bathrooms and good air con so perfectly good as a base.", "Date": "August 9, 2009"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "london", "Title": "“Nice hotel on the Lido”", "Author": "docer", "ReviewID": "UR32708619", "Content": "Definitly a good choice if you do not want to stay in the centre of venice. Lido is Quiter and has its own charm. I am not sure if one can get better deals for the same price but the hotel is definitly a good option if you are visiting venice for 2-3days. The ride to lido on the waterbuses is like a tourist boat ride in itself. Once you reach Lido the hotel is only 1minutes walk on the main road ( which is hidden behind a roundabout)", "Date": "June 19, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Business service (e.g., internet access)": "3", "Check in / front desk": "5", "Overall": "5.0", "Value": "4", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Toronto, Canada", "Title": "“Great beach location”", "Author": "GlobalTCK", "ReviewID": "UR32515748", "Content": "This is a great location. It is next to the beach away from core of Venice. To get to St. Marco Square - take the ferry that runs 24 hours a day and only takes 15 minutes.", "Date": "June 17, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "2", "Overall": "3.0", "Value": "2", "Location": "3", "Rooms": "2"}, "AuthorLocation": "London", "Title": "“Normal, not that great, think we shud have got it cheaper”", "Author": "Manoj-Manju", "ReviewID": "UR31500365", "Content": "The hotel is ok ok, not that great... we got room 14. I noticed there wasn't any room numbered 13. They said, you would hardly find room 13 in Venice hotels. Anyway, the room was too small, a bit stinking as if the carpets were very old. But I am told that most of the hotels in Venice have that little bit of stinking smell bcoz of it being a water city / island. The area (i.e. Lido) is superb and safe. It's about 10 mins in water bus from the Venice city centre i.e. St Mark Square. I enjoyed being on Lido especially in evenings when you see all these Italian restaurants on the same street where Hotel Helvetia is. The staff was good. Limited choice for breakfast - no egg / omelette, even if you wanted to pay (not sure if that's always the case). The contitental breakfast included only 1 or 2 types of cereals, milk, yoghurt, some crossiants, cheese and i think only 1 type of juice (which always runs out if you are late) and some cake. Anyway, the bottom line is that we paid EUR 100 per night for such a small room. The room is worth EUR 60 if I see as per UK standards... unless Venice is expensive as compared to UK. So I would say if you can get rooms for about EUR 60-80, then better... not worth EUR 100.", "Date": "June 3, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Location": "3", "Rooms": "4"}, "AuthorLocation": "Edinburgh", "Title": "“Nice, 3 star hotel on Lido near Venice”", "Author": "acb5870", "ReviewID": "UR25212810", "Content": "We chose this hotel as had stayed in Venice itself a couple of times before and decided to stay on Lido for a change and because a lot cheaper. The Helvetia was pretty good and no complaints at all. It was a budget option for us compared to normal but it was nice to see Lido where life is a bit slower than Venice - yet St Mark's vaporetto stop is reached in about 10 minutes from Lido so no problems there. The staff were accommodating when required, the room was clean and there was cafes and restaurants about although we spent most of our time in Venice itself. If you can or are willing to stay outwith Venice island then this is a great budget option.", "Date": "February 26, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Business service (e.g., internet access)": "4", "Check in / front desk": "4", "Overall": "5.0", "Value": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "New Zealand", "Title": "“Great alternative to St Mark's Square area”", "Author": "srh10", "ReviewID": "UR23655755", "Content": "This hotel was excellent, great location on the lido, only 10-15 miutes away by vaporetto to the main 'touristy' part of Venice, although the Lido itself was also nice. Cheaper restaurants and shops and fantastic, frequent vaporetto service. The hotel was dated but charming, good value for money and good breakfast. Have recommended to others.", "Date": "January 18, 2009"}], "HotelInfo": {"Name": "Hotel Helvetia", "HotelURL": "/ShowUserReviews-g187870-d238507-Reviews-Hotel_Helvetia-Venice_Veneto.html", "Price": "$92 - $211*", "Address": "<address><span rel=\"v:address\"><span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">Gran Viale 4</span> | <span class=\"extended-address\">Venice Lido</span>, <span class=\"locality\"><span property=\"v:postal-code\">30126</span> <span property=\"v:locality\">Venice</span></span>, <span class=\"country-name\" property=\"v:country-name\">Italy</span> </span></span></address>", "HotelID": "238507", "ImgURL": "http://media-cdn.tripadvisor.com/media/photo-s/01/a9/b6/ea/hotel-helvetia.jpg"}}