{"Reviews": [{"Ratings": {"Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Bucharest", "Title": "“Fair price, clean rooms, good location”", "Author": "mnegrea", "ReviewID": "UR125668764", "Content": "Good choice if you want: - a place to sleep after a long day of walking - sightseeing - shopping in Madrid - simple, small but clean rooms Look somewhere else for: - a big breakfast - large rooms - a place right into the touristic heart of Madrid (still, in Don Diego you'll be at 5 minutes from metro Velazquez, 10-15 minutes from Parque del Retiro and maybe 30 minutes from Plaza Colon or Plaza Cibelles; so, it really depends on how much you can or are willing to walk...)", "Date": "March 5, 2012"}, {"Ratings": {"Location": "3", "Overall": "4.0", "Value": "4", "Service": "3", "Rooms": "3"}, "AuthorLocation": "Helsinki, Finland", "Title": "“Good value”", "Author": "Maril_11", "ReviewID": "UR118269107", "Content": "This is a good choice for a person appreciating tranquility, not the most central location. Still there are a lot of shops and some restaurants in the area. Close to subway. The hotel was not modern but ok. My room at the end of the corridor was rather quiet, although the walls are thin. It was rather small but with all the basic furniture.", "Date": "September 18, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Malmo, Sweden", "Title": "“Good quality/price”", "Author": "minilie", "ReviewID": "UR84089524", "Content": "I believe for the price and the location, this hotel is fair. The room was clean. The bathroom didn't have much supplies as shampoo, soap. Towels were small. The view for the room wasn't great as it was in a court where the building in front was not in good condition. We were disappointed a bit with the service as we had requested a non-smoking room and the one we got had a very strong smell of cigarette. After negotiating with the front desk man, we managed to get another one but that was after he said that it was impossible that someone had smoke in there as it would have start the emergency alarm...", "Date": "October 19, 2010"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Thousand Oaks, California", "Title": "“Pay more for something better”", "Author": "mwolfe82", "ReviewID": "UR83877182", "Content": "We were on a budget. The lobby is on the fifth floor and our room was on the 7th floor. It was stagnant in our room with no air control. They were doing construction which was loud and carried on early morning until late afternoon without apology posted or acknowledged. The hotel is located near the main strip of high-end shopping. We ate breakfasts nearby at a gourmet place called, Mallorca. This restaurant is an absolute must, it is a foody's dream come true. We did have a bit of a walk to the metro from the hotel. When we arrived to the room, the window shade was hanging down crooked. When we tried to lift it gently, it broke and came off. I explained this to the man at reception who repeatedly accused me of breaking it. It was a morning ruiner b/c I had assumed by his response that I would be forced to pay for the Hotels previously broken window shade. I am a strong female, but I'm not capable of bare-handed ripping that thing down from the window mount. When we left, there was no mention of it. I would not stay again. Oh and while we were in Madrid we ate great Tapas at Mercado de la riena. Got drinks at famous bar Del Diego (90 euro) for 8 drinks-whoa. Had a blast at Museo Cipote, also famous bar. Gran Via, shopping and central area is best for food and being out and about.", "Date": "October 17, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Sao Paulo, Brazil", "Title": "“I would definitely stay there again !”", "Author": "vhaynes", "ReviewID": "UR26982125", "Content": "My daughter Bruna got married in Madrid in March and a large group of our friends stayed at the Hostal Don Diego. We were all very happy, the rooms were clean and confortable, the hotel has a wonderful location and all-in-all we were extremely satisfied. My only suggestions for the hotel are to extend the wireless to all rooms and include orange juice for breakfast.", "Date": "March 28, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Business service (e.g., internet access)": "3", "Check in / front desk": "3", "Overall": "4.0", "Value": "5", "Rooms": "3", "Location": "5"}, "AuthorLocation": "brazil", "Title": "“good, beautiful and cheap”", "Author": "tadeu", "ReviewID": "UR15622462", "Content": "Excellent location. Very clean and comfortable. Customer very attentive. I recomend.", "Date": "May 3, 2008"}, {"Ratings": {"Service": "1", "Cleanliness": "2", "Business service (e.g., internet access)": "1", "Check in / front desk": "4", "Overall": "2.0", "Value": "3", "Rooms": "1", "Location": "4"}, "AuthorLocation": "NOLA", "Title": "“Don Diego Good location, average hotel.”", "Author": "Mytravelreview68", "ReviewID": "UR11173875", "Content": "Hotel is located on Velazquez in Barrio Salamanca. Very good location for business. If you stay here reserve a double at least the singles are unbearable, too small. I stayed here a few times during the past couple of years. In the winter it can be 75 degrees outside in Madrid, but they keep the heat on in the hotel. They will not turn on the air conditioning. Hotel is average clean and has a cleanliness issue. They do a good business with older Spanish people from outside Madrid. The younger crowd goes to more updated hotels for about 30% less. The staff is not helpful. There is no security after 10 or 11 pm your on you re own. The hotel is on the 5th floor of the building. Apartments and offices downstairs. The cable CNN etc rarely work at all. I haven t been back in a while after the cleaning got worse, TV didn t work, and air conditioning was turned off in winter. FOr 70-80 euros you get a good NH hotel around the corner and a good diverse business and tourist crowd. Don Diego is where the people in Madrid send their grandparents or inlaws they don t want to stay at their own houses. A geriatric ward on the weekend.", "Date": "November 30, 2007"}, {"Ratings": {"Cleanliness": "4", "Overall": "2.0", "Value": "4", "Service": "3", "Rooms": "2"}, "AuthorLocation": "Edinburgh", "Title": "“Good value, but thin walls”", "Author": "AlMcDonald", "ReviewID": "UR5045528", "Content": "The DonDiego is in the great non-tourist area of Salamanca. Streets very safe and bustling with every age of Spaniard until late. Not a trace of the crowds of grungy tourists filling GranVia. The hotel was clean and very good value. However, the walls were the thinnest I have encountered in Spain. The room window was into an inner light shaft, which meant no traffic noise, but made the room dark. We were put on a smoking floor against our preference, but there was little offensive odour. Nearby restaurant O'Caldino was a great slice of Spanish neighbourhood life with fine seafood and good house Rioja. Not a word of English and they don't know to speak slowly for the tourists, but if you don't want to try spanish, they do have a menu in pictures. There is a wonderful market in the centre of the block to the west, which explains why there are few food shops in the area. Best cafes are a few blocks west, below Plaza Colon on Recoletos. And the hot chocolate at San Gines is the best ever. Day trip to Toledo on AVE train. Very clean, fast and modern. Note that the AVE has its own ticket office in Atocha station. 13.6 euros return. Had trouble with AeroCity in both directions. 40 minutes late getting in, so OK, no car waiting, but it took several calls and lots of telephone music to get through to them. Their car did come 15 minutes after getting a reply. Unmarked MPV. Going back we were on the street 15 minutes early, waited 30 minutes, called them and were told driver had already been. Promised pickup in 10 minutes. Waited 25, then caught a cab. Cab was 20.4 euros compared to 16 with Aerocity.", "Date": "May 9, 2006"}, {"Ratings": {"Overall": "3.0"}, "AuthorLocation": "washiington dc", "Title": "“okay for price but not fabulous”", "Author": "sunnyjoe_10", "ReviewID": "UR2792042", "Content": "A good value for Madrid but try to avoid a room near the lobby (5th floor)--it's too loud and smoky. Gound floor entry is currently being remodled so it's a bit of a mess--lobby area on 5th floor is nice enough though staff are behind glass partition and not as friendly as in other places we stayed in Spain. We only spoke Spanish with them so not sure how much English is spoken (if that's something you need). The neighborhood felt safe and was less crowded than much of the city but there were few bakeries/coffee shops nearby and only one restaurant. You'd want to eat in another neighborhood before coming in for the night. It's a VERY upscale shopping district but if you can afford to shop there this hotel is probably not up to your standards.", "Date": "October 28, 2004"}, {"Ratings": {"Cleanliness": "5", "Overall": "4.0", "Value": "4", "Service": "4", "Rooms": "4"}, "AuthorLocation": "London, United Kingdom", "Title": "“Relaxed location,good value.”", "Author": "cellista", "ReviewID": "UR2503117", "Content": "My dad and I stayed here 3 nights in late August.In common with previous reviewers,I would recommend it for location,economical price,basic but very acceptable rooms, good bathrooms,pleasant and efficient staff.While we were here, the entrance was being refurbished,but the hotel, which is on the 5th floor, was quiet and clean,with decent air conditioning(very necessary!).The breakfasts looked fine,but we preferred to go to the nearby \"Cafe-Te\" on the corner of Velazquez/Goya,which was also open late for great iced tea after a hard day's sightseeing!If the nearby metro stations hadn't been temporarily closed it would have been perfect for transport (check August closures,especially restaurants!) Would certainly stay at the Don Diego again,it boasts a more genteel and relaxed location than the city centre hotels,but is still within easy reach of everything.", "Date": "August 30, 2004"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "Unknown", "Title": "“Hostal Don Diego”", "Author": "A TripAdvisor Member", "ReviewID": "UR1704625", "Content": "Excellent small hotel. Scrupulously clean. Efficient staff. Comfortable bed, tv, air conditioning, modest price. Highly recommended!", "Date": "March 3, 2004"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Unknown", "Title": "“Great Value and Location”", "Author": "A TripAdvisor Member", "ReviewID": "UR1508773", "Content": "I've stayed at the Don Diego twice in the past year. It is nothing fancy, and the rooms are definitely small, but I give it above-average rating because of the modern bathrooms, which are always welcome in these older hotels. In addition, the location in Salamanca can't be beat at these prices.", "Date": "December 6, 2003"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "Sydney, Australia", "Title": "“Hassle free; great value”", "Author": "Todd83", "ReviewID": "UR1508510", "Content": "Great value in a beautiful area of Madrid. Stayed here for 2 nights but wish it was longer! My room even had a large terrace overlooking the street; it was only 4 degrees outside but I still enjoyed it! A great place in a great city!", "Date": "December 6, 2003"}, {"Ratings": {"Overall": "3.0"}, "AuthorLocation": "Unknown", "Title": "“Good value for money”", "Author": "A TripAdvisor Member", "ReviewID": "UR851437", "Content": "The hotel room is very spacious and clean. The hotel is very near a metro station so commuting is no problem plus it's a walking distance to the shoping centers and Retiro Park. English-speaking staff. Good value for money.", "Date": "February 3, 2003"}], "HotelInfo": {"Name": "Hotel-Residencia Don Diego", "HotelURL": "/ShowUserReviews-g187514-d238657-Reviews-Hotel_Residencia_Don_Diego-Madrid.html", "Price": "$66 and up*", "Address": "<address class=\"addressReset\"><span rel=\"v:address\"><span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">Calle de Velazquez 45</span>, <span class=\"locality\"><span property=\"v:postal-code\">28001</span> <span property=\"v:locality\">Madrid</span></span>, <span class=\"country-name\" property=\"v:country-name\">Spain</span> </span></span></address>", "HotelID": "238657", "ImgURL": "http://media-cdn.tripadvisor.com/media/ProviderThumbnails/dirs/02/61/0261797a747737c16c3c4f99edbec66a5large.jpg"}}