{"Reviews": [{"Content": "Hidden Gem The hotel was recommended by friends who have stayed at the hotel twice. What a find! We stayed one night as we were travelling through to France. It is great for families (we have three kids), large adjoining rooms and a nice, but small pool. Make sure to get a room with a terrace. What a terrific view. The service was impeccable for a family run hotel. The rooms were very clean, the linens beautiful and the grounds lovely. We took a taxi into Florence (a quick 10 min. trip) and it cost us 10 Euro. The only limitation is food. The restaurant is just fine, breakfast is included in the room rate. Overall, very good value for a great, small hotel.", "Date": "Jul 22, 2008", "ReviewID": "UR257854933", "Ratings": {"Service": "5", "Business service": "3", "Cleanliness": "5", "Check in / front desk": "4", "Overall": "5", "Value": "5", "Rooms": "5", "Location": "5"}, "Author": "familytravelswith5"}, {"Content": "Great view of and access to Florence       View of Florence from our room", "Date": "Oct 9, 2007", "ReviewID": "UR154094096", "Ratings": {"Service": "5", "Business service": "3", "Cleanliness": "5", "Check in / front desk": "4", "Overall": "5", "Value": "4", "Rooms": "5", "Location": "5"}, "Author": "LGTripper"}, {"Content": "Crowning Jewel to Florence's Crown We loved our stay at Villa Belvedere! Our room was impeccable in cleanliness, spaciousness and the view! Spectacular! The service was exceptional in every aspect. They lent us maps, umbrellas, and having internet access was a godsend. Also complimentary was the European breakfast that we'd enjoy each morning and then head out for a full day of activity. Its a little outside of town, but for us, the quiet reprieve was wonderful. (One Note: Take Deet. The mosquitos almost ate me alive in the town center.)", "Date": "Oct 20, 2005", "ReviewID": "UR268404265", "Ratings": {"Service": "5", "Business service": "-1", "Cleanliness": "5", "Check in / front desk": "-1", "Overall": "5", "Value": "4", "Rooms": "5", "Location": "-1"}, "Author": "lovedove63"}, {"Content": "Gem in Florence Stayed at this hotel 19 years ago and recently made plan to return to Florence on short notice. Hotel owners and staff were extremely accomodating and cordial. The hotel itself is nicely situated on a hill overlooking the city with views of the Duomo. Pool provides welcome break and quiet from bustle of the city...tennis court too if you have extra evergy. Easy 25 minute walk through Porta Romana over Ponte Vecchio and into city center...just as easy to catch a bus if you wish. Rooms are beautiful with rich wood paneling...many have balconies as well. Great full breakfast.... A wonderful gem.", "Date": "Aug 20, 2005", "ReviewID": "UR675929827", "Ratings": {"Service": "5", "Business service": "-1", "Cleanliness": "5", "Check in / front desk": "-1", "Overall": "5", "Value": "5", "Rooms": "5", "Location": "-1"}, "Author": "Leo15"}, {"Content": "the Best Hotel Villa Belvedere one of the best in Florence. Up in the hills overlooking the Duomo, near the Bobili Gardens. Wonderful rooms, service and family owned. A quiet respite from the busy crowds in town. An easy walk to the Porta Romana.", "Date": "Jun 28, 2005", "ReviewID": "UR639864818", "Ratings": {"Service": "-1", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "5", "Value": "-1", "Rooms": "-1", "Location": "-1"}, "Author": "A TripAdvisor Member"}, {"Content": "A truly delightful haven! This is our second stay, and both times have been charms. The room is lovely and large with fresh flowers, candy, and a good matress and nice linens; the bathroom excellent and sparkling clean, the garden is delightful and the owners who run it are so kind and helpful. The breakfast is delicious and in the stunning dining room overlooking the garden and pool. There's even free internet and parking. For some people it might be a bit far from the city center, but for us,this too was a plus as it gave us a quiet place to rest and get away from the mobs in Florence. It's walking distance from the city center, but we're big walkers--otherwise, it's a short cab trip. Oh yes, and the view is lovely from here.Highly recommend it!", "Date": "Jun 9, 2005", "ReviewID": "UR542961433", "Ratings": {"Service": "5", "Business service": "-1", "Cleanliness": "5", "Check in / front desk": "-1", "Overall": "5", "Value": "5", "Rooms": "5", "Location": "-1"}, "Author": "artlover2"}, {"Content": "Wow! I love this place Just returned from two nights in July. Found this in the guide book and booked in on the internet Just because we were flying out of Florence to go home. This was such a good find!They are running an anniversary special, so it happened to be the lowest priced hotel of our trip. The room was absolutely outsanding. HUGE terrace overlooking the view of Florence. Lovely bathroom king size bed. Pool, garden area, tennis courst, extensive grounds on the hill.Walking into Florence is no problem, walking back up the hill to the hotel might require a cab. Not that far, but you only get those killer views by being on a pretty steep hill.Breakfast was more than adequate .. along with a good buffet, they will prepare eggs to your request.If you go ... please send my regards to Ben ... the St Bernard who hangs around the garden and pool. If you are not a dog lover, don't worry, he won't bother you ... just tell him his American friends are thinking of him.", "Date": "Jul 14, 2004", "ReviewID": "UR872014844", "Ratings": {"Service": "5", "Business service": "-1", "Cleanliness": "5", "Check in / front desk": "-1", "Overall": "5", "Value": "5", "Rooms": "5", "Location": "-1"}, "Author": "674"}, {"Content": "I like it. Very friendly. And the family is running this place. It is on the hill from ten minites drive from the heart of Firenze. Moderate price and warm service. If you have a rent-car. This is a good place to stay in Firenze. Because this place is quiet.", "Date": "Jan 18, 2004", "ReviewID": "UR978397262", "Ratings": {"Service": "-1", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "4", "Value": "-1", "Rooms": "-1", "Location": "-1"}, "Author": "A TripAdvisor Member"}, {"Content": "Amoureux de Florence   showReview(19746831, 'full');", "Date": "Sep 4, 2008", "ReviewID": "UR353667450", "Ratings": {"Service": "5", "Business service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "4", "Value": "5", "Rooms": "5", "Location": "5"}, "Author": "prudente"}], "HotelInfo": {"HotelURL": "http://www.tripadvisor.com/ShowUserReviews-g187895-d238743-r18126852-Villa_Belvedere_Florence-Florence_Tuscany.html", "HotelID": "238743", "Price": "$219"}}