{"Reviews": [{"Ratings": {"Overall": "5.0"}, "AuthorLocation": "", "Title": "“Wonderful stay, fabulous service !!”", "Author": "MonishaKrishna", "ReviewID": "UR139554449", "Content": "My family group of ten (6 adults & 4 children) was on a two week vacation to Spain and Madrid was our last stop. Throughout our vacation, we stayed in excellent hotels and enjoyed the warm Spanish hospitality. Our last stop at the Grand Melia Fenix was like the icing on the cake and we ended our visit to Spain with a bang ! Though our first impression of the hotel was that it was a little run down, the hospitality and service was absolutely wonderful and more than made up for the looks of the lobby n front desk. My family was celebrating two major events with this holiday and though I had written to all the hotels we stayed at, the Grand Melia Fenix was the only one which greeted us with a lovely bottle of Cava wine, a platter of chocolate dipped strawberries and a large tray of candies for the children. The gesture was very touching. The hotel also accommodated our request for a late checkout (as our flight wasn't until late in the night) at no extra cost. Further, breakfast was very sumptuous, our rooms were well appointed, the toiletries in the bathrooms were of an excellent quality and room service responded to every request within minutes. All the staff were extremely courteous and helpful - especially the doormen who got us taxis very promptly. We were also happy with the location of the hotel - walking distance from Retiro Park and short taxi rides from most Madrid landmarks. The Hard Rock Cafe and Hop On Hop Off Tour stop right next to the hotel made life very comfortable as well. All in all, we had a wonderful stay and would love to return someday.", "Date": "September 6, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Northamptonshire", "Title": "“Five star in all respects!”", "Author": "Caesar63", "ReviewID": "UR139096487", "Content": "It was an absolute pleasure staying at the Gran Melia Fenix in Madrid. My wife and I chose it as it is centrally located, seemed luxurious but good value and already had some great reviews. We were pleased to discover that it didn't disappoint in any aspect at all. It is indeed very well located. We took the Metro from the airport which cost just a few Euros, is easy to navigate and delivers you to the Plaza De Colon just two minutes walk from the hotel. The journey from the airport takes about 20 minutes. Once settled in, the hotel is perfect for exploring all areas of Madrid. Whether you want to visit the Prado, the Retiro Park, the Serrano shops, the Plaza Mayor, the Palace or the Cathedral, all are within a maximum of thirty minutes walk. Alternatively, if you want to explore further afield (or would rather not walk) two metro stations are just nearby. My wife and I were spending four days over the August bank holiday in Madrid (which also coincided with our wedding anniversary). I had mentioned our anniversary when booking online and was pleasantly surprised when we were congratulated immediately upon arriving at the check-in desk. When we reached our delightful, luxurious room we found chocolate-covered strawberries and a bottle of champagne on ice, with a personal note of congratulations! A very thoughtful touch. Check-in was very slick and friendly and our room exceeded all our expectations (we'd booked a premium room). The decor was impressively stylish, the room large, the bed beautifully sumptious and the furniture and fittings comfortable and high quality. It would be difficult to imagine a nicer room to stay in. The bathroom was equal to the bedroom with smart, modern fittings with black granite surfaces and Clarins products. We also had a fabulous view of the plaza which made us feel a part of the bustling city. When we finally turned in after walking for miles around Madrid, we were pleased to find that the curtains completely blacked out the lights from the square and the windows were 100% sound proof. Perfect for a great night's sleep (helped by the extremely comfortable bed!) Downstairs for breakfast the following morning continued this excellent experience. The public areas including the lounge and bar are fabulously furnished and decorated, feeling more like a comfortable palace than a hotel (indeed, having walked around the actual Palace in Madrid on the second day, the Gran Melia wins hands down!!) I don't usually enjoy hotel buffet breakfasts as they tend to comprise a bland selection of cereals, pastries and luke warm cooked breakfast. Again, the Gran Melia defied the norm. The food selection was not only vast but we also discovered that everything was high quality and extremely fresh. The fruit selection was excellent, the cereals, cold meats and pastries inviting and the yoghurt was hand made by the hotel. Delicious. We didn't have the hot food and so can't comment, but given the high standard of the rest of the buffet I suspect the hot food would have tasted equally good. This is the first time I have ever thoroughly enjoyed a buffet breakfast in any hotel I have stayed in throught the world - I actually looked forward to breakfast each morning - a first! To add to the cosy atmosphere, excellent decor and good value, the staff throughout the hotel were all very efficient and keen to help - superb service which the whole team should be proud of. If returning to Madrid in the future we would book again at the Gran Melia without reserve - there seems no reason to even consider other hotels. Thank you all for providing us with such a perfect stay.", "Date": "September 1, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Atlanta", "Title": "“Lovely hotel!”", "Author": "DenCarAtlanta", "ReviewID": "UR138864792", "Content": "We stayed 2 night in a small interior room but beautifully decorated and furnished. Good breakfast buffet, wonderful ornate dome and stairwell, so much character! Front desk staff very helpful and knowledgeable. Great location, walking distance to park, restaurants & shops. Would definitely recommend.", "Date": "August 30, 2012"}, {"Ratings": {"Service": "2", "Cleanliness": "4", "Overall": "1.0", "Value": "1", "Sleep Quality": "3", "Rooms": "1", "Location": "1"}, "AuthorLocation": "Pompano Beach, Florida", "Title": "“MOST OVERATED HOTEL IN MADRID”", "Author": "ANNONYMOUS34225", "ReviewID": "UR137783453", "Content": "We stayed there 3 nights and we had two rooms .This is not a 5 star hotel maybe it was 50 years ago.Our rooms were tiny.We had a big closet for a bedroom WITH DE-LUX DRAPES.Dome in the lobby is beautiful .This is not a good location..Overall is not worth the money.WE WILL NEVER STAY THE AGAIN", "Date": "August 20, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Paris", "Title": "“A good reference”", "Author": "NickieParis", "ReviewID": "UR137484525", "Content": "I spent 3 days in the Gran Melia Fenix and despite the fact the fitness room was not available, I was quite content. All the staff is very helpful and smily. If you wish to relax the red floor is a must. At the red floor you can drink champagne served with canapés and all sorts of goodies! Last but not least, the quality of the bed and pillows with soft coton sheets is a treat. The breakfast is excellent with a very good fresh squeeze orange juice, give it a try! The hotel is kept clean which is vital. I certainly will choose the Gran Melia Fenix when I return to Madrid!", "Date": "August 17, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "NYC", "Title": "“Best Quality/Best Location”", "Author": "jtbnyc", "ReviewID": "UR137085818", "Content": "Spent 5 days in Madrid and this hotel was perfection. The staff were incredibly friendly and helpful and the location was easy in every respect. As tourists we wanted comfort but not so \"ultra\" it would be over-the-top $$$$. This hotel wasn't. We loved the outside garden/bar and would end every day with a cocktail (beware the \"signature\" martini olives stuffed with anchovies!! Ugh). The rooms are beautifully appointed with every need. There is ice on the floor, which we found was not the norm in Spain. Enjoy this property, it is a grand hotel in the purest terms.", "Date": "August 13, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "3"}, "AuthorLocation": "Washington DC, District of Columbia", "Title": "“Great Hotel but Not Centrally Located”", "Author": "DCCool", "ReviewID": "UR136807913", "Content": "We booked on Red level. Room included jacuzzi outside on patio and view of entire city. The water pipe from jacuzzi leaked causing small flood and we were moved to junior suite. Jacuzzi feature is a must if wish to soak up some sun while in water as few hotels in Madrid offered an outdoor pool. No room service fee and hotel food was quite good. The Red level room is stocked with every type of alcoholic drink imaginable and the lounge has light snacks, television, computer and printing services and a separate terrace overlooking the marvelous view of Madrid. The breakfast food was marginal. Hotel is not centrally located but taxis were always right outside and Hard Rock Cafe was right down the street. Overall, this hotel was a good choice for us.", "Date": "August 10, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Zagreb, Croatia", "Title": "“Nice hotel”", "Author": "kelja", "ReviewID": "UR136746519", "Content": "This is nice hotel in a fancy neighborhood! Restaurant for breakfast and the breakfast it self is really great! Everything is served till 11 o'clock which gave my husband and me a pleasure not to rush like crazy to eat a croissant! Staff is really nice and helpful, specially Mr. Jesus from reception desk. Lounge bar is cozy and serves great mojito cocktail! The only thing, for sure, I wouldn't recommend is a standard room, actually as per hotel web site this is a Deluxe category. It overlooks the inner court of the hotel which is really not a thrill... The room is small and dark...we called it our own \"catacomb\"! Definitely go for a higher category, it's worth it! The Spa was in renovation at the time we were there (beginning of May 2012.) so I can't say whether we missed something spectacular or not.", "Date": "August 9, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Sleep Quality": "4", "Rooms": "3", "Location": "2"}, "AuthorLocation": "home", "Title": "“Great breakfast but small rooms”", "Author": "franz m", "ReviewID": "UR136513137", "Content": "I've been here with my family for a congress. It's a little far from Puerta del Sol (30 minutes on foot) as well as from Prado museum (30 minutes on foot). Our room was crowded by furniture, with a useless anteroom and a relatively small bathroom. Air-conditioning is controlled by a really awkward legacy system which should appear in The Design of Everyday Things book by Donald A. Norman as an example on how not to design domotics. Breakfast was gorgeous with fresh pressed juices at leisure (strawberry was my favorite)", "Date": "August 7, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "austin, texas", "Title": "“Better and Better”", "Author": "mspain", "ReviewID": "UR136477325", "Content": "I have reviewed Gran Melia Fenix before, but I stayed there again in July and this hotel gets better and better. Service is always excellent as is the location. Get a room with a jacuzzi and get Red Level. The Red Level is the best of any Gran Melia I have stayed at and greatly compensates for the room price as their free drinks and snacks are outstanding. I am upping them to 5 stars.", "Date": "August 7, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Miami Beach, Florida", "Title": "“Great Hotel”", "Author": "lovetotraveltoeurope", "ReviewID": "UR136373442", "Content": "Just returned from my stay at the hotel.... excellent hotel with a good location. Staff were friendly and helpful. The housekeeping staff were always smiling, greeting you and could not do enough to make sure we were comfortable. My only criticism would be the service in the lounge/bar downstairs... it is expensive, and the service was almost non-existent - we had to find the server after sitting there for a while - then got our drinks and never saw the server again.... we also had to find someone to get us the bill so we could pay.... Aside from that, I would highly recommend this hotel!", "Date": "August 6, 2012"}, {"Ratings": {"Service": "1", "Cleanliness": "5", "Overall": "2.0", "Value": "3", "Sleep Quality": "4", "Rooms": "2", "Location": "4"}, "AuthorLocation": "Sydney, Australia", "Title": "“We felt like intruders”", "Author": "BeatainOz", "ReviewID": "UR136353143", "Content": "This hotel is well located close to a metro station and within walking distance to the three art museums. Unfortunately it’s a very small and very busy hotel and we felt like no one wanted us there. This is the first Leading Hotels of the World hotel where our membership was totally ignored. While we did get breakfast (because we asked for it), we didn’t get any upgrade (nor a sorry for not getting an upgrade) and there was no gift for us. We actually reminded the reception that we were LHW members, but only after explicitly asking for it, we got our free gift (a fruit salad, but no welcome letter). The room was extremely small for a couple. For a couple with a child, it seemed unsuitable as we couldn’t move. I do not recommend this hotel to people who need an extra bed. The bathroom was extremely small. We are thin people, but we had trouble moving around in the bathroom. One morning we went for breakfast without leaving the “Do not disturb” sign. When we returned to the room, the maid continued fixing the sheets, without taking any notice of us. We felt like intruders, as she wouldn’t stop. Since the room was too small for us to reach for things while she was there, we just left for the museums without taking the things we wanted. At a 5 star hotel, I would expect better trained staff, who would at least ask whether we needed to do something. This maid made us feel like it was her room, not ours.", "Date": "August 6, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Milano, Italia", "Title": "“The place to be in Madrid”", "Author": "Cigno2nero", "ReviewID": "UR135531197", "Content": "The Gran Melia Fenix is the place to be when in Madrid. The are is central, nice and quiet and the whole experience, from check in to check out makes you feel special. Rooms are specious and bright and, although facing a crowded street, they are very quite. Breakfast is very nice with a wide range offered.", "Date": "July 27, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "5.0", "Value": "3", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "London", "Title": "“Elegant and sophiscticated - great location”", "Author": "Hammerschmidt", "ReviewID": "UR135423363", "Content": "/this hotel on Place Colon is perfect - rooms are spacious and very well appointed and immaculate. The reception staff are very welcoming and porfessional with a smile. Great bar with amazing cocktails and an outside terrace!", "Date": "July 26, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "", "Title": "“The best value/cost hotel in Madrid”", "Author": "germanmiami", "ReviewID": "UR134657848", "Content": "My family and I stayed in this hotel in July 2012. Great looking hotel, customer service is the best, and the location is great in the middle of Madrid. The hop on/hop off buses stop in the same block as the hotel. It is also walking distance 3 blocks from the best high end shopping in Madrid.", "Date": "July 17, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Edinburgh", "Title": "“Stay here, it's Melia excellence”", "Author": "Teragram10", "ReviewID": "UR134580988", "Content": "I have just returned from a four night stay at the Gran Melia Fenix and again recommend the Melia chain of hotels and also the location of this hotel. The hotel is a wonderful, comfortable, good-feeling hotel in a perfect location to explore the vibrant, exciting and happening city of Madrid. The hotel is situated in the Plaza Colon which is a 15-20 minute walk to the Prado Museum, a must to visit in Madrid. Shopping, culture, restaurants and tapas bars are all within easy reach. For flamenco the Corral de Moreria is excellent and a show/dinner or show only option is available. Rooms are not huge but comfortable (bathrobes are the best I've had), sheets arechanged daily, towels large, white and fluffy and luxurious Clarins toiletries made my stay very pleasant. The hotel is spotlessly clean and the numerous staff I encountered during my stay were consistently genuine, pleasant and sincere. Thank you Melia for contributing to my very pleasant stay in Madrid. I reconmmend this hotel if staying in Madrid, you will not be disappointed", "Date": "July 16, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "San Antonio", "Title": "“Super luxury hotel”", "Author": "NavyDad03", "ReviewID": "UR134030269", "Content": "The breakfast, rooms, service, and ambiance were so far above my expectations, I was stunned. This is how movie stars and government dignitaries live. In fact, some VIP was staying there during our stay... SWAT truck parked outside the service entrance 24/7, and numerous big young guys in black suits and ties with corded ear bus and large bulges under their coat wandering the public spaces at all hours. Very cloak and dagger feeling.", "Date": "July 10, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Manchester, United Kingdom", "Title": "“Grand Dame of Madrid”", "Author": "Jane C", "ReviewID": "UR134016464", "Content": "Stayed here at the end of a long trip this year and it was lovely grand place with good staff and very good rooms. Ate there once in dining room which was bit empty but that's more the fact that I can't wait til 10.30 pm for dinner rather than the restaurant. They were renovating the gym whilst I was there so had to go down the road to the another place which was ok but hopefully they'll have it back to normal. There is a Red level which I had access to which is pretty good and has its own concierge and tapas area so if you don't need to eat lunch then this would suit you. There are rooms with jacuzzis on the terrace for your inner rock star and ones with view of Christopher Columbus which are pretty good. You'd be hard pressed to fault it.", "Date": "July 10, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Birmingham, Alabama", "Title": "“Very nice accommodation”", "Author": "smokey17", "ReviewID": "UR134004169", "Content": "Excellent facility, good location. Staff very helpful.", "Date": "July 10, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Westfield, Wisconsin", "Title": "“Definitely a place to pick!”", "Author": "Bubbagags", "ReviewID": "UR133845025", "Content": "First class all the way...Pretty much centrally located with 10-30 minute walks to many of the plaza's, museums, shops and restaurants. A little pricey at their bar and tapas area, but that's to be expected considering the hotel.", "Date": "July 9, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "3.0", "Value": "3", "Sleep Quality": "4", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Lagos, Nigeria", "Title": "“Stunning Hotel but bring your own water!”", "Author": "Tawabolarin", "ReviewID": "UR132763508", "Content": "We love the hotel interior. Really stunning and the location was great However: For a five star hotel, they don't have complimentary bottle of water. To make things worse they sell a miserly 25cl bottle for 5 euros!! Completely unacceptable. This cheap extortionist tactic ruins the entire image of the hotel for me.", "Date": "June 25, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Sao Paulo, SP", "Title": "“Oustanding”", "Author": "ALEX N", "ReviewID": "UR132598670", "Content": "When I arrived my impression was not good. Old hotel, ancient looking lobby, small elevators, tiny rooms. Then I received the bad news: the gym was closed for renewal and I had to go outside the hotel to use another gym. After a while I started changing my opinion about this hotel. The bedroom was cozy and comfortable, pillows were very clean and everything worked almost to perfection. Room service was good both in food quality and staff efficiency. The breakfast buffet was very extensive with an excellent variety, and I could also order a la carte with no extra cost. The restaurant staff was friendly and very professional. The best service, however, was at the front desk, outstanding. I would not mind coming back to this hotel provided they reopen the gym.", "Date": "June 23, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Location": "4", "Rooms": "5"}, "AuthorLocation": "", "Title": "“great rooms outside bar overpriced and the service is slow.”", "Author": "adillster", "ReviewID": "UR132318667", "Content": "lived up to the reviews on this site would recommend and stay again", "Date": "June 19, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "egypt alex", "Title": "“As usual lovely”", "Author": "bishay", "ReviewID": "UR132155419", "Content": "that was my second stay at mila fenix we got premier room with uprate to club or as they called it red level everyone very friendly from door guy till the level .on my birthday i asked the concierge office to book me table at hard rock cafe cause it was my birthday the problem was that weekend and national holiday but they did their best and got us a table when we got back at night at the lounge Senora Gemma knew it was my birthday i found in my room nice bottle of wine and Delicious cake . it is usually my choice in Madrid thanks for every one but still prefer the room in 6 floor more in five", "Date": "June 17, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "3"}, "AuthorLocation": "London, United Kingdom", "Title": "“A great three nights on the red level”", "Author": "NOS1234", "ReviewID": "UR132050074", "Content": "Having read the reviews on Tripadvisor we booked the red level at the Gran Melia Fenix and were very pleased with our stay there. The hotel room was really comfortable with lovely bed linen and duvet covers. The staff were really helpful and well informed about Madrid. The food etc in the red level area were great and it was good to have somewhere to relax. My only negative comment is that the hotel is located a little away from the main restaurants and bars in Madrid and we had to take a taxi at night - not particularly expensive so not a big problem. We had a meal in the restaurant, expensive and not particularly good.", "Date": "June 15, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "4", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Dublin", "Title": "“A true luxury hotel, excellent stay!”", "Author": "Flyer007Dublin", "ReviewID": "UR131762406", "Content": "Earlier in the year [ 2012 ] we had the opportunity to stay at the Gran Melia Fenix in Madrid, Spain and here are some of our impressions and memories collected. The Gran Melia Fenix is the flagship hotel of the Spanish Melia hotel chain and is a member of The Leading Hotels of the World. Location: Plaza de Colon on Calle Hermosilla 2 in the heart of the city, the same building houses on the opposite the Hard Rock Cafe Madrid. Access is easy to the attractions of the Spanish capital, the hotel is surrounded by famous art institutions, restaurants, cafes, the underground train and glorious shopping. First Impressions: A grand and beautiful building with a wonderful entrance, doorman was inside, saw us coming in the hotel, took our luggage and we could check-in, the lady from downstairs brought us upstairs to the RED LEVEL Lounge in which we could check-in and had a nespresso in the meantime while waiting a few minutes until our room was ready. Our room: Premium room with Jacuzzi and private terrace. A great room type, very elegant furnishings and great luxurious feel, ideal for our stay, this was something we looked forward too. From the fantastic bed with high quality linens, jacuzzi on the terrace, fully marbled bathroom, Clarins Paris bath amenities, large TV with international channels, fast internet access to a fully stocked mini bar, pillow menu and even a personal scent menu was on offer. RED LEVEL: Our room type included RED LEVEL lounge access. We loved this lounge during our stay as much as the whole hotel. The services offered are fantastic as is the lounge itself a masterpiece of hospitality. We encountered friendly staff, free newspapers, complimentary champagne, gorgeous happy hour with a real dinner offering and breakfast with a la carte items, all included in our overnight rate paid. Even when we think right now about the RED LEVEL we melt away in our positive memories. Eat || Drink: Beside the fantastic offerings in the RED LEVEL lounge, we enjoyed also room service incl. Spanish omlettes, fried rice specialities and hot chocolate. Overall, highly recommended. Overall: A wonderful heritage hotel in the heart of the Spanish capital, a true luxury hotel which had many famous names seen over the years. We had a wonderful experience at this hotel, Gran Melia Fenix is beautiful, elegant but not overbearing. This is what luxury is all about, special for the guest and special for the hotel, employees have shown pride to work there. We felt just that as guests too. Psssst.........As members of the MELIA MAS rewards program we received also a 40 Euro discount towards eating and drinking in the hotel, which reduced our final bill on check-out. Would we recommend this hotel? YES! Would we return to this hotel? YES!", "Date": "June 11, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Orlando, Florida", "Title": "“vacation in Madrid”", "Author": "AndreyK3", "ReviewID": "UR131739640", "Content": "Great Hotel. Location is perfect for all needs. Got free room upgrade from deluxe to premium with view to plaza de Colon. Very friendly staff.", "Date": "June 11, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Philadelphia", "Title": "“Wonderful stay in Madrid”", "Author": "Fitzie28", "ReviewID": "UR131616947", "Content": "The Gran Melia is an old historical hotel that is very luxurious. While the decor is not modern, the room was spacious and comfortable. The service from everyone we encountered was plesant, helpful and above and beyond to make sure we had everything we needed. The highlight of the hotel was the bar DRY - a fun atmosphere with great cocktails and staff. Location was nice - clean and in the more upscale part of town (near great shopping!)...a little bit away from the main sights and nightlife. Not a budget hotel, but for service alone well worth the price.", "Date": "June 9, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "4", "Rooms": "5"}, "AuthorLocation": "Melbourne, Australia", "Title": "“Excellent hotel”", "Author": "MelbOurne_pp81", "ReviewID": "UR131107274", "Content": "Loved this hotel. Staff were great. Room was amazing. Amenities were great. The only possibly negative thing if any at all is the location. It is still right in the city but a bit of walking is required to get to shops and restaurants (great if u like to walk) Would definitely love to go back again if we go back to Madrid!", "Date": "June 1, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Brazil", "Title": "“Great hotel in a great location”", "Author": "LUCIANAGS", "ReviewID": "UR131103361", "Content": "The hotel was very good, in a great location, so it's possible to walk to many city attractions like Museo del Prado, Chuenca, Plaza Sant'Anna, Retiro etc. It's very close to Calle Serrano, where are located many famous stores, like El Corte Ingles, Prada, Lowe, etc. Turning the block there's a Le Pain Quotidien, where we took breakfast every day for a good price. The room is silent (they have double windows), quiet, comfortable, well decorated and very clean. I like it very much. The only thing I observed is that the common areas are needing a small renovation, specially the walls and doors need to be painted.", "Date": "June 1, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Kalamazoo, Michigan", "Title": "“Over the Top Luxury”", "Author": "glennr2", "ReviewID": "UR131024788", "Content": "We recently spent three nights at the Gran Melia Fenix and realized it was a luxurious hotel the minute we walked into the domed lobby. It only got better from their. Our room, while small, was comfortable and beautifully decorated. Both the bedroom and bathroom were separated from the entry by glass doors, unnecessary, but a nice touch. The glass door between the two parts of the bathroom was a bit impractical, considering the size and configuration of the bathroom and the placement of the door. (We learned from subsequent stays at three more Melia hotels that a redundancy of bathroom doors is a recurring theme.) We knew that we had arrived when we discovered that turndown service included not only a chocolate on our pillows but a towel and slippers on the floor on each side of the bed. The room was clean and the staff were friendly. Breakfast was extensive and everything was delicious. The location is good--about a 10-15 minute walk to the Prado--and public transportation is easily accessible. We would definitely return to this hotel the next time we are in Madrid.", "Date": "May 31, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Sacramento, California", "Title": "“Great Location in Quality Hotel”", "Author": "Vkidman", "ReviewID": "UR131012848", "Content": "We stayed at this hotel at the recommendation of our travel agent. It is a quality hotel with very high-end furnishings. The rooms were very spacious for an older hotel in a European city. The location of the hotel was perfect -- near wonderful shopping and within a short walk to museums. The hotel's gym was under construction so we had access to a great gym in a near-by mall. We upgraded to the Red Level which was worth every penny (euro). The Red Level lounge provided daily breakfasts and an open bar with wonderful tapas/desserts and high-end liquor and wines from 1 p.m. to 10 p.m. I would definately recommend this hotel to other travelers. The only downside - which was typical of Spain - was very few people spoke English. However, they knew enough to help us find our way around.", "Date": "May 31, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "3", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Madrid", "Title": "“Ageing Queen needs a facelift.”", "Author": "Posted by an Easytobook.com traveler", "ReviewID": "UR129978905", "Content": "Clearly the hotel was originally constructed at great expense but is now showing fatigue. However - Any shortcomings are amply overcome by the helpful and friendly staff.", "Date": "May 15, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "3", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "fahan", "Title": "“Great Hotel”", "Author": "Car0lfahan", "ReviewID": "UR129857207", "Content": "This is a wonderful hotel, great location, gorgeous food, well equipped rooms, very helpful staff..", "Date": "May 13, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Hoboken, New Jersey", "Title": "“Red Level all the way...”", "Author": "jehNJ", "ReviewID": "UR129605163", "Content": "As with many hotels, its all about your expectations. We stayed at this hotel because of its old world charm and it surely delivered. The Red Level was great. It consists mainly of a small room on the 7th floor offering a private breakfast and snacks/open bar all day. I got the impression that the Red Level is a service add on, as supposed to a special room. For example, our room was on the 5th floor and a couple we were with were on the 6th floor, but we were both on the Red Level plan. Breakfast downstairs was good too. As for location, this hotel is about a 40 minute walk to Sol, which is the center of town. if you want to be where all the action is then this hotel is a little of out of the way. Its in the posh Salamanca district which is very upscale, great shopping and restaurants were only a block away. Retiro Park and all the museums were within easy walking distance. Taxis were easy to find and the subway was less than a block away. The Red Level concierage was very helpful.", "Date": "May 8, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Los Angeles, California", "Title": "“Excellent place to stay”", "Author": "RafainLA", "ReviewID": "UR129530450", "Content": "We stayed in Madrid after a long transatlantic cruise at the Fenix. It was a great experiance. Nice, clean and spacious room and very good service. Also Well located", "Date": "May 7, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "", "Title": "“Nice hotel with easy access to major attractions”", "Author": "ProAndSuchi", "ReviewID": "UR129422010", "Content": "Right next to the Colon metro station, Gran Melia offers a great location within a walkable distance from Prado Museum and Retiro park, and quick and easy access to Plaza Espanya, Plaza Santana, Plaza Mayor and other major attractions.", "Date": "May 5, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "", "Title": "“Fab”", "Author": "Patchesmum", "ReviewID": "UR129365966", "Content": "Went with a friend to join a group who stayed in a different hotel for a hen weekend. Paid extra for room with whirlpool on balcony and for red level. Worth every penny. Excellent service, ate in hotel restaurant one night, lovely lovely food, especially the steak, and I am fussy! Very good value meal. Bar was great with very large cocktails. Would definitely go again, top drawer shops nearby.", "Date": "May 4, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Rotterdam", "Title": "“Great classic hotel”", "Author": "DiTorrero", "ReviewID": "UR129359137", "Content": "We stayed at the Gran Melia Fenix at the end of April, beginning of May. I chose this hotel for our citytrip to Madrid for my wife and two of our children (17 and 20 years old) after reading all the positive reactions on tripadvisor. We stayed in two connecting rooms (see helpful room tips) The service was fantastic! Whether at the reception, in the bar, the excellent restaurant or anywhere else in the hotel, all the staff were extremely friendly and very helpful. The dinner in the hotel's restaurant (Epoque) was excellent, but if you fancy something completely different there is always the Hard Rock Cafe which is in the same building as the hotel. The rooms were very comfortable, the amenities provided were excellent and very complete. The hotel is situated outside the center of Madrid, but the metro and busses are close by. It is also situated close to the beautiful Ritero park and relatively close the Santiago Bernabéu stadion. The buffet breakfast has all you need from Spanish to English breakfast all in a very relaxed atmosphere. If you like luxury and excellent service this is the place to stay!", "Date": "May 4, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "London, United Kingdom", "Title": "“Beautiful hotel - great location - Red Level club excellent”", "Author": "LONDONMANIA", "ReviewID": "UR129247602", "Content": "We stayed at Gran Melia Fenix for two nights at the end of Feb. the hotel was easy to spot across the road as we came out of the station. The metro is very simple to use from the airport. The hotel is beautiful and very grand. The spiral brass and marble staircase is a real feature, with thik carpet. Our room was immaculate and very comfortable with the \"romantic package\" champagne and fruit and candles waiting for us. The bed was massive. Floor boards creaked, but that just goes with the age and charm of the property. The decor was rather grown up and oppulent and included a large desk and plenty of wardrobe space. Very cosy. The red level package meant that breakfast was included and canapés were available throughout the day, as well as premium brand drinks, including champagne. The drinks selection was vast, wine perfectly chilled. Food was well presented and excellent quality. The only strange thing was that you weren't allowed to take drinks into your room. And at this premium you would expect at least bottled water to be in your room or at least allowed to be consumed away from the Red Level lounge. We asked for a bottle to take out with us and were given the tiniest bottle you ever saw. We just replenished at a local supermarket at 30 cents for 1.5L. Really silly to make us have to do that. Clarins toiletries were generous and replenished. We were asked to check out early even though our booking included a late checkout, but MY HUSBAND agreed and were allowed to continue using the facilities in return. I didn't mind really. There was a lovely terrace and comfortable seating area in th lounge. We ventured out mostly and didn't get to use our 80 Euro open credit and the hotel was a lovely place to come back to. The tourist buses operate from just outside. The property is located around a 15 - 20 minute walk to the main areas, which was a pleasant route. We had a great stay and I have no hesitation in recommending this period property. I will post my pictures in due course. There's a nice unassuming local restaurant across the road to your right as you leave the hotel which serves traditional tapas - very authentic and great service.", "Date": "May 2, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "4", "Rooms": "5", "Location": "3"}, "AuthorLocation": "Houston, Texas", "Title": "“Beautiful Classic Hotel!”", "Author": "no1likeval", "ReviewID": "UR129112089", "Content": "My Husband and I were taking a cruise from Barcelona, but flew in to Madrid for a night, and stayed here...wow! The hotel from the outside looked kind of 'old' (fyi, this was our frist trip to Spain,or anywhere in Europe!) when we walked in, we saw that it was very classic and authentic. The staff at the front desk were very friendly, spoke great English, and were helpful in suggesting sights and areas to visit. Our room was beaufiul, like none I've seen in the states. You walk in to a small corridor with the bathroom to the left, and continue on to the bedroom, which has a french door ( i loved the separation). The detail and craftsmanship made it very romantic; gold details, lighting, drapes, wooden frames on the walls/doors, elegant furniture, comfortable bed/bedding...just great. The bathroom was a great size, very clean, and it had a bedet! Not used to those, but of course it was funny to see. No washcloths though, so take ur own, or use the small towels next to the bedet (i guess it's to dry off??). The location, I thought, was a little off the 'main touristy area', which I was unaware of at the time of booking. We were so tired from our long overnight flight, we did little sightseeing as it was, but found it pretty easy to walk to/from the hotel during the day and at night, as there were lots of people on the street for a Friday night. Comfortable, free internet in the room (with a cord), adapters available at the desk (for US hair tools,chargers etc.), friendly service, and overall beautiful. I'd recommend this hotel to those visiting Madrid!", "Date": "April 30, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "uk", "Title": "“Excellent Hotel”", "Author": "kathrynmwalsh", "ReviewID": "UR129048109", "Content": "I stayed in this hotel for three nights in March. It was booked as a birthday treat for my dads 50th. They provided a free upgrade, cake and cava. As soon as we arrived they wished my dad happy birthday! The hotel is very clean and upmarket. The staff were extremely helpful and friendly. The cocktail bar is fantastic (the garden outside is also lovely). the rooms are spacious and well decorated. There is a lovely turn down service each night and the rooms have all the extras you would expect from a 5* hotel. I will be recommending this hotel to everyone I know.", "Date": "April 29, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Yorkshire", "Title": "“Best Hotel in Madrid”", "Author": "John W", "ReviewID": "UR128551497", "Content": "This hotel is simply fantastic. The service was exceptional. I was there with my family for my birthday. The staff even presented me with a birthday cake and a bottle of bubbly in the room. The rooms were high quality only beaten by the high standard of very friendly service, The cocktails and the Martinis are a must - you will struggle to find better!", "Date": "April 24, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Sofia, Bulgaria", "Title": "“Very good hotel”", "Author": "Elena123_11", "ReviewID": "UR128509665", "Content": "We went in April 2012 and stayed at 'red carpet level' which means that we had the right to use the Loundge located on the last floor. There we had all day refreshments and after 6PM some small bites which was even enough for dinner. Alcoohol served there was also on a high level (like Moet&Chandon champagne and 20 years old scotch).The good thing there is the great terrace where you could have a drink and also if you have kids they could play around while you are getting your drink watching the great vuew. The hotel is very well positionned,has a wifi in the room. On the gound floor there is a fameous restaurant in which we celebrated a birthday-the food was excellent,tres gourmet,with no many places so for sure you need to book in advance. The price was absolutely normal (just to compare- we payed more for lunch in the city center and the food was awful). If we go once again in Madrid this will be our choice for sure.", "Date": "April 24, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "3.0", "Value": "3", "Sleep Quality": "5", "Rooms": "3", "Location": "5"}, "AuthorLocation": "buenos aires", "Title": "“Red Level”", "Author": "rosba", "ReviewID": "UR128260010", "Content": "Stayed twice in this hotel using the \"red level\" . It is worth it as you can get free snacks during your stay which comes handy if you want a light lunch or grab a bite before dinner and the breakfast is in a separate area of the hotel. My only problem was that upon arrival on my second stay I've asked for a late check out (4 pm instead of 12 pm). I was told that it was not going to be a problem but that I have to ask for it the day of the check out. Guess what? The hotel is fully booked so no late check out. Red level is supossed to be flexible regarding late check outs. Not this time, folks. I have a plane to catch at 9 pm and have to leave the hotel at 12.", "Date": "April 21, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "1", "Sleep Quality": "3", "Rooms": "2", "Location": "5"}, "AuthorLocation": "Puerto Aventuras, Mexico", "Title": "“Nice location, but more like a 3 star hotel”", "Author": "donk93953", "ReviewID": "UR128248363", "Content": "The hotel is in a great location for business and shopping in Madrid. The public rooms, nice. The bar \"Dry\" is wonderful....great staff. The rooms..tiny...We had booked a pemiere view room with breakfast. I was told upon check-in that they didnt have any available so I was being upgraded to their Red Level...basically a business center with a small buffet and bar. I was shown a room with a view of a building some 20 feet away. A bathroom that reminded me of the head on a boat it was so small. Two of us could not walk past each other in it. Didnt use the Red Level service ,but once. They didnt know how to mail a Fed Ex package, no need to go there again. Upon check out, I found I was being charged for Red Level service to the tune of 150 euros.!!!! The couldnt honor my reservation and they charged me for their inability to perform. In a word...avoid...their are much nicer hotels in Madrid.", "Date": "April 20, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Carlisle Cumbria", "Title": "“Excellent luxury hotel”", "Author": "Chris1612", "ReviewID": "UR128120494", "Content": "Everything is here for a perfect stay. The rooms are wonderful and the staff service exceptional. Breakfast costs 28 Euros per person, but you can eat out locally at the very good cafes. Valet parking is also 28 Euros per night but makes life easier on arrival. Everybody is helpful.", "Date": "April 18, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "London", "Title": "“Magnificence in Madrid”", "Author": "Glindaba", "ReviewID": "UR127596419", "Content": "This is an impeccably run hotel in a great up-market and quiet area yet still within reasonable walking distance to major sites in the city. Our Red level provided exclusive check-in area and some of the best lounge facilities we have experienced. A constant supply of freshly made tapas, sweets, Nespresso coffee and Moet made it hard to leave! However (at the risk of being heavily criticised) children should NOT be allowed in this area. After a minor problem (seamlessly dealt with) our room provided traditional luxury and was superbly relaxing. The bathroom was a LITTLE small, but we overlooked that due to the overall excellence of the hotel. Staff are courteous and friendly with a real willingness to assist. Breakfast buffet superb and the room quite beautifully run; nothing was too much trouble. Madrid is a real foodies paradise and remains elegantly grand yet bustling with life. Cannot wait to return.", "Date": "April 10, 2012"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "New Jersey", "Title": "“Good but not memorable”", "Author": "Luxury47", "ReviewID": "UR127379556", "Content": "My husband and I spent one night here in February. The hotel is well situated and has a \"Ritz\" type feeling. Staff is friendly and cortuous. However, the restaurant recommended by the concierge turned out to be horrible. The breakfast buffett can be much better. While there is variety, the quality is not at par with other luxury hotels. For example, for cereal they serve Kelogg varieties in small boxes, the bread is plain old toast etc. The wifi in the room was the slowest I've ever encountered in a hotel. I will try another hotel next time I'm in Madrid.", "Date": "April 6, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Sion, Switzerland", "Title": "“Very good but some defaults”", "Author": "Olympicchampion", "ReviewID": "UR127132426", "Content": "We booked directly at the Gran Mélia Fenix for four nights. We were adviced to stay on the Red Level and were not disappointed: fruit juices, drinks, snacks and even champagne were available for free from 7am to 23pm, a great experience ! The front desk staff were always friendly and helpful. Everybody has a very good command of spoken English. Our room at the 6th floor was modern classy, the furnishings beautiful but unfortunately small and lacking of cupboard storage: a real pity! Room cleaning was outstanding and the ladies in charge of it very professional and pleasant. Also the bathroom was well equipped but tiny. Disappointing were the information we got at the Red Level wich was less good than at the \"normal\" reception desk. Also the spa/gym was under renovation and we were offered to go to the Reebook gym at 15 minutes walking distance from the hotel. We didn't fall in love with Madrid either although this city offers a lot.", "Date": "April 2, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Rio de Janeiro, RJ", "Title": "“An excelent choise in Madrid”", "Author": "Maximiliano J", "ReviewID": "UR127093963", "Content": "This is a perfect five stars hotel. The location is central, a walk distance of the top majority atractives. The breakfast is excelent with 130 itens. Is the best breakfast I have had. I stayed for 5 nights and I didn't have any problem. My room had a street view, but didn't came any noise from street. the room has doubles windows. If you want to go to the gym, ask first, when I went it was closed to be renovated.", "Date": "April 1, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Dubai, United Arab Emirates", "Title": "“Grand yet cozy”", "Author": "Jimets", "ReviewID": "UR126577264", "Content": "A very nice, historical hotel in the heart of the center of Madrid...the location is great to catch buses and metro or just walk about. The National Library is minutes away, also Plaza Cibeles with its great Postal Palace at its crown. Service is impeccable, the staff is going out of his way to be helpful; have asked to call another hotel and they offered to make arrangements. English is also spoken by all... a great help for those who are not multi-lingual. We had a conference there and the food was also exceptional - except the stake one lunch. Breakfast was my favorite, the buffet provides local fruits and delicacies, a really grand affair. Rooms are nice, well serviced daily, overall a 5 star experience. Perhaps the only thing lacking was a spa/gym, as theirs was under renovation.", "Date": "March 24, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Basildon, United Kingdom", "Title": "“Absolutely outstanding - this hotel is flawless”", "Author": "Jennifer_V103", "ReviewID": "UR126449082", "Content": "Yes, it is pricey, but this hotel is worth every penny. The rooms are modern classy, with STUNNING bathrooms and beautiful furnishings. Many of them have french doors, and no detail spared. The bar downstairs, going out onto the Colon plaza, is absolutely stunning. Fantastic menu of wines, champagnes and cocktails, with outstanding service and a lovely relaxed atmosphere. I haven't eaten here, but I imagine the food is equally eloquent and flawless. The staff are incredibly attentive, friendly and conscientious. WELL worth a visit - beautiful.", "Date": "March 21, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Nashville, Tennessee", "Title": "“Wonderful service, great location!”", "Author": "Mary S", "ReviewID": "UR126374012", "Content": "We stayed on the Red Level for four nights in March. Everything about our stay was 5 stars. Our room was comfortable with every amenity. The concierge service was wonderful and the lounge breakfast and snacks were excellent. I booked through hotels.com and received an excellent rate making this stay a truly tremendous value for a 5 star hotel!", "Date": "March 20, 2012"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Overall": "3.0", "Value": "2", "Sleep Quality": "2", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Sao Paulo", "Title": "“Location: awesome. Service/Rooms: not so much.”", "Author": "terencereis", "ReviewID": "UR126179677", "Content": "Hm, so, yeah, I stayed there at the 1st week of January mostly due to location, some raving reviews and, yes, the stories about the Beatles and others. Location is perfect. Walking distance from everywhere you need to go in Madrid. Whether you're there for culture, food or shopping, it doesn't matter, you're nearby. Hence the 3 stars. Now as it comes to service: my wife and I arrived, nobody seemed to care about our luggage. We had to carry it ourselves. And those were no backpacks. And the staff remained oblivious about basic guests courtesy throughout our stay there (yes, on our way out we had to carry the luggage to the cab as well). Oh, the room. Possibly the worst located room on a hotel in history. And with a good chance of being the smallest as well. Only one window, with a view to the, well, I don't know what it was, but we needed to keep it closed, as it was some small concrete yard somewhere inside the hotel, right above our heads. Claustrophobic. Have I mentioned it was the same price as the other standard rooms - this was no promotion? Add to this an ice machine from hell at the corridor. Hotel lounge was completely unappealing as well. Basically it was a big let down. There are better places for the same cost.", "Date": "March 16, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Marbella", "Title": "“Location, location, oh.. and did I say location!”", "Author": "Maloneman", "ReviewID": "UR125672287", "Content": "I normally travel to Madrid several times a year.. I have found my hotel! The Melia Grand Fenix is great!!... I have stayed in several hotels in Madrid (all of which having been more expensive). The location is excellent, the staff courteous, and the rooms clean (and if you place the \"do not disturb\" sign on the door, it is respected. The only downside (but it doesn't bother me) is that the bathrooms are small (but well equipped). The Clarins shampoo & conditioner, and other products in the bathroom came in handy. There are several tv stations in English (which is nice).. Also, the tv is big and modern. This is my fifth time staying at this hotel.. I highly recommend it!", "Date": "March 5, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "4", "Rooms": "5"}, "AuthorLocation": "Beverly Hills", "Title": "“Wonderful stay”", "Author": "WomanEyeMD", "ReviewID": "UR125643946", "Content": "We stayed for 2 nights at this wonderful hotel. The service was excellent, room and bed was very comfortable. We loved the bar and had an amazing lunch at their restaurant, great food and wonderful service. I highly rate this hotel, only small downside is that it is a little far away to walk to the main attractions but it is only a 5 minute walk to the metro.", "Date": "March 5, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "3", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Oxford, United Kingdom", "Title": "“Brilliant service”", "Author": "Nick G", "ReviewID": "UR125474615", "Content": "The service at this hotel is in another league from so many modern hotels. Polite, attentive and personal. The cocktail bar is also superb. The restaurant, though rather quiet, is also excellent. Rooms very nice although not huge. Brilliant location for the sights of Madrid.", "Date": "March 1, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "London", "Title": "“Madrid Reunion !! (Jan 2012)”", "Author": "Cairo1988", "ReviewID": "UR125303465", "Content": "A beautiful hotel in a beautiful city! Excellent location with transport links readily available. Room smaller than anticipated (Room 518 - but had excellent view) and unable to store suitcases out of sight. TV channels were disappointing - perhaps a movie channel showing English films could be considered! Breakfast was excellent - enjoy!! Visits to Toledo (from Atocha) and Segovia (from Charmatin) via high speed trains are must as is the San Miguel Market near Plaza Mayor in Madrid itself. Enjoy Madrid it is a terrific city and can't wait to visit again - still so much to see!!", "Date": "February 27, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Frederiksberg, Denmark", "Title": "“Good times on Red Level”", "Author": "Under_many_stars", "ReviewID": "UR124845367", "Content": "Through hotels.com I booked one night on \"Red Level\" - in a pricerange close to the double of what I would normally like to pay. But it was worth the money. All of it. The hotel has made a special \"Red Level\" where guests are given speciel dedicated check-in (and a glass of champagne), but the really benefit here is the all included breakfast/afternoon/evening snack lounge. The word snack hides the fact that from 1 pm-11 pm you have free access to a well stocked bar, a wide selection of tapas, desserts, different types of coffee, etc. Very, very good indeed. I think I saved to 2 meals on that account plus breakfast - probably among the best breakfasts I have had at hotels. The is huge and have separate walk-in dressing room and just everything you could ask in 5-star hotel. Highly recommended.", "Date": "February 20, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "London, United Kingdom", "Title": "“Excellent hotel in the heart of Madrid”", "Author": "JamesA045", "ReviewID": "UR124680537", "Content": "I stayed in the Gran Melia Fenix for work in Feb 2012. The hotel is situated at Plaza de Colon in the heart of Madrid. The staff were extremely polite and I was upgraded to a room overlooking the avenue of Castellana. The room was huge with large double bed and separate hall leading to bathroom. Breakfast was excellent. I was recommend this hotel for the business or leisure traveller - worthy of its high TA rating.", "Date": "February 16, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "4", "Rooms": "5", "Location": "4"}, "AuthorLocation": "dublin", "Title": "“beautiful hotel”", "Author": "a visitor from ireland", "ReviewID": "UR124338348", "Content": "A beautiful hotel. The room was very comfortable and quiet with the extra touches you would expect from such a quality hotel. Staff were friendly and professional, especially the breakfast room staff. The location is great, a very short walk to the subway station that brings you to anywhere in the city or to the airport quickly and reasonably.", "Date": "February 9, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "manchester, UK", "Title": "“Fabulous, will return”", "Author": "tinxxle", "ReviewID": "UR124072623", "Content": "Stayed here as a present for a \"big\" birthday weekend at the beginning of December, first time in Madrid...and we couldn't have chosen better for location, service and style. The lady on reception was wonderful (wish I could remember her name!) She recommended some local restaurants for us and I have to say they were fabulous, within walking distance and not the usual tourist traps, a real taste of proper spanish cuisine. The rooms were fab, extremely quiet, lots of bits of bobs like shampoos etc., The cocktail bar in the hotel and the bar men were just lovely, and we were treated like VIPs by the bar manager.. especially when they found out it was my Birthday. The only thing we did find was that for such a large hotel we had to queue for breakfast in what was rather a small breakfast area.. one or two people even jumped the queue by just ignoring those that were waiting..and still managed to get directed to a table (a little bit more organisation is required here). But this was a tiny blip in what was an overall exceptional and memorable experience and yes I fell in love with Madrid and will return. The hotel is also located within walking distance of all the upmarket shops and boutiques. Thank you so much Gran Melia xx", "Date": "February 3, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Scotland", "Title": "“First class service”", "Author": "Don9", "ReviewID": "UR123650136", "Content": "Thyere was a fairly long delay when we arrived to checked in at reception (due to other guests mislaying their passports) but there were apologies from the staff and we were soon taken up to the red level floor and into our superb room. It had the wow factor and a great view of the city. The breakfast every morning was very good and the concierge was only too delighted to recommend sights for us to visit. If you pay extra for the red level service you have free use of the bar from 11am until 11pm where you will find all sorts of snacks, canapes and unlimited supply of Moet and Chandon! The hotel is certainly in a busy area of Madrid. There are 3 and 4 lane roads everywhere and the traffic is constant both day and night but you don't have to walk far before you can get away from the noise in one of the many parks nearby. I have to say also that the windows in the room were so good we couldn't actually hear any traffic noise at all. A few streets behind the hotel are some elegant old fashioned shops and some designer names - a pleasant are to walk in the evening. An excellent 5 star hotel and highly recommended.", "Date": "January 26, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "3", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Riyadh, Saudi Arabia", "Title": "“Great service , elegant hotel”", "Author": "gwillmousa", "ReviewID": "UR123411534", "Content": "We stayed in a room with out side jaccozi, it was luxury and the balcony was bigger than the room and it was fun staying there. We had lounge access it included a busniss centre and free of charge snakes and drinks .", "Date": "January 21, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Chicago, Illinois", "Title": "“Excellent Service and Perfect Location”", "Author": "lbaena", "ReviewID": "UR123402721", "Content": "A great hotel in the perfect spot of Madrid with an excellent staff willing to help and direct tourists all day long. The red carpet service located on the 6th and 7th floor is the best choice. Here are located the best rooms in the hotel. The Staff is very friendly, excellent food and very convenient for business or pleasure. This is a 5 stars hotel without a doubt. I hope I can come back soon.", "Date": "January 21, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "", "Title": "“My home in Madrid and a home I love”", "Author": "enriquedemarchena", "ReviewID": "UR123395721", "Content": "I have been going to the Fenix for the last 12 years almost every year. I didn't go last year. I found it better, much better. The service improves which is a lot to say. How do you improve something that was almost perfect? With attention to the minimum details. The bar has been remodeled. Many people say is the best bar in Madrid. The rest remain in the same place looking to satisfy its cadre of loyal customers.", "Date": "January 21, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Cape Town Central, South Africa", "Title": "“Best position in Madrid”", "Author": "Conniegreyvensteyn", "ReviewID": "UR123253641", "Content": "Except for the room being small, this true five star hotel is in a wonderful position. The smartest area . Quiet street, walk to the best shops, restaurants and the terrific food market 100 meters up the road. Very efficient and helpful staff and a great big bar with interesting drinks and an outside area.", "Date": "January 18, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "NYC", "Title": "“Luxury”", "Author": "bakfar", "ReviewID": "UR123132630", "Content": "A marvelous hotel with a wonderful luxurious feeling, superbly furnished rooms, fabulous bathrooms and incredible service. We paid extra for breakfast but it was worth it. I would recommend this hotel to anyone who wants to be treated wonderfully and in great surroundings in a terrific neighborhood.", "Date": "January 15, 2012"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "Manchester, United Kingdom", "Title": "“Luxurious City Hotel with Excellent Standards”", "Author": "BON_VOYAGE245", "ReviewID": "UR123128212", "Content": "Our visit here was for two nights over Valentines Weekend.. A while ago I know, but better late than never!! We stayed in deluxe penthouse suite.. This was an elegantly furnished room with separate lounge, a terrace with seating area, whirlpoool and also with that, the bonus of fantastic views.. The bed was extremely comfortable with luxurious bed linen.. The Clarins complimentary toiletries were an added treat.. as was the welcome of champagne and chocolate dipped strawberrys ( I presume a valentines special). The use of the Red Level Lounge is well worth the extra expense.. It serves breakfast for Red Level guests, then throughout the day continues to serve refreshments followed later by a good range of alcoholic choices accompanied by lite bites and a small tapas selection.. This was a nice way to start the evening before venturing out for dinner. I would recommend the restaurant downstairs if you want more choice for breakfast. The hotel has a classical elegant atmosphere, the staff are friendly and proffessional with impecable service.. The only negative is that it is a little too far from the Old Town which seems to have more choice of traditional spanish restaurants..", "Date": "January 15, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Sleep Quality": "2", "Rooms": "2", "Location": "5"}, "AuthorLocation": "Lisbon, Portugal", "Title": "“Below Expectations”", "Author": "NunoVaz", "ReviewID": "UR123064017", "Content": "I've stayed only one night in this hotel, chosen mainly due to the excelent reviews on Trip Advisor. The Hotel is very well located, near the main cultural and shopping venues of Madrid. The Hotel Restaurant was very nice, and the Bar was excellent. Nevertheless the room (a Deluxe Room, not the most cheap room) was crampy and noisy, which resulted in a not so good night sleep. Unfortunately, I wouldn't recomend this hotel...", "Date": "January 14, 2012"}, {"Ratings": {"Service": "1", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Sleep Quality": "4", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Vitoria, ES", "Title": "“The service devalues the hotel...”", "Author": "cristianemendonca", "ReviewID": "UR122733099", "Content": "Is unbelievable the service in Gran Melia Fenix!!! A hotel like that can't use the title 5 stars... The rooms are good (except the smalls bathrooms...) but the staff is really inefficient and impolite!!!! I don't recomend!!!", "Date": "January 7, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "London", "Title": "“Superb”", "Author": "Londongirl070", "ReviewID": "UR122513558", "Content": "Wow - this really is a luxury hotel. Quiet spacious rooms, luxurious linen and top quality service. Some people might think the bathroom's are small but I can't say I spent much time in the bathroom so not a big concern for us. We used the conceirge service before we arrived to book one of the best michelin starred restaurants I have ever been to (and I have been to quite a few). We told the hotel we were there for my parents significant wedding anniversary and they received champagne in their room and presents. They also notified the restaurant about the celebration and we received VIP treatment! It's worth the extra price to use the red level executive type lounge. We had breakfast and lunch in there almost every day and it was good value - including the unlimited champagne. The hotel is a bit far away from the old town (about a 15 minute stroll) but not so that it was annoying. Highly recommended and when I re-visit Madrid I will be coming back to this hotel.", "Date": "January 4, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Lytham St. Annes", "Title": "“The perfect place to see in 2012.”", "Author": "darren_entwistle", "ReviewID": "UR122397468", "Content": "Just spent 3 wonderful nights at the Gran Melia Fenix. Everything about this hotel is first class. Wouldn't hesitate to recommend.", "Date": "January 2, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "", "Title": "“Nice Hotel in Madrid”", "Author": "Shishito", "ReviewID": "UR122391514", "Content": "Very nice hotel. Location superb. Classy european feel. Would go back.", "Date": "January 2, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Washington, DC", "Title": "“excellent hotel!”", "Author": "reedcc", "ReviewID": "UR121835043", "Content": "I stayed her last Monday night for one night before heading south to Seville. This was by far the best hotel of my week in spain. The room was nicely decorated and the bath room was very luxurious. The bed extremely comfortable which was very welcome after traveling for a day and a half. The staff was very pleasant and helpful. We did not use the hotel restaurant as the breakfast was a little pricey, however there was a great spot around the corner that offered a delicious, inexpensive alternative.", "Date": "December 17, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Marbella, Spain", "Title": "“Just an excellent stay”", "Author": "MarinaMariolaESP", "ReviewID": "UR121820462", "Content": "Location,location and real 5 stars service.. Located in one of the best Madrid areas,great to walk around,shopping or dinning. Excellent welcome,check-in service,helpful staff,rooms,beds,pillow menu,minibar,facilities,breakfast,beautiful Martini bar. In our first day we had some demands for our 4 months old baby and the staff was highly helpful, even we asked for a baby cot and didnt charge us for the service.", "Date": "December 17, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Canterbury, United Kingdom", "Title": "“Wonderful experience”", "Author": "Gilda1967", "ReviewID": "UR121793843", "Content": "What can i say not too sound too cheese about this place? Firstly the location is fantastic, easy access from the airport via the underground. The staff could not be more helpful in giving advice about places to eat and the room was way above our expectation. Immaculate room and although we had the view on the courtyard it was without a fault. The bar outside was wonderful providing anything you dream off but indeed expensive. But sometimes you have to pay the price not as much as for the drinks but for the ambiance. Without a shadow of hesitation i would recommend this beautiful hotel.", "Date": "December 16, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "East Lyme, Connecticut", "Title": "“Very nice option for Madrid”", "Author": "TeamSmallState", "ReviewID": "UR121401009", "Content": "Stayed here for 4 nights over Thanksgiving. We were in Madrid for a sights and food trip. We upgraded to the Red Level. The room was great, sound proof with it's own small entry way. The room was pitch black and sound proof which came in handy following the Adventurous Appetites Tapas Tour (highly recommended for the more adventurous). The Red Level lounge was great for snacks and drink. A very well stocked bar. The concierge was very helpful and booked us for a fantastic Flamenco show. It seemed more local and less touristy and was a great show. I would stay here again. My one concern was the location when looking on the maps, however it is a relatively short and nice walk to most major sights. On the main strip but away from the crowds. P.S. Madrid is very underrated in my opinion.", "Date": "December 4, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Los Angeles", "Title": "“Excellent luxury hotel in a great location”", "Author": "ECrowther", "ReviewID": "UR121206879", "Content": "This hotel is top notch. The hotel staff is professional, courteous and efficient. We stayed on the Red Level (concierge), which means concierge service, a private terrace, lounge with free drinks of all kinds and a variety of snacks, including meats and cheeses, a tall bottle of water and fresh fruit in the room, and other services we did not have the time to explore. The room was beautifully and tastefully decorated and offered every imaginable amenity and all the conveniences and comfort of a modern 5-star hotel. The bedroom and bathroom were spacious, and our room included a small foyer, a separate area with a work desk and a walk-in closet. The Grand Melia Fenix is located on a major thoroughfare next to an upscale shopping district, just blocks from the historic heart of Madrid. If you like to walk, get a map from the concierge and stroll through the historic center, past the various plazas bustling with activity, to the Royal Palace and Cathedral. There are restaurants, tapas bars and pubs everywhere, so you can stop to eat or drink and rest your feet any time. That is the best way to see the city, and you can always take a taxi or the metro back to the hotel. For a superb meal, go to Alkalde, just 3 blocks away at Jorge Juan 10, serving lunch, tapas or dinner. This restaurant offers authentic and delicious Spanish cuisine and excellent service in a cozy environment. The concierge sent us there for dinner, and it was a fabulous experience.", "Date": "November 29, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Santa Barbara, California", "Title": "“gran melia fenix hotel madrid spain”", "Author": "shelley b", "ReviewID": "UR121177934", "Content": "My stay at the Gran Melia Fenix was delightful. The room was comfortable and the bathroom was stocked with all the amenities such as toothbrush and toothpaste etc...Breakfast was wonderful, everything was delicious and the service there was top notch. All the hotel staff was very helpful, kind and always available. I would recommend this hotel highly.", "Date": "November 28, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Ireland", "Title": "“Ideal for weekend”", "Author": "conagra", "ReviewID": "UR121129217", "Content": "Hotel is in good location and staff are very helpful and friendly. The restaurant is good for hotel dining and breakfast service was excellent. Location for shopping excellent. Remember that you are next door to a Hard Rock Cafe for taxi directions!", "Date": "November 28, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "egypt alex", "Title": "“excellent”", "Author": "bishay", "ReviewID": "UR120845700", "Content": "i stayed at the hotel from from the 8th till the 13th in red level room with my mum . from the moment you step in the hotel you smell lovely aroma . check in was in minutes thew room was lovely the lounge was really very nice got outside patio for smoker like me . I would like to thank Gemma she was more than helpful everyone was extra kind the break fast at the main restaurant was lavash i asked for tortilla con patatas was wowwwww everything u can ask for you can find everyone is smiling even when i asked about not that important info they look for the details print it out and handed to me one day i asked for green tea the receptionist at red level brought them by herself sure if i would visit Madrid again would stay there cause it is very close to the nice shopping area and transpiration very easy thanks everyone there", "Date": "November 21, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "London, United Kingdom", "Title": "“Jewel of Madrid for our customer event!”", "Author": "S6blr", "ReviewID": "UR120770910", "Content": "This past week I've hosted a VIP customer event and we reviewed 5 Madrid hotels and decided upon the Gran Melia Fenix and I am extremely glad we did. We had 6 employees and 14 customers join us for 3 nights and had nothing short of 5*, Thumbs-Up from all who came to our event. From the curb side friendly greeting, to our checkin on the VIP level lounge, every single staff member we came in contact was loverly, cheerful and helpful. We had a variety of Red-Level rooms, all of which had plenty of room, and amenities as well as access to the private lounge on level 7 so upgrading our rooms was well received by our visitors. Breakfasts were nice, plenty of choice and efficient with good seating in the AM's. We used the Dry Bar, and the general bar on 2 evenings and had great service, very comfortable seating and some wonderful cocktails. FYI, the Dry Bar is famous for their \"Dry Martini's\" which are really nice and will lead to you getting a certificate for drinking one (hiccup, or more). The location is pretty good for Madrid, but getting a large bus into the side street is a bit of a challenge so the 2 evenings we used one to go out, we found this harder to deal with, but it's not a black mark on the hotel we'd have to say. We also used the newly refurbished meeting rooms on -1 as well as the business centre and had good feedback from our VIP's on it. The meeting rooms are tastefully done, and our small concern about the polished stone floors being noisy were proven wrong when tables and chairs were in. Our instincts in selecting the hotel were well founded, and our VIP guests agreed we'd all like to go back there again.", "Date": "November 19, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Location": "4", "Rooms": "3"}, "AuthorLocation": "Les Gets, France", "Title": "“Good hotel, nice location”", "Author": "jenesaispasqui", "ReviewID": "UR120700629", "Content": "Good service, cosy hotel. Rooms a bit small, the view I had was not great.", "Date": "November 17, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "2", "Sleep Quality": "5", "Rooms": "3", "Location": "4"}, "AuthorLocation": "New York City, New York", "Title": "“Great service, small rooms, questionable views”", "Author": "NYCTraveler23366", "ReviewID": "UR120590641", "Content": "The Gran Melia Fenix in Madrid offered exceptional service, a friendly staff, and a pleasant home during our vacation. My only criticism is that even after paying for a Premium room which faces outward instead of facing the courtyard the room we got simply faced another building and offered no view at all. The upgrade was a total waste of money.", "Date": "November 14, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "3", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Kosice, Slovakia", "Title": "“You Can't Go Wrong”", "Author": "BeckyLM22", "ReviewID": "UR120578480", "Content": "We really enjoyed staying at this hotel. The rooms were very nice, spacious and luxurious. Bathroom was a little on the small side, but not a problem. Location was good, but a little too far from some of the main things I wanted to do/see. However, if you don't mind walking it is fine. Must say the staff was very helpful! I left my glasses in the room. I contacted the hotel in hopes they found them and could mail them to me. They responded to my email quickly and were happy to arrange shipping (at my cost). Thank you Gran Melia Fenix for your assistance and excellent customer service!", "Date": "November 14, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Cincinnati, Ohio", "Title": "“A superb place to stay”", "Author": "Taronti", "ReviewID": "UR120345748", "Content": "We spent a perfect 8 nights here in early November. This is a true 5 star experience in every way particularly if you purchase the red level. This gives you access to the seventh floor lounge. Here you can eat breakfast and a variety of hors d'oeuvres till 11pm. The lounge has a full bar, a red dressed concièrge at her desk waiting to help and, best of all, an iced magnum of good French champagne right at the entrance. The concièrge service is excellent, Gemma being particularly helpful. It is somehow nice never having to deal with the ground floor. The rooms are beautifully finished and clean. Ours had a nice view over the Plaza Colon and was very well soundproofed apart from some creaking from the floorboards above. Our room was promptly made up each day while we had breakfast. A plate of food and some liquid refreshment (water to cava) appeared in the room each afternoon. I was initally dismayed as the matress of our king bed felt hard but I slept like a baby. I cannot recommend this hotel too highly.", "Date": "November 8, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Athens, Greece", "Title": "“A beuatyfull - no surprises hotel”", "Author": "happy_kampy", "ReviewID": "UR120330049", "Content": "Enjoyed everything in a classical atmosphere. The location was great. Should take off this ugly sign on the top of the hotel.", "Date": "November 8, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Adelaide, Australia", "Title": "“Lovely hotel”", "Author": "Natasha T", "ReviewID": "UR120318912", "Content": "Really enjoyed our 4 night stay in Madrid with family of 5. Expensive but lovely rooms, well appointed, good size, nice decor and good bathroom. Position is excellent for Salamanca, great up market shopping district, cafes and restaurants. Not close to other attractions but tourist red bus stop is very close and easy to use and a good way to see Madrid. Staff were excellent, especially Eduardo at front desk, very helpful. Breakfast was excellent, food great and staff friendly. Lovely hotel, in quiet district with good facilities.", "Date": "November 8, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Toronto, Canada", "Title": "“Nice stay, very helpful front desk”", "Author": "JuliaC509", "ReviewID": "UR120172489", "Content": "Best hotel of our tour to Spain, Portugal and Morocco. Very helpful front desk and concierge. The restuarants they recommended were excellent.", "Date": "November 4, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Sleep Quality": "4", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Nottingham, United Kingdom", "Title": "“OK - but average in this price range”", "Author": "markpjarvis", "ReviewID": "UR119900466", "Content": "A decent hotel with good service and amenities but in this price bracket no more than is expected. The rooms are quite well appointed if a little small. The bathrooms are OK with some nice touches such as a grooming set with razor/shaving foam/toothbrush & paste. The location is convenient for the Salamanca area of Madrid with its designer shops. The Prado is about a mile to the south. The cocktail bar/terrace is pretty good and worth it for the people watching. Breakfast is quite extensive with almost everything you can think of on offer - but again nothing that \"wows\"!", "Date": "October 30, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Recife", "Title": "“Gran Melia Fenix Madrid”", "Author": "F_Costa_11", "ReviewID": "UR119853942", "Content": "Just Ecellent. We satyed for fiv days at the Hotel. Great location, walking distance from all great restaurants. Very clean and confortable room, Excelent service at the front desk and the same for Concierge. We had a wonderfull time at the Madrid and for sure the Hotel helped a lot.", "Date": "October 29, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Issaquah, Washington", "Title": "“Gran Experience!”", "Author": "SFore", "ReviewID": "UR119766391", "Content": "Having never been to Madrid, I had no idea where to stay, but based on fellow TA members' reviews, I decided to take a gamble on GMF. After spending 4 nights there last week, I have to say I was very pleased with the service and stay we experienced. When I made my reservation on their site, I signed up for the Leading Hotels membership which got me a room upgrade and several other nice amenities during our stay including a nightly treat brought to our room! Everyone was very courteous and our room was left impeccable every day when we got home from a long day of exploring the city. My only gripe was that there was no Wi-Fi accessible on the first floor, you had to go down to the lobby. Our free daily breakfast (LHOTW Card Perk) was very nice and we enjoyed a great meal in their restaurant. The concierge helped us with all of our dinner reservations and any other need we had. I'd def stay there again!", "Date": "October 26, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Jerusalem, Israel", "Title": "“Vacation in Madrid”", "Author": "Benben2011", "ReviewID": "UR119574497", "Content": "excellent service, very comfortable room and very rich breakfast. This is the second time we have been there and we got the same service.", "Date": "October 22, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Sleep Quality": "3", "Rooms": "4", "Location": "4"}, "AuthorLocation": "London", "Title": "“Good hotel close to Plaza de Colón”", "Author": "Londonsense", "ReviewID": "UR119505746", "Content": "I have stayed at this hotel many times when in Madrid, mostly for one or two nights at the time. The check in procedure is consistently swift, and the front office staff are very courteous. If anything there seem to be too many people behind the desk, and roles are not really clear since the reception and concierge desks are one and the same. The issue with that is that you might end up waiting to check in while another customer is getting copious information about good restaurants in Madrid. In a couple of instances the key did not work, therefore I had to return to the front desk, which is annoying but not unheard of. The room size and layout are normally good, but when it comes to the position, it gets trickier. I have been in rooms that pracitcally face a wall on the first floor, and others that face the square on the sixth floor, all for the same price, therefore use your charme wisely upon check in. While the quality of the bed is average, the pillow quality is definitely below average. Most times I have been able to get a decent pillow after asking for it. The acoustic insulation is not great, and at times you can hear the next door neighbour watching TV or the traffic outside. The toiletries are really good, with complimentary shaving and dental kits. While free, wireless access is a bit of a pain, since you need to keep inputting the password every time your iPhone goes on stand by, and also need to get a new password every 24 hours. Breakfast in the morning is really nice but expensive if all you want is coffee and a croissant. The restaurant can only offer the buffet breakfast (one of the best I have seen), which comes with a €28 price tag. Why not introduce a more basic or continental version for people that do not want to splurge? Will definitely stay again.", "Date": "October 20, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Hong Kong, China", "Title": "“Top class hotel in Central Madrid”", "Author": "jerchung", "ReviewID": "UR119503637", "Content": "Gran Melia Fenix is right at Plaza De Colon, where there is a tourist information centre, a few metro stations from Sol, Gran Via, Prado, Santiago Bernabeu, etc. And also, with the high end shopping district of Salamanca right on its back. So, it's very convenient. The outlook of the hotel building is rather nonedescript. The indoor deco of Gran Melia Fenix is far from chic or stylish, a bit dated but very grand, e.g. the red carpeted stairs, the marbled lobby, the chandelier, etc. The room we got was on the Red Level. I assume only if one asks, the hotel would suggest an upgrade to the Red Level (not for free though). Such upgrade, at 80E per day in our case, was well worth the money. Private check-in, free buffet breakfast, snacks, free flow of soft drinks and even hard liquors and champagne all day plus free unlimited use of Wifi are all included in that price!! The room itself was reasonably sized. As other reviewers have commented, the bed was very comfortable. With double glazed windows, the room is practically insulated from any noise from outside despite its being on a rather busy main street. Sevice of the staff was superb!! On one occasion, I asked for a LAN cable but there was none at the Red Level lounge. I was asked to have some snacks and a drink first and the cable would be delivered to my room direct. I only stayed for a while but when I got back to my room, the cable was already there!! Also, while I was told that Hard Rock Cafe, which is situated on the G/F of the hotel, does not acept any reservation, the staff nevertheless made a call and did get me a reservation on a very busy Friday night!! Too many good things to say about this hotel, simply excellent!!", "Date": "October 20, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "London, United Kingdom", "Title": "“Ticks all the boxes”", "Author": "The_Traveler_011", "ReviewID": "UR119336651", "Content": "Very nice hotel located right in Plaza De Colon so it's also very convenient. The rooms are well appointed and comfortable. The hotel itself is well maintained, and the staff have always been helpful. There are many restaurants nearby the hotel, and the Hard Rock Cafe is right next door as well. The bar is very nice for a late night drink and it's not quiet and not too loud. I've stayed in this hotel several times and its always consistently very good.", "Date": "October 15, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Glasgow", "Title": "“Good place to stay in Madrid”", "Author": "Hopefulglaswegian", "ReviewID": "UR119334538", "Content": "Nice hotel in Salamanca district. Supreme room was of a reasonable size and well furnished/equipped. Too few hangers only complaint. Our room overlooked Plaza de Colon. It was very quiet thanks to secondary double glazing. Within 15 mins walking distance of Prado and further 10 mins to heart of the old town. Surrounding area is pretty up-market with many shops and reasonable restaurants. Plenty of taxis (about 6 euro to Plaza Mayor) and underground close by. Staff v friendly and helpful. Breakfast fine with lots of fresh fruit. Pastries were disappointing though. The Dry bar at the front of the hotel is a good place for a pre or post-dinner cocktail. Worth getting a Madrid Card if you want to avoid standing in queues for the Royal Palace and major museums. We got a one day travel pass with this for free which was useful, not sure if that was a one off deal or not.", "Date": "October 15, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Swindon, United Kingdom", "Title": "“Fantastic Hotel”", "Author": "RDE411", "ReviewID": "UR119154087", "Content": "Fab hotel, beautiful decor, excellant service and welcome. Stayed 1 night while on a business trip, I will definatley return. It was an overall wonderful experience.", "Date": "October 10, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "3", "Sleep Quality": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Bangkok, Thailand", "Title": "“Very good hotel but a few glitches”", "Author": "rathin100", "ReviewID": "UR119071435", "Content": "The hotel is well appointed with excellent amenities, comfortable bedding, first rate housekeeping friendly concierge.I had a room with a view the rooms are NOT large(I had a premium room) ok for me as solo but would br ceramped for 2, I think. Two major glitches (1) Poorly designed toilet the bathroom in my room was cramped, if well appointed. The toilet was jammed in such a way that it could not be straddled so sitting on the pot is an unpleasant experience (2) booking is a mess. First I booked on melia.com was promised a 40. euro voucher online this never came despite calls to the website the hotel guest relations also tried but nothing came of it. This is annoying. Don't like being lied to. This is, in fact, fraud but the amount is too little to botherAt checkout I was told someone from melia would get back to me --no one offered to give me an equivalent credit ---- but of course no one has. the hotel is very careful to emphasize that it is a separate entity from the booking service melia.com, and they probably are, but this is no use to customer. Melia seems to be a sleazy chain. Be careful. second the night before I checked out I asked for express checkout --because the reception is tiny and I'd noticed morning queues. No one knew what I was talking about...amazing! The next day I had to queue as a result. Sloppy. I stayed 5 nights and overall the stay itself was comfortable. Let down by sleazy brand and poor front office knowledge Oh and don't bother eating or drinking in the hotel. The bar is excellent and I used it, but found later Much better value all around the neighborhood, including breakfast just across the road at less than 10 euro", "Date": "October 8, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Denver, Colorado", "Title": "“A home away from home!”", "Author": "armando q", "ReviewID": "UR118933896", "Content": "This was a wonderful experience in every way. The hotel public areas are beautiful, comfortable, and inviting. Great restaurant; and terrace bar is a terrific place to relax and enjoy drinks. The buffet breakfast has great variety of offerings. Room was spacious, very comfortable, and well-equipped. Hotel service was superb. Special thanks to hotel staff who are professional and caring. This is no doubt a very well-managed luxury hotel.", "Date": "October 4, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "London", "Title": "“Stylish - Good Location”", "Author": "KevinLondon", "ReviewID": "UR118902514", "Content": "Booked here after being told about the hotel by a work colleague, it was stylish and elegant. We were told we were upgraded but the room was fairly small to what we are used to, the room was well kept and clean, staff were friendly and helpful. The location was good and we could walk almost anywhere into SOL took about 25 minutes, Saturday and Sunday are quiet in Madrid so it easy to travel by bus. Great city to spend a weekend.", "Date": "October 3, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "", "Title": "“Una GRAN experiencia!”", "Author": "Eframp", "ReviewID": "UR118605910", "Content": "We returned two days ago from a week at the Gran Melia Fenix and it was wonderful! After having been in Madrid twice before, we were pretty familiar with the area and knew that the hotel was in a wonderful location. We booked a room on the Red Level and it was definitely worth the price...breakfast in the morning and delicious snacks and drinks until 11pm. The staff of the Red Level was very helpful and definitely made it their mission to make sure that we had the best trip possible. Not only did they help with activities and restaurants in Madrid, but they also were available to answer questions about trips outside of the city. Our room was large and very comfortable, with a private terrace outside that we used every evening. The hotel itself is clean, comfortable, and has every amenity imaginable for a wonderful trip to Madrid. I strongly recommend this hotel and we will definitely stay there again if we return to the Spanish capital. Thank you, thank you to the entire staff of the Gran Melia Fenix!", "Date": "September 26, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Seattle, Washington", "Title": "“Excellent Choice”", "Author": "SeattleDowntown", "ReviewID": "UR118574265", "Content": "Stayed here for three nights on a vacation trip in August. Paid extra for the spa tub room which did have a wonderful balcony but the water was not heated so was not really able to use the outdoor spa. I like Melia for the European charm and this hotel has loads of it; beautiful building. Room was well appointed and very clean.Room also had double windows so was very quiet with no street noise. Service staff was very friendly. The front door staff was the only real weakness as not very attentitive. Overall, I'd stay here again and would recommend.", "Date": "September 25, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Herts.", "Title": "“Elegant yet warm and friendly”", "Author": "CorneliusC", "ReviewID": "UR118564144", "Content": "Having stayed at the Solmelia hotels in Palma and Seville, I decided to choose the Gran Melia Fenix for a three-night leisure trip to Madrid, and was not disappointed. From check-in to check-out, all the staff were unfailingly pleasant and helpful - and genuinely so. I chose a supreme room, which had an admittedly 'middling' view, over the Plaza de Colon, but it was worth paying the extra for a spacious room, complete with a huge bed, writing desk, comfortable armchair, iPod dock, and - very welcome at siesta time - a gorgeous chaise longue. The room was extremely quiet, and the bathroom was fine, with a very effective shower. I can't quite get to grips with the Melia pillows (two long and two square), but that's my problem! Breakfast offered a huge assortment of choices, including some typical Spanish items such as churros - everything from yoghurts and fruit to bacon and eggs. I can recommend the ensaimadas. Tea or coffee was served within moments by the friendly waiting staff. The hotel is in a very chichi part of town, close to e.g. Prada and Loewe boutiques, so shopaholics will be in seventh heaven. There are plenty of places to eat nearby, from cheap cafes to more expensive restaurants. The Prado etc. are a reasonable, and pleasant, stroll down the Paseos Recoletos and Prado, and personally, I liked the area; however, it is a little further to e.g. the Palacio Real and Plaza Mayor - but still manageable on foot, or you could grab a cab or the Metro. If I was visiting Madrid as a tourist again I might stay more to the west of the city, but otherwise I'd have no hesitation in returning to the Fenix, or in recommending it to others.", "Date": "September 25, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Mexico City", "Title": "“A great hotel at a great location”", "Author": "Aquiraz", "ReviewID": "UR118535621", "Content": "This location is the best: Calle Hermosilla at the corner of La Castellana, one block away from the Monument to Colombus. Walking distance to every place: El Prado, La Chueca, La Cibeles, La Puerta de Alcala, el Parque del Retiro, downtown... Simple and fast access to every corner of the city, and right at the Barrio de Salamanca, the \"in location\" to be in Madrid. The hotel is great... welcoming entrance, nice lobby, very good bar (the Hard Rock is there too... entrance on the back), the right rooms and nice and friendly people and service. The prices are also right... you can get some good deals, try it. It is the place I will stay very time I need to return to Madrid.", "Date": "September 24, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "New York City, New York", "Title": "“Service”", "Author": "Ekoi", "ReviewID": "UR118375771", "Content": "This is what a hotel should be: the service, the rooms, the food, the bar... What is there to add? This hotel is located in the heart of Madrid: the Retiro parc is a 500 m from it, so are all the beautiful boutiques. We went to Madrid to see the Real play. It was my birthday gift to my husband. I chose the Gran Melia because it was not too far from the stadium. I did not expect such old fashion luxury and reception. The staff is very efficient and will get you whatever you need and can recommend all the right sightseeing, specially for such a short trip. We will go back to this hotel, but for a longer stay. This hotel is as elegant as the city of Madrid.", "Date": "September 20, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "San Juan, Puerto Rico", "Title": "“This is What a 5* Hotel is All About”", "Author": "Mendonut", "ReviewID": "UR118342249", "Content": "We have stay in this hotel many times, my favorite hotel in Madrid. Location: The best, just a rock throw away from Serrano St. (for shopping and dinning), and near to everything. We always walk to Puerta del Sol, a nice 15 minute walk. The Hotel: Common and reception areas look and are sparklingly clean. Everything always looks new and shinny. Staff: Superb and well trained personnel, very professional, discreet and accommodating, including the very respectful chambermaids. Flawless service (porters, reception and bar areas). Beautiful bar area. The room: Roomy, superclean, spacious, big size bed, heavenly bed and pillows, and amenities. Room service: Perfect presentation. One of the best meals I had on this trip. The restaurant is also very good, with a nicely price wine list.", "Date": "September 19, 2011"}, {"Ratings": {"Location": "5", "Overall": "5.0", "Value": "5", "Service": "5", "Rooms": "5"}, "AuthorLocation": "Tel Aviv, Israel", "Title": "“Excellent”", "Author": "Anna_Guri", "ReviewID": "UR118309093", "Content": "This was an exceptional experience! Great hotel. The staff was extremely helpful, friendly and professional. I will definitely consider this my favorite place to stay in Madrid.", "Date": "September 19, 2011"}, {"Ratings": {"Location": "5", "Overall": "5.0", "Value": "5", "Service": "5", "Rooms": "5"}, "AuthorLocation": "Geneva, Switzerland", "Title": "“wow!!! what a pleasant surprise”", "Author": "DRC1957", "ReviewID": "UR118121001", "Content": "I made a reservation for a good room at the red level . And this is my 3rd stay at this hotel.The room was supposed to be nicer that a standard room, and you have amenities like exclusive check-in at the 7th floor in a lounge that serves breakfast (great buffet + nespresso coffee) and from 11 am they keep all sorts of great finger food and drinks , as well as tea and coffee at the clients discretion. no extra charge. Free morning paper , and some other perks. At check in I am being told that I am getting an upgrade.......upgrades are always nice , but....they gave me the presidential suite. I was speachless. From then on, it was a sweet ride. I extended my stay by 2 nights (of course I had to pay up, but the suite and the service were worth it. I ll book this \"red level\" again next time....even if upgrade will probably not happen again.", "Date": "September 14, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Location": "5", "Rooms": "5"}, "AuthorLocation": "", "Title": "“Extraordinary service in Madrid with luxury and location”", "Author": "MarinaGuy", "ReviewID": "UR118023404", "Content": "Just spent two nights at this hotel in the Red Level rooms. Probably one of the best experiences my wife and I have had in a hotel and we've stayed in many nice ones. The Red Level is pricey but well worth the luxurious rooms and unbelievable service.", "Date": "September 12, 2011"}, {"Ratings": {"Location": "5", "Overall": "5.0", "Value": "5", "Service": "5", "Rooms": "5"}, "AuthorLocation": "NYC", "Title": "“feel like a royalty”", "Author": "FC111", "ReviewID": "UR118022939", "Content": "Hospitality and the hotel location are perfect. I felt very \"home-like\" this hotel. Very classy and the service is outstanding. Extremely friendly and polite staff, especially Maria – Lady in Red, Jesus – the sweetest guy from reception and all of the staff members responsible for the breakfast. The Hotel is simply wonderful and you'll feel like a Royalty! And...the Dry bar and it's staff - absolutely perfect!", "Date": "September 12, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "4", "Service": "5"}, "AuthorLocation": "Munich, Germany", "Title": "“A class of its own”", "Author": "UncleSamDavid", "ReviewID": "UR117741153", "Content": "The Gran Melia Fenix is a member of the \"Leading Hotels of the World\"; and yes, it is leading indeed. From the very first step into this fabulous place, you can see, feel, and even smell the distinction to other hotels. The always smiling, helpful porter leaves a perfect first impression, the friendly reception staff is attentive and makes you feel at home immediately. All the staff members of the Gran Melia have a particular greeting by putting their right hand over their hearts - that's something special! Talking special: The lobby even has its own scent. We learned that also in your room you have a choice of different scents - they actually have a menu for it! We have not seen this in any other hotel. We got a Leader's Club Upgrade to a Red Level Grand Premium Room with Jacuzzi, the check-in is done separately at the Red Level Lounge on the 7th floor. The lounge is also the place for the large breakfast buffet (7.30am to 11am) and offers an impressively well-stocked complimentary open bar and a variety of canapés from 1pm to 11pm. The amiable Red Level Staff is offering outstanding, personalized service on an excellent level. Most great hotels have one or two employees who take the extra step and provide supreme service; here at the Gran Melia everybody - the chambermaids, the room service, the technicians, the restaurant manager, the bar team, reception, lounge staff - everybody provides distinguished, first-rate service above expectations. To reach this kind of level - and keep it - is a brilliant achievement of the Gran Melia and well worth to be mentioned here. Our room was of appropriate size, tastefully furnished and had a private balcony and an outdoor Jacuzzi (good enough for two), which was a treat in the August heat of Madrid. They put two sun beds on our terrace, so we could start relaxing immediately. The large bathroom with separated toilet and bidet was equipped with Clarins amenities. Also notable: There were always enough fluffy towels available, and the housekeeping changes them two times a day. We greatly appreciated the free WLAN. Other hotels, even 5-star ones, still do charge for common service like this. This review wouldn't be complete without mentioning the hotel bar. A large counter shows the number of Dry Martinis served - if you order one, you'll get a certificate with your name and number on it. The bar has an indoor part and an outdoor lounge, which is open to the general public from 6pm on. There are so many luxury hotels in the world, it's not easy to stand out from the crowd. The Gran Melia Fenix however has achieved that distinguished level. That's why we think it is a class of its own.", "Date": "September 6, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Melbourne, Australia", "Title": "“EXELLENT”", "Author": "frank b", "ReviewID": "UR117206009", "Content": "This hotel was excellent. From the service to the rooms. I would highly reccomend their own restaurant. Its a must !!", "Date": "August 25, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "4", "Service": "5"}, "AuthorLocation": "Portugal", "Title": "“Wonderful Stay...”", "Author": "Kate2005", "ReviewID": "UR116703591", "Content": "Wonderful stay at Gran Melia Fenix... The staff was incredible nice and our room - deluxe room - was amazing, clean and spacious. After been recused in a restaurant for not having reservation we went back to the hotel bar and ate there, and it was almost a gourmet experience... Very nice... We have nothing more to say unless we would stay again, next time in Madrid.", "Date": "August 14, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "4", "Overall": "4.0", "Value": "4", "Service": "5"}, "AuthorLocation": "Northeast FL", "Title": "“Best location for stylish shopping and restaurants!”", "Author": "SoBeachPalms", "ReviewID": "UR116301095", "Content": "LOCATION: This location on Hermosilla was ideal. Close to all public transport, Plaza de Colon, and upscale shopping. Serrano street is 1 block behind hotel. Best shopping there, and also on all the side streets off Serrano. The trolley sightseeing bus also stops on the corner (recommend it for 2 days). HOTEL: PROS:Beautiful in an ornate way. Join their free Rewards Program (mas), when you check-in and you'll get 1 breakfast free for every 1 you pay for. The breakfast buffet is scrumptious, and probably the only good fresh fruit you'll get the whole time in Madrid. A great Italian restaurant down the street, La Nicoletta, was outstanding! Best meal we had the whole time. Very safe area. CONS: The outdoor hotel bar is busy at nights, and the drinks are very pricey. Can't get just a cup of coffee in the morning, my husband asked for 2 cups of coffee only at the breakfast buffet, and was charged 12 euros! Usually would be about 4 euros max! Rooms are small, but all are in Madrid hotels. No airport shuttle, neighboring hotel (Petit Palace Embassy) where our son stayed, had free airport shuttle and we used it with him to get to the airport, for free! The concierge desk wasn't very knowledgeable and had to Google for their recommendations.", "Date": "August 5, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "5", "Overall": "4.0", "Value": "4", "Service": "4"}, "AuthorLocation": "", "Title": "“Above Avearge Hotel in Decent Location”", "Author": "SayafK", "ReviewID": "UR116125338", "Content": "Gran Melia Fenix was a very good Hotel, in a decent location close to great shopping and convenient to subways (Serrano and Colon), but as an avid Leading Hotels traveler, I must say I expected just a little more. I wouldn't completely write it off, when in Madrid again, as the staff, location and breakfast were very, very nice, but I didn't feel the overall hospitality that usually comes w/Leading Hotels. Here are some of the reasons for my verdict: Although early check in was honored, we still had to wait over an hour for the room to be made available (not really pleasant after a 14 hr. cross Atlantic commute). They allowed us to choose between two rooms (a very nice gesture) : A larger one w/view of a wall, and a smaller one, with a very nice view. Since view is very important to us, we ended up picking the smaller one, only to find out, it lacked a coffee maker (which would have been in place in the larger room as described in the details of our reservation) and an ironing board. They brought both AFTER we requested them, only to take away the ironing board the next day :( If room changes occur unexpectedly, they should be done w/the same amenities as would have been available in the original arrangement (IMHO:). Concierge was friendly but not so helpful. Example: WE requested a map of Segovia as we would be headed there the next day, only to be told \"We have a map of Madrid, but not Segovia\"... Well, w/in 5 minutes of the conversation I got on the PC and made a crude map of the requested city through the Trip Adviser website.... Hmmmm I found it odd that I could be so..... \"Creative\" in finding a map to a very popular destination nearby, but the concierge couldn't.... I should also mention recommendations for dining establishments were no different than what I had already found on Trip Adviser.. And in some cases directions were clearer online than through concierge. On the positive side, as mentioned before, the breakfast staff is fantastic, and pre-arrival correspondence is very prompt, professional and pleasant (Sandra and Sylvia in particular were outstanding :). OH, HUGE POSITIVE: Their fitness facility is under renovation so Gran Melia made arrangements for guests to use a nearby facility (Reebok Fitness Club 4 blocks away). Let me tell you, initially you may be turned off to have to leave the hotel for your workout...... UNTIL you get there.... ABSOLUTELY fantastic facilities. It's an upscale fitness club complete w/Steam rooms, state of the art equipment and with a tanning terrace worth visiting just for panoramic pics of Madrid. Worth going to JUST FOR pics off the terrace even if you're not working out (do wear gym attire if you go as you will not be admitted otherwise... Very, very impressive. I can't emphasize it enough. Gran Melia truly impressed me in this arrangement for it's guests. Hope this helps :).", "Date": "August 1, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Minden, Nevada", "Title": "“the staff made it a Very happy birthday”", "Author": "agreekgodess", "ReviewID": "UR116086814", "Content": "when we checked in the very nice front desk man noticed on my passport that it was my birthday, After wandering all around Madrid for the day we returned to our room to dress for dinner and we were greeted by a bottle of champagne on ice and a beautiful piece of cake. So thoughtful!! The room was lovely and the bed was so amazing we slept way too long. I would for sure stay here again.!", "Date": "July 31, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "4.0", "Value": "4", "Service": "4"}, "AuthorLocation": "Paris, France", "Title": "“very nice and spanish”", "Author": "Justanotherguest", "ReviewID": "UR115834003", "Content": "nice hotel , we had a corner suite, very nice and spacious, service is good, breakfast is very good, location is fine, lots of shops and restaurants nearby, a serious hotel. Fitness center was under renovation so we did not use. They accept small pets.", "Date": "July 27, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "4", "Service": "5"}, "AuthorLocation": "df", "Title": "“Very nice classy hotel”", "Author": "yomeramera", "ReviewID": "UR115756557", "Content": "Adapted in an old typical Madrid elegant building, this hotel has a lot of charm. It is just like a small version of Palace hotel in Madrid where a cozy lobby shows a stained glass at its roof. As you get in, you can see an exquisite, stylish and well preserved spiral stair and you can inmediately imagine what the athmosphere of this mansion was in its early days. Rooms are furnished following the epoque with lots of related details ( curtains, paintings, lamps etc) but well adapted to actual needs . Bed is comfortable with lots of pillows to choose from and a nice duvet. Bathroom is all marbeled with 2 sinks and the wc sepparated from the tub/bath area. Windows are soundproof and our room - I guess the others too- had double door so you cannot hear anything going on outside. Common areas as well as room corridors are in perfect shape: carpets, chandeliers etc. Breakfast as a buffet is quite acceptable with a good service: variety of fruits, cold meats, bakery, cheese and ommelets you can order. Location is great not just because you are at the most refined ( and shopping heart !) area in Madrid but because you have a Metro station just a block and a half away so you can go anywhere from there . Besides this,the hotel is just at the corner of La Castellana Av where you can find not only nice bars at its corridor itself but the main bus lines as an alternative transportation option. In summary, if you have the budget, do not hessitate.", "Date": "July 25, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "4.0", "Value": "4", "Service": "4"}, "AuthorLocation": "", "Title": "“Good value”", "Author": "robert08061963", "ReviewID": "UR115723072", "Content": "Well located, with a nice large room, a confortable bed and a good bathroom, though the shower could definetely be better. Breakfast is fair, the average Spanish style but nothing special. And in case your bunsiness schedule allows, it is 15 minutes away from Puerta del Sol, very convenient .", "Date": "July 24, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "New York, NY", "Title": "“Amazing Hotel”", "Author": "slf27", "ReviewID": "UR115529066", "Content": "My boyfriend and I stayed at this hotel for 3 nights, and WOW, what an amazing hotel. We arrived early (around 9am) and were promptly able to check in (which was amazing, given the fact that not many hotels allow early check in). Our room was spectacular - the bed was a real queen/king bed (not the typical european push-two-twin-beds-together and call it a king type bed), the bathroom was really nice (covered in all marble), and the lobby was gorgeous. We got a great deal from DHR.com that included breakfast, which was fantastic. The breakfast buffet was very elegant, and offered over 150 items (which is great if you're a picky eater). The location is also great - right near the Metro, Prado and Park, and about a 10-15 minute walk to all other main attractions. Overall, I loved this hotel. I would absolutely stay here again, and would recommend this to anyone looking for a luxurious hotel in Madrid.", "Date": "July 19, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "4", "Service": "5"}, "AuthorLocation": "Los Angeles, California", "Title": "“Best hotel I've ever experienced”", "Author": "Ale3940", "ReviewID": "UR114741323", "Content": "I stayed at the Gran Melia in mid-May with a friend, and for this hotel alone, I'd go back to Madrid. In short, it was the best hotel I've ever experienced and was clearly a Leading Hotel of the World. Our room was on the Club Floor, which is perhaps why it was so extraordinary. That floor includes a gorgeous breakfast spread (open until 11 each morning) of the most delicious, high quality foods: Iberian ham, fresh fruit, eggs, cereal, and every kind of beverage imaginable. In the afternoon, this club room has appetizers and snacks, changing throughout the day into the evening. Though I did not take advantage of the alcohol provided, I imagine that having a cocktail out on the club patio would be a delight. When we checked in, we were given private Club-Level check in. And they let us in our room several hours early since we had arrived from the States and the room wasn't occupied. That extra touch really made a difference! The room itself had a wonderful, private patio with a private jacuzzi. And it was a modern, clean, wonderful jacuzzi, just for our room, which they heated to our specifications! Imagine sitting in a hot tub outside underneath the Madrid stars--it doesn't get better than that. The beds were very comfortable, the room service was delicious, and all in all, it was a terrific stay. I can't wait to return. During our two-week European trip, our stay at the Gran Melia Fenix in Madrid was the highlight!!", "Date": "June 25, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "3", "Overall": "3.0", "Value": "3", "Service": "3"}, "AuthorLocation": "California", "Title": "“Gran Melia, Middle of the road”", "Author": "cwcharacters", "ReviewID": "UR114692130", "Content": "Stayed at the Gran Melia Fenix for pleasure and found it to be a mixed bag. Located in an easily accessible area for sightseeing, walking and metro, the hotel is a generally well cared for, old-style property, and is appealing looking. The room, while nice, was quite small even for a \"deluxe room with a view.\" While we were there, the fitness center was \"under renovation,\" and the only thing originally offered guests as a replacement, was to go to a nearby health club for a fee. After discussion with the Manager, that fee was waved for us. Recommended city dining by the hotel staff fell short of expectations, as did our request for \"must sees\" in the area. Dining in the hotel was also generally sub-par, with the exception of the breakfast buffet, which was quite tasty. One odd thing that happened was that, during a rainstorm, the elevator shaft begain leaking and water literally poured out between the elevator car and it's door, thus shutting down one of the few elevators in the hotel. Finally, we were not told that we would have to endure the floor below us being painted. The fumes from this work traveled upwards into our room, creating an unbarable, toxic-like smell for 2 days. We kept the windows open during this time, but it was miserable none-the-less. So, would I stay at the Gran Melia Fenix again, probably not. However, I'd have to qualify my review, given the fact that some of the happenings during our stay were \"anomalies.\"", "Date": "June 23, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "4.0", "Value": "3", "Service": "4"}, "AuthorLocation": "Mumbai (Bombay), India", "Title": "“Well located, nice, clean, fun”", "Author": "nehapremjee", "ReviewID": "UR114661963", "Content": "This was a really nice hotel in Madrid- good standards, easily accessible to the rest of the city, well located. Great amenities within the hotel as well; i particularly liked the old charm of the sitting room outside. A little small, but not to the point where it is a problem.", "Date": "June 23, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Melbourne, Australia", "Title": "“Great place to stay in Madrid.”", "Author": "Michelle9406", "ReviewID": "UR114661518", "Content": "Great hotel. Really terrific young(ish) staff who will do all they can to help you. Rooms well appointed and spacious. Room service very good as is the restaurant and bars. Location of hotel is excellent, away from the noise, but close to all main sights and attractions.", "Date": "June 23, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Newcastle, United Kingdom", "Title": "“perfect in every way”", "Author": "scunner67", "ReviewID": "UR114253375", "Content": "just returned from a few days in Madrid. I often use the Leading Hotels of the World website or brochures to choose a hotel, and the one LHW recommended was the Fenix. The hotel is in a great position, it really is only 15-20 minutes away from the main sights, Prado, Retiro, city centre etc... and if you want, the metro is right outside, the buses too. The hotel is in a very upmarket part of town and is very pleasant to wander around these streets at any time. But what was even better was the hotel itself. We are big on hotel quality and this one did not disappoint in any way. I had booked a room with Red Level facilities, which includes a private check in, and private lounge facilities. The facilities were second to none, the lounge was very comfortable and spotlessly clean, there was an outdoor terrace where you can enjoy breakfast and champagne! The staff worked tirelessly to make ours (and everyone's) stay as first class as possible - everyone spoke perfect English, and were very understanding of my rudimentary Spanish - they could not have done more. Gemma especially made us so welcome on our first night, suggested where we could eat, even booked a flamenco show for us, told us exactly how to use the public transport, how much everything cost, which buses to take, which shops to go to, how to order tapas... everything in fact! If she is a product of the hotel chain's training programme, then my congratulations to them, they are obviously world class at this game! In fact there was no member of staff from porter, to doorman, to concierge to mamager who failed to impress with their high level of service and courtesy, always polite, smiling, eager to help.... a credit to the hotel and the Madrilenos I also considered staying at the Ritz for my visit - I mean no disrepect to that venerable institution, but I doubt they could have bettered this exceptional hotel on all counts. I would not stay at another hotel and will let everyone know who visits this city to book their stay here. Thank you FGM for a wonderful stay - I look forward to coming back soon!!!", "Date": "June 18, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "4", "Service": "5"}, "AuthorLocation": "Houston, Texas", "Title": "“Exceptional”", "Author": "StevoA", "ReviewID": "UR114176449", "Content": "The staff provided fast friendly and efficient service. The hotel offered a FREE breakfast that is by far the best and most extensive of any buffet breakfast I've had, everything was top class. Very centrally located, you can hop on the tour buses that take you around the city at the corner of the hotel. The Hard Rock Cafe is also attached to this hotel and provides a list of live shows that are performed right at the base of the hotel, this may be annoying for anyone wanting to get sleep during the day, the windows are pretty sound proof but not all the way. Room was excellent with a lot of attention to detail, internet is complementary but it is wired, wireless can be accessed in the lobby, free as well. I will definitely consider this my favorite place to stay in Madrid.", "Date": "June 18, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Santa Fe, New Mexico", "Title": "“A True Five Star Experience”", "Author": "ToviHannanhJoah", "ReviewID": "UR113935200", "Content": "From the professional staff at registration, to the lovely lady who provided turn-down service each evening, this hotel is well worth the price. Its location is excellent, and close to great shopping. It is a ten-minute taxi ride to the Prado, Sofia, and train stations. Guest rooms are very special -- luxurious in every way. The common areas are not only beautiful, but comfortable, as well. This was our first trip to Madrid and, in large measure, this hotel makes us want to visit again. Thank you Gran Melia, Anne and David Zimbler", "Date": "June 16, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Phoenix, Arizona", "Title": "“Wonderful Hotel in Great Area”", "Author": "jeff3805", "ReviewID": "UR113328140", "Content": "We spent several days here with our 3 kids. The hotel was close to shopping and the metro. We walked to many museums and the park. The service was great. We had breakfast included. It was quite a large buffet. The rooms were large and clean. The staff was friendly and helpful. Internet service was included. Our room was quiet. Would highly recommend.", "Date": "June 13, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Abu Dhabi, United Arab Emirates", "Title": "“Old World Charm and Solid Comfort”", "Author": "ElMusaferain", "ReviewID": "UR112532087", "Content": "We spent four very happy nights at the Fenix, an especially comfortable and welcoming hotel. We opted for a premium/views room, which was compact but well laid-out, with a separate vestibule off of which was the bathroom. The double-glazing and door from the room to this mini-hallway meant that it was one of the quietest hotel rooms I've ever enjoyed. Just enough closet space, although not enough drawers if two were to really want to unpack. Luxurious bed and bedding, and thick, large towels. Wired Internet only in the room (wifi downstairs), but free and adequately fast. The decor, in the rooms and throughout, is old-fashioned in a very good way - heavy curtains, gilded plasterwork, and the like, while the beautiful public rooms have the air of a slightly refreshed country house - bright colors and contemporary art setting off the stained-glass ceilings and sober paneling. Fresh flowers everywhere, but especially in the large lounge/bar at the back, brighten the place up nicely. Breakfast was a very nice addition - plenty of choices, excellent fresh juices and fruit, and a nice selection of hot and cold choices. We loved the location - a leisurely half-hour walk to the Prado, ten minutes to the heart of the trendy/gay Chueca district, just around the corner from upmarket Salamanca, and a short taxi from everywhere else (with a taxi always waiting outside). Finally, I can't say enough good things about the staff, who seemed uniformly professional, cheerful, and very happy to interact in English, in my terrible/non-existent Spanish, or even in French. The Gran Melia Fenix is by no means your cheapest option in central Madrid, but in this case you are definitely getting good value for your money.", "Date": "June 10, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "4.0", "Value": "4", "Service": "3"}, "AuthorLocation": "Geneva, Switzerland", "Title": "“A great mini-break destination...”", "Author": "ANMW", "ReviewID": "UR111775386", "Content": "We came for a three-day trip and stayed, with our children aged 11 and 9, in two connecting superior rooms. Whilst it's true that the rooms are on the small side, and the floorplan configuration can seem a little odd, they are almost perfectly equipped. Our preferred aspect of the room was the large bed and wonderful bed linen. What we liked least was the lack of wi-fi in the room (available only in the lobby -- admittedly, for free) and the apparent lack of thermostat control on the a/c (either on or off, it seemed). The breakfast is as copious as described in other reviews. It's not of the highest quality, especially for a 5-star hotel, but it makes up for it in variety. The staff at the hotel seem to fall into two categories -- either upbeat and ready to help, or a little jaundiced. I sense that general management has not really created a universal culture of pride among the staff. Don't misunderstand me: this is a very pleasant hotel and we would recommend it. However, there is no real \"Gran Melia Fenix\" experience to distinguish this hotel from other 5-star hotels. Some reviewers have written that the hotel is well situated. This is true, especially if high-end shopping is your thing. It's a 25-30 minute walk into the historic part of town, however, which may be a consideration if you have small/young children. The metro is close, though, and it's cheap, clean, safe and simple to navigate, even for a foreigner. Taxis are abundant and good value for a family. On the subject of young children, the Hard Rock cafe is just around the corner from the hotel, offering huge servings of American food at very reasonable prices with waiters whose English is good. A blessing if you can't get your littl'uns to agree to another Spanish dinner. If museums float your boat, you're spolit for choice in Madrid. The local parks are also lovely. We also went to the nearby nature reserve (called \"Faunia\"). We were sceptical on the way over, thinking that it would be a disappointment, but the kids and we loved every minute of the four hours we spent there -- there's a wonderful selection of animals, many of which you see in very close proximity -- in a clever layout and with helpful signs in Spanish and English. Well worth the (admittedly steep) 25 euros per ticket. All in all, we enjoyed our few days in Madrid. It's a clean, relaxed and interesting city and well worth a trip. As mentioned, the hotel is to be recommended, but do research others to be sure you get what you need.", "Date": "June 6, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "5", "Overall": "4.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Providence, Rhode Island", "Title": "“Beautiful hotel, friendly staff”", "Author": "zafulotus", "ReviewID": "UR111514617", "Content": "The hotel is well located, the staff is exceptionally and impressively friendly, the rooms are luxurious and well-appointed, free wifi. Would highly recommend. Only negative comment is the room service: the food was not noteworthy for the price. Otherwise, an excellent choice.", "Date": "June 4, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "5", "Overall": "4.0", "Value": "4", "Service": "4"}, "AuthorLocation": "Singapore", "Title": "“Wonderful location”", "Author": "SingaporeGirl", "ReviewID": "UR111203839", "Content": "Tiny room but with a grand double bed and tastefully decorated and comfortable. The best part of this hotel in my opinion, however, was the excellent location -- walking distance from some of the best shopping in Madrid (2 minutes up the street, all the best brands and designer shops as well as charming less-well known boutiques), and only a 5-minute walk from the National Archaeological Museum of Madrid (which is excellent!). You can walk to all the other main museums and tourist attractions if you like 20-30 minute walks, but a taxi is quick and fairly cheap. And a real plus are the many small restaurants in the area serving wonderful local dishes at reasonable prices (US$20 for soup, main course and a glass of house wine). Will definitely return.", "Date": "June 2, 2011"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "san francisco", "Title": "“First class hotel in good location, great breakfast”", "Author": "bouchee", "ReviewID": "UR110244213", "Content": "A short walk from the museums and just a few minutes from a subway stop, this hotel is a good choice for tourists. It feels more like a boutique than part of chain. Rooms have character, and the staff is exceptionally helpful. The other comparable choice is the Westin Palace, which is a bit closer to Plaza Santa Cruz and the museums. But this hotel has a smaller feel to it, and we liked it better. It's located closer to upscale shopping too.", "Date": "May 28, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "3", "Location": "5"}, "AuthorLocation": "San Francisco", "Title": "“Just Fair”", "Author": "Professor44", "ReviewID": "UR109407177", "Content": "The hotel is well-located and Madrid is a very walkable city--you can easily walk to the major attractions. The restaurant in the hotel is quite good and has gluten-free designations on the menu. Service is excellent throughout with good bellmen, concierge, etc.. We had an interior facing room on the club floor. The club is nice and not much used. But the room is relatively small and the carpet is old (I kept stepping on a nail that was used to attach a loose piece, I guess). Air conditioning doesn't really adjust too well. I think the Westin Palace is better (although I think more expensive). Madrid is a noisy city so you need to be careful if you are noise sensitive about the room's location.", "Date": "May 23, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "3", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "London, United Kingdom", "Title": "“Stylish and up-market. Excellent!”", "Author": "bembridge", "ReviewID": "UR108361240", "Content": "We stayed at the Gran Melia Fenix Hotel in Madrid for a weekend break, and loved this hotel. It is a very stylish, smart and striking hotel with fabulous lobby area with sweeping staircase. The entrance does have a wow factor. The lobby leads through to a bar/ seating area with amazing ceiling, off here is the bar and also an ornate and smarter lounge bar (that serves fabulous cocktails!). The whole feel of the place is up-market, and it is (with some of the prices to match). The hotel is in a great location, close to many of the tourist attractions (like the Communications Palace and the Library) and also the open air tour buses go past very nearby. It is also in walking distance to the smart shopping streets, including the famous El Corte Ingles Department Store. The bedroom we stayed in (401) was very grand and plush, with massive and comfortable bed. The room had a great desk area, large TV, and iPod docking station and Clarins toiletries. The room had no view other than across to a building, but the room made up for that. We had access to to the business lounge, which was great. This has a dining area, sofa area and nice outside roof terrace. We had breakfast in there, which had a good spread - and also they had drinks and nibbles in the evening. The package we had also included wireless access, which is just as well as seemed to be very expensive to buy access. This hotel was a real treat and the service and attention to detail was outstanding. Highly recommended!", "Date": "May 15, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "1", "Sleep Quality": "5", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Milano", "Title": "“Excellent service, good location”", "Author": "ZAP9", "ReviewID": "UR105798650", "Content": "I go to this hotel any time I come to Madrid. The position is very good, near the Prado and Retiro. The staff is very friendly and always ready to help and provide advice on restaurants and attractions. The rooms are fine (although standard rooms are rather small), very clean and in very good state. The bed and linnen is very comfortable, and although it is in the Castellana that is a very busy avenue, rooms are very quiet. Breakfast is very good, with a wide variety of fruit, bread, cheese and pastries. The fitness center is rather small, but they are now renovating it, so it might improve. No swiming pool or spa. As expected, rates are quite high, but the hotel is really very good.", "Date": "April 27, 2011"}, {"Ratings": {"Sleep Quality": "3", "Overall": "5.0", "Rooms": "3", "Value": "5", "Location": "5"}, "AuthorLocation": "Hong Kong, China", "Title": "“Good!”", "Author": "susanna_arashi", "ReviewID": "UR105555565", "Content": "Hotel - 5 minute walk from the subway, very convenient - many shops (especially those luxury brands) around. you would love it if you like shopping - nice staffs Room - small, but clean Breakfast - I write this review because I want to let people know how delicious it is. YUMMY!! - large variety of food you can choose (even champagne!) - very delicious I would stay in this hotel if I go to Madrid again ^^", "Date": "April 26, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Philadelphia, Pennsylvania", "Title": "“Great Hotel”", "Author": "llcooltone", "ReviewID": "UR105420956", "Content": "My wife and I stayed in a very reasonably priced suite in this hotel. The price included breakfast as well as complimentary cocktails and snacks until midnight. The location of this Hotel is excellent as it is near the main shopping district and away from all the noise of the museums which are only ten minutes away. While the hotel is very nice by European standards the service was quite simply amazing. My wife also agrees with others who have noted that the beds are extremely comfortable. she literally wanted to take the bed home with us.", "Date": "April 25, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Austin, Texas", "Title": "“Wow, what a great way to start a Vacation”", "Author": "TexasEd60", "ReviewID": "UR105305354", "Content": "We stayed here for 3 nights before moving onto the Canary Islands to pick up a cruise ship. This hotel is in a terrific location, everything is right outside the front door. The staff are all highly professional and the only concern they show is for the guests comfort and enjoyment. The hotel public areas are very intimate, sumptuous and inviting; the buffet breakfast is outstanding, the best we had on our 3 week trip. Our room was very comfortable but on the small side. We elected to upgrade to the Royal Service which provided nice benefits. Chief among them is that when we sleepwalked into the hotel the morning our flight arrived from the US, the staff immediately showed us to our room and at about 10 am we were in our comfy king bed and sound asleep. That meant a lot to us and was a good way to get started. The management and staff are world class.", "Date": "April 24, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "3", "Location": "4", "Rooms": "4"}, "AuthorLocation": "Aberdeen, United Kingdom", "Title": "“Fantastic hotel, shame about the view!”", "Author": "Kezbomb_8", "ReviewID": "UR105179013", "Content": "The hotel, food and staff were all great, the view from the room was awful. They gave us a room that overlooked what looked like a staff smoking area! Not what I imagined I'd be looking at from a beautiful room in a five star hotel. We only stayed one night!", "Date": "April 23, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "New York City, New York", "Title": "“absolutelly fantastic Leading Hotel of The World”", "Author": "Mariah76", "ReviewID": "UR101708483", "Content": "It has been an unforgetable stay in Madrid because this lovely hotel. 3 min to the best shopping area and 10 min to the museums. I loved the service, tranquility and an employee told me the secret: they care a lot the mix between groups and individual travelers...woooww Really I felt a focus on full service and LHW touch.", "Date": "March 27, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "", "Title": "“Excellent stay from start to finish”", "Author": "Shrugg", "ReviewID": "UR100150016", "Content": "It was our first visit to Madrid and we'd booked for two nights.......... could have easily stayed a week! We arrived early but not only were we allowed to check in (huge benefit) but we got an upgrade on our room too. Reception staff (Jesus) were extremely helpful and friendly, and spoke good English. The room including bathroom was lovely and the black out curtains worked a treat as we slept in on the first morning and missed breakfast. Hotel bar for a cocktail is worth a visit (much better than Hard Rock Cafe)and whilst pricey at 14 euros I had one of the best Mojitos I've ever had. Metro is virtually ouside the hotel as is the bus stop for the open top bus tours (17 euros each) alternatively a 15 minute walk gets you into the centre. The handwritten welcome note from the manager was just one of the things that put this hotel above many I have stayed in - the chocolates helped too! We'll certainly visit Madrid again and definitely stay at Gran Melia Fenix.", "Date": "March 14, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "London", "Title": "“Good business hotel”", "Author": "ADL79", "ReviewID": "UR100043903", "Content": "Friendly and efficient staff, well appointed rooms and bathrooms, took dinner in the bar which was limited choice but friendly service. A high end hotel offering a decent price. Very happy to revisit.", "Date": "March 13, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Rapid City, South Dakota", "Title": "“For the cost, it can't be beat any where in the world!”", "Author": "Rutman", "ReviewID": "UR96269226", "Content": "I've stayed at a lot of hotels around the world, including the renowned Connaught in London. This is on par with the best, only at a fraction of the cost. The staff is simply amazing. I would recommend upgrading to their premium rooms, you won't be disapponted. I will happily return to this hotel the next time I want a romantic retreat in Madrid! The only, and I mean the only, negative is their fitness room, it is pathetic. It doesn't even have a full set of barbells. We primarily booked the hotel because we are workout freaks and wanted a hotel with a fitness room and because of the great ratings it received on Trip Advisor. We didn't work out once! That said, I would skip working out to stay here again! If they ever upgrade the fitness room this hotel will then have it all.", "Date": "February 11, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Berlin, Germany", "Title": "“Amazing hotel!”", "Author": "prova113", "ReviewID": "UR94518633", "Content": "We found this hotel to be fantastic-a really lovely experience. We stayed on the 'club floor' on level 7. The service was first rate-we were assisted by a very friendly and knowledgeable lady, Cristina, who was absolutely fantastic. The breakfast here was outstanding, and the lounge downstairs is also very nice. The room was fantastically comfortable & had lovely Etro bathroom products.We will certainly stay here again and would gladly recommend it. However, at this price level Wi-Fi internet access should be included.", "Date": "January 26, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Moscow, Russia", "Title": "“It was an unexpected visit for just married”", "Author": "Dmitry100", "ReviewID": "UR93987497", "Content": "Iberia delaited with its flight and my wife and I spent the night in the hotel. It was another night added to our honey moon! Great decoration and furniture in old classic style. King size bed. Friendly and professional stuff. Thanks a lot for the hospitality. If I need to stay in Madrid I'll try to find good price proposal for that hotel!", "Date": "January 21, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "3", "Sleep Quality": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Northampton England", "Title": "“Opulence in Central Madrid”", "Author": "Waldea", "ReviewID": "UR93890775", "Content": "Gran Melia is an opulent traditional hotel with traditional service right in the centre of Madrid. Ideal if you like grand, overstated rooms. Great bar service. Rooms can be too hot too often", "Date": "January 20, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "2.0", "Value": "2", "Sleep Quality": "1", "Rooms": "2", "Location": "3"}, "AuthorLocation": "Berkshire, UK", "Title": "“One to avoid if you enjoy space”", "Author": "WorldGlobetrotter_8", "ReviewID": "UR91975839", "Content": "The rooms in this hotel are small and the double beds even smaller. My partner and I 'slept' in a small double bed, which ensured that neither of us got a restful night's sleep during our stay. Paid a lot of money for a hotel which whilst well decorated, struggles because it just does not have the space.", "Date": "January 6, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "London", "Title": "“Perfect Service & Location”", "Author": "dcp_7", "ReviewID": "UR89685798", "Content": "Had a lovely stay for a weekend here. The service was great - the gentleman on the reception was friendly and efficient and could not do more to help. The room had everything we needed and we enjoyed the jacuzzi bath. The room was a little jaded in places (minor maintenance needed only) but it is a old style hotel and cleanliness could not be faulted. Best thing is the location, right in the heart of the upscale shopping and great restaurants two minutes away. When returning to Madrid next year it will be at this hotel.", "Date": "December 12, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Hampshire, UK", "Title": "“Beautiful hotel and furnishings”", "Author": "greenrobert", "ReviewID": "UR89071619", "Content": "Stayed here for a night after our flight was cancelled by Iberia. Considering I didn'y pay a penny, the hotel was stunning. Almost made up for the 8 hour queue at Madrid Airport to get the flights rebooked! The rooms are very nice with fantastic beds. If I were to come to Madrid again and the price was good, I would stay here agin without a doubt.", "Date": "December 5, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Southport, United Kingdom", "Title": "“Luxury on a budget”", "Author": "NWSenior", "ReviewID": "UR88778916", "Content": "We stayed at this hotel again using a secret rooms deal and were very pleasantly surprised to be upgraded from a deluxe to a premier room. The room design was classically elegant, with sumptuous furnishings and a large comfortable bed. The bathroom was delightfully decorated with black and cream marble tiles with a fantastic range of toiletries, very much appreciated when only travelling with hand luggage. Admittedly there was some work going on in the road outside, but the sound proofing is excellent by virtue of double double glazing, so no problems there. The location is very convenient with Colon Metro across the road and a short walk found us in a charming though exclusive shopping area. All in all excellent service and fabulous value for money. We will definitely be back when next in Madrid", "Date": "December 1, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "3", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Kent, UK", "Title": "“Great value and location”", "Author": "justhadtosay", "ReviewID": "UR87993267", "Content": "We were lucky to get this hotel for a good price through lastminute.com's secret hotels. It was certainly a good deal, it is a very elegant building, beautifully decorated in an old fashioned, cosy sort of way. We seemed to be given the 'cheap' room which was a bit cheeky as all the offers we saw on the internet were about the price we paid. We did however complain about our lack of heating and were moved to a much better room wo were very happy. The staff are generally very helpful. The rooms are lovely, bed was very comfortable, we had a great night's sleep. There is no coffee or tea in the room though which was one big downside. The room service etc is good but incredibly expensive. There is a very pleasant bar in the hotel but the drinks we had came in at e12 Each, bit over the top even for a five star. Prices generally in Madrid are very high and the standard doesn't really match it compared to London. Meal s out are very expensive. However the area around the hotel has some very good bars/restaurants etc, just dont forget the credit card. One big downside of Madrid and this hotel is that smoking seems socially acceptable virtually anywhere and everywhere! It seems to be legal in restaurants, bars, you name it. A very pleasant lounge became very unpleasant due to cigar and cigarette smoke. There are no smoking areas in restaurants but to be honest its a bit of a farce when half the room will be for smokers. It is a fabulous city though, very lively in the evenings, with a lot to see. It is friendly. The tube system is great, very quick and clean with a two euro trip from the airport, excellent. It was chilly at night and can be cold during the day but often sunny which is such a lift during November!", "Date": "November 23, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "3", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Athens, Greece", "Title": "“Very nice hotel room!”", "Author": "cleoniki", "ReviewID": "UR85561626", "Content": "The hotel room was really nice, good service, delicious breakfast. Not a central hotel but you can walk 15minutes to the centre or take a taxi which is cheap. Good relation with the price. The only thing that did not like was that you have to pay for the internet!", "Date": "November 1, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "2", "Overall": "3.0", "Value": "3", "Sleep Quality": "5", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Cornwall", "Title": "“Left failing to see what all the hype is about”", "Author": "K30", "ReviewID": "UR85457475", "Content": "I must say after reading all of the beaming reviews here on TA I was a little disappointed with this hotel. It is nice enough, don't get me wrong, but my experience failed to live up to the palacial standards I was led to believe I would encounter. It is worth mentioning however the location is truly excellent - very close to metro, decent restaurants and of course all the sites. Firstly, and importantly, this place is a building site at the moment. They are crashing around on the street (they are literally tearing up the road just outside) and in the hotel at all hours of the day, and as such there is dust and dirt all over the communal areas of the hotel. The reception area is also pretty small and failed to overwhelm me - in fact I was more impressed with the foyer at the Holiday Inn at LHR. To be honest the whole place needs a good clean and repaint after all the work is finished. Our room was well decorated and appointed but tiny, and oddly we were given a disabled room so everything in the bathroom was really low - not a real problem for most but we are both 6 feet tall! There was also a lack of natural light owing to the enormous and permanently closed curtains. The array of toiletries and traveller amenities are exceptional, I have never seen so much stuff next to the sink in the bathroom. There is however no coffee/tea making facility in the room. The bed was without doubt comfortable and we both slept soundly - except that maid service starts at ridiculous times, we had them walk in (without knocking) as early as 7.45am. They are friendly enough though, and do a great job. I feel like I have whinged a lot, which I don't normally do, however I feel that the previous reports are overly gushing and do not represent what I encountered. Despite the whining, I would recommend to a friend, but I would not be as complementary as others have been.", "Date": "October 31, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Leeds", "Title": "“a great place to stay in Madrid”", "Author": "TrishLeeds", "ReviewID": "UR85302145", "Content": "This was our second visit to the Gran Melia Fenix and once again it did not disappoint. The staff are wonderfully helpful and friendly and the rooms luxurious and very comfortable. We will stay here again next time we visit Madrid.", "Date": "October 29, 2010"}, {"Ratings": {"Service": "2", "Cleanliness": "5", "Overall": "3.0", "Value": "2", "Sleep Quality": "5", "Rooms": "4", "Location": "3"}, "AuthorLocation": "navan", "Title": "“sloppy service lovely hotel”", "Author": "follistown", "ReviewID": "UR85207257", "Content": "just back from three nights in this nice Hotel . I had read my trip advisor reviews so it looked good to stay in . I had requested Strawberries and Champagne on arrival to suprise my wife who had nursed mr through a serious operation .Despite having emailed previously and asked at reception it took three more calls to get it delivered at that stage the suprise was ruined . Overall the hotel is very nice but struggles to be a 5 star with this sloppy service the room was lovely but the bathroom was very small and cramped, John Navan ireland", "Date": "October 28, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "toronto", "Title": "“Perfect....”", "Author": "lmf26", "ReviewID": "UR82452280", "Content": "If you want refined service, knowledgable staff, good food and location then this is your place. I was the Gran Melia Fenix for close to two weeks and not one word of complaint. I found everyone to be genuine and smiles opened conversation easily as my boyfriend was busy working away for business. I had to locate a car for travel and one of the ladies spent over an hour with me and the company ensuring my needs were met. This was greatly appreciated and not expected at all. Would consider this a hotel a home away from home because that is the feeling that is left behind. The management should be very proud of their team.", "Date": "October 7, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Hopkinton, New Hampshire", "Title": "“Great Hotel, Superb Service”", "Author": "SDV744", "ReviewID": "UR82247995", "Content": "My wife and I stayed 2 nights at the Gran Melia Fenix at the start of a two week vacation. What a wonderful way to begin our trip. We chose a \"Royal Service Accommodation\" room. Although more expensive, an excellent breakfast buffet, complimentary snacks and drinks ( including alcoholic beverages) in a private lounge, and personalized concierge services made the extra expense well worthwhile. Early check in was included in Royal service. We had alerted the hotel that we would be arriving in Madrid at 9:00 AM . They were expecting us and quickly got us into our room . After an overnight flight, this was greatly appreciated. The room was well appointed and decorated, sound proof, and immaculately clean. The bed was one of the most comfortable I have ever slept on. While not overly large, the room was luxurious. The bath was exceptionally well appointed although quite small. The level of service was extraordinary. We completed a pre arrival questionnaire sent by the hotel to understand our preferences. These were all acknowledged and attended to. The hotel knew that part of the reason for our travel was my wife's birthday. We returned to our room one night to find a wonderful gourmet mousse cake, fresh berries, and a bottle of iced cava waiting us. The hotel is located in easy waking distance of excellent restaurants and about 15 minute walk to the Prado. It would be wonderful if the hotel had an indoor pool, but even without, this is a great hotel. I think it would appeal most to those who value quiet old world style luxury and attentive service.", "Date": "October 5, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Northport, New York", "Title": "“I was so comfortable I almost felt I was home in my own bed!”", "Author": "gormport", "ReviewID": "UR82153897", "Content": "This hotel is just a lovely place to stay and has modern \"old world\" charm. Our room was an adequate size, well appointed, very clean, and the bathroom was marble. The beds were so comfortable. The staff was very helpful and welcoming. It was a 10 minute walk to the Prado. I would not consider staying any where else in Madrid except Gran Melia. Fran Gorman Long Island, New York", "Date": "October 5, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "north west england", "Title": "“Fantastic hotel!”", "Author": "rojer63", "ReviewID": "UR79795417", "Content": "What a luxurious hotel this is. Everything about the hotel is fantastic - from the staff who work there, to the communal areas and the rooms. We certainly hope to repeat our visit there!", "Date": "September 16, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "folkestone", "Title": "“fabulous !!”", "Author": "cocolina61", "ReviewID": "UR78570591", "Content": "This hotel is old world glamour just like a hotel should be .Some of the best reception staff ive ever come across . The rooms are clean well equipped and comfortable and ALL the staff were excellent efficient and smilely. Our breakfast was lovely ,a selection of both hot and cold buffet and super pastries. The public spaces are beautiful and a pleasure to be in and it all looks exactly like the website photos. Great location ask the reception staff for the public transport info we found this the best way to get everywhere bus stops right by the hotel and are fast and go everywhere. This hotel is Fab although it probably isnt the place for you if you want hustle and bustle bright lights and monocrome. Just old fashioned charm and elegance. Perfect......", "Date": "September 7, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Lisbon, Portugal", "Title": "“Affordable luxury”", "Author": "ordep", "ReviewID": "UR78176700", "Content": "This hotel located on the Plaza Colón is very central. You will reach the \"golden triangle\" (Prado, Thyssen and Reina Sofia museums) with a 1/2 hour walk. LIKED Room view (room 517) over Plaza Colón Decoration Bed Lights Breakfast Buffet Safe large enough for 2 laptops (14') Amenities in bathroom TV set Video surveillance in corridors Cleanliness DISLIKED room service prices (€7 for a coffee, tea or beer!) Internet wireless not free No direct acess to garage from the hotel Room keys didn't work (6) Bathroom too small Closet too small Works in Hermosilla street (Hotel entrance)", "Date": "September 3, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Thornhill", "Title": "“This hotel does it all RIGHT!”", "Author": "choco_nut_9", "ReviewID": "UR76492321", "Content": "My husband and I just returned from a 3 week driving trip through Spain. We started and ended our trip at the Gran Melia Fenix. From our first minute at the hotel, we were greeted by the most wonderful staff that could not seem to do enough for us. They were so gracious. We had a beautiful room for 4 nights in a very clean, well kept, luxury hotel. The staff sent us to an amazing restaurant that was not a tourist trap. When we asked for help finding a wine tour they sent us to a very small, family run, private winery. This was an experience no other hotel would have provided. After our first 4 nights at the hotel we left and stayed at 5 other hotels in Spain. Most of these were the best hotel in each city. When we arrive back in Madrid and entered the hotel, it felt like we were returning home. the staff greeted us with open arms and it was very sad to leave. The only possible thing to say that would have been better is if the hotel had king size beds. They only had queen but these were fantastic. I would tell everyone that this hotel was our best experience in Spain and probably one of the best hotels we have ever stayed at in the world!", "Date": "August 23, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "London", "Title": "“Stunning hotel”", "Author": "Jonathan22", "ReviewID": "UR76364250", "Content": "I stayed for a week at the Gran Melia Fenix during August. What a treat. The hotel is beautifully decorated and air conditioned throughout - a real must during August. It is an expensive hotel compared to what you can find elsewhere but like most things you pay for what you get. Polite charming staff, tastefully decorated hotel throughout and superb breakfast. The rooms are beautifully decorated and the bed was extremely comfortable. If you can afford stay at this hotel it's a real treat. The GM Fenix Hotel and staff deserve every success during these difficult times. I will have no hesitation in booking into this hotel if I visit Madrid again in the future.", "Date": "August 22, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "4", "Rooms": "5", "Location": "4"}, "AuthorLocation": "NYC", "Title": "“Very happy here! 5 star service & great location”", "Author": "4-Buena-Vida", "ReviewID": "UR72597096", "Content": "I was very happy here! This hotel does a great job, well kept, classic style with modern comforts, very good service in a festive country like Spain (that sometimes lacks in service and english skills) service & great location in the middle of old and new Madrid.", "Date": "July 27, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "London, United Kingdom", "Title": "“Lovely stay”", "Author": "Freddy_7", "ReviewID": "UR69045077", "Content": "We were able to upgrade to a premium room for a low cost after getting a good lastminute deal on a standard room, which was a bit small. I travelled with my 17 year old daughter and we were both impressed by the welcome we received and the comfortable and spacious accommodation. A quiet, cool oasis in a hot city.", "Date": "June 29, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Charlotte", "Title": "“Good Hotel, Good Location, Awesome Breakfast”", "Author": "junkie_travel", "ReviewID": "UR67745028", "Content": "We stayed at the Gran Melia recently. The hotel is very centrally located - a little away from the tourist rush in Plaza Colon. The rooms are a good size, plush with great views of Plaza Colon. Windows are double paned, so its very quiet inside the room although the hotel overlooks a busy plaza. The bed, pillows et al are very comfortable. We chose a package that included breakfast - the spread was simply awesome. The concierge in the hotel was very helpful with reservations, directions etc. Great shopping is only minutes away at Serrano. We took the metro to get from the airport to the hotel. The Serrano station is a short walk from the hotel. Cabs are fairly cheap - it took about 6ish Euros to get to any of the attractions. The only con I noticed were the not so clean carpets. I could not help but notice the dusty and dirty edges of the carpets. Gran Melia should do a better job in cleaning the carpets more often. O", "Date": "June 16, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "2", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "3"}, "AuthorLocation": "London", "Title": "“2* service in a garishly lavish setting. FOR OLD PEOPLE ONLY”", "Author": "Hswann", "ReviewID": "UR67385175", "Content": "My partner and I (aged late 20s) stayed here as part of a 'Top Secret Hotels' deal on Lastminute.com. We paid £100 per night for a standard double room instead of the normal £200. Still nowhere near a good deal. The place looks like something from the 1950s - not in the stylish trendy sense, but in the garish, overly lavish way. it's like someone tried to imitate the Ritz and failed. Gold everywhere, not a single inch of space untouched by some sort of decoration. When we stayed, a conference group was also staying, and we had to fight our way through tens of loud business men and women smoking, chattering, and taking up all of the staff's attention. There was even a cheap looking table set out in reception with a note board behind it, announcing the timetable for the conference. Not five star treatment for us at all. We booked a double room and requested a double bed ('cama matrimonial' - make sure you request it on every trip as a couple in Spain or there's a good chance you'll be given twin beds). They said they'd run out but could push the twin beds together for us, or, for 40 euros we could get a room with a double bed and a nicer view. Nice - upselling in our first few minutes in the hotel. They weren't bothered at all and barely tried to help. And we had to stand in the bedroom and wait whilst the staff made the bed for us. Classy. The room was cramped, the bathroom was tiny, and the air conditioning didn't work. There was a snazzy machine by the bed to control lights, air con etc. that didn't work either. Because of the air con, we complained and it took them half a day to move us to a room with a double bed (beware - the double beds are small). One of the staff on the concierge desk was helpful (young guy named Jesus) but apart from that they were condescending, unhelpful and rude. I filled in a complaint form which guaranteed that if they hadn't repaired our aircon or changed our room within 1 hour they'd offer us a free night or a refund. Needless to say i heard nothing back from them. Location isn't great for sight seeing - you need to take Metro or Taxi to see anything worth a visit. Room service is incredibly expensive, as is laundry. No swimming pool (how can this place really be 5*??) and internet is only free in the business centre. REALLY DISAPPOINTING - don't waste your money!!", "Date": "June 13, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Cairo, Egypt", "Title": "“Just Perfect”", "Author": "TravelAddicts2010", "ReviewID": "UR65121541", "Content": "The hotel is in an excellent location, walking distance to nice restaurants, and shopping. Excellent room, service and the bedding is amazingly comfortable. Would highly recommend this hotel for Luxury.", "Date": "May 24, 2010"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "Dubai, United Arab Emirates", "Title": "“Perfect Hotel, Perfect Location, Perfect service......”", "Author": "CesarAlonso", "ReviewID": "UR63657190", "Content": "Maybe is not the best hotel in Madrid, but all together , is a perfect place, very good service, the food is so fresh, the rooms are ok, and the location is perfect, it really worth every cent spend there", "Date": "May 9, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Istanbul", "Title": "“could not think of a better place to stay in Madrid”", "Author": "cakdemir", "ReviewID": "UR62328554", "Content": "In the middle of shopping area of serrano, Gran Melia Fenix offers everything of what a five star hotel should deliver. Location is A+, service quality A+, rooms&decoration A+... very friendly staff.. upgraded to a premium room - very spacious... definitely be my choice for my future madrid trips. would not look anywhere else. other than the hotel, try Lateral cafe for tapas in velazquez ave..", "Date": "April 24, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Lyndonville, Vermont, USA", "Title": "“Comfortable in every respect and an ideal place to stay in Madrid.”", "Author": "wpdame3", "ReviewID": "UR61803022", "Content": "Located on the lovely, wide Paseo Castellana, and not some crowded, noisy side street, the Gran Melia Fenix is a very nice blend of luxury and, value. The service, from the front desk to every level, was impeccable. The rooms are well proportioned and beautifully furnished. One amazing feature that helps the housekeeping staff, not the guest, is that a touch of a button raises the sleeping surface of the bed in order for the maid to make it at chest level, without bending over! The amenities are plentiful and of excellent quality. The laundry service is one of the quickest and best I have experienced in any hotel. The buffet breakfast is of astonishing range and quality and included in the room price. The bar and lounge is a lively and well appointed gathering place, but fairly pricey, as you might expect. Only negatives: they need to replace worn elevator buttons and expand the size of the Business Center! Located only about a 15 minute walk from the Prado, this is a well managed property, offering excellent value.", "Date": "April 18, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "5.0", "Value": "5", "Sleep Quality": "3", "Rooms": "4", "Location": "5"}, "AuthorLocation": "US", "Title": "“Impresive Service”", "Author": "jdr1000", "ReviewID": "UR60658079", "Content": "I just finished a family trip and stayed twice during that time at this property. Servicio Real (their executive floor) is amazing. The service is above and beyond what is expected. As soon as you get to the hotel they send you to the seventh floor where your keys are ready and the sweet ladies in charge already know your name. Rooms are of good size considering European standards but the toilet space (not the bathroom) is a joke. On my way back on the plane I asked my wife if the planes bathroom was larger or I got used to small spaces. It is really small. Location is perfect in central Madrid close to Metro, Taxi, restaurants and La Paz Market. I would stay here again.", "Date": "April 7, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Liverpool UK", "Title": "“Luxurious and comfortable”", "Author": "NSU2010", "ReviewID": "UR60650687", "Content": "excellent stay recently. Free room upgrade and excellent attention to detail. Wonderful marble bathroom and Bang and Olufsen TV etc.. Staff very helpful and location perfect for little disturbance at night. As with many 5 star hotels avoid minibar due to exorbitant charges. Would stay here again!!", "Date": "April 7, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Singapore", "Title": "“Extraordinary Service”", "Author": "slamsa", "ReviewID": "UR59409140", "Content": "Stayed in Gran Melia for 5 days for a hotelier conference. Flew out of Helsinki and was supposed to arrived into Madrid at 8pm but my flight got delayed as there were an ongoing strike with the Paris air traffic controller, finally arrived in Madrid at midnight. I was glad that the hotel was exquisite as i was tired. Staffs were very warm eventhough i arrived late. Breakfast was a good spread, a lot of healthy choices which was perfect for the morning. Everything went smoothly until an extraordinary happen. I was supposed to attend a Gala dinner on the last night of the conference and had a pair of stone earrings with me. I noticed that the stone from the earrings got detached when i took it out from the jewellery pouch. I placed it neatly in the bathroom vanity top. Due to the hectic schedule, I often forgot to take it to reception meaning to ask them to help me find a glue. On the 2nd last night when i got back to the room, i was pleasantly surprised that the stone had been glued. I went down to reception and ask the reception who was the lady who make-up my room. I cant remember her name anymore but I want to thank her for that initiative or gesture that she has done for me. She made my day with just a simple initiative. I stayed in room 329 from the 13 - 17 Jan 2010. Kudos to the GM of Gran Melia Fenix for having a wonderful staff. Staff like that are valuable and definitely a great asset for the hotel. She's a gem and thank you again! Will definitely recommend the hotel to anybody who wants to visit your beautiful city.", "Date": "March 24, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "3", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "kellycrystal", "Title": "“Comfortable and Nice”", "Author": "kellycrystal", "ReviewID": "UR59331591", "Content": "I enjoyed my stay at the Gran Melia Fenix. The room was very nice. I enjoyed the pillow menu - so I could get my favorite type of pillow. The gym was very mediocre, but I was happy they had one. Overall it was a great stay. The staff was friendly.", "Date": "March 23, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Canada", "Title": "“great hotel”", "Author": "JJFrier", "ReviewID": "UR58112366", "Content": "Hotel has outstanding location very close to the city centre, just next to Plaza de Colon. Staff is very friendly and efficient. We loved having drinks on a bar in lobby.", "Date": "March 9, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Goiania, Brazil", "Title": "“Very good”", "Author": "Gewitter", "ReviewID": "UR55582962", "Content": "Friendly staf, beautiful hotel (room a bit small, but ok), great breakfast, good location.", "Date": "February 9, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "3"}, "AuthorLocation": "GY", "Title": "“Hotels \"LOW RATE GUARANTEE\" is NOT Guaranteed.”", "Author": "likedetails", "ReviewID": "UR55057835", "Content": "Planning a trip to Madrid for my birthday and researched many hotels. I almost booked the Ritz but was getting a better deal with Gran Melia Fenix for their \"Royal Service\" rooming option. After reserving the hotel, I was scowering the net for the usual tourist info on things to do and came across a website that was offering an additional 15% off the same room I booked. Ah ha I thought! What luck!! Since the Sol Melia ADVERTISES a LOW RATE GUARANTEE, I'll send them a claim form. Uh-oh, they \"kindly\" informed me they couldn't honor the rate because the sites \"cancellation and payment policy\" doesn't match their's! \"Huh?\" What the heck does cancellations and what payment options I use have to do with the fact that the exact same reservation I made is $400 less than the low rate guarantee you offer your customers? Oh, and when they checked the website, they couldn't find what I was talking about. I had taken a screenshot of the travelnow.com discount and saved it to my word doc so I replied to them with it PLUS I pointed out that the travelnow.com website indeed have the same policy as them - travelnow.com DOES NOT CHARGE A CHANGE OR CANCELLATION FEE up until the day BEFORE your arrival. They only impose the HOTEL PROPERTIES cancellation policy which they have to pass on to the customer's. The ONE difference that apparently VOIDED SOL MELIA'S \"LOW RATE GUARANTEE\" was due to the fact that TRAVELNOW.COM charges your card UPFRONT for the reservation (even though there is NO PENALTY TO CANCEL OR MODIFY YOUR RESERVATION UP UNTIL 24 HRS BEFORE ARRIVAL) but Sol Melia charges you on the day of check-out! WOW. Sol Melia, if you DON'T want to refund folks their money, PLEASE TAKE OFF THE LOW RATE GUARANTEE YOU ADVERTISE! It only makes you look bad. BTW folks, I haven't heard from them since I sent in my screenshot....i will keep you posted. BTW - while purusing the web, I found an even BETTER option (especially for folks with families) renting a Madrid Apartment! WWW.SPAIN-SELECT.COM have WONDERFUL apartments, all 5 star reviews...worth looking into, more options (due to full amenities like kitchen, microwave, fridge etc... if you have kids and need to keep stuff stocked). I was blown away by what I could enjoy for less money than one of these hotels! I'm sure many of you seasoned traveler's probably know about the apartment option but wanted to point it out for other folks who may not know. Thanks and I will keep you guys updated on this low rate guarantee business... BTW: Just to clarify again, I haven't stayed here so I cannot rate it based on that...just posting an update!", "Date": "February 3, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "New York City, New York", "Title": "“Service beyond belief and comfort in the face of adversity”", "Author": "BOBDNYC", "ReviewID": "UR54048300", "Content": "We stayed at the Gran Melia Fenix last month and whole heartedly recommend this hotel. We booked a Luxury Link package which included a room with a terrace and hot tub along with their royal service lounge, etc. Check in was personal and amazingly fast with Laura being the perfect hostess. The room was beautiful and the view was great. The next morning (it had rained the night before) there was a leak in the ceiling of our room, so we need to move. And we moved, and moved, and moved. I admit that I was a tad cranky (and jet lagged I imagine but management kept at it, trying to find us accomodations which were suitable. They were relentless in their quest to please! Even Laura (who was working downstairs at the front desk as opposed to the concierge desk kept inquiring about \"her guests\". In short what was a series of mishaps were made much better by a few truly amazing customer service-oriented employees. We finally wound up in a huge suite overlooking the plaza. Initially the hot tub on the terrace was not functioning (I know - not a lot of sympathy here). Miraculously they did get it working! The food in the restaurant was superb, the lounge was great and again, the staff - and especially Laura - were superb.", "Date": "January 21, 2010"}, {"Ratings": {"Service": "2", "Cleanliness": "4", "Overall": "3.0", "Value": "2", "Location": "3", "Rooms": "4"}, "AuthorLocation": "Brooklyn, NY", "Title": "“Not a 5 star!”", "Author": "StefR", "ReviewID": "UR53127167", "Content": "The Gran Melia Fenix is a perfectly fine hotel but it is by no means a 5 star property. We stayed over the New Years week and paid for an upgraded package that included access to the lounge. While the room is quite nice, the service is lacking. The staff are courteous but not always helpful. Case in point there were never enough umbrellas (something other 5 star hotels seem to have no trouble handling), the limited options in the lounge were almost never stocked and finally the conceirge desk staff was rarely manned. I had to wait more than 30 minutes to check out and then had to point out that they had overcharged me. The front desk staff were not at all apologetic or quick about fixing the error. The hotel is situated in an upscale but slightly out of the way area of Madrid if you've come to visit Old Town Its about a 20-30 minute walk to the Prado, Old Town and other sites. There is a metro stop just 2 blocks away which requires you to transfer to get to Old Town but their metro is very easy to use so we had no issues getting around. The room itself was small very nicely decorated in a classical way. Our king bed was actually two twins pushed together which I didn't really appreciate in an upgraded room but only a small problem. The room was very clean. Overall, this isn't a bad hotel in any sense - its just not a 5 star property. I think we could have easily paid less to stay at a 4 star property and had a better experience.", "Date": "January 10, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Madrid, Spain", "Title": "“Excellent hotel, with charm and character. Recomended!!!”", "Author": "Txiquitin", "ReviewID": "UR52443187", "Content": "This is a wonderful hotel: 5 stars are a weel representation of its quality and service. Location is perfect, close enough of downtown Madrid, and just side by side with the best museums, and shopping area of Goya. I am from Madrid, so I know teh city well...but this time wanted to spent a romantic night in a good hotel . Totally worth it! Breakfast was included (in the room!) , so the night was perfect. Room was not huge, but decent. My only \"complains\": my room did have views to an awful interior patio, and bathtub was too small for two. Staff super friendly and helpful...for those who needs their help. Totally recommended. I have to say that I found a deal online for this hotel, that is why the value is 5 starts...not really know it regular price.", "Date": "January 3, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "4.0", "Value": "3", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Frankfurt, Germany", "Title": "“Nice Hotel Good Location”", "Author": "BJGfrankfurt", "ReviewID": "UR51993000", "Content": "Nice Hotel centrally located. PROS: Nice beds larger rooms, helpful staff and a good location. CONS: Room was getting a little worn. Nothing special...Blah. If you get an interior room like I it looks into a vent shaft. Do not open the windows in the vent shaft because you may be overcome by somone elses bathroom smell \"yes I mean THAT\". Bottom Line: I would stay again if I had to.", "Date": "December 28, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Location": "5", "Rooms": "4"}, "AuthorLocation": "florida", "Title": "“Madrid in Spring”", "Author": "tourists4ever", "ReviewID": "UR51971410", "Content": "We stopped in Madrid for three days on our way to Germany and the Gran Melia Fenix was a perfect place to stay, it is centrally located to all attractions, culture centers , shopping, dinning all within walking distance, we took a taxi to and from the airport for 26.00 EU The hotel has clean, confortable rooms, internet in your room for 8.00 EU a day, excellent breakfast buffet, lovely seating areas, nice lobby and a great restaurant.", "Date": "December 27, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "4", "Rooms": "4"}, "AuthorLocation": "Dallas, TX", "Title": "“They earn all 5 stars”", "Author": "onetreamigas", "ReviewID": "UR50399809", "Content": "The Gran Melia Fenix is a great hotel. I recently stayed there with two other family members and we all agreed. The service is excellent. Our room was lovely, a bit small for three, but very nice just the same. Breakfast was great and the service was the best. They couldn't do enough for you. The hotel is located in one of the better districts of Madrid. Travel to sites via Metro, (bid red) bus, and cab was easy. All in all I recommend this hotel to anyone staying in Madrid.", "Date": "December 1, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Location": "4", "Rooms": "4"}, "AuthorLocation": "Wisconsin", "Title": "“Not quite five-star but top-notch service”", "Author": "dseesel", "ReviewID": "UR49072819", "Content": "Stayed at the Gran Melia Fenix for four nights at the end of a trip to Spain, and enjoyed it. The entire hotel feels a bit dated for something that was remodeled less than 10 years ago and the rooms are a tight squeeze (Spanish-style), but good value for the dollar overall. We found the staff consistently very prompt and responsive to any request (such as an ethernet cable...no wifi in the rooms), the location to be good despite the construction in the immediate neighborhood, and the buffet breakfast topnotch. Also enjoyed things like a firm mattress and great water pressure, which can't be taken for granted. A good deal especially when booked through Leading Hotels of the World.", "Date": "November 12, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Location": "4", "Rooms": "4"}, "AuthorLocation": "Edinburgh", "Title": "“Lovely Hotel - great food - no problems”", "Author": "TonyClark65", "ReviewID": "UR48044802", "Content": "Stayed here 28 Sept - 3rd Oct 2009 (5 nights). Had a free upgrade pass so got really good rooms. First thing I did was ak reception to clear the mini-bar so we could use it as a fridge and suprisingly a maid arrived to do it within 5 mins and there was no charge. There is a nasty sign on the minibar saying anyhing moved would be charged but reception were OK as I had tried to manouevre some space and had dislodged some items. Apart from this sign we were made to feel very welcome, and everyone spoke good English. The breakfasts are superb - the best I have had in 10 years - the waiters are very accommodating eg. we asked for chilled milk for cereal and this was no problem. The maids do get a bit carried away with the slippers they leave you - after we returned to our room every night two fresh pairs plus small sheets would arrive - but we never asked or used them. Got the usual chocolates too - would have been nice if they had left us a bottle of wine/champagne as we got in Nice last year. There have been a lot of comments about bar prices - yes theya re expensive - but worth paying 7 or so Euros for a small beer to sit on the terrace when it's sunny - we got a selection of nuts free every time - very tasty! The hotel is very conveniently placed. We got 2 day tourist bus passes for 22 euros each and commuted this way - the bus stop is right outside. Madrid itself was spoiled by so much road works when we were there - if you ever wan't to see sewer/trench/piling works at first hand this is the place to be - you can get within inches of workmen - they don't close streets like in the UK, just narrow them. My advice is to go to Barcelona rather than Madrid - Barcelona is more fun and there is a higher proportion of tourists to business people. Also you have to search quite hard for good restaurants in Madrid - we did find just enough but they are not plentiful where we were. Top tip - from the Airport get the No. 200 bus (only one Euro and every 15 mins) and it takes you to the central bus station where you can get a taxi for about 7 Euros. If you get a taxi from the Airport to the hotel it will cost you about 30 Euros. Overall was a good holiday.", "Date": "October 29, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Los Angeles, California", "Title": "“Perfect luxury honeymoon / romantic getaway”", "Author": "TexasKPB", "ReviewID": "UR47649808", "Content": "1st time in Spain and I am glad I did my research on Trip advisor since it paid off. I went here with my new husband and we stayed 2 nights in the room with the private jacuzzi on the balcony. If you choose this room you get a private concierge with a complimentary breakfast and snack bar on the other side of the hotel. The hotel was spotless and all the amenities we needed were in the room: blow dryer /iron / AC - you could control temp / fridge / complimentary toiletries. We opted for the relax and romance package and got a bottle of champagne with strawberries and complimentary dinner. I am from Texas, USA and I have stayed in many nice hotels in the US but this hotel service was unlike I had experienced in terms of service. There is a bellman out front complete with a top had valet and everything was a dream. No street noise and you have complete privacy! Felt like we were in a glamourous movie - WILL RETURN!", "Date": "October 24, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Location": "4", "Rooms": "5"}, "AuthorLocation": "suburban Washington DC", "Title": "“Great Hotel”", "Author": "siouxknox", "ReviewID": "UR47147686", "Content": "Fully worth its four star rating. Beautifully decorated, impeccably clean, friendly and knowledgeable staff, and the most comfortable beds we have ever slept on. Our room faced the street but noise was not a problem due to two double paned windows--yes, four panes of glass keep the outside world away. Though conveniently located in a pleasant area with upscale stores, it is a short walk to the usual tourist attractions--the Prado was a 15 minute walk and the Puerta del Sol was 20 minutes. These are easy and pleasant walks, but if that's too much the hotel is also right next to the subway which is fast, safe, easy to use and goes absolutely everywhere. Though the breakfast buffet looked lovely, we thought the 27E per person price was too much, and we had plenty of fine choices in the neighborhood, including one place right across the street from teh front door.", "Date": "October 18, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "lrincon", "Title": "“Best in Madrid”", "Author": "lrincon", "ReviewID": "UR46501832", "Content": "This hotel represents what service and attention are all about. The rooms are very comfortable and impecable. The staff is very efficient and cordial. We truly enjoyed our stay and we would recommend it to anyone visiting such a wonderful city.", "Date": "October 10, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "2", "Location": "4", "Rooms": "2"}, "AuthorLocation": "St Albans", "Title": "“Nice hotel - a bit overpriced!!”", "Author": "montydogStAlbans", "ReviewID": "UR45483144", "Content": "Stayed at the Gran for 3 nights for our first time to Madrid. The hotel itself is nice and quite opulent but the room we were alloced was quite small and overlooked a stairwell, but hey you are not there to look at the view. There was an unfortunate noise though in the middle of the night of what sounded like an ice making machine churning out ice and dropping in the containers. This happened on several occasions throughout the night, we were on the 3rd floor next to an emergency exit. We could also hear a slight hum of the air conditioning generators from the outside. Breakfast was okay but a little strange on the cooked breakfast - pasta anyone???The breakfast room was quite small and staff took a little while to bring coffee to you, we heard a guy complain that he had been waiting almost 20 minutes for an eggs benedict. Breakfast was included in our package, I would have been very disappointed if I had to pay extra. There are lots of seated areas, an outside courtyard and we saw Fabio Capello have a coffee and a meeting with other gentlemen. He looked slightly miserable, maybe he had the pasta!!! Madrid has lots of lovely little bars with amazing tapas and we ate at the oldest restaurant in the world (so the Guinness World Records say!) called Botin Restaurant which is not far from the Sol Metro. Would we come back to Madrid, yes without a doubt, would we come back to this hotel - probably not. We had high expectations but it slightly let us down and its overpriced.", "Date": "September 30, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Sao Paulo", "Title": "“Perfect Hotel!”", "Author": "CCJB_9", "ReviewID": "UR45072042", "Content": "I stayed in Madrid with my family, brother and parents. We felt as we were in our own home! Meliá Fenix is very good located next to Museo del Prado, Cibeles Fount.... And it is next to Hard Rock Cafe Madrid. The service is perfect, the bed increadible confortable!!!! Very good breakfast as well! We really recommend this hotel!", "Date": "September 27, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Brisbane", "Title": "“Looking for a 5* hotel? You've found it.”", "Author": "oznini", "ReviewID": "UR40593778", "Content": "We chose a superior room on Booking.com and we got exactly what we paid for. ...except for the view! Plaza Colon is under construction at the moment, so the view is not great! In fact everything that was described on the website was in the room, even the soundproof windows. Beautiful room very nicely decorated with a floor to ceiling marble bathroom. A bit small but beautiful anyway. The staff was really nice and spoke very good English. Unfortunately we had to pay to have the internet in our room, when it was free in most hotels we went to in Spain. Excellent location. 3 minutes to metro station and the best shopping streets of Madrid. If you book tickets on the internet for the bullfight on Sunday evening, the tickets office is right next door to the hotel. The restaurant is very expensive and the breakfast is overpriced. We went to a cafe not far from the Swarovski shop . It was a lot cheaper and the coffee was great. We would go back there anytime.", "Date": "September 10, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Norway", "Title": "“Excellent royal service”", "Author": "Jenta", "ReviewID": "UR39980206", "Content": "Stayed at the hotel for three nights and at the hotel we asked for how much it would be to be upgraded to the rooms with jacuzzis. They charged us an extra 105 euros, but then we had our own balcony, own jacuzzi and we could also enjoy free drinks and hors d'euvres in the bar. During the summer season they don't have an own bar for those who stay in rooms with royal service, but the bar on the ground floor was an excellent option as well. The service throughout the hotel was immaculate. The rooms were very clean, they provided us with a bottle of water and fresh fruit or nuts or candy every day. The reception staff came up with some very good recommendations to both sightseeing and eating out. Breakfast was excellent and you could choose from a continental breakfast, but they also provides Madrillean spesialities and a menu wherefrom you could order omelettes, pancakes etc. The location is good if you want to be close to the museums, the fancy shopping streets (where they sell the designer stuff) and some hidden gems of small very nice boutiques.", "Date": "September 7, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Location": "4", "Rooms": "3"}, "AuthorLocation": "England", "Title": "“Comfortable, helpful, good location but small dark room”", "Author": "Lizlovestotravel", "ReviewID": "UR39002032", "Content": "We stayed in June, 2009 booked via a Travelzoo special offer. Good value, comfortable and very clean. Very friendly and helpful staff (found out Wimbledon results for me!) but the English of some of the people on the front desk was not as good as one might expect from a hotel of this rating, not that I expect everyone to speak English everywhere. Well located, walking distance from Prado, Reina Sofia, Retiro etc, 2 minutes to metro which runs til 1.30 and which took us home most nights. Felt perfectly safe travelling on it this late.Only downfall, the rooms on thisoffer were interior rooms with a view of hideous concrete walls, a fire escape and a pile of fag ends. I hadn't expected such a dark, rather claustrophobic and also small room. Worst thing was the darkness of the room, we were on the first floor so virtually no natural light felt like we were at the bottom of a tunnel. To be fair they did offer a free upgrade but didn't have an outside room with twin beds, they offered a choice of 2 rooms and really did try to help. The breakfast was wonderful, everything you could want and lots you didn't realise you wanted, Also not rushed away at the end, they asked each table if they were finished. We didn't find many decent restaurants nearby but metro & taxis are cheap & easy. This place was walking distance, friendly with a great atmosphere at lunchtime http://www.madaboutmadrid.com/photos/april_2005/taberna_la_dolores_1.html . If you go here take some advice from the hotel about which rooms/floors are best to stay on. Enjoyed our stay, 3rd time in Madrid, if first visit would prob prefer somewhere a bit more central with more atmosphere around.", "Date": "August 27, 2009"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "lawrenceville, ga", "Title": "“unexpected surprise”", "Author": "sfollett", "ReviewID": "UR37375871", "Content": "i was booked to stay at sol melia's other hotel in Madrid, and for some reason they were overbooked. so, i was transferred to this hotel at the same rate (they were running a $100/night special at the other gran melia). This is definitely a 5-star hotel. the rooms are beautiful! the staff is excellent (in fact my luggage was lost and they gave me everything i needed to make my stay comfortable despite the hassles i went through). the location is also very good.", "Date": "August 11, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Location": "4", "Rooms": "4"}, "AuthorLocation": "Dallas, Texas", "Title": "“Very nice hotel, well located”", "Author": "Drad1109", "ReviewID": "UR32678278", "Content": "We recently had a two-night stay at the Gran Melia Fenix having arranged accommodations through a deal on TripAdvisor. As we only had a short time in Madrid, we wanted a well-located, upscale hotel. Further, as we were traveling with our two sons (ages 19 and 22) and needed two rooms, we didn't want to spend a king's ransom. In all these regards, the Gran Melia satisfied our needs. The rooms were a bit on the small side, but very nicely appointed. My younger son was particularly impressed with his room and took a photo for posterity. Our king room had a small entry foyer with a french door to the bathroom on the left and a french door to the bedroom on the right. The rooms were well equipped with air conditioning, flat panel TV, lighting and many other functions controlled by a touch-screen on the bedside table. There was was also turndown service and highly efficient housekeeping - they magically appeared and were gone if you ever left your room. The main drawback to our room was the bathroom which had a smallish main area with sink and tub/shower separated from a smaller room with a bidet and toilet. These were separated by a frosted glass door (a nice touch) but the geometry of the rooms made it quite difficult to get to the toilet and close the door. The space planner or architect responsible for this either believed in form over function or was a slender contortionist capable of executing the necessary moves. We ate at restaurants outside the hotel (including Botin's in the Plaza Mayor) so I can't comment on food service. Like most similar hotels, breakfast was shockingly expensive and we preferred a small place just next to the hotel frequented by locals. We enjoyed the stay and, given the rate paid (€128 and 176 for the twin and king rooms, respectively) felt it was good value for this quality of hotel.", "Date": "June 19, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Location": "4", "Rooms": "5"}, "AuthorLocation": "Thames Valley, UK", "Title": "“Great hotel with some excellent deals available”", "Author": "LondonGent", "ReviewID": "UR31896001", "Content": "We stayed in the Gran Melia Fenix for three nights in early June and would wholeheartedly recommend it. We found a great deal on Hotel.Com about a week before our stay. This was a fraction of the rack rate but we were still given a very nice room on the outside of the building, on the third floor The windows were quadruple gazed so even though the hotel is located next to a very busy road, noise wasn't a problem. There were also blackout curtains so there was no problem with light entering the room from outside if you tend to wake at dawn like I do! The room was a good size with two windows looking out onto the street, quiet and reliable air conditioning, a good size marble bathroom with bathrobes and all the toiletries you could possibly need. Staff were also very friendly and efficient. Location is on the edge of Madrid's centre but within walking distance of most attractions. It's roughly 20 minutes walk from the Prado, 15 minutes from Chueca with its lively nightlife, and five minutes from the nearest Metro. My only caveat about this hotel is that, as expected of a five star, it was incredibly expensive to eat or drink anything. For example, a packet of crisps was 5 Euro - close to a 1000% mark up. Not really a problem as there are plenty of good restaurants within a 15-20 minute walk, just don't be tempted by the mini-bar!! Finally I would recommend obtaining a MAS loyalty card from Solmelia's web site before you stay. This allows you to check out as late as 4pm on your day of departure and you can have two for one on breakfast - if this isn't included your rate.", "Date": "June 8, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "4", "Rooms": "5"}, "AuthorLocation": "New York City, New York", "Title": "“Fantastic hotel great deal!!”", "Author": "melsriver", "ReviewID": "UR31550425", "Content": "My family and I recently stayed at this hotel in madrid for three days. We booked it through expedia for a phenomenal deal!!! We arrived very early on a flight from London to madrid. We took the metro from the airport, only had to transfer once and I think it took a total of just over 1/2 hour. Very easy! We were at the hotel by 10:30am and they had our three rooms available immediately. They asked if we wanted the best or the quietest rooms upon check in. We went with the quieter rooms. They were on the interior of the building, so no view, but the rooms themselves were great! The bathrooms are all marble. The rooms were very quiet and they were so dark at night, you never knew what time it was! We got turndown service every night, with slippers laid out at the foot of the bed. We had a drink in the hotel bar one night on the outside patio. It is a great patio but the drinks were quite pricey. We never took a taxi once becuase the metro was so convenient to the hotel. We didn't eat at the hotel either becuase there are so many other choices! The service from the front desk to the maids was exceptional. Everyone was very friendly and polite! Only down side is there is construction going on around the hotel. We didn't hear it from inside so the noise is not a worry, but walking around near the hotel was made a little difficult. When we go back to madrid we will definitely stay there. Madrid is a beautiful place and we had such a good time! Gran Melia did not dissapoint!", "Date": "June 4, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Alaboys", "Title": "“Very, very nice”", "Author": "Alaboys", "ReviewID": "UR31119528", "Content": "Clean, stylish, classic, quiet, one block from metro. Nice staff, Two doors between bed and hallway. Never heard noise in hallway. Was surprised with charge for internet (ethernet). You get 12 free hours wireless. Thought this was below standard in Madrid. Otherwise, great hotel. Going back to Madrid, planning on staying there again, despite internet access.", "Date": "May 29, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Gloucestershire", "Title": "“Almost entirely faultless - especially at special price”", "Author": "roll-on-next-trip", "ReviewID": "UR27982955", "Content": "I have never been to Spain before, and in fact apart from trips to London, which were more for business than pleasure, have never really 'done' a city break. This was a spontaneous booking to break up the spring, and as a lucky, extra holiday, budget was an issue - especially with the sad demise of Stirling against the Euro. So we were thrilled to find a fantastic deal at the hotel through Travelzoo, including an upgrade to a Premium room with associated gifts etc. And what gifts - not only fruit and water in the room but lovely chocolates on arrival, as well as the nightly turn-down service - chocolates on the pillow most nights and an Easter egg on Good Friday! My only single complaint of any sort was the size of the room. We were on the Plaza Colón side of the building overlooking the fountains, and I imagine in the smallest of the Premium rooms. Which is fair enough considering that the price we paid which was less than 50% of the published Easter rate. However, the room had all the style and advantages described by previous reviewers, and we found it easy to enjoy the 5* luxury and service, the fantastic breakfasts included in our package and the superb location while still keeping costs controlled. Madrid is a fairly expensive city, but worth every Euro. If you were able to splash the cash I'm sure the hotel's room service and mini bar were great, but at over €20 for a G'n'T we hit the streets for our own entertainment. It's about 20 minutes from the hotel to the centre of everything around Sol and Plaza Major with all the cervezerias, wine and tapas bars, but the streets are really interesting to wander and if you get the sort of blisters we did from pacing miles of pavements there's a great bus service outside the hotel and choice of two metro stops. Our only regrets over the trip were that we took the wrong clothes. Over 2 days it ranged from a high of 24 degrees one afternoon down to 13 degrees the next and we had taken more smart clothes than comfortable sightseeing ones - while people in the hotel make an effort for breakfast, Madrid is more about style than bling and more or less anything goes sartorially. If you're not using the hotel restaurant but are aiming for beer and tapas, you certainly don't need to overdo the collar and tie. We also took the wrong footware (those pavements are hard!), an out-of-date guidebook - use Maribel and the Tripadvisor guide as others have advised - and didn't have a Spanish phrase book. We didn't find many people who spoke English, which is fine - why should they? - but with our very rudimentary Spanish we missed out on some things such as some food items, and having a chat with locals rather than doing the English thing of pointing and talking louder! But we did have a wonderful time and are hoping to go back very soon, with the right shoes and a better phrase book. And Easter is a great time to visit. Finally, as well as the old town the hotel is walkable to the Prado (we didn't), the Reina Sofia (we did - but found you could see everything in the same sort of time it took to queue to get in - the Spanish seem good at that), the open space of Retiro Gardens and Atocha Station. Go to the station for the experience alone, even if you're not going to take a train. It's incredible - Kew Gardens with terrapins. We did take a train to lovely if touristy Toledo, but be warned that you need to book in advance - they only take bookings for seats and when the train's 'complet' it really is. You might get a ticket if you hang around for a cancellation, tickets come and go by the second. We got two tickets sitting in different carriages just after we gave up all hope, so you can be lucky. In summary, a great hotel, if classic in style rather than contemporary, and a little mean on space in some rooms. Wonderful beds, wonderful service, wonderful breakfasts and wonderful location. Wish I was there now.", "Date": "April 14, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Miami, Florida", "Title": "“Elegant Five Star Hotel”", "Author": "FromSaoPaulo", "ReviewID": "UR27882842", "Content": "As we had stayed there in a previous trip to Madrid and were very pleased, we decided to stay there again. The Gran Melia Fenix is a chic yet understated hotel with beautifully decorated rooms, polite and helpful registration desk and concierges. Our room was a standard one, so it was small but nevertheless comfy with lots of space to keep clothes. The bathroom too was compact but covered in marble, with soft fluffy towels and first class amenities. It is surely a 5 star hotel in an European capital city!! If we come back to Madrid again, we will certainly stay here again!!", "Date": "April 12, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Santa Monica, California", "Title": "“Best location in Madrid, old-fashioned but elegant 4.5 star rooms”", "Author": "Andrew W", "ReviewID": "UR27462730", "Content": "Overall, excellent choice in Madrid. Not that many contenders in the Centro/Salamanca area (the Ritz and Westin Palace come to mind... latter full of tour groups but nice). Liked the fact it's a Spanish chain... fewer Americans as a result. Rooms: More old school elegance than state of the art... some of the furniture looks better in the photos. Our moldings were chipped and needed to be caulked. Great soundproofing from the street... but you can hear people in the halls, next door and above and below you (creaky floors). Older TV in big armoire that took up too much space. Tiny bathroom but has 2 sinks and lots of beautiful marble. Bed a little hard but okay (hard beds seem to be the Spanish way). Small windows but we had a great view of the Plaza Colon. Avoid north and east views... they look directly into office buildings. The courtyard rooms have views that seem really claustrophobic. Public Areas: Again, small but marble-clad. Elegant, mostly very well-heeled crowd. A few tour groups. Overall, well done... like a mini NYC St. Regis before they remodeled. Nice paneled piano bar, WAY too brightly lit at night. Business Center has the slowest computers in history. Wildly frustrating. Teeny-tiny gym, not really a gym at all. Staff: Very friendly and accommodating. They were great. In fact, loved all the Spanish people we encountered in Madrid. Location: The reason to stay here. You can walk or take short (cheap) cab rides virtually anywhere. Tips: Great cerveceria/tapas bar with a high-end crowd every night a few blocks away. Called \"Lateral.\" On Velasquez in Salamanca. Apparently part of a small chain. Great bar food, incredibly cheap. Staff a little diffident but you can work them. Went there for dinner every night. 2 people, left tipsy and full, about 27 euros total. The Parc Retiro is amazing... most beautiful park in any major European city. And quiet! Loved it.", "Date": "April 5, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "3", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Boca Raton, Florida", "Title": "“A nice room in Madrid”", "Author": "Gourmetravels", "ReviewID": "UR26086659", "Content": "This hotel has some rooms that are bigger than others, if you request the Deluxe accommodations, King size bed , you will be very comfortable. The location is excellent ,near the high end Serrano shops and restaurants. Near museums and steps to the Paseo La Castellana. Do not order a Coca- Cola at the lobby bar, it will set you back ten dolares, right acrros the street is a nice coffee shop. Front desk and doormen are very courteous and helpful with directions . Airport is about 20 minutes away.", "Date": "March 12, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "New Hope, Pennsylvania", "Title": "“Great Hotel”", "Author": "Scottie001", "ReviewID": "UR24165300", "Content": "This hotel is probably the best location in Madrid, being in the stylish section, near calle Serrano. I was going to book at the Westin Palace, but I recalled from last year, there were no good restaurants in the area, and the metro was not convenient to my business. The Melia Fenix enjoys a great location, near the Colon monument, and it is just around the corner from the Serrano metro stop. It was an easy walk from the Prado. Check-in and check-out were easy, and the staff was uniformly helpful and friendly, as well as efficient. They offered all kinds of help with a smile, including directions, dinner suggestions, etc. The room was a bit on the small side, but was perfectly adequate and luxurious, with extremely comfortable beds, a flat-screen TV and CD player. The room was quiet and the bathroom was similarly luxurious, with ETRO toiletries. Breakfast, which was included in my rate, was excellent, with a wide variety of dishes, all delicious and fresh. I am usually a very picky person, but could find no fault with this hotel. Having stayed at several in Madrid, I can say this was the best (good value also - I booked through Otel). I will probably stay at Melia Fenix from now on, as I travel to Madrid once a year.", "Date": "February 3, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "3", "Check in / front desk": "5", "Overall": "5.0", "Value": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Centennial, Colorado", "Title": "“Great Location, Wonderful Hotel”", "Author": "jumbonav", "ReviewID": "UR21884470", "Content": "Traveled with several other travelers here for business. I would pretty much like to echo everything everyone else says but have one addition... This room, like others in Spain does not have a complete shower door. Not sure why it bothers me so but I'm in a very nice hotel in Sevilla right now and...same thing. Its like they forgot 25% of the shower door. Oh well, maid mops up the floor, not that big a deal. Excellent room. Best included breakfast buffet I've ever had at a hotel and I travel a lot, over 100 days a year average... Ask for a room overlooking the plaza. Highly recommended.", "Date": "November 15, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "4", "Check in / front desk": "5", "Overall": "5.0", "Value": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "London", "Title": "“A great group trip”", "Author": "MrDemandingLondon", "ReviewID": "UR21750733", "Content": "We were a group of about 25 Brits on a work trip, and this hotel looked after us extremely well. The hotel was as you would expect from the other reviews: clean and smart after a refurbishment; in a good location near the centre of things; good sized rooms; decent food. However we were most impressed by the friendly nature of the staff which ultimately makes the difference. For context a couple of us went for tea at the Ritz and they refused to let us take our pile of unfinished cakes away in a doggy bag - not the sort of service you want when paying through the nose, and places the Gran Melia in positive contrast. My only caution is that all the meeting rooms are underground and have no windows, which isn't ideal. That said, the hotel was excellent.", "Date": "November 11, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Panama City, Panama", "Title": "“Top of the Line Hotel”", "Author": "E_Panama", "ReviewID": "UR20234365", "Content": "We were surprised by the luxury of the hotel, the size of the rooms, and the friendliness of the staff. Our room was huge with a sitting area and huge bathroom. Everything was top of the line and clean, and the bed was extremely comfortable. The staff was more than eager to help, and very friendly. The breakfast buffet was plentiful and very tasty, and there's a Hard Rock Cafe next door which was also very handy. Location is ok, you need to get a cab to get to the Gran Via, or a 30 minute walk. Highly recommened.", "Date": "September 20, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Dallas", "Title": "“Exceptional Madrid experience”", "Author": "luvthebeach22", "ReviewID": "UR17822385", "Content": "My husband and I stayed at the Gran Melia Fenix for 4 days in November. I have stayed in several places in Madrid- Westin Palace, Hotel Hesperia, Melia Los Galgos- the Gran Melia Fenix rivals all. The location simply cannot be beaten- you have access to everything without the claustrophobic feeling you get staying in the area around the Ritz/ Palace (Plaza de Canovas). The GM is totally renovated, beautiful lobby and our room was enormous with a huge bathroom- a major luxury in Europe. Had incredible help from staff when we did need it, some of the best time we spent was wandering through the Salamanca neighborhood and going for tapas in the Santa Ana area. If you get a craving for American food the Hard Rock is right around the corner (be aware that on Sunday that may be your only option as almost everything is closed). The Colon metro stop is right there for longer excursions but you literally can get almost anywhere on foot from the GM. Be sure and ask for a room that faces the Plaza Colon.", "Date": "July 12, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "New Jersey,", "Title": "“Wow”", "Author": "roame_da_earth", "ReviewID": "UR17455415", "Content": "Everything I would expect from a 5* hotel. I have to admit, this is the first 5* hotel I have stayed in but I was not disappointed. The lobby is a bit small, but very beautiful with a grand staircase. Also on the same floor there is a beautiful little lounge and bar room with a very cozy feel. There is even a doorman to meet you upon your every arrival and departure. The location is very good being in the center of the old part of Madrid with fountains and statues right outside the hotel. Also, there is a Hard Rock Cafe right below the hotel if you aren't interested in the Spanish cousine. When entering the room I found chocolates to greet me with a beautiful plush bed with a very rich cozy decor. All the lights and airconditioning could be controlled by a little black box that sits on the night stand next to your bed. There is a maid service in the morining and a turn down service in the evening, where they again give you little chocolates. There are plenty of channels on the tv to choose from, including a few English speaking channels, a German channel and another channel in which I believe they spoke Japanese. The bathroom is done up in all marble with all the toiletries that you will need, so no need to bring your own. I also, really loved that there were speakers in the bathroom that were connected to the televison so I was able to listen to the tv while I showered. I've never done that before and found that to be a really neat touch. The rooms are spotless and the staff was very nice. Every moning when I was leaving my room, the maids always greeted me and even when I tried to speak Spanish, they were nice enough to speak to me in English. That was really nice. The breakfast is nice, but for a 5* hotel, the selection was not as large as I expected but there was still enough choices to find something you will like. This is a great hotel and I will definetely stay here again when I return to Madrid.", "Date": "July 2, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Business service (e.g., internet access)": "4", "Check in / front desk": "4", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Chicago, Illinois", "Title": "“Lovely grand hotel”", "Author": "name_screen", "ReviewID": "UR16991580", "Content": "Stayed in Gran Melia Fenix in June 2008 in a king non-smoking corner room. Room was good size, very clean, with large bathroom complete with plenty of toiletries, hair dryer, robe, slippers, etc. Bed was a litte hard. Armoire had safe and mini-bar. Internet access in room is 8EUR. Staff was all helpful and kind; concierge offered good recommendations on restaurants and site-seeing. Hotel is centrally located in Serrano shopping area and just short walk (10 min) to many museums and sites. Taxis were easy to find.", "Date": "June 17, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Business service (e.g., internet access)": "4", "Check in / front desk": "4", "Overall": "4.0", "Value": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Perth Australia", "Title": "“Small room but nice hotel”", "Author": "MSCPerthAustralia", "ReviewID": "UR16785119", "Content": "Hotels in Madrid tend to be quite expensive and the Grand Fenix is no exception . The Location is ok its about 15 minutes walk from the main tourist attractions . There are two types of rooms the ones that face inwards with no view which are a bit small however the bed was comfy . My colleague asked for a better room and paid 35 Euro more and got a room with an outside balcony and a view . A couple of things you have to know is that the restaurant does not open until 9pm and breakfast starts at 7am till 11 which is not untypical of Madrid . The staff were very helpful and I would stay there again", "Date": "June 9, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "3", "Check in / front desk": "5", "Overall": "5.0", "Value": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "UK", "Title": "“You can almost smell the new paint.”", "Author": "Opebble", "ReviewID": "UR14788154", "Content": "Stayed here on business in a Royal Service Room with access to private lounge. King size bed - one bed not two singles. Tiny bathroom but as I was on my own not a problem. Double glazing fantastic - room was on Catellana - main drag through Madrid and I couldn't hear a thing! Remote controls for lights, A/C etc very confusing - must be my advancing years! All staff very friendly and helpful. Hotel refurbished last August or so and corridors are absolutely spotless as was the room. Private lounge v good - free bar and nibblies. Staff recognised me by my name throughout. Main restaurant very good and again staff very friendly. Taxi rank right outside Hotel door.", "Date": "April 4, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Business service (e.g., internet access)": "4", "Check in / front desk": "4", "Overall": "3.0", "Value": "3", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Escazu, Costa Rica", "Title": "“Good Location, Tiny Room”", "Author": "CRHeel94", "ReviewID": "UR14717513", "Content": "The property is conveniently located in the Serrano district with easy access to many shops and restaurants. Taxi cabs in Madrid are pretty cheap so you have easy access to a gran Via/Puerta de Sol as well as the museums. The staff was generally helpful with requests and recommendations. The breakfast buffet is decent, but if you want something that's not there they will accomodate some requests without a problem (e.g., sunny side up eggs). The free wifi in the lobby is a nice touch and convenient for checking messages quickly. The rooms are very small, including a tiny bathroom. The king bed is two twin beds pushed together. The TV has a pretty wide selection of channels (rather rare in Europe) which was nice for winding down at night.", "Date": "April 1, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Business service (e.g., internet access)": "4", "Check in / front desk": "4", "Overall": "4.0", "Value": "5", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Sydney", "Title": "“Good Memories of Gran Fenix”", "Author": "TimK-M", "ReviewID": "UR13157986", "Content": "Arrived at the Gran Fenix Madrid following a 4 night stay in Prague at around 10pm (following flight delays). Group of 4. Husband and Wife. Son and Grand Mother. Note for Spain twin rooms - the beds are seperate but always together and will need to be pulled apart to suit 2 people sharing. Booked Gran Fenix on a special low season deal that included breakfast. My initial reaction was slightly dissappointing. Looking back, however, it was quite a good hotel. Location proved to be excellent (wouldn't stay in the old part of Madrid). The Colon plaza down to Retiro are excellent locations and out of the \"ugly\" side of Madrid. Gran Fenix is near the best shopping and close to a Supermarket. Easy access to sights (train, cab, bus and open bus tours stop near building). Gran Fenix rooms are well appointed and hark back to a Grand style. Carpets could be replaced and there are some tattered edges which have been referred to by other reviewers. Bathrooms have some irritating clutter and the usual outdated bidet. Direct in-room cable internet was the fastest we experienced in Europe. Gran Fenix buffet breakfast was 100% the biggest and best served up in all 6 European tours thus far - but lost on a 1 bowl of cereal and 1 pot of coffee person. Bar and Lounges are this Hotels biggest plus. Hotel staff were good quality hospitality personnel. Restaurant is fine dining but not really an \"experience\". If travelling with family try the Pizza Garden (other meals served) around the corner. Clean, fast and quality food at good price. Hard Rock cafe below hotel (part of building). Hyatt is being gutted and re-fitted up the road. Will probably set a 5 star benchmark and be ready after mid-2008. Check it out, otherwise, Gran Fenix is good for a comfortable stay in Madrid.", "Date": "January 31, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Fort Wayne, Indiana", "Title": "“Nice, but overpriced”", "Author": "smstl", "ReviewID": "UR11099560", "Content": "Stayed here a few weeks ago on a business trip. Hotel lobby is very nice with a comfortable sitting area. Front desk staff was excellent and very helpful. Did not use the restaurant as there are many places within easy walking distance. Hard Rock Cafe is in the same building on the other side, so that was good. Great location for the museums and walking tours of the city as well. The bedrooms were a mixed bag.The sleeping area was very nice, but a bit small. Bed was very comfortable, good desk for working with high speed internet access. The room was also decorated very nicely. TV and stereo were nicer than I have in my own home. The bathroom on the other hand was very dated. It did have a lot of marble area, but the tub/shower was very old with the large bathroom window on the main wall with a pull down shade that almost covered the window. Overall, I will probably stay here again on my next visit. It's clean, comfortable, a very friendly staff, and a great location.", "Date": "November 27, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "3", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Hawalli, Kuwait", "Title": "“Great hotel with great staff”", "Author": "Jenan2000", "ReviewID": "UR8823659", "Content": "Just returned from a business trip to Madrid. This is a very nice hotel with an excellent location in the center of Madrid. The staff are very professional and very friendly. The rooms are really nice with modern TV and stereo system. I stayed at room 306 and room 406 and they were great with beautiful marble bathrooms and Etro soap, shampoo and lotion. However, some rooms have small bathrooms so I think it's better to ask for a corner room. The breakfast is great and so delicious... It's the best breakfast I have ever tried in hotels. Hard Rock cafe is adjacent to this hotel. It's a short drive from the airport ( about 15 minutes by taxi ). Highly recommended.", "Date": "September 19, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "2.0", "Value": "2", "Rooms": "2", "Location": "5"}, "AuthorLocation": "Telford, United Kingdom", "Title": "“Lackluster Leading Hotel”", "Author": "Scherz0", "ReviewID": "UR8615723", "Content": "The Gran Melia is a member of the Sol and Leading Hotels of the World and we were expecting exemplary service, excellent rooms and a high quality restaurant. The two areas where we were unhappy were the room allocation and, in particular, the restaurant service. The public rooms, porter service, concierge and security were all exemplary with courteous staff and a good standard of decor and cleanliness (with the usual exception of the TV remote control). The room we had booked and had confirmed was described as non-smoking, deluxe interior with queen bed and patio view. While the room's standard of decor and cleanliness was good, it was rather cramped, overlooked a metal curved hood of some sort and, we discovered later, was noisy. The noise being generated from both the in-room air conditioning and mechanical or electrical noise from outside and below. Because this was a one night stay en-route to the airport, we did not bother requesting a room change at the time. Had I realised that the room was going to be so noisy, I would certainly have done so. Our primary area of complaint was, however, the restaurant. When we arrived we were 2 of the 3 customers present. The chair was not pulled out for the lady and the table not fully laid. The starters were well prepared and the wine good although improperly uncorked. Due to a mix-up in the kitchen, the first main course was not cooked as ordered and the second delivered cold. Although we had to attract the waiter's attention and were not asked whether everything was satisfactory, the problem was resolved. One of the dessert courses was again incorrect and I felt that 9e for the other dessert which was, to all intents and purposes, diced jelly and ice with a sauce was excessively expensive. Although present, the head waiter spent much of his time talking very audibly on a mobile phone or pager and at no point asked whether we were satisfied with any of the dishes. Nor did he apologise for the errors. The other waiter present may have been in training, but was polite and did his best to sort out the problems. Having stayed in a number of the 'Leading Hotels of the World' we were expecting a similar level of service and facilities. While many areas lived up to our expectations, we were very disappointed with the quality and service in the restaurant and not entirely happy with the room itself. On the plus side, the Madrid Hard Rock Cafe is adjacent to the hotel, and a hell of a lot cheaper.", "Date": "September 3, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "4", "Check in / front desk": "5", "Overall": "4.0", "Value": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Stratford Upon Avon", "Title": "“honeymoon”", "Author": "Mont1e", "ReviewID": "UR8369982", "Content": "This is a great hotel in central Madrid. Breakfast and staff were excellent. Communal areas are very grand and plush. However, our room was quite small, and we could not afford to buy a drink in the hotel - 6.50 Euros for a small can of Coke!", "Date": "August 7, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "San Francisco, California", "Title": "“Location, Location”", "Author": "PieroG", "ReviewID": "UR8106856", "Content": "this is one of the best hotels in Madrid. The location is excellent, right on the Plaza de Colon, with great views. I have stayed in it several times and it has always met and exceeded my expectations. It's within walking distance to all the major museums, shopping areas and the Metro is right next to it. Has satellite TV with all the major US networks and international channels also like RAI, TVE, french, russian, japanese and Al-Jazeera. The rooms are nicely appointed, quiet and the views are without par.", "Date": "July 12, 2007"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Paris", "Title": "“Great hotel, Spanish style service.”", "Author": "DJTraveller", "ReviewID": "UR5774176", "Content": "I've stayed here several times. It's a great hotel- clean, spacious rooms and beautiful public areas. The location isnext to the best shopping in town, although it is quite difficult to find cabs during busy times of day as the front door of the hotel is not located on a major street. Very good breakfast. Service is okay- but I think this is more a reflection of the general culture than a trait unique to the hotel. I will stay here again.", "Date": "September 6, 2006"}, {"Ratings": {"Cleanliness": "4", "Overall": "3.0", "Value": "3", "Service": "2", "Rooms": "4"}, "AuthorLocation": "Lima, Peru", "Title": "“Nice Hotel, Sloppy Service”", "Author": "Sergioo", "ReviewID": "UR5226778", "Content": "I got a nice room through the SolMelia website. It wasn't small although the toilet area was definitively not suitable for someone a bit overweight (fortunately not my case!) Breakfast was excellent, specially the \"jamon de bellota\". The shopping area around the hotel is amongst the best in Madrid. The only issues I experienced were related to front desk’s service: it was sloppy to say the least. One day I was expecting an urgent fax (I was on a short business trip, did not bring my laptop, and the business center only got two computers), and they lost it. The next morning (due to the time difference between Spain and South America) I inquired about my fax at the front desk (I got confirmation from my office that it was sent out), and they undoubtedly affirmed that no fax was received for me. So that same morning my fax was resent to me, my secretary call me right after to say it did go through, but I needed to wait over 30 minutes to get it at my door, despite all the incidents around that fax... So I asked again about my lost fax at the front desk, and they now accepted they may have lost it. The funny thing is that the fax machine is right adjacent to the front desk! In addition, none, yes, none, of the messages that were left to me at the front desk were ever delivered to me. These issues are unacceptable for a business hotel indeed.", "Date": "May 24, 2006"}, {"Ratings": {"Cleanliness": "4", "Overall": "4.0", "Value": "3", "Service": "4", "Rooms": "4"}, "AuthorLocation": "u k", "Title": "“could not fault it”", "Author": "pottypete", "ReviewID": "UR5067420", "Content": "i stayed for one night and i would stay here again, my room was just above the hard rock cafe but i could only hear street noise now and then. i had a king size bed and the room was fine, i ordered breakfast in bed which arrived in ten minutes, they brought me everything from yogurts to egg and bacon although the eggs had gone cold on the way up this was a small price to pay for a good stay. the only thing that concerned me was the bathroom had a clear glass door and if you were with children you would have to turn the light out when you used the toilet.", "Date": "May 14, 2006"}, {"Ratings": {"Cleanliness": "5", "Overall": "3.0", "Value": "2", "Service": "5", "Rooms": "1"}, "AuthorLocation": "London", "Title": "“It is a recurrent theme, rooms are cramped. Not sure about the Mars bars either.”", "Author": "FebMara", "ReviewID": "UR5028253", "Content": "The lobby's glass cupola is beautiful and the lobby is easily the best place to spend time in the hotel. Our room (number 310) was nicely decorated but cramped and the view from the only window was a wall. I would not have wanted to spend too much time in that room, luckily there was plenty to do outside and the sun was shining. Did I feel that this was a “Leading Hotel” experience? No. However, service was very attentive and charming, and breakfast was good. I think the amenities in the rooms could be improved to make the experience less claustrophobic, by having for example coffee/tea making facilities, wireless internet, and some fruit. Also, some real chocolate rather than the Mars Delight left on the pillows at night would have been more appropriate to the \"Leading Hotel\" label. Location is good but not exciting.", "Date": "May 2, 2006"}, {"Ratings": {"Cleanliness": "5", "Overall": "4.0", "Value": "4", "Service": "4", "Rooms": "4"}, "AuthorLocation": "UK", "Title": "“Great hotel, great location”", "Author": "travelbug2", "ReviewID": "UR4724574", "Content": "We stayed here for three nights in March 2006. An easy drive from the airport - took about half an hour. We loved th hotel and would definitely stay here again. The hotel is next to Plaza Colon in a good district handy for shops and restaurants. You're right next to the metro and a couple of bus stops so great for sight seeing. It was also an easy walk to the Retiro park. Our room (704) was on the top floor - one of the 'club' rooms. These rooms have a separate reception/concierge on that floor as well as a large lounge area where you have breakfast. Breakfast choices were great - cereals, breads, pastries, cheeses, meats, fruits, champagne, fruit juices, coffee, tea - hard not to find something you liked. After breakfast (from 7am - 11am) they always had cheeses, fruits, pastries, a variety of tapas, breads etc available throughout the day up until 11pm - as well as a very well stocked help yourself bar - no-one minded if you wandered in, poured yourself a couple of drinks, helped yourself to a plate of tapas and took it back to enjoy in your room. This was great after a day's sightseeing and then to finish off your evening with a nightcap under the stars on your balcony. Ah yes, our room - nice spacious lobby area, large bathroom but with tiny bath with shower over. Decorated in black & gold - not to my taste exactly. Bedroom was small but huge king size bed took up most of floor space but nicely decorated in formal English house style. Quite sombre and dark - very firm bed. Room was quiet so no traffic noise. Nice surprise was large balcony with table and chairs for four and steps up to a huge hot tub jacuzzi which was brilliant - very hot and very bubbly. Just be careful on a weekday since (room 704 anyway!) faces towards the 'back' of the hotel and you overlook adjoining office blocks and although your hot tub is well screened, when standing up to clamber out you might attract some interest! When you're sitting out on the balcony though you are totally secluded and private. We were very well looked after by all the hotel staff who were unfailingly professional, polite, friendly and helpful. Special mention must go to our reception/concierge Patricia who recommended great restaurants for us. She saw our look of despair when at first she recommended a flamenco restaurant - we're really not keen on the well-trodden tourist places and she came up with some other ideas for us. On our first night we ate in El General - a down to earth tapas bar restaurant full of loud noisy Spanish families - the food was excellent, no-one could speak a word of English and we loved it - just getting by on sign language and lots of laughter (and lots of vino!) Another restaurant we tried for Sunday lunch was Asador de Aranda - this is actually a very popular Spanish chain of restaurants and there are serveral in Madrid - don't let this put you off. They only serve Castillan white fleshed lamb - cooked in a vast oven with herbs on oak charcoal embers - atmosphere totally Spanish (again we were only foreigners in there and again no-one could speak English) and the lamb was amazing - pick it up and eat with your fingers for maximum enjoyment. Final evening for something totally different we ate at a Thai restaurant just around the corner from hotel. We love Thai food and this was very good. Everyone spoke English, it was full of English and Americans so very different but very pretty restaurant and service was excellent. Madrid is a beautiful, compact city - very easy to travel around and Gran Melia Fenix ticks all the boxes for a long weekend or business trip.", "Date": "March 22, 2006"}, {"Ratings": {"Cleanliness": "5", "Overall": "2.0", "Value": "2", "Service": "3", "Rooms": "2"}, "AuthorLocation": "Vienna, Austria", "Title": "“Small rooms, Ameneties closed”", "Author": "ACPACPACP", "ReviewID": "UR4520579", "Content": "We booked a room on top floor, which said it features Club-Amenities. But as we expirienced, the Club was closed as there were nearly no guests in the hotel. So we had to go for standard breakfast, which was fantastic quality & choice anyway. Be sure to go for bigger rooms than standard, they were incredible small! The complete hotel was very nicely decorated, even our room. But as I said: very, very small! Staff is very friendly, but chaotic. They wanted to charge us breakfast, because they didn't see that it was included with the room. Spa was also not available, beacause it was simply closed (just as the club).", "Date": "February 26, 2006"}, {"Ratings": {"Cleanliness": "4", "Overall": "5.0", "Rooms": "5", "Service": "5"}, "AuthorLocation": "Estero, Florida", "Title": "“Location, location, location”", "Author": "Larry J", "ReviewID": "UR4463789", "Content": "Excellent choice in the near center of Madrid. Rooms were well appointed, bathrooms small. Buffet breakfast at the hotel was outstanding as was a dinner taken at the hotel one evening. Very convenient for all that Madrid has to offer.", "Date": "February 16, 2006"}, {"Ratings": {"Cleanliness": "5", "Overall": "5.0", "Value": "5", "Service": "5", "Rooms": "5"}, "AuthorLocation": "Chicago, Illinois", "Title": "“Lovely Hotel”", "Author": "LisaMcD", "ReviewID": "UR4331183", "Content": "My husband and I stayed at the Gran Melia Fenix from Nov. 21 - 28, 2005. Our room included a king-size bed (which translates in most European hotels, including the GMF, to two twin-sized beds pushed together), mini-bar, internet service, and marble bath. Our room was quite spacious by European standards and very well-appointed. Rooms at the Gran Melia Fenix are certainly comparable to rooms at any Four Seasons Hotel location in the US, for example. We stayed on the Royal Service Floor which meant, among other things, that we could avail ourselves of a private breakfast buffet each morning. It was quite delicious and offered a wide selection of both Spanish food and traditional breakfast fare. The staff was friendly and helpful. The location is central. Our only criticism concerned the comfort of the mattress in our room. It was too firm. However, we would not hesitate to stay here again.", "Date": "January 7, 2006"}], "HotelInfo": {"Name": "Gran Melia Fenix", "HotelURL": "/ShowUserReviews-g187514-d239009-Reviews-Gran_Melia_Fenix-Madrid.html", "Price": "$204 and up*", "Address": "<address class=\"addressReset\"><span rel=\"v:address\"><span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">Hermosilla 2</span> | <span class=\"extended-address\">Plaza De Colon</span>, <span class=\"locality\"><span property=\"v:postal-code\">28001</span> <span property=\"v:locality\">Madrid</span></span>, <span class=\"country-name\" property=\"v:country-name\">Spain</span> </span></span></address>", "HotelID": "239009", "ImgURL": "http://media-cdn.tripadvisor.com/media/photo-s/01/68/8a/1c/gran-melia-fenix.jpg"}}