{"Reviews": [{"Ratings": {"Cleanliness": "3", "Overall": "2.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Boston, Massachusetts", "Title": "“Unique cockblocking experience at Hostel Lisboa”", "Author": "SeanJ77", "ReviewID": "UR124545293", "Content": "So, let me firstly say that as far as places to stay goes, this place was fine but my experience with the old doorman tarnished this place for me. I was in Madrid, visiting some old friends and decided to stay near the center. The plan was to go out, meet up with a few buddies, have a few drinks and see where the night went and I did all that and more. A friend of mine who I hadn't seen in a few months came out to meet me. We bar hopped with a few other friends and as one thing led to another we renewed our old friendship and I decided it was time to take her back to my exotic suite in Hostel Lisboa where I had sparred no expense for the lavish room. Upon arrival to the door I was greeted by a small angry looking Spanish chap who met me with the customary \"DIME!!!!\". So I told him the number and he looked at my very respectably dressed girlfriend and said in his charming Spanish tone 'y elle?' So I said, she's with me to which he responded in spanish saying, 'with her, you don't go up!' Cockblocked by the angry doorman!!!! Couldnt believe it! Just because he wasnt getting any, we weren't getting any either. I would have asked for my money back but I was out of option and she lived well outside the city so a walk to Cibeles was in order to make sure she caught her bus and then back to the Hostel to meet my favorite dumbo doorman friend. This place was a real exercise in patience. Highly unrecommended if you want to have some fun in the city", "Date": "February 13, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "3.0", "Value": "4", "Sleep Quality": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Louisville, KY", "Title": "“Have been there twice”", "Author": "DGM71", "ReviewID": "UR122189877", "Content": "Hotel Lisboa could use some redecorating and some renovation, but it sits in a great location and is very comfy for the price. Hotel staff is a bit reserved but quite knowledgeable and will help if requested. Little had changed from when we previously stayed there in 2006, but that was a good thing in many respects. When vacationing, we look for accommodations that are clean, well located, and safe, then we spend our time sightseeing. If this sounds like you too, Hotel Lisboa should be a consideration. One more thing...check out the nearby Maceiras for a fun and tasty tapas experience, but plan for a wait if you don't arrive early. Google \"Maceiras Madrid\" for restaurant reviews.", "Date": "December 28, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "3", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Santa Cruz, California", "Title": "“Downtown convenience”", "Author": "RogerCello", "ReviewID": "UR120702802", "Content": "Great location on a quiet street, not far from Plaza Sol and Plaza Santa Ana. Fifteen restaurants representing about nine different cuisines are within a few steps of the hotel. Room and bathroom were clean, bed comfortable (if a little short). Loud neighbors were a bother, but the concierge was helpful in contacting them. WiFi didn't reach my room but was fine at the reception. Staff is very friendly and helpful.", "Date": "November 17, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "3", "Location": "5"}, "AuthorLocation": "WOODFORD GREEN", "Title": "“it does what it says on the tin!”", "Author": "GOONERGONNAGETYA", "ReviewID": "UR119197848", "Content": "FROM THE airport we took the yelow T bus to PLAYA CIBELIS it costs 2 euro each way. 30 mins best deal . hotel is 10 min walk away Accomodation in Madrid is expensive - you can pay a lot more for a lot less! clean rooms , comfortable beds, lots of hangers in the wardrobes , tv and all about 5 mins away from wherever you want to be. The reception area is small, no bar , 1 euro coffee machine , 1 euro 1/2 hr internet or FREE wi fi !! latest password 'apolo' cant fault this hostel/hotel at all great value and the owner speaks excellent english and is very helpfull as all the staff are but others have limited english but still very helpfull. Even shared room hostels are about 30-35e in Madrid .finally remember there are no sea views so dont bother with a room with a view ! IT WILL BE NOISEY its Madrid - like trying to sleep near Trafalger Square! wE HAD A ROOM AT THE REAR of the hotel our view was lots of Air con units on te back walls - but we slept well every night.", "Date": "October 11, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "4.0", "Value": "5", "Location": "5", "Rooms": "2"}, "AuthorLocation": "Cicero", "Title": "“I've gone back.”", "Author": "CiceroLarry", "ReviewID": "UR30827240", "Content": "I have stayed at the Hotel Residencia Lisboa five times so far. I have to admit that the appointments are a bit worn and if you are on the street side there is a lot of noise. It seems that there are people out until the wee hours of the morning. But the price and the location can't be beat. Two short blocks to walk to Plaza Santa Ana, five blocks to the Prado. I first stayed there in 2004 and every year there are more tourist attractions. (Hence the late night noise for tourists going from club to club.) I have stayed there twice on October 12 \"El dia de la Raza\" It seems to be a night for staying out. There is nearby parking under the Plaza Santa Ana. I will be back in Madrid this year and plan on making reservations at the Hostal Lisboa.", "Date": "May 26, 2009"}], "HotelInfo": {"Name": "Hotel Residencia Lisboa", "HotelURL": "/ShowUserReviews-g187514-d239091-Reviews-Hotel_Residencia_Lisboa-Madrid.html", "Price": "$56 and up*", "Address": "<address class=\"addressReset\"><span rel=\"v:address\"><span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">Ventura de la Vega 17</span>, <span class=\"locality\"><span property=\"v:postal-code\">28014</span> <span property=\"v:locality\">Madrid</span></span>, <span class=\"country-name\" property=\"v:country-name\">Spain</span> </span></span></address>", "HotelID": "239091", "ImgURL": "http://media-cdn.tripadvisor.com/media/ProviderThumbnails/dirs/15/c0/15c01a46d70540d07bc82a9628840d621large.jpg"}}