{"Reviews": [{"Ratings": {"Service": "2", "Cleanliness": "3", "Overall": "1.0", "Value": "2", "Location": "3", "Rooms": "1"}, "AuthorLocation": "", "Title": "“I would rather sleep on the street than in this hotel.”", "Author": "Bren239", "ReviewID": "UR128340348", "Content": "The worst hotel I have ever stayed in. Twin room had bunk beds and was about 5ft wide. Manager is oriental with no English whatsoever he walked into my room without knocking and started sniffing the air to see if we were smoking so he could charge a â‚¬90 penalty. I told him I don't smoke add he still walked into the room while my son was in bed.", "Date": "April 22, 2012"}, {"Ratings": {"Cleanliness": "4", "Overall": "3.0", "Value": "3", "Service": "3", "Location": "3"}, "AuthorLocation": "Brighton", "Title": "“Review”", "Author": "DOMINIC H Posted by an Easytobook.com traveler", "ReviewID": "UR127463369", "Content": "Well... You get what you pay for... Simple as that. There's nothing wrong with the hotel if your just there to get your head down for few nights it's fine. Not really sure how to review such a hotel that's fairly minimal to be honest . Although it is cheap the breakfast is a bit to be desired. Would I recommend the hotel? I would for what it is, yes if ur a single traveller or with a mate, probably not with your missus.", "Date": "April 8, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "3"}, "AuthorLocation": "Aberdeen, United Kingdom", "Title": "“my worst nightmare”", "Author": "lorraine m", "ReviewID": "UR126273774", "Content": "it was a surprise week end away for my 40th birthday with my partner & i can sure say i will rember it . my partner being a man didnt read reveiws & went with pictures on there website !!! some people wld say clean but i wldnt go that far the carpet was so manky i kept my shoes on & the towels i hav cleaner ones to wash my floors . but the staff were polite !! the breakfast def not contanental !!! enjoyed my week end because of the city not my stay !!!", "Date": "March 18, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "tehran", "Title": "“the best price the best place”", "Author": "alireza t Posted by an Easytobook.com traveler", "ReviewID": "UR125962488", "Content": "very good place you can reach every where you wish in a few minuets by tram or walking and its very cheap in amsterdam it is clean but it has very small room the receptions are very cool. internet does not work with your laptop or cell phone you have to use their computer and there is just one computer.it 's excellent for a single or 2 guys.", "Date": "March 11, 2012"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Overall": "3.0", "Value": "2", "Sleep Quality": "2", "Rooms": "2", "Location": "4"}, "AuthorLocation": "", "Title": "“You get what you pay for !!”", "Author": "Posted by an Easytobook.com traveler", "ReviewID": "UR125909531", "Content": "People who leave negative feedback clearly don't read any reviews !! Basic but clean, 30 min walk from Dam square , 10e for taxi. If we hadn't stayed here then we would have missed out on amazing shops etc..", "Date": "March 10, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "2", "Overall": "2.0", "Value": "3", "Sleep Quality": "1", "Rooms": "1", "Location": "5"}, "AuthorLocation": "vicenza", "Title": "“If you're willing to overlook everything for the sake of price and location...”", "Author": "Alicia H Posted by an Easytobook.com traveler", "ReviewID": "UR125225954", "Content": "The front desk staff were helpful and the location was excellent, close to the van Gogh museum, concert hall, and Rijksmuseum and convenient to the bus. The rooms were small, which was expected, though the physical reality was more claustrophobic in effect than anticipated, and I'm not claustrophobic. What I didn't expect was the dingy nature of the entire place, most prominently in the bathroom which had large spots of black mould around the shower. A further failing is that the walls barely dampened sounds. If someone was in the hall, anywhere in the hall, I could hear their entire conversation, the same with the rooms to either side of me. When we arrived the carpet in the hall was being ripped up, which it desperately needed. The next day new carpet had been put down. It did not look like new carpet, but despite appearing that it had been there for the past fifty years, along with everything else in the hotel to include the towels, it certainly had the chemical smell. I would not stay here again. To end on a positive note, the bed was comfortable enough and hating the hotel meant I spent as little time as possible there and therefore more time exploring and enjoying Amsterdam.", "Date": "February 26, 2012"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "3"}, "AuthorLocation": "Warsaw, Poland", "Title": "“Avoid this place”", "Author": "Torobert", "ReviewID": "UR124295519", "Content": "Stinky hostel with tiny rooms and unhelpful staff! The best thing here is location but don't hesitate to spend few more euros and sleep in at least medium conditions. One of our friend found a little bit more expensive clean and nice single room in this area - bigger than a room for 4 people in Trianon.", "Date": "February 8, 2012"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Location": "4", "Rooms": "1"}, "AuthorLocation": "", "Title": "“The filthiest, nastiest, hotel in all of amsterdam!”", "Author": "Stephm21", "ReviewID": "UR122538037", "Content": "My boyfriend and i went on a quick spur of the moment trip to amsterdam the day after new years and for the first night booked a cute hotel over on the outskirts of the city. Our first night was comfortable and very good. The second night, when we booked into our second hotel, hotel trianon, i sadly cannot say the same. We walked into the lobby, which looked okay, so we were slightly pleased we werent staying in a dump. Also, we were practically across the street from the van gogh museum! But ohhhh were we in for a surprise! We got to our room, looked around, and noticed our sheets were nicely folded and made but upon closer examination were completely filthy, and stained. The carpet looked like it hadnt been vacuumed in months. Half the light switches didnt work, and their was a weird smell. Oh and it gets worse. We thought to ourselves, well hey, at least we have our own bathroom. When entering the bathroom we noticed the shower was stained with dirt and urine. No one had cleaned it in god knows how long. I wouldnt step foot in the shower if someone PAID me. It was the most disgusting thing i have ever seen. I decided to spongebathe in the sink during my stay. Our bed, we decided to put a fleece blanket over it and use coats and hoodies as covers. I walked around in the room with my shoes because it was just that dirty. And im not the cleanest person either but it was THAT bad. We didnt even bother with the breakfast after seeing the room LOL. Regardless, we spent most our time exploring the city and thank god for that! Upon checkout some guy also checking out said someone stole a macbook from the room. Everyone staying there was extremely unhappy by the looks of it. Seriously, spare yourself the aggravation and trouble. Dont ruin your trip by staying here. Spend the extra 30 euro to stay somewhere decent. I am honestly surprised we didnt find a dead body under our mattress. As for bed bugs, i have a few mysterious bites so thank god i didnt sleep under the blankets there. The guy who owns this place is obviously a crook and doesnt care about peoples well being. Just go somewhere else. I highly advise it lol", "Date": "January 4, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "2", "Overall": "2.0", "Value": "3", "Sleep Quality": "2", "Rooms": "2", "Location": "5"}, "AuthorLocation": "DUNDRUM", "Title": "“OUR STAY AT THE TRIANON ''HOTEL''”", "Author": "wilfred s", "ReviewID": "UR122287743", "Content": "I made the mistake of not reading the reviews before booking although the web sites details seemed ok. This place is in need of a complete re- furb / re-decoration /re-fit etc .The rooms are mini-skule , my wife & i are not big people but couldnt pass between the beds . Bathroom--the basin was cracked & there wasnt a ext. fan ,on the positive side the water was hot . The walls in the bedroom are very thin ,no sundproofing at all , we could almost make out our neighbours conversations . On one occasion we couldnt get to sleep with the noise from the next bedroom & had to report to reception which helped a bit .Breakfast is basic but adequate , a choice of cornflakes or fruit salad , sliced cheese or ham , bread rolls or sliced loaf ,tea or cofee from a machine.Those photos most have been taken years ago when the carpets and furnishings were new as they are now tatty , dirty and worn , with a strange smell about the place .The staircase is very narrow ,you can only go up or down one at a time I dread to think what would be the outcome in the event of a fire , i didnt see a fire escape.! This was our first visit to Amsterdam which we did enjoy but if we ever return it certainly wont be to this ''hotel' '", "Date": "December 30, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Istanbul, Turkey", "Title": "“twin room is fine enough”", "Author": "ninjaciko", "ReviewID": "UR120898995", "Content": "We stayed in a twin room in this hostel. The rate & location is really great . the room is clean and smoking is available even we stayed on the restricted floor :D which is what we need.", "Date": "November 22, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "2", "Overall": "2.0", "Value": "2", "Sleep Quality": "1", "Rooms": "1", "Location": "3"}, "AuthorLocation": "London, England, United Kingdom", "Title": "“How Dangerous is this place???”", "Author": "John C", "ReviewID": "UR119587283", "Content": "I stayed there in Sept 2011, whilst travelling solo for 3 nights, i can only say you get what you paid for. Unfortunately for me, i was staying in room 405, on the top floor, sharing with 7 other people. Not so bad, but the 1 window which opened in the room, measuring 1 foot square, was all the ventilation we had, The balcony door was locked & no amount of pleading with the rather unhelpful staff would get them to open it, citing it was to dangerous. Dangerous was 8 people on the top floor with no working fire alarm & no other way out of the room had there been a fire, plus they seemed to have placed a ladder \"STAIRCASE\" in the middle of the room which was the most dangerous thing in there. If you go stay clear of room 405", "Date": "October 22, 2011"}, {"Ratings": {"Cleanliness": "1", "Sleep Quality": "1", "Overall": "1.0", "Value": "1", "Service": "1"}, "AuthorLocation": "Bracknell, United Kingdom", "Title": "“Worst \"hotel\" i have every stayed in”", "Author": "Monkey1234567368", "ReviewID": "UR117654385", "Content": "Just got back from this hell hole of a hotel. Its not a hotel - its a hostel lets face it, the rooms were filthy (we had an 8 person, 4 person and 2 person room so it was not just a case of one bad room). The toilet absolutely stank, shower curtain mouldy and the shower water was brown, I actually did not bother having a shower in 2 days - you would probably be better off walking over to the park and running under the sprinkler system. The worst part of the whole stay was one with the staff. We had a room on the top floor which in itself was not a problem, there was a door which opened up onto a balcony area. We were all enjoying a few beers in the sun outside when one of the staff burst out (without knocking) and starting being very aggressive towards us. Were were not once told not to go out on the balcony however the guy insisted we had been told many times before which was simply not true. We obliged and returned inside (we are all +30, married with kids etc not typical drunken louts).....this chap then returned with a power drill and another chap (again burst in no knocking) and continued to bolt the door shut. Now, the room had no air con and was filthy, stank of sewage and it was around 26 deg C on the saturday........the worst think was that this was our only fire exit if the main exit became blocked. We asked what to do in the event of a fire and was told that it was not his problem and to throw the table through the window!!!!!!!!! seriously this place should be shut down - we did not have bed bug problems but there were fag buts everywhere, stained carpets and tiny rooms. THIS IS MY FIRST HOTEL REVIEW - DO NOT STAY IN THIS PLACE.", "Date": "September 4, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "1", "Overall": "1.0", "Value": "2", "Location": "4", "Rooms": "1"}, "AuthorLocation": "", "Title": "“Everything was wet...”", "Author": "Teebles", "ReviewID": "UR116252604", "Content": "We only needed a room for one night and when we walked in the everything was soaking wet.. Sheets, pillows, walls, everything.. We propped open the window and hung everything out to dry.. Made the best of it, but only because it was one night", "Date": "August 4, 2011"}, {"Ratings": {"Service": "2", "Cleanliness": "1", "Overall": "3.0", "Value": "3", "Location": "4", "Rooms": "2"}, "AuthorLocation": "london", "Title": "“Great Location but Prison Cell Like Rooms”", "Author": "Countmypearls", "ReviewID": "UR115983245", "Content": "We stayed at This hotel in june.Our expectations weren't high as we knew it was a budget hotel. Location was superb, very close to museums, public transport, supermarket etc... Unfortunately room was terribly small that two of us couldn't stand next to each other!! We knew we'd have a bunk bed and it was fine as we would only use it to sleep but still it was sooo sufficating! On top of that room was not clean at all.I don't think it has been hoovered for months! Dust everywhere!Corridors very filthy and stinky. Beds were relatively clean and comfortable. They say they have wifi but only in tiny reception area. There is no access to wifi in the rooms. It is such a shame they got sooo greedy with this hotel and turned it into a filthy place with prison like rooms.", "Date": "July 29, 2011"}, {"Ratings": {"Cleanliness": "3", "Sleep Quality": "3", "Overall": "3.0", "Value": "4", "Service": "3"}, "AuthorLocation": "Odense, Denmark", "Title": "“basic style dorm”", "Author": "surabhi_k", "ReviewID": "UR115884232", "Content": "I stayed at the Trianon, 8 bed mixed dorm. The dorm room was clean and well equipped with towels and fresh bed linen. Breakfast was not included and was an additional 5 euros, for which it could have been better. the hotel advertised free wifi access but this is only in the hotel lobby and not in the rooms. They had just one computer there and no real place to sit and work if you need to use the internet.", "Date": "July 28, 2011"}, {"Ratings": {"Cleanliness": "1", "Sleep Quality": "1", "Overall": "1.0", "Value": "1", "Service": "1"}, "AuthorLocation": "Stuttgart, Germany", "Title": "“bed bugs”", "Author": "icepressoengel", "ReviewID": "UR114896631", "Content": "this hotel has got a serious bed bug problem! warned by these comments here, we had a special blanket to prevent the bites plus we brought our own sleeping bags, which worked. we killed 4 bed bugs though, one filled with a lot of blood.totally disgusting. the breakfast is not very substantial. the people working there were very nice, mostly students. the location is perfect, right at the museumsplein and very nice.", "Date": "June 30, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "3"}, "AuthorLocation": "London, United Kingdom", "Title": "“Disgusting Invested With Bed Bugs Filthy Hell Hole”", "Author": "Spotso", "ReviewID": "UR112407638", "Content": "I returned from Amsterdam this week where I stayed at the Trianon Hotel with six friends. I strongly advice anyone who is thinking of staying there not to.It is near the museums, so may be tempting because of its locaction. I urge you not to be tempted. This place should be Shut down.It should be reported to the Dutch health and safety. The room I shared with my sister was disgusting. My sheets had stains on it. The bed was lumpy and uncomfortable. The room itself was filthy. The shower and toilet again were disgusting. Filthy floor and toilet. We complained to reception with no joy. \"All the rooms are the same\" Dont even think about getting into the lift because it does not work. Again filthy, very old and tiny. Fits two people and gets stuck between floors. The worst part though was the second night. ONe of my friends, staying in a triple room woke up in the middle of the night and found her bed covered with literally hundreds of bed bugs!!!.She is bitten from head to toe with hundreds of bites, including loads over her face.Can you imagine how horrifying it is to think that these bugs had been crawling all over her while she was asleep!! She has been to the doctor, who told her that it is the worst case she has ever seen. She has been put on steroids, antibiotics, and has been signed off from her work for the next two weeks.This is just not good enough. If you read other reviews about this hotel it is obvious that they are invested with bed bugs, so why have they not been shut down??? They know they have this problem and they still carry on. Dont forget it is not cheap and cheerful. It cost Â£80 a night for the double??? More like single room. My sister has informed the Dutch tourist board, and they were shocked. As for the breakfast I tried it once, and didnt bother for the next 2 mornings. It was revolting. I really do not understand how the owner of this dump can live with themselves, I suppose they do not care as long as they are raking in the money. It is a well known problem. One of the \"cleaners\" had bed bugs down his leg (he was wearing shorts) and told us that they are everywhere in the place. So It is a known problem. Please do not stay at this dump. I am going to keep on trying to get the place shut down.", "Date": "June 9, 2011"}, {"Ratings": {"Cleanliness": "2", "Sleep Quality": "2", "Overall": "2.0", "Value": "3", "Service": "3"}, "AuthorLocation": "Paris, France", "Title": "“Like say the song \"please don't go\"”", "Author": "Morgan_du_93", "ReviewID": "UR112279402", "Content": "The room sucked totally, there was bugs on the bed, The only positive view is that the hotel is near all the museum and a beautiful public garden!!!.", "Date": "June 8, 2011"}, {"Ratings": {"Cleanliness": "1", "Sleep Quality": "1", "Overall": "1.0", "Value": "1", "Service": "1"}, "AuthorLocation": "London, United Kingdom", "Title": "“Dirty and infested with bed bugs”", "Author": "Lindsay0", "ReviewID": "UR112210339", "Content": "Seven of us stayed in this hotel for 3 nights in June. The hotel is filthy and the rooms are tiny. When we asked to change our room we were told this wasn't possible so had to put up with the dirt. The carpets are ancient, filthy, and covered in food and detritus. There were two empty crisp packets on the stairs that stayed there the whole 3 days, and a cigarette end that stayed there for 2 days. The only people we saw cleaning were young guys who looked like students. We tested our cleaner by leaving hairs etc. in the bath, which were there the whole time we were there - the cleaners didn't even use the shower to swish around the bath. The very worst thing, however, was that my friend woke in the middle of the night to find her bed absolutely covered in bed bugs - literally hundreds of them. She had to move rooms in the middle of the night but we saw the sheets taken off the bed she had been using lying outside the room the next day - obviously the bugs can spread this way. We were told by a member of staff that the whole hotel is infested with bugs. I urge you not to stay here. Although it is advertised as a budget hotel we paid Â£70 for the room, which although not expensive is certainly not that cheap. The men on reception were friendly and helpful, and we do not blame them as they are probably being paid a pittance. We blame the owners for not putting any money or care into this dreadful hoteland for accepting money from tourists when they must know that the hotel is alive with bed bugs (I also noticed a previous reviewer said their whole party caught scabies from the hotel). My friend has been to see her GP who has said that her bed bug bites are the worst he has ever seen and she has had to take steroids and antibiotics. Amsterdam is great, but stay away from this hellhole of a hotel!", "Date": "June 8, 2011"}, {"Ratings": {"Cleanliness": "1", "Sleep Quality": "1", "Overall": "1.0", "Value": "1", "Service": "1"}, "AuthorLocation": "Chicago, Illinois", "Title": "“Hazardous and Horrible”", "Author": "carter0013", "ReviewID": "UR111121510", "Content": "BED BUGS! Also, broken toilets, double bookings, hunks of salami rotting on the hallway floors to draw rats and roaches. So by all means stay here and save your money; you can spend all that savings and plenty more cash on exterminators and doctors' bills for your own home and health when you return.", "Date": "June 2, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "5"}, "AuthorLocation": "Warsaw, Poland", "Title": "“The worst hotel ever!!! I mean it! / Najgorszy hotel na Å›wiecie!!! NaprawdÄ™!/Das schlechteste Hotel der Welt! Wirklich!”", "Author": "Kidada", "ReviewID": "UR109196610", "Content": "If you book a single bedroom in Trianon hotel, you're sure to be put in a multi person (e.g. eight) room with women and men. Even if you had paid for a single room you won't be able to change the room cos they will tell you that all are occupied. The rooms are in a horrible condition, dirty, stinky, reaaaaaaaly tiny (you won't even be able to take your stuff out of your suitcase and walking between the bunk beds is impossible), with destroyed furniture and with traces of mould in the bathroom. Don't dream of any privacy or good night's sleep! It seems that double booking is a routine practice in this ahem ahem \"hotel\". I met others who were tricked by Trianon. So take my advice and keep away!", "Date": "May 21, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "4"}, "AuthorLocation": "Granada, Spain", "Title": "“The most horrible hotel experience of my life”", "Author": "daria38", "ReviewID": "UR106731423", "Content": "Dirty rooms with hundreds of bed bugs. It was horrible. Couldn't close my eyes at that night because till morning stuff could do nothing! They gave us some kind of spray to kill the bugsat 1 a.m, so i suppose they knew about this problem. Plus very dirty bathroom with erdam drips after \"cleaning\". Toren bedsheets. Ah yeh.. location is good! But I would prefere stay one hour away from Amsterdam then to spend one more night with bed bugs in dirty place. For info (http://en.wikipedia.org/wiki/Bed_bug)", "Date": "May 3, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "2", "Sleep Quality": "1", "Rooms": "1", "Location": "4"}, "AuthorLocation": "Donetsk, Ukraine", "Title": "“Worst Hotel Experience Ever!”", "Author": "Vladimir_1_9_8_2", "ReviewID": "UR106730361", "Content": "We had a bed bugs in our room! Here is a video I took in that room: http://www.youtube.com/watch?v=7eIKheOZxNQ If somebody can help me to pass this video to some epidemiology organization in Holland I will much appreciate it, there should be no such hotels! BTW I was stupid to book this hotel through budgetplaces site which had no bad reviews...", "Date": "May 3, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Sleep Quality": "2", "Rooms": "1", "Location": "3"}, "AuthorLocation": "London, United Kingdom", "Title": "“ENTER AT YOUR OWN PERIL!!”", "Author": "arthurloooopy", "ReviewID": "UR105259444", "Content": "We were lookinh forward to ouir double room and got what appeared to e a cupboad with twin beds, one with external springs, and one pillow!! Went to recepton for another one and some coat hangers!!! There were no more so were given sheets and a couple of towels to make a makeshift pillow. As for the hangers we had to wait till morning and hope for the best. Breakfast was a non-starter unless you were happy with bread & jam (no Butter!!!!!!). We were promised cereal on the second morning and yet again there was nothing. Did get a dried boiled egg or 2 BUTTER!!!!!!!). What kind of hotel has no cereal or butter?????? I even took my own milk (soya) and they could even supply anything for me to put it on! When we returned to pick up our luggage and leave the hotel we said goodbye and smiled at the receptionist. We had barely a grunt of recognition - says it all!!!!!", "Date": "April 24, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Location": "1", "Rooms": "1"}, "AuthorLocation": "London, United Kingdom", "Title": "“If you have standards... Don't stay here!”", "Author": "Dancey_hannah", "ReviewID": "UR103136513", "Content": "Where do I start? We booked this put of pressure from the travel agent. We wanted centre of town and close to all amenities. Ita over 1/2 walk to dam square and the rooms are so filthy it makes your stomach turn. Pictures have been added! The staff are rude snd have no interest in the customers needs. Breakfast was included. Cold meats (I wouldn't be convinced they were even in date) hard bread, juice was like water! The lifts are a botch job, you put your life in danger stepping in there. It's like a hotel out of a horror film! Please please don't stay there. We got moved after the first sleepless night. Worst hotel I have ever stayed in or even set eyes on!!!", "Date": "April 7, 2011"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Overall": "2.0", "Value": "3", "Sleep Quality": "1", "Rooms": "2", "Location": "4"}, "AuthorLocation": "Cheshire", "Title": "“Only for people looking for VERY basic on a budget”", "Author": "TravellingSong", "ReviewID": "UR101035164", "Content": "On arrival at the hotel we were too early for check in but the staff were very friendly and welcoming and allowed us to leave our luggage while we went to explore. On returning to check in the staff were again very friendly and directed us to our room. At that point we had seen only the reception area, restaurant and toilets and were so far impressed by the cleanliness and decor; unfortunately this did not continue as we left the ground floor!! We had booked an en suite room which I would recommend as we did notice one bathroom along a corridor which seemed quite seperate from the rooms it was intended for. The room was small which we expected but although it was basically clean it was very dated. The bathroom had a toilet and shower but it was a big step up to get into the shower and I had to be assisted by my partner to climb out as I was afraid of slipping. The shower itself was awful. We were only looking for a place to sleep while we packed as much as we could in our two day trip but we would have liked a small amount of comfort. Compared with other places we stayed it was neither cheap nor cheerful! The bed was extremely uncomfortable and the room became too hot and stuffy during the night. We had paid for the inclusive breakfast...DON'T!! We went down just before 9:30, breakfast was supposedly served until 10; there were no members of staff around and although some of the food was still available it was evident that as soon as things ran out, that was it. They didn't even have anybody replenishing crockery! We had to use cups for juice as glasses had run out and a spoon to spread butter on our rolls as all cutlery had run out! Everybody in the room seemed to be in the same predicament so it was obvious they had set up breakfast first thing and left it! It was a disgrace. On the up side the hotel was in a great location, it was outside of the main centre but being people who enjoy walking we managed to go by foot to the near by Leidseplein where there are a number of restaurants and bars. From there the following day we walked all around the town. We would recommend the walking tour of the Red Light District, a safe and informative way to see the much talked about area. Also the house of Anne Frank is definately worth a visit.", "Date": "March 21, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "3"}, "AuthorLocation": "New York City, New York", "Title": "“OVERBOOKING AND NO MONEY BACK!”", "Author": "nycr", "ReviewID": "UR99524096", "Content": "Very dirty hotel with anit-sanitary conditions. Bed bugs and rats. No Internet in rooms and unstable reception Internet. Poor breakfast. You need tram to city center. However my travel agent book me this hotel for nights for between flights from/to Amsterdam. For first stay I was shocked at the anti-sanitary conditions. For second stay bettween my flights I need hotel only for two hours for shower. My room was overbooked and sale twice. Hotel staff don't agree with money back and was very aggressive. So I call a Police. Fantastic. I can imagine such a hotel in Afghanistan, but not in Amsterdam.", "Date": "March 9, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "3"}, "AuthorLocation": "Manchester, United Kingdom", "Title": "“DISGUSTING DIRTY - WALKED OUT WITHOUT REFUND IT WAS SO BAD”", "Author": "The_Clynes", "ReviewID": "UR86733120", "Content": "Be warned, avoid at all costs. The booking was made as a present for us, and paid for before we arrived, but once we had seen the disgusting dirty state of the place, we had to leave and find somewhere else. When we arrived we found that the double room we had booked was in fact a twin (just married, not what we booked). Had to wait half an hour for somebody to \"clean\" a double for us. When we finally got into the room we didn't even unpack. The carper was stained and dirty. The walls where smeared with blood stains. The mattress was stained. The bed sheets were dirty and had hairs in them (pubic it would appear). All the surfaces were dirty and covered in \"whatever\". The bathroom was damp and mould ridden. The spare toilet roll was wet and covered in splatters of something distinctly disgusting.. The windows were cracked and mouldy ... need I go on. Basically the sheets appear to have been slept in already, and no cleaning had been done for some time. The receptionist showed no major surprise at out our complaints, and wouldn't acccept that this was not acceptable. No refund was offered, despite our requests. We didn't expect top quality accommodation, we knew it was a 2 star, but this wasn't just basic (we would have been happy with that), but I honestly wouldn't have put a dog in this room, completely unacceptable ...check out the pictures. I can only post 10, but I have more if you ask. Do your self a favour, and find somewhere else !", "Date": "November 11, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Sleep Quality": "2", "Rooms": "1", "Location": "3"}, "AuthorLocation": "Istanbul, Turkey", "Title": "“terrible”", "Author": "drdaytop", "ReviewID": "UR85854744", "Content": "the hotel was terrible. very old furnitures and bath and no cleaning. best thing about this hotel was to be near to teh best museums and tarm station. i will never go there!", "Date": "November 3, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "1"}, "AuthorLocation": "Tel Aviv, Israel", "Title": "“DO NOT GO THERE”", "Author": "CHEN23", "ReviewID": "UR83246877", "Content": "we made a reservation between the 5-11 of october. for a double bed room in Trainon Hotel During our stay we found bed bugs in our room we got bitten all over our body we complained in the reception and they were very non considering, like its a normal thing for them, they didn't have any other rooms vacant so they just gave us a smelly bug spray and send us back to the room. we got bitten every night it was simply suffering to stay there. when we asked to talk to the manager the answer was always that he \"wasn't available\" / they refused to give us any kind of refund! we have pictures documenting the bugs and our bites.", "Date": "October 12, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "2", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "4"}, "AuthorLocation": "Cork, Ireland", "Title": "“Paid for rats in the room????”", "Author": "agness_davis", "ReviewID": "UR82035870", "Content": "I didnt mind that the room was small and that the whole room smelled a bit funny. But then I realized that I am not alone, as I had a mouse in the room. After 6 hours of sitting in the bed and not being able to sleep I went downstairs and told the hotel employee that I have rats in my room. First he didnt looked suprised at all then he told me that there is nothing that we can do and that they are fully booked, so I can go back to my room, or checkout early.. at 4 am... He advised that I write an email afterwards with a complaint to ask for a full refund. I have done so, and have not even gotten a reply, if you choose this hotel because you just need a place to sleep think again,. That will be the only thing that you cant do!! Its so not worth the money, i should have just spent the money on other stuff since I couldnt sleep anyway..", "Date": "October 4, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Sleep Quality": "4", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Belfast, United Kingdom", "Title": "“Small and a bit dingy”", "Author": "tripadviser21", "ReviewID": "UR73250646", "Content": "We stayed in a twin room. It was very small with little room for luggage. The TV didn't work and we could hear everything that went on in neighbouring rooms. There was a nice balcony, but we shared it with two other rooms. This was a problem at night as there were no windows and no air con - we could only let air into the room by leaving the balcony door open. There was free internet in reception, but it was quite slow. Also I've read about a free breakfast in some of these reviews, but when we asked at reception we were told we had to pay extra? The hotel was very close to a tram stop and there were nice restaurants nearby.", "Date": "August 1, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "2", "Overall": "4.0", "Value": "4", "Sleep Quality": "2", "Rooms": "2", "Location": "5"}, "AuthorLocation": "Sidcup, Kent", "Title": "“Great Location - Great People - A Bit Noisy!”", "Author": "LennySidcup_Kent", "ReviewID": "UR70526351", "Content": "I stayed here for 4 nights, Monday â€“ Thursday, to try and avoid the Stag Doâ€™s. I was greeted warmly by the receptionist in English which put me at my ease. Yes, the rooms are very small, but people have to remember this is a 2 star hotel, not the Ritz! Perfect location for Museum Square where I joined 50, 000 Dutch fans watch Holland in the World Cup Semiâ€™s on a massive screen â€“ awesome! My first night was very noisy â€“ there is no noise insulation in this hotel, so it is just the luck of the draw who your neighbour is. The receptionists I found to be very pleasant people who seemed always willing to help. I kept asking for change for the coffee machine, and it was no problem for them. The Dutch are really great people; you just have to know them! I hope to stay here again in October!", "Date": "July 11, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "2", "Sleep Quality": "1", "Rooms": "2", "Location": "3"}, "AuthorLocation": "England", "Title": "“HORRIFIC!!!!!!”", "Author": "Rocky070", "ReviewID": "UR70407178", "Content": "Our room had not been cleaned when we arrived. There was used bedding with dirty tissues in the bed. We complained to reception, who said they would sort it out. When we arrived back at the hotel SIX HOURS later, it still had not been cleaned. I rang reception, who told me i would have to come and collect the bedding myself and put it on the bed. I didnt mind this too much. Although when i asked for some cleaning spray the receptionist told me it was NOT used at the hotel. He then told me bleach and warm water was used to clean the rooms and i could not borrow it as there was only one bottle for the whole hotel. When I went to change the bedding I was horrified to discover blood COVERING the pillows and matteress. I later discovered it on the carpet, bathroom door handle and curtains. The man on reception could not have cared less and the room was not cleaned for our entire stay, which was a week long. It was filthy and looked like a horror movie. If anyone is considering staying here PLEASE DONT!!!", "Date": "July 10, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "2.0", "Value": "2", "Sleep Quality": "2", "Rooms": "2", "Location": "4"}, "AuthorLocation": "Bellingham, Washington", "Title": "“find some place else”", "Author": "momlikestotravel", "ReviewID": "UR70271595", "Content": "The hotel was located in the museum district which is an easy location on the bus and tram line so made it easy to get around the city. Also easy to get to from the airport and to the train station, those were the only good things about this place. The front desk was not very friendly or helpful, but did let us stow our luggage until check-in time. When we finally did check in and get our room, YIKES! The ceiling had mold on it. The floors were filthy. The door to the balcony was blocked with furniture and then we found out the door was unable to close. It appeared that they had tried to nail it shut, but it had been pried open. The good news was that our bed linens were clean. We did have our own private bathroom down the hall. The bathroom was adequate but not very clean. The hotel was rather noisy from other guests, but not too bad. they did have free internet and a free breakfast in the restaurant that shares the building. The breakfast was very good and the restaurant was very clean and nice. The hotel was adequate and we had just flown 9 hours and had a 9 hour time difference so were tired any way and just needed a place to sleep. If you are planning on staying in Amsterdam for more than one night, look elsewhere.", "Date": "July 9, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "4", "Sleep Quality": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "alness", "Title": "“sound for a stag do”", "Author": "AlnessDooda", "ReviewID": "UR66951202", "Content": "was clean,new towels each day,good location,right next to the concert hall & van goch museam & there was eight of us making some niose & there was no complaints.they also sold us beer all through the night which was a bonus.wouldn't go here for a romantic trip but for large groups,stag&hen parties etc it was perfect-can't say what the breakfast was like cos never made it.the reception staff were very friendly", "Date": "June 9, 2010"}, {"Ratings": {"Service": "2", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "3"}, "AuthorLocation": "Southampton", "Title": "“Bugs, BUGS everywhere!!! DO NOT STAY THERE!!”", "Author": "sunshanita", "ReviewID": "UR66233425", "Content": "I stayed at this Hotel last weekend and seriously it was the WORST experience ever! I felt like I should share so no one has to go through what I did... The location was fine, very close to the tram stop, but this was about the only good thing. The hotel looks old and dirty, the corridors old and filthy and the room smelled of urine and felt dirty and dusty. I decided to look past this and try to enjoy my holiday anyway, so I put some airf reashner all over the place , opened the windows to let the air in and left to have my dinner. Later that night, I woke up itching like crazy, when I opened my eyes and with the light coming in from the street I could see lots of little black things moving in the bed, to my surprise, when I turned on the light I was shocked to see the whole wall and bed was full of bugs, bed bugs, hundreds of them. I panicked completely and ran downstairs to reception to decided to leave that horrible room... the person in the reception was helpfull and found us a solution, which was to move to their sister Hotel (Inner Hotel) for the night as they were fully booked and to return the next morning where they would hopefully have another solution. it was 4AM as me and my partner grabbed our bags and went looking for the other hotel! Needless to say, I did not sleep a minute that night, still scared of my experience... The next morning I went to Trianon Hotel and told then I did not want to go back there, so they said it was ok to move to The Inner Hotel and stay there for the remaining of the trip. I am now back home and all is ok, except that my body is still covered in itchy bites from those horrible bugs. I was not expecting any luxury, but as we paid 220pounds for 3nights I did expect to have a clean room without bugs or rats.... maybe it was too much to ask? I don't think so.... So now you know, if you decide to stay there then you are at your own risk...", "Date": "June 2, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "4", "Sleep Quality": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Pontefract, United Kingdom", "Title": "“Cheap and cheerful”", "Author": "asdabob", "ReviewID": "UR65803482", "Content": "Arrived later than expected due to flight delay, but reception staff was fairly helpful. Ok, the rooms are on the small side, but are adequate for what we wanted. Breakfast was a continental affair, but to be honest, what do you expect when travelling on the CONTINENT????? If you cannot fill up on cereal, bread,ham cheese bread rolls and jam/spreads, then there are plenty of other food outlets around Dam square from Maccy d's and Burger King to self service pizza places, but do track down N Y pizza for an absolutely great slice. Basically the hotel IS basic but there is so much to do, you will be out of it for roughly 17 hours a day, just like we were.", "Date": "May 30, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "3"}, "AuthorLocation": "London", "Title": "“would not come back”", "Author": "poopydog", "ReviewID": "UR65725483", "Content": "If you are squeemish about rats, don't stay here. I had a rat in my room (first floor) that kept me up all night. It ate through my closed snack bar. They would not refund my money, but did offer a night in another hotel nearby, but I decided to stay with a friend on the 3rd floor so as not to be away from my group. They had an attitude about the timing about whIch day I made the complaint as well. Also, get to breaksfast early before all the hard-boiled eggs are gone. Broken safe, bedside light broken, mould in the showers.", "Date": "May 29, 2010"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Overall": "2.0", "Value": "3", "Sleep Quality": "3", "Rooms": "2", "Location": "3"}, "AuthorLocation": "Scotland", "Title": "“Be aware - compact & rather tired”", "Author": "ajbScotland", "ReviewID": "UR64112623", "Content": "This hotel is almost a hostel - good for the younger travellers who are not looking for ANY luxuries and looking for cheap accommodation. The rooms are very small, with no room to 'swing the cat' and you need to be cautious of banging heads/elbows etc. There's no real room to relax in the rooms other than on the bed - and The bath/shower is only suitable for those who are agile - not suitable for the elderly or infirmed. On the plus side the rooms appear to be generally clean although there was a strong tobacco smell throughout the hotel.The staff were helpful - although from our impression that there could be more on duty - esp @ breakfast . If you are looking for something other that a bed then think about somewhere else.", "Date": "May 14, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "5", "Sleep Quality": "5", "Rooms": "3", "Location": "4"}, "AuthorLocation": "manchester", "Title": "“Perfect for a cheap getaway!!!”", "Author": "tourguide_barbie25", "ReviewID": "UR56510310", "Content": "Me and my friends enjoyed a two night stay at this hotel and were more than impressed! After booking the hotel we read all the reviews prior to our trip and were reluctant to stay here! I am just glad we continued with our booking and ignored all the bad remarks! Ok, yes, the rooms are tiny and yes they are bunk beds BUT for a fun, clean place to lay your head at night in a busy city its perfect!! The bathrooms and bed linen were clean (no trash under our bunks whatsoever!) All in all for 5 young, lively girls this hotel was brill!", "Date": "February 19, 2010"}, {"Ratings": {"Service": "2", "Cleanliness": "1", "Overall": "2.0", "Value": "3", "Location": "4", "Rooms": "2"}, "AuthorLocation": "San Diego, California", "Title": "“Not recommended”", "Author": "animated", "ReviewID": "UR52146871", "Content": "The two young guys in the reception desk were friendly when I first checked in. I was surprised that my reservation had been cancelled (not by me) but they sorted this out without a problem. I found it strange when they asked for full payment at check-in. They explained that by paying in advance, people would not leave without paying their bill. I didn't understand this comment until I saw my room, located in a different building around the corner, a \"sister\" hotel they explained. They were not so friendly when I asked for a different room because mine was dingy and it didn't have a closet (the room was the size of a closet) and it didn't have anywhere to hang my coat. They said they would look into giving me a different room the next day because being Saturday they were full. I said ok and went out for the evening, when I returned (around 2am) I was surprised by a bad smell in my room. So I went to the reception and asked for a different room, again, they said they would look into it the next day. I closed the bathroom door and slept over the covers because it all seemed disgusting at this point. In addition to this, the neighbors were loud and rowdy and kept banging on the doors all night - It was a group of young people staying in rooms across the way from each other. First thing in the morning I went to the reception where I checked-in and asked, for the third time, for a different room. The guy was unfriendly and replied \"what do you expect from a two star hotel?\" I said I expect a clean and safe room to sleep and shower. After a while he agreed to give me a different room. This time it was located in the Trianon building, it was a double room and it was clean and I even had a balcony. I was thrilled and very grateful for this! I extended my trip in Amsterdam for two more nights and when I went to the reception to extend my stay, he charged me a higher rate, saying it was \"today's\" rate. So, I ended up staying one extra night and went to the Nova hotel the next day. What a different experience! For 10 or 15 more euro, from the facilities to the service, a much superior experience!!! -- Lesson learned: beware of hotels that ask for full payment in advance, definitely worth spending a bit more for a different place. PS - The wireless internet was broken the whole time of my stay (3 nights)", "Date": "December 30, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Romsey", "Title": "“Great location - much better than expected.”", "Author": "Love-Travel-Picture", "ReviewID": "UR50740959", "Content": "My partner and I got off the tram at the museumplein stop - directly 15 mins from central station and looked around, hoping the hotel wouldnt be too far away - we turned around and we could see it. Literally about 30seconds walk from the tram stop - fantastic. We went to check in and everyone was very nice and helpful. I think we got lucky with our room, but it had a comfy double bed and enough room. The shower room was small but it was as we expected. The breakfast was nice, and generally it was a great place to stay if you are planning on spending a lot of time exploring amsterdam. We thoroughly enjoyed ourselves.", "Date": "December 6, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "3", "Overall": "4.0", "Value": "4", "Location": "5", "Rooms": "3"}, "AuthorLocation": "Salt Lake City, Utah", "Title": "“Great budget hotel”", "Author": "neeneroni", "ReviewID": "UR32516893", "Content": "Great location by the museums and a tram station. There was also a grocery store right across the street that was handy for a quick, cheap bite to eat. The staff was very helpful with a few questions we had. The room was a bit small, but we were expecting that. We had a nice little balcony, too. The walls are a little thin, but our neighbors weren't very loud so it wasn't a problem. The buffet breakfast was nice and had extended hours (7-10am). I would definitely recommend this hotel to someone looking for an inexpensive, no-frills place to stay in Amsterdam.", "Date": "June 17, 2009"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Overall": "2.0", "Value": "3", "Location": "4", "Rooms": "3"}, "AuthorLocation": "Melbourne, Australia", "Title": "“Rather boring”", "Author": "AndyVibes", "ReviewID": "UR29446325", "Content": "The security and location are good but this hostel lacks character and there is no common areas to hang out. It's about as basic as you can get.", "Date": "May 6, 2009"}, {"Ratings": {"Service": "2", "Cleanliness": "1", "Overall": "1.0", "Value": "2", "Location": "4", "Rooms": "1"}, "AuthorLocation": "Worcester, United Kingdom", "Title": "“disgusting filthy wretched smelly - JUST DON'T!”", "Author": "jkiddscot", "ReviewID": "UR25492970", "Content": "Just don't, Just Dont! only a stoned backpacker with a need for a prison cell experience would like this place", "Date": "March 3, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "4", "Location": "3", "Rooms": "2"}, "AuthorLocation": "Leicester", "Title": "“O.K”", "Author": "Daymo91", "ReviewID": "UR25470967", "Content": "This hotel is ideally situated if you wish to explore cultural amsterdam with the museumplein close at hand, there is a tram stop right accross the road which is also good as it's only a few tramstops to centrum. The room was farily basic and it was bunkbeds but this is often the case with a lot of the cheaper hotels in Amsterdam. Found the staff to be polite and helpful especially the oriental chap on reception. If you want to explore cultural asterdam the location is perfect, if it's the hustle and bustle of centrum you wish to experience stay elsewhere. breakfast wasn't bad.", "Date": "March 2, 2009"}, {"Ratings": {"Cleanliness": "2", "Business service (e.g., internet access)": "1", "Check in / front desk": "3", "Overall": "2.0", "Value": "2", "Rooms": "1", "Location": "5"}, "AuthorLocation": "USA", "Title": "“Not So Good”", "Author": "taylorstl", "ReviewID": "UR21392976", "Content": "The room was tiny even for Amsterdam standards. It was not really a hotel as advertised, but more a hostel. The beds were bunked and there was not enough room to un-bunk them so my husband had to sleep on one and I on another. Our room did have a small balcony but the people we traveled with did not. It did have its own bathroom and it was clean except for the nasty carpet that needed to be replaced. The other guest in the hotel were very noisy. We were waken all through the night by banging doors and people yelling. For the money, it was pretty bad. The smallest room I have EVER stayed in. But it was in a great location, in the middle of all the museums and breakfast was good.", "Date": "October 30, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "3", "Check in / front desk": "4", "Overall": "4.0", "Value": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "leeds", "Title": "“very nice julie from leeds”", "Author": "juliekellett0", "ReviewID": "UR20855355", "Content": "i read a lot of reviews about the hotel before we went, and overall it came out ok, we stayed at the hotel for 4 nights and had a brilliant time, i found the rooms very clean, the staff were lovely and could,nt do enough for us, we will defiantly go back to this hotel, i am really particular about cleanliness and it was defiantly clean.", "Date": "October 13, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "2", "Business service (e.g., internet access)": "3", "Check in / front desk": "5", "Overall": "4.0", "Value": "4", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Ann Arbor, Michigan", "Title": "“Good location for the price”", "Author": "eobri", "ReviewID": "UR20547513", "Content": "I really enjoyed my stay at the Trianon hotel. Checkin was a breeze, even though we arrived rather late in the evening. The room was VERY small, but more than sufficient since you don't spend much time in your room in Amsterdam anyway! There was an even smaller bathroom, with a strange stepped tub (watch your step). The room was clean, although certainly not spotless (there were some stains on the carpet). The hotel is rather noisy as well, so if you are looking for a quiet stay you might look elsewhere. I should also note that the stairs are really steep (but I think this is common in Amsterdam). There is a tram stop right across the street, so getting around is no problem. It is located very near the Van Gogh museum and Vondelpark, so it is a bit further from the center. But we were still able to walk to anything we wanted to see without much trouble. They serve a very simple continental breakfast in the morning, which saves a bit of money on food. Overall, I was very satisfied with the experience.", "Date": "October 2, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Business service (e.g., internet access)": "3", "Check in / front desk": "5", "Overall": "3.0", "Value": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Minnesota", "Title": "“Good location, small room”", "Author": "almeister6", "ReviewID": "UR16312361", "Content": "The room was a little smaller than we had expected, but we got what we paid for. We had a room for two, with bunk beds. The staff is friendly and helpful. The Rijksmuseum and Van Gogh museum are a block away and the very useful tram stops less than a block away. The bathroom was clean and new, but exceptionally small. We paid a total of ~170 Euros for a two night stay. I would stay there again but would pay for a bigger room. We booked through http://hotels.hollandbookings.com", "Date": "May 22, 2008"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Northants", "Title": "“Good value hotel in good location”", "Author": "BruceNorthants", "ReviewID": "UR14805303", "Content": "We have just returned from Amsterdam after having a lovely short break in this fantastic city. We spent 3 nights at the Trianon hotel, we was unsure what to expect from this hotel after reading some of the previous reviews/ lack of them. However we were pleasantly suprised, five star it certainly isn't, but it is clean with an adequate bathroom. We had a double troom, it wasn't massive but we didn't spend much time in it , the bed was comfy. Breakfast was being served next door in the restraunt of the concertgebouw (concert hall) while they renovate he hotel's kitchen, but that wasn't a problem there was a good selection of food (continental breakfast) and you could eat as much as like. We found the hotel to be in a nice quiet location a stones throw away from the Van Gough museum and within easy reach of all the other major attractions. The no. 5 tram goes from just up the street right into the centre of Amsterdam however we walked, nowhere is really that far away and we didn't want to miss the beauty of the buildings and canals.", "Date": "April 5, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Business service (e.g., internet access)": "3", "Check in / front desk": "4", "Overall": "4.0", "Value": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Milan, Italy", "Title": "“Good enough!”", "Author": "ferdinando_pucci", "ReviewID": "UR12076262", "Content": "Very nice hotel, comfortable rooms with table and nightstands, clean and new bathroom. The position is good, very close to tram stops. Breakfast was included in the price. You can have double bed. Friendly staff and very quite district.", "Date": "December 30, 2007"}, {"Ratings": {"Overall": "2.0"}, "AuthorLocation": "Calgary, Canada", "Title": "“would have been better in a hostel”", "Author": "LostCanadian", "ReviewID": "UR11125426", "Content": "The rooms are comparable to a hostel - they're tiny, old uncomfortable matress and could smell smoke from the kitchen staff all the up the flights of stairs - even though I was in a non-smoking room. Location is just fine as Amsterdam is so small and easy to get around and the tram stop is at the top of the street. The pictures of the hotel provides are definately making it look better than it is.", "Date": "November 28, 2007"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Check in / front desk": "4", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "manchester", "Title": "“fantastic value”", "Author": "tarlet0n", "ReviewID": "UR8591685", "Content": "Fantastic value for the price, great location for van gogh museum etc. Our room had view of the concertfebouw (gorgeous building). All the staff were friendly and helpful. The rooms aren't huge but are clean and for the price and 2* what more do you want.", "Date": "August 31, 2007"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Check in / front desk": "2", "Overall": "2.0", "Value": "2", "Rooms": "1", "Location": "3"}, "AuthorLocation": "Cardiff", "Title": "“Ooh dear...”", "Author": "trickynic", "ReviewID": "UR7639686", "Content": "My husband and I stayed here in Feb 07 for 3 nights. It is very easy to find as the tram stops just outside. It took about 20 minutes by tram to get to the centre. Situated in the museum quarter and, unless you like museums!, not much to do in the immediate area but Leidseplein is about a 3 minute tram ride and we absolutely loved it there! Now, on to the hotel itself. The rooms are absolutely TINY! And with the bare painted walls, it is just like a prison cell. The bathroom is even funnier - just enough room for a toilet and a half size bath, with the sink squashed in at the end of your bed. Also, we experienced a lot of noise from the people in the room above so not much sleep. The breakfast room, on the other hand is very nice as it also serves as a restaurant in the evenings. Traditional European continental breakfast is served. Quite a lot of choice. I would say - if you are looking for a room on a budget and don't intend to spend much time at the hotel (like us!) then this place is fine. Don't expect any luxury - just a place to rest your head after a long day.", "Date": "May 18, 2007"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Business service (e.g., internet access)": "1", "Check in / front desk": "1", "Overall": "1.0", "Value": "1", "Rooms": "1", "Location": "2"}, "AuthorLocation": "Trondheim", "Title": "“Stay away from Trianon.”", "Author": "Lucky84", "ReviewID": "UR7225005", "Content": "The rooms are terribly small, there is absolutely no silencing between the rooms, i found trash under my bed, there is mould in the bathroom, you won't find any hospitality in the reception. Didn't see a smile on their faces at all. Choose another hotel!", "Date": "March 26, 2007"}, {"Ratings": {"Service": "3", "Cleanliness": "1", "Business service (e.g., internet access)": "3", "Check in / front desk": "3", "Overall": "1.0", "Value": "1", "Rooms": "1", "Location": "4"}, "AuthorLocation": "LLANELLI, WALES", "Title": "“Not Recommended”", "Author": "INKYMINKY", "ReviewID": "UR6813788", "Content": "I will start with the positives. In a good location , near Van Gogh gallery, walking distance to the centre and on tram route 5 direct to the railway station. Staff were friendly. But.....on the downside, it was a very poor hotel. When shown to my room, I opened the door, my immediate thought was \"Why has someone left that tatty little bed in this small corridor\", then I realised it was my room! Rooms were small smelly and had damp patches, they were furnished with very old carpets, curtains and furniture. The walls had not seen paint in many years and were very \"yellow\". I had requested a non smoking room, my room stunk of smoke. The bathroom was basically ok with plenty of hot water, but had a permanent stale urine smell. Also greeting me in my room was a dirty glass starting to go mouldy. The plumbing was very noisy , keeping me awake till 2/3a.m. , then I was woken up again around 5a.m. by roudy revellers returning from a night out. Breakfast was ok if you were there early, but if you went down after 8.30, all the good stuff (eggs,ham,cheese) was gone, and was not replenished by the staff. So twice I had to settle for bread and jam. Also some free services promised such as satellite tv and use of a safe were either pay extra or non existant. Overall shockingly poor. Only go to this hotel if there is absolutely no other option.", "Date": "February 19, 2007"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Check in / front desk": "4", "Overall": "3.0", "Value": "3", "Rooms": "2", "Location": "4"}, "AuthorLocation": "rugby", "Title": "“Better than expected”", "Author": "loiterer", "ReviewID": "UR6168980", "Content": "We booked this hotel, then I read the reviews and would have cancelled except it was too short notice, however we were pleasantly surprised when we stayed there. Quiet location but tram stop to Central station at end of road. Not many restaurants etc very near but Leidseplein only two tram stops away with plenty of choice. Staff friendly and helpful but it was November so out of season and they may be less helpful when busy Rooms are small and carpets shabby but bathrooms are good. Rooms and bathrooms are clean and warm with plenty of hot water, linens and towels are spotless Breakfast was very good for continent There is a lift, not always the case in Amsterdam Altogether our stay was better than expected, however do take a universal sink plug and watch out for mosquitoes, even in November Guide books do say generally hotel rooms in Amsterdam are small and smelling of damp and mildew is a problem there", "Date": "November 23, 2006"}, {"Ratings": {"Cleanliness": "2", "Overall": "2.0", "Value": "2", "Service": "1", "Rooms": "1"}, "AuthorLocation": "Fishguard Wales", "Title": "“Smallest Room Ever”", "Author": "tige1968", "ReviewID": "UR5451681", "Content": "Our stay in Amsterdam was the last week in June, upon arrival at the hotel we were dealt with a chap who was dressed in combat gear, he was rude and I nearly gave him a mouthful back. The room was the smallest Ive ever stayed in, but apart from that the room was clean and as the weather was boiling i was hardly there only to sleep and have breakfast (which was ok),. I had no real problems with this place, however, I will not stay there again", "Date": "July 11, 2006"}, {"Ratings": {"Cleanliness": "1", "Overall": "1.0", "Value": "1", "Service": "1", "Rooms": "1"}, "AuthorLocation": "Chico, CA", "Title": "“A True Pit”", "Author": "A TripAdvisor Member", "ReviewID": "UR5432283", "Content": "My husband and I booked Hotel Trianon through an online service and were looking forward to it's great location as we only had one full day to enjoy Amsterdam. It was the worst hotel I've ever been to, starting with the desk clerk who was rude and barely spoke English and the elevator which couldn't hold both of us and our small suitcases, to the urine stenched hallways and black mold on the window frames. It was so bad in fact that after checking in we braved the torrential rains outside to go find a new hotel so that we could move. I literally don't think we'd have been able to spend a night there, just upon entering the room both my husband and I became so congested from the mold and mildew we coudl hardly breathe. It was well worth the extra few dollars to get a good nights sleep somewhere/anywhere else.", "Date": "July 6, 2006"}, {"Ratings": {"Cleanliness": "2", "Overall": "1.0", "Value": "1", "Service": "2", "Rooms": "1"}, "AuthorLocation": "Rhuddlan - UK", "Title": "“Avoid”", "Author": "A TripAdvisor Member", "ReviewID": "UR5393939", "Content": "We went to Amsterdam this June and were unfortunate enough to stay at the Trianon Hotel. We came as a business management group of 8 for a Teambuilding weekend. The hotel was listed as having a safe in every room but not one of us had one, as a result we all had to carry our passports and euro's around with us all the time as the room was not very secure. (Another member of our party was even given the key to another guests room). The rooms had no Air Conditioning, no Tea and Coffee making facilities, and were so small you had to put your case infront of the bed and wardrobe so couldn't use the wardrobe easily, it was more like a corridor than a room. The bathroom was so minute that we had the sink in the bedroom with us which had the tap dripping constantly. Carpets were old, smelly and had remnants of the previous occupants hair in amongst other things. There was no bar open as advertised, the only bar was a mini fridge in the reception full of tinned Lager. Breakfast was just okay, but the reception staff during the day weren't very helpful and seemed irritated if asked for assistance with Airport transport. We ended up dragging our cases around the block to another hotel and asked them to arrange our transport back to the airport which was done in minutes, free of charge. We couldn't wait to get home to our much cleaner environment, clean streets, clean people and clean beds. It's Great to be back in the UK.", "Date": "June 27, 2006"}, {"Ratings": {"Cleanliness": "1", "Overall": "1.0", "Value": "1", "Service": "1", "Rooms": "1"}, "AuthorLocation": "Rhyl, Wales.", "Title": "“Disaster”", "Author": "A TripAdvisor Member", "ReviewID": "UR5383346", "Content": "Eight of us stayed here and all of us are of the same opinion. This should be classed as a hostel, not a hotel. The room was minute to say the least, the bathroom was so small that the sink had to go in the bedroom, (which by the way was more like a corridor), next to the bed. No tea and coffee making facilities, no air con & no safe in the room, the tap water was drinkable but warm, the room smelt of urine and you most likely won't be able to open your window, infact once out of reception, the whole hotel had a strange odour. The website also says there is a bar, this consists of a mini fridge in reception selling only Heineken in tins. Breakfast was just okay, stick to toast and rolls with jam. The staff were curt, unwelcoming and bad mannered, only the cleaners said hello each day. Infact we got this reaction wherever we went in Amsterdam, only a minority of Dutch people were friendly towards us. The town (red light district Central) was miles away on a tram, ensure you have a ticket or you will be publically humiliated by the inspectors. You buy them off the driver, oh and make sure you always look both ways when crossing the road. Don't leave valuables in your room either, they will give your room key to anybody. We were a mature party of eight adults, this hotel would be more suited as a HOSTEL for the Amsterdam under privilaged. Whatever you do, don't waste your money here, the Dutch hotel ratings are not to the quality of the UK. We all hope that once you change your booking to an alternative, more suitable hotel, that you will have a better experience than we all did.", "Date": "June 26, 2006"}, {"Ratings": {"Cleanliness": "3", "Overall": "3.0", "Value": "3", "Service": "3", "Rooms": "3"}, "AuthorLocation": "West Yorkshire", "Title": "“You get what you pay for”", "Author": "A TripAdvisor Member", "ReviewID": "UR5031878", "Content": "We spent 3 nights at the Trianon Hotel over Queen's Day 2006 weekend and this hotel was one of very few that had availability and didn't cost the earth. But after reading the reviews on this site, I was tempted to cancel the whole trip as I was expecting a rotten dirty hell-hole. However, we decided to go anyway and I'm so glad as we had a fantastic time and the hotel is nowhere near as bad as some of the reviews that I read. We booked a twin and a triple room and although the twin room was really small, it was clean and had everything we needed. We didn't spend that much time at the hotel as we were out and about all day so the lack of space really was not an issue. The triple room was a lot more roomy so would definitely recommend the triple if you are staying for more than a week or if you like to spend a lot of time in your hotel room. The Trianon offers cheap accomodation in a clean basic hotel within walking distance of all the attractions that Amsterdam has to offer. We didn't use the trams but there is a tram stop literally a few minutes away if you don't fancy walking everywhere. It is in the quieter area of Amsterdam near to Vondelpark and all the museums but there are plenty of shops and restaurants close by. If you are looking to go to Amsterdam and want to stay somewhere in a central location, is clean and on a budget, then I would definitely recommend the Trianon.", "Date": "May 3, 2006"}, {"Ratings": {"Cleanliness": "1", "Overall": "1.0", "Value": "1", "Service": "1", "Rooms": "1"}, "AuthorLocation": "Liverpool", "Title": "“ABSOLUTE RUBBISH”", "Author": "A TripAdvisor Member", "ReviewID": "UR4255840", "Content": "The title of my piece says it all!! Quite simply the worst hotel i have ever stayed in. The bathroom was absolutely decrepid.The shower curtain was torn,full of mildew and smelt! My wife refused to use it for the whole of our stay.(2 nights) I agree regarding the temperature as although it was the coldest weekend of the year to date the hotel resembled a sauna!!", "Date": "December 22, 2005"}, {"Ratings": {"Overall": "3.0"}, "AuthorLocation": "Manchester", "Title": "“Recently stayed at Trianon”", "Author": "soniasvs", "ReviewID": "UR4075359", "Content": "Just stayed at the Trianon Hotel in Amsterdam. This was a basic hotel but clean. It was cleaned every day we stayed and beds remade. Breakfast was of a good standard for a continental breakfast and plenty there to choose from. I personally found that it was in a good location for getting around amsterdam - close to canal bus, tram and in walking distance of some museums. I enjoyed my stay here and enjoyed wandering to the leidersplein area as I much preferred this square to the Dam square itself as it wasn't as busy but had lots of street entertainers on and fab cafes.", "Date": "October 31, 2005"}, {"Ratings": {"Cleanliness": "2", "Overall": "1.0", "Value": "1", "Service": "2", "Rooms": "1"}, "AuthorLocation": "Brazil", "Title": "“Awful”", "Author": "A TripAdvisor Member", "ReviewID": "UR4018513", "Content": "We stayed in the hotel for 2 nights last September. The room was the smallest we have ever seen. It was almost impossible to fit our 2 small luggages inside the room. The bathroom was very small and disgusting. The TV was very old and with no remote control. Moreover, the hotel room and the corridors were very hot. There was almost no ventilation. It was the most expensive hotel per square meter we have ever stayed, since we payed a rate compatible to a good hotel chain anywhere in the world. Please do not go to this hotel. The price is not fair to what it is offered. We accept to stay in any clean and simple hotel but the Trianon is not enough considering the minimum necessary for a hotel room. Since Amsterdam is a great city, the great time we had there compensated this terrible hotel.", "Date": "October 12, 2005"}], "HotelInfo": {"Name": "Trianon Hotel", "HotelURL": "/ShowUserReviews-g188590-d239017-Reviews-Trianon_Hotel-Amsterdam_Noord_Holland.html", "Price": "$32 - $236*", "Address": "<address class=\"addressReset\"><span rel=\"v:address\"><span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">Jan Willem Brouwersstraat 3-7</span>, <span class=\"locality\"><span property=\"v:locality\">Amsterdam</span> <span property=\"v:postal-code\">1071 LH</span></span>, <span class=\"country-name\" property=\"v:country-name\">The Netherlands</span> </span></span></address>", "HotelID": "239017", "ImgURL": "http://media-cdn.tripadvisor.com/media/ProviderThumbnails/dirs/b6/e2/b6e26b793a6fc4b12cde188bd5a0f1d44large.jpg"}}