{"Reviews": [{"Content": "Enjoyed Hotel Anna's I spent 4 nights at Hotel Anna's and really enjoyed it. Claudio, Loretta and Matteo provided excellent customer service and were always ready to be of assistance. The rooms were large enough, very clean and safe. My single room was at the back and I found it very quiet as well. It is only about a 10 minute walk to the very centre. The hotel has some stairs to reach it so this should be taken into account.Breakfast was worth the extra 5 Euros in my opinion. The hotel was more modern then I had thought it would be and the price is very reasonable, especially for Florence. All in all I rate the professionalism of the staff highly and would not hesitate to stay again or recommend Hotel Annas to others.", "Date": "Nov 18, 2008", "ReviewID": "UR849343772", "Ratings": {"Service": "5", "Business service": "4", "Cleanliness": "5", "Check in / front desk": "4", "Overall": "4", "Value": "4", "Rooms": "4", "Location": "4"}, "Author": "Attilla64"}, {"Content": "Very Professional       View out the balcony", "Date": "Jul 14, 2008", "ReviewID": "UR160659488", "Ratings": {"Service": "5", "Business service": "3", "Cleanliness": "4", "Check in / front desk": "5", "Overall": "5", "Value": "4", "Rooms": "4", "Location": "4"}, "Author": "DestinationUnk"}, {"Content": "Loved Hotel Anna's Anna's is a wonderful family-run small hotel. The owners were ridiculously helpful, with the father helping me book a hotel in Rome, and the mother pulling out the phonebook to get addresses of stores I wanted to visit, and then marking them on the map for me.Breakfast was worth the extra 5E also. I would happily stay there again.", "Date": "May 18, 2008", "ReviewID": "UR491781654", "Ratings": {"Service": "5", "Business service": "4", "Cleanliness": "5", "Check in / front desk": "3", "Overall": "5", "Value": "5", "Rooms": "4", "Location": "4"}, "Author": "lkto"}, {"Content": "Loved Anna's I can't say enough about this place. My room was was great, the staff was helpful and friendly (and accomodating) and the price was very reasonable. Only two warnings: 1. The hotel is on the 2nd floor - which is the third floor to Americans (like me) who think of the 1st floor being the ground floor - and there is no lift. 2. Although the rooms have been renovated, I only had a sink and shower in my room - the toilet was in a shared bathroom down the hall. Believe it or not, though, everything else made up for these minor inconveniences a hundred times over. Very satisfied and will return!Solotripper66[--]", "Date": "Dec 6, 2007", "ReviewID": "UR275758908", "Ratings": {"Service": "5", "Business service": "-1", "Cleanliness": "5", "Check in / front desk": "4", "Overall": "5", "Value": "5", "Rooms": "4", "Location": "4"}, "Author": "SoloTripper66"}, {"Content": "Top in its class, exceptional hospitality Stayed in Hotel Anna's in September 2007 for 3 nights. It is on the third floor of an old building where all other floors are also occupied by pansions. Anna's is by far the best of them. It has been very recently renovated and the rooms are not only sparkling clean but even somewhat stylish. Neither the street nor the building nor the staircase look particularly attractive, to put it mildly, but once you get to the third floor, you are in modern, nice surroundings. Most (but not all!) rooms have private wc and shower. All have a/c. Obviously this is not a luxury place, but I think it easily deserves 3 stars. The location is quite central, relatively close to the main attractions (about 15-20 minutes walk). Another outstanding feature of our stay was exceptional hospitality of the owners. The owner helped us with all the bookings and tours, let us use his parking bay overnight, and even made detailed recommendations for a beach stay on the coast. However most impressive was his assistance with our Vatican booking. All guidebooks say that it is not possible to book anything in the Vatican, you have to stand in the line for hours. However this guy went on the internet and after some time (maybe 1 hour) found a travel firm that organises bookings. They do this by joining people into groups, and groups can make a booking... Of course the group only existed until after we've passed the ticket controls... The owners made us feel at home in many other ways. I would say I have never before experienced such hospitality from strangers.", "Date": "Nov 23, 2007", "ReviewID": "UR626634897", "Ratings": {"Service": "5", "Business service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5", "Value": "4", "Rooms": "5", "Location": "3"}, "Author": "BG_perth"}, {"Content": "Friendly helpful staff Hotel Anna's was quaint, clean. The rooms were good size. The staff was very helpful and friendly. It is older but very well kept.", "Date": "Oct 31, 2007", "ReviewID": "UR327932399", "Ratings": {"Service": "4", "Business service": "-1", "Cleanliness": "4", "Check in / front desk": "4", "Overall": "4", "Value": "4", "Rooms": "4", "Location": "5"}, "Author": "sfg569"}, {"Content": "La premi猫re impression...   showReview(20188517, 'full');", "Date": "Aug 31, 2008", "ReviewID": "UR715873477", "Ratings": {"Service": "5", "Business service": "-1", "Cleanliness": "5", "Check in / front desk": "-1", "Overall": "4", "Value": "5", "Rooms": "5", "Location": "-1"}, "Author": "lass="}], "HotelInfo": {"HotelURL": "http://www.tripadvisor.com/ShowUserReviews-g187895-d239394-r21988971-Hotel_Anna_s-Florence_Tuscany.html", "HotelID": "239394", "Price": "$143"}}