{"Reviews": [{"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Location": "5", "Rooms": "1"}, "AuthorLocation": "Lancashire", "Title": "“Kabul Amsterdam or Kabul Afghanistan ??? You Decide”", "Author": "King-Among-Men", "ReviewID": "UR32061392", "Content": "After departing the countryside of Lancashire, we arrived at our first stop, Amsterdam in our Quest to follow ENGLAND in the world cup 2006. Many other budding followers were also in the dam, making accomodation scarce to say the least. After trawling tourist information, we stumbled upon ''HOTEL KABUL'', which supprisingly enough, had vacaincies. All six of us hurried ahead and entered THE KABUL. We were met at reception by two shifty looking turkish men, who neither raised a smile or an eyebrow to greet us. We was then told it was 35 euros each for a night stay, but we immediately accepted, pleased that we had a roof over our heads for the night. As we were led to our shared 8-man room, we noticed what could only be described as large pockets of bullet holes in the walls. Upon realising we had our pants trulley pulled down with a 35 euro cost, we dumped our bags (after taking out valuables), and got ready to hit the city life. We shared the room with to american wanderers who on our arrival, were combing the beds for bedbugs. We decided our only option was to get blind drunk in order to block out the horrific surroundings/decor. When i awoke, after a heavy night, i was unsure of my bearings and half expected to see Gary Glitter, as it was reminisent of a cambodian prison!!! I would therefoe NOT reccomend anyone to endure a night of pure punishment and the hands of the KABUL staff.", "Date": "June 10, 2009"}, {"Ratings": {"Service": "2", "Cleanliness": "1", "Overall": "1.0", "Value": "2", "Location": "3", "Rooms": "1"}, "AuthorLocation": "Brooklyn, NY", "Title": "“Scary!”", "Author": "CarpeNoctum_23", "ReviewID": "UR30812585", "Content": "My friend and I went on a little weekend budget trip to Amsterdam and decided to stay at Kabul as a way to save money. Well, we shouldn't have bothered. It was dirty, smelly and oh so scary! We checked in and left our bags in the room (shared with another 6 people), went to walk around and once we came back to the room, our bags were gone. We went downstairs and turned out that someone brought our bags to the reception. Why? Don't know, but we went back to the room with our bags and some crazy old man that we were sharing the room with started screaming at us. Went back down to reception in an attempt to be moved to another room...nope! Tried to get our money back...nope! So we just took a train to the airport and got one of the hotel rooms there for a little more money but at least we had the knowledge that we were safe!", "Date": "May 26, 2009"}, {"Ratings": {"Service": "1", "Cleanliness": "2", "Business service (e.g., internet access)": "3", "Check in / front desk": "1", "Overall": "2.0", "Value": "2", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Brooklyn, New York", "Title": "“OK Physically, Insane Staff”", "Author": "emilydickinson", "ReviewID": "UR20315787", "Content": "If you are in Amsterdam to see the seedy sights, location wise it's hard to beat the Kabul. This place was actually about average on the cleanliness scale for a hostel. The carpets are stained, and it's a bit dingy, but it is located dead center in the Red Light, so I wasn't expecting posh accommodations. The bathrooms were sanitary and serviceable, and while the blankets and sheets were worn they had been washed recently. I've honestly stayed in much, much filthier hostels and you have a decent view of the canals in the room we stayed in, which was one of the large 8 bed rooms. My real problem was with the staff. We stayed here 5 days, and on the morning of the second day we were out the door pretty early. In the lobby, one of the clerks and an Italian woman (looked to be a teenager) were screaming and fighting with each other. I have no idea what they were fighting about, but the clerk kicked this woman in the chest and sent her sprawling onto the ground where she could hardly breathe. I'm sure being a hotel clerk in this part of Amsterdam can be trying, but I've never seen anyone just make the jump from an argument to physical violence in a business setting like that. It definitely scared us, and had we not foolishly paid in advance, we would have left and found somewhere else to stay.", "Date": "September 23, 2008"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Business service (e.g., internet access)": "1", "Check in / front desk": "2", "Overall": "2.0", "Value": "2", "Rooms": "1", "Location": "3"}, "AuthorLocation": "WrocÅ‚aw", "Title": "“If you got choise go somewhere else”", "Author": "chlondziu", "ReviewID": "UR14933239", "Content": "When I arrived with my friend to this [--] hostel 2 girls from Argentina were accommodated. they were very friendly and very helpful and that will be all good thinks with this hostel. Hostel is DIRTY(dirty sheets, no closets,), STINKY, and expensive I pay 25 euro for one night (thank goodness it was only one night!!) in the 16 Bed Dorm. I you got choise go somewhere else !!! I RECOMMEND \"SHELTER HOSTEL\" (clean, good breakfast, friendly staff) very nice hostel near red district. www.shelter.nl.", "Date": "April 10, 2008"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "Here", "Title": "“Best Hostel EVer!”", "Author": "SirHawc", "ReviewID": "UR5783503", "Content": "Nice and cheap. A very nice room, and the coffee is like liquid speed. cant beat it!", "Date": "September 9, 2006"}, {"Ratings": {"Cleanliness": "1", "Overall": "1.0", "Value": "1", "Service": "1", "Rooms": "1"}, "AuthorLocation": "Ulm", "Title": "“Additional Commentary to the previous ones”", "Author": "A TripAdvisor Member", "ReviewID": "UR3913705", "Content": "I just returned today from Amsterdan. I agree 100% with the comments above and still have one cherry to put on the top of all that: my digital camera and mp3 player which were inside my bag which was inside the lockers was stolen by one of my roomates. It is not a big surprise something like that happening considering that a considerable amount of junkies are among the clients.", "Date": "September 18, 2005"}, {"Ratings": {"Cleanliness": "3", "Overall": "3.0", "Value": "3", "Service": "2", "Rooms": "2"}, "AuthorLocation": "penzance", "Title": "“What a bunch of moaners!”", "Author": "shagmoley", "ReviewID": "UR3751168", "Content": "Come on,you get what you pay for.I've stayed here numerous times and although the place may not be the ritz,it's an adventure in it's own right! It's location is good for the cafes and if the red light is just around the corner if you fancy a shag!Unless the place collapses into the canal(which is probable)I shall be returning.JW", "Date": "August 10, 2005"}, {"Ratings": {"Overall": "2.0"}, "AuthorLocation": "South West England", "Title": "“Hey, this place isn't so bad!”", "Author": "A TripAdvisor Member", "ReviewID": "UR3734559", "Content": "I spent a week in Poland in what I felt was an excellent hostel. I came to Kabul in Amsterdam expecting the same but boy was I suprised. It stank, the staff weren't friendly and there were strange insects around. But my roommates were cool and we were allowed to smoke bongs in our room and drink beer. It's so close as well to all the nightlife and the train station. If you want a clean room with excellent service then don't go there. But if you pick up gear from a coffee shop and want to smoke it in your room then go to Kabul. Well dodgy place, but I liked my roommates, especially a Finnish guy & Japanese guy who liked their smoke. A good night. You wouln't be able to do that in another Dam hostel. But watch out for the bugs. Well skanking.", "Date": "August 3, 2005"}, {"Ratings": {"Cleanliness": "1", "Overall": "1.0", "Value": "1", "Service": "1", "Rooms": "1"}, "AuthorLocation": "Derby, Forafite", "Title": "“Pigeon Graveyard”", "Author": "A TripAdvisor Member", "ReviewID": "UR3445368", "Content": "Do you like pigeons? Does the overpowering aroma of urine set your heart racing? Does the prospect of housing nightly insect feasts on your own flesh fill you with joy? Perhaps sleeping in sauna temperatures whilst fearing for the health consequences of daring to open a window is more your style? Or maybe you just like to be woken by the delightful and unique screechings of the local pigeon turf wars? Is having incompetent and unfriendly staff a real turn on? If some or all of these enticing propositions form your Amsterdam accomadation checklist, and providing you have the relevent outdoor persuits qualifications necessary to scale the stairs, then the aptly-named \"Hotel\" Kabul your ideal Dutch experience. On arriving in Amsterdam we were turned away from our intended accomadation and instead were put up in the smaller less enticing surroundings of Hotel Kabul. However, the similarities with the nativity tale did not end there, as we were amazed to discover the range of wildlife that greeted us in the stable-like conditions of Kabul. Our view overlooking the courtyard of rotting Pigeon corpses was particularly striking, though the impression this left on us was perhaps less tangible than that left by the insects who relentlessly chewed their way through our party during our stay. We were especially perplexed by the dilema posed to us by the intense heat of our room. With the only window opening directly onto \"pigeon yard\" we were faced with a grim choice that ended in a combination of both foul smelling odours and heavy sweating as we attempted to strike an impossible balance. Whilst the pigeons revelled in their lively role of waking us at sunrise, the Hotel staff were somewhat less spirited and provided a sullen, dull, and unhelpful attitude that was entirely inkeeping with the general ambience of Kabul (city and hotel). The fact that i am not discussing at length the shortcomings of the decoration, the furnishings, security, the food, the stairs, the general hygene, and the toilet and shower facilities is reflective of the more concerning challenges provided during a stay at Hotel Kabul. Kabul is not a hotel to be taken lightly and guests should be aware of the battles that will await them upon arrival. Kabul by name, Kabul by nature, just don't bother...", "Date": "May 6, 2005"}, {"Ratings": {"Overall": "1.0"}, "AuthorLocation": "slovakia", "Title": "“hell on earth”", "Author": "A TripAdvisor Member", "ReviewID": "UR2859868", "Content": "Hell on earth, filthy dirty disgusting...... anyway great location, coffeeshop 36 strongly recommended.", "Date": "December 2, 2004"}, {"Ratings": {"Cleanliness": "2", "Overall": "1.0", "Value": "1", "Service": "3", "Rooms": "1"}, "AuthorLocation": "brussels", "Title": "“Kabul is a no-go”", "Author": "eylonwy", "ReviewID": "UR2813847", "Content": "The other reviews are dead on- too bad I didn't read them before I booked! A friend and I popped over to Amsterdam from London for a weekend trip, and like the poor students that we are, we looked for somewhere cheap to stay. The Hostel Kabul seemed like a gamble when we booked online, but we didn't think it'd be such a flop house. Pay a little more and stay someplace a LOT nicer. Unless you like bad smells, dirty bathrooms, and an overall feeling of creepy filth. (One positive thing- the location is great for getting to Centraal Station)", "Date": "November 9, 2004"}, {"Ratings": {"Cleanliness": "1", "Overall": "1.0", "Value": "1", "Service": "1", "Rooms": "1"}, "AuthorLocation": "Belgium", "Title": "“Even Bin Laden wouldn't have stayed there for a minute!!!”", "Author": "A TripAdvisor Member", "ReviewID": "UR2695600", "Content": "This is with no doubt the worse place I ever stayed in.. Dirty, Stinky, and expensive.. we paid 115 euro for a triple bedroom (if room is the exact word for this **** hole) actualy we were 20 if you count the mice and bugs.. no warm water and dirty sheets, no closets, just 2 matrasses where we slept with our clothes on so we won't catch cholera or ebola.. Seriously, if someday this place is your only chance spending the night in Amsterdam, you better turn back home or go to Kabul in Afghanistan.. I'm sure you'll save yourself a lot of health..", "Date": "October 11, 2004"}, {"Ratings": {"Overall": "1.0"}, "AuthorLocation": "London", "Title": "“This place is a hazard”", "Author": "A TripAdvisor Member", "ReviewID": "UR2125667", "Content": "I stayed there May 2004. The walls of the building were supported by metal make shift poles. The room was a disgrace with no toilet or bathroom eventhough we paid 100EU a night for a double bedroom. The view of the canal made the experience bareable but even that was ruined in the early hours of Sunday morning when a drugs addict from the next door room was screaming through the night and then jumped through the window. I guess I will remember my stay there forever for all the wrong reasons.", "Date": "May 28, 2004"}, {"Ratings": {"Overall": "1.0"}, "AuthorLocation": "London, UK", "Title": "“Seriously a hell!!!”", "Author": "A TripAdvisor Member", "ReviewID": "UR1784761", "Content": "Amazed how this place can be called \"HOTEL\"!Staying there was worse than terrible!!! Mice attacking our food and coakroaches in the showers - just unbelievable! Find another place to stay and try not to pass by..", "Date": "April 14, 2004"}, {"Ratings": {"Overall": "1.0"}, "AuthorLocation": "Camden, London, UK.", "Title": "“Not fit for Animals!!!!”", "Author": "A TripAdvisor Member", "ReviewID": "UR1711702", "Content": "!!!!!!!!!!!!!!!!!! DO NOT STAY HERE!!!!!!!!!!!!!!!!!!!!! This place really is worse than spending a night on the streets, honest.... please spend your Euros elsewhere, the Hans Brinker Hostel for example is classy in comparison. Forget this Hostels location and the view from the canal facing rooms, you would be better staying miles away and looking out at a brick wall! This Hostel scares me, how do the owners manage to keep this place open? Horrible dirty rooms, never touched, sticky pattern carpet which was red now thick black. Windows only washed by rain (both sides). Pigeons!! Bunk beds are cheep old nasty metal affairs that are well past it, with thin soiled and knackered matresses. Roof leaks which caused water to run down the light fitting onto a bunk! I'm not writing anymore as I am trying to forget!! If this is the last place to stay in Amsterdam just don't... go to the 'VVV' at Central Station and book accomodation a bus or train ride away and try again the next morning. The Prins Hendrik is cheap, breakfast is fine, and will not ruin your trip to The Dam.", "Date": "March 7, 2004"}, {"Ratings": {"Overall": "3.0"}, "AuthorLocation": "La CA", "Title": "“charm and alot of dirt”", "Author": "A TripAdvisor Member", "ReviewID": "UR1663314", "Content": "if you want a real Dutch Amsterdam experience try reserving room #28 (or 29?) facing the canal. it is the best room they have. The disco from Bar 36 will keep you up all night, but for some strange reason there is something charming about this room. Ya they don't clean your room until you leave, you have to search for towels somewhere in the hotel. Cats come visiting and dissapear out windows, the toilet flushes onto your feet and you are standing in the shower. Still it has a great window to feed the birds your morning breakfast which consists of 2 stale pieces of bread, a nasty hardboiled egg and other meat slices I dare anyone to try. The seagulls love it, and obviously they know it's coming from the kabul. my girlfriend says never again, but I still loved it. I don't know why.", "Date": "February 21, 2004"}, {"Ratings": {"Overall": "1.0"}, "AuthorLocation": "City, State", "Title": "“Never again...”", "Author": "A TripAdvisor Member", "ReviewID": "UR1262161", "Content": "If there was a '0' rating, this hole would have got it. And deservedly so. Only after we had booked for 3 nights in the place did it click that this place was called 'The Hotel Kabul'. I would put money on it that there are piles of brick in the Iraqi capital more pleasantly furnished than this slum. Apart from being very close to our most regular haunt (The Grasshopper), I don't really have any further positives to comment upon. The stairs are incredibly steep (not the easiest of challenges after 10 hours in the coffee shops) and our window was propped open with a rotting plank which we daren't remove through fear of structural collapse. This allowed swarms of mosquitos to freely enter the room and gorge on our polluted bloodstreams. They almost certainly had a better time than us, and at our expense. Note to self: Next time, sort the accomodation out well in advance and avoid places with names associated with current world conflicts.", "Date": "August 27, 2003"}, {"Ratings": {"Overall": "1.0"}, "AuthorLocation": "Manchester, UK", "Title": "“stinks and has mice - health hazard”", "Author": "A TripAdvisor Member", "ReviewID": "UR1190125", "Content": "I got a single room here, and regretted it. The room stank like a mixture of vomit and piss, wet patches on the carpet and walls. Made me feel sick just breathing there. I'm truly not a fussy person, and always thought I had a very weak sense of smell. The window wouldn't even open, so no escape from the smell. So tired I slept there for a couple of hours in the afternoon (with a cloth over my face). Woke up to find a mouse crawling over my leg. Asked for another room, none available, so asked for a refund. The receptionist laughed at me, saying I was scared of mice, she seemed unaware that they **** and piss all over, and can nibble on your belongings. Totally disgusting. They refused to give me a refund, saying that I should have said something earlier, maybe they should have a big sign saying that the Hotel Kabul is infested with vermin!", "Date": "August 4, 2003"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "", "Title": "“The Boom Ting!!!”", "Author": "A TripAdvisor Member", "ReviewID": "UR1134163", "Content": "Get mashed go back and get mashed up even more innit! quality place!! - peace", "Date": "July 10, 2003"}, {"Ratings": {"Overall": "1.0"}, "AuthorLocation": "Tempe, AZ", "Title": "“God-awful!”", "Author": "A TripAdvisor Member", "ReviewID": "UR926430", "Content": "This place smelled like someone tipped over a portable toliet in the lobby. There was a cat eating trash on the ground in the common room. It's funny now.....", "Date": "March 30, 2003"}, {"Ratings": {"Overall": "1.0"}, "AuthorLocation": "", "Title": "“Hell On Earth!!!!!”", "Author": "A TripAdvisor Member", "ReviewID": "UR835949", "Content": "Three days in what could only be described as 'Hell On Earth' was certainly a sheer test of ones indurance. Sharing beds with mites and listening to thumping 24hr disco music from the club underneath as well as tackling robbers who break into your room whilst you are asleep is pretty scary ----!!!! But cheap as hell.", "Date": "January 11, 2003"}], "HotelInfo": {"Name": "Young Budget Hotel Kabul", "HotelURL": "/ShowUserReviews-g188590-d239469-Reviews-Young_Budget_Hotel_Kabul-Amsterdam_Noord_Holland.html", "Price": "$67*", "Address": "<address class=\"addressReset\"><span rel=\"v:address\"><span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">Warmoesstraat 38-42</span> | <span class=\"extended-address\">Old Centre: Red Light District</span>, <span class=\"locality\"><span property=\"v:locality\">Amsterdam</span> <span property=\"v:postal-code\">1012</span></span>, <span class=\"country-name\" property=\"v:country-name\">The Netherlands</span> </span></span></address>", "HotelID": "239469", "ImgURL": "http://media-cdn.tripadvisor.com/media/photo-s/01/0b/58/d0/habitacion.jpg"}}