{"Reviews": [{"Content": "more than beautiful Spent five nights in this very nice place in april. It was all I needed; central location, wonderful antique atmosphere, friendly staff willing to help, clean and peaceful room and a shared bathroom(I was worried about that before I went but there was really no need to). I would advise the place to anyone and would for sure stay there during my next trip.", "Date": "May 22, 2008", "ReviewID": "UR717489445", "Ratings": {"Service": "4", "Business service": "-1", "Cleanliness": "4", "Check in / front desk": "4", "Overall": "4", "Value": "4", "Rooms": "4", "Location": "4"}, "Author": "klepsidra"}, {"Content": "A week in Florence We stayed for 5 nights.Good location (some great restaurants nearby) and close to the sightseeing things.Very clean and comfortable.Negatives were the size of the hot water...with a small tank in two bathrooms to be split amongst a lot of rooms. This may have been alright if people didn't spend close to 20 minutes under the water!", "Date": "Jan 8, 2008", "ReviewID": "UR719292032", "Ratings": {"Service": "4", "Business service": "-1", "Cleanliness": "5", "Check in / front desk": "3", "Overall": "4", "Value": "4", "Rooms": "4", "Location": "4"}, "Author": "AussieAnt"}, {"Content": "Locanda Orchidea is a lovely place to stay. Charming decor, cozy and centrally located. The hotel looks and feels more like a home, and the staff are friendly and helpful. I stayed in a single room facing the garden which was very quiet. I know this is not necessarily true of the rooms facing the street. Because the hotel is in an old building with old windows, my room was quite drafty and cold. But there were many layers of blankets and a duvet on the bed so I was very warm when sleeping. There are no meals served here but they have complimentary tea and coffee. It was really nice to settle into bed at night with a cup of hot tea and a book. My stay was very comfortable and I would recommend this hotel to anyone traveling to Florence.", "Date": "Jan 3, 2008", "ReviewID": "UR996405151", "Ratings": {"Service": "4", "Business service": "-1", "Cleanliness": "4", "Check in / front desk": "4", "Overall": "4", "Value": "4", "Rooms": "3", "Location": "5"}, "Author": "lindabelinda"}, {"Content": "Great for solo traveller       Single room", "Date": "Dec 24, 2007", "ReviewID": "UR467151278", "Ratings": {"Service": "4", "Business service": "3", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "4", "Value": "4", "Rooms": "4", "Location": "5"}, "Author": "geoffk1000"}, {"Content": "quaint hotel with nice garden Was a very quaint hotel/pension run by a friendly local. However keep in mind that it does not have alot of amentities - no internet/tv/aircon. However the price is very attractive. also keep in mind that in florence you really shouldnt be bothered with amentities because the city is so incredibly romantic and exciting on its own. Sylvia, the owner, was helpful with arranging bookings to hotels and offering tips. The room was so so. Washrooms are shared and there is hot water. the hotel is run down however and could do with a makeover. the garden definitely needs some urgent TLC.Overall a decent stay if you are on a tight budget.", "Date": "Oct 10, 2007", "ReviewID": "UR625549026", "Ratings": {"Service": "5", "Business service": "1", "Cleanliness": "4", "Check in / front desk": "4", "Overall": "3", "Value": "3", "Rooms": "3", "Location": "5"}, "Author": "hitman247"}, {"Content": "Just Loved Everything About It I stayed at this great family hotel in April 2007 during my 6 weeks trip around Italy, spending 4 days in Florence. Booked early and was able to have the single garden room, and what a delight that was. Walked from the station following the directions on the web site. The staff were very helpful and unintrusive. The medieval building with the huge wood door just exceeded my expectations about staying in the old part of town. My room was so cute, tiled floor, with a washbasin, a comfy doona covered bed, writing desk and chair and a huge window that opened onto garden. There was a comfortable lounge with coffee and tea facilities and I can tell you that is like gold to be able to make an early morning cup of tea and get back into bed with travel info to plan the day ahead. The location was excellent, near everything one required, internet cafe, just a stroll to the Ponte Vecchio, Palace Veccho, Ufitzi, Bargello, with plenty of little supermarkets and coffee shops around, not to mention the gelati shops. I could have lived in this room for ever. The bathroom was shared but never a problem as there was another bathroom one could use in another part of the hotel. It was a pleasure to come home at the end of the day and find a warm, clean and comfortable place to lay one's head, Lots of helpful information pinned up in the little lounge and ones own key to come and go as I pleased. I would highly recommend this accommodation to a lone traveller on a budget, I always felt safe and doubt if one could fine a place to stay in Florence that give such good value. I can't wait to return to Florence and stay in this little haven.", "Date": "May 16, 2007", "ReviewID": "UR393357225", "Ratings": {"Service": "-1", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "5", "Value": "-1", "Rooms": "-1", "Location": "-1"}, "Author": "iitaliangodess"}, {"Content": "Good quality service at a good price I was recommended this hotel by a friend of mine. I wanted a well priced, family-run hotel in the heart of the city. Locanda Orchidea was a perfect match. Although the room was basic it was a good size and very clean, as were the shared bathrooms. The service was friendly and I found the staff extremely helpful - offering me tips on what to do, where to go and what to see. The location was absolutely perfect. I just stepped outside the door and I was in the heart of it all - a stone's throw away from all the major sights. It's not easy to find a standard hotel in a major city which offers good quality service, clean rooms, prime location AND all at a great price but Locanda Orchidea satisfies on all accounts.", "Date": "Jan 24, 2007", "ReviewID": "UR535667441", "Ratings": {"Service": "5", "Business service": "-1", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5", "Value": "5", "Rooms": "4", "Location": "5"}, "Author": "AngelinaUK"}, {"Content": "in the heart of florence Our stay at Locanda Orchidea was lovely. Our room and shared bathroom were very clean. Our room felt homey and retained a lot of the charm of the building. We stayed on the street side, and it was very noisy, but my husband and I found this true of many places we stayed. Next time I would try hard to book a room over the inner courtyard. Building itself is in a great locality, and we were able to walk everywhere we wanted to go. Good food and drinks around- just be sure to look! Ms. Miranda was helpful and nice. I might request they WD40 the door to the room where we stayed; it was very squeaky. Overall though, we would return to this place.", "Date": "Dec 13, 2006", "ReviewID": "UR454944989", "Ratings": {"Service": "4", "Business service": "3", "Cleanliness": "5", "Check in / front desk": "4", "Overall": "4", "Value": "3", "Rooms": "4", "Location": "5"}, "Author": "hippytravels"}, {"Content": "Not Worth Any Stay I found out about this hotel in budget travel magazine on a list of secret hotels of florence and it should not be a secret that its not what the magazine said it is. The people seemed nice at first but it was not at all what I expected when I got there. The place looks like a hospital room. We had cold showers every day. They never told me about a cancellation policy when I made the reservation; when I called to change a three night stay to a two night stay days before they were acceptable with this and didn't mention anything about a cancellation policy. After our two night stay they charged us for the three nights and then told us about the cancellation policy. Don't ever stay here.", "Date": "Dec 3, 2006", "ReviewID": "UR233808786", "Ratings": {"Service": "1", "Business service": "1", "Cleanliness": "1", "Check in / front desk": "1", "Overall": "1", "Value": "1", "Rooms": "1", "Location": "3"}, "Author": "littlecmad"}, {"Content": "Insect repellent advisable I returned to the Orchidea, to find the same friendly service, cleanliness, etc. Unfortunately, there were also the same mosquitoes that kept me awake at night and left me itching the next day. It doesn't take more than one of them to ruin your night.This is not restricted to the Orchidea; an aqcuaintance staying in a different hotel a similar experience. And the mosquitoes paid no attention to my girlfriend.So - to be on the safe side, and make the most of your stay at the Orchidea and in Florence, it may be a good idea to be proactive.", "Date": "Nov 21, 2006", "ReviewID": "UR436790322", "Ratings": {"Service": "5", "Business service": "-1", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "4", "Value": "4", "Rooms": "4", "Location": "5"}, "Author": "Troubadour"}, {"Content": "Good budget hotel       view from our room down Borgo degli Albizi", "Date": "Oct 10, 2006", "ReviewID": "UR971309484", "Ratings": {"Service": "5", "Business service": "-1", "Cleanliness": "4", "Check in / front desk": "4", "Overall": "4", "Value": "4", "Rooms": "4", "Location": "4"}, "Author": "queso128"}, {"Content": "Decent Price....More Like Hostel The price was good, and the loaction was fine, but it felt more like a hostel than a hotel: no tv in room, shared bathroom. It can be quite noisy.", "Date": "Sep 15, 2006", "ReviewID": "UR443122551", "Ratings": {"Service": "-1", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "3", "Value": "-1", "Rooms": "-1", "Location": "-1"}, "Author": "LeoBaby"}, {"Content": "Home away from home Hotel Orchidea is something a little different. We weren't sure what to expect when we opted for the share bathroom down the hall option however this hotel was perfect. The rooms are comfortable, clean and have heaps of character. The staff are friendly and helpful and recommended one of the best restaurants we went to in Italy! The location is perfect and only five minutes from the major sights. A really great alternative to the standard hotel scene and satisfied my curiosity with regard to what lies behind those huge Italian doorways!", "Date": "Jul 20, 2006", "ReviewID": "UR554900826", "Ratings": {"Service": "-1", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "4", "Value": "-1", "Rooms": "-1", "Location": "-1"}, "Author": "aecasey"}, {"Content": "Felt like home in Locanda Orchidea       Flowering terrace, room number 4. Lots of whisteria.", "Date": "Jul 12, 2006", "ReviewID": "UR819660802", "Ratings": {"Service": "4", "Business service": "-1", "Cleanliness": "4", "Check in / front desk": "-1", "Overall": "4", "Value": "4", "Rooms": "4", "Location": "-1"}, "Author": "A TripAdvisor Member"}, {"Content": "Simple charm I have stayed at this locanda before so it was a joy to go back and find it has the same simple charm with just a few little improvments; as many as is allowed given that it is an historic building and changes to it are restricted. Borgo Degli Albizzi is the main drag therefore everything is within easy wallking distance and the busses are close. The owners are friendly and speak English and will do what they can to give you helpful information as to out of town busses, trips etc. We stayed in a different room than my original room and it was close to a little bathroom that looks and feels as if it were a large cupboard at some stage-imaginative use of small space! The room was plain and simple with everything you would need-tap and basin (not for washing clothes however there is a laundry-matt in a nearby street), ceiling fan, writing desk, wardrobe and mosquito burner. Beside the fact that the locanda is around the corner from the famous ice cream shop together with other terrific eating places there is an internet place just across the road and up a little for those who cannot breath without sharing the excitment with those friends or family who are waiting at home and would probably prefere postcards. A climb up to the window provided a great few of the street below and the passing parade which became a little noising in the night although we could have closed the shutters. Some of the other rooms available have beautiful views to a little internal garden down below with a majestic and very romantic fountain which is no longer in use. The door to the garden is kept locked however I am a photographer and last time I stayed the owners let me into the garden for a look. There is a little lounge in the reception area were you can watch TV if you are travel challenged or suffering from tourist burn out. Also there are information pamphlets etc and books for loan that have been left their by other travellors. There is an old charm about this place from the moment you walk through the large wooden doors from the street. On the left wall there is a marker where you can see where the water went up to in the floods in the 60's I think. As you walk towards the stairs on the left a statue of Dante greats you while you stop to look at the garden through the beautiful iron gates. Dante's wife's family owned the building and their crest is above the arch as you walk through. You can catch the lift up to the locanda if you have luggage however you need to pick up the key when you register. The locanda has a web sight with prices etc and I doubt you could get a better price for such a charming place. It is suprising the people you meet who have stayed there and are prepared to swap stories with you about the rooms etc. it is wonderful I met a room sister who now lives and works in Prato about a 40min bus ride out of Florence.", "Date": "Dec 29, 2003", "ReviewID": "UR442611738", "Ratings": {"Service": "-1", "Business service": "-1", "Cleanliness": "-1", "Check in / front desk": "-1", "Overall": "4", "Value": "-1", "Rooms": "-1", "Location": "-1"}, "Author": "A TripAdvisor Member"}], "HotelInfo": {"HotelURL": "http://www.tripadvisor.com/ShowUserReviews-g187895-d239510-r16302118-Locanda_Orchidea-Florence_Tuscany.html", "HotelID": "239510", "Price": "Unkonwn"}}