{"Reviews": [{"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Sleep Quality": "3", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Chicago, Illinois", "Title": "“The Maison was ruined by becoming the Ritz club level”", "Author": "PrincessPinotNoir", "ReviewID": "UR127740585", "Content": "The Maison Orleans was formerly my favorite hotel in New Orleans, despite its lack of a pool. The hard wood floors and fireplaces in the rooms were exquisite and the lounge areas lovely and peaceful. That all changed when the Ritz acquired the property and designated it their club level. No more peace and excellent service. The staff are scattered and no longer as helpful and there are WAY to many children running around the lounge areas. What was once a luxurious oasis is now more like Disneyland. I will never stay there again as long as it remains the Ritz Club Level. My advice is to book a room at the Windsor Court and enjoy their newly updated rooms and the pool. (Though the pool service is atrocious) WC has the best bellmen in the city too.", "Date": "April 12, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Richmond, Va", "Title": "“Nice, but hard to get to.”", "Author": "Lawone", "ReviewID": "UR122484849", "Content": "We stayed at Maison Orleans the week between Christmas and New Year's. It's the Club level of the Ritz Carlton. The rooms are lovely and spacious, especially the bathrooms. The lounge areas, both Club level and on the lobby level, are beautifully decorated. The issue I had, and it's not a big one (although these are very pricey rooms) is the location of the Club Level. Clearly this was not the original, intended design for the hotel because Maison Orleans is very hard to get to (\"go up to level 4, turn this way, then that way, go through the door, round the corner and take the next elevator\" etc, etc). Each time we came and went, we nearly got lost. In fact, there are several hotels within this building and the lobbies are on varying floors with varying elevators. Overall, lovely hotel - just a very confusing layout.", "Date": "January 3, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Jacksonville, Florida", "Title": "“A Great Hotel in a fun town”", "Author": "travelerfl0rida", "ReviewID": "UR98925435", "Content": "This is a great place to stay in New Orleans. The staff is very accommodating and makes the guest feel comfortable. The club lounge is relaxing after spending time in town. Will definitely try to stay here again. Initially I had a noisy room and they moved me without any problem. You can have an incredible staying here.", "Date": "March 4, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "old saybrook, connecticut", "Title": "“Totally devoted to you as the guest”", "Author": "sondrad", "ReviewID": "UR89595600", "Content": "We have stayed at the Ritz Carlton club level before; in Laguna Nigel specifically the club service was impeccable and I thought hard to beat. The Ritz Carlton New Orleans, Maison Orleans is comparable in service, quality and overall pampering. We arrived late in the day on a Monday evening, around 5:30PM. Our travel companions had arrived at noon. We were a bit tired after the trip and I was frazzled, not enjoying flying all that much! I truly needed a cocktail to de-stress. We entered the porte corchere of the Ritz Carlton, off of Canal Street, and found a bevy of valets at our service. Our bags were unloaded and trollied, our car whisked away and we were greeted with genuine smiles and warm welcomes. The bellhops were knowledgeable and directed us aptly through the maze of hallways to the registration desk. The attendant there had us registered in under a minute and had another attendant escort us further on our journey to our room level. The Maison Orleans is the Ritz Carlton Concierge Level for their New Orleans hotel. It was once a separate hotel and so to navigate to it is a bit of a trust walk. We were glad for the attendant guiding us. When we arrived at the lounge on the club level, our concierge, Ryan greeted us. After he noticed that we had found our friends seated in the cozy, fireplaced living space of the club, with cocktails in hand, he suggested the bellhop could go ahead and bring our bags to our room while he retrieved us our own libations. We were relieved and thrilled to be nestled in so quickly. For those familiar with club level service, the Ritz wrote the book on how it should be done. Well chilled Champagne, Merlot, Cabernet and Pinot Grigio wine were available on a side board with plenty of glasses. Hand mixed cocktails could be retrieved by the wait staff circulating. The center board in the main lounge had an amusing array of light bites: roast breast of duck with a wine reduction on grilled french bread, chicken with a cilantro sauce, puffs of carmalized onions and grilled mushrooms. Along with these, were an array of cheeses, with toasts and crackers, marmalade and salted nuts, as well as a platter of crudites and dips. Yum!! As we relaxed, Ryan returned with drinks and asked about our plans, offering his assistance. He made many difficult dinner reservations easy, we even challenged him with quite a few changes and he didn't drop the ball, not even once! His recommendation and reservations for Louisiana Bistro, on Rue Dauphine, as well as his encouragement to allow the chef to cook for us off menu, was spectacular. After we revived ourselves enough to ready ourselves for dinner at 9PM at Cochon, we retired to our room for baths and a short nap. The room was stunning, spacious and well appointed. The lights were on in the room, music playing, slippers out for turn down. One small detail, maybe not so small, was the lack of bed coverlet and decorative pillows on our bed in our arrival. We questioned Ryan on this later in the evening, he stated it might have been de-feathered (which we had requested), and he asked what I would like done about it. I would have preferred he make a recommendation and attend to it immediately, so his request took be back a bit. But I simply asked for additional blankets to compensate and the request was fulfilled before we arrived home that evening. The bathroom is large, with a separate oversize tub, candles, lighted shave/makeup mirror on the vanity wall, and a closeted space for the loo. Of course the robes were terry warmth goodness and the slippers soft. we immediately felt the pressure of the travel week and our life melt away, lol! Toiletries were numerous, as expected, including nail files, combs, ear swabs, makeup remover sheets, mouth wash, shave kit, and multiple soaps and lotions. The room is equipped with a small wooden box, that upon inspection, revealed a tea cozy, coffee maker and assorted condiments. The closet was sufficient, not as large as expected, but we travel light. Iron and board available for touch up, although pressing service would be the way to go if things really need help. We were on the seventh floor of the Maison Orleans, room 789 (not to be confused with the 7th floor of the Ritz Carlton main hotel, which we learned through our hotel hallway travelling mistakes doesn't even exist!). Our friends were on the fourth floor, on the level of the club lounge and den. Although the fourth was convenient, we discovered their room to be much smaller than the one we had on the level higher up. So the journey up the elevator, despite a short wait, for us was worth the trade off. The club lounge offers experienced and knowledgeable wait staff and plenty of them. We saw no less than five people on duty each day, and some days there were only four guests in the lounge. This meant the food offerings were always fresh, our dishes and glasses cleared quickly and questions answered right away. Breakfast each morning was fresh cut up melon and pineapple, whole fruits of banana's, apples and oranges. Smoked salmon with creme fraiche and capers, hard boiled eggs, muesli, cold cereals with berries, breads, bagels, muffins, english muffins and croissants. Grapefruit, orange, tomato and apple juice were always available as were bottled water, sodas and ice. A side board held urns of coffe and hot water for tea. But my personal favorite was the espresso maker! Espresso, double espresso, cafe machiatto, lattes, wow! I could have had them all! Offerings were refreshed for lunch around 11AM. We were not around for this serving, but heard from others it was sufficient to warrant no further meal needed. And the quality of the courses were on par with any 5 star restaurant. However it is New Orleans people, and the restaurants are amazing! Beside the cocktail hour, there were always cordials and desserts of mousse, creme brulee, tortes, lemon bars, mini cheesecakes, etc to end the evening up through 10PM. And since this is New Orleans and we rarely returned 'home' before 1 or 2, a midnight offering might be nice, lol! They will however make you an amazing kir royal or bloody mary in the AM for that morning after :) We also made use of the spa treatments while there. A Swedish Massage and a Ritz classic pedicure, set us back more than other spa services I have received elsewhere, but they were both worth every penny. We were not rushed through, we were treated to a variety of waters and refreshments and the spa staff were all very engaging. My masseuse was clinically expert, and helped to relieve a long standing shoulder muscle pain, providing me personal tips on permanently avoiding it in the future. The attention to detail and most important to us, that six sense the Ritz staff are trained in, to anticipate what you need as it becomes apparent to even you, is remarkable. It is a skill that costs little in the end, and that all business could learn from, imagine a world trained to run by the Ritz? Retrieving our car was simple and quick. Retrieving a taxi was made easier by our doorman, they were always available. We realize that our visit was during a very, very slow time for NOLA. So minimal registered guests may have accounted for the efficiency factor in some cases. but the smiles were genuine. On our last night we stayed in, visited the Davenport Lounge in the Ritz main lobby for some jazz and then headed up to our room for a movie. The TV service is inconsistent at best, as it appears to be satellite and prone to wind and weather. Our movie cut out twice on us and had to be rebooted. And on our third day there, our bed coverlet and decorative pillows (non feather brand) suddenly appeared, which aesthetically made the room nicer and our nights warmer. Turn down service each evening was also inconsistent, sometimes happening sometimes not. But it was not an irritant. Internet is charged on an hourly fee. They must change that, its so 90's. Wifi should be the norm in all fine hotels. Check out was smooth, with our bellhop even helping to check the room one last time for things left behind. I am so pleased we booked a stay in another club level of a Ritz in Philly for February. I don't know I will go anywhere else, with the rates offers they\\y often have. I highly recommend you try this hotel.", "Date": "December 11, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Kentucky", "Title": "“Great 40th B-day”", "Author": "we3kingsKentucky", "ReviewID": "UR32489514", "Content": "I was treated like royalty by each and every member of the club floor staff!! Best bloody mary I have ever had. Food and wine presentations were excellent.", "Date": "June 16, 2009"}, {"Ratings": {"Service": "2", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Location": "5", "Rooms": "5"}, "AuthorLocation": "New Orleans", "Title": "“Very Nice, but a few problems...”", "Author": "MooneyPilot", "ReviewID": "UR25927179", "Content": "My wife and I stayed here during Mardi Gras this year. This was our first stay at the RC in New Orleans, but we both regularly stay at RC's around the world. Upon entry, the hotel is beautiful, except for one of the elevator's which had some graffitti in it (you can tell that they tried to clean it up, but it was still visible). The check in was fantastic, as we were even able to get into our room at 10am. The room was wonderful and very nicely appointed. The club room was always very clean and cocktails were made available to us throughout our stay. The breakfast was good, but the same each day. Snacks were served each day during lunch and dinner hours and were of a nice variety. My wife had to ask for Jack Daniels during the bar service (they did not have any until she asked and some was retrieved from another bar in the hotel). All in all the club service was very good, especially since it was a very busy weekend. We really only had three chief complaints... First, we had come back to the room and wanted to take a short nap. I had called for two wake up calls to make sure that we got up. The first came, but the one that was supposed to come 10 minutes later did not. We ended up oversleeping and arrived very late to our dinner reservation at Emeril's. The second complaint was that our room was very noisy. We overlooked the courtyard, but could hear hallway noise and specifically in our bathroom, we could hear the conversations in the room below us. It made for an interesting stay, but I am sure that the couple staying below us would not have wanted some of their sexually explicit, private conversations overheard by others. The third, and largest, problem came when the shoe shine service lost our shoes. We send them to be shined (two pair of mine and two of my wife's) on our first night and they were lost. We finally were able to get them on the day of our arrival. We ended up having to go out to buy new shoes to wear with different outfits. When I called to complain, the manager did offer to remove the charges for one of our room nights. Both my wife and I found this to be reasonable. All in all it was a very nice experience, except for losing our shoes.", "Date": "March 10, 2009"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Business service (e.g., internet access)": "1", "Check in / front desk": "3", "Overall": "1.0", "Value": "1", "Rooms": "2", "Location": "3"}, "AuthorLocation": "milan", "Title": "“gimme a break”", "Author": "trillo", "ReviewID": "UR23169443", "Content": "rooms are quite fine but furnitures completely worn out. service is not existent. we asked for dinner reservations and gave three names and the answer was that they were fully booked. we decided to try anyway by ourselves and we found a table in the one of the restaurants indicated immediately. we asked the \"concierge\" (...) to try again for a reservation for the following day and the day after we received no message or confirmations so we had to manage everything by ourselves again. we called the concierge to ask for an international adaptor and the answer was that they will check and would call us back and they never did...we had to buy it at radio schak. the only internet position in the club was always busy so we had to use the business center in the ritz carlton and half an hour costed us 25 USD. our room was never serviced the second day. overall it was not up to our standards, we were just coming from the peninsula chicago and that was a totally different level, and above all not what you expect from what is supposed to be a club experience at a ritz carlton hotel (is it really a 5 stars)? stay somewhere else.", "Date": "January 1, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Dallas, Texas", "Title": "“One of the best weekend getaways!”", "Author": "makjak", "ReviewID": "UR20888984", "Content": "I planned a weekend trip to New Orleans to celebrate my husband's 45th birthday and to get a much needed break from work and two young children. After much deliberation I decided to stay at the Ritz Carlton's club level rooms, the Maison Orleans, and we were not disappointed. The staff were very welcoming and so nice and friendly we felt like we were treated like royalty. Though the taxi dropped us off at the Ritz Carlton entrance, the bellman escorted us over and up to the 4th floor check-in where we were greeted with champagne, hors d'oeuvres and the smell of gardenias. We found our room on the 8th floor to be romantic, well appointed and very clean. The rooms are all the same size and are comfortable (not too small but not huge) at 400 sqare feet. There were candles on the mantel and next to the bathtub for two and I loved the Bulgari bath amenities. In the room there was a large desk and chair and a seat with a stool and a cart with barware. The king size bed was very comfortable but we found the pillows way too fluffy. Extra pillows were brought up for us but they were equally as difficult to sleep on. I was surprised that these rooms have no view, other than looking out to another building, but considering how little time we spent in our room, it was not a major concern. For those who need a balcony, there are none to speak of so you have to go downstairs to get some fresh air (or to smoke). We loved the club level amenities and went into parlor several times a day to grab a beverage or a bite or a newspaper. It is very beautiful and very relaxing. The breakfasts held enough variety so that one could eat a full meal but the other food presentations were more like snacks. The only thing I felt could be improved upon is the bar which is set up in the evening. I would have appreciated a bartender on site to make the drinks rather than guests have to prepare them themselves. The premises of the Maison Orleans and the Ritz Carlton are beautiful and well maintained but we especially liked the spa and the Ritz Carlton courtyard where we had after-dinner drinks. The central location of the hotel was great and we walked from one end of the quarter to the other with no difficulty. When we needed to go further distances, we made use of the complimentary car service which I must say we found fabulous. The drivers were very nice (our favorite was Nick) who extended themselves to make our stay even better. There were a few (very minor) hiccups but the way the staff handled the situations were perfectly fine. My husband requested our room to be cleaned and it still was not when we returned hours later. We asked a housekeeper on the floor and she stopped what she was doing to check on why our room had not been cleaned. She came back to explain that the housekeeper assigned to our room had gotten behind and then cleaned the room herself even though it was not on her schedule. On another occasion, we ordered drinks from the bar and my husband's was served in a plastic cup and my martini in a wine glass. The excuse was that were busy and no one had time to clean the glasses. We were not upset by this just surprised that a hotel flying the Ritz Carlton flag would ever let this happen. My husband had been employed with a 5 diamond, 5 star property and knows that hotels have thousands of glasses on hand and staff should have pulled them from another food/beverage outlet or at the very least taken the time to wash them by hand. We mentioned this to the manager and they took the drinks off our bill. Prior to coming to New Orleans, friends had cautioned that things were still not up to pre-Katrina levels so we arrived with low(er) expectations. It is nice to say that we were pleasantly surprised at the level of service we received and would recommend a stay at Maison Orleans to anyone. We hope to return to New Orleans and this hotel before the end of the year.", "Date": "October 15, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Business service (e.g., internet access)": "3", "Check in / front desk": "4", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "California", "Title": "“Great Experience with some inconsistencies!”", "Author": "dessertqueen", "ReviewID": "UR17585893", "Content": "My husband & I just returned home from an 8 night stay in NOLA @ the Maison Orleans! Our visit was not for vacation, it was to accompany my sister 'n' law from Oregon who chose to have major surgery in NOLA with her partner by her side. We went to be family support and to help in anyway we could. Before our visit thanks to this website we were aware of the inconsistencies with housekeeping so it wasn't a total surprise but was still a disappointment in that this was our first visit to a Ritz Carlton and a major splurge for us!! When we arrived @ reception at the Ritz, we were then escorted along with another couple over to Maison Orleans which as previoulsy mentioned is a maize!! We had an easy check in with no wait at all! We asked for a high floor and a quiet room and both were honored, we were on the 9th floor and a corner room which was incredibly quiet!! The room was beautifully decorated and had a very large bathroom with a huge sunk in tub, which unfortunately we didn't have time to enjoy. On that note they have bath salts by the tub but I found out half way into our stay that you can ask concierge for bubble bath and they have several to choose from, they smell wonderful! They have robes in the closet that you can use during your stay and there are suppose to be slippers as well, which would be nice cuz the rooms have hardwood floors, and I don't travel with slippers. It took asking 2 times and several days before our slippers finally arrived, which is a little thing but they should have been in our room at check in!! Whereas my sister 'n' law's room right next door had them at check in! The room had nice touches, like complimentary bottles of water, candles by the tub, like someone else mentioned bring matches! Towards the end of our stay I finally looked inside this ceramic box on the bathroom counter and discovered small packets of woolite (very nice) and q-tips and cotton balls, etc. They also provided a large umbrella for use during your stay, which we took advantage of, it rained most afternoons. In room safe was quite small but appreciated. Our room seemed awfully dark and we realized that the light bulb with the fan was burned out along with another light bulb in another spot, our curtain was hanging down in one spot where the hook had come off of the rod, and our toilet became stopped up. We reported these problems in the morning and when we returned later in the day, they had all been fixed, we were impressed with the follow through! The location of the hotel is great, close enough to the French Quarter for evening walks and an abundance of restaurants but far enough away from the loud music that is blaring from the bars on Bourbon St. We felt perfectly safe walking from the hotel in the evening and back although the last couple of blocks towards the hotel from the French Quarter look a bit shady, but we didn't have any problems! If you want a nice dinner, try Mister B's, a few blocks from the hotel, great pork chop!! The food presentations were very nice; breakfast, lunch, horsdoeuvres and the afternoon tea on Fri & Sat were all tasty and adequate! The dessert presentation was a major disappointment; strawberries with a fondue (some were better than others) pretzel sticks and chocolate cake and one other item, it was the exact same thing for all 8 nights in a row and in very short supply so it ran out early depending on how many people came to the lounge. On the other hand the selection of drinks was very nice and if you asked they would even make you a mixed drink! Roberta makes a mean Cosmo!! One of the annoying things was at breakfast time especially I would go to grab a napkin or silverware and there would be none, so I would have to ask for them, and one gentleman in particular would hand me what I needed but wouldn't think to replenish the table for the next person, which I found to be kind of strange. Where as I would notice that at other times, one of the Concierge staff in particular would notice that the table was low insilverware, etc. and would bring out more before someone would have to ask for it!! But I have to say it was very nice having the food there when you wanted to grab a bite to eat and not have to eat out at restaurants all the time!! As mentioned many times on this webiste Housekeeping is inconsistent!! You would never know if you would get all of your towels & or toiletries replaced. One day we were short 5 of our towels, there's no excuse for that. One day they took my ladies razor from home which didn't look anything like the one they provided, that was slightly annoying!! Another day our bathroom rugs were taken and not returned, that was kind of strange! Turn down service was hit and miss, some days we got it and others we didn't. We got chocolates by our bedside one night out of 8, we didn't know we were suppose to be getting them until one of our last nites when they suddenly appeared. On the other hand my sister 'n' law in the room next door was getting chocolates all along. The quality of turndown was inconsistent also, sometimes we got ice and others we didn't, sometimes our towels were replaced and sometimes they weren't. We did have two housekeeping ladies that took very good care of us when they were cleaning our room, everything was replaced as it should be, very consistent!! That's how we finally got our slippers! These inconsistencies were not big things just annoying when you are paying for this level of a luxury hotel. Another annoying item that came up was the use of the complimentary Mercedes. I read about it on the Maison webiste, and called & asked about it and was told that none of The Ritz's offer that anymore including NOLA. So we just took cabs back & forth to the hospital in Metarie for 3 days. The day before we were leaving, while talking to one of the Concierge staff about taking a cab to the airport, she replied, we can arrange the Mercedes (free) to take you. I thought that was great, but was a little annoyed, we could have saved some $$ taking cabs and taken the Maison car instead. The following day when we were getting ready to leave for the airport we received a call notifying us that the car had a flat and we would need to take a cab instead. Oh well, we tried!! As far as Concierge, that is where they shined!! My sister 'n' law and her partner stayed here for the 2 nites before the surgery and then returned for 3 nites after surgery before flying home. The day of surgery we were all leaving the hotel at 4a.m for the hospital, so we would miss breakfast. My sister 'n' law asked one of the Concierge staff if it would be possible to pack a little something for us for breakfast like some fruit, etc. Let me tell you, she took very good care of us, we had a feast of croissants, muffins, fruit, granola, and a lovely note enclosed too, this was very thoughtful and much appreciated!! The manager of Maison, the Concierge staff and two housekeepers in particular were fabulous in preparing for my sister 'n' law's return to the hotel after her surgery, they wanted to make her feel at home and comfortable, did they ever, they went above & beyond that!! They had a vase of beautiful flowers, extra pillows, extra towels, small fridge filled with her favorite comfort foods, magazines, movies, etc. waiting for her return!! It was quite something!! They were extremely helpful and accomodating, always asking if there was something else they could do to help out! We began to feel like we were surrounded by an extended family!! This service by Conceirge by far outweighed the annoyances of the inconsistencies of Housekeeping!! Although it would be nice if they could get Housekeeping consistent!! My husband said, all they need is a checklist of what should be in every room, it's that simple! All in all we had a great stay at Maison Orleans!", "Date": "July 6, 2008"}, {"Ratings": {"Service": "2", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "4.0", "Value": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Houston, Texas", "Title": "“Loved this property”", "Author": "Chellebell", "ReviewID": "UR17531890", "Content": "We stayed three nights here as an anniversary getaway. Valet and Bellman: They promptly took our luggage and car. We had trouble getting a hold of them when it was time to check out, but we contacted the club concierge and it was taken care of. It was a busy day for them, the start of the Essence Music event, so they were pretty busy. Check-In: Many reviewers have noted the elevator system is an annoyance. We've stayed in the building before, so kind of understood it. It is a neat old building and we didn't mind the elevator transfers. Check-in was immediate at the 4th floor desk. We were offered a drink, and since the mid-day meal was going on, we were offered a snack before we went to the room. Club room: There are three rooms to relax in. Drinks-various waters, sodas, champagne and wine- were always available. Breakfast, mid-day meal, evening treats were varied and plentiful. I was under the understanding we would also have tea, but was then told it is only on the weekend. Dessert was lackluster and one night it wasn't even put out, though cookies were always available. They did have a wonderful selection of cocktails in the evenings. The staff who worked the area were very nice. Disappointment: I had arranged two amenities for the room and neither were taken care of. I mentioned this simply because I didn't want to be billed. Later a different concierge came to me and said he was told I'd make a comment......it was uncomfortable and it kind of bothered me as I had to impression he was faulting me, but I think this particular concierge and I just didn't mesh. The other concierges were wonderful and really went out of their way. At one point, some other guests decided to smoke cigars in their non smoking room. It was very strong, but it was taken care of immediately. I lovely rose petal turndown was given one evening. I think this was due to our anniversary and missing amenities I had scheduled. Room: The room was very nice. Incredible bed, amazing tub. Very quiet room. Housekeeping: This was the main reason I was unable to give an excellent rating. Our bath amenities were never refreshed. I had to call down and request bubble bath. The tub is amazing and I wanted to take more than one bubble bath during our stay. Also, the towels would be taken and no new ones left. Every day I had to request extra towels. I also noticed the floor in the room was not swept while we were there. This was very frustrating and I feel I shouldn't have to ask for towels, especially since there are supposed to be two services a day. One day, the even took three of the bed pillows. Turndown service: Was done the first night, not the second, had to request for the third. When the service was done, it was only done for one person. Spa: We love the small resistance pool. I had an unmemorable facial. It was not the kind I expected from a Ritz Carlton. We both had the hot stone vichy shower massage. Both of us agreed it wasn't our cup of tea, but no fault of the therapist. We also had a couples massage during our stay that was wonderful. Location: Loved it! I'm looking forward to giving the Maison Orleans another try and hopefully the housekeeping services will have improved.", "Date": "July 4, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Business service (e.g., internet access)": "4", "Check in / front desk": "4", "Overall": "5.0", "Value": "4", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Tampa, FL", "Title": "“Come on people, it's New Orleans!!”", "Author": "FLgemgirl", "ReviewID": "UR16978683", "Content": "I stayed at tthe Maison Orleans this past weekend and found everything to be exactly as expected. What did I expect? I expected a beautiful clean room, good service in the club lounge, good to very good food, COMPLIMENTARY cocktails with really good wine and champagne and concierge services from someone who actually cares that you have a good time. That all spells a nice weekend to me! I have stayed at Ritz Carltons all over the place and each experience is entirely different, based on the locale. This is New Orleans, where life is laid back and the people are easy and maybe on a slower, much more relaxed pace. As I read the previous reviews, I don't understand what people expect when they travel. I think if you stop expecting and comparing everything and just arrive and enjoy the place without so many big expectations, everyone would have a much better time. Yes, this is an expensive place. And it is confusing to have 3 hotels within the hotel, and it is strange at first to find your way around the place. But since this town is different from all other towns, why would you expect the building to be shaped the same and the place to be identical to all the other Ritz Carltons? If you can afford it, stay here. It's a fun treat. Try the whirlpool in the fitness center and also the resistance pool. It is awesome and I think even an olympic swimmer would love it. The bar in the Lobby was hopping on Saturday night and they were throwing a giant Father's Day BBQ and Beer sunday brunch in the French Quarter Bar. This place has something for everyone and we did see alot of people with their children here, and even their dogs! Everyone greets you and makes you feel welcome. I thought the staff jumped through hoops to make sure we had a good time, but they did it on New Orleans time, and that was fine with me!", "Date": "June 16, 2008"}, {"Ratings": {"Service": "1", "Cleanliness": "2", "Check in / front desk": "2", "Overall": "2.0", "Value": "2", "Rooms": "5", "Location": "3"}, "AuthorLocation": "NJ", "Title": "“Maison Orleans - The Good, the Bad and the Ugly”", "Author": "KMH15", "ReviewID": "UR15989730", "Content": "My husband and I and the other couple we were traveling with frequent the Ritz Club Level in Battery Park New York. Us about 3 times a year, them about 6-8 times a year. We love it there, the concierge is helpful, the staff in the lounge willing to get you anything, housekeeping impeccable. This is not the case at the Maison Orleans aka the Ritz New Orleans Club Level. First the Good. The rooms were beautiful, much nicer than the ones at Battery Park and the tub is HUGE. You could probably fit 3 people in there. The club lounge is also nicer and more elegant than Battery Park. The gym that is shared by the Ritz, the Maison and Iberville Suites is the best hotel gym I have ever used. The complimentary food in the lounge was good, especially at lunch and hors douvers. Dessert was always fondue, which got old after a while. Now the Bad. When we arrived there was no one to help us with our bags or through the maze of elevators required to get to the lobby. We arrived at 10:30 am and we knew that we probably wouldn't be able to check in right away, even though we had requested early check in. They said our rooms would be ready by 1:30 which was fine, but they were not ready until after 4. (normal check in time is 3). Most of the staff in the lounge at the Maison Orleans did not seem to understand anything that was said and consequently, requests to restock items like sodas, glasses, plates, crackers, etc were often ignored. If you got coffee in the lounge after 12 pm it was always lukewarm and had bits of coffee ground in it. The cocktails were all from a self serve bar which I thought was a little strange, but didn't mind. But if there was something that you had to ask for, like beer which they had in the back, the staff seemed annoyed that they had to get it for you. Now the Ugly. Housekeeping was awful. I cannot believe that the Ritz would let this happen. Our room was only cleaned 2 of the 5 days we were there and we were always out of the room between 10 and 4 so there is no excuse. We came back only to change for dinner and then were back out again. Turndown was only done 3 of the 5 nights and even then they only pulled the duvet cover over the sheets. They didn't even bother to straighten out the sheets underneath or restock any of the toiletries or towels. The couple we were traveling with came back to their room to find coffee poured into the sink without being rinsed out. I would save your money, stay at a cheaper hotel and spend more money out in the smalls shops and restaurants where it is needed. New Orleans is a great town, and I would definitely return, just not to the Maison Orleans.", "Date": "May 13, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "new orleans, la", "Title": "“Treated Like Royalty”", "Author": "blissfulbride", "ReviewID": "UR13842175", "Content": "Being from New Orleans, my husband and I had the traditional French Quater/New Orleans wedding and the Maison Orleans assisted in completing a fairytale evening for us. It started when they agreed to use their hotel car to pick us up from our reception in the heart of the French Quarter and it ended with them bringing us to the airport two days later for our honeymoon flight. After my husband carried me over the threshold, he started to look around and did not see the Champagne that was suppose to make it to our room; however, we had passed it when we came in the door with me in his arms! It was perfectly chilled and a plate of chocolate covered strawberries sat next to it! Little did we know, but both water and champagne are a staple in the Maison Orleans! The room was large and decorated in a warm ellegant style with wood floors throughout the room. The bathroom was extremely large and nice (there are candles in the bathroom, so grab som matches!). There are 4 different food displays for you to help yourself on the main level. There are soft drinks, water, wine and champagne all the time. If you want coffee and it is not displayed, just ask and it will be brought to you in no time flat! There are games to play in the study if you want to stretch your legs from your room without going to the main part of the hotel or going outside. My husband checked our bill on the television and there was a discrepency with it, so he called and they changed it immediately! He informed the man at the front desk that we had a late afternoon flight and they gave us a 2pm check out. The man at the front desk found us having a snack and asked if we would like a going away box of goodies because we had a long international flight and that way we would not have to eat plane food. The car picked us up for the airport on time and the driver had 2 bottles of water waiting in the center console! From beginning to end, they were wonderful. It was definately worth every penny!!!!", "Date": "February 25, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "3", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "gold coast Australia", "Title": "“Sensational”", "Author": "kitkatkoe", "ReviewID": "UR13841652", "Content": "We stayed an entire weekend at the Maison Orleans.. and what can i say.. SENSATIONAL... I got a great deal for around 280 dollars per night... and the valet was kind enough to give us free parking for the entire stay... Combine that with the ' yummy buffet style nibblies' served 5 times a day.. including wine.... its a great deal The staff were above helpful... very friendly.. nothing was too much trouble... The rooms are top quality.. the baths OMG... two people can lay down in them.... and the beds and linens were the most comfotable i have experienced in a hotel.... Do yourself a favor.... stay at the maison orleans... it wont disappoint", "Date": "February 25, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Check in / front desk": "4", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Durham, North Carolina", "Title": "“Top-Notch Facility”", "Author": "adamunc", "ReviewID": "UR13387180", "Content": "On a recent trip to New Orleans, spent half my time here and half at the Windsor Court. This one came out on top for me. It's less than a five-minute walk to the heart of the French Quarter, but far-enough removed that it's out of the chaos. This is actually a separate building adjoining the primary Ritz-Carlton, so the entrance is on Iberville St. The lobby is on the 4th floor, where there's just a simple writing desk for check-in. All very smooth, comfortable, and efficient. The club lounge is on the same floor, and it's terrific. There's a larger main room with lots of seating at tables, chairs, sofas, and other groupings. Across the hall, there's a smaller library room for a more intimate feel. The food presentations were as good as you would expect, and there was always nice-quality wine and champage out. The rooms are fantastic. Everything looks spanking-new and is spotless. The decor is classic New Orleans--almost over-the-top, but not quite. There's a half-canopy, a fireplace facade, wooden library shelves lining the wall, a tea-service credenza, and a rolling bar cart with drop-down leaves. The mattress and linens are ultra-comfortable. The room is also wonderfully colorful--no boring hotel beige here. Floors are hardwood with area rugs. The bathrooms are sensational--typical RC layout with wide marble counter, large separate shower, and impossibly deep tub. They're done in tones of rust and charcoal marble. Lounges and dining in the main Ritz building are easily accessible and all plush. Service was slick and friendly. As with much of New Orleans, it seemed like they were possibly just a little under-staffed, but the Maison Orleans only has 75 rooms, so there was never any real wait for anything.", "Date": "February 8, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Houston, Tx", "Title": "“Best Hotel in New Orleans”", "Author": "piatty73", "ReviewID": "UR12614522", "Content": "The personal service and the complimentary food and coctails make this the place to stay in New Orleans. The rooms are classic and the toiletries are Bulgari. We were upgraded to a beautiful suite and did not want to leave the hotel.", "Date": "January 14, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Business service (e.g., internet access)": "4", "Check in / front desk": "4", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Plymouth, Massachusetts", "Title": "“What a treat”", "Author": "Aldo_Nola", "ReviewID": "UR8499896", "Content": "Extremely nice facility nestled inside the Ritz-Carlton. Lounge areas comfy and quiet. Food and beverages available almost 24/7 at no additional cost. Super quite. Room is elegant in dark green and oak shades. Bathroom large and elegant. Bed very comfortable. Staff tries very hard and usually succeeds, but still not at pre-Katrina levels. Rate is extremely reasonable ($269).", "Date": "August 24, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Lexington, Kentucky", "Title": "“A Wonderful Escape”", "Author": "nmillerl", "ReviewID": "UR8056335", "Content": "I took my best friend to New Orleans for the Police concert and her 35th birthday .I picked the Maison Orleans after reading recent reviews on TripAdvisor. And, although I received a reasonable rate for this trip, I expected a great experience at the hotelâ€¦and I received a great experience at the property. Maison Orleans was beautiful, well appointed and the service was top notch. The room was well sized with a renovated bathroomâ€”loved the oversized garden tub. The hotel staff was lovelyâ€”we met the GM and the hotel macaw â€œBabyâ€� in the courtyard. Russell, our main concierge/butler, was so accommodating and thoughtful; he went out of his way to make sure we were comfortable at all times, even going so far as to bring us a selection of breakfast foods when we missed the AM food presentation. By the way, the five food presentations and cocktails cannot be beat. What a wonderful way to keep full â€˜til dinner in the quarter.. Again, a wonderful property. We will return next year. New Orleans is just as fabulous as she has always been.", "Date": "July 4, 2007"}, {"Ratings": {"Cleanliness": "5", "Overall": "5.0", "Value": "5", "Service": "5", "Rooms": "5"}, "AuthorLocation": "San Francisco, CA", "Title": "“Amazing Stay at the Maison Orleans”", "Author": "SFGuy23", "ReviewID": "UR3812901", "Content": "I stayed at this spectacular hotel on Aug 18th-22nd. I simply didn't want to leave. After a four and a half hour flight from the west coast, I was exhausted and hungry. When I arrived at the front desk, Audrey, an extremely professional and kind front desk host instantly greeted me warmly and asked me how my trip was. She said \"everything will be better now that you're here.\" She was right! My room was simply lovely. Hardwood floors, a faux fireplace with marble bordering, a kingsized cannopy bed with an overhead fan and a large desk and two beautiful chairs with a large foot rest. My favorite was the wooden bookcase with old literary favorites as well as the DVD/CD player that included a jazz compelation to listen to during my stay. The view wasn't spectacular, but from the sixth floor I had nice view of the New Orleans skyline, which I enjoyed. The Bathroom really took my breath away with white marble everywhere, a tan-ish colored marble countertop and a huge (and I mean huge) soaking tub and a separate standing shower with Bvlgari bath products. It also had an overhead speaker that was linked to the main speakers in the bedroom. The beautiful public areas of the hotel are extremely well maintained and beautiful with fresh orchids everywhere! The food and beverage services were simply delightful with sushi, salad, shrimp, salmon and kobe beef appetizers. The staff will also bring you to-go cups of any mixed drink you could think of with a warm smile and a \"my pleasure.\" I did have one problem during my stay....the hot water in my bathtub didn't seem to be working. I mentioned it before I went out for the evening and upon my return I realized it wasn't fixed. I went downstairs at approx 4am and told the staff of the issue ( I wasn't mad at all though) and Eric from Maintenance came up immediately (at 4am!!!!) and fixed the problem. The roomservice was prompt and wonderful. I had to catch a 6:30 flight back home and ordered room service at about 3:30am, just as seemless as if it were at 3:30 pm. The adjoining Ritz Carlton is also beautiful, but the level of service at the Maison Orleans which is basically the Club Level of the Ritz is simply astounding and worth the added price which is actually extremely reasonable. As it was August, it was so hot with a lots of humidity.....but at the Maison Orleans, I didn't have a need or desire to leave. Upon mentioning that I needed to get coffee from Cafe Du Monde to bring home as a gift, the front desk host went to the back and returned with a gift bag of New Orleans goodies including coffee from Cafe Du Monde! Well, that just meant I had more time to enjoy myself at the hotel, which made that particular day even more wonderful. I went out for dinner three of my four evenings and the restaurants the staff recommended: Peristyle, Maximos and Bayona were all spectacular and just wonderful New Orleans dining experiences. I just have to mention that Audrey, Eddie and Brittany consistantly went above and beyond the call of duty and never had anything but a smile on their faces. They made my trip.!! And by the way, just so you know, I did go to the Windsor Court hotel and the hotel was very nice, but I much prefered the marble covered lobby at the Maison Orleans to the aged carpeting at the Windsor Court. It looks as if it needs an update......but not the Maison Orleans, it was the perfect escape from the outside world and was my sanctuary in this amazing city! I will only stay here upon my return to New Orleans! Thank you to the staff at the Maison Orleans!!!", "Date": "August 28, 2005"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "Unknown", "Title": "“The Best”", "Author": "A TripAdvisor Member", "ReviewID": "UR3611390", "Content": "We had a reservation with the Ritz-Carlton and when we arrived they said the room wasn't clean. They quickly placed us in the Maison Orleans Club Level. I was very confused but when they showed us the room and explained it was their luxury boutique hotel we accepted. We had a glorious experience. Trip consisted of 3 days in New Orleans, first time, with mother-in-law, husband and 13y/o daughter. Had a fabulous time. Treated like royalty. It was a pleasure to return to the hotel every night. Loved the FQB with Jeremy Davenport. The storage space in the bathroom was very limited but we dealt with it fine. The staff was wonderful. Concierge recommended Houmas House tour and we loved it. Got reserved seat for Preservation Hall Jazz for elderly mother-in-law through the concierge. Great experience.", "Date": "June 25, 2005"}, {"Ratings": {"Cleanliness": "5", "Overall": "5.0", "Value": "5", "Service": "5", "Rooms": "5"}, "AuthorLocation": "New Orleans, Louisiana", "Title": "“Worth Every Penny”", "Author": "supremecourt25", "ReviewID": "UR3551342", "Content": "Although I did get a special rate, I would have gladly paid more for the room on the club level - we were allowed an early check-in (1:00), so we were able to hang out at the hotel all afternoon and drink champagne or anything else we desired and eat, eat, eat - all included in the price of the room! The bed was like heaven, the tub was enormous, the products in the bathroom were amazing...a glorious experience from start to finish. I felt like royalty and would go back every weekend if I could afford it!", "Date": "June 14, 2005"}, {"Ratings": {"Cleanliness": "5", "Overall": "5.0", "Value": "5", "Service": "5", "Rooms": "5"}, "AuthorLocation": "Unknown", "Title": "“Best Hotel experience of my life!”", "Author": "A TripAdvisor Member", "ReviewID": "UR3517236", "Content": "This was by far the best hotel experience of my life, not too expensive, our average room was $250 for a 3 day holiday weekend and we were upgraded to club level. THe club level has a lounge with 5 different spreads each day, we had free bagels and fruit in the AM, wine and hours devours in the evening. one of the employees came and asked us if we wanted anything special and we had him get us a few red bulls, no charge. of course we tipped well, but they really treated us well. We had a card with the next days weather forecast on our bed each night, they turned our bed down as well. When I go back to NO, I will no doubt, stay at the Maison orleans again.", "Date": "June 1, 2005"}, {"Ratings": {"Cleanliness": "5", "Overall": "5.0", "Value": "3", "Service": "5", "Rooms": "5"}, "AuthorLocation": "Unknown", "Title": "“Very nice experience”", "Author": "A TripAdvisor Member", "ReviewID": "UR3357977", "Content": "My wife and I stayed here for a second honeymoon in Nov '03. The room was very nice - especially the bathroom. It had marble everywhere, a separate tub & shower, and the tub was huge. Our armoire was in front of the air intake for the AC, so it took quite a while for the room to cool down. Our first night, they forgot to turn down our bed. I called about it and to request different pillows (we don't like down pillows). Within 90 seconds two people were there to take care of it. My wife spent a day at the spa and loved it. Even though it is a bit outside of my budget, I would definitely consider staying here again.", "Date": "April 14, 2005"}, {"Ratings": {"Cleanliness": "2", "Overall": "3.0", "Value": "3", "Service": "3", "Rooms": "4"}, "AuthorLocation": "Unknown", "Title": "“Some aspects good, some not so good”", "Author": "A TripAdvisor Member", "ReviewID": "UR3352617", "Content": "We stayed in Maison Orleans, part of the Ritz Carlton, NO, as part of a business incentive trip. The rooms are nice and well equipped, but, sadly, ours was not as clean as we would expect of a hotel of this standard. Although we found some of the staff to be exceptionally helpful and friendly, others were the exact opposite! The excellent complimentary food and hot and cold beverages served throughout the day in the separate lounge is a really nice touch and certainly saved on room service charges! A disappointment was, on returning from an evening out as a group and wanting a nightcap, the main hotel bar closed quite early (around midnight) which I found rather odd for a hotel of this size.", "Date": "April 12, 2005"}, {"Ratings": {"Cleanliness": "5", "Overall": "5.0", "Value": "5", "Service": "5", "Rooms": "5"}, "AuthorLocation": "Unknown", "Title": "“Absolutely Wonderful!”", "Author": "A TripAdvisor Member", "ReviewID": "UR3296735", "Content": "I LOVE THIS PLACE! I've visited NO two to three times a year in the past five years. I've stayed all over the quarter, and the Maison Orleans is by far the BEST! The staff is so helpful and friendly, and the phrase \"MY PLEASURE\" is sincere here! The Hotel in itself is a treat, the rooms are very cozy and the beds are wonderful! The Spa is a great treat for a tired body!", "Date": "March 23, 2005"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "Unknown", "Title": "“my favorite palce to stay”", "Author": "A TripAdvisor Member", "ReviewID": "UR2795089", "Content": "I really like the rooms and the warm, professional service at the Maison Orleans. I have gotten really good rates here, as well( as low as $199/night). The room was much plusher than the Four Seasons in Las Vegas and in much better condition than The Plaza in NY City. The back entrance into the French Quarter is a nice touch. The front entrance has easy access to the casino and the trolley.", "Date": "October 29, 2004"}], "HotelInfo": {"Name": "Maison Orleans", "HotelURL": "/ShowUserReviews-g60864-d239900-Reviews-Maison_Orleans-New_Orleans_Louisiana.html", "Price": "$385 and up*", "Address": "<address class=\"addressReset\"><span rel=\"v:address\"><span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">904 Iberville Street</span>, <span class=\"locality\"><span property=\"v:locality\">New Orleans</span>, <span property=\"v:region\">LA</span> <span property=\"v:postal-code\">70112-3134</span></span> </span></span></address>", "HotelID": "239900", "ImgURL": "http://media-cdn.tripadvisor.com/media/photo-s/01/ba/16/8b/ritz-king-bedroom.jpg"}}