{"Reviews": [{"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Barrie, ON Canada", "Title": "“Convenient and Clean, great staff!”", "Author": "BigGuyBri", "ReviewID": "UR123197422", "Content": "Stayed at the Best Western for three nights, the room was not overly fancy but it was clean, had all the amenities and met our needs. The bed was comfortable and the in room fridge and microwave were a nice touch. The TV was a little dated and the picture, while watchable was not great. They could update these to newer flatscreens. That really is my only criticism. The complimentary breakfast was okay on my way out the door and I appreciated having coffee and juice available in the lobby around the clock. The best part about the hotel was the staff. Stephen at the fron desk went out of his way to help anytime I needed information. He researched movie times, mall addresses and provided concierge service comparable to that of better hotels I have stayed at. Cannot comment on the pool as we didn't really use it... Looked clean. Would stay again and if you're looking for a convenient spot at a reasonable price I would definately recommend. Close to restaurants, shopping and the Interstate.", "Date": "January 17, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Location": "4", "Rooms": "4"}, "AuthorLocation": "", "Title": "“Decent hotel with nice amenities and close proximity to Greenwood and south Indy.”", "Author": "PJH30", "ReviewID": "UR121451386", "Content": "We stayed here during the night of the Big 10 championship game. We checked in late and got the last room, which resulted in us paying more than I thought the room was worth (150/night). Probably not that expensive normally, just high that night due to demand. The room was fairly nice, having a king bed, whirlpool tub, microwave, fridge, and flat screen tv.", "Date": "December 6, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Benson, North Carolina", "Title": "“Fabulous Visit!”", "Author": "MaryH48955", "ReviewID": "UR120904969", "Content": "Our recent stay at the Best Western Indianapolis South was superb. The rooms were clean and very spacious, the beds were comfortable, the staff was beyond accommodating and the complimentary breakfast was delicious. The staff worked with our group every step of the way to make sure that our kids were well cared for and that our stay was perfect. I would highly recommend this hotel for your next stay in Indy!", "Date": "November 22, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Raleigh, North Carolina", "Title": "“Excellent Stay”", "Author": "Elizabeth R", "ReviewID": "UR120871378", "Content": "Durign my recent stay the staff were incredibly accomodating. The room was spacious and clean with comfortable beds, a nice table for a work space and the in-room refrigerator and microwave came in very handy! The complimentary breakfast was much more than I expected with a wide variety of hot and cold breakfast foods. The location was great with many restauraunts within walking distance and it is a very short trip to downtown and the Lucas Oil Stadium!", "Date": "November 21, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Benson, North Carolina, United States", "Title": "“Great Stay”", "Author": "Angela K", "ReviewID": "UR120671619", "Content": "We were with a large group for 2 nights. The staff were fiendly, accomdating and very helpful. The rooms were very clean. I woudl definitely stay there again. Thank you Best Western Staff!", "Date": "November 16, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Angier, North Carolina, United States", "Title": "“Outstanding Experience”", "Author": "Pamela S", "ReviewID": "UR120662647", "Content": "I recently stayed at the Best Western Indianapolis South and let me start by saying that the staff was exceptional. They went above and beyond to assist my needs and accomodate our travel plans. The hotel was clean, food was wonderful, and most of all there isn't one single comment I can make about the hotel or it's staff that isn't good. I've traveled a lot, and this hotel by far exceeded my expectations of some of the Hilton's that I've had the opportunity to stay at. If I'm ever in the Indianapolis area again, I will be visiting them again.", "Date": "November 16, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Garner, North Carolina", "Title": "“Wonderful stay, fantastic staff!”", "Author": "Ellen S", "ReviewID": "UR120659211", "Content": "My recent stay here could not have been more pleasant. The lobby had a comfortable sitting area with a large TV, the breakfast area was spacious and had everything you could ask for from fresh coffee to a waffle cook station. My room was very clean, had a nice sitting area, fridge and microwave. The bed was quite comfortable with plenty of good pillows and really nice linens. I was travelling with a fairly large group and the hotel staff really went out of their way to accomodate us, from cooking waffles for everyone and contanly restocking the breakfast buffet to cleaning up all our pizza boxes after a dinner in the lobby. I didn't use the pool but did go into the pool area to use the drink machine several times and it smelled like every other indoor pool I've ever used, like chlorine. The hotel itself was very nice but it was really the staff who made our stay so pleasant. I would definitely recommend this hotel to anyone and will stay there again if I return to Indiannapolis.", "Date": "November 16, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Benson, North Carolina", "Title": "“Great stay in Indiana at the Best Western!”", "Author": "Sonya G", "ReviewID": "UR120647734", "Content": "We had a large group of kids and parents stay for 2 nights. The staff were very friendly, and helpful. The facility was clean and would stay here again. Thank you Best Western!", "Date": "November 15, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Lawrenceville, Georgia, United States", "Title": "“A+”", "Author": "Balram M", "ReviewID": "UR120171124", "Content": "The lobby was very welcoming and very clean, which is always a plus! The staff was well trained and extremely helpful for our stay, and recommended us to dine at Texas Roadhouse and even got us a 10% discount! Would definitely come back on my next visit!", "Date": "November 4, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Dallas, Texas", "Title": "“Big Rooms, Huge BEDS!.”", "Author": "J R", "ReviewID": "UR120158713", "Content": "My stay was very pleasant the pool was great with a warm 70 degrees even though it was like 30 degrees in Indy when we stayed. The rooms were huge!! the room we stayed in had 2 KING BEDS! Wow.. Never seen this before. We thoroughly enjoyed our stay will def stay again.", "Date": "November 4, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "5"}, "AuthorLocation": "Cincinnati", "Title": "“Oh my!”", "Author": "Mary B", "ReviewID": "UR119994226", "Content": "Would not recommend! Dark lobby - uninviting! Pool smelled so bad could not walk in - they were spraying stuff in the vents. Feces in hallway upstairs - how on earth did that happen? Lastly, maintenance man, in \"wife beater\" shirt (unprofessional shirt for work attire in my opinion) gave a MASTER key to one of my friends because their room key would not work. Wow - that makes me feel uncomfortable to know you just hand out a master key when a room key doesn't work. After all that, I could not help being creeped out that I was not in a very clean/safe place. Couldn't wait to leave. Husband travels and feels a lot of Best Westerns going down hill. I don't need fancy - just clean and safe. Won't be back!", "Date": "October 31, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "2", "Overall": "3.0", "Value": "2", "Sleep Quality": "3", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Phoenix, Arizona", "Title": "“So-So Experience”", "Author": "Richard A", "ReviewID": "UR119729893", "Content": "During a 3-day stay, the attention we received was just okay and the breakfast bar was disappointing in appearance and taste. The facility seemed dark and the staff, just adequate in giving attention to their its guests. The motel is in an outstanding location, but seems to lack the desire to compete with nearby motels. With more effort and training, management could turn lack-luster experiences into higher quality performance in today's travel needs. Probably would not return.", "Date": "October 25, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "4", "Overall": "1.0", "Value": "1", "Location": "3", "Rooms": "1"}, "AuthorLocation": "", "Title": "“Worst Western. Don't even stay there”", "Author": "Kenmnc1", "ReviewID": "UR117253508", "Content": "I booked my room via Priceline. Requested 1 room 2 beds. Got there had 1bed. Spent 1hour talking with desk clerk who I guess was only one there, but she could not make a management decision. So motel chafed me an extra 15.00 for a stinking day bed. Very very customer experience. Do not stay there ever", "Date": "August 25, 2011"}, {"Ratings": {"Cleanliness": "2", "Sleep Quality": "4", "Overall": "3.0", "Value": "5", "Service": "3"}, "AuthorLocation": "Crown Point, Indiana", "Title": "“Ok but should be better”", "Author": "Hisdaughter7", "ReviewID": "UR116592990", "Content": "I think that this hotel has the potential to be better, the stairway, no elevator, was not clean and did not get cleaned the next day. The buffet was ok, but the counter staff seem to be holding down all positions, Made for a messy and unkept situation around the food, especially if someone needed assistance at the counter. The bed slept good for the price and the LOCATION is excellent.", "Date": "August 12, 2011"}, {"Ratings": {"Cleanliness": "3", "Sleep Quality": "4", "Overall": "2.0", "Value": "3", "Service": "3"}, "AuthorLocation": "Rockford, Illinois", "Title": "“Suitable in a pinch”", "Author": "Shuppetgirl", "ReviewID": "UR115967485", "Content": "The rooms were decent and the hot breakfast was a nice perk with waffles, sausage, biscuits and gravy, among other things available every morning. The manager even let out group rearrange the the tables in the reception area one night to play games. The biggest complaints were the free internet that didn't really work all week, and the pool area. The room must've had a vent for the mechanical room in it, because it reeked of oil and fumes. Also, the pool was so clorinated on of the kids with us had bloodshot eyes after only being in the pool a short time. We wer in Indy when there was several activities going on, so rooms were hard to find. I probably would not stay here again if I could help it.", "Date": "July 29, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "4.0", "Value": "4", "Service": "3"}, "AuthorLocation": "bronx ny", "Title": "“Big rooms, clean affordable. Don't reserve becaus eof the pool!”", "Author": "wearetheones", "ReviewID": "UR115466323", "Content": "Very big, clean room with confortable beds. Breakfast with some hot items. The pool area is a big no no! so if your really in need of the pool this is not the pool you want! I reserve here because of the pool as i have two young kids but they don't have any ventilation or air conditioning there so the pool are was about 97 degrees when we went in. It seems like they most have some exhaust pipes because I can't understand how is it so hot! I couldn't breath in there! The pool could use a bit of help, some paint and the water wasn't clear at all. Like I say good hotel very clean big rooms but just don't take in consideration the pool area. Besides from that no complains we really had no issues in the rooms itself.", "Date": "July 17, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "3.0", "Value": "5", "Service": "3"}, "AuthorLocation": "Northwest, Indiana", "Title": "“It was just alright.”", "Author": "alexaaaaa", "ReviewID": "UR114418878", "Content": "Came to Indianapolis for a concert downtime. Decided to stay away from ridiculous hotel prices there and stay somewhere on the outskirts of town. Stayed in the whirlpool suite which was less expensive than any basic room down town. However, the whirlpool drain was not fully functioning posing a bit of a problem for use. That was highly annoying but did not make a point to complain about it to the staff because of the small amount of time we actually spent in the room. Otherwise it was clean and comfortable. The guest book stated many TV channels, but when we turned on the TV there was probably about a 1/3 of what was listed. Did not use the pool or eat breakfast so cannot comment on that. Not a bad place to stay, even though the outside may look a bit run down.", "Date": "June 19, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "New Haven, Indiana", "Title": "“Second Chance”", "Author": "kountrygirlnthecity", "ReviewID": "UR112726170", "Content": "In the summer of 2010 we stayed at a Best Western in Grand Haven MI and our experience there was NOT a good one! We ended up with a gift card and decided to give Best Western a Second Chance when it came time for our 1st grandchildto be born. Our experience at Best Western Indianapolis South was quite enjoyable. The staff was very helpful and everything was to our satisfaction. Thank You for such an enjoyable stay.", "Date": "June 11, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "4.0", "Value": "4", "Service": "5"}, "AuthorLocation": "PA", "Title": "“Clean, comfortable, convenient”", "Author": "isilwath", "ReviewID": "UR112388891", "Content": "Traveling with family on our way from PA to Topeka for a wedding, the Crossroads BW was unavailable so we decided to try this location as an overnight point. The room was clean, the front desk clerk was friendly, and the full breakfast was good. My only complaints were there is no elevator and the wireless internet was a bit slow.", "Date": "June 9, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Lafayette, IN, USA", "Title": "“An excellent value and superior stay”", "Author": "LKHS08", "ReviewID": "UR102052753", "Content": "My husband and I were visiting Indy to attend a weekend seminar. Due to gas prices, we decided it made more sense to stay in Indy instead of driving back home and then turning around and driving back to Indy the next morning. I found this property on Priceline. All together including taxes, I think I paid under $70. What a value! The property itself might be a little tired, but this place is really nice overall. The room (King size) was huge and a really useful table and chair set. The bed was great and really comfy. The location is really nice for travelers with all kinds of shopping and food choices right around the corner. The best part was that a nice hot breakfast was served in the morning. Now the breakfast isn't the best one you'll ever eat, but it was hot, tasted pretty good and there were plenty of items to choose from. Overall, I was very pleased with my visit and would come back.", "Date": "March 29, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Scottsville, Kentucky", "Title": "“They know how to run a hotel.”", "Author": "Danny777_777_10", "ReviewID": "UR87203495", "Content": "It was late at night and we were tired and did not look forward to taking time to fill out forms at check-in. As soon as I gave the desk clerk my name, he already had my room keys ready for me. I showed him ID, credit card, and that was all the check-in process, wow, and we went straight to our room. Room was very nice, clean, and everything that we needed was there. The wireless internet was easy to get on, quickly checked e-mail and on to a very comfortable bed for the balance of the night. We had a good complimentary breakfast the next morning and then on our way. Sure wish we could have stayed there longer. Thanks for making our short stay very enjoyable.", "Date": "November 15, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "charleston, il", "Title": "“Great Hotel”", "Author": "whitestang64", "ReviewID": "UR80452192", "Content": "This hotel has a great breakfast, sausage, biscuits & gravy, scrambled eggs & waffles. Our King room was wonderful, very clean & very spacious. Would recommend this hotel very highly,", "Date": "September 21, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Middleburg, PA", "Title": "“Highly recommend this hotel”", "Author": "alba83", "ReviewID": "UR79550194", "Content": "Our trip wasn't really business or leisure - but we were very pleased with our hotel accomodations - it was clean, quiet and comfortable. We spent 8 nights here & we slept very well - there were restaurants within walking distance as well.", "Date": "September 14, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "2", "Overall": "1.0", "Value": "1", "Sleep Quality": "2", "Rooms": "2", "Location": "2"}, "AuthorLocation": "Nashville, Tennessee", "Title": "“Poor Customer service and bad billing practices”", "Author": "jwhust", "ReviewID": "UR79275036", "Content": "We made reservations for two nights, upon arrival we stated that we would only need the room for one night, the receptionist stated it would not be a problem. We left the next day and receive a bill for two nights, we called and questioned the charges, they stated the reservations could not be changed.(I was not informed of this during checkin) I called customer server many times and even drove back to the hotel to dispute the charges.", "Date": "September 12, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Minnesota", "Title": "“Outside is deceiving; clean, comfortable, good place to stay”", "Author": "zookeypurr4", "ReviewID": "UR71280544", "Content": "This was our first stop on a week long business trip. When we pulled up out front our initial reaction was \"oh oh\" it was plain and looked from the outside like it could be disappointing. Very plain, all white with blue, most new hotels have shall we say modern colors and landscaping. We asked to see our room first and the room was clean, comfortable and nice. It turned out to be the best night sleep we would get in the next 4 nights! Breakfast was good and plenty of variety. Good hotel, worth the money and clean, comfy and quiet!", "Date": "July 17, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "2", "Sleep Quality": "5", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Kansas City", "Title": "“Expensive for the Hotel's Quality”", "Author": "courtcro", "ReviewID": "UR60739084", "Content": "I stayed at this hotel with my volleyball team while we were in town for a tournament. Sure, it was a decent Best Western, but our room rates were ridiculous for the quality of the hotel. Basically we could have stayed at at least a Marriott Courtyard for what we paid. There were no elevators, and the continental breakfast was pretty minimal. Desk staff was kind, yet unprofessional. The \"business center\" was a computer in the same room as the couches and tv. It looked like a small family room was set right in the middle of the lobby, which is homey, I guess. The rooms did have a microwave and refrigerator, as well as quite a bit of space. The tv's were dated, but the rooms were probably the best part of the hotel! Also, there were a lot of restaurants around the hotel if one wanted to go get a quit bite to eat.", "Date": "April 8, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "phoenix", "Title": "“Great place to stay”", "Author": "123trvelforu", "ReviewID": "UR59934947", "Content": "I was traveling with my colleague from work. We were pleased with the service of the staff and cleanliness in the rooms. Although the lobby does not look attractive rooms were great with comfortable mattress and they really clean the property well. Will return with family if I would travel back with family to Indy. Great location within walking distance to a lot of restaurants.", "Date": "March 30, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Ohio", "Title": "“Nice accommodations for a great price!”", "Author": "retiredandlovingit07", "ReviewID": "UR52046935", "Content": "We spent one night after spending the day visiting hot spots in Indy. This hotel has great street appeal and is in a safe and handy location. There is a pool. The rooms are standard Best Western fare. Very clean with comfy beds. The breakfast bar had offerings to appeal to many. The employees were extremely helpful. This is AAA recommended and I can see why.", "Date": "December 28, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Business service (e.g., internet access)": "4", "Check in / front desk": "3", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Ohio", "Title": "“Comfortable beds”", "Author": "OhioTim7", "ReviewID": "UR17797588", "Content": "The beds have been recently upgraded and are very comfortable. I also appreciated the large shower head that had full pressure, what a great shower. Other hotels have gone to these type of shower heads, but the restrictor limits the water pressure, but this one was the best yet! Friendly staff too. Tim", "Date": "July 11, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Harrisburg,Pa.", "Title": "“TERRIFIC TERRIFIC TERIFFIC”", "Author": "DWingRider", "ReviewID": "UR16805952", "Content": "My buddy and I had just rode 600 miles on our motorcycles to attend the Indy 500. On arrival at the Best Western we were greeted by a very hospitable staff at check-in. We were really impressed when they suggested we leave our motorcycles along the curb under the canopy to protect them from a light rain in the area. The room was very clean and comfortable. Oh...did I mention that we and the other guests staying there were given a PIZZA PARTY the night before the race. What a pleasant surprise. And even in the mornings...we were greeted in the lobby with HOT breakfast items along with the usual continental items. I reccommend this lovely place to anyone traveling through the area. Doug & Bob Harrisburg, Pa.", "Date": "June 9, 2008"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Check in / front desk": "2", "Overall": "1.0", "Value": "1", "Rooms": "1", "Location": "2"}, "AuthorLocation": "Bedford, IN", "Title": "“NASTY!”", "Author": "nattyjo", "ReviewID": "UR13619071", "Content": "Our room was about 100 degrees when we checked in, and it smelled SO bad. Our room was SO saturated with cigarette smoke it was disgusting.....the beds smelled of smoke, the towels in the bathroom smelled, the kleenexs smelled , the bathroom sink has burn marks all over it....and the worst was when the shower curtain got wet it stunk so bad of smoke. And the second night we didn't get in until late and the whole second floor smelled of marijuana and incense....we left, we didn't even stay the second night. It was a nasty hotel with rude front desk employees....the only thing nice I can say is the bagels for breakfast were ok. If you don't have to stay here....DON'T! It's NASTY!", "Date": "February 17, 2008"}, {"Ratings": {"Overall": "1.0"}, "AuthorLocation": "Harrington, DE", "Title": "“The perfect example of a sub-standard hotel.”", "Author": "A TripAdvisor Member", "ReviewID": "UR3846889", "Content": "In Dec. 2004 I made reservations at this hotel for two nights, Aug. 6th and 7th, 2005, using my VISA card to guarantee.I made them eight months in advance because this was NASCAR race weekend inIndy. In late July I called to confirm these reservations. I was told the reservations were in order and was asked if I had a new expiration date as the one on my VISA had expired in 06/05. I gave her the new expiration date of 06/08 on the same card. We arrived at the hotel just before 7:00PM only to be told by management that our reservations were no longer valid because of the expired expiration date on our VISA card. My husband and I both tried to explain that one of his staff was given the new expiration date in July but he became rude, harrassing, and in effect called us liars. We were admonished because they had tried to call us that afternoon and we were not at home. We live 650 miles from Indy and did he really expect us to be home the very afternoon we were to arrive in Indy? Also, he admonished us for not having an answering machine so he could leave a message! Well, duh!, no we do not have an answering machine per se but we do have voice mail! Checked our voice mail later and sure enough, he had left a message. We were told he had one room left and we could have it at \"walk-in rates\" which naturally was more expensive then the cost quoted to me when I made the reservations. He told us \"to take it or leave it!\" Having no other choice at that time of night we took it. The room was less then minimally clean, wall paper border was hanging off the wall, the shower curtain was hanging on about half of the rod hooks, some of the furniture had a sticky substance on it, and much dirt was accumulated behind the bathroom door. To summarize, we have never come close to being treated this shabbily by anyone, much less a business for whose services we are paying. As far as we're concerned BEST WESTERN does not exist in this world.", "Date": "September 6, 2005"}], "HotelInfo": {"Name": "BEST WESTERN Indianapolis South", "HotelURL": "/ShowUserReviews-g37209-d240134-Reviews-BEST_WESTERN_Indianapolis_South-Indianapolis_Indiana.html", "Price": "$74 - $107*", "Address": "<address> <span rel=\"v:address\"> <span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">4450 Southport Crossing Dr.</span>, <span class=\"locality\"><span property=\"v:locality\">Indianapolis</span>, <span property=\"v:region\">IN</span> <span property=\"v:postal-code\">46237-3697</span></span> </span> </span> </address>", "HotelID": "240134", "ImgURL": "http://media-cdn.tripadvisor.com/media/ProviderThumbnails/dirs/84/01/840191535231d9cc7e6e99e75e5753ff3large.jpg"}}