{"Reviews": [{"Ratings": {"Service": "5", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "5"}, "AuthorLocation": "connersville indiana", "Title": "“NASTY”", "Author": "rita_adams", "ReviewID": "UR121953218", "Content": "we stayed in room 222 at the econo off of lynhurst and there was urine behind the toilet, stains of a conspicuous nature EVERYWHERE! glad i didnt have a black light! gum behind the phone. cleaning staff should be fired! The front desk staff were very very nice and attentive. TV didnt work, well the remote didnt. fan in the bathroom kept stickin and squeeling, exposed light bulb, 60 watt, right above the bathtub, big holes in the curtains. what a pleasant stay for 56 bucks, should have stayed in my truck!!! stay was on dec 17 to 18 2011", "Date": "December 21, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "3"}, "AuthorLocation": "Dumfries, Virginia", "Title": "“Listen to all comments below !!!”", "Author": "jvf01", "ReviewID": "UR108326498", "Content": "Stay in your car, changed rooms, bugs... etc... etc... i blew off all these comments before i booked a room at this hell hold. I figured, since i was going to spend most of my time at the hospital, all i needed was a place to lay my head, and shower. So i check in, first room tv. didnt work. They gave me another room. Showered after my long trip and went to the Hospital. Came back well after midnight. to find the maid took all my towels and did not replace any of them. then i noticed i was missing a few things that i have left out. Of course i had to check my bag, and was missing a few things that were in my bag, plus my deoderent! Who Steals someone elses deoderent...Manager didnt seem to care.Luckly i didnt leave money or any valuables there...Yes i Notified the Manager, he didnt seem to care. I should have called the police. but i wanted away from that place.", "Date": "May 15, 2011"}, {"Ratings": {"Overall": "3.0"}, "AuthorLocation": "Munich", "Title": "“You get what you pay - not much”", "Author": "costablankoscheck", "ReviewID": "UR66223797", "Content": "Stayed there in April for one night to be on a cheap place \"close\" to the airport. Had an early flight to catch on Monday morning, so I pre-ordered a shuttle-service. Not very cheap that. The room itself was like thousands of other Motels throughout the country. Simple with 2 beds, TV, bathroom (clean) and a very bad WiFi - nearly no connection. After all, it was ok for a few hours, but sure you shouldn´t spend there more than one night because there is nothing to see and do around except the highway and the airport, which is still 10-15 min away. Maybe again, maybe not .... don´t really know.", "Date": "June 2, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "2", "Overall": "1.0", "Value": "1", "Location": "3", "Rooms": "1"}, "AuthorLocation": "Waco, TX", "Title": "“The worst customer service you've ever experienced”", "Author": "Ipsissisma", "ReviewID": "UR38145816", "Content": "Staying here was a complete nightmare. I was in five rooms in two days, and in none of them did the wi-fi work properly. Keys repeatedly failed to function. Receptionist was rude, intransigent, and obviously not bright enough for her job. Manager was far worse: belligerent and attempted to brow-beat me into admitting that I didn't know how to use wi-fi or that my computer wasn't up to the task. Rooms smelled of other people's sweat (bad) or feet (worse). Certainly the worst customer service I have ever experienced outside of Europe. Manager really needs to go back to hotel school.", "Date": "August 19, 2009"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Business service (e.g., internet access)": "1", "Check in / front desk": "1", "Overall": "1.0", "Value": "1", "Rooms": "1", "Location": "3"}, "AuthorLocation": "California", "Title": "“Sleep In The Car”", "Author": "ocshannon", "ReviewID": "UR21205434", "Content": "This was the worst hotel experience I have ever had, hands down. All three of our hotel rooms were so dirty that we actually went and purchased clorox wipes, pillows, blankets and febreze to eaze our minds. We found blood stains on the walls and curly icky hairs in the sheets. The phone looked like someone threw it against the wall and the advertised free internet never worked. The night staff was TERRIBLE - and had no idea how what they were doing. When we returned (begrudginly) at the end of each day (3 total) our room was NEVER once cleaned. Each night we would have to go to the office and get towels...we were, and I repeat, NEVER CLEANED ONE TIME DURING OUR STAY - EVEN UPON REQUEST!!!!! We had read the reviews prior to staying here and they weren't good. We couldn't find a room anywhere in town (funny that there were plenty of rooms here huh?)!! We decided to give the hotel the benefit of the doubt...and thought 'how bad could it really be?' --- trust me folks....it might be cheap, but you would be better off sleeping in the car. Run....and run fast, away from this hotel.", "Date": "October 25, 2008"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Check in / front desk": "3", "Overall": "1.0", "Value": "1", "Rooms": "1", "Location": "5"}, "AuthorLocation": "Prospect, Kentucky", "Title": "“If you like bugs and....”", "Author": "VanessaL", "ReviewID": "UR18966736", "Content": "This location is just outside the gates of Indy's International Airport, which is why we stayed, we had an early AM flight. We arrived around 10:30PM. The minute we checked in the room I knew we were in trouble. It wreaked of cigarette smoke, even though it was labeled \"no smoking\". Our bathroom lights didn't work at all and a call to the front desk to find out if we needed to switch rooms came back with, \"Someone would be right there.\" Thirty minutes later when we were trying to get ready for bed I had to call the front desk to find out why our lights weren't being fixed. At that time I was advised that he needed to wait for the 11PM person to come in and THEN he could come check the lights. It would have been nice to know that thirty minutes prior. We had to get up at 5AM so this was starting to get late. Come to find out, the only thing wrong was a flipped breaker that was fixed in about 2 seconds. Now, around 11:10 or so I stepped into the bathroom and saw the ants devouring a dead cricket--really yucky!! In addition to the unidentifiable brown liquid stain on the bathroom wall. REALLY YUCK!! Rusty showerhead and walls. Torn bedspread and sheets. Given that by the time we'd discovered all this it was close to 11:30PM we just decided to get what little sleep we could and know not to stay there again. Wrong!! Teenagers yelled up and down the breezeways virtually all night. In addition, the airconditioner sounded like a semi truck firing up when the compressor would turn on. OK, so I've never had a horrible experience like this before and I hope never to repeat it. You can see our pictures and judge for yourself if you ever want to stay here. Not us--ever again!!!! Sometimes, you get exactly what you pay for with a $44 room. In this case, they should have paid US to stay there!!", "Date": "August 14, 2008"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Business service (e.g., internet access)": "1", "Check in / front desk": "2", "Overall": "1.0", "Value": "1", "Rooms": "1", "Location": "3"}, "AuthorLocation": "Ohio", "Title": "“Horrible”", "Author": "gpw0507", "ReviewID": "UR18156898", "Content": "Absolutely horrible. Staff was rude, our sheets were dirty (they had crumbs in them), and our tv wasn't working correctly. We had a non-smoking room and when we walked in it smelled like smoke. Heard other hotel guests most of the night. Continental breakfast was ok. Very glad we didn't stay more than one night!", "Date": "July 22, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Elizabeth City, NC", "Title": "“Plesantly suprised”", "Author": "thecressmans", "ReviewID": "UR6122115", "Content": "I booked this motel online at Motel6. I was visiting Indianapolis for a wedding and have never traveled there before. I drove in so I'm not sure how the shuttles at the airport work, but I know it is very close. There was another special event in town, and my budget was very small for this trip. Most motels in the area were around $100/night, Motel 6 was $46/night. When I arrived I was expecting the worst, and was suprised to find that the staff was very friendly and the motel was very clean. There is a large interstate running by the front of the motel, however we really didn't hear the traffic and had no problems sleeping. They do have a pool that looked inviting, however we didn't take advantage since it was rather cool while we were there. There is a Denny's adjoining the parking lot and most other restaurants are a short drive away. We had absolutely no problems there and would definately stay there again anytime. Great value for the money.", "Date": "November 13, 2006"}], "HotelInfo": {"Name": "Econo Lodge Indianapolis", "HotelURL": "/ShowUserReviews-g37209-d240185-Reviews-Econo_Lodge_Indianapolis-Indianapolis_Indiana.html", "Price": "$54 - $64*", "Address": "<address> <span rel=\"v:address\"> <span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">5241 West Bradbury Avenue</span>, <span class=\"locality\"><span property=\"v:locality\">Indianapolis</span>, <span property=\"v:region\">IN</span> <span property=\"v:postal-code\">46241</span></span> (Formerly Motel 6 and Sunshine Lodge)</span> </span> </address>", "HotelID": "240185", "ImgURL": "http://media-cdn.tripadvisor.com/media/ProviderThumbnails/dirs/b9/71/b9714e439db5626952afd9d9f9b507573large.jpg"}}