{"Reviews": [{"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Ft Mohave, Az", "Title": "“Another Great Stay at LaQuinta”", "Author": "Posted by a La Quinta traveler", "ReviewID": "UR126947762", "Content": "We have stayed at this Motel on several occasions and still have the best service.employees, and the breakfast is fantastic...Please, staff keep up the good work and you will be # 1 always in our book..", "Date": "March 30, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "3"}, "AuthorLocation": "Little Rock, Arkansas", "Title": "“Great place to stay close to Nellis AFB”", "Author": "Tim7734", "ReviewID": "UR126608457", "Content": "We stayed at the La Quinta Inn close to Nellis AFB for a week during March 2012. The rooms were very clean, great mattress and bedding, microwave/ref and the room entrances are inside for better security. They also have an indoor pool and a great complimentary breakfast bar with biscuits and gravy, waffles, cereals, and fruit....which they check and restock every 20-minutes so nobody goes hungry for breakfast! We had a little trouble with the internet, but when we told the manager, Rosalie; she quickly had it fixed and followed up with us that morning and the next day to ensure we had no other issues with it. All this for a very, very low price. Our weeks stay was only $20 more that our weekly car rental cost!", "Date": "March 24, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "3"}, "AuthorLocation": "Dunedin, New Zealand", "Title": "“Great value”", "Author": "Bill1941", "ReviewID": "UR125573793", "Content": "Very comfortable and clean room and an excellent mattress. Room was very quiet and we were not disturbed by other guests or outside noise. Staff were very friendly. Great range of items for breakfast. The hotel is great value for money.", "Date": "March 3, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "4", "Rooms": "5", "Location": "3"}, "AuthorLocation": "Saint Joseph, Michigan, United States", "Title": "“One of the nicest hotels we've stayed at”", "Author": "Otto M", "ReviewID": "UR125501523", "Content": "Large and comfortable room, 1 acre bed, fluffy towels and large shower heads. Very clean, too. The layout of the room, while not a suite, is such that one person can use the bathroom and sink area without bothering a sleeping spouse.", "Date": "March 2, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Topeka, Kansas", "Title": "“GREAT Place and helpful and friendly staff!!!”", "Author": "Donna S", "ReviewID": "UR125105539", "Content": "This was our second stay and we were not disappointed. We stayed for eight days and there is not one negative thing I can say about this fine hotel. It is a nice location to go to the strip,downtown to Freemont Street,or shopping and then stay here to get away from the hustle and bustle. Everyone is so friendly and nice (especially Rosalie!) and everything is super clean. The breakfast in the morning is very nice and everything is presented in a nice way and once again everything is very clean and the ladies who keep up with things are so nice too! Enjoyed the pool too! We highly recommend a stay here,we will definitely stay here whenever in town.", "Date": "February 23, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "4", "Rooms": "5"}, "AuthorLocation": "", "Title": "“Best family vacation ever!”", "Author": "vanessamichael", "ReviewID": "UR125091842", "Content": "Our family vacation was awesome thanks to the friendly and courteous staff!!! Rosalee and Jeff were amazing and so helpful. My five kids had a blast and so did my husband and I. Job well done La Quinta!", "Date": "February 23, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Orange, California", "Title": "“Comfortable Stay”", "Author": "GreenMan305", "ReviewID": "UR124977622", "Content": "Business travels had brought me to north Las Vegas. I chose this hotel as they had a great deal on line. I was not dissapointed. This is a very clean hotel and the staff here are very friendly. Rosalie had checked me in and gave me some area information and restaurant recommendations. When I got to the room I was surprised in how nicely they were decorated. I had a great nights sleep, the beds are comfortable and this is a quite hotel.I had trouble logging on to the wifi so I called the help desk and after they made me change a setting on my laptop I was good to go. I was amazed at the speed of the free wireless internet service. They serve a great complimentary breakfast too. Will definitely stay again.", "Date": "February 21, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "El Paso", "Title": "“Modern Nice Clean Rooms.”", "Author": "TXbigcheese", "ReviewID": "UR124823508", "Content": "I stayed here as I was attending the Las Vegas Motor Speedway. This is a beautiful hotel with extremely friendly service. The rooms are clean and the beds are comfortable and there are no shortage of pillows in the rooms. The internet was free and super-fast. They have a delicious breakfast with freshly made hot waffles which is also free. I was pleasantly surprised when I used the fitness room as they had free weights which is rare for hotel gym's.", "Date": "February 19, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "2.0", "Value": "3", "Sleep Quality": "4", "Rooms": "3", "Location": "1"}, "AuthorLocation": "san francisco", "Title": "“good rooms - raunchy parking lot”", "Author": "musashiSanFrancisco", "ReviewID": "UR123191087", "Content": "Basic but clean room. Good helpful desk staff. Back of Parking lot used as a gang gathering spot for a scary group of young loud foul mouthed drunken guys. We were here as a quick overnight on our way to Zion but I would have been terrified if I had driven here alone.", "Date": "January 17, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "San Diego, Calif.", "Title": "“\"Sleep like you are on a Cloud and treated like a Queen\"”", "Author": "texasginia44", "ReviewID": "UR122694778", "Content": "I Love my 11 Night's stay at the La Quinta Inn Nellis in Las Vegas, Nevada the Food was great and hot and the stuff was very nice and friendly and the Manager Ms. Rosalie was nice and with a big smile when she check me in and out of the Hotel. The room were clean and nice I love the smell. I also like how close the Wal- Mart and other food places were to walk too with my bad knee's. I just Love the Place looking foward to return again soon for a nice rest and Peace of Mind and friendly faces and smile's. make me feel Welcome and I am sure you will feel the same way when you visit La Quinta Nellis in Las Vegas, Nevada. You will Love the peaceful sleep there and warm smile's.", "Date": "January 7, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Sleep Quality": "4", "Rooms": "4", "Location": "1"}, "AuthorLocation": "Pacific Northwest", "Title": "“Nice La Quinta but feels like San Quentin”", "Author": "twowolf", "ReviewID": "UR121558265", "Content": "Nice hotel, nice rooms but property has huge security fence, lots of security cameras and a security guard that monitors the property at night (to include watching all guests as they come and go). Sorry - don't like staying in neighborhoods that require this type of security.", "Date": "December 9, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Las Vegas, Nevada", "Title": "“Extended stay while waiting for closing on short sale”", "Author": "Umaandlilah B", "ReviewID": "UR120350941", "Content": "My wife and I stayed at the N. Nellis Blvd. La Quinta for 16 days while waiting for our house to close in North Las Vegas. We chose this hotel due to location and it was pet friendly. The manager, Rosalie, made us feel welcome from the moment we checked in. Her warm personality was very refreshing. The entire staff were cheerful which was a reflection of their manager. We would highly recommend this hotel.", "Date": "November 8, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Sparks, Nevada, United States", "Title": "“Best, Friendlest, Cleaniest & Quietest”", "Author": "Richard Z", "ReviewID": "UR120213798", "Content": "I made phone reservations & was given a price. I was also told that all La Quinta's were dog friendly & they were. This one had a dog rest area out the back door with cleanup bags and a waste can....very nice!!! The thing that I saw was wrong was that people don't clean up after their dogs!!! THAT IS WHY HOTELS WANT TO CHARGE MORE FOR BRINGING DOGS \"CLEAN UP AFTER YOUR DOGS''!!! The staff was very helpful, always there & frIendly. When we were ready to check out thay came to the room & checked the room for any damage that may have been done by our dog, so we would not get a supprise damage charge on our credit card. Also, they signed our bill stating there was no damage . Breakfast was very good with a nice variety of breakfast foods. A very enjoyable stay!!", "Date": "November 5, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Las Vegas, Nevada", "Title": "“The best of the best”", "Author": "Lee Q", "ReviewID": "UR119713519", "Content": "First I arrived at least an hour before check in time. I have arrived with a cat, we are both tired and hot and really needed a room. The young ladies at the desk called housekeeping to see if they could find me a pet room. They did, first floor. Beautiful room. So if you have pets, they are wonderful and understanding. Tired and need a room, this is your place. Not only that, I was moving here, after the first day I found an apartment, and now I needed to get stuff for it. The young lady told me there was a super Walmart store just next door. Any questions I had, I simply went to the front desk, told them my problem and they had either the answer to my problem or knew where I should go to find it.", "Date": "October 25, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Salt Lake City, Utah", "Title": "“Great place to stay!”", "Author": "Ken N", "ReviewID": "UR119008986", "Content": "This hotel is so great on my business trips that I have stayed here on my personal trips too. It is my first and only choice when I'm in the Las Vegas area. The staff is always great. They remember me by name and by sight and always take great care of me. The same for when I travel on non business. I do like the fact that it is off the strip far enough to not get me lost in the traffic. I recommend LQ highly!", "Date": "October 6, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "San Diego, California, United States", "Title": "“Stay”", "Author": "Graciela L", "ReviewID": "UR118831555", "Content": "It was very nice and fun to be @ this hotel. Very hospitable and nice staff who catered to our every need. A+", "Date": "October 1, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Salt Lake City, Utah", "Title": "“Great hotel and excellent staff!!!”", "Author": "Craig S", "ReviewID": "UR118462077", "Content": "Room are very clean, nice comfortable bed and nice to have coffee maker, refrigerator and microwave in the room. Very quite, comfortable to sleep after long drive and everytime I stay here I feel secure. Front Desk are very nice and friendly you always see smile on their faces which make me like staying here.", "Date": "September 22, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "4", "Overall": "4.0", "Value": "5", "Service": "4"}, "AuthorLocation": "Montreal, Canada", "Title": "“Very good for the price but a bit far”", "Author": "Dany t", "ReviewID": "UR117360181", "Content": "Nothing to complain about, everything was clean, the bed was nice, no bad smells and very cheap for what you get. I would recommand to anybody who doesn't want a casino in their hotel. Only bad thing, a bit far from the strip.", "Date": "August 28, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Salt Lake City, Utah", "Title": "“Loved it and will be back!”", "Author": "Salsacm", "ReviewID": "UR115878767", "Content": "had a great experience at La Quinta, the front desk acted very professional and worked with me in my stay and even gave me a great deal. They even went out of their way to give me detail directions to my next stop in Nevada. Free internet and breakfast are a great plus. The hotel is conveniently located five minutes away from the freeway and not too far from the Strip. I definetely recommend this hotel and will be back! thank you guys!", "Date": "July 28, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "ostrander, Mn", "Title": "“I drive pilot car for oversize loads. We stay everytime we come to town.”", "Author": "MollySostrander_Mn", "ReviewID": "UR115851429", "Content": "Nicest - checkin host/hostess'. And cleaning staff are the best. All are there to help when needed. Thanks, to this LaQuinta Inn, because we arei - in motels 90% of the year, its like a home away from home...", "Date": "July 27, 2011"}, {"Ratings": {"Cleanliness": "1", "Sleep Quality": "1", "Overall": "1.0", "Value": "1", "Service": "1"}, "AuthorLocation": "Arizona", "Title": "“Unacceptable room, unsafe hotel, clerk on drugs.”", "Author": "female_traveler_30", "ReviewID": "UR115469864", "Content": "I arrived around 9:30 pm to find multiple shady characters milling about in the parking lot. I went inside and the clerk was clearly on drugs, after a ridiculous conversation with her she informed me that the only room available was directly next to the breakfast area. With visions of screaming children dining at 6 am in my head I politely refused the room. She informed me I could not have a refund because I booked with Expedia, I told her I did not care and just wanted to check out. She informed me I could not check out. I went outside to call Expedia. I went back in within 10 minutes and she didn't recognize me or have any idea what I was talking about, claiming that she had never checked me in. At this point I just left and got a room at the Holiday Inn Express, which was also terrible. Don't bother staying here, even if you get a quiet room location the hotel is in a bad neighborhood and in my opinion is unsafe, especially for female travelers and/or families.", "Date": "July 18, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Twentynine Palms, California", "Title": "“Good Job, my Hat is Off to these folks”", "Author": "ROBW18", "ReviewID": "UR114621797", "Content": "Sometimes just getting everything right is overlooked. Everyone on staff at the La Quinta Inn outside the Nellis Air Force Base was polite, professional and timely. I got the impression, though, that these people did this every day. So, while I did not get a room with an indoor spa, I did get a clean room, where everything worked and all the staff were friendly and professional.", "Date": "June 21, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Corona, California", "Title": "“home away from home”", "Author": "HarrisA", "ReviewID": "UR112276997", "Content": "I stay at La Quinta, Nellis every month. The hotel is very clean, quiet and comfortable. The staff provides an exceptional service. Rosalie the general manager is truly remarkable. Each morning there is a free breakfast, and their gym is very good as well. They have free weights which is not very common in hotel gyms. I will continue to stay here every month I'm in Las Vegas. Definitely recommend this hotel to all travelers.", "Date": "June 8, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "West Jordan, Utah", "Title": "“great value and friendly”", "Author": "mikeallen8", "ReviewID": "UR111907368", "Content": "I am a regular to this Hotel, my company puts me up here 2-3 times per week. I always have a clean, comfortable room. The beds are very comfortable pillow tops. This Hotel is very quiet, even during the day, which is important to me since I am a truck driver who needs his rest. The best part of this Hotel is the staff, from the Manager, Desk Clerks, Maintenance Man and the Housekeepers. They are very professional, friendly and accomidating when you need something.", "Date": "June 6, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "3"}, "AuthorLocation": "Coarsegold, CA", "Title": "“A GREAT HOTEL!”", "Author": "Msmbutterfly", "ReviewID": "UR109380598", "Content": "We were traveling to Colorado to a family event and stayed one night at this hotel. We liked it so much we stayed on our return trip as well. Myra, Rosalie and Barbara were just the best! I felt like I had three new friends! It was \"hassle free\" taking our little dogs, too. They accomodated us by putting us in a room near an exit which was perfect. The room was so clean, the bathroom sparkling clean and The area was a bit \"strange\" but never felt \"unsafe\" for a minute. And it's right next door to a Walmart Super Store! Thanks to everyone there for 2 really pleasant stays. :-)", "Date": "May 22, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Fort Polk, Louisiana", "Title": "“Great Hotel with friendly and helpful staff.”", "Author": "jkh13", "ReviewID": "UR105260791", "Content": "Stayed in this hotel for two weeks while conducting business at Nellis AFB, which was less about a mile away. Upon check-in the clerk at the desk asked us if we wanted to register with La Quinta's points system due to our long stay, which has resulted in being able to get a free room. Later in the week that same clerk referred us with several places to eat, and even gave us some of her personal coupons for dinner. There is a fitness center, but it was very lacking. There were a couple of weights and two treadmills, one of which wasn't working. They moved in a stairmaster to replace this one while we were there. Free Continental Breakfast every morning. Biscuits & Gravy, waffles, toast, yogurt, fruit, cereal, etc. The neighborhood, we were informed, wasn't the best (this information came from some of our colleagues on the nearby Air Force Base). But we had no problems at all during our stay and felt secure the entire time. Overall the the stay was great. The highlight was the staff; always friendly and helpful, knew who we were when we passed through the lobby.", "Date": "April 24, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "2.0", "Value": "2", "Sleep Quality": "3", "Rooms": "3", "Location": "1"}, "AuthorLocation": "Calgary", "Title": "“Too close to Nellis Air Force Base”", "Author": "fernmonca", "ReviewID": "UR103951505", "Content": "In case you do not know Nellis is an Air Force Base just outside of Las Vegas. So there is nothing and I mean nothing close by. No restaurants - unless you are prepared to go eat at Walmart next door. And of course you have to deal with the airplanes taking off next door.... We has a king bed suite which was extremely poorly designed and not that comfortable. Their idea of \"full breakfast\" is cold hard boiled eggs and no sausage or bacon. So we opted for the special at IHOP which is close by. Not the quality we are used to with La Quinta.", "Date": "April 13, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "3"}, "AuthorLocation": "Arizona", "Title": "“Great hotel, Great Staff”", "Author": "snarkaz", "ReviewID": "UR103330685", "Content": "When you travel to Las vegas every other week the strip can get alittle old. So if you looking for Clean,Quite, place to stay the La Quinta at Nellis is for you. The staff (Rosalee,Maria, Jeff, Barbra, and Jasmine ) make you feel welcome, rooms are well maintained , and very clean. The highspeed internet could be better but it's ok. Breakfast is presented very well and plent of it. The area is not fancy but secure. And if you have that yen to head to the strip it's only 10 min driver. There is also tractor trailer parking in the Walmart Parking lot next door. Oh one other thing the hotel is next to Nellis Air force Base and our nations best can be a little loud sometimes.", "Date": "April 8, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "5", "Sleep Quality": "5", "Rooms": "3", "Location": "1"}, "AuthorLocation": "Salt Lake City, Utah", "Title": "“Cheap but clean and friendly.”", "Author": "DanielMonkeyshines", "ReviewID": "UR101974377", "Content": "When every other hotel was sold out or had only $200 rooms left, we took a chance on this La Quinta Inn near Nellis Air Force Base. We paid $69 per night (plus tax). Location: about 10 miles north of The Strip on I-15 (and then east on Craig Road) is not bad, assuming you have a car. Just try to avoid rush hour traffic going into downtown/The Strip, as everything slows to a crawl. The hotel's neighborhood is low-income housing, so you would probably would not want to go strolling around late at night, but why would you? The only things within walking distance are (A) 7-11, (B) McDonald's, and (C) Wal-Mart. On the plus side, the staff was friendly and helpful. Especially Jasmine, day clerk, who was happy to let us look at three different rooms before selecting one we liked. NOTE: The third floor has mostly smoking rooms, but even the non-smoking third-floor room we looked at smelled of smoke. Instead, we chose a room on the second floor, which is all non-smoking. The continental breakfast (served 6-9 a.m.) is basic: apples, oranges, cold cereal, yogurt, coffee, tea, juices, various white-flour pastries, and a waffle machine which turns out a hot, fresh, waffle in about two minutes (kids loved this). A TV on FOX played the whole time. Our room was clean and in good repair. We had two queens, a TV, micro, fridge, iron & ironing board. (My wife is paranoid about bedbugs, so we checked both beds thoroughly. We found none. There is no street noise to speak of, as you are a couple of miles from the freeway and half a block from Craig Road (the main road nearby). All the rooms face either the north (parking lot and Wal-Mart) or south (parking lot and McDonald's) so they are a toss-up. We were on the south side, and had lovely morning sunlight. There is only one elevator, so I suggest asking for a room far away from the elevator, unless you want to hear people tramping passed your door late into the night. In short: cheap, but clean and friendly.", "Date": "March 28, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Los Alamos, New Mexico", "Title": "“Comfortable place”", "Author": "EleanorBW", "ReviewID": "UR101408994", "Content": "The room was clean and comfortable. The breakfast was just what I like. Didn't like the fragrance of the lotion provided (Mango), but that's my preference. Overall my experience was great.", "Date": "March 24, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Yuma, AZ.", "Title": "“Away from the strip and Could not beat the price!”", "Author": "Yuman", "ReviewID": "UR98094637", "Content": "LQ employees were courteous and professional. The hotel was clean. The sheets smelled fresh; although, the pillows were too fluffy for our liking. Plenty of space! Breakfast was average. The doors into the rooms do not block out hallway noise. The price was right, so the minor things just don't out-weigh anything! The pool and jacuzzi were convenient and clean. I know there was a business center but I had no time to visit it. Walmart is located right next to the hotel and there is a McDs there too. I heard people saying the hotel was in the \"bad part\" of town, but we did not see anything or have any experiences that would support that. If someone needs to visit Nellis Air Force base, this is right by it. I would stay here again!", "Date": "February 26, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "3.0", "Value": "4", "Sleep Quality": "1", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Memphis, Tennessee", "Title": "“Good, Clean Hotel, but thin, thin walls”", "Author": "beetlesgrandpa", "ReviewID": "UR97868335", "Content": "Good room, fairly new by appearance, friendly staff, great price, but thin walls. could hear neighbors unzipping their suitcases. In morning, neighbor on otherside woke us up with his cell phone, sounded like it was in our room.. If you stay, be sure to tell staff you want empty rooms around you if possible. Area was decent.", "Date": "February 24, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "4", "Rooms": "5", "Location": "4"}, "AuthorLocation": "VERNAL, UTAH", "Title": "“THE BEST MOTEL/HOTELTHAT WE HAVE STAYED IN FOR SEVERAL YEARS”", "Author": "justllm318rwj", "ReviewID": "UR96500941", "Content": "The lady that checked us in was very kind and professional. The room was more than we expected. The complimentary breakfast was the best we have had in many stays at various motels/hotels. Waffles were to die for good. Wish I could get the recipe for the batter. We stayed for two nights. The only thing that could be improved was the directions on the web site for finding the motel. The directions has us travel one exit to far on the freeway and then did not esplain that we had to go around a triangle in order to get into the motel because of thecenter divider in the street in front of the motel. Not really a problem but the directions could be better.", "Date": "February 13, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Las Vegas", "Title": "“Very pleasant experience”", "Author": "travellers3LasVegas", "ReviewID": "UR95473356", "Content": "The day manager Rosalie was absolutely awesome. Spoke to her on the phone when I made the reservation and she was extremely friendly and helpful. Got to the facility and she rememebered my call and arragned a very spacious room for us and our travelling companion, Dealer our world famous Birman cat. She arranded to have our room cleaned every morning at 9:15 so we could leve the room and our Dealer unattended. Anything we needed, we were provided with. The continental breakfast was another positive experience as there was always lots to choose from. Another fabulous experience with La Quinta. It would be helpful to give the place a bit of a facelift so the facility matches the quality of the staff. Having said that, we received very good value for the price we paid.", "Date": "February 4, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Saint Louis, Missouri", "Title": "“Great stay, especially if traveling with pets.”", "Author": "MrsM2010", "ReviewID": "UR93464722", "Content": "We were out in Las Vegas to attend the wedding of a close friend and decided to stay at La Quinta Inn because we were traveling with our yorkshire terrier. This La Quinta Inn has a great pet policy which made our trip very relaxing and enjoyable. The rooms are clean, the beds are relatively comfortable, and the continental breakfast was very convenient. The location is quite a distance from the strip and other prime Las Vegas attractions, but we didn't mind driving 10-15 minutes to get where we needed to go. There are several chain restaurants close by and the area is safe. Good value for the price.", "Date": "January 17, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Los Angeles, California", "Title": "“Go for it”", "Author": "Iancu8", "ReviewID": "UR91775887", "Content": "the night manager and morning stuff were very nice and helpful....clean room and hot coffee in the morning", "Date": "January 4, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "San Diego, California", "Title": "“good retreat”", "Author": "npenchina", "ReviewID": "UR89940511", "Content": "We chose this hotel because it had a heated indoor pool. We were pleaed to have such friendly pleasant and helpful staff. enjoyed staying in our large room with 2 queen size bed,fridge and micro wave. Found everything comfprtable and clean. Only one suggestion would be nice to have clock in the pool room. Oh yes quite nice free breakfast plus reasonable rates.", "Date": "December 15, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "3"}, "AuthorLocation": "Sarasota, Florida", "Title": "“indoor pool&spa nice rooms& service, decent breakfast, fridge&micro”", "Author": "michel_cmp", "ReviewID": "UR89916952", "Content": "Friendly staff. Business center and WiFi and local calls free. Easy in and out . no noisy casinos to walk thru. Convenient parking. McDonalds and 'wallmart next door,. Indoor pool great for winter and open 24 hrs - unusual. A little too far from strip if you have no car.", "Date": "December 15, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Bullhead City, Arizona", "Title": "“This is a fantastic motel with professional staff”", "Author": "31178Fignewton", "ReviewID": "UR88854809", "Content": "We have been staying at Best Western and was very dissapointed the last time we stayed there so decided to try La Quinta as they had what we were looking for (Spa and Pool) We were assigned to room 126 and after getting settled in, found that the heat wasn't working, The staff (Rosalie) came to room and tried to fix it but to no avail..She was very prompt to get us assigned to another room and offered to move us and I wouldn't have it..I think this staff should be recognized for there professional attitude..I will be staying at La Quinta in the future as we do a lot of traveling..We are retired and \"snowbirds\" so will be seeing the La Quinta's on our way to Washington State..Thanks for the wonder breakfast !!! What a wonderful selection and everything hot and good..Keep up the good work and will be letting all my friends know..", "Date": "December 2, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "3.0", "Value": "4", "Sleep Quality": "3", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Los Angeles, California", "Title": "“Nice Place - Nice Staff”", "Author": "kuribe", "ReviewID": "UR88557400", "Content": "We chose La Quinta Inn because we wanted to stay close to family that we were visiting. We have passed the place many times and noticed that it looked ok from the outside. The area itself doesn't look that great, but don't let that fool you. OK from the outside turned into more than adequate on the inside. The staff was so friendly and was so accomodating with my son's allergies. The room was very nice and the free breakfast in the morning was an added bonus. We did encounter one small problem where the fan on the air system started making noise. We called down to the front desk and after they sent someone to look at it they realized they needed to change our room. They were so apologetic regarding the fan that they tried to make the move easy on us and quickly prepared the room across the hall! It was a very nice stay and we would definitely come back.", "Date": "November 29, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "dayton, nv", "Title": "“AWESOME COMFORT”", "Author": "desertgardener26", "ReviewID": "UR84678301", "Content": "Bed was awesomely comfortabe, housekeeping was detailed and thoughtful, breakfast was with great selection and very convenient. Staff was friendly, warm, professional and responsive. Peaceful and quiet, no road or outside noises. I highly recommend this as a place for the quiet traveler who wants comfort, peace and quiet. By the way, did I mention it is immaculately clean !!", "Date": "October 24, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Orem, Utah", "Title": "“great price and the breakfast was so good”", "Author": "corrientes15", "ReviewID": "UR83758597", "Content": "great stay clean comfortable and excelent breakfast to start the day", "Date": "October 16, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Flower Mound, Texas", "Title": "“All the comforts of home...clean, comfortable and breakfast to start the day!”", "Author": "shultsc", "ReviewID": "UR80887657", "Content": "Have stayed herte now on 3 seperate occasions. The staff is consistently friendly, and gracios. Hotel is convienently located to the strip and shopping locations.", "Date": "September 24, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "fort collins", "Title": "“VERY ENJOYABLE STAY.”", "Author": "sld202", "ReviewID": "UR79583738", "Content": "The hotel was clean, quiet and in a convenient location. The bed was very comfortable. The room was spacious. The breakfast was terrific. More than we expected.", "Date": "September 14, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Dallas, Texas", "Title": "“MARVELOUS”", "Author": "Sylvia056", "ReviewID": "UR79389739", "Content": "If anyone asked me where to stay I would say La Quinta Nellis Street. The receptionist was marvelous. The service people were exceptional in taking care of us and our room. My pet, a 9lb chihuahua fell in live with our maid. When I come back I expect to stay at La Quinta Nellis Street.", "Date": "September 13, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "St. George, Utah", "Title": "“Comfortable”", "Author": "Barry2431", "ReviewID": "UR78552480", "Content": "Clean, friendly and very comfortable. I was able to relax and felt very good the next day.", "Date": "September 6, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "4", "Overall": "4.0", "Value": "1", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "stockton,ca", "Title": "“Traveler coupon total rip off”", "Author": "baibeeluv", "ReviewID": "UR76752240", "Content": "Ok. i have stayed in this hotel several times within the last 6 months i am a proud La Quinta member. I would say it has been a total of 7 times. Each time i have showed up with my advertised special coupon from a traveler's magazine. The price states $39.99 for two people. It seemed kind of funny that each time i showed up they would tell me the rooms were sold out. The days were random from a Sunday at 9:00am to a Tue at 3:00pm, ( even a Wed!). It was all hours and days .One time, as my wife waited in the lobby for me to pick her up ( 2:00pm- 3:30pm) she saw customer after customer enter with their coupon and the same was told to them. They were offered the $49.99 and said that that was the only rooms available. She swears that she saw most customers check out for the day and the parking lot was virtually empty so how could they be sold out if check in time is 3:00pm? This made me wonder that they just don't want to honor the price and is a fake draw in gimmick. The last time time i went i was ready to approach the manager about this. I went in and asked if i could get my coupon honored. The front desk once again told me the same. I confronted them about how uneasy i felt knowing that it can't be true. The receptionist then told me that they cannot honor the coupon and will get in trouble if they do. I became furious because i knew that i was right all along. I told them that it is very unethical to lie just to bring in customers. They should discontinue the coupon if they never intend on honoring it. She saw this and honored it but, said that she was noting on my account that i could never use the coupon again because i was given the rate already. Nowhere on the coupon does it say it is a once in a life time coupon. I am so angry and can't believe that they would lie! Note*** i am a frequent traveler and have never had this experience ever! I am currently staying in a Phoenix , Az La Quinta and yes they did honor my coupon!", "Date": "August 25, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Denver, CO.", "Title": "“All La Quintas”", "Author": "uncoD", "ReviewID": "UR72195570", "Content": "With the exception of two La Quinta hotels we stayed at over the three weeks on the road they were nice, gave us everything we needed as far towels, soap, extra pillows, clean sheets, late check outs up until 1:00pm breakfast, coffee, friendly service and they could not be more accommodating than any other hotel we stayed at. The beds were pillow top, more comfortable than my own bed, clean and noise free. When we complained about the people in the next room singing at the top of their lungs at midnight, 5:00pm and then again at 8:00am the manager gave us a full refund and a gift card for our next night free in any of their hotels... We started looking only for La Quinta hotels to stay at for the rest of our trip even if it cost us more than any other....These folks will make you happy what ever it takes.... Spend the extra few bucks for your comfort, safety and peace of mind!!!!", "Date": "July 24, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "2", "Overall": "2.0", "Value": "3", "Sleep Quality": "2", "Rooms": "2", "Location": "3"}, "AuthorLocation": "Mesa, AZ", "Title": "“Room dirty and in need of repair”", "Author": "skipper259", "ReviewID": "UR67080399", "Content": "Based on the reviews and ratings on this site, I was expecting more. I booked through Hotwire and 85% of their customers recommended this hotel. I would have to disagree. Right as I walked in the room (#124), I was greeted with a heavily deodorized smell which was obviously trying to cover up another not-so-pleasant smell. The floors were dirty and the bathroom was also a little dingy. I think my biggest beef was that the A/C was very loud and startled me several times during the night when it would come on and off. The positives were that the front desk was friendly and helpful and the furniture in the rooms were nice and current. It was also nice to have a microwave and small fridge in the room as well. I also did not stay there to go to the strip so the location was fine.", "Date": "June 10, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "tucson,az", "Title": "“THE BEST LA QUINTA AROUND”", "Author": "azvector", "ReviewID": "UR57946482", "Content": "Barbara Roche was an excellent concierge. She helped all 34 players on our UofA mens lacrosse team with excellent customer service and high attention.", "Date": "March 7, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "3.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "2"}, "AuthorLocation": "Sacramento", "Title": "“Nice motel - poor location”", "Author": "SactoGeorge", "ReviewID": "UR56672028", "Content": "We travel with a small dog, so we favor La Quinta. The Nellis La Quinta is close to Nellis AFB, but is located in a commercial/industrial area. Only retail within walking distance was a MacDonalds and a Walmart. Room was clean, neat, and comfortable, and free continental breakfast was modest but adequate. Heated indoor pool was almost too cold to get into. We were upgraded to a \"suite\", which was just a slightly larger room with a spa in one corner which did not have any visible controls or instructions, so could not be used. Had a microwave, which was convenient, and a comfortable bed. Lobby has some interesting historical military photos.", "Date": "February 21, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "2"}, "AuthorLocation": "Pinconning, Michigan", "Title": "“Nice hotel, though location not as great”", "Author": "gittinsj", "ReviewID": "UR56624021", "Content": "The hotel is very nice, with the rooms being very clean and the internet working very well. The only thing that might prevent me from visiting again would be the location. There were police cars at the Walmart nearby pretty frequently.", "Date": "February 20, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Orem, Utah", "Title": "“Excellent services, great place to stay!”", "Author": "gudy2010", "ReviewID": "UR56050741", "Content": "The location is great, not too far from the Las Vegas Strip but far enough to spend a quiet night of rest. We definatelly will stay at this hotel again. The service desk was excellent, special Kim. She was very attentive and polite.", "Date": "February 15, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Location": "1", "Rooms": "3"}, "AuthorLocation": "West Palm Beach, Florida", "Title": "“Barbara went above and beyond, regarding customer service.”", "Author": "lisabethcausey", "ReviewID": "UR55785181", "Content": "Barbara deserves high recognition for her customer service; she saved our 6 day trip to Florida. We accidentally locked our keys in a Uhaul truck, at the end of a very long day. She quickly responded by calling AAA, in such a kind manor. She has a way about her that calms you, in stressful situations. The issue was resolved, thanks to Barbara. She was even observant enough to notice that the gentleman from AAA needed to back the Uhaul truck up into the street, because we would not be able to drive it out of La Quinta safely. Overall, Barbara's help will be remembered.", "Date": "February 12, 2010"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Location": "5", "Rooms": "3"}, "AuthorLocation": "Southwest", "Title": "“Location Location Location”", "Author": "happytrails1", "ReviewID": "UR49285511", "Content": "We stayed here one night on a business trip to Nellis AFB. The hotel is practically on the flight line, but most of the noise we heard came from kids running up and down the hall with their parents in hot pursuit screaming at them to \"be quiet.\" We love La Quintas because they're pet-friendly, the rooms are usually clean and comfortable, and their \"Returns\" program is terrific. This property rates 3 stars. It would have gotten 4, but when we went down for breakfast the next morning, locusts had apparently gotten there first, leaving only a few slices of bread and a ring around the coffee maker. Other groggy guests were milling about, and nobody on the staff seemed to care, so we packed up and left. This LQ isn't close to the strip, but it's reasonably priced and there's a Walmart next door if you forget your toothbrush. Also, if you bring your dog, there's not really a good place to walk him/her except for some graveled areas around the parking lot. Still, when we go to Vegas on business at Nellis we will probably stay at this LQ again, mainly because of its...Location Location Location.", "Date": "November 15, 2009"}], "HotelInfo": {"Name": "La Quinta Inn Las Vegas Nellis", "HotelURL": "/ShowUserReviews-g45963-d241163-Reviews-La_Quinta_Inn_Las_Vegas_Nellis-Las_Vegas_Nevada.html", "Price": "$88 - $130*", "Address": "<address> <span rel=\"v:address\"> <span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">4288 North Nellis Boulevard</span>, <span class=\"locality\"><span property=\"v:locality\">Las Vegas</span>, <span property=\"v:region\">NV</span> <span property=\"v:postal-code\">89115</span></span> </span> </span> </address>", "HotelID": "241163", "ImgURL": "http://media-cdn.tripadvisor.com/media/ProviderThumbnails/dirs/1e/e5/1ee53ae9c85c093f504058ae561e7cfd7large.jpg"}}