{"Reviews": [{"Ratings": {"Service": "1", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Dubai, United Arab Emirates", "Title": "“Friendly staff would have been nice”", "Author": "dubai_UAE_traveller", "ReviewID": "UR126164785", "Content": "Not once did I hear anyone of the staff say thank you or please. As a mater of fact I had one guy bring me an adaptor and he did not say a world! He simply handed me the adaptor (without smile) when I opened the door and did not even extend a greeting. Rooms - one bedroom apartment, ok but a bit dark and small. TV reception and sound not good for some channels. Housekeeping came at 6pm to clean the room and did not replace toilet tissues when empty. On checkout date just came into the room, saying 'ohh, I thought it is check out'. Breakfast average an overstatement. No wifi available in the rooms. Big minus for travelers nowadays. For me... Been there, done that! No need to repeat.", "Date": "March 16, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Toronto, Canada", "Title": "“Excellent Hotel, Excellent Value, Excellent location = Excellent”", "Author": "Artur M", "ReviewID": "UR126112747", "Content": "Great hotel with spacious rooms that has a nice bathroom with a kitchen to go along with the room which was an unexpected bonus. Good staff which were very helpful. Stayed for 6 nights for business and came back every night to a clean and well presented room which was relaxing. The location is excellent, right next to the metro station which was very handy. The swimming pool and gym were very good on the top floor were superb views. Overall - Excellent Hotel, Excellent Value, Excellent location = Excellent", "Date": "March 14, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Chicago, Illinois", "Title": "“Outstanding Value & Quality”", "Author": "JimmyC360", "ReviewID": "UR124962598", "Content": "I went for business for 4 days and picked this hotel due to its location and that its a new hotel. Location Right next to the metro station and the TECOM business district which was ideal. 3-5 train stops and you can go from the Burj Khalifa/Dubai Mall to the Mall of Emirates to Internet City. Clean hotel Very clean and tidy Value Great value for such high quality Food Excellent food options Swimming pool & gym Nice size pool and gym at the top floor with great scenic views Room Good size traditional arabic style rooms Overall, its a great hotel with nothing to fault. I've already booked 3 reservations for the next 6 months as i was very impressed with everything from hospitality to comfort.", "Date": "February 21, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Amsterdam", "Title": "“Great hotel, but don't book your tours at the hotel.”", "Author": "amsterdamno1", "ReviewID": "UR124649377", "Content": "The hotel room and the service were very good. Breakfast was not included in our package, but because of the small kitchen and the nearby supermarket it is easy to stay here on a budget (in Dubai terms). Staff was very helpfull and the room was very clean. The only downside of the hotel is the 'travel agency'. Their desert safari and their trip to Abu Dhabi were very dissappointing. For way too much money they bring you in Abu Dhabi to a heritage village, which has the feel of a very cheap theme park, and to some buildings you can see from a distance. The only good thing about the Abu Dhabi trip is the mosque, which is not to be missed, but make sure are there at the right time so you can also take a free guided tour. For the desert safari they made us pay Dhs 250 instead of the Dhs 120-150 that most operators were offering, because this operator was supposed to be much better. But we couldn't understand how this safari could have been any worse. The camel ride was a 10 meter ride on the one camel at the camp that we had to share with two hundred other people. The other activities were sand boarding (two broken boards on a 5 meter dune), Tanura show (one guy, 5 mins.), belly dancing (one woman, 10 mins.), Henna painting (one) and Shisha (one you had to share with again 200 people). The free drinks were low budget sodas and tea (no coffee) and the BBQ buffet dinner was poor.", "Date": "February 16, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "London, United Kingdom", "Title": "“Superb Clean New Hotel”", "Author": "Charles S", "ReviewID": "UR124142698", "Content": "Just recently returned from this hotel and it sure met all my expectations. I've been to Dubai a few times but i needed to stay at TECOM which is the business hub of Dubai. Here are the pro's and con's: Pro's - Location - right next to metro which is convenient as the metro is amazing and so cheap - Decor - traditional Arabic decor which gives you that funky Dubai feel unlike other hotels which feels as if you are in any other hotel - Price - very reasonable for this quality of standard - Pool - superb swimming pool at the top floor with amazing views to sunbath - Restaurant - great restaurant on top floor and you can just stay up there for hours - Rooms - clean spacious rooms with great views Con's - Staff - might need a little more training as it is a new hotel Overall, great hotel for couples and business, would certainly use again.", "Date": "February 5, 2012"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Overall": "3.0", "Value": "2", "Sleep Quality": "1", "Rooms": "2", "Location": "2"}, "AuthorLocation": "Kuala Lumpur, Malaysia", "Title": "“Never again”", "Author": "PPMSSM", "ReviewID": "UR123997419", "Content": "We were 'upgraded' to the apartment suites. If that was an upgrade i cringe to know what its like in the standard rooms. The shower is cold and water trickles even when we switched it to the hottest and high vol. The elevators were slow . Receptionist & Bellboys are not attentive. We called more than a dozen time from the room and no one even bothered to pick up the call. There was 1 staff on duty during our group check out . It is within walking distance to the Internet City monorail station. That's the only thing good about the locality. Otherwise its far from the malls & everything else. Most cab drivers do not know this hotel. Breakfast is an average affair . Overall its a 2.5/5 stay", "Date": "February 2, 2012"}, {"Ratings": {"Service": "1", "Cleanliness": "3", "Overall": "2.0", "Value": "2", "Sleep Quality": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Dubai, United Arab Emirates", "Title": "“Would not recommend”", "Author": "AussieAmericanExpat", "ReviewID": "UR123960473", "Content": "The hotel is well located and the decoration is nice, but it was not thought out in terms of functionality and the service is awful. As mentioned in another user's review the water is never hot. The outlets are not in a useful place if you intend to use a laptop. The elevators are not well programmed. On the last day we called for a bell boy 4 times, they said they were coming and then never came. After an hour we took our 8 bags down ourself, only to find 3 bellboys at the stand. If you're their for a short while it may be ok, but don't stay there long.", "Date": "February 1, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "London, United Kingdom", "Title": "“Simply stunning hotel at highest quality with amazing views”", "Author": "cos3c", "ReviewID": "UR123399431", "Content": "A new building with a classic Dubai arabic decor which gives that lovely warmly feel. The location is ideal, round the corner from the amazing metro station in TECOM so you can travel very easily at a very cheap price. Quite busy location but this hotel is located in a quite part of town and from the room it was silent which was heaven. The view from the swimming pool and gym is simply stunning, you can see so far and you sure wouldn't get bored sunbathing next to the pool, working out in the gym or even eating at the restaurant at the same floor with those stunning views. I've been to the very good 5 star Le Royal Meridian in Jumeirah 5 years ago but if you want to stay at a place where you want to drop your stuff off and go sight seeing, business meetings etc then this homely feel hotel is perfect. I came here for business with my wife and it ticked every box from the quality of the room to the high class service which met my every request. This high class 4 star hotel was excellent value for money and will definitely use again.", "Date": "January 21, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Dubai, United Arab Emirates", "Title": "“Classic Hotel”", "Author": "Basima J", "ReviewID": "UR122566020", "Content": "Friendly staff with the arabic decor, gives the hotel a nice ambience. The location is of choice for travellers as you miss out on the city noise but still close to required destinations. A very clean hotel as it is newly opened.", "Date": "January 5, 2012"}], "HotelInfo": {"Name": "Auris First Central Hotel Suites", "HotelURL": "/ShowUserReviews-g295424-d2414037-Reviews-Auris_First_Central_Hotel_Suites-Dubai.html", "Price": "$112 - $255*", "Address": "<address> <span rel=\"v:address\"> <span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">TECOM C, Al Barsha</span>, <span class=\"locality\"><span property=\"v:locality\">Dubai</span> <span property=\"v:postal-code\">9970</span></span>, <span class=\"country-name\" property=\"v:country-name\">United Arab Emirates</span> </span> </span> </address>", "HotelID": "2414037", "ImgURL": "http://media-cdn.tripadvisor.com/media/ProviderThumbnails/dirs/0e/75/0e75a814e8fcca9f6b643f1fb9f862691large.jpg"}}