{"Reviews": [{"Ratings": {"Overall": "4.0", "Value": "4", "Service": "4", "Location": "5"}, "AuthorLocation": "Laren", "Title": "“Ideal place to stay for Van Gogh and Rembrandt”", "Author": "GJScheers", "ReviewID": "UR128168863", "Content": "We had dinner in the Brasserie. Excellent service and good food. The ambiance is amazing. Just across from the important museums in Amsterdam and with the Amsterdam equivalent of Rodeo Drive around the corner. The Vondelpark is there for watching people and some jogging. Walk past the Rijksmuseum and you are in the canal district. What else could you want! The design of the lobby is stylish and excellent for lounging. I grew up around the corner and i can recommend this place and this area highly.", "Date": "April 19, 2012"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Amsterdam, The Netherlands", "Title": "“Birthday Dinner”", "Author": "TheRolfes", "ReviewID": "UR127231273", "Content": "Visited last night and had a lovely evening. Booked a table for 8 of us in The Brasserie. Staff acknowledged our booking and advised us that some of the group had arrived and were in the bar upstairs. Ours coats were promptly taken and we were served in the bar quickly. The interior of this building is fantastic with great attention to detail. Our table was ready on time and we were advised on the specials of the day. The restaurant certainly wasn't intimate due to its size and scale but the lighting and decor made it feel comfortable. Will definitely return.", "Date": "April 4, 2012"}, {"Ratings": {"Overall": "5.0", "Service": "4"}, "AuthorLocation": "London", "Title": "“Stunning combination between old and new”", "Author": "Haversham", "ReviewID": "UR126931556", "Content": "Went for before dinner drinks. Good service ,great atmosphere in lobby bar. restauarants looked very good and look forward to eating there in the future.", "Date": "March 29, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Reinbek", "Title": "“Nice new hotel, some things can still be improved”", "Author": "hartmut p", "ReviewID": "UR125434824", "Content": "The Hotel is located in an ideal area of Amsterdam, really in the center... Next to the museum square, close to the vondelpark (well we didn't go there, it was too cold) and close to the Leidse Square. The hotel is new, still somethings were done when we were there, but we didn't notice much of it. The design is nice, modern in an old building!.. The rooms were big, the food was ok (could be better for that price) and they have lot's of other facilities such as an indoor pool. All in all we had a good time and the staff was friendly. If we go to Amsterdam we would go again.", "Date": "March 1, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "3", "Location": "4", "Rooms": "4"}, "AuthorLocation": "", "Title": "“Beautiful hotel with excellent service”", "Author": "Vacationjudge", "ReviewID": "UR124798443", "Content": "The hotel is still in its last stages of completion, but visitors will not really note that. We did not notice any construction noise or other inconveniences. The entrance of the hotel has a great ambiance. The personnel outside (valet parking) and at the front desk were very friendly and service oriented. We had to wait quite some time before we could get the key, but that was probably because we arrived at 3 in stead of 5 as originally planned. We were offered a complimentary drink fro the brasserie whilst waiting though. The room we booked ( standard double) was clean, comfortable, luxerous but smallish. Good matrass. The spa looks great, but is aso still in its completion stage ( no inconvenience though). Breakfast ok, although having to pay additional for fried eggs etc (eventhough breakfast was included in room price) was a bit surprising (especially considering that the hotel rates are quite high)", "Date": "February 19, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "ronpel", "Title": "“Very high class-best in Amsterdam”", "Author": "ronpel", "ReviewID": "UR124108336", "Content": "We took advantage of the current special rates as most hotel rooms are still at work. The public areas restaurants ,bar , spa , gym and pool are all open ,fully operational and are amazing. We stayed at a two level room - one of the best we ever stayed. Staff was great and helpfull . Brasserie has great food and compared to other restaurants we tried in Amsterdam the prices are even on the low side and much tastier. Location is great for high end shopping and all major museums. Perfect place for a romantic weekend in Amsterdam.", "Date": "February 4, 2012"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Paris, Ile-de-France, France", "Title": "“First experience at the conservatorium - still a lot to do”", "Author": "Eric G", "ReviewID": "UR123905648", "Content": "Very nice hotel (design, nice duplex room) and great locationand great gym infrastructure Friendly staff but still need to practice as they do not seem to be ready only few services available: after 8 weeks, still no laundry or dry cleaning available some heater problem in the duplex room as the heater is just at the upper floor, which mean the lower floor is quite cold food at the brasserie is good (breakfast and dinner) but food at the upper restaurant does not bring value for money only a few rooms available, still a lot of workers in the building", "Date": "January 31, 2012"}, {"Ratings": {"Overall": "4.0", "Value": "4", "Service": "4", "Location": "4"}, "AuthorLocation": "Amsterdam, Nederland", "Title": "“New cosmopolitan hotel in Amsterdam”", "Author": "madelon6", "ReviewID": "UR123744445", "Content": "The hotel is still under construction. Just a small amount of rooms is in use right now. The former conservatory is beautifully constructed and maintaned all its floors, walls ceilings very well. It is actually a very cosmopolitan hotel. Like you will find in New York, London, Copenhagen etc. It is difficult to give the right opinion yet. I had read reviews about lousy service and arrogant attitude, but that was not our opinion today at the Brasserie. Very friendly and service minded people, great atmosphere and a likable crowd. We bumped into many friends(all from Amsterdam). A good place to take your foreign business partners to. Looking forward to try the restaurant \" Tunes\" , with it's chef from the former Blakes and the College Hotel. Quite pricy though and not to flexible on the fixed courses, i have heard, but better find out myself. I did not dare to give it 5 stars yet, because we have to see how they are doing a little later on this year. But in the mean time i am a fan and going to try out the High Tea at the Brasserie soon and definitely will be back for breakfast and brunch!. Love their menu anyhow. Along the corridor on the main entrance level(with is not open yet), you will find a beautiful cigar shop and the well known beautiful decorated jewelry shop \"Bonebakker\" . Rooms not yet finished yet and what i found is that you are not able to open the windows of the rooms. I would not like that! I hate to smell the former visitors in a room. Love to sleep with 'fresh' air.", "Date": "January 28, 2012"}, {"Ratings": {"Cleanliness": "4", "Overall": "3.0", "Value": "3", "Service": "1", "Location": "4"}, "AuthorLocation": "amsterdam", "Title": "“Both food and service in brasserie need to be improved”", "Author": "hmamsterdam", "ReviewID": "UR123106429", "Content": "The hotel, still undergoing final construction, is without a doubt impressive. Not just the building itself, which is magnificent, but also the efficient looking clad-in-black personnel. We thus had high hopes for lunch at the lovely light brasserie. Unfortunately, we were underwhelmed by both the food and the service. My overpriced goat cheese salad was spare, consisting of a bit of crumbled cheese, discolored beets, store-bought croutons and strips of bacon covered in coagulated grease. Club sandwich mediocre. Wine by the glass fine. Coffee okay. After finally catching a waiter's eye to ask for the bill, we subsequently had a long wait. So we resorted to asking someone else. Our young and clearly inexperienced waiter told us he'd forgotten. No apology. It's early days but expected more.", "Date": "January 15, 2012"}, {"Ratings": {"Overall": "2.0", "Value": "2", "Service": "3"}, "AuthorLocation": "Amsterdam, The Netherlands", "Title": "“Overpriced”", "Author": "Mona L", "ReviewID": "UR123016904", "Content": "Went for a couple of drinks in the bar last night and had some food in the brasserie. At the end of the night we found out that the vodka-martinis we had ordered were â‚¬20 a piece! Whereas other cocktails are priced at â‚¬12.50. Service was good but the bar gets very easily crowded with the long glass table taking lots of space. In the brasserie food that had fallen on the ground was readily served to a customer again and waitress denied that it had been on the ground. Food is on the expensive side. Service by male waiters was fine (unlike the waitresses for some reason). Having been to many top of the range hotels, this visit was disappointing when it came to service and pricing.", "Date": "January 13, 2012"}, {"Ratings": {"Cleanliness": "3", "Overall": "2.0", "Value": "2", "Service": "2", "Location": "4"}, "AuthorLocation": "Amsterdam, The Netherlands", "Title": "“Poor service, overpriced”", "Author": "der_Zef", "ReviewID": "UR122766915", "Content": "Had a couple of drinks in the beautiful and spacious hotel lobby. Overly present security crew with numerous men in black, but only a single poorly skilled, insecure intern waiting tables, trying very hard to avoid making eye contact. The Riesling wine was no more than average and not worth â‚¬7. Disappointing. Service clearly is not part of the concept. Typically Dutch.", "Date": "January 8, 2012"}, {"Ratings": {"Cleanliness": "5", "Overall": "5.0", "Value": "5", "Service": "5", "Location": "5"}, "AuthorLocation": "Amsterdam, The Netherlands", "Title": "“Two excellent new restaurants in one hotel”", "Author": "Pim1010", "ReviewID": "UR122605397", "Content": "We live close by to this Hotel annex restaurants and we could not complain about the existing restaurants in the aerea. But the restaurant Tunes in The Conservatorium Hotel is a real ad on for the City. Food was excellent, staff well trained and pleasent. The architecture of international allure. We were extremely pleased with the accoustics. We also had lunch in the Brasserie of the hotel. Ã€ great place and good Food.", "Date": "January 5, 2012"}], "HotelInfo": {"Name": "Conservatorium Hotel", "HotelURL": "/ShowUserReviews-g188590-d2418096-Reviews-Conservatorium_Hotel-Amsterdam_Noord_Holland.html", "Price": "$352 - $544*", "Address": "<address class=\"addressReset\"><span rel=\"v:address\"><span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">Van Baerlestraat 27</span>, <span class=\"locality\"><span property=\"v:locality\">Amsterdam</span> <span property=\"v:postal-code\">1071 AN</span></span>, <span class=\"country-name\" property=\"v:country-name\">The Netherlands</span> </span></span></address>", "HotelID": "2418096", "ImgURL": "http://media-cdn.tripadvisor.com/media/ProviderThumbnails/dirs/5a/3f/5a3f249b888ab9827206443d8d0e2df740large.jpg"}}