{"Reviews": [{"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "London, United Kingdom", "Title": "“Great stay again”", "Author": "geoff196050", "ReviewID": "UR128042069", "Content": "Our second stay at this hotel, great staff etc. Only complaint this time was the hotel bar had closed down, but still not the end of the world with bars very close.", "Date": "April 17, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "London", "Title": "“fit for the purpose”", "Author": "beaam", "ReviewID": "UR127404320", "Content": "The Aldea Novum is what I would call an IKEA hotel in that it is one of many similar hotels that function well, but are a bit characterless ,however it suited our purpose for being in Berlin . We stayed for 3 days and as a centrally located Hotel very near 2 underground U stations it was excellent for getting around .The beds were comfortable ,sofa bed not so much according to our son. The bathroom is very compact ,ok if you are not a very large person.Breakfast is good and plentiful ,staff helpful and friendly a few minor issues sorted efficiently and quickly. So if you want a well run base for a city break I would recommend it ,if you want a bit of character and luxury then go a bit more upmarket .", "Date": "April 7, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Split", "Title": "“Pleasent stay in Berlin”", "Author": "spalatino", "ReviewID": "UR126816587", "Content": "Hotel is very close to subway station (just a minute to go) and my room was directly at the height of the subway station with the huge windows overwieing it....well, if you forget to close the curtain.... Room was clean and fancy, very comfortable. Check if your price includes breakfast, as having extra breakfast cost € 7,50 for a standard continental, and you have much better options if you eat somewhere else-:).", "Date": "March 28, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "5", "Sleep Quality": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Wirral", "Title": "“Good base for Berlin and Fantastic value!”", "Author": "Crispy83", "ReviewID": "UR125310296", "Content": "Not the best hotel I have ever stayed in but good value for money. We booked through Hotels.com and as a few lads going to watch the game it was perfect! Clean enough but the and the location couldn’t be easier for exploring the city, the U:Bahn is right down the street. Staff aren’t great – they did seem to get a little uppity on reception. One point to note is the hotel is situated right in the middle of a red light district. It didn’t really bother us but I defiantly wouldn’t recommend it to couples or families. As soon as it gets dark (from about 6pm onward in Dec) there was prostitutes on the street right outside.", "Date": "February 27, 2012"}, {"Ratings": {"Service": "1", "Cleanliness": "2", "Overall": "2.0", "Value": "1", "Sleep Quality": "3", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Naples, Italy", "Title": "“Impossible to recommend it”", "Author": "mywhereabouts", "ReviewID": "UR124402865", "Content": "In Dec. 2011 we bought a coupon on glamoo.com including a flight from Rome or Milan and a 2-night stay in Berlin in a 3-star roulette hotel with breakfast (whose name would have been communicated upon final booking). After a few days we received the concerned coupon by glamoo.com along with the contact details of their partner, i.e. the tour operator where we could book our flight and hotel according to availability. The given tour operator was viaggiare.it which was definitely difficult to reach by phone; once we succeeded the person in charge first suggested the period from 02 to 04 Feb which we confirmed as possible. It was just after having already communicated flight times and hotel name that he noticed to be wrong as the flight was sold out on that day and asked whether we could travel from 03 to 05 Feb 2012. OK, we were available and the reservation was confirmed. The assigned hotel was Aldea Novum (Bülowstr.). It took just a few days to get our booking confirmation per email, which reported all the relevant data about both our flight and hotel along with an ID booking no. On 03 Feb we took our flight to Berlin and arrived at the Aldea Novum Hotel in the afternoon. Upon check-in we immediately had trouble with our booking confirmation received by viaggiare.it: the receptionist told us that the hotel management did not have any reservation under our names. After some discussion they discovered that they had got our reservation by Gulliver Travel Associated (presumably a partner of viaggiare.it) but for the period from 02 to 04 Feb 2012! How could it be possible? Our flight had been correctly booked respectively on 03 and 05 Feb… How could we arrive at the hotel on 02 Feb when flying on 03 Feb and conversely fly back on 05 Feb whereas our hotel stay ended on 04 Feb? We felt just like Kafka’s characters in one of his outstanding novels. But unfortunately this was pure reality. We asked to call the concerned tour operator in order to clear the situation; so, the hotel receptionist spoke to an operator who checked our reservation and confirmed the paradoxical data: FIRST arrival at the hotel and THE DAY AFTER flight to the destination where the hotel is located (!), departure from the hotel ONE DAY BEFORE flying back home. Our questions about the absurd contradiction of the data got no answer by the receptionist. It took more than an hour before she decided to have mercy to us and gave us our room key. We agreed that the hotel management would have definitely cleared the problem the day after by calling Gulliver once again. After so much trouble we could finally enjoy our room (which was spacious and correctly equipped for a 3-star hotel, though the bathroom is quite small and lacking of a proper lighting for make-up). We were confident that the hotel management and Gulliver would have solved the problem undoubtedly caused by a Gulliver’s operator who had typed the wrong period. The day after we went out after breakfast in order to visit some must-see places. It was very cold but the sun shined on the German capital fabulously whitened by a thick layer of snow. When coming back to the hotel in the mid-afternoon we found ourselves wrapped by the sequel of the Kafka’s novel: the receptionist told us that Gulliver had confirmed once again the contradictory periods. We also asked why they did not take into consideration our booking confirmation: the receptionist answered that the tour operator would have never paid them the night 04-05 Feb; so we had to pay – IMMEDIATELY – that night (a night which we had already paid!) or leave the hotel IMMEDIATELY. Really great! In order to make our decision we asked for the room key so that we could rest for a while and decide about. Sorry: we were not allowed to go up into our room and make use of our luggage unless we first communicated our decision. When asking whether they were aware of the seriousness of their behavior they simply answered that otherwise we could go up, spend that night there and the day after leave the hotel without paying anything. Do you imagine what we decided? We informed the receptionist that we were leaving in a few minutes the hotel, so we got the key, went up to get our luggage, paid our extra-charges and went away from the worst hotel we had ever run up against and with a temperature of -18° C we searched for another hotel in the neighborhood of the airport. Our short holiday had been strongly polluted by such a non-professional behavior which was definitely insulting for us. The hotel management of the Aldea Novum Hotel does not show any respect nor confidence for guests even in cases where responsibilities are clear and irrefutable.", "Date": "February 10, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Zabbar, null, Malta", "Title": "“Excellent hotel”", "Author": "Chrysander A", "ReviewID": "UR123860131", "Content": "I have to say that this hotel is extremely well placed, clean and cheap. the rooms are great for a short stay. just close to the U2 line of berlin, practically taking you anywhere you want to go. free Wifi, and the staff are extremely friendly!!", "Date": "January 30, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "devon", "Title": "“Great hotel”", "Author": "holly1985", "ReviewID": "UR123827942", "Content": "This hotel is lovely and well worth the price. It is a little out of the city centre but the trains are frequent and only takes around 5 minutes to get into the main streets of Berlin via this method of transport-it’s not too expensive also. The rooms were comfortable and well-furnished although one thing i would say is that the bathroom are tiny! Literally room to step in and close the door but we didn't mind (and my bf is quite a big chap). All in all a great base for exploring Berlin.", "Date": "January 30, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Adelaide, Australia", "Title": "“Well worth the price”", "Author": "Davsim3", "ReviewID": "UR122618676", "Content": "We stayed at Hotel Aldea Novum for 4 nights and had no troubles. It is very basic but I guess you get what you pay for. The staff were friendly and helpful. The breakfast could do with an upgrade. The only whinge I have is the Wi-Fi did not work and the room didn't have a fridge. Overall well worth the price", "Date": "January 5, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Stoke-on-Trent, United Kingdom", "Title": "“Ended out OK although not the hotel I'd booked....”", "Author": "Scubatwo", "ReviewID": "UR122584680", "Content": "I'd actually booked the Hotel City B Novum through Expedia (good price and the hotel was really nice and modern) but when we got to the hotel we found that there was a problem as a room wasn't available, and so we were sent across to the Aldea a few yards down the road. The reception team at the Aldea were really polite and professional, and all speak excellent English which is handy if, like me, your German isn't too good. The room was ok - clean enough with a tiny bathroom (w.c., sink and shower) where you can singe your rear end on the radiator when you get out of the shower cubicle. Reception had apologised for the lack of a double bed and advised that the twins had been pushed together (which isn't unusual in Europe) but not only were the wooden frames a bit of a health and safety hazard but the slatted bed bases were so noisy even when you sat on them that they were a bit of a passion killer! The radiators in the bathroom and bedroom work extremely well, so that even on a moderate setting you found that it got very warm rather quickly. That came in really handy as the weather was rather cold for the duration of our stay and you thawed out fast when you got back to the hotel. The room safe was free - which was great - and big enough to hold a DSLR camera plus attached lens as well as the usual passports and mobile phones etc. Access to the U-bahn is simple - out of the hotel and cross the road to Bulowstrasse and you're on the main line (U2) which is very handy for sightseeing expeditions and getting to most places across the city. The location of the hotel is fine - good for transport links and so not too far away from Zoo Station/Potsdamer Platz etc. There are a few nice local cafes for breakfast if you decide not to pay the 7.50 Euro per person charge - and to be honest the only good thing about the hotel breakfast was that I could drink a few cups of coffee before going out. I do recommend Bar Noir around the corner and opposite the City B Novum where the owner (a chap named Uwe) is really friendly and his croissants (and coffee) are delicious. All in all, if you're staying here you'll be fine. The staff are good and really helpful, the rooms are clean, comfortable and warm, and the location is pretty much ideal.", "Date": "January 5, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "3", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Macclesfield", "Title": "“Great stay”", "Author": "1204tina", "ReviewID": "UR122467598", "Content": "Read mixed reviews prior to booking but more positive than negative. Efficient check in & staff always pleasant. The room was a good size& extremely clean. We booked a double bed but got twin beds, no drama though (nice to have a break). Bed settee when sat on, broke.so beware. Repaired straight away. Location was fab for the train which was excellent. Fantastic break, will definitely book the hotel again.", "Date": "January 3, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "3", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Blackpool", "Title": "“Very good. No problems.”", "Author": "Bluerosiep", "ReviewID": "UR121948402", "Content": "Stayed for 3 nights. I was very happy. A very efficient service, good location, and helpful (English speaking) staff. Clean room and good breakfast. I would happily stay again.", "Date": "December 21, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Canberra", "Title": "“I'm glad I stayed: Good if not Very Good.”", "Author": "FFadden", "ReviewID": "UR121813357", "Content": "I must admit that after reading a number of reviews for this establishment, I was tempted to cancel my booking. I'm glad I didn't! Of the 25 hotels I have stayed at this year, this is first in value for money. In addition to a great price, his hotel has a great location: Close to 2 U-Bahn lines that give access to airports and attractions. The breakfast is excellent and at 7.5 Euro, great value. Rooms are large compared to most 3 star city hotels, with a safe and plenty of hanging room. Bathroom: okay. The building is a little dated but far from shabby. The hotel is close to a mix of restaurants (a great Italian one), supermarkets and various shops. the front desk staff are efficient, helpful and multilingual. The free WiFi is great; a kettle, a few English language TV channels and a laundry service would be good (Coin laundry is 3 bus stops away, which is not really practical). The clientele appeared to be a broad mix of tourists and business travelers. Others have commented on the \"girls on the avenue\". Like most big cities they do exist. No difference here.", "Date": "December 16, 2011"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Overall": "3.0", "Value": "4", "Sleep Quality": "2", "Rooms": "2", "Location": "3"}, "AuthorLocation": "Aberdeen, United Kingdom", "Title": "“Cheap - but there is a reason for this!”", "Author": "grantos3000", "ReviewID": "UR121530162", "Content": "Fisrtly, before you read on, I will say that the hotel is very cheap and for what you pay you get good value for your money. GOOD points to this hotel: Cheap for Berlin (£20 -£33 per night we paid) Free wifi (ask reception for password) Close to S-Bahn and some decent takeaways! Free to use safe in the room BAD Points Not at all soundproofed (even though their site says it is!) No Hotel Bar or even facility for getting ice. Reception staff not really very helpful if you ask them for reccomendations for bars/nightclubs etc) \"Double rooms\" are actually just rooms with two single beds pushed together - each bed has a wooden rim round it making it VERY uncomfortable if you want to cuddle your partner at night! The hotel is pretty easy to get to via the U Bahn and main areas are a reasonable walking distance away. However the hotel is in need of rennovation - tiles and sink in the bathroom were cracked, chipped or broken, some of the lightbulbs were not working but were not replaced during our 4 day stay, and this is the first apparently 3star hotel I have been to which does not have a bar!] The first night we were in the hotel we discovered the bedroom doow was coming off its hinges (although this was fixed the following day). At about 3am, there was alot of shouting and banging around as a group were fighting in a nearby room and along the corridor - it took an hour of complaints to reception to get someone to come up and shut them up. I suppose this hotel is ok if you want somewhere cheap and dont mind the fact that your room has seen better days. However if you are plannig a romantic weekend away with a partner avoid this holel. Out of the hotel there is a decent cocktail bar a short walk away (turn right out of hotel entrance, turn right into Potsdammer Strasse then walk down that road for about 8-10 mins until you get to the next U-Bahn station - there is a bar on the left of that junction which is actually an old train carriage (bar is called \"the train bar!\") - cocktails are all 5 euro Sun/Mon/Tues and any other day the most expensive cocktail is about 6Euro. They also serve a small selection of bottled beers and other drinks too!", "Date": "December 8, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "3", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Aberdeen, United Kingdom", "Title": "“Good valve for money for an OK hotel room”", "Author": "PhilNI", "ReviewID": "UR121242035", "Content": "I need to mention first that I booked this hotel last minute on hotels.com and I only paid 19GBP! Bit of a journey on the subway out to it from Berlin centre, but for what I would have paid for a hostel it was great! I was suprised to find a very well sized room with good shower and comfotable bed. There were no luxuries or facilities in the hotel (bar or restuarant) but I had a nice meal in a nearby restaurant and the subway is only a few minutes walk away. The WiFi would not work but there was a computer in recpetion free to use. Great valve for money...but if you are quoted a price a lot higher than this, maybe look at staying somewhere closer to the centre.", "Date": "November 30, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Location": "3", "Rooms": "3"}, "AuthorLocation": "Denmark", "Title": "“Okay for a short stay”", "Author": "JesperSandberg", "ReviewID": "UR121086625", "Content": "This is an average hotel. Great for a short stay. Hey have nice and cheap breakfast. Walking distance from many popular places, like potsdammer platz, the Sony Center and Alexand platz (20 minutes).", "Date": "November 27, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "3", "Overall": "1.0", "Value": "2", "Sleep Quality": "3", "Rooms": "2", "Location": "1"}, "AuthorLocation": "Lund, Sweden", "Title": "“Bad is the name - stay away”", "Author": "M R", "ReviewID": "UR120394089", "Content": "No communication with the hotel via email. They can't answer an email in English. Don't trust the booking price. They charged 30 EUR over the price in the reservation. Refuses to pay back. Neighborhood is awful, stay away from Schöneberg. Prostitutes all around the hotel in the streets. Don't know the connection between them and the reception in the hotel.", "Date": "November 9, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "3", "Overall": "4.0", "Value": "5", "Sleep Quality": "3", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Nottingham, United Kingdom", "Title": "“Good value for money.”", "Author": "Genises", "ReviewID": "UR120375326", "Content": "Hotel was near enough to the underground station even though the nearest one was actually closed for maintenance, I believe. It is also close enough to Berlin's main attractions of which some are in walking distance. The reception staff were very helpful and efficient with enough of them available even at busy periods. The website I used to book the hotel advertised it as having sound-proofed rooms, but although I did not find it noisy, I can assure that the rooms are not sound-proofed. Rooms were clean (except under the beds) and equipped with all the neccessities. All in all, a very enjoyable stay and would stay there again.", "Date": "November 9, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "2", "Overall": "2.0", "Value": "4", "Sleep Quality": "3", "Rooms": "3", "Location": "1"}, "AuthorLocation": "Hamburg, Germany", "Title": "“Decent hotel in a really red district”", "Author": "gens1980", "ReviewID": "UR119053653", "Content": "The room was small and not extremely clean, but somewhat value for money. However, the hotel is located in an area similar to red districts in other German cities, even at 7PM... I wouldn't go back to this hotel as a couple or with children.", "Date": "October 7, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Sleep Quality": "2", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Norway", "Title": "“Mixed feelings”", "Author": "Elinhs", "ReviewID": "UR118754819", "Content": "I have various opinions regarding my stay at the hotel. Mainly because I had originally booked my stay at B City Novum , however, at my arrival , their bookingsystem had broken down, and they had booked me a room at Aldea hotel. Aldea was luckily a 2 minute walk down the road, and the standard was pretty much the same. Due to the experience at B City Novum, I will probably be somewhat hesitant to book a room at any of the Novum hotels again. The room was simple, but clean. No fancy furniture or design, but it was in good condition. The bathroom felt clean, even though it could have been slightly more spacious. I never tried the breakfast as you could get a good breakfast with a 5 minute travel with the u-bahn. One thing that bothered me during the stay was the noise from other hotel guests. You can't really complain at the hotel for having noisy guests..but I mean, an after-party at 3 o'clock in the hallway at night?? Luckily my room had its view into a backyard, and not the main road. That way I avoided the worst noise. I can also mention that my room was cleaned everyday, and the towels were changed. As for the area - it's not a very \"photogenic\" area to walk around in. It's fairly central if you're going to use the u-bahn (be aware that some lines are closed due to an upgrade). At night there were a few prostitutes here & there. However, they did not seem to make any trouble towards any of the tourits. Overall, an ok stay. I'd probably book a hotel in a nicer area the next time (as I fell in love with the city, and is very much likely to go back). A taxi from the hotel to Schonefeld airport costs approx. 35 Euros.", "Date": "September 29, 2011"}, {"Ratings": {"Location": "5", "Overall": "4.0", "Value": "5", "Service": "3", "Rooms": "3"}, "AuthorLocation": "Amsterdam", "Title": "“Cheap and okay, not more not less”", "Author": "ram1966", "ReviewID": "UR118122018", "Content": "It was the 3rd time we went to this cheap hotel and we like the location and the breakfast selection. For dinner it's better to go elsewhere as the staff does not seem to be able to serve guest who do not belong to a group. I was pleased to see that the hotel got redecorated, with fresh paint, modern tv's etc. However, the couch is still the old one: don't sit on it, or you'll break it. The matrasses on the bed are quite thin. Also, the WLAN in the room fails to work, but we used our smartphones to get online. Staff is friendly, esp. the male staff at night.", "Date": "September 14, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Location": "5", "Rooms": "3"}, "AuthorLocation": "london", "Title": "“Good for the price”", "Author": "elliebi", "ReviewID": "UR117827381", "Content": "The rooms were somewhat small, however this is to be expected on a budget. The location was excellent, right by the train to the city centre.", "Date": "September 8, 2011"}, {"Ratings": {"Overall": "1.0"}, "AuthorLocation": "London", "Title": "“Hotel cancelled without my knowledge”", "Author": "tessav12", "ReviewID": "UR116505297", "Content": "I have not actually stayed at this hotel. I booked in July for September. I recently contacted them to inform them of change of arrival times. Venere the booking agent told me I had cancelled. I had not and am now worried that because there is a no cancellation policy I will be charged. The hotel to date has not replied to three emails Venere just had a email from the hotel but nothing from me. Just glad I didn't show up on the day to find we were cancelled. I am now contacting my credit card company to make sure they don't take any money from me. And I have to find another place. So a lot of time spent on all of this.", "Date": "August 10, 2011"}, {"Ratings": {"Cleanliness": "2", "Sleep Quality": "2", "Overall": "2.0", "Value": "2", "Service": "3"}, "AuthorLocation": "Independence, Kentucky", "Title": "“Dodgy Area”", "Author": "Jmast0626", "ReviewID": "UR115503344", "Content": "My husband and I travelled to Europe for 2 weeks with our best friend and were part of a Contiki tour. We stayed here for 2 nights. The hotel is in what Australians would call a \"dodgy\" area (shady, creepy) of town. I would not walk outside by myself at night and my husband and I found it a bit uncomfortable doing it just the 2 of us. The rooms are outdated and a bit musty. I didn't take my socks off while walking around the room. The bathrooms were also dated and small but clean. The included breakfast was technically edible. Overall, the only positive to this hotel was the location to a metro station that would take you to Central Berlin in a matter of minutes. Given the choice, we definitely would not have stayed here.", "Date": "July 18, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "3", "Overall": "3.0", "Value": "5", "Service": "4"}, "AuthorLocation": "Manchester, United Kingdom", "Title": "“Basic but good value”", "Author": "Fiddler1901", "ReviewID": "UR115396228", "Content": "From the outside of the building, you wouldn't even know that it is a hotel. In fact it took my taxi driver two trips up and down the road to even find it! I was immediately greeted at reception by an Englishman, who was very helpful, friendly and chatty, but I had been hoping to practice my GCSE German skills. However, he got me checked in very quickly and smoothly. I have to admit as I walked through to the elevator and then once on my floor, to my room, I did start to worry. It looked like the inside of a car park! But the room was comfortable, nicely decorated and very clean and very secure with good locks on the doors. If anything, the bathroom was tiny, but for one person, this really isn't an issue at all, it was well maintained and very clean. The matresses are a little soft and the pillows are an acquired taste but all in all comfortable enough. TV channels were all in German. There is also a nice bar which appeared to be frequented by locals and there was also a retaurant here. There is also a medium sized breakfast room, though I always ate out. I think it is fair to say that the hotel had more of a hostel feel to it, but it was clean, comfortable and secure and great value for what I paid. The best thing about this hotel was the location. It is just a 2 minute walk to the train which is on one of the most central lines in the city and will take you to Alexanderplatz in about 10 mins where you can connect to most landmarks.", "Date": "July 15, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "5", "Overall": "4.0", "Value": "5", "Service": "4"}, "AuthorLocation": "Sheffield", "Title": "“Good Location, Good Price, Standard Room”", "Author": "wato20", "ReviewID": "UR115111648", "Content": "Me and my girlfriend went to berlin in October 2010 and booked this Hotel and stayed here for 5 nights. It was great value for Money. It is very near to a couple of U-Bahn's, which make it very easy to get into the centre of Berlin or other place. It is about a 10 Minute trip on the U-Bahn to Potsdamer Platz or Alexander Platz. So the Location is nice as its out of town, and it is round the corner from two good streets with many restaurants and cafe's and bars on. Which we would visit at night. The room was pretty standard. A basic TV and facilities. The Shower was always hot and we got fresh towels daily. We were only in the room until 10am each day, and then we'd often stay out all day and not get back til midnight. So the room wasnt important for us. But i would stay here again, although if I was going back to Berlin, I would also look for somewhere else to stay, but would still choose this hotel if the price was as good again. So as the Title says... Good Location, Good Price, Standard Room", "Date": "July 7, 2011"}, {"Ratings": {"Cleanliness": "3", "Sleep Quality": "4", "Overall": "4.0", "Value": "5", "Service": "4"}, "AuthorLocation": "Oslo, Norway", "Title": "“Great price, location and ok rooms”", "Author": "Anne_SB", "ReviewID": "UR111324572", "Content": "Went there with my 1 year old son. The room was big enough to for his travel cot and for him to play around. The bathroom was tiny, so it was kind of hard to change his diapers there. The beds was great! The floor was clean, the doorframes had some spots on them and it was dust in the radiator, but overall it was nice. The location was great for transportation, allthough the subway was closed for contruction, the bus stop was just outside the door! The area was rather dull with some gaybars, kebabplaces and a couple of supermarkeds. I live in a city myself and don't mind some noice from the traffic, so it didn't bother me. The breakfast was nice with different bread, cheese, ham, boiled eggs, scrambled eggs and juice. Some ppl are very negative here mentioning things like a small tv, old keys and no minibar. I didn't mind. For what I payed I'm very happy and would not mind comming back. The people at the reception was not over the top friendly, but answered all my questions politely and that it's all I ask for. The resturant had ok food, nothing to brag about, but cheap and clean. I ate there once. I never used the wifi, but my phone found it and hooked up without problems.", "Date": "June 3, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Gothenburg, Sweden", "Title": "“Awesome hotel for the cheap price!”", "Author": "Floppyc4t", "ReviewID": "UR109913067", "Content": "This is a very nice hotel (and low priced!). The staff was very helpful, very clean and comfortable rooms with lots of space left. Smoking allowed (in our room atleast). Breakfeast was great! Huge buffet with lots of things to choose from. Boiled eggs, plenty of bread types, yoghurt, marmelade, vegetables, brie cheese (!) etc. Our breakfeast wasn't included though, and it was quite expensive. 7,5 euro for one breakfeast. This hotel is located in a gay quarter with lots of gaybars and clubs. There is also some streetwalker girls close to the hotel, making it less family friendly to be out at night. The people who lived at the hotel seemed to consist of mainly elderly people and some business trip people. If you're young and in Berlin for the nightlife then you certainly won't find it at the hotel. But as a living place, it's great!", "Date": "May 26, 2011"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Sleep Quality": "2", "Rooms": "3", "Location": "2"}, "AuthorLocation": "Singapore, Singapore", "Title": "“No frills hotel in Berlin”", "Author": "Gryphon1403", "ReviewID": "UR108489957", "Content": "Stayed here as part of a Contiki tour in May 2011. Location was average, about 3 stops to the Zoo area, and about 15-20 minutes by U-bahn to Alexanderplatz, Rooms very basic, nothing to shout about. There were good options for food and supermarkets nearby, about a 10 minute walk away. Service wasn't that impressive, staff were not overly friendly. Would probably not stay here if I were in Berlin on my own, and try to find a more central option instead.", "Date": "May 16, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "5", "Sleep Quality": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Brighton, UK", "Title": "“Basic, cheap and OK location”", "Author": "Charlie_Lon", "ReviewID": "UR107811245", "Content": "Basic hotel, the interior corridors are very basic, bit like a hostel. Rooms are comfortable, OK size, mini-bar, TV no bath. Location really good for Nollendorfplatz (5 mins), although you will have to walk through red-light district we had no problems with this. Staff were OK. We had a great rate so good VFM, if you get a really good rate and dont mind basic accom then would recommend.", "Date": "May 11, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "3.0", "Value": "4", "Location": "4", "Rooms": "3"}, "AuthorLocation": "Manchester, United Kingdom", "Title": "“Basic & no frills - not one for special occasions.”", "Author": "luvmyhols_10 Posted by an OctopusTravel traveler", "ReviewID": "UR105913558", "Content": "We had breakfast included in our deal but it was quite poor. We ate at a table that was not cleared by the overstretched staff. The hot food consisted of scrambled eggs That was it. I was told they'd ran out of sausage and anything else. However accommodation was reasonable and ticked most boxes.", "Date": "April 28, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Liverpool", "Title": "“Getting from the airport to Aldea Hotel”", "Author": "DAYTRIPPER63_9", "ReviewID": "UR104264961", "Content": "Not central but only a short distance you can be at Alexander Platz in less than ten minutes, the hotel is a short walk from the U Bahn station of Pullowstrasse which is the red line U2, we found it very easy to get to the hotel from the airport.....from Schonefeld its a 5 minute walk to the train station, you can get a ticket at the airport or the train station, the ticket you will need is a Einzelfahrausweis, which is 3 euros and covers zones A,B,C take tha airport express which is usually from platform 3 or 5 but its a large double deck red train so you can't miss it. to Zoologischer Garden(Berlin Zoo) then walk outside to the U Bahn red line (U2) and take the underground in the direction of pankow the hotel is only 3 stops to Bullowstrasse, just before the station stop you will see the hotel on the right hand side, after you get off the train just exit the station, cross the traffic lights and you are on Bullowstrasse the hotel is a short walk along.....", "Date": "April 16, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Oslo, Norway", "Title": "“Comfortable hotel”", "Author": "Fershtet", "ReviewID": "UR102806259", "Content": "Located just half an hour walking from central places like postdamersplatz. Old hotel but clean. Near the public transport.", "Date": "April 4, 2011"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Overall": "2.0", "Value": "2", "Sleep Quality": "2", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Carlisle, United Kingdom", "Title": "“run of the mill hotel”", "Author": "fineman31", "ReviewID": "UR101137067", "Content": "this was the second time we have stopped at this hotel ,however it is under new management ,and the standards have dropped,,there is no minibar ,as was before ,also there is no sauseges or sausege meat for breakfast ,as had been previously. The main problem is the unwelcoming receptionist staff ,who do not seem to smile or go out of their way to be freindly or helpfull,also the noise from the hallway could be heard quite clearly in the room at night,on one occasion there were no clean towels and the sink needed unblocking ,which i unblocked it myself,all in all i was unimpressed with this hotel", "Date": "March 22, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Location": "3", "Rooms": "4"}, "AuthorLocation": "", "Title": "“Good to stay for one night or two”", "Author": "Azzkikr", "ReviewID": "UR100049853", "Content": "I was there on weekend. Near uban, 20 minutes from Alexanderplatz (U2). Huuuge breakfast :)", "Date": "March 13, 2011"}, {"Ratings": {"Service": "2", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "London", "Title": "“Good for the money and location - no fleas on me!”", "Author": "MonaLondon", "ReviewID": "UR99900173", "Content": "A good, basic, clean hotel handy for the main sights of Berlin with good transport links. There was an odd smell of eggs in the reception area for the duration of the stay - not sure if that was the from the kitchen or the drains. Room was clean and comfortable - about on par with a Travelodge. Breakfast buffet is excellent value at 5 euro. They were very slow at clearing tables and refilling coffee but for a 5 euro jumbo breakfast you can do that yourself. Neither the prostitutes outside nor their Johns bothered us when we were going in and out and they weren't exposing too much flesh unlike some other cities in Europe.", "Date": "March 12, 2011"}, {"Ratings": {"Service": "2", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Sleep Quality": "4", "Rooms": "1", "Location": "4"}, "AuthorLocation": "Kingston-upon-Hull, United Kingdom", "Title": "“I dont like having flea bites.”", "Author": "Olliivviiaaa", "ReviewID": "UR98122635", "Content": "Okay so basically it ruined my whole trip. I have stayed in many 3 star hotels all over the world but never have i ever wanted to come home to grotty england. For a start out rooms were late. and then when we got into them, I had black, what looked like animal hair in my bed as did my friends. And another persons room on my trip smelt like smoke. The couch also fell through in another persons room. We complained about the animal hair and they were more that helpful and changed the covers they were however not very helpful about the smokey room...basically said get over it. The 2nd day after walking around for hours around berlin we come back to our room to find more black animal hairs.....it then became clear the next morning that we had bites.....flea bites. And my teddy ( yes i am 20 with a teddy lol) had been chewed through. The hotel staff simply shrugged it off. I was disgusted. The food at dinner was okay....service a bit slow, and i was outraged that they were expecting you to pay 2 euros 70 FOR A GLASS OF TAP WATER!!!!!!!! o and if you want a prostitute thats the place to go....it was like been in the middle of the light district...although they did not bother you, they just hung about outside. o and if anybody else is getting a shower at the same time as you, dont expect a warm shower! Another problem we had was with the vegeterians....We were provided packed lunches and despite been told they wanted no meat...they still put meat in the sandwhiches..so many people went hungry untill we could find a cafe. I am also allergic to sulphur and can only eat certain things they did not however accomidate this and still continued to give me foods that contained it dispite been given a list of foods i could not eat. Just dont waste your money....not worth it at all!!!", "Date": "February 26, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Bristol", "Title": "“Good value, good location”", "Author": "Rainbow2K Posted by an OctopusTravel traveler", "ReviewID": "UR95688503", "Content": "Basic room, but clean and adequate. Tea /coffe making facilities would have been nice. Good location close to U -Bahn and buses. Staff very helpful. Luggage storage facility was very useful. Great breakfast.", "Date": "February 6, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Athens, Greece", "Title": "“The most relaxing stay!!!”", "Author": "MaryKornaros", "ReviewID": "UR94730181", "Content": "We went to Berlin on our honeymoon and chose Aldea Novum to stay.It is located near U-Bahn, the metro line that leads both to Alexanderplatz and Potsdamer Platz.The staff are all cheerful and helpful.It is spotlessly clean.And the breakfast is king-size!!!We want to stay there again sometime soon!!!", "Date": "January 28, 2011"}, {"Ratings": {"Service": "2", "Cleanliness": "1", "Overall": "1.0", "Value": "5", "Sleep Quality": "1", "Rooms": "1", "Location": "4"}, "AuthorLocation": "London, United Kingdom", "Title": "“horrible rooms, prostitutes line the street outside, but cheap so you get what you pay for”", "Author": "RICH7490", "ReviewID": "UR94365131", "Content": "The hotel is about a 20 min walk from potsdammer plaz station which is good as this meant that we could walk into town most days. although there is a train station 1 min walk away if you do want to use public transport, this will get you to alexander platz in about 10 mins. so for this reason i would give the hotel 9/10 for accessibility. the breakfast is also varied and nice this also deserves a 9/10. HOWEVER the rooms are worn out and stunk of cigerettes with air fresher sprayed over the top. there are hairs and dust in the radiators, nothing in the bathrooms is attached to the wall properly and so just hangs off the wall and the bathroom door has horrid brown marks up the bottom of the door. I was in room 321 and i must worn you that the sofa is broken so that when you sit on it you fall straight through. the corridors on the way to your room are horrid and outside room 321 you have a punched hole in the room which also is not good. I told the hotel staff about these issues and the gentleman replied saying that the hotel was indeed (he used the swear word in english for poo) and that there was nothing he could do. So that wasn't helpful whatsoever and it fills you with so much confidence when the staff hate the place they work for too. At night outside the hotel on bullow strasser is one of the biggest and most busy red light districts i have ever seen in my life. Women line the streets on both sides this is very uncomfortable and although the ones around the hotel leave you alone, if you walk futher afield they can get quite insistant and annoying. the hotel has its good points - breakfast and where it is located in terms of getting to the city and its is cheap. However i feel in conclusion that the bad points outweigh the good points to a massive extent espeically because of the outdated and dirty rooms and because of the plethora of prostitutes lining the street at nights.", "Date": "January 25, 2011"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Sleep Quality": "1", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Sierra Madre, California", "Title": "“Hot room and loud street noise”", "Author": "Astroph", "ReviewID": "UR88884708", "Content": "The room was nice on the inside, basic european room. Only half of the hotel has free wifi internet, unfortunately my room was on the half that had to pay 10 euro a day. Hallways are very old and dirty. Clunky key that you are asked to give to the front desk every time you leave the hotel. Slow service in the restaurant, but the breakfast was decent. You can probably find a newer and nicer hotel for the money. The air conditioning did not work and the room was very very hot. The noise from the road is pretty loud, which means it is hard to sleep at night. Had to open the windows to cool off the room and the noise was even louder.", "Date": "December 2, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "4", "Sleep Quality": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Pancevo, Serbia", "Title": "“What you pay is what you get”", "Author": "gaga976", "ReviewID": "UR88065765", "Content": "The hotel is near the center, although Berlin does not have just one center. Aldea is near Potsdamerplatz and Ku’damm. With the U-Bahn, that is just a few minutes by foot, you can easily reach all tourists attractions in the city. You also have a great connection with the Tegel airport: Buses txt, x9 to the Zoologischer Garten and then U6 directly to the hotel. The hotel has its own garage (I think that you have to pay it), but it’s not that easy to use car in Berlin. Because you would need a sticker (also have to pay for it) proving that your car fulfills ecological standards (green, orange, red). The hotel’s neighborhood is typical \"muli-kulti\" German surrounding. You can find big grocery store nearby (REWE) and also Thomann where you can by cosmetics, teas, drinks etc. Next to the hotel is a nice German Kneipe (Tavern) where you can drink beer and smoke (not allowed for persons under 18). I didn’t see any suspicious characters or ladies of the night, although some of the people who wrote review mentioned them. I, and my two colleges, all aged 34 and female, felt safe. The room is ok. It is an average 3* room. But you don’t want to spend your day in Berlin locked in a hotel room anyway. I think that for that money, you can’t get better place to stay. Just don’t expect any luxury. But you’ll get good, quite, undisturbed sleep, clean bathroom and very good location. I didn’t have breakfast in the hotel. But you can find good bakeries all over Berlin and eat for couple of euros. Hotel corridors look not that clean and nice, but you don’t sleep in corridors anyway. :) I’m often in Berlin and I find this hotel best value for the money.", "Date": "November 24, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "3", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Glasgow", "Title": "“you get what you pay for”", "Author": "Mackgi", "ReviewID": "UR87011621", "Content": "The location was easy to find from the airport & has nearby access to the U Bahn. The breakfast had an outstanding choice & even if you pay the 12 Euros for it, it is value for money. Although the hotel was busy with coach parties there was not much noise, just general comings & goings. The room was cleaned every day, the beds comfy but squeaky & the bathroom was very small but perfectly adequate.", "Date": "November 14, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "2", "Sleep Quality": "1", "Rooms": "1", "Location": "2"}, "AuthorLocation": "Moscow, Russia", "Title": "“the worst hotel in Germany”", "Author": "svetlana273", "ReviewID": "UR86829236", "Content": "The hotel has dirty walls and floors in the corridors and rooms. Elevators are too old and have broken glass doors. In the room all the furniture and all the equipment is old. The bathroom is too small, the door in it is dirty, the washbasin is broken. The receiption staff is not helpfull, not kind and polite. It was my third time in Germany in the year 2010 and I expect the hotel to be not bad, but I made a mistake when selected it. The biggest surprise was the staff - I cannot expect such a ungracious staff to be at the German hotel!", "Date": "November 12, 2010"}, {"Ratings": {"Service": "2", "Cleanliness": "2", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "2"}, "AuthorLocation": "SJ", "Title": "“Think twice and more...”", "Author": "Codmex", "ReviewID": "UR80970251", "Content": "If you are from US No stars. Type Motel. 100 m from Subway. Safe area. Location OK, Turkish etc. Room 10m. Square – max No coffeemaker, no iron, no alarm clock. TV size of notebook Fridge bar Breakfast if not included 12 euro never tried Bathroom: hair dryer, shampoo… OK. Size: if you are 200 pounds ( I am not) not much space. Shower: watch your elbows. Overall size as a dog house. Corridor carpet stinks. Last time cleaned before WWII. Parking: 10E a day Internet only in lobby, price 10E!!!! PRICE: !!! First night: 68, second: 80, 3,4,5, = 160 Euro. Company paid. Look for Hostels", "Date": "September 25, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "2.0", "Value": "2", "Sleep Quality": "2", "Rooms": "1", "Location": "2"}, "AuthorLocation": "NSW", "Title": "“Clean but Cold not a very nice area”", "Author": "Krissishi", "ReviewID": "UR76581748", "Content": "Very cold plain room. Walls are a greyish white colour with no decoration. The rooms were simple, empty feeling and a bit depressing. The hotel seems to be on a main road where hookers stand to get business - the street workers werent right outside the hotel but straight across the road. I wouldnt say this area is safe at night, but if you are staying in and just need a place to lay your head, the subway into Berlin is just up the road. I wouldnt opt to stay here again.", "Date": "August 23, 2010"}, {"Ratings": {"Overall": "3.0"}, "AuthorLocation": "", "Title": "“Not Great for the money, but not the worst by far.”", "Author": "Jimmypirate", "ReviewID": "UR75765423", "Content": "The hotel was clean & tidy but certainly somewhat dated and dainty. No idea where the star rating was applied from? I intend to stay at a hostel next time as its much cheaper and you dont expect as much as its less than half the price.", "Date": "August 18, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "3", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Miss_Kitten", "Title": "“Good hotel, great public transport, cheap & cheerful”", "Author": "Miss_Kitten", "ReviewID": "UR75084922", "Content": "I stayed with a friend for 7 nights in July 2010 to explore Berlin. The pros of the hotel, it was clean, even when we left late in the day the room was still cleaned for us coming back, the staff were very friendly & helpful to us, the room was a good size with a good shower and the public transport from near the hotel was really good! The major plus point was the rate we got the room for, it was very reasonable on a package deal of flights & hotel! Didn't eat in the hotel, so couldn't tell you what the food is like. Cons - the area, is in the red light district (however please take note we are two girls in our late 20's and despite coming back at all hours got no bother at all), felt quite safe in the area, despite initital shock on the Saturday night. The hotel does not have air conditioning so bear this in mind when you are booking in the summer, as it was 32-38 degrees when we were there & it was pretty hot! Also right on a main road, so quite noisy (more so because we had window open all the time due to the heat!). It depends what you want out of a hotel in Berlin, if you want a cheap, clean base in Berlin, with great transport links, this is the place for you! Only takes about 10/15 minutes to walk to KuDamm as well. If you want something a bit more romantic, with air conditioning etc maybe not. I'd recommend to friends but not everyone! I thoroughly enjoyed Berlin and the hotel though...", "Date": "August 13, 2010"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "Cascina, Italy", "Title": "“3 days trip”", "Author": "giorgi_enrico", "ReviewID": "UR73208334", "Content": "We stayed in Berlin from 26th to 29th December 2009. The hotel is located in Bulow strasse, a 5 minute walk away from the underground station. This was perfect to us, as it allowed us to move around the city very quickly, even though the hotel is not in the very center of the city. The hotel is very nice: the rooms are very clean, the staff is very kind. We had the breakfast included: the buffet was very rich and offered all kinds of breakfasts. So I would recommend this hotel to everybody who is going to visit the city, also for the excellent price-quality rate. We paid 20€ per night per person!", "Date": "August 1, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "3.0", "Value": "5", "Sleep Quality": "2", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Finland", "Title": "“Good value in Berlin”", "Author": "Annemi83", "ReviewID": "UR71945101", "Content": "We stayed in Agon Aldea hotel in Berlin in beginning of July. The hotel was good (we got a REALLY cheap price for it) and I found it to be in a great location for 2 female travellers who wanted to shop. Ku'damm is close, so are various restaurants. Rooms were clean, staff friendly and we felt safe there. The only minus would be the prostitutes at the street and no air conditioning in the rooms. It was HOT in July!", "Date": "July 22, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "5", "Sleep Quality": "2", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Derby", "Title": "“Good Cheap room.. but read on”", "Author": "onlyfools", "ReviewID": "UR71463263", "Content": "We stayed here for 2 nights on 16th & 17th July for £85 for 2 nights for 2 people. When we arrived at the hotel at midnight the hotel looked okay from the outside (there were a few, shall we say street workers in that area?) We were quickly shown to our first room, which was very small and the toilet didnt flush. We instantly called down to reception and were given another, larger room with a working toilet. Was clean, basic and had all the right amenities. Had a decently priced mini bar, cable tv and hairdryer and the shower was fab! The only thing i would say is that, in the summer this hotel should have air-con. The heat was totally unbearable, we didnt sleep a wink the first night even with the windows wide open! Also, I know its europe and i know some people find this a bonus, but the porn channels that are a standard channel on the TV really threw us, so becareful if you are travelling with youngsters. The only other thing that I found a bit disapointing was when we tried to have a meal in the restaurant. We asked for a table for 2 and the waiter asked whether we would like to be in the main restaurant or seated outside. We choose outside because of the nice weather, however we were sat there for at least 20 minutes without anyone asking for our drinks order never mind giving us a menu. There was a table of around 8 people sat next to us and they were waited on hand and foot. After about 30 minutes we got up left and went round the corner for a delicious pizza. All in all, good cheap hotel in a good area. Dont know if I would stay here again, but it isnt bad at all.", "Date": "July 19, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "3", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Auckland", "Title": "“Cheap room with everything we needed :)”", "Author": "Shaymis", "ReviewID": "UR66683394", "Content": "We stayed at the Agon for 3 nights at the end of May 2010. We had booked a few months earlier online and I had read a few reviews saying it was pretty average. All in all we were very happy with the room, it was clean and had everything that we needed. The only complaint I had was that the staff at reception were quite blunt, and came across as a little rude but i'm not sure whether this was just the different culture (we're from New Zealand so people are quite different). The location was perfect for what we wanted to do and see. We hired bikes from the hotel to do a day of riding around, these were reasonable priced at 12 euro each, although the bikes were in pretty bad shape, they did the job though. So for the money we paid, which was quite cheap considering the location and the standard of the rooms, we would very happily use this place again as our base for another Berlin adventure :)", "Date": "June 7, 2010"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "3", "Overall": "3.0", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Wellington, New Zealand", "Title": "“Pretty basic, but no complaints”", "Author": "buds_nz", "ReviewID": "UR64303199", "Content": "Stayed at this hotel as part of a Contiki tour. It was pretty basic, but up to standard, other than the \"Germanic bedding\" scenario, which we became quite accustomed to - that is to say, a very thin duvet, a very thin and large pillow, and no additional bedding in the room. Also there is the \"Germanic Double Bed\" basically two singles pushed together pretending to be a double. We had an included meal, which was actually of quite high standard, and the breakfasts were very substantial - compared to most other breakfasts in Europe! The hotel isn't located near the city centre, but was easy to access via the metro, which is very efficient and easy to use.", "Date": "May 16, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "4", "Overall": "2.0", "Value": "2", "Sleep Quality": "2", "Rooms": "3", "Location": "3"}, "AuthorLocation": "San Francisco, California", "Title": "“If they're going to be nasty, at least make sure the phone works..”", "Author": "sibleyrand", "ReviewID": "UR63039864", "Content": "A solid 2.5 or 3 stars - economical, clean, but nothing fancy. totally fine. Except, the phone in our room didn't work at all. As we had to make arrangements with friends immediately upon checking in, we inquired at the reception desk if they could repair the phone. They could not, but they offered to dial the phone for us at the front desk - so long as it was local. Fine, we said. Then as I made arrangements to talk to our friend about where to meet, the woman who made the phone call shot me a dirty look and indicated that I should stop talking immediately. Heavens! First the phone doesn't work. Then the dirty attitude for the necessary favor? I'd never recommend a hotel who would treat their guests with such rudeness to anyone I actually like.", "Date": "May 2, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "2", "Overall": "3.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Athens, Greece", "Title": "“NIce value for money hotel, but nothing special.”", "Author": "ad_art", "ReviewID": "UR61394788", "Content": "Stayed there for a week, we had a good deal for 6 nights with no breakfast. The hotel is situated in an area with nothing special to see, but it is convenient as the U2 metro station is just 100m away. At nights there was a lot of prostitution in the avenue outside but we didn't feel any threat or danger at all. The room was large enough with comfortable beds and preety much sound-proofed, as we weren't annoyed from the noise on the street outside. Big plus the free safe in the room and the small sofa and table. The bathroom was a bit small, but very convenient, you didn't need anything bigger. The staff was nice enough and they were willing to help if you asked for something. We didn't have breakfast, but as I saw it was very rich with everything you needed to eat. The only big drawback was cleanliness. The entrance to the hotel was full of garbage and cigarettes from the street and noone seemed to clean them or even bothered to do so, plus it smelled like sewers (I guess they might had a problem those days). The cleaning lady in the room didn't do almost anything, except from making the sheets. I think she didn't even vacuumed! Overall, it' s a nice hotel if you have a good deal.", "Date": "April 15, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Gothenburg", "Title": "“Good choice for weekend break”", "Author": "Kerte", "ReviewID": "UR61142201", "Content": "+Convenient Location with easy access from Tegel Airport 20min away with public transportation +Comfortable beds +Clean +Very good breakfast +Quiet yard for coffee in sunshine in the morning +Safe in room at no extra cost -Very small bathroom with shower althogh sufficient -Bad lighting in bathroom -Quite noicy since no Aircon and need for fresh air during sleep in room Overall Good Value for money spent.", "Date": "April 12, 2010"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Cambridge, United Kingdom", "Title": "“Good Berlin base”", "Author": "kirstyboo79", "ReviewID": "UR56576105", "Content": "Right by U-bahn (without being noisy) so can easily access everywhere in city. Very good deal on room. Friendly and helpful staff. Room was large and beds were comfortable; extra pillows and towels provided, and bathroom clean.", "Date": "February 20, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "4.0", "Value": "5", "Sleep Quality": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Oslo", "Title": "“Good location”", "Author": "VacationOslo", "ReviewID": "UR55962641", "Content": "The hotel is close to the \"Bülowstrasse\" station at U-bahn (Metro) U2. I stayed at room 314. The hotel looks newer on the outside, than the inside. My room was large with double bed and a ekstra sofabed. The bathroom was very small, but well functioning nevertheless. The TV was very small. There is a mini bar and safe in the room. The bed was average and may be a bit hard. I didn't pay for breakfast at the hotel (12Euro) and opted for breakfast at the many cafes around Nollendorfplatz with a whole more charm. The staff at the hotel was very friendly. They had a system of ID-card having you to identify you as a guest when picking up the room key. After some time it gets a bit annoying having to get in line in order to get your room key. If there are many checking in/out at the time...you may have to wait in order to get your room key. During my stay I woke up several times due to noise from people talking in the hall way. The rooms are not \"sound proof\". The location is great, and I would stay there agian if they have a great offer. Note - check out time is 11:00, not 12:00. The hotel is easyly reahable from Tegel airport. The Bus X9 takes you to Karl Reuter platz where you connect to the U2 towards \"Pankow\" and gets of at \"Bülow strasse\". The ticket costs 2,10 Euro and is valid for 2 hours in one direction. You have to validate your ticket on the bus.", "Date": "February 14, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Mallorca", "Title": "“Fantastic hotel in a convenient location of Berlin”", "Author": "danimallorca", "ReviewID": "UR52075842", "Content": "We stayed for 3 nights in Nov 2009, room 121. In general, the hotel was great. Good location, good service, excellent breakfast, good sized rooms, good cleanliness. The bathroom was a bit small, but it was fine for just a few nights' stay. The hotel is on Bülowstrasse, right opposite the U-bahn station, just accross the road. It's handy to walk to the Sony Centre and Potsdammer Platz. There is a nice little cafeteria just on the corner (near the traffic lights), that do nice coffee. There are also supermarkets near to the hotel. If you're travelling with children, watch out for the (hard) porn channels on TV!. There is also Spanish TVE internacional, an English speaking channel, etc. The digital safe is free. We couldn't find the \"red little button\" as per the safe instruction description, and we had to call reception. We must be stupid!. There were some vending machines on the ground floor (water, juice, etc). We found that we had everything that we wanted. Breakfast was great, especially the slices of different cakes!. Sehr Lecker!!!. And the scrambled egg and German sausages!. I would recommend this hotel and as I loved every minute that I was in Berlin, and really want to go back sometime soon, I will definitely think about staying in the Agon Aldea again. It's excellent value for money. My friend who I travelled with is a travel agent, and I know that she has already recommended to hotel to some of her customers. The only possible negatives that I could find were: - some of the reception staff were more friendly than others - some of the ground floor area (near the lifts) could really do with a lick of paint and updating I would rate it: 9/10", "Date": "December 29, 2009"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Rio de Janeiro, RJ", "Title": "“Simple, well located and confortable”", "Author": "priscillaamador", "ReviewID": "UR52012781", "Content": "Located near to the Potsdamerstrasse, the Agon Aldea Hotel is well located in terms of public transportation. Also, many nice worthy visit places are reachable by walking. The rooms are confortable, yet nothing too luxurious, but make an impression of a more expensive hotel.", "Date": "December 28, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "3", "Overall": "4.0", "Value": "5", "Location": "5", "Rooms": "4"}, "AuthorLocation": "birmingham", "Title": "“great value & excellent location”", "Author": "chrisengland01 Posted by an OctopusTravel traveler", "ReviewID": "UR49625720", "Content": "for a cheap hotel near a Metro stop, this hotel is ideal. The breakfasts were fabulous & filled us for the whole day. Some of the hotel needs a bit of a paint but for the price, who cares! There are lots of nice bars & restaurants 5-10mins walk. The staff were very friendly & spoke good english.", "Date": "November 20, 2009"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "", "Title": "“Great Hotel”", "Author": "NuritL", "ReviewID": "UR49191295", "Content": "Good location with subway and bus stop at the hotel and walking distance to many great places.", "Date": "November 14, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "4", "Location": "4", "Rooms": "1"}, "AuthorLocation": "belfast NORTHERN IRELAND", "Title": "“good budget hotel longs you dont mind a hard bed night sleep and a swing a cat bathroom.”", "Author": "andi042", "ReviewID": "UR47256268", "Content": "Here for my Birthday treat and chose this hotel for its location. It scores high on it's presentation at reception with its prompt service when you require anything extra ie blankets, iron etc. Breakfast I defy anyone not to say they couldnt fill up for the day. All freshly baked and abundantly self served. The room was very clean but do be warned the bed is a twin and not comfortable.Not for the romantic weekend. The bathroom, if thats, what it should be called , was a square box,no wider than the stretch of arms.cramped with a capital C or for the over weight person you enter at risk to get stuck.!!!! As a female, when channel hopping, I found it absolutely hilarious as the male viewing was free for the explicit channels but not the football !!!!!!!!.I came to the conclusion this must be a Carlsberg hotel !!!!!!!! The one thing that down grades the location of this hotel was the open street prostuition girls by the next street, it was so openly in your face. I learnt its legal.on the up side of this hotel it boosts fantastic connections for sightseeing with two U band stations at an easy 5 &10 mins walk away.the all day ticket was 6euros. I was impressed by the affordable restaurants especially the San Marco up four blocks from the hotel left by the nollendorfplatz U band station..A Quaint full of character Italian. Snack kiosks were every where. Like most eateries they were very affordable and had quality for monies worth. Everywhere was kept litter free! Shopping? for the unusal, it was here but good old fav's were here too like C&A. Berlin has surprises every turn on the streets historically, expect it, to make you think deep and be sadden by what you view. The Wall, that still stands, is cold and hard,( what's left of it). But what I'll remember most is having the opportunity to listen to a real life experience of east/ west division of a brother and a sister and a growing tree that signalled they were ok. This city does have two tales to discover. What I liked best, was, experiencing the blening in of real German way of living. This city thrives with mast citizens well within its main district. Germans, take No compromise on food quality here, all food markets are full to the brim. all food stalls of fruit and veg and bakeries are colorful and inviting you to eat.. Berlin is very inviting but on the down side it could make alittle more effort for translation English around the main tourist attraction monuments etc.", "Date": "October 19, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Location": "4", "Rooms": "2"}, "AuthorLocation": "Belfast, United Kingdom", "Title": "“The bed let this place down”", "Author": "navigator", "ReviewID": "UR47249687", "Content": "The Aldea is a basic well placed hotel. Checkin was very efficient but it is a very dull hotel decor wise. The room was ok but the beds were two single wooden framed beds put together which creeked every time you moved. All the rooms on the sixth floor were the same. The bathroom was very very small and I have attached a picture. Shower, tiolet & sink. If you are a lager person then think twice about this place. Service was good. The room had no iron but I asked at reception and they delivered within half an hour. No tea or coffee making facilities but a well stocked fridge is in the room and not over priced. Be warned that if you have children, the TV has 24hr xxxx movies for free. Only one english speaking channel which is next to the xxx channels. Also, windows open wide so again, please be careful if you have children. The hotel does have a restaurant but we only used it for breakfast which was of a very high standard and quality. The exploring the city, the Buelowstrasse U-bahn is approx 200 meters away to your right. This will take you to Wittenbergplatz for the KaDeWa shop or Zooglischer garten for main shopping on the Kudamm or you can get the Pankow train to Potsdamer Platz which has a fine shopping centre and restaurant area. You can also go to Alexander Platz which also has a shopping mall which I preferred. All destinations are less than 15mins away and you can get a day ticket from reception which is 6.20 Euro each. You must validate these tickets on the platform before you travel. For a nice little restaurant near the hotel. Take a left out of front door and walk for approx 10 mins. A small Italien restaurant called San Marco which also does german food. Graet price, meal for two with drinks under 30 euro. It is a local place and we used it twice. Know your german though for menu. It is a very safe area though you will see the local female nightlife after 9pm.", "Date": "October 19, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "3.0", "Value": "5", "Location": "4", "Rooms": "3"}, "AuthorLocation": "Bath", "Title": "“great value at a busy time”", "Author": "BathHappytraveller", "ReviewID": "UR39046287", "Content": "We stayed at the Aldea during the Athletics competition, so it was a very busy weekend and we probably wouldn't have stayed here otherwise. Other hotels were very much more expensive, some had put more than £100 on their usual prices. Having said that, the location is very good - but I don't think you can go wrong in Berlin as every district has a lot to offer. We upgraded to rooms at the back as the front, above the main road, is so noisy you can't open the windows and it was too hot with them closed (no a/c). I would compare the hotel to a Travelodge in style, fairly small and basic, but clean. The ensuite is tiny though, you wouldn't want to be here longer than a few nights. Can't comment on the breakfast as we ate out. A few minutes' walk down the road to Nollendorfplatz brings you to loads of great cafes, all with pavement seating. Staff are efficient and friendly enough. Overall, good value and good location.", "Date": "August 28, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "4.0", "Value": "5", "Location": "5", "Rooms": "3"}, "AuthorLocation": "Winston Salem, North Carolina", "Title": "“Great Base for Berlin--go for the breakfast, too.”", "Author": "Midwestcouple", "ReviewID": "UR38516475", "Content": "We arrived here directly after long international flights, and finding the hotel was easy from the train, and check-in was smooth. The hotel was a perfect value for the money spent, and was about a block from the Bulowstrasse U-Bahn stop--uber convenient, with trains stopping every few minutes. The breakfast was outstanding (probably our favorite of the 5 cities we visited), with so many choices, beautiful meats, fruits, and cheeses, as well as excellent coffee. Even the breakfast room was very modern and beautiful, with bright colors, good lighting, and flowers on the table. The room was like an outdated dorm room, and the mattress was a little bit thin, so 2 nights was a good length of a stay. However, I doubt we spent no more than an hour awake in the room each night, and we slept great, without any noise from the neighborhood. We would return to this hotel in a heartbeat--for the value, breakfast and location. From Tegel--took the bus to Zoologischer Garten, then the U2 3 stops toward Pankow. Getting to the Hauptbahnhof when we departed was super-easy too, and took only 30 minutes.", "Date": "August 23, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "3", "Overall": "4.0", "Value": "4", "Location": "4", "Rooms": "4"}, "AuthorLocation": "Virginia & Germany", "Title": "“We'd do it again!”", "Author": "TiredButHappy3", "ReviewID": "UR38430303", "Content": "The önly bad thing in this hotel was the placement of the reserve toilet paper roll- it had urine spots on it from previous residents! Really bad placement... The breakfast, however, was incredible- the coffee was superb, the fruit selection excellent and everything else was good, too. The desk clerks were helpful, the rooms clean and there were plenty of multi-ethnic restaurants nearby from which to choose. This hotel was in a good location and had everything we needed. We'd definitely stay again.", "Date": "August 22, 2009"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Overall": "3.0", "Value": "5", "Location": "3", "Rooms": "3"}, "AuthorLocation": "Singapore", "Title": "“Purelly a budget hotel in Berlin”", "Author": "tonnysunny", "ReviewID": "UR37587702", "Content": "Hotel is OK. This is everthing. Only OK. If you usually stay at 4 star hotels, maybe you will have a little shock as soon you arrives at the floor tdirection to the rooms (old carpet, dark corridor, abandoned cleanning trolley, etc...). The rooms are small, but smaller is the toillet (couldn't move myself \"in a normally way\" after taking shower). Furnitures are OK and quite new. Rooms are clean. Infrastructure only average (e.g. TV monitor is old and very very small). Localization is convenient (due to nearlly by metro, etc...), but the district is not the nicest one (partially ugly and cruddy). Breakfast is amazing (really great!). Reception staff unfriendly (with exception of the night staff -> they are really great as well!). Don't will stay there again. Should you are looking for ba udget acomodation, please go ahead (the hotel is not bad).", "Date": "August 13, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "4", "Rooms": "5"}, "AuthorLocation": "Troy MI", "Title": "“Great hotel - will definitely return again!”", "Author": "leopanzer", "ReviewID": "UR31764519", "Content": "The hotel is located one short block from U-Bahn, and free parking is available just across the street in the median boulevard under the U-Bahn. Front desk personnel were helpful with directions to major tourist sightseeing locations. The Breakfast buffet is absolutely outstanding with lots of variety and everything is fresh.. Rooms are spotless, clean, quiet, beds are comfortable - a great value. We had a fridge (mini-bar). We were out late for dinner and sightseeing and arrived back at the hotel at 1:00 am; it is a safe area (no prostitutes as a previous review alleged). We will definitely return here on our next visit to Berlin.", "Date": "June 7, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Location": "4", "Rooms": "3"}, "AuthorLocation": "Tampa, Florida", "Title": "“Good hotel but better location”", "Author": "tenCA951", "ReviewID": "UR31504517", "Content": "(Review is from October 2007) Our first impression of the hotel was of hesitance due to the prostitutes that we saw nearby; however, it ended up being a very good stay and we even decided to stay an extra day. The lobby was nothing extraordinary. The service was pretty average but the hotel's breakfast was a great way to start the day. Additionally, the rooms were not anything other than average. The best things about the hotel is its location and proximity to Berlin's metro. The ease of taking a train really helped discover a city as comprehensive as Berlin. It is also within walking distance of many tourist attractions and has several shops located nearby for snacks and water. The other thing great about the hotel was the price that we paid; it was very much worth it. We absolutely loved Berlin and if we go back, would likely stay here again.", "Date": "June 3, 2009"}, {"Ratings": {"Service": "1", "Cleanliness": "4", "Overall": "2.0", "Value": "3", "Location": "4", "Rooms": "4"}, "AuthorLocation": "New York, NY", "Title": "“Dump in Drag”", "Author": "SafariPartei", "ReviewID": "UR31324433", "Content": "Good location with Buelowstrasse U2 station a block away. Bought room online for about 60 Euros per day. They let me go straight to a room even though I arrived a couple of hours before official check-in time. Clean room. The two single-person beds were fine. Typically, there was only a comforter covered in a sheet sack. Berlin still has cool nights in May so this was okay in the middle of the night, but I am used to a sheet/blanket combo as this is more comfortable if it's still pretty warm in the room as you are going to sleep. Although the beds were comfortable enough, they also held a hidden danger. The wooden frame around the beds rises up to within a couple of inches of the top of the mattress. If you suddenly try to kneel on the edge of the mattress, as I did, your shin will rapidly extend downward with the mattress and bang into the wood, as my shin did, causing a rather serious bruise. The mini-bar under the desk had a nice little assortment of snacks and drinks. If you were desperate and wanted to pay five Euros for a beer or a box of peanuts, it might come in handy though there is all-night food and a non-stop bar, not to mention one or two non-stop Maedchen's, on the corner of Buelowstr. and Potsdamer Str. While the beds were fine, the sofa/bed in the corner was a bit ratty. One of its slats actually popped out when I sat on it. The cloth cover over the whole shebang was disintegrating. Not very sturdy. I never actually tried to unfold this sofa and sleep on it, but it seemed a bit dubious. There was no Do Not Disturb or Lass Mich in Ruhe or whatever sign in the room. In fact, the staff appears to not be familiar with the concept. While I had already gone out into the hall and traded my dirty towels for three clean ones, the cleaning guy came in, after I had left, and did the room anyway. The TV had the usual assortment of about two dozen channels, including the BBC and maybe a couple of others auf Englisch. The pay sports/movie/porn channels were activated for much of my stay. This was alarming as a note on the TV said there was a 10 Euro charge for these channels and that this charge was billed directly to you and the hotel had nothing to do with it (except of course for supplying the Deutsches Porno Kanal with your credit card number and expiration date). I had done nothing to activate these channels. The front desk people told me they were only supposed to play for a couple of minutes at a time in a preview mode. Not all the staff were friendly. The head day-shift desk clerk was efficient but not terribly warm (personality-wise; I did not check her actual body temperature though it would not have been at all surprising had this been well below the norm for warm-blooded creatures). And it wasn't like you could just ignore the staff. Not here. Just like at a little family-run French hotel, this place uses actual room keys, with each room key having a very heavy weight so you don't forget to return it to the front desk every time you go anywhere. Each time you return, you have to tell them your room number. If they do not remember your face, which was the case pretty much each time a new shift came on at the desk, you would also have to produce ID or have them look up your name. What a freaking pain. To be fair, some of the front desk staff were personable. However, the aforementioned head day-shift clerk made sure to ensure my departure was unpleasant by refusing to give me a receipt. Obviously, I needed a receipt in case there was some future confusion about charging me for the premium channels which I had never activated. She stated that I already had a receipt from the internet outfit from whom I had booked the room. This reminded of the policy for the porn channels. It's between me and the company I booked from and the hotel has nothing to do with me being a guest there.", "Date": "June 1, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Location": "4", "Rooms": "5"}, "AuthorLocation": "Swindon - England", "Title": "“Good Hotel”", "Author": "wila", "ReviewID": "UR29920237", "Content": "I stayed at the Agon Adea in Berlin for one night. My visit ti Berlin was to watch football at the Olympic Stadium - Hertha Berlin - Bundesliga. The hotel was a 30 minute walk from the main Railway station but only 2 minutes from the Bullow Strasse underground station.. The hotel room was excellent, clean and tidy. I had a half board option, bed & breakfast followed by evening meal. The breakfast was superb with fantastic choice. When I went to the Restaurant for evening meal I found the younf man serviing me to be slight ruse. I was only allowed to choose a main dish rather than a starter and dessert. This was extra and had to be paid before leaving the Restaurant. There are a few bars very near or the hotel and places to eat as well. I walked from the hotel to Potsdamer platz, Checkpoint Charlie, Brandenburg Gate, Reichstag which was very pleasant. My main reaosn for visitn gBerlin was to watch the football. The Olympic Stadium was only 20 minutes away on the tude and you did not havbe to change trains. Head for the direction of Ruhleben. I would recommend this hotel for a visit to Berlin,. It is handily placed for the city sights.", "Date": "May 13, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Nijmegen, The Netherlands", "Title": "“good hotel”", "Author": "paul4dirt", "ReviewID": "UR28332302", "Content": "good hotel with a lot of rooms and still a good service. + friendly staff at the reception + clean rooms and good cleaning + good furniture: couch and chair, desk with tv and bar, nice bed + cnn, skynews and other tv-channels + very near metro U2, which means you can get anywhere you like till about 0030 AM. (in weekends the metro runs even at night) + lots of small restaurants available next to the hotel, nice for a quick snack or take-away to eat in your hotelroom. (indian and other foreign foods mostly, which is good for vegetarians like me) +/- no free internet (there is internet in the room/some rooms though, 10 euro 120minutes 5 euro 60 minutes) +/- bathroom is small but has everything you need, warning: showerwater can get REALLY hot if you don't pay attention (almost at boiling temperature i'd say), so make sure not to set it too hot. the water temperature also varies a bit during the shower. overall a good no frills hotel", "Date": "April 19, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Location": "4", "Rooms": "4"}, "AuthorLocation": "Hamilton, United Kingdom", "Title": "“Great hotel”", "Author": "saoirsechick", "ReviewID": "UR27306755", "Content": "Having read reviews for this hotel i was expecting it to be a bit out of the way, but actually found the location to be fantastic! We walked to the sony centre in about 10 minutes, and from there all the main attractions in East Berlin are sign posted and can be reached on foot! A five minute walk in the opposite direction finds you surrounded by lovely pavement cafes and bars, great restaurants and quaint little independant shops. There is also a market square at Winterfeldplatz. In the immediate vicinity of the hotel is the Bülowstraße u bahn station which takes about 30 seconds to walk to and is 3 stops from zoo station. There are a few bars on the street, one a few doors down from the hotel which has a fairly good jukebox, and plenty of fast food joints which are cheap and cheerful. Around the corner is a newsagent which sells British newspapers if you so require! Although it is next to the rail line we never heard any noise from it, or any of the local businesses. The hotel itself was perfect for us for a few days away. The rooms are an adequate size, with a small seating area with a sofa, arm chair and coffee table and a small tv. There is also a small fridge which doubles as a mini bar, reasonably priced but we used it to store drinks we bought at a near by shop! The bathroom is admittedly small, with no bath, just a shower cubicle, but that suited us fine as we didn't spend much time in it! The breakfast is great, with plenty of fresh fruit, cereals, yoghurt, various types of breads, cheeses and cold meats and salads. For a hot breakfast there were boiled or scrambled eggs, sausages and what looked like lamb koftas. They also had several types of fruit juice, a pot of coffee on every table and several varieties of tea. All in all a great hotel at a great price. We will definitely stay there again.", "Date": "April 2, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Location": "3", "Rooms": "4"}, "AuthorLocation": "Blackpool", "Title": "“Good Value”", "Author": "melblackpool", "ReviewID": "UR25949158", "Content": "We could find nothing wrong with the hotel room it was clean had everything in it you needed, bathroom was a bit small but served its purpose, the hotel is on a main road plus the train line also runs past the hotel so can be a bit noisy if you have the windows open or if you are a light sleeper take some ear plugs. It is between two underground stops Nollendorf Platz {more lines leave from here} and Bulow Str both only a few mins away from the hotel, can't coment on the food as we did not eat there we were on room only. Found all the staff friendly and helpful. The area in front of the hotel seems to be a picking up place for prostitutes but they were not a problem. Berlin is a big city so chek the hotel is in the right area for you.", "Date": "March 10, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Location": "4", "Rooms": "5"}, "AuthorLocation": "greece", "Title": "“Great experience-great location-great value of money”", "Author": "aggeliki", "ReviewID": "UR25849394", "Content": "ANGELIKI, GREECE First of all, I read al the previous views about the hotel. We spead 5 nights here and I totally agree that the location is not the perfect but it is almost just outside from the station of the UBAN 2. Even the location is not the greatest though you don’t feel unsecured on midnight. The room is quiet spacious, with even a safer, a sofa and 2 chairs. The bathroom is a little bit small but well equipped. Be careful there is not AC during the hot months. The room is exactly as it was appeared in their site. Ask to have room on the back side of the hotel in order to have totally quiet nights. The breakfast is the best. They offered everything you can imagine. I totally recommend of this hotel because you get exactly what you pay, and even more.", "Date": "March 9, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "4.0", "Value": "4", "Rooms": "5", "Location": "3"}, "AuthorLocation": "Halmstad", "Title": "“A very pleasant experience indeed”", "Author": "JohnnyBoiii", "ReviewID": "UR23313015", "Content": "We stayed at the Hotel Aldea as a part of a package deal. The location of the Hotel is quite convinient with the U-bahn stations Nollendorf and Bülowstraße just a few meters away. The neighbourhood surrounding the hotel has a few mini markets such as the \"Kaiser's\" and a late night shop if you feel like buying beer. Two streets down on Maaßenstraße there are several restaurants offering everthing from vietnamese, indian and chinese food to more traditional german dishes. I'd really like to reccomend the indian restaurant \"Amrit\" on the corner of Maaßen and Winterfeldstraße, quite possibly the best indian food I have ever eaten, massive portions lots of flavour and medium priced. The Hotel Aldea might be a three star Hotel, but the german standard would possibly put it up there with the four star hotels internationally. The immediate street surroundings might be the only real downside, it's quite dead except for the occational prositute further down the street (don't be alarmed, it's quite commonplace in most capitals), and the waiters in the Hotel restaurant are sometimes a little less than friendly. On the other hand all other staff at the Hotel are very friendly and the seperate breakfast buffét still makes my mouth water. The buffét is very extensive with 6 types of bread, an arranged selection of marmalade, atleast 15 types of ham and sausages, vegetables, 4 types of juice, milk, coffe, tea, fruits such as kiwi, cantilope, peach and diffrent kinds of yogurts and buttermilk. On top of all that there are about 4 types of cake to choose from and a few chocolate selections. You have to show your room key to gain entrance to the breakfast diner, but once you're in there you can eat as much as you like. The hotel TV has about 18 channels, most of them make out the standard german selection of channels, but for english speaking guests there is CNN and SKy News, the Hotel also has Internal pay per View channels showing englishspeaking films for 9:90 Euro. You're also able to leave your clothes in a laundry bag if you wish to have them cleaned, the price list is avaiable in your wardrobe together with a safe for valuables. The standard double rooms are very spacious with comfortable beds a tv, a sofa, a chair, a desk and a mini-bar/fridge. The fridge contains coca-cola, assorted juices, beer, red and white wine and champagne. The rooms are very clean and the bathroom (including shower and hair dryer) was spotless. I'll add some photos to this review so you can see why I like this Hotel. All in all a great stay!", "Date": "January 6, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "4.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "denmark", "Title": "“Nice hotel Nice price”", "Author": "Anette33", "ReviewID": "UR21864137", "Content": "Nice hotel Nice price. We stay for 4days and everything was good.We didnt eat at the hotel,but just around the corner at Potsdamer Strasse, there are a little cafe.Cafe Noir. Good coffee and breakfast,even sandwich and if you want you can take it with you, coffee to go it´s nice. The Hotel had very clean rooms and the bathroom was very clean. Saftybox at the room and even a minibar. The staff at the hotel was very nice and friendly. The U-bahn Bülowstrasse is just on the other side of the street, and it takes you to east and west. Zoologische Bahn, Alexander Plazt...... We will stay there again the next time we are going to Berlin..", "Date": "November 15, 2008"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Check in / front desk": "4", "Overall": "4.0", "Value": "4", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Lithuania", "Title": "“Cheap. Adequate. And noisy.”", "Author": "Donbacio", "ReviewID": "UR21558905", "Content": "This hotel is all it is said to be by the previous reviewers (inexpensive, clean, well-run and more) - the only really negative aspect is the noise factor. While during our stay it wasn't really bad (November, too cold outside to keep the windows open), it might become problemating in the summer as the U2 line runs parallel with trains going up and down every couple of minutes, day or night. If, however, you are not discouraged by a bit of the (constant) noise, this is definitely the place to stay!", "Date": "November 5, 2008"}, {"Ratings": {"Overall": "4.0", "Value": "4"}, "AuthorLocation": "Australia", "Title": "“ok hotel”", "Author": "Carla045", "ReviewID": "UR21496607", "Content": "stayed here on our contiki tour, nice clean rooms, easy walk to shops and sites. Recommend highly", "Date": "November 3, 2008"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Check in / front desk": "3", "Overall": "4.0", "Value": "4", "Rooms": "3", "Location": "4"}, "AuthorLocation": "near Chicago", "Title": "“OK Facility at a Good Price in a Great Location”", "Author": "Vicsite", "ReviewID": "UR17377718", "Content": "I can see why other people posted negative reviews, but for less than $100 (USD) per night we didn't expect luxury accomodations in the heart of Berlin. The rooms are spartan, and the bathrooms tiny, but we spent most of our waking moments in other places so we didn't really mind. Even though the neighborhood might look dicey to some people, we felt it was a safe building, and the staff were helpful. The U-bahn station is right outside the door, but we walked almost everywhere. A couple blocks west of the hotel (Massen strasse I think?) is a great cluster of restaurants and cafes, so we never ate at the restaurant. There's a great little bakery where we got coffee and pastries every morning. Another bonus is that parking is free!", "Date": "June 30, 2008"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "London", "Title": "“Good and comfortable, well located”", "Author": "bombtonic", "ReviewID": "UR15499955", "Content": "I have stayed here twice, in 2006 and 2007. Very comfy and large rooms, modern and clean. Excellent buffet breakfast served for several hours. Once I arrived in after a late night at a nightclub and it had opened at 6am...convenient! Paying 30GBP (50EUR / 60USD) per night for single occupation of a double room was very good value. It may be more now. Convenient location. Berlin has two centres (in the east and in the west) and this is pretty much in the middle whilst in a 'liveable' area with places to eat around Nollendorfplatz. It is very near to Bulowstrasse station from which you can go direct to the western or eastern centres. Good service. I didn't need guidance to attractions as I know the city well but they seemed to be giving good advice to other residents. When I called reception for an ironing board and iron, they brought one up and offered to iron my shirt - I was a bit taken aback and declined, but perhaps this is their normal service!", "Date": "April 30, 2008"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Check in / front desk": "3", "Overall": "2.0", "Value": "2", "Rooms": "2", "Location": "2"}, "AuthorLocation": "Los Angeles, CA", "Title": "“Good value for a short stay when it is cold”", "Author": "radiationmd", "ReviewID": "UR15163728", "Content": "This is a two star Hotel and the area is not the best, but if you just need to stay for a night and need a place to stay and don't want to spend much, it is perfect. The hotel has no AC so not good for summer at all. The TV was so small, it is essentially useless while you are laying down in the bed. The size of the room was pretty good for a two star Hotel although the bathroom is small yet functional. For 48 euros for two people, it was pretty good value.", "Date": "April 20, 2008"}, {"Ratings": {"Service": "2", "Cleanliness": "4", "Check in / front desk": "3", "Overall": "3.0", "Rooms": "3", "Location": "2"}, "AuthorLocation": "Street,Somerset", "Title": "“Dubious ......but it was ok!”", "Author": "Palins_Pal", "ReviewID": "UR15101379", "Content": "Wanted a few days away for a bit of father son bonding time and chose Berlin as it was an area he had not visited. Booked with Expedia, from a good number Berlin hotels. This hotel is cheap place to stay, rather than booking a twin room it was a room each at approx £19.00 per room per night. This normally would have alarm bells ringing, but Berlin is a cheaper city than most, and frankly this worked out to be more than value for money. Ok the good buffet breakfast was extra (15.00 Euro), but this hotel is good on your pocket!. No complaints about the staff. The rooms are neutral, if tired, but clean and very good sized. The bathrooms are unusually small, and the hotel is very much in the old east german vein. The location is not ideal with little in the way of bars and restaurants nearby, but the excellent U bahn is minutes away. Would agree with other reviewers about the illicit ladies prowling the streets, but what city does not have this attraction! In all a CHEAP place to stay, no palace, but for the price it fits the bill!", "Date": "April 17, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Check in / front desk": "5", "Overall": "4.0", "Value": "5", "Rooms": "4", "Location": "2"}, "AuthorLocation": "Nottingham", "Title": "“Excellent service, cleanliness and comfort”", "Author": "taniah", "ReviewID": "UR13855254", "Content": "From previous reveiws and the bargain price that we paid I had expected the Agon Aldea hotel to be basic, however I was pleasantly surprised. We arrived late on a Friday evening and upon being given a room key opened the door to find other bags and belongings in the room. We returned to the front desk and were upgraded to an apartment suite (as they had no more standard rooms left). This room was very large, with a suitably large bathroom also. The only problem I had with the room was that there was no shower curtain with the bath so when you used the shower water went everywhere. Breakfast was also impressive. The buffet provided a wide choice with cereal, hot breakfast, fruit, cold meats and cheeses and a variety of breads and spreads. The location was the only minor downside. Yes, there are \"ladies of the night\" on the nearby corners at night, but I didnt really feel threatened by this. It is very near a U-Bahn station and whilst there are not a lot of local facilities around, areas such as Postdamer Platz with restaurants, shopping and a cinema, are only a short train ride away. I was pleasantly surprised by the helpfulness of all the staff, the room comfort and the quality of the breakfast and would definately stay here again on another trip to Berlin.", "Date": "February 26, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Check in / front desk": "5", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Carrickfergus, Northern Ireland", "Title": "“No problems”", "Author": "mickums", "ReviewID": "UR13639505", "Content": "Stayed three nights. Hotel is drab and shabby but the room was fine - warm, clean and comfortable. Small bathroom but everything worked - TV, safe,shower etc. Really good breakfast with plenty of choice and some fine breads, coffee pots on all tables provided (nice touch). The location is within walking distance of Potsdam Platz in one direction and Ku'Damm (shopping area) in the other. But its not a nice area; there are prostitutes working across the road from the hotel (though this is not a problem). There are very few proper restaurants nearby but plenty of small bistros. Unfortunately these seemed to function mainly as meeting places for men only (at night anyway). Friendly helpful staff, a good value hotel.", "Date": "February 18, 2008"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Check in / front desk": "3", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Athens, Greece", "Title": "“great location”", "Author": "Kostas_St", "ReviewID": "UR13336937", "Content": "Great location, simple hotel. Subway station was just 50m away, on the line to City-Center. Berlin is anyway a cheap city, Aldea Hotel too. For me and my wife, since we decided to select hotels near a sub-station, cause we're the whole day on the streets, this happended to be a perfect choice. Breakfast was pretty simple, but the hotel was quite and clean.", "Date": "February 6, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Business service (e.g., internet access)": "2", "Check in / front desk": "4", "Overall": "4.0", "Value": "5", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Budapest, Hungary", "Title": "“Been there for the second time, still satisfied”", "Author": "balaazs", "ReviewID": "UR11157465", "Content": "I stayed at Agon Aldea for the second time now, and I still think it's great-great value for money. It's an average 5-storey buliding located right next to a U-Bahn (subway) station (Bülowstrasse), 5 mins from two big hubs, Potsdamer Platz and Zoologischer Garten. The neighborhood is not pretty, but since it's this close to the city center, it didn't really matter to me. The rooms are not too big, but okay, with satellite tv, minibar and a small, but nice bathroom (with a shower). Towels and bedsheets are always clean. Breakfast's plenty. Staff is kind and polite. It's a three star-hotel with some major adjustments which make it a great deal to stay.", "Date": "November 30, 2007"}, {"Ratings": {"Overall": "3.0"}, "AuthorLocation": "London, United Kingdom", "Title": "“Cheap & (Sort of) Cheerful”", "Author": "zzyzxUK", "ReviewID": "UR10366761", "Content": "Found this hotel through Tripadvisor, and chose it mostly for the location (wanted to be near Nollendorfplatz) and cheap price. The location is fairly central, although the actual street it is on isn't the most bustling in Berlin, and there aren't lots of restaurants/shops in the immediate area if you're interested in anything after normal business hours (like late-night food, for example). The other reviewers are right about the prostitution... my room had a nice(?) view of several women streetwalking on the side streets behind the hotel, and there was even one standing outside the front of the hotel for most of the night. On the other hand, they -were- fairly discreet compared to the prostitutes in other cities (Madrid comes to mind), and they're only really obvious if you spend your time staring out the window of your hotel room watching what people are doing outside. (I usually don't). For the price, the hotel was actually not bad. The room was very clean, the maids friendly and efficient, and I found the desk staff friendly enough (even the older ones). The best reason to stay here has to be it's proximity to the U-Bahn, being just steps away from the central U2 line, which I found most useful. So, if you're on a budget, and don't mind a little \"local colour\", it's not a bad place to stay.", "Date": "October 27, 2007"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "London, United Kingdom", "Title": "“excellent value”", "Author": "ifi", "ReviewID": "UR8283951", "Content": "A very nice hotel at a very low price! The room was very spacious and had an extra sofa, the bathroom was spotless and thoroughly cleaned evey day. Our room overlooked the car park and was extremely quiet. The hotel is central, right opposite to a U-Bahn station, though its neigborhood has not much to do or to see. I totally recommend it!", "Date": "August 3, 2007"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Business service (e.g., internet access)": "2", "Check in / front desk": "3", "Overall": "3.0", "Value": "3", "Rooms": "2", "Location": "3"}, "AuthorLocation": "vancouver", "Title": "“Good value for longer stays”", "Author": "24hockey", "ReviewID": "UR7752023", "Content": "As previously written it is a great value especially on the internet getting a the 6th day free!!! close to the ubahn...close to little fruit markets to get water and fruit for the day or night!!! Excellent cafe around the corner \"CAFE NOIR\" where we enjoyed a lighter breakfast then the 15 euro hotel buffet!!! Lots of tour buses and people in the lobby smoking but definatley worth the price!", "Date": "June 3, 2007"}, {"Ratings": {"Service": "2", "Cleanliness": "4", "Business service (e.g., internet access)": "2", "Check in / front desk": "3", "Overall": "4.0", "Value": "4", "Rooms": "3", "Location": "3"}, "AuthorLocation": "NZ", "Title": "“Good value”", "Author": "huhugrub", "ReviewID": "UR7656762", "Content": "Despite the rather tired appearance and the slow lifts, the room was clean and reasonably spacious. The bathroom was very tiny (even for a small person) but well equipped. Our room opened to the hotel's car park and noise wasn't an issue even with the windows opened. The hotel was just opposite the U-bahn station and was reasonably convenient if spending more than a day in Berlin. Parking wasn't a problem as there were quite a lot of parking spaces across the street underneath the U-Bahn station. There were not a lot of eating places (mainly kebabs and a Thai nearby). The buffet breakfast was very filling and offered a wide variety of food. The front desk staff were not very knowledgeable about the facilities in the hotel's vicinity. Before we made the booking, we searched Google maps and knew there would be at least one laundromat nearby. However, when we asked the front desk staff, they couldn't point us to the nearest one but kept offering us the in-house laundry service. The night staff's reply was that they didn't know because they worked night shift and everything was closed! In the end, we used the internet terminal at the hotel and found the laundromat through Google maps. There was only one internet terminal in the lobby, which could mean a long wait in an area full of smokers! At EUR180 for 3 nights, this was good value for a tourist hotel.", "Date": "May 20, 2007"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "central scotland", "Title": "“good value basic hotel”", "Author": "whizzkid1", "ReviewID": "UR6940155", "Content": "We stayed here for three nights and had little to complain about. The reception area is not very inviting but the rooms themselves are clean and tidy and are of a similar standard to a travel inn room in the uk.the bathroom is really small but it is fully equipped and the shower is great.there is not a lot of interest nearby but the subway is only a short walk away. there is a pleasant italian restaurant nearby called centro sud but not a lot of other nearby eating delights! all in all for £81 for three nights it was good value!", "Date": "March 9, 2007"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Glasgow, United Kingdom", "Title": "“good value for money !”", "Author": "gerrybhoy1", "ReviewID": "UR6831655", "Content": "Was definitely a bit wary after reading some of the previous reviews. Was there last week for 4 days. Cost us about £21 each per night. For that price you may be lucky to get a backpacker hostel in some cities ! Definitely cant really complain. the hotel was fine. the room was exactly as it shows on the hotel website. toilet was - as mentioned before - pretty small, but spotless. As with the halls that have been mentioned before - how much time do you spend there - not a lot ! Because we couldn't be bothered with the maids coming in and tidying up our clothes, sheets, guides ,etc, we just left the \"Do not Disturb\" signs on the door during the day - each day we came back to find a bag hanging on the door with fresh towels, etc. !!! Hotel is just round the corner from subway station (Kurfustenstrabe, I think) and also a main street with loads of shops, etc. Public transport system is excellent. Subway just in front of hotel was still closed. If this is open, may be advisable to ask for room at back of hotel. The 3-day visitor cards can be bought from the hotel reception for 19.90 euros. Remember to get these validated before travelling. Never had any problems at night. Noticed a couple of transvestites at the street to the side of hotel, but nothing to talk about. Would'nt have any problem recommending this hotel if you get a similar good deal", "Date": "February 23, 2007"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "West Dunbartonshire, Scotland", "Title": "“Pity about the U- Bahn”", "Author": "AustroPolCanadaScot", "ReviewID": "UR6815014", "Content": "Seven of us stayed at the Aldea for three nights from the 10th of February. It was excellent value. The fine buffet breakfast was welcome on the cold mornings. The rooms were well appointed and the staff were all very helpful and welcoming. If you are coming from Schoenefeld Airport, you can avoid the ticket machine queues by getting a one day or three day public transport tcket from the Lufthansa desk in the arrivals hall. It covers the buses, trams, regional trains, S-Bahn and U-Bahn. There is a bus stop just around the corner from the hotel. From the airport , come into Alexanderplatz Station on the train and then get a number 48 bus which takes you to the corner of Buelow Strasse. The U-Bahn, which would be even more convenient, U-Bahn 1, is out of commission at the moment, while a new line is being built.", "Date": "February 20, 2007"}, {"Ratings": {"Overall": "2.0"}, "AuthorLocation": "Lund", "Title": "“Disappointing”", "Author": "KiwiLund", "ReviewID": "UR6812636", "Content": "Got to this 4 star hotel after a long trip expecting an if not good then at least reasonably good hotel, it being 4 star. Found it expensive when it came to everything apart from the stay there and uncomfortable. The staff where, as opposed to what the travelwebsite said very unhelpful and just seemed to want to end the day. Breakfast was not included which was surprising since it had been included when booking and was also very expensive, 12 euros. The dinner restaurant, there where 2, was also quite expensive and horribly decorated in some failed combination of disco and homy style. As to the room the furniture, including the bed, where uncomfortable adn hard and the bathroom was tiny although relatively functional. You should definately not come expecting a 4 star hotel this is more like 2+ or possibly 3 star and quite okay at that level. On the positive side it was relatively central, but still a bit off, and quiet throughout the stay in spite of going for a weekend. It was clean enough although somewhat worn but quite good as a base for exploring the city. I wouldn't recommend it however because there's plenty of other hotels where you can get better value or at least a good hospitalitylevel and breakfast.", "Date": "February 19, 2007"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Business service (e.g., internet access)": "4", "Check in / front desk": "3", "Overall": "4.0", "Value": "5", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Minneapolis,MN", "Title": "“Decent & inexpensive”", "Author": "europa00", "ReviewID": "UR6449100", "Content": "Was a little apprehensive after reading other reviews, but this hotel fit our needs - inexpensive hotel in a decent location for getting around Berlin. Was a short walk -- 5 minutes to the U because the S was not yet running. Had a view of the train line though from the hotel - but we could only here cars when we opened the window for fresh air. Hotel was very basic, TV did have english news station, but that was about it. But still entertaining to watch what was on german TV after a night out. Street doesn't seem the safest at night but wasn't traveling alone. Found a great restaurant, Cafe Vienna I believe it was called, a few blocks northwest of the hotel. Only issue we had was the staff who had to check the mini bar while we were getting going (rather late, after being out the night before) in the early afternoon. Would stay here again if we were able to get such a good deal again.", "Date": "December 16, 2006"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Business service (e.g., internet access)": "3", "Check in / front desk": "5", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "3"}, "AuthorLocation": "United Kingdom", "Title": "“Loved Room 433”", "Author": "rodica", "ReviewID": "UR6357942", "Content": "Arrived at Schoenefeld at 2200 via Ryanair, and got the Airport Express train RE7 or RB14, which runs every half hour for only 2.10 euros. Big queues at ticket machines, but you can pay on the train. Arriving at Zoologischer Garten approaching midnight, so got a taxi for 6 euros to Hotel. In accordance with previous reviews, asked for room at the rear. Got room 108, which stunk like an ashtray, so we got an immediate swap to room 433. This was a massive room at the front and smelt brand new. However as the S Bahn was not running during the time we were there, noise was not a problem. Staff were all very helpful, but as I used airmiles to book holiday I couldn't comment on value. However, my wife and I had no complaints. As Buelowstrasse Station was closed, we used Kurfuerstenstrasse Station, which is a 5 minute walk away. Daily run around ticket (Tageskarte Zone AB) is only 5.80 euros and gives you a radius of about 15 miles travel on U Bahn, S Bahn, trams and buses. Be sure to validate your ticket in machine next to ticket dispenser before you get on the train. Many plain-clothes ticket inspectors, so don't be tempted to travel without ticket. I would grade the Hotel Aldea at 3 star +, certainly not usual 4 star, but handy for everything. Mick & Sue. Notts.", "Date": "December 10, 2006"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Business service (e.g., internet access)": "3", "Check in / front desk": "3", "Overall": "3.0", "Value": "5", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Glasgow", "Title": "“Great Value”", "Author": "SmithS&B", "ReviewID": "UR6269827", "Content": "We paid £100 for 3 nights in a twin room here so we were not expecting The Ritz. After reading reviews on here I was very pleasantly surprised. It cost 30 Euros in a taxi from Schonefeld airport. The check in staff were very helpful and friendly. The location is fine. Turn right out of the hotel and you have a 15 minute walk to Potsdamer Platz. Turn left and its 15 minutes to get to K'Damm. There is an underground station directly outside the hotel which was closed for building work when we were there. I would expect it to be noisy when it is open so try and request a room at the back. The rooms are fine. Very clean and tidy. Twin beds, sofa, chair, wardrobe & desk. The shower room is tiny but adequate. Towels could be doing with being replaced though as they were wearing a tad thin. The breakfast was lovely. Buffet style. Hot and cold food. Usual stuff. Never saw a hooker or a transvestite and we were wandering home quite late every night. I would stay here again. Berlin is a brilliant place. There is lots to see and do.", "Date": "November 29, 2006"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "3", "Check in / front desk": "4", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Copenhagen", "Title": "“A very good hotel”", "Author": "Soldado", "ReviewID": "UR5825855", "Content": "We booked a room for 4 people, but was allowed to stay there with 5. We where five guys and needed to stay together. We had a single room but it almost contained two rooms (good for us) and lot of space. It was clean and the service from the staff was excellent. The hotel is located in Schöneberg area and it's in the heart of Berlin City. The only negative thing was that the bar closed so early that we had no chance to together with and learn to know the very good looking girls :o) I can recommend this hotel.", "Date": "September 22, 2006"}, {"Ratings": {"Overall": "2.0"}, "AuthorLocation": "England", "Title": "“What we think”", "Author": "emilymary", "ReviewID": "UR5694161", "Content": "We have recently had a 5 day stay at the Aldea. The Hotel sits by a very busy crossroads . To the front of the Hotel, the Underground station runs across the front of the building above ground (this is now closed until 1st December 2006). However, it is extremely noisy when operating. To one side of the building, during the late evening/night, the street is taken over by Hookers and Transvestites. There is much horn honking and derisive shouting throughout the night from clients and passing cars. The Hotel has double glazing which minimises the noise but no air con. While we were there it was so hot, we needed the windows open. A fan deadened the noise and enabled us to get some sleep. The Hotel itself is very clean although somewhat dated. Our room was a good size, immaculately clean and the bedding and towels white but a little threadbare. The shower room, small but adequate. Our bedding was not changed during our stay. The complimentary toiletries consist of a combined wash/shower/shampoo liquid above the sink and in the shower cubicle. There is no complimentary 'hospitality tray' - but we do not know if these tea/coffee facilities are usual in other German establishments. We had a plumbing leak which was promptly dealt with by a very polite and helpful staff member. Some staff have a rather short, sharp manner but maybe this is the 'german way' rather than 'impolite indifference'. The Hotel is a 15/20 minute walk to the Kurfurstendam. The nearest Underground station (Kurfurstenstrasse) about a 4/5 minute walk. There are local shops and cafes nearby. We do not agree that this is a 4 star Hotel but we paid such a bargain price, we feel we still had our moneysworth. We would however feel very differently had we paid the standard rate of 165 euros a night.", "Date": "August 22, 2006"}, {"Ratings": {"Service": "1", "Cleanliness": "3", "Check in / front desk": "1", "Overall": "2.0", "Value": "2", "Rooms": "3", "Location": "2"}, "AuthorLocation": "England", "Title": "“Aldea, Oh dear you mean!”", "Author": "Miiky", "ReviewID": "UR5500735", "Content": "Well! Where do you start? First this hotel is not 4 stars. (As we know it) The leaflet on the hotel looks great. Not sure they got the correct hotel. First sight is a grey un-interesting reception. Older staff there are miserable. Far too many anyway. Grey corridors lead to rooms. Room was big. No kettle etc. Did not have food which might have made a slight difference? Hookers in back street of hotel. Not a great area. Found it cheap on internet otherwise would not have gone there. Only stay if you can not find anything else. Not recommended at all.", "Date": "July 23, 2006"}, {"Ratings": {"Cleanliness": "5", "Overall": "3.0", "Value": "5", "Service": "3", "Rooms": "5"}, "AuthorLocation": "Scotland", "Title": "“OK”", "Author": "A TripAdvisor Member", "ReviewID": "UR5188878", "Content": "I have awarded this hotel 3 points as that is how many stars it should be rated, my main comparison being the Millenium Hotel in Glasgow which is also rated 4 stars (probably deserving of more). There is no room service ie. the receptionist sounded a bit surprised when I phoned to request a menu to have a meal in the room. I ordered the room from hotelopia.com which stated they did have room service but I presume what they actually mean is someone tidies and makes the bed. The staff were friendly and nice and the breakfast was a nice buffet although the surroundings could be better, but you're only there for half an hour or so, so not that important to me really. This hotel is in an excellent location, the U-bahn is a 60 second walk and only a couple of stops from the Zoological Garten meaning you can get to Tegel airport within half an hour by U-bahn and bus. Berlin is one of the most vibrant, metropolitan and wonderful cities I have ever had the great fortune to visit and so if you are looking for a docking bay form which to leave and visit the sights this hotel is perfect. The rooms are clean, quiet and comfortable, easily affordable, yes the bathroom is small but pretty and more than good enough. In fairness you probably shouldnt expect the Radisson SAS for the price and, look, your in Berlin! Who cares!", "Date": "May 22, 2006"}, {"Ratings": {"Cleanliness": "4", "Overall": "4.0", "Value": "5", "Service": "4", "Rooms": "4"}, "AuthorLocation": "Belfast", "Title": "“Super spot”", "Author": "A TripAdvisor Member", "ReviewID": "UR4578792", "Content": "For the money we got this hotel at we we're very happy. Did my research through this site - And well pleased we chose this hotel based on the recent reviews. Our deal excluded breakfast which was 12 euro a pop - we skipped that preferring a local coffee shop. Our group consisted of 5 Lads - mid 20's - early 30's. If your group is similar to that then def go for the Aldea The hotel had modern clean rooms - tv - with a small modern shower room. - what more could we ask for! Can't comment on the public transport links as we had the car. Free Car parking on the street in front was a big bonus.", "Date": "March 3, 2006"}, {"Ratings": {"Cleanliness": "5", "Overall": "5.0", "Value": "5", "Service": "2", "Rooms": "4"}, "AuthorLocation": "Ireland", "Title": "“Better than I expected”", "Author": "SEAMUS.R", "ReviewID": "UR4454441", "Content": "I stayed at this hotel last weekend, and having read some of the reviews on this site was a little aprehensive. However my fears were unfounded and I was pleasantly surprised. I'm not sure what people expect, but having prepaid €185.00 for a double room for three nights including breakfast, I felt we got much more than our money's worth. O.K so maybe it wasn't a 4 star hotel but it's a very good 3 star. While I have little interest in staying in ultra luxurious hotel (almost always a rip off) I am quite fussy, particularly about hygiene and queitness and a comfortable bed. The place was spotless, the staff were friendly, great breakfast. Why are some of the contributors so hung up on the hallways? (painted various shades of grey) as someone has already said how much time do you spend in a hotel hallway? From a location point of view it's less than two minutes walk from the nearest metro station, less than five minutes walk from Nollendorflatz, which is hopping with gay nightlife. I'd stay there again and recommend it to anyone. One small thing. The metro runs above the street so if you are a light sleeper you might want to get a room at the back of a hotel as we did.", "Date": "February 12, 2006"}, {"Ratings": {"Cleanliness": "5", "Overall": "4.0", "Value": "5", "Service": "5", "Rooms": "4"}, "AuthorLocation": "Edinburgh, UK", "Title": "“Right on the money”", "Author": "A TripAdvisor Member", "ReviewID": "UR4399744", "Content": "Just back from a weekend in this hotel. As per previous reviewer, was a little apprehensive after reading reports of gloomy depressing hallways and unhelpful staff. The staff that we came across were all very helpful and courteous. The hallways were a little on the depressing side, but seriously, how much time do you spend in your hotel hallway? The rooms were spacious enough, everything was spotlessly clean, beds were comfortable. Proved to be a perfect base for our trip to Berlin - we spent two nights there. The U2 U-bahn line runs past the door - the nearest station is a couple of minutes' walk. The U2 line takes you to places like Potsdamer Platz, Alexanderplatz, the Zoo etc. Would be hard to beat this hotel for value-for-money. Highly recommended.", "Date": "January 31, 2006"}, {"Ratings": {"Cleanliness": "5", "Overall": "4.0", "Value": "5", "Service": "3", "Rooms": "4"}, "AuthorLocation": "UK", "Title": "“A perfect base!”", "Author": "ferkh10", "ReviewID": "UR4346084", "Content": "We stayed at this hotel for 3 nights over the New Year period. After reading some of the previous reviews we were very apprehensive about staying at this hotel, however it well exceeded our expectations. Okay it is a basic hotel but then we paid a basic price. The rooms are very clean, modern and comfortable. I would probably compare it to a Travellodge style hotel in the UK. The breakfast at the hotel was basic but adequate (what more do you want when you have a hangover!), and after reading a previous review about a lack of kettle in the room, took our own travel kettle. It is in a quiet, safe area and is literally just over the road from a U-Bahn station which is only 3 stops away from the main centre for the sights and transfers to other lines. There are numerous bars and restaurants 5 minutes walk away. If your purpose of visiting Berlin is for sightseeing and going out, and like us, all you want is a decently priced and comfortable base, then I would definitely recommend this hotel.", "Date": "January 11, 2006"}, {"Ratings": {"Overall": "2.0", "Value": "4", "Service": "1", "Rooms": "4"}, "AuthorLocation": "London", "Title": "“Depressing place”", "Author": "A TripAdvisor Member", "ReviewID": "UR4130406", "Content": "Good location next to tube station....depressing building and unfriendly and unhelpful reception staff...great size of room though and great shower, ours was a twin, we had booked a double but were told on arrival that the hotel only has twins!......we did not have breakfast/meals here.....really just a clean place to stay with nothing whatsovever going for it...just a building and a bed - twin! To be avoided as there's loads of nice places to stay.....", "Date": "November 21, 2005"}, {"Ratings": {"Overall": "2.0"}, "AuthorLocation": "Boston, MA", "Title": "“You get what you pay for”", "Author": "A TripAdvisor Member", "ReviewID": "UR3836319", "Content": "You could do worse with this hotel, but you could also do better...much better. I took this hotel for the low price and I definitely got what I paid for. The good: It's in an OK location (but definitely not a great location). It's right by the subway (U2 stop Bulowstr.). The area is very residential, but it's not too far to get to the tourist sites in East or West Berlin (I think it's in West Berlin, but relatively close to East). The area seems safe - just not much there. It's clean. The bad: NO air conditioning. NO INTERNET - only analog modem (phone), which costs 20 cents a minute! NO toll-free numbers can be called from the hotel so it doesn't matter if you have a calling card or not - calls are ridiculously expensive. NO SHAMPOO GIVEN! They just give you some liquid soap and that's it. Old elevator - you need to open the door yourself and there isn't even a light to tell you if it's there or not. Everything in the room and hallways is cheap and ugly, including the safe, which is battery powered and hard to work. That about sums it up. In a nutshell, you get what you pay for!", "Date": "September 1, 2005"}, {"Ratings": {"Cleanliness": "3", "Overall": "2.0", "Value": "3", "Service": "3", "Rooms": "3"}, "AuthorLocation": "", "Title": "“Depressing”", "Author": "A TripAdvisor Member", "ReviewID": "UR3645214", "Content": "The hotel is clean enough and the breakfast OK but the rest of the building is like a prison with the corridors being a very depressing grey colour. Was in Berlin for Pride so the location was good for that. Not sure I'd go back there.", "Date": "July 7, 2005"}, {"Ratings": {"Cleanliness": "4", "Overall": "3.0", "Value": "4", "Service": "3", "Rooms": "4"}, "AuthorLocation": "Paris, France", "Title": "“Basic yet pristine - Good if you get it cheaply”", "Author": "7DegreesOfWonderment", "ReviewID": "UR3622126", "Content": "I would only recommend this hotel if you get a very good internet rate - shop around. Yet if you do get a good rate it can be worth it. I have stayed at this hotel on two or three occassions - twice over easter (2002 and 2001). On each occassion I booked very much last minute and chose the hotel for its location and especially the rate I got. The hotel feels a bit institutional - rooms are cheerful compact with modern furniture, bathrooms tiny but all is well maintained and clean. It is true that the corridors are dark and lifeless! It i located very close to an easily acessed subway station. The staff were friendly.", "Date": "June 30, 2005"}, {"Ratings": {"Cleanliness": "4", "Overall": "5.0", "Value": "5", "Service": "4", "Rooms": "4"}, "AuthorLocation": "Manchester", "Title": "“Great value hotel”", "Author": "MartinThomas", "ReviewID": "UR3309482", "Content": "Stayed at the Aldea over Easter from 26 to 29 March 2005. The hotel is 2 minute walk from two U-Bahn stations, and very close to all the tourist sites. The area is a little rough, and there are a few prostitutes in the area, but this is minimal. The hotel staff were all very friendly, the rooms clean and modern, and the buffet breakfast plentiful. For £61 for a twin room with breakfast you cannot complain! For any gay tourists there are lots of bars within a 5 minute walk of the hotel.", "Date": "March 29, 2005"}, {"Ratings": {"Cleanliness": "4", "Overall": "4.0", "Value": "4", "Service": "3", "Rooms": "4"}, "AuthorLocation": "Athens, Greece", "Title": "“a great hotel”", "Author": "AthensTraveler", "ReviewID": "UR2970633", "Content": "I stayed with my boyfriend in Aldea Hotel for 3 nights. We would have stayed there for 4 nights but the night we arrived the receptionist informed us that there was a problem with our room and he had arranged that we would spend the first night at another hotel. which was also a very nice hotel. The second day we went back at the hotel, where everything was ok and a great basket with fruits and chocolates was expecting us in our room with a regreting letter from the hotel manager. The personnel was very polite and helpful. The room was ample, clean and very warm. The breakfast was also great. It included eggs, sausages, bread, a great variety of cheese and ham, and fruits. Also the hotel was very close to an U-bahn station and we did not have a transportation problem. I am thinking of visiting Berlin in summer and I would definetely stay to this hotel again.", "Date": "January 2, 2005"}, {"Ratings": {"Overall": "2.0"}, "AuthorLocation": "", "Title": "“Grey & Lacking in Character”", "Author": "A TripAdvisor Member", "ReviewID": "UR2969722", "Content": "We have just returned from a 4 night stay in this hotel and wouldn't stay there again. The hotel is grey and lacking in soul. Whilst the hotel was clean, close to an underground station and the breakfasts were good presumably there are alot of other hotels that have these characteristics and have a bit of colour about them . The best thing about this hotel was the little Italian Restaurant 100m down from the hotel. As another reviewer commented there were also prostitutes in the area. If you do stay here make sure you block the pay for view TV as soon as you check in. They have this crazy system were if you watch a pay for view channel for more than 2 mins you are charged over 9 euro. Don't think you will be warned that you are about to be charged or that you are on a Pay TV channel. We were charged and hadn't watched anything other than the usual flicking through channels and felt ripped off.", "Date": "January 2, 2005"}], "HotelInfo": {"Name": "Hotel Aldea Novum", "HotelURL": "/ShowUserReviews-g187323-d242987-Reviews-Hotel_Aldea_Novum-Berlin.html", "Price": "$54 - $223*", "Address": "<address class=\"addressReset\"><span rel=\"v:address\"><span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">Buelowstrasse 19-22</span> | <span class=\"extended-address\">Sch&ouml;neberg</span>, <span class=\"locality\"><span property=\"v:postal-code\">10783</span> <span property=\"v:locality\">Berlin</span></span>, <span class=\"country-name\" property=\"v:country-name\">Germany</span> </span></span></address>", "HotelID": "242987", "ImgURL": "http://media-cdn.tripadvisor.com/media/ProviderThumbnails/dirs/5e/0a/5e0a8241fb164b5a18c315ab711eb6e84large.jpg"}}