{"Reviews": [{"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "2.0", "Value": "1", "Location": "4", "Rooms": "2"}, "AuthorLocation": "", "Title": "“Hotel...more like hostel”", "Author": "Hayleydj", "ReviewID": "UR126286985", "Content": "Stayed for one night (thankfully). Can't say I really slept, even with my ears stuffed with ear plugs - to be fair, the noise was coming from the bar across the road but the fact that the bathroom window didn't shut wasn't helpful. Bed was uncomfortable, shower varied between a 'trickle' & 'enough to wash soap from your eyes!', dated decor, smelt damp......I wouldn't be such a moaner if it hadn't cost us £90 (room only). Good points - clean bedding & towels.", "Date": "March 18, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Hertfordshire", "Title": "“Perfectly Good Value”", "Author": "thevoyagers", "ReviewID": "UR126244459", "Content": "We just stayed in the Camden Lock Hotel whilst attending a gig at the Round House. In truth, this is a very good, functional hotel. We requested a quiet room, and were amazed by just how quiet it as. Even 7 am on a Saturday morning and with all the windows open all you could hear was the birds tweeting - honestly! The rooms are not the largest in the world, but are perfectly clean and tidy. If you have the option to pay for breakfast, do it. I can honestly say it was one of the best \"Full English\" breakfasts I have ever had - absolutely delicious. We would happily go back.", "Date": "March 17, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Lisburn, United Kingdom", "Title": "“The very best of the more basic hotels in London !”", "Author": "andriana4", "ReviewID": "UR124730677", "Content": "I have just returned from a short stay in the Camden Lock Hotel. I stayed there with my daughter who is 18 and had to prepare for a uni interview during our stay. I had previously stayed in a \"basic\" London hotel and hated it so I was a little worried about this hotel. However I was really impressed with the Camden Lock hotel. The outside of the hotel is not impressive but that is were the negatives stop. We were booked in by a smiley pleasant receptionist in a fresh welcoming reception area. The hotel looked as if it had been freshly painted, it was clean, warm and quite modern although there was a little noise at night from traffic it was not enough to keep you awake. Also my daughter had the space/peace to prepare for her interview. Breakfast was served in a lovely adjoining coffee shop- an excellent continental breakfast was included and just £3 for full english. The area couldn't be better about 1 minute to Chalk Farm tube and a pleasant walk to Camden market etc. If you like this area it is perfect- I stayed in Hilton Hotels the following night and on a previous visit and preferred this hotel for many reasons-it was not luxurious but the area/atmosphere is great and it is also considerably cheaper. In my experience when you are in London you don't spend a lot of time in your hotel and I would choose this one over a more expensive hotel any time!", "Date": "February 17, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "2", "Sleep Quality": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "London, United Kingdom", "Title": "“Cheap and cheerful in Camden”", "Author": "Bennettonbeer", "ReviewID": "UR124364493", "Content": "Cheap and cheerful just about sums up this hotel which in truth is more like a hostel. The beds were comfortable; the bed linen fresh and clean; plenty of nice fluffy bath towels and the room warm even on a freezing cold night. However.....no hair dryer in the room; no bed-side cabinet or table; the window surrounds had not been finished and while the rooms had obviously been cleaned, certain aspects left much to be desired. In particular the shower unit had gaps and there was severe staining of the tiles. Even with the cheap prices charged there is still no excuse for this lack of basic standards For a simple overnight stay in the heart of Camden it's reasonable...staying longer?....then find a real hotel.", "Date": "February 9, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "4", "Sleep Quality": "3", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Manchester, United Kingdom", "Title": "“Basic but what you expect for the money.”", "Author": "Bingi M", "ReviewID": "UR123577331", "Content": "Considering the location it is very good value for money. The tube is on your doorstep and Camden Town is few minutes walk away. No lift in the hotel and so had to use the stairs and the hallways could do with a renovation. Friendly staff and towels cleaned daily. Clean room and no complaints with the bed. Breakfast is served at the cafe next door but dont expect anything fancy with the 'breakfast included' option. I paid additional each time for a better breakfast and did feel it wasnt worth the price. I would consider staying again if my budget was stretched.", "Date": "January 24, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "New Providence Island", "Title": "“Very cheap for London and perfectly adequate”", "Author": "dereck_bown", "ReviewID": "UR123371676", "Content": "Great area - close to both Camden and Hampstead and all the choice of bars, restaurants and shopping. But seriously cheap for London. Very basic accommodation but suprisingly queit and a damn good English breakfast - proper honest stuff", "Date": "January 20, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "3", "Overall": "4.0", "Value": "3", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Wakefield, United Kingdom", "Title": "“Basic but perfectly adequate”", "Author": "thelesserknown", "ReviewID": "UR122918571", "Content": "The Canden Lock hotel is just across the road from Chalk Farm tube station. Even though it is on a main road the noise in the rooms is minimal. The breakfast is served in a small public cafe downstairs, for Â£3 you can upgrade to a full English breakfast, very tasty. All the staff I met were very helpful and polite. I would happily stay here again. However, the cleaning could be a little better. The shower head and taps looked like they could do with a good scrub to get the limescale off and a bit of bleach in the toilet would have helped. Overall though it wasn't too bad, nothing that would put me off staying again.", "Date": "January 11, 2012"}, {"Ratings": {"Overall": "2.0"}, "AuthorLocation": "Bristol, United Kingdom", "Title": "“Depressing”", "Author": "ringle650", "ReviewID": "UR122453020", "Content": "This hotel is in a good location and the room was clean. That's about all it has going for it. It made me wince just walking in there - very shabby and quite depressing. I paid Â£86 for a double room and feel that was extremely overpriced.", "Date": "January 3, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Lancashire", "Title": "“Camden”", "Author": "SummerAngelVicky", "ReviewID": "UR121886680", "Content": "I stayed at The Camden Lock Hotel 14th-16th December. The hotel is shabby looking but it's clean, i can not fault it's cleanliness. The bedding and towels were fresh and clean. I was in room 110, when i first tried to shower it took a good 10 minutes before the water was tolerable on my skin, before that it had switched between boiling hot and freezing cold. It was still way too hot for my liking but it was either that or a cold shower. The next time i tried to shower, i couldn't, there was just no hot water coming out, no matter how long i left it running. Also in room 110 i had problems with the lock, it was really hard to get the key out of the room once you'd opened the door. They are my only critisisms. The staff were friendly, the breakfast was nice and the location is excellent. I had a double room which was Â£85 a night, i do think it's a bit overpriced, i'd have expected to pay about Â£70 with the hotels current decor, but, like i said. The location is excellent and this is London. It's right near Chalk Farm Tube Station, a taxi rank, a mini sainsburys and morrisons and just a 5-10 minute walk from everything. Camden Town Market & Stables Market (About a 5 min walk) are definatly worth a visit, the stalls are a little repetitive after a while but well worth a look anyway, loads of food stalls from all over the world and well, camden is just amazing. It's beautiful. Plus, Primrose Hill is just a 10-15 minute walk from the hotel, i went up at night and you can see the London lit up. I was staying in Camden alone, i'm a 19 y/o girl, and not once did i feel unsafe/scared. Everyone i encountered was friendly. I loved it so much i'm now trying to find a way to move down there. I would stay in this hotel again, as would i recommend it to a friend.", "Date": "December 19, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "5.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Edinburgh, United Kingdom", "Title": "“Perfect, clean & hassle-free”", "Author": "steve s", "ReviewID": "UR121517213", "Content": "Me & my girlfriend stayed here for two nights this week, as we wanted to take in some shopping for Xmas presents at the Camden Stables & Camden High St. I read some of the reviews before going & I was a little apprehensive at what we would get. But thankfully there was nothing to be worried about. The room was very clean, with TV & a decent shower - The bed & towels were fresh & clean - The reception staff were hassle free & booked us in with a smile - it was simple, clean & warm for the price Â£170 between us. I will definitely be back again, as the location was excellent, 5min walk to Camden & the High St. You should make a point of going in to all the shops on the road down to Camden as they were full of unusual vintage clothes & all sorts of bits & pieces - & the local pubs/clubs (BarFly & Monarch) were holding live music from a host of bands, were friendly & full of interesting chatty folk ranging from 18-50yrs. It was a perfect couple of days. I'm already planning my next trip down to this hotel & to Camden. One word of warning, some of the freelance stalls between the Camden Stables & Camden Tube are pretty pushy trying to get you to buy some of their bad quality clothing - although it was an experience trying to barter with them if you fancy a heated debate on the costs of all things fake.", "Date": "December 8, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Sleep Quality": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Wales, UK", "Title": "“Great location but basic”", "Author": "JJSWWales_UK", "ReviewID": "UR121115543", "Content": "Camden Town is a vibrant part of London. It's busy, central and easy to get to via Underground or walking (driving is like any inner city - best avoided!). Camden Lock Hotel is one of the cheapest around this otherwise expensive area (hotel room range from Â£110-195 per night; I satyed at the Camden Lock for Â£79) but it is basic. And if you choose to book it expect it to be basic. The decor shows evidence of vast amounts of guest traffic and beyond the Reception area communal and service areas are very much less attractive and maintained. The rooms are OK. Still basic but OK. My room was clean enough but the carpet was showing those tell-tale signs of heavy guest use. En suite facilities are OK too. Clean (the most important thing in my view) if a little compact (but then I don't spend that much time in en suite facilities, so what the heck!). So to the best bits. Chalk Farm Underground is 50 metres away. Camden Town underground is a 10 minute walk away and Euston station just a 25 minute walk away. That's central! And the hotel is surrounded by restaurants, shops and boutiques; in what is now fashionable Camden Town. And for a leisurely walk Camden Lock is just down the road and next to the well-known, if not famous, Camden Market (expanded now to take in Inverness Street). For English public house fans there are too many good ones to mention - but I will give a special mention the the Buck's Head by Camden Market for its well kept handpump beer. Back to the Camden Lock Hotel. Basic. Great location. Relatively cheap. Well located. I'd stay again for the location but that would be about it.", "Date": "November 28, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "2.0", "Value": "1", "Sleep Quality": "1", "Rooms": "2", "Location": "4"}, "AuthorLocation": "Plymouth, Devon", "Title": "“Overpriced for a budget hotel.”", "Author": "LouLou_Moon", "ReviewID": "UR120988599", "Content": "I booked a room at the Camden Lock Hotel based on the good reviews I'd read here on Trip Advisor. After having spent a night there, I'm wondering if these reviewers and I actually stayed at the same hotel?? My daughter and I shared a twin room (306) on the third floor. The bed I had was only 2'6\" wide ~ no wonder I couldn't turn over comfortably and spent the whole night wide awake! The bedding was spotless, however, as were the towels. Location-wise, the hotel is in a great spot, surrounded by pubs, shops and fast food outlets, with Chalk Farm tube just across the road.", "Date": "November 24, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Billericay, United Kingdom", "Title": "“Everything you need for the price”", "Author": "Aston1601", "ReviewID": "UR120471494", "Content": "Perfect location, basic but clean rooms. The towels and sheets were all fresh and the shower had fair pressure. Warm enough, and with a tv too it was perfect for a trip to the Roundhouse. 24hr reception so no problem when you check back in, and the complimentary breakfast was lovely in the small cafe next door. One criticism was that you get the choice of full english breakfast or continental breakfast (with the jam on toast, cereal, juice and pastry) for free with the room. If you want the vegetarian full english, they ask for Â£3. The only difference between the full english and the vegetarian was the vegetarian sausages instead of pork and you don't get bacon. This obviously cost no more to prepare for them, so should be an option without a surcharge. Only a minor irritation for me, everything else was good value for money and an excellent location", "Date": "November 11, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Sleep Quality": "4", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Wokingham, United Kingdom", "Title": "“Ok hotel convenient for a short stay”", "Author": "JoubertG", "ReviewID": "UR120298851", "Content": "Went for a concert at the Roundhouse- this is literally across the road so really convenient. Also close to he various Camden markets and close to the tube. Staff were friendly, room was basic but clean. Surprisingly we had a good nights sleep- surprised as the pub and a club were across the road and heaving with folk and loud music. Cost with continental breakfast (cereal, pastry and toast, orange juice and tea) was Â£ 89 for two of us, so not cheap, but maybe ok for London. Would I go back- yes if attending a concert at the Roundhouse and not wanting to rush home.", "Date": "November 7, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Sleep Quality": "1", "Rooms": "2", "Location": "4"}, "AuthorLocation": "London, United Kingdom", "Title": "“frida”", "Author": "anne c", "ReviewID": "UR120178816", "Content": "well the hotel is basic which is fine but if you have a room on the side street opposite the pub be prepared to be kept up late with load music and other noise. Best advise either stay out late or join the crowd in the pub.", "Date": "November 4, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "3", "Overall": "4.0", "Value": "4", "Location": "5", "Rooms": "3"}, "AuthorLocation": "", "Title": "“Friendly staff. Great location”", "Author": "seancyril70", "ReviewID": "UR119886425", "Content": "The rooms are a bit basic but clean. The staff are very friendly and helpful. The dining room is actually a restaurant/ coffee shop which is attached to the hotel where you get a free continental breakfast with your stay or can upgrade to a full English for 3 quid. I went for the latter which was top notch. I never had a problem with the shower like one reviewer and there was plenty of hot water. The best thing about the hotel is it's location just a stones throw from the Roundhouse", "Date": "October 30, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Athens, Greece", "Title": "“Camden Lock Hotel”", "Author": "spakpast", "ReviewID": "UR118880930", "Content": "A few metres from the Underground. Friendly staff. Worth its value", "Date": "October 3, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Jersey, United Kingdom", "Title": "“A lovely little hotel on a corner!”", "Author": "sarah p", "ReviewID": "UR118424979", "Content": "I stayed here with my boyfriend for the weekend. we traveled from overseas. I personally thought the room was very good for the price GBP Â£153 for 2 nights inc breakfast (bowl of cornflakes, toast with spreads, croissant, glass of orange juice and a cup of tea) our bed was clean and comfy with sufficient pillows and a warm duvet. Although our room was extremely plain with 3 white walls and 1 grey it was fresh! There was a kettle and two tea cups in our room plus coffee, tea and sugar, all towels in the room where changed everyday so there was no need to use the same towel twice. There was also a plasma tv (with all channels) in our room which was great as i like to listen to music while i get ready. I've seen some comments about the water situation... the hotel is not a five star its a two? don't hold me to that! - we have to remember that it's a busy little hotel in London, which means most people are probably up bright and early getting ready to hit the town etc. so there is not always going to be enough hot water.. nor me or my boyfriend had a cold shower, we had warm showers both days although the water was as high as it could turn. The only problem was that there was no lift for our luggage, dragging two cases up three flight of stairs was hard but well worth it. (they also have a luggage room, which was handy as i wanted to go back into town and didn't fancy dragging my case with me) There's no doubt that I will be returning, whether its for a romantic stay or just with the girls.. It was great! Plus you have the tube station across the road and many restaurants and takeaways. Hope you enjoy your stay guys x", "Date": "September 21, 2011"}, {"Ratings": {"Service": "2", "Cleanliness": "2", "Overall": "3.0", "Value": "2", "Sleep Quality": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "wrexham", "Title": "“Great Location, poor rooms”", "Author": "sprice31", "ReviewID": "UR118368056", "Content": "Great location, across the road from the tube station, opposite the Round House where all the music happens (itunes festival). The rooms were basic, scruffy, the water was cold and couldn't have a shower, complained to the staff, they said that they had checked it while we were out and if we let the water run it was fine. Only had a short time before going to queue up to see Adele in concert so tried the shower again and still no hot water, NOT HAPPY :( Quite expensive for such shabby rooms no hot water and no breakfast at Â£85.00", "Date": "September 20, 2011"}, {"Ratings": {"Cleanliness": "2", "Sleep Quality": "2", "Overall": "2.0", "Value": "3", "Service": "4"}, "AuthorLocation": "London, United Kingdom", "Title": "“very average if that”", "Author": "little_tortillaUk", "ReviewID": "UR117768300", "Content": "Okay, good points - Great Location. Camden town is in walking distance and Chalk Farm tube station is right across the road. So no cab needed. -The 31 bus was a godsend. it took us everywhere we needed and was right outside, and very regular esp when the northern line was buggered up on the weekend -Breakfast. The full English was very good. - Price was reasonable - 89 GBP per night for the weekend. Well, thats cheap for London, but expensive in other cities given the fact that the room was really lacking. The bad - Lack of character. Its very sterile and seriously needs some colour. - Dirty Carpets in the room - No lift for said luggage - Good location but noisy main road. Camden is filled with lots of party goers, so dont expect a quiet night. - No wardrobe. It was simply a few hangers", "Date": "September 6, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "3", "Overall": "4.0", "Value": "3", "Service": "3"}, "AuthorLocation": "Bracknell", "Title": "“Served a purpose well”", "Author": "amiandade Posted by an OctopusTravel traveler", "ReviewID": "UR116092719", "Content": "We stayed at this hotel as we were going to a concert at The Roundhouse and thought it would be best to stay in a hotel over night than travel loads and as such let our hair down. The hotel doesn't look like much, but it had everything we needed, perfect location, clean and breakfast was included which was a bonus. Would definitely use this hotel again if the need arose.", "Date": "August 1, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "4.0", "Value": "4", "Service": "4"}, "AuthorLocation": "lifeisreal", "Title": "“We've stayed before and will stay again”", "Author": "lifeisreal Posted by an OctopusTravel traveler", "ReviewID": "UR115841118", "Content": "As per usual an excellent stay at the camden lock hotel, we hadn't been since it was refurbished and the new style for breakfast made our stay even better than before. Excellent location and very helpful staff!", "Date": "July 27, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "4", "Overall": "4.0", "Value": "5", "Service": "4"}, "AuthorLocation": "East Midlands", "Title": "“Fair Price and excellent location”", "Author": "nonstoptraveller43", "ReviewID": "UR115565544", "Content": "Stayed here in June having attended a gig and the location is abs superb. Although opposite a pub that does get quite noisy as you would expect in any central location, the hotel most certainly served its purpose, It isnt posh by any stretch of the imagination but if all you are looking for is a clean ensuite room at a fair price in London, then this hotel certainly suffices. Its location to the Roundhouse its excellent for any of you attending concerts there, The staff were lovely and friendly and i would quite happily stay there again on another visit to the fabulous Camden Town", "Date": "July 20, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Location": "5", "Rooms": "3"}, "AuthorLocation": "Vancouver, Canada", "Title": "“Location, location, location!!!!”", "Author": "Craigers690", "ReviewID": "UR114969214", "Content": "This is a budget priced hotel in a great location. It is basically across the street from Chalk Farm tube stop. The room was very clean and the shower was good. We stayed for 2 nights and found it very good for the price. The staff were all friendly and helpful.", "Date": "July 2, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "3.0", "Value": "5", "Sleep Quality": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Kent", "Title": "“great budget hotel”", "Author": "JayneeB", "ReviewID": "UR99294432", "Content": "after reading reviews I went with an open mind and had low expectations. I wanted somewhere near the Roundhouse and this place was opposite. I was pleasantly surprised. the staff were friendly and the place had everything we needed for an overnight stay. The room was clean and we had a good nghts sleeps. The breakfast was excellant in the coffee bar and I will be booking again.", "Date": "March 7, 2011"}, {"Ratings": {"Service": "2", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "4"}, "AuthorLocation": "Bournemouth, United Kingdom", "Title": "“Basic dump!”", "Author": "Vyvyenne", "ReviewID": "UR99155642", "Content": "I wouldn't normally bother to write a review but our experience will be memorable. We have stayed in hotels all over the world and in the UK for the past 30 years and this is the most memorable for being so tatty, small, no storage etc etc. The bathroom had no shelves or anywhere to put anything. Campsite showers are more inviting. The carpet had red stains and bleach all over it. The room walls were paper thin and I was being constantly woken up by noises. Breakfast was 2 slices of toast and a bowl of cornflakes - no choice. It was dumped in front of us with no explanation or a good morning! Two cups of tea were dished out with a tea bag in them. I don't think we will be staying again!!! The receptionist was pleasant though.", "Date": "March 6, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "3", "Sleep Quality": "1", "Rooms": "1", "Location": "5"}, "AuthorLocation": "Dublin, Ireland", "Title": "“A total dump of a hotel”", "Author": "anninero", "ReviewID": "UR98379574", "Content": "An absolute kip would never stay here again. No hot water, no plug in the sink and the window opened about 2 inches. It's shabby and very run down. The only good thing is the location opp chalk farm tube station", "Date": "February 28, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "2", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "3"}, "AuthorLocation": "Limerick, Ireland", "Title": "“glorified hostel”", "Author": "christobin", "ReviewID": "UR91927825", "Content": "Once again we found the standard of hotels in London absolutely awful ,. I have come to the conclusion , unless you pay big money your hotel will be very poor . Camden Lock had tiny rooms , a hook with 3 hangars hanging off the wall this was your storage area , bathroom was filthy, heating did not work so we had a portable heater , walls were plastered but not painted , we could not open the window as a big cat kept trying to get in the window , carpets were dirty, the only decent thing was a reasonable breakfast was supplied even if it was in the adjoining cafe ! Please take my advice avoid the Camden Lock at all costs . PS I would love to know who gives these hotels ratings ?Give me an irish hotel anyday.", "Date": "January 6, 2011"}, {"Ratings": {"Cleanliness": "1", "Overall": "1.0", "Location": "3", "Service": "2"}, "AuthorLocation": "chandlers ford", "Title": "“never stay at this hotel if you have any sense!!!!”", "Author": "andrewChandlersFord Posted by an OctopusTravel traveler", "ReviewID": "UR87772547", "Content": "what a terrible hotel in fact it should not be called an hotel the rooms were not clean and black mould around the windows through lack of heating and maintenance no hot water in the morning and a shower as an excuse!for a shower following a complaint in the morning without the manager being available and a very poor discount from the invisible manager stay well away from this terrible place!", "Date": "November 21, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Leeds", "Title": "“Best Value for Money I had in Ages”", "Author": "Stormbusta", "ReviewID": "UR86491880", "Content": "Having read some of the other reviews I was really worried as to what to expect. So easy to find, from Chalk Farm Tube, literally a 1 minute walk - as for the location FAB - Camden Stables (top end of the Market) is about a 5 minute walk. We love Camden and we adore the night life there. For us, the walk from Camden (after a meal and a few drinks) could not be beaten. OK, the room was a bit small, the en-suite a bit basic, but everything was clean and worked. You are not going to get 5 Star treatment at this price - make the most of it. Will def. stay there next time we go to Camden. Breakfast is as good as anything I have had in many cafe's/hotels - great service and so quick too. If you are like so of the other 'visitors' who say such negative things about this place, go to the ritz and pay in excess of Â£500 per night, I am sure you will get a bigger room for that. If not, just make the most of it.", "Date": "November 9, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "2", "Sleep Quality": "1", "Rooms": "1", "Location": "4"}, "AuthorLocation": "Glasgow, United Kingdom", "Title": "“Avoid like the plague, in fact, stay here and you may catch it.”", "Author": "MartinClift", "ReviewID": "UR85539941", "Content": "I don't often feel the need to write one of these reviews, but after staying in this grubby little excuse for a hotel last Friday, I felt compelled. Arrived around 4.30pm and found the hotel almost immediately on exiting Chalk Farm tube station. It was almost directly opposite the Roundhouse where we attending a gig that evening, so the location could not really be better. Checked in, booked a 6am alarm call and made out way to our room up three flights of stairs (take note, no lift) and found the room at the back of the hotel as we had requested. On opening the door the smell of damp was the first thing to hit you. A quick inspection of the room resulted in noting the following: A square hole about the size of a socket cut in the pasterboard just about the head of the bed with no attempt at having it filled, electrical cabling from the television gaffer taped together with more cable in order to make an \"extention\" for it to reach the socket. More gaffer tape used to secure the tv aerial into it's socket, a damp patch approximately 4 feet in length directly above the window. Mould around and above the pathetic excuse for a shower (a watering can would give more pressure) and a light that didn't work. There were no toiletries save for a tiny bar of soap and the water took forever to warm to little more than tepid. (including the shower) The bedclothes consisted of a wafer thin quilt with an ill fitting cover that had so few buttons on it, it barely stayed on. As I mentioned, we had requested a room at the back of the hotel so as not to be disturbed with too much noise. What I hadn't thought to factor in though were the other guests running around the hall shouting at 4.05am or the 2 or 3 ventilation units of various fast food outlets below that belched the smell of chip fat into the room thus rendering opening the windows impossible unless you really like the smell of gease. We had an early morning flight booked on the Saturday morning that we made by the skin of our teeth as the 6am alarm call was wasn't made to our room either. On handing back the keys to reception as we left I mentioned this, but the chap on the desk seemed more intent on his paper and cornflakes than on us. Anyway, it was our choice not to complain about the various issues. We arrived at 4pm, were out again by 4.30, didn't get back until 1am and left again at 6.45am so we were in the room little more than 6 hours hence the reason we didn't complain. Â£79 for a room is not expensive, but Travellodge and the like are about the same, but they don't feel like a glorified doss-house. The location is prime. The staff, rooms and finishings are primitive at best. You have been warned.", "Date": "November 1, 2010"}, {"Ratings": {"Service": "2", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "5"}, "AuthorLocation": "Aberdeen, United Kingdom", "Title": "“never again !!!”", "Author": "lorna81", "ReviewID": "UR84941771", "Content": "booked this hotel for one night didnt expect to much as it was only Â£89 per night. thought it would be clean and a have a comfortable bed though. how wrong the room was just big enough for the two single beds that were pushed togeher (and very uncomfy) and a small chest of drawers add me and my husband into it and there was barely any room too move. the bathroom was not clean and shower cubile was tiny. there was no heating in the room apart from a portable heater and that only worked for 30 mins before it broke. the noise from the bar acroos the road meant it was to noisy to get some sleep which would have been hard enough anyway in that bed. certainly never going back to that hotel and would reccommend it to anyone.", "Date": "October 26, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "3", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Los Angeles, California", "Title": "“Good location of the town”", "Author": "love2travel420", "ReviewID": "UR77852301", "Content": "Best thing about this place was the location. Near underground train, market, restaurants and bars. ITs good for young travelers, not for family. Bit noisy from outside street. Shower SUCKED..VERY BAD PRESSURE. The staff was friendly, their breakfast was average. For some reason we had to give them our key when we left hotel every time, which was odd, but nothing happened to our stuff and they were open 24/7. Camden town is a great part of london and thats the best thing I can say about this place.", "Date": "September 1, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "3", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Paris", "Title": "“You look for a hotel ? You found it !”", "Author": "carmelid44", "ReviewID": "UR76265755", "Content": "You look for a hotel ? You found it ! We stayed in this hotel during a week. I recommend you this hotel between all the others. Very well situated, The staff were wonderful. There is a bonus : Wireless Internet is free ! Try to find a hotel with free Internet wireless... The room and the bathroom are very clean. The district of Camden is very livened up, very secure. it was a 2 minutes walk to the tube station and you could shop along the way if you choice the other station Camden town. Inexpensive restaurants, you will find pubs and concerts. I am a person very demanding and you can book this great hotel, the eyes closed.", "Date": "August 22, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Derby, United Kingdom", "Title": "“very good”", "Author": "dmya", "ReviewID": "UR74950439", "Content": "nice hotel rooms clean stayed here twice in different rooms and both nice nice and convenient for tubes and shops a pub right outside but didnt bother any of us with noise we joined them realy good breakfast", "Date": "August 12, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "2", "Overall": "2.0", "Value": "3", "Sleep Quality": "1", "Rooms": "2", "Location": "3"}, "AuthorLocation": "Wroclaw, Poland", "Title": "“Noisy.”", "Author": "rocking_pony", "ReviewID": "UR74874516", "Content": "The hotel has very competitive prices as we take together: double room with bathroom + breakfast + close to the tube station (Zone 2). BUT as we were booking the room there wasn't any information about a very noisy pub just across the street. We had our room with the view directly on this pub and we just couldn't rest after long hours in the city. The music was extremely loud, people were loud also and when the party ended some men started to fight and shout. It was pointless to ask the staff to switch rooms because our parents' room was described as \"quiet\" but in fact it was also very noisy. The room was shabby but what's more important - it wasn't clean enough. The shower was really small. Breakfast was served in a lobby (also shabby and cramped), there were some hot and cold dishes, but there wasn't any fresh bread. I wouldn't recommend it!", "Date": "August 12, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "3", "Rooms": "4", "Location": "5"}, "AuthorLocation": "swanland", "Title": "“Great value, brilliant location, friendly staff.”", "Author": "SwanlandSal", "ReviewID": "UR73549035", "Content": "For price paid this hotel exceeded expectations. Great location, very close to tube, helpful staff, comfortable lounge, satisfactory breakfast. Shower not very powerful and noisy pub below were only drawbacks. Was very good value for money.", "Date": "August 3, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Tel Aviv, Israel", "Title": "“nice small hotel in a great area”", "Author": "PUMIKIY", "ReviewID": "UR73460576", "Content": "small hotel small rooms but was more than enough for what we needed, its less than a walking distance from camden market which we've been almost everyday the stuff is nice and helpfull theres a nice little bar across the street and a close by subway station all in all great stay and i recomand to everyone to stay there", "Date": "August 2, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "newcastle", "Title": "“Perfectly acceptable place to stay FABULOUS location”", "Author": "pauluss", "ReviewID": "UR71591132", "Content": "i found the camden lock hotel perfectly acceptable for my needs on my recent two day trip to london. firstly, LOCATION. if you are foreign or a fresh/new london virgin and dont like wandering in circles to find your digs this place is - 100% perfect- . Get tube to chalk farm tube, one and only exit and its there right in front of you. Use google street view for the postcode nw1 8ar and you can see it from the tube :) For my needs this place was perfect. Solo traveller 32 years old whos fonds of a beer or two I am always guided by price for where i stay, i dont see why i should break the bank for a bed for the night especially since i normally leave early morning and arrive back at a few minutes past pub throw out time !! :) This place takes some beating for price in my research I was in room 202 My room was clean & fresh upon arrival. windows were open to airate the room Shower was nice and powerful enough to clean the cob webs away of a morning Fresh clean towels provided Bed comfortable enough for me had a peacful nights sleep, and im 6ft 3inch 16 stone bloke TV worked fine for me for the 10 mins i used it in the morning upon waking The breakfast on morning was perfectly acceptable, buffet meant you could pile it high if thats your things x5 toasters to grill your own bread, pet hate of mine nothing worse than cold toast ! Filled me up nice for the day. Reception staff i found fine with my interactions with them, provided me with help, map and directions without any problem. Location couldnt be better for the Roundhouse venue which is just across the road. Shame i hadnt been a few days earlier i could have seen one of my fav bands If you are fond of a drink on an evening, a few great pubs right on your doorstep (no cabs or buses needed) and also a few take out place for your take home kebab or pizza. Heart of Camden / Camden Lock etc just 5 mins walk down the street All in all i couldnt fault the place for myself. If other have had bad experience they have have ridiculously high expectations", "Date": "July 20, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "2", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "4"}, "AuthorLocation": "Manchester, United Kingdom", "Title": "“Fawlty Towers without the fun”", "Author": "travellerfan24", "ReviewID": "UR71369951", "Content": "This hotel is truly shocking, visit at your peril. The receptionist/hostel owner (cannot call it a hotel) is rude beyond Basil Fawlty standard. I asked for an iron, was told could only have one if I came to pick it up, asked for the TV to be fixed, only to have the telephone was put down on me. The carpet is like a splatter painting with stains/bleach having been thrown all over it, the windows do not lock, there is mould and filth in the corner of the showers, the taps are broken and filthy and breakfast is instant coffee and slices of cheap bread with awful powdered egg. The breakfast room is the reception area in the wierdest way possible??? Room was filthy, mercifully the bedding seemed clean. No wardrobes, hairdryers, nothing in the bathroom other than the cheapest soap. There is a club accross the road so no sleep until 1.30; there was a physical domestic violence situation in the next room to my daughters that woke the whole floor; the manager did not intervene. Truly shocking hostel (not hotel) which only saving grace is the location, which is in the heart of Camden. Must add though, that the breakfast waitress and the young chap on reception were very sweet and helpful. The two positives are not listed to attract people there, merely to show that this review is wholly believable.", "Date": "July 18, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "3"}, "AuthorLocation": "Galway, Ireland", "Title": "“Not a hotel, more like a cheap hostel. No lift!”", "Author": "IrishGalwayLady", "ReviewID": "UR67940358", "Content": "Arrived at the \"hotel\" to be told we were on the 3d floor and no lift. I kindly asked the owner to help with luggage. He was nice about it. We had booked a twin room with breakfast. On the room: 2 Twin beds that didnt match. One was higher then the other and had two different bases. A small old TV was on a small locker. No room between the beds. Bathroom was filthy and plain. Small shower (didnt use, lucky a friend lives in London and we showered at his apartment) On the \"hotel\". Breakfast was help yourself. It was a few slices of bread and scrambled egg. It was suppose to be a full english breakfast. So, we didnt bother with it. Very dated appearance and a small lobby which was also the place where breakfast was. Staff slightly rude and told we couldnt change rooms. Very overpriced. Ive stayed in better hostels for cheaper. Only good thing about the hotel was it was close to camden lock underground. I would never stay here again.", "Date": "June 18, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "3.0", "Value": "4", "Sleep Quality": "3", "Rooms": "2", "Location": "4"}, "AuthorLocation": "Jakobstad", "Title": "“Well worth the money”", "Author": "MPV87", "ReviewID": "UR66406683", "Content": "My fiancÃ© and I stayed at the Camden Lock Hotel during our trip to London, and through there were things we were a bit disappointed by, overall the stay was pleasant. The hotel is located very close to the Chalk Farm tubestation, which provides easy transportation to downtown London. Also nearby is the hip Camden Lock Market, well worth a visit. The room itself was small, with nowhere to put our bags except under the bed. The room also had a faint smell of cigarettes everytime we entered, although neither me nor my fiancÃ© smoke. The smell dissapated as soon as we opened the window. The bathroom was okay, but the shower was so and so. The waterpressure was terrible and you couldn't set the water temperature as you wanted, so we showered in scalding hot water. Breakfast was adequate, consisting of scrambled eggs, white beans, tomatosauce, bacon, sausage, cereals and a selections of beverages. We were a bit unaccustomed to the English type breakfast so we kept to cereals and toast, which worked well for us. Staff was very helpful, especially during our last day when we had problems with our flight due to the ashcloud. Next to the hotel is a bar, which got very loud during the weekend, even more so since we wanted to sleep with our window slightly open. For people who sleep lightly, this can be a problem. For us this didn't turn out to be such a big problem. We were so exhausted from walking around London that when we came back in the evening, we fell asleep almost instantly, noise or no noise. +++ location, beds, staff - - - smokesmell in room, no elevator, nowhere to put bags in room All in all, Camden Lock Hotel was a very nice hotel to stay at, and we recommend it to anyone who want to stay at an affordable hotel in a very hip London neighbourhood.", "Date": "June 4, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Dublin, Ireland", "Title": "“cheap and cheerful”", "Author": "dannymagra", "ReviewID": "UR65470673", "Content": "Great location. Hotel is right next to chalk farm tube station - ideal for getting you around london at a fairly cheap cost. The Camden markets are literally ten minutes walk from the hotel. There are also some decent pubs around. The staff in the hotel were very friendly and helpful. We arrived before our check in time and they let us store our bags in a spare room. The room itself was small and comfortable. Decent bed and pillows. The bathroom was clean. All in all you get what you pay for. Its a simple, clean hotel for a decent price. Highly recommended for young couples. Not ideal for a group of girls as Camden can get a little scary at night time.", "Date": "May 27, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "2.0", "Value": "3", "Sleep Quality": "4", "Rooms": "2", "Location": "5"}, "AuthorLocation": "Edinburgh", "Title": "“No hot water= no use.”", "Author": "AGKuma", "ReviewID": "UR64774951", "Content": "Pros: Decent breakfast spread included in price, excellent location (30 seconds from Chalk Farm station), helpful staff, cheap Cons: Our first room had a non-functioning shower with a trickle of icy water. We asked to be moved and this was granted very promptly- the second room had no bulb in the bedroom, making use of the mirror after 4pm impossible. Water temperature was fine in the evening, but the following morning it was freezing again! Hot water is one of those things a hotel has to get right; the lack thereof tainted our entire stay.", "Date": "May 19, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "2.0", "Value": "4", "Sleep Quality": "3", "Rooms": "2", "Location": "4"}, "AuthorLocation": "Dublin, Ireland", "Title": "“You get what you pay for, depends on room.”", "Author": "beamaling", "ReviewID": "UR59167351", "Content": "The major issue with this hotel is the noise from the pub next door. We stayed in Room 111 which faces on to the main road, believe it or not this was actually quieter as the rooms facing the laneway seemed to get the full force of the pub music. We were located near the take away but didnt experience any noise from it. The hotel is in a good location directly opposite Chalk Farm Tube Station, 5 mins walk from Camden. The condition of the room was ok - nothing great but adequate for the price. Basically you need to work out priorities in relation to location, cost and sleep!", "Date": "March 21, 2010"}, {"Ratings": {"Service": "2", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Location": "5", "Rooms": "1"}, "AuthorLocation": "Newcastle", "Title": "“NEVER AGAIN!!!!!!!!”", "Author": "coates3007", "ReviewID": "UR58623987", "Content": "After reading the reviews I expected this hotel to be noisey but I can just about sleep through anything so the noise didn't bother me much. However, what I wasn't prepared for was the state of the place! We were allocated room 201, the bathroom came complete with mould, cracked, chipped basin, moving floor and a lukewarm shower. The bedroom carpet was so dirty I was afraid to take my shoes off and the 'wardrobe' was a hook on the wall. The staff were polite and pleasant enough and the breakfast was just about edible but the only good thing I can really say about this hotel was the location was perfect. To say this is a 'no frills' hotel is a great under statement!", "Date": "March 15, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Belfast, Ireland", "Title": "“great hotel, service, location and price”", "Author": "christine_vedder", "ReviewID": "UR57282112", "Content": "we stayed here last august when we came to london for a gig. we were so impressed with the location, right opposite a tube station and literally a few minutes walk from excellent night life, food and shopping in camden. great kebab place right round the corner too ( marathon kebab!) we got a nice big room with a good view, it was very clean and a lot more than we expected for the price! really friendly staff, made us feel welcome and we really enjoyed our stay there. we will definitely return to this hotel. thanks!", "Date": "February 27, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Preston", "Title": "“Location location location.”", "Author": "PNE260_9", "ReviewID": "UR51597075", "Content": "Just returned from a w/e in Camden Town. The hotel is a perfect little budget no frills number. The room was adequate for our needs the shower redders, towels provided T tray perfect, TV on wall not a prob for me but if you like to watch sky sorry you've channels 1-5 to choose from.The pub over the road is great if you're in there the food is excellent but the music did pump out till 1 I went back to the room for more money and could hear every word being sung, problem if you're trying to sleep. The hotel door to the brass floor rail at the bar is 28 steps going 76 going home LOL.The beauty of this hotel is the location Chalk Farm tube is 2 mins so not far to walk with luggage. The brekky was excellent self service all you can eat english breakfast fare with cereals, unlimited T&C and toast. Friendly attentative staff also quickly sorted out a prob and compensated me for the incon. Upon checkout I rebooked for Sept you wont find a better no frills hotel in a cracking location with a brekky for the money in London trust me.", "Date": "December 21, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Location": "3", "Rooms": "2"}, "AuthorLocation": "Lancashire, England", "Title": "“An OK Stay”", "Author": "Frano67 Posted by an OctopusTravel traveler", "ReviewID": "UR49923807", "Content": "No frills to the rooms, but fair value - especially for Camden. Handy for the Tube, Camden markets & Roundhouse. Breakfast good, room ok, bathroom far too small. Its overpriced - but so is almost every other hotel in London.", "Date": "November 23, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Riyadh, Saudi Arabia", "Title": "“Excellent for a budget hotel”", "Author": "brad276", "ReviewID": "UR44176961", "Content": "I'm a seasoned budget traveller, so i research well for a decent and cheap place. When it comes to London, you're not going to get much better than this for such a low price. I paid about Â£60/night (which is cheap in London), and stayed in room 204. Big room, big bathroom. both clean. it does face the busy pub across the street, but as with most pubs, it winds down at midnight and is quiet. if you're an early sleeper, this is not for you. Many free wifi accesspoints to tap into, but my room also had a network cable. TV with 5 basic channels. breakfast was served, but I didn't have it when Camden high street is outside you're front door. there is no lift...so you're hiking up stairs if u have a lot of luggage. but if you're looking for a place to crash, easy access to central london...this is perfect", "Date": "September 24, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Location": "5", "Rooms": "4"}, "AuthorLocation": "denmark", "Title": "“Good hotel close to underground and Camden.”", "Author": "Anette33", "ReviewID": "UR42914145", "Content": "We stay for 4 nights and is was a okay hotel. We first get a room, with bad smell af someone had smoke there, we ask for another room a get one on 2floor. 206. Perfekt. Nice little room,little bad but okay. We didnt have hot water for two days, but the owner was nice and he will give us 10% of the price,but we have already pay. So next time,there will be a next time he will give us 20% of the price. The service was good and the breakfast is top of the pop if you like full english breakfast,my partner do. :-) Yes there are a pub on the other side of the road,but it is London and in the middle of Camden. Undergroundstation Chalk Farm is two minutes away from the hotel and there are only 53 steps to the platform from the street :-) Yes i will recommend this hotel for friends and other. We will stay there again on our next trip to London.", "Date": "September 19, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Location": "5", "Rooms": "2"}, "AuthorLocation": "Hampshire, UK.", "Title": "“A compromise between a great location and basic facilities.”", "Author": "chris241", "ReviewID": "UR38462704", "Content": "This was the first time i had visited Camden, so i wanted somewhere not only central but also reasonably priced. A quick search on google came up with the Camden Lock Hotel, so i booked it via the hotel's own website. In hindsight i could have probably found it cheaper elsewhere but i'll come to that later. The hotel itself was functional, with everything that needed to be there, but not a lot else. There was a small seating area near the reception desk which also doubled up as the location for breakfast in the mornings, but no seperate bar. Check in was very straight forward, and the member of staff who served us was friendly and helpful. The rooms were basic but comfortable, although slightly on the small side. There was a TV, a desk and chair, two beds, tea making set, and nothing else. No fridge, safe, or sofa, for example, so not really any good for relaxing. As we were only there for one night it wasn't much of a problem, but i probably wouldn't consider staying there for more than a couple of nights. The bathroom was a reasonable size, although our shower didn't get anywhere near the heat we set it too. Even with the dial at 50c it was nothing more than luke warm. Not a major problem and something that could hopefully be fixed quickly, it was only a small annoyance to us because of our short stay. The inclusive breakfast was one of the best parts of our stay. It was advertised as continental but it had nearly all the bits and pieces to make a cooked breakfast, as well as cereals, and toast. And it looked as if you could eat as much as you want, as it was all self service. There weren't any negatives to our stay, and the only area where the hotel loses marks are in what i see as slightly poor value for money. The cost of the room was Â£79 per night, and whilst i appreciate that is good value for a centrally located hotel, i still expected a bit more in the way of facilities both in the room and the hotel as a whole. Also a bit of decoration to give the hotel a bit of character wouldn't go amiss. Overall, i would probably stay there again but mainly for the location, and i would probably recommend it to friends and family, but not whole heartedly.", "Date": "August 22, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "London & Birmingham UK", "Title": "“Excellent Value!”", "Author": "CockneyBrum", "ReviewID": "UR36509446", "Content": "It's pretty hard to find a good value hotel in London for Â£79, so we were delighted to find one which was. Primarily we chose this hotel because we were seeing 'a-ha' at the Roundhouse opposite. The hotel is so near that you can practically see your room from the venue! The room was a good size, with a flat-screen digital TV with Freeview (I've not seen this in more expensive hotels), a good shower, and a comfy bed. The only disadvantage to the room we had was that it was dead opposite a pub, which can get noisy. The area is \"lively\". There's a good kebab takeaway a few doors down and a decent pub across the road. The hotel is a very short walking distance from Chalk Farm Hotel Underground Station and is on a main bus route into Central London. We didn't have breakfast as we woke up too late, but this didn't matter as nearby Camden Market is highly recommended where you can get good food from almost every corner of the globe. One thing to watch is that there's a sneaky Â£3.50 charge if you want to pay by credit card. We also didn't see a lift, so if you're carrying heavy bags you might want to ask for a ground floor room. Other than that, the staff and hotel were excellent.", "Date": "August 2, 2009"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Swansea", "Title": "“Camden Lock Hotel has had a makeover!”", "Author": "Pontlliw1", "ReviewID": "UR32012141", "Content": "Second time here for me. Again for a gig in Camden. I have no problems with this hotel- for the price and location you understand. Once I had checked in and walked to my room it was obvious to me that the hotel had had a makeover. New carpet, painted walls and railings. Even my single room had been redecorated with new curtains and double glazing! I was over the kebab shop (try a mixed grill for Â£6.50 for a guilty treat) and slept thrpugh the night. Breakfast as usual was OK for the price.", "Date": "June 10, 2009"}, {"Ratings": {"Service": "2", "Cleanliness": "4", "Overall": "1.0", "Value": "1", "Location": "4", "Rooms": "1"}, "AuthorLocation": "Exeter", "Title": "“Stay well clear of the single room....”", "Author": "SoloGal4ever", "ReviewID": "UR29825067", "Content": "I stayed in this hotel for one Saturday night to attend a wedding - as it was summer, I wish I'd just wandered the streets for the night. I had been warned that it could be noisey (a late opening pub on one side, and a club on the other) and had very low expectations. What I didn't realise is that, after 2am, everyone from the local bars heads to the all-night kebab shop underneath the rooms overlooking the street until -oh - 6/7am? Nightmare! I reckon the youth hostel would be a better bet for budget - as at least your paying less than half the price for not getting any sleep. And I was even quite drunk. And I had ear-plugs.", "Date": "May 12, 2009"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Location": "4", "Rooms": "2"}, "AuthorLocation": "HOlland", "Title": "“Great Location, Basic Hotel”", "Author": "Kaasmeisje", "ReviewID": "UR28419035", "Content": "I regularly stay in this hotel for business purposes. It is clean, accessible at all hours and on a great location. However, rooms are basic (Sky DTV is available!) and so is breakfast.", "Date": "April 20, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "4.0", "Value": "3", "Location": "5", "Rooms": "3"}, "AuthorLocation": "Cambridge", "Title": "“Perfect location for The Roundhouse”", "Author": "Salsagroupie", "ReviewID": "UR25857624", "Content": "The Camden Lock Hotel is not impressive on first glance, in fact the thought \"What have I done\" sprang to mind but when you walk into the lobby you start to feel at ease. The worn stair carpet can be a bit off putting but the room is very very clean. It is a little bit basic, no airs and graces but it has a comfortable bed with a flat screen tv. The bathroom was a very small but it had a working shower and did the job it was meant to do. The view was of The Roundhouse, in fact from the bar we could see the window of our room. The fast food shop underneath was noisey but hidden in the back was a remarkably good jazz cafe that I would go to again. All in all I will use this hotel everytime I come to the Roundhouse, in fact I would use it more often that that for overnight trips to London.", "Date": "March 9, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Check in / front desk": "3", "Overall": "4.0", "Value": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "New Brighton, Wirral", "Title": "“Fab for the price...”", "Author": "saxonspiral", "ReviewID": "UR22055439", "Content": "Don't be put off by the worn stair carpet that's the first thing you see upon entry---it gets much better! Our room (105) was roomy and clean, with comfy beds, tea/coffee, T.V., dressing table & clothes hangers. The shower room/toilet were very clean , and the shower was very easy to use (always appreciated!). What's more, breakfast is buffet-style, so you can choose what you want, (and how much!!) .The staff are very friendly, and even looked after our luggage on departure day, saving us left-luggage charges. We'll definately re-visit...", "Date": "November 21, 2008"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Check in / front desk": "3", "Overall": "2.0", "Value": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Derby, United Kingdom", "Title": "“Cheap, Adequate but perilous shower in 111!”", "Author": "sisterofnight", "ReviewID": "UR20845739", "Content": "Booking simple& easy via Active Hotels. Excellent price, and so handy for Camden. Clean n tidy room -although stairs and comunal areas in disrepair , wobbly floorboards and some dirty stains on landings. Few coat hangers, no chair, no Freeview only terrestrial, no towel rail nor bin in the bedroom - but they arent exactly essential. However a shower is essential -and no matter how long it ran or how many different settings I tried the shower in room 111 only had SCALDING hot water...I have scaleded my scalp as I had to wash my hair. So its ok but not room 111! I stayed in another room there a couple of years ago and the shower was fine.", "Date": "October 13, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Check in / front desk": "4", "Overall": "4.0", "Value": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "newcastle", "Title": "“Cheap, cheerful and central!”", "Author": "tortoisetraveller", "ReviewID": "UR19859275", "Content": "Myself and a few friends all booked rooms at this hotel on a Friday night as we had tickets to Ash perform at the Roundhouse. The hotel was perfect for us. It is literally just over the road from the Roundhouse, approximately 10 mins walk up to Camden market and there are a few good reasonable places to eat. We had dinner at a Belgian restauarant nearby which was fairly cheap and good food. The pub just opposite the hotel the enterprise was great. really lovely atmosphere and great DJ (Sue)- seem to remember dancing around to sound of music songs at around 1am- very random! We were up for a night out and went to bed around 2am so didn't have any trouble with noise. The rooms were small but clean and at the end of the day exactly what we wee needing. We paid Â£68 for the double room which for it's location was great!", "Date": "September 7, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Plano, TX", "Title": "“Good hotel”", "Author": "tvtag23", "ReviewID": "UR16781942", "Content": "This hotel was great. The staff was helpful, the room was clean, it was in a pretty good location, and there is free wifi in the lobby. You can't beat the price for what you get, though the bathroom is quite small. I would stay here again.", "Date": "June 8, 2008"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Check in / front desk": "3", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Young 20-something Bristolian.", "Title": "“Great location!”", "Author": "QueenAli", "ReviewID": "UR16705259", "Content": "The hotel is a great location and easy to find. Can be seen from the Chalk Farm tube station. Easy walking distance of Camden shops. Have stayed at the hotel twice, and not been disappointed. Its basic, but I have always found it to be clean, and hospitable. I have never had a problem with noise at night. A taxi from Victoria station is approximately Â£15. Have stayed in 3rd floor rooms both times, and not had a problem, except the lack of lift. Shower was sadly absolutely rubbish this time - worse than a dripping tap... Recommend for overnight stays but not any longer!", "Date": "June 5, 2008"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Liverpool", "Title": "“Cheap an good location”", "Author": "JillytLiverpool", "ReviewID": "UR13235507", "Content": "We stayed at this B &B as we were due to see Morrissey at the Roundhouse. After reading the reviews we were pleasently surprised. The room was clean and had all the expected amenities, even freeview! The staff were okay, they were I think Greek therefore the English wasn't that good but they were pleasent enough. The location is brilliant. Opposite a tube station and surrounded by Bars and restuarants. It is a lively area and there was some noise at night but if you want peace and quiet go to the countryside not London. We would definatly stay here again when we go to London as for the money it was excellent value!", "Date": "February 3, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Business service (e.g., internet access)": "1", "Check in / front desk": "3", "Overall": "3.0", "Value": "4", "Rooms": "2", "Location": "5"}, "AuthorLocation": "Dublin, Ireland", "Title": "“Great Location”", "Author": "abirdnow", "ReviewID": "UR12461443", "Content": "This hotel is in a great location. It is just minutes from the Chalk Farm station and the excellent Camden markets are in walking distance. The rooms are clean and modern and the staff were quite pleasent. The breakfast is a buffet with full english, toast and cornflakes. The only problem we had with this hotel was the noise, at night it was very loud outside and our room was facing a large billboard that had bright lights which our curtains didnt block out at all so the room was very bright at night. However for a budget hotel in London this is great, the price and breakfast is very good and its in an excellent location. I would go back to this hotel if I was on a budget but if not I would try book a more comfertable hotel in this area.", "Date": "January 9, 2008"}, {"Ratings": {"Overall": "1.0", "Value": "1"}, "AuthorLocation": "London", "Title": "“Disgraceful!”", "Author": "BusinessTraveller01", "ReviewID": "UR10009916", "Content": "Firstly id like to say that I donâ€™t feel safe in the hotel or the area that Iâ€™m staying in. I entered the hotel and was greeted by â€œwhat do you want?â€� I felt like I interrupted a mafiaâ€™s party or somethingâ€¦ Picture 1 â€“ shows my fire alarm which has so nicely been decorated by a carrier bag, I wonder is it works and if there was an actual fire in the building would I survive and get out Picture 2 â€“ has some beautiful hanging live wires fro the wall Picture 3 â€“ shows the immaculately clean toilet... â€œI think they need to invest in some domestosâ€� Picture 4 â€“ some lovely mould in the toilet Picture 5 - again domestos comes to mind. The shower floor was so dirty that I had to stand on a clean towel this morning in order to have a shower Picture 6 â€“ our good old mould friend on the tiles again Picture 7 â€“ im supposed to have a â€œcleanâ€� shower from this Picture 8 â€“ I asked for an ironing board. Nice rust and a whole on the board is really going to make me iron my clothes Picture 9 â€“ the amount of flyâ€™s, mosquitos and other insects in this place made me feel as if Iâ€™m living in the jungle Picture 10 â€“ Nice Tap Iâ€™m trying to make a joke out of this as much as possible in order to keep me sane but this accommodation is ridiculous. My university accommodation was much better than this. I canâ€™t believe I have to stay in a place like this", "Date": "September 27, 2007"}], "HotelInfo": {"Name": "Camden Lock Hotel", "HotelURL": "/ShowUserReviews-g186338-d242991-Reviews-Camden_Lock_Hotel-London_England.html", "Price": "$105 - $229*", "Address": "<address> <span rel=\"v:address\"> <span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">89 Chalk Farm Road</span>, <span class=\"locality\"><span property=\"v:locality\">London</span> <span property=\"v:postal-code\">NW1 8AR</span></span>, <span class=\"country-name\" property=\"v:country-name\">England</span> </span> </span> </address>", "HotelID": "242991", "ImgURL": ""}}