{"Reviews": [{"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Cincinnati, Ohio", "Title": "“not terrible but not great”", "Author": "Fancy24", "ReviewID": "UR137260268", "Content": "My husband and I stayed here for one night while traveling through town because the post lodging in Belle Chasse was full. We did get a military rate of just under $100. It was quite tricky to locate and I felt very uncomfortable driving through the neighborhood once we got off of I-10. I was kind of hesitant to stay here upon check in but the front desk clerk assured me that the area was safe. The police station was nearby as well as a Marine Reserve station that patrolled Federal City. Algiers is a few blocks away and offers a ferry to the French Quarter which we used. There isn't an elevator and the room is very outdated. It is large and had a kitchenette. The front desk clerk (forget her name, think it starts with an A) was very nice, helpful and took time out to give us directions and some ideas to do with our son. I can't say I'd stay here again when we come back in town but I wouldn't rule it out either BUT if they remodeled and updated the building then we definately would!", "Date": "August 15, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Joshua, Texas", "Title": "“Give this place a try”", "Author": "SAnderson4766", "ReviewID": "UR136425888", "Content": "Driving through the area to get to this hotel is a little interesting....but once we turned into the base I was happy to see a nice small hotel waiting for us. We were greeted by a pleasant gentleman at the front desk and given our room keys. The rooms are nothing fancy but they were large and clean and had a full kitchenette. Very good room for the price. Drive over and park to take the Algers ferry over to the French Quarter...but only if you plan on coming back before midnight. This is a great option so you don't have to try and find a place to park in all the chaos. Definitely recommend.", "Date": "August 6, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "", "Title": "“Nice clean hotel”", "Author": "Jessna", "ReviewID": "UR131893193", "Content": "Good facilities, close to Algiers Pt and free ferry to the French Quarter. Reception staff helpfull and friendly. Nice room with small kitchenette. We had a special rate so very good value. The hotel is situated in what used to be a Navy base so don't be put off by arriving at a gate to a complex bordered by a fence topped with barbed wire.", "Date": "June 13, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Frankfurt, Germany", "Title": "“agree entirely with captainRonn”", "Author": "Posted by a Wyndham Hotel Group traveler", "ReviewID": "UR130605875", "Content": "Federal City Inn and Suites is a great place to stay. It's quiet. Free parking. Large rooms with Kitchenette. Inexpensive. Safe. If you have a car, it's an easy drive to the $5 parking lot at Algiers point for the FREE ferry over to the French quarter and you get a great first impression of New Orleans that way coming in from the river. The Dry Dock Cafe is there at the ferry, so it's close and very good too, Coming here from I10 going east was tricky. We got lost twice.. our fault of course. First we missed the Business 90 west highway going over the river (GPS got us back on). Then our GPS and the directions from the Federal City website disagreed and we went with the GPS first, and the website later and got totally lost. However our GPS pulled us out of it again and got us to Federal City. It is confusing, so take a close look at a map or two before attempting this. It is worth it! (The night before federal city, our GPS was totally wrong so we were not completely trusting her at this point) We had investigated a 4* property close to Canal on priceline (or was it hotwire?) and determined that when you added on parking and extras, this property at Federal City was much less than half the cost of the 4*. If you like quiet, and especially if you have kids, this is the place for you. Be prepared, however, they do not YET have a pool. Apparently it is still mostly military personnel staying here even though this is not a naval base anymore. Although, the Marines do have a very secure large facility newly built in this former base. Final tip, after you enter the gate to federal city from Shirley, go left at the stop sign, the road curves around and after about 200 meters you'll see the Inn on the right. The Inn should provide better directions, and perhaps the exact coordinates for GPS units to make this an easier task.", "Date": "May 25, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Welwyn Garden City", "Title": "“Friendly, Well priced and OK location”", "Author": "WelwynTraveller", "ReviewID": "UR128673942", "Content": "I did not find this easy to get to from the Airport. I queued up to get a ticket for an Airport shuttle only to be told that they did not go to this side of the river. I then paid a lot for a taxi. Standard charge for taxis was $33 to a certian point + meter from that point and then bridge toll to cross the river (total including tip over $60). Now I have been there I know there are much easier and cheaper ways. e.g. Could get Airport shuttle (about $20) to DoubleTree Hotel or similar location hotel, then short walk and free ferry across from the bottom of Canal street and then $8 taxi or walk to Hotel, If this is your first time to New Orleans (as it was mine) then you would probably want to be sure of the route before trying it. Hotel is in a very, very quiet location - part of naval base? - and is not particularly well advertised. However staff were always very friendly and helpul. Room was clean, fairly basic, but does have cooking facilities and utensils (cutlery plates etc). Also has free WIFi. Key advantage of this location is that if you don't mind a walk (and make sure that you know the way) it is about 30mins (fast walk) to the free ferry that takes you across to Canal Street from where it is a quick walk to major sites like the French Quarter, Street Cars, Jackson Square, Aquarium, paddle steamers etc.Ferry's run 2 an hour from around 6.00am to 12.00pm. Taxi from hotel to ferry was about $8.00 not including tip and hotel were happy to book this for you. However coming back, althogh there is a taxi rank next to the ferry stop, I never saw taxis there except when they had been pre-booked, so if you want a ferry back I would pre-book - again the hotel could book one for you. I walked back at night twice having failed to be organised and book a taxi. It felt deserted and quiet (and guidebooks suggest that you don't generally do that) but I never saw any indication of trouble. I walked two different routes both fairly straightforward but I would recomend that you print out a map before you go. This was a great location for me as I don't mind walking, wanted to keep the price down - accomodation + transport costs - and it was a comfortable and enjoyable stay.", "Date": "April 26, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Prattville, AL", "Title": "“Great Value, safe surroundings”", "Author": "edandheather", "ReviewID": "UR128418358", "Content": "Have been to New Orleans before and wanted to stay somewhere safe. Room is a good size. Table and chairs for dining. Clean enough. Felt very safe. Very helpful front desk. Very difficult to find, call the hotel for directions.", "Date": "April 23, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Sleep Quality": "4", "Rooms": "3", "Location": "4"}, "AuthorLocation": "west wales", "Title": "“Good Value”", "Author": "chumba1mba", "ReviewID": "UR128131527", "Content": "Rooms are a good size, very clean and comfortable although basic,also the small kitchen area is well equiped with a microwave, hob and fridge. The hotel is located in a quite area across the river in Algiers. The staff were very friendly and welcoming, recommend that we park our car in a side street and catch the free ferry across to all the main attractions in orleans, ferry runs about every 30mins and it is only about a 10min crossing and everything is within easy walking distance, we found this arrangement ideal. We stayed at this hotel for three nights and thoroughly enjoyed our stay, we would definitely stay here again. Stayed in better and also stayed in alot worse worse.", "Date": "April 18, 2012"}, {"Ratings": {"Overall": "3.0"}, "AuthorLocation": "BC", "Title": "“Average Accommodation.”", "Author": "KSC248", "ReviewID": "UR127860090", "Content": "Hotel prices in New Orleans are high, this place is over the river in Algiers. This means a taxi ride to anywhere, including restaurants. The benefit is that it is very quiet. The best part of the hotel by far is the reception staff. They are wonderfully helpful and patient, always with a happy welcoming smile. There is no elevator to the second floor. Rooms are \"tired\" for the price paid. The bathrooms need an upgrade, mine had a torn shower curtain. The kitchen is nicely stocked and bed comfortable. Aircon was noisy. Overall it was an average Motel experience at an elevated price.", "Date": "April 14, 2012"}], "HotelInfo": {"Name": "Federal City Inn & Suites", "HotelURL": "/ShowUserReviews-g60864-d2443416-Reviews-Federal_City_Inn_Suites-New_Orleans_Louisiana.html", "Price": "$86 and up*", "Address": "<address><span rel=\"v:address\"><span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">740 Hebert Drive</span>, <span class=\"locality\"><span property=\"v:locality\">New Orleans</span>, <span property=\"v:region\">LA</span> <span property=\"v:postal-code\">70114</span></span> </span></span></address>", "HotelID": "2443416", "ImgURL": "http://media-cdn.tripadvisor.com/media/photo-s/02/7e/8b/b1/federal-city-inn-suites.jpg"}}