{"Reviews": [{"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "3.0", "Value": "4", "Sleep Quality": "4", "Rooms": "1", "Location": "4"}, "AuthorLocation": "Atlanta, Georgia", "Title": "“Not my style, but new and clean”", "Author": "Conniesat", "ReviewID": "UR126250138", "Content": "I just returned from a Business trip in Chicago. This hotel was on the list of selected hotels to be used by buyers attending the Home & Housewares show, and I have stayed in Comfort Inns before, so I felt comfortable booking here. The hotel is a convenient walk to several restaurants, grocery, a Starbucks right across the street, and Bloomingdales, Nordstrums, plus several specialty stores. It was very clean and newly decorated, and I felt comfortable being a woman alone in the big city. The staff is very friendly and helpful. Now for the down side: Right next door, and in fact, adjacent to the Comfort Inn is the Tokyo Hotel. If you want a bad dream, just read Wikipedia's take on this hotel. I never saw anyone go in or out of this building, so I don't know for sure what goes on there. When I stepped into the room on the 10th floor, there was a red glow in the room, coming from the bathroom. Upon further inspection, I found a huge glowing red lipstick print on the mirror which can't be turned off. The floor is a wood laminate, the bedding is stark white, there is a huge wall hanging above the bed with a giant handprint on it, and the wall connecting the room and bathroom is covered with a giant zipper. The room can only be described as \"urban ghetto\". I showed the pictures to friends I took of the room, and they suggested I rent it out by the hour while I was away, and advised that if I did so, to be sure and de louse it. I normally love traveling alone for a few days, but just hours after I arrived, I was so homesick I started to cry, and tried how to fit 3 days worth of business into 1 day so I could leave that room. It was very cold and unfriendly and I did not feel welcome. Based on all this, decide what you like and make your choice to stay or not.", "Date": "March 17, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Hudsonville, Michigan, United States", "Title": "“Great little hotel in a great location”", "Author": "Hillary677", "ReviewID": "UR125966800", "Content": "This is just a delightful little hotel in a fabulous location. It's walking distance to super shopping (Tiffany & Co.) and fun eats (Rainforest Cafe). The staff was attentive, parking was easy, and we enjoyed the little fitness center, sauna, and hot tub in the basement. Breakfast was nice, and with a AAA discount, the price was fabulous. We would certainly come back.", "Date": "March 12, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Lancaster, United Kingdom", "Title": "“Best place for value, quality and location”", "Author": "stella1001", "ReviewID": "UR125755974", "Content": "You can easily find hotel rooms in Chicago but to be within 2 blocks of the Magnificent Mile with clean and pleasant rooms, a good breakfast and a price that's affordable looks too good to be true. But we had all this and excellent welcome and service too. Would highly recommend.", "Date": "March 7, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Germany", "Title": "“Great location, good value for money”", "Author": "Merz45", "ReviewID": "UR125747046", "Content": "A pleasant hotel, with friendly staff and considering its central location, very reasonably priced. The hotel is ideally situated for sightseeing and shopping and our room was quiet and very comfortable. Some features were much appreciated - coffee and tea on hand in the dining room day and night; free wi-fi (though this didn't always work); real soap in our bathroom; our room was made up early (except Sunday); tea and coffee making facilities in our bedroom; and a good breakfast. What we found difficult to adjust to, coming from Germany, was the fact that all the hotel's cutlery, plates and cups were disposable, so even with some effort the amount of waste we generated just for breakfast was considerable. You evidently have to take this into account in any hotel in the US with a complimentary breakfast, but it does go against the grain for us as typical environmentally-conscious Europeans.", "Date": "March 7, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Illinois", "Title": "“Convenient location and very cool room!”", "Author": "businesstrav1", "ReviewID": "UR125620267", "Content": "My husband and I stayed here a few years ago and loved the location and the attached parking garage, but the room was just typical. This time we had a newly decorated room that was very cool! I think we may have been the first guests since the reno as the tv still had plastic on it! The bathroom was small but had a nice tub with a rainfall shower. The neatest feature was the lighted lipstick print on the bathroom mirror. Cool and made a great nightlight! Breakfast was good and the front desk help was friendly.", "Date": "March 4, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "", "Title": "“Great Location”", "Author": "comfortgrayslake", "ReviewID": "UR125453297", "Content": "This is an older building, which has lots of character. The hotel was just beginning to remodel when we stayed, and the remodeled rooms were not yet available. Even so, our room was in really great condition. It was spotless, though quite tiny, and everything worked properly. Breakfast was perfectly in order, and the hostess kept it running smoothly. As nice as the hotel is, the best part is the location. Right in the heart of Chicago's best dining and shopping area. And you can't beat $29 parking with in/out privileges. This gets my thumbs up, and as a manager of another hotel, I can be pretty picky.", "Date": "March 1, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Dublin", "Title": "“Good experience”", "Author": "Drapier", "ReviewID": "UR125172981", "Content": "Third stay - very good value for a super downtown location. The rooms are large and clean and have everything one needs except, if you need it, a view. Only the front bedrooms have a view. The side rooms, where I have stayed before, have a very limited view and even in the rear room where I stayed, the sunlight never penetrates. Staff are charming, breakfasts are a good example of the typical motel breakfast, and the lobby and breakfast gallery are straight out of old Chicago - very imposing. Coffee & tea on tap, they looked after my bags, good wifi.", "Date": "February 25, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Minneapolis, Minnesota", "Title": "“Our go to place to stay in Chicago”", "Author": "susanlamb76", "ReviewID": "UR124295574", "Content": "I have stayed at this hotel I can't even count how many times, at least once a year if not more. Every time I come into town I always get a room here! While it's not the fancy 5 star hotel, it's ALWAYS clean, if I ever need anything they are right at the door after I call. The front desk ROCKS-It's quick and easy to check in. The only bad thing I can say is, when trying to check in there isn't much room to \"park the car with flashers on\" while trying to get the keys and the parking transponder for the ramp, but really that's my ONLY issue and I don't think they can get the city of Chicago to make a bigger curb for them :)", "Date": "February 8, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "St. Louis, Missouri", "Title": "“Best value, great stay”", "Author": "rubyiu", "ReviewID": "UR123845377", "Content": "I found this place by searching the area I wanted to stay in. For the area and quality, the price was right! I wanted to be close to Michigan Avenue, restaurants, and a subway stop. This hotel fit the bill perfectly. Check in was smooth. We came early and our room wasn't ready but they stored our luggage and got us preregistered so we could pick up our key later. The concierge went out of his way to find a restaurant that we would like and gave us a map and directions. As people mentioned, the rooms are small. We didn't care. It wasn't like we were staying in our room a lot other than to sleep and shower. It was cozy for 2 but there was a closet, luggage rack, bench and chairs to put our things on. The bathroom was nice with a very nice shower head and water pressure. The bed was comfy and so were the pillows. We stayed on the 10th floor and could hear the city traffic but it wasn't a big deal. We didn't hear our neighbors. We used the spa, which was nice! It was a larger hot tub on the lowest level and was very relaxing after a long day. The breakfast was good. The people working there were working their butts off to keep things restocked. Lots of breads/bagels/danish, yogurt, waffles, fruit, juices, eggs, sausage, cereal, milk, coffee/tea/hot cocoa and oatmeal. The eating area is tiny and many people had to sit on couches. Not very many tables but we didn't mind and still had a place to sit. We loved being just blocks from Michigan Avenue and famous restaurants like Lou Malnati's, Pizzaria Uno, Hard Rock Cafe, Rock n' Roll McDonald's, Ed Debevic's and Gino's East. Lots of selection. The subway was a block away and easy to ride to the museum campus (aquarium, field museum, planetarium). We took the train to Chicago so didn't have to pay for parking ($29 a night.. eek!) We will stay here again!", "Date": "January 30, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Peoria, Illinois", "Title": "“Suite time at the Comfort”", "Author": "NPeach", "ReviewID": "UR123160901", "Content": "Check in was flawless. Desk staff, Lora and Michelle were very polite and helpful with suggestions on places to go, things to do. Our room was spotless. General Manager Jim Harness is to be commended on such an efficient operation, two weeks before Christmas.", "Date": "January 16, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "5.0", "Value": "5", "Sleep Quality": "2", "Rooms": "5", "Location": "5"}, "AuthorLocation": "La Palma, California", "Title": "“Good Hotel, Great Location”", "Author": "Ron R", "ReviewID": "UR122981643", "Content": "The staff is friendly and helpful, the location is great. Walk to Millenium Park, Navy Pier and all of Downtown. Adequate breakfast. The price was reasonable.", "Date": "January 12, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Detroit, Michigan", "Title": "“Nice hotel - great location”", "Author": "restandrelax84", "ReviewID": "UR122628345", "Content": "This small hotel is in the perfect spot for restaurants, shopping and even walkable to Navy Pier. Rooms are small but comfortable, most staff are nice and the breakfast was decent enough. I'd definitely stay here again for a Chicago trip. Parking is $29 a day with in/out... but we didn't need our car since it's such a walkable town.", "Date": "January 5, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "mumbai", "Title": "“William Burill is the best hotelier in the world”", "Author": "jayMumbai", "ReviewID": "UR122307453", "Content": "The hotel was gr8 and so were the people . The GM William Burill was one of the best I met in the world . Conveniently located , great prices and great service . Wish I could have stayed on longer", "Date": "December 31, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "New York City, New York", "Title": "“excellent & clean hotel.”", "Author": "kjd24288", "ReviewID": "UR122290999", "Content": "Excellent location for downtown shopping and restaurants. Very nice and friendly staff. We had 1 suite room for 3 nights - the room was large and my son enjoyed the sofa bed, fridge/microwave was fine in the larger room - very good beds and up-to-date furniture and bathrooms. Excellent value for the price, strongly recommended.", "Date": "December 30, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Quito, Ecuador", "Title": "“Great accommodation in Chicago”", "Author": "Galapagos-Guru", "ReviewID": "UR121906449", "Content": "I stayed at the Comfort inn hotel and suites in downtown Chicago and it was super well located close to every attraction and the best restaurants in town. I could easily get around for my business purposes and of course I got to enjoy such a beautiful city in this great location. I will definitely recommend this hotel if you are traveling to Chicago. The concierge was always very helpful and gave me the right tips to where to go and how to get around.", "Date": "December 20, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Chicago, Illinois", "Title": "“Great service and amazing view!”", "Author": "Ro_Fr87", "ReviewID": "UR121870551", "Content": "I had a fantastic experience when I stayed here. All of the staff were extremely pleasant, Including Rachael at the front desk. Everyone was very helpful and the room was great! Perfect for a little getaway in the city! I had to leave early in the morning, and I was still able to enjoy the complimentary breakfast. The breakfast starts at 6 am and had a variety of options to choose from. My friend and I will definitely be back to stay again!", "Date": "December 18, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Peoria, Illinois", "Title": "“Great location”", "Author": "liketotravel544", "ReviewID": "UR121640387", "Content": "The location was great - close to good shopping, eating, and events. Our room was very clean, bed was extremely comfortable, pillows were great. Whenever we saw any hotel personnel in the hotel, they always spoke and smiled. We had a small room, but it was perfect for us. Breakfast was included and was a good start to the day. We stayed before Christmas and noticed that a room off the breakfast area was open for gift wrapping. Paper, tape, and bows were supplied!", "Date": "December 11, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Toronto, Canada", "Title": "“Excellent location, rooms and staff”", "Author": "John E", "ReviewID": "UR121572627", "Content": "Excellent location for downtown shopping and restaurants. Very competent and friendly staff. We had 2 rooms - different sizes and fridge/microwave only in the larger room - both rooms very clean and comfortable with very good beds and up-to-date furniture and bathrooms. Excellent value for the price, especially since breakfast is included. Completely refurbished older building - outside has character and inside is completely up-to-date (best of both worlds!).", "Date": "December 9, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Mpls, MN", "Title": "“Great location and good price”", "Author": "Lotionistic", "ReviewID": "UR120795913", "Content": "Overall a great stay. We had a large room with a king, but I did sneak a peek of a smaller room (single or studio?) and it was tiny! We had plenty of room and a bar sink, fridge, and MW. The included b'fast was average, just like any other \"free\" hotel b'fast. The lobby was large, but the decor was mismatched - Tudor and Asian. Not that anyone cares, but it was odd. We walked to everything from the hotel and the price was great. The only negative was there was a strong sewer smell right outside of the hotel. After a long day out, we knew we were close to home b/c we smelled it!", "Date": "November 19, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "2", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Wexford, Ireland", "Title": "“Nice Hotel Good location.”", "Author": "paudbrowne", "ReviewID": "UR120475896", "Content": "I spent six nights here for the Chicago Marathon in October. I found it a nice hotel in an excellent location 2 blocks from Michigan Ave and the Magnificent Mile shopping area. Good location fro exploring Chicago on foot also. The subway station is Just around the corner, 7 day pass cost 23$and is a great way of getting around, you can also use it on buses. My room was a nice size on the 12th floor only negative about it was the window looks into a multistorey car park and very little day light came into the room. Free internet access. The breakfast was good and the staff friendly. I only major complaint is the price they charged me. $1160 for 6 nights, 6 night in December cost $662! at the moment.", "Date": "November 11, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "London", "Title": "“Comfort Inn Chicago”", "Author": "FC2010", "ReviewID": "UR118859371", "Content": "Location A really good location which made Chicago very walkable. Room Basic and functional Staff Cold and distant", "Date": "October 2, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Hanover, Pennsylvania", "Title": "“Accomodating Staff & nice breakfast”", "Author": "sdchron", "ReviewID": "UR118817676", "Content": "We recently spent two nights at the Comfort Inn. This was our first visit to Chicago and we arrived earlier than expected. The staff was very accomodating, allowing us to check in early. The room was nice, clean and comfortable at a great location and affordably priced. The breakfast was a very nice surprise, much better than I have experienced in other hotels. We would definitely stay there again.", "Date": "October 1, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "san francisco", "Title": "“First class property at a great rate!”", "Author": "hazelhazel", "ReviewID": "UR118665087", "Content": "We just returned from a three-night long weekend stay here and it was just perfect. This was our first time to Chicago, so we wanted to be downtown, but not in the too-commercial area, which is overpriced anyway. We got a great AARP rate, and they let us check in early as we arrived at about 6am, right in time for their free breakfast. Above average hot breakfast, which included a make-your-own waffle station. Perfect! We certainly filled up each morning before heading out to explore the city. The room (I think was a suite) was perfect, big comfortable bed, microwave/fridge, \"working\" internet (I say this because some hotels' included internet can often be a pain in the butt....!), spotlessly clean, two TVs, plenty of space for everything we brought. We even enjoyed the 24-hour complimentary coffee and the hot tub/sauna in their fitness area. Best thing about the hotel? The location. A couple of minutes from Michigan Avenue in one direction, a block from a supermarket, (always a good plus when traveling), and in the other directions just great areas to explore. If we come again to Chicago, I'm pretty sure we'd look into staying at this property again. If they would only build a roof-top swimming pool, then I'd probably rent the room by the year!", "Date": "September 27, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "New Jersey", "Title": "“A fine location, comfortable accommodation, reasonable price”", "Author": "JerseyObserver", "ReviewID": "UR118487990", "Content": "My wife and I spent five days a the the Comfort Inn in mid-September and liked almost everything about it. We were in a so-called \"queen room\" for two nights, and it was cramped--acceptable for one person, but not for two. It was, however, the room we reserved through a travel website, so we can't complain too much. The hotel staff, from the people behind the front desk to the people who made up the room, were universally friendly and efficient. My wife sometimes needs a wheelchair, and the hotel provided us with the name of a rental agency that delivered the chair before we arrived and picked it up after we left. For the last three days, we were transferred to a king room--an excellent accommodation--at a small increase in cost. It had a refrigerator, microwave oven, and kitchen sink. The kingsize bed was comfortable, the room airy and bright. The inn also provides a buffet breakfast. We went for the Art Insititute, about a mile away, and Wrigley Field, accessible by subway, the stop a block from the hotel. We enjoyed Chicago, and the Comfort Inn downtown is one of the reasons.", "Date": "September 23, 2011"}, {"Ratings": {"Location": "5", "Overall": "4.0", "Value": "5", "Service": "4", "Rooms": "4"}, "AuthorLocation": "Los Angeles, California", "Title": "“Excellent location in the city, tiny room, reasonable price”", "Author": "marathon308", "ReviewID": "UR118107815", "Content": "The hotel is in River North, about 5 walking blocks from DuSable bridge with plenty of Pizzerias and Starbucks around it. The Bloomingdale mentioned (in a review bellow) is a huge nice store for house stuff only. It is quite a neat location, however closer to the river maybe a lot more expensive. We ordered a room facing the street. One get used to the often heard sirens of fire fighter vehicles. The room was compact (like many hotels in the heart of a mega city). Internet quality was good (a cable connection in the room, Wifi in the lobby), TV set was old but it did not bother us. 2 armchairs, a bench and a small desk. Breakfast was common, eating space is small. Parking is expensive, so if arriving by a rental car, it is better to plan to return it just after check in (i.e. park in front of the hotel, use flashing lights for 15 minutes, check in and unload the luggage, then drive to nearby rental office). All major rental companies has a downtown office within a 0.7 mile nice easy walking. Our reservation was made through a conference office, 2 months in advance, price (133 $) was significantly lower than nearby locations or a regular daily rate.", "Date": "September 14, 2011"}, {"Ratings": {"Location": "5", "Overall": "5.0", "Value": "5", "Service": "5", "Rooms": "5"}, "AuthorLocation": "Ann Arbor, Michigan", "Title": "“Best value in Chicago”", "Author": "AnnArborBill", "ReviewID": "UR118070330", "Content": "My company recently booked several rooms at this location as a part of a trade show. We were extremely pleased with the size and cleanliness of the rooms, the friendly and helpful front desk staff and the great continental breakfast provided by the hotel. This is definately the best value in Chicago.", "Date": "September 13, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "4.0", "Value": "4", "Service": "4"}, "AuthorLocation": "Minneapolis, Minnesota", "Title": "“Very clean, friendly staff, in the middle of it all”", "Author": "Cinderbug", "ReviewID": "UR118018550", "Content": "We stayed here only one night but we are picky about location and cleanliness. We had a very clean room and it was close to everything one would want to see in do with only 24 hours in Chicago. We will definitely stay there again.", "Date": "September 12, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "5", "Overall": "3.0", "Value": "4", "Service": "4"}, "AuthorLocation": "Brooklyn, New York", "Title": "“We loved the location”", "Author": "WayneJV", "ReviewID": "UR118017879", "Content": "The hotel had a location near almost every place we needed to get to. The trains and buses were also nearby. The breakfast was good and had a great deal of variety. The room was relatively small but since we were out most of the time that was not a big deal. Since the hotel is sandwiched between 2 other buildings most rooms did not have a good view. Our room looked out to 2 brick walls. The cleaning crew sometimes did not complete all of the work that was needed (2 of the 6 nights).", "Date": "September 12, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "4.0", "Value": "4", "Service": "5"}, "AuthorLocation": "", "Title": "“Good hotel and great location”", "Author": "WeaponH", "ReviewID": "UR117681413", "Content": "The hotel was clean and the staff was very friendly and helpful. The rooms are a bit smaller than typical hotel rooms but that was not too much of a burden. It is right around the corner from the subway which was very convenient and also a short walk to Navy Pier. Definitely recommend this hotel if you are looking for a downtown location that is fairly priced.", "Date": "September 4, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "4.0", "Value": "5", "Service": "4"}, "AuthorLocation": "Columbus, Ohio", "Title": "“A hidden gem...”", "Author": "Whiskeychick", "ReviewID": "UR117654230", "Content": "We found this Comfort Inn to be an excellent value in an amazing location. Just one block from Michigan Ave, we walked everywhere we had to go. The room was small, but comfortable. The staff was friendly and helpful. Enjoyed our stay and would certainly go back.", "Date": "September 4, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "5", "Overall": "4.0", "Value": "4"}, "AuthorLocation": "Farmington Hills, Michigan", "Title": "“Reasonably Priced Hotel Located in the Heart of Downtown”", "Author": "willums", "ReviewID": "UR117544189", "Content": "We enjoyed our stay here. The queen room was small and the window looked onto an alley/courtyard so there wasn't much daylight. But if you're like us and only use your room for sleeping it was fine. The room was also quiet even though we were next to the elevators. The free breakfast selection was good, including hot foods and waffles. :) The hotel was also very close to the subway and major bus stops. And they had a luggage room for before check-in and after check-out. We would stay here again.", "Date": "September 1, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Newark, Ohio", "Title": "“Just Perfect!”", "Author": "dave_weekleytravel", "ReviewID": "UR117371020", "Content": "My wife and I enjoyed two nice days exploring Chicago. We picked this property because it was very close to the Red Line train. Easy to get here from Midway, about 50 min. Easy to ride to Wrigley Field too. Also, a couple of blocks from the Magnificent Mile. Perfect location. Bought CTA bus/train day passes in advance and they were mailed free to me. First impression - clean. Very helpful and friendly staff. We came in early and were able to check our bags in a locked area. Our room was clean, decent size and nicely appointed. Wish they didn't use flourescent lights in the bath, could be a bit brighter but was adequate. Room had a safe, microwave, small frig, good size tv, free coffee with coffee maker, large closet, wifi, hardwire hookup, good a/c, quiet, nice mattress. Room was clean! Breakfast was great! As the good word is spread the crowd gets bigger and seating was usually full but folks ate and left so others may sit. The manager says that renovation is coming soon and by early-summer 2012 that should help the seating. But the food choices were abundant and plenty of it. Two staff were working hard to make everyone happy plus keeping the food areas clean. Just awesome! Thanks gals! Bottom line - we'll be back and I'll recommend this property to my clients. Try a Segway tour from Absolutely Chicago Segway. Great people plus a fun, informative and lengthy tour for a good price. Company color is orange so look for the orange shirts. Literature in the Comfort Inn & Suites lobby in the bottom left corner of the rack. Dave G - travel agent", "Date": "August 28, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "4", "Overall": "4.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Farmington, Michigan", "Title": "“Great location, great price”", "Author": "kOps210", "ReviewID": "UR117057145", "Content": "We've stayed here several times. The suites have a lot of space, and they're very clean. The location is great, a couple blocks from the Magnificent Mile and a block from a subway stop. The staff was very friendly when we checked in and did some room switching so we could check in early (thanks Sandra!). Being a Sunday night, the value we received was exceptional. (Weekends are a bit higher). The spa in the basement is a little dungeon-esque, and has a bit of a mildewy odor, but it is quite relaxing! We're hoping they upgrade to Wifi in rooms soon; we're attached to an Ethernet cable right now. The TVs' could also be updated, fixing the HBO. Breakfast is breakfast...", "Date": "August 21, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Pittsburgh, Pennsylvania", "Title": "“Great Room & Great Customer Service”", "Author": "scientifics", "ReviewID": "UR117046774", "Content": "We found this hotel through Trip Advisior and then found a coupon on the hotels website for a great rate for a three night stay. We arrived a few minutes after check-in time and the manager asked us if we would like to wait for a room with a better view. We said sure so they stored our bags and went to park our car and were back 10 minutes later. At that time the manager had gotten us a room with a great view! The room was excellent and cozy...perfect for us. Parking is only $29/night (a bargain for Chicago) and breakfast is included with the room. Amazing location as well...we were able to walk to everything!", "Date": "August 21, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Cedar Rapids, Iowa", "Title": "“Affordable, Great Location”", "Author": "Deb Z", "ReviewID": "UR116967320", "Content": "Went to Chicago for 4 day family trip and wanted an affordable place to stay. This hotel not only affordable but centrally located to all major attractions. Only 2 blocks away from Michigan Ave and an easy bus ride to museums, zoo, Willis tower, and Navy Pier. Downtown parking only $29 a day(cheap for downtown hotels) but never needed to get the car out. Yes, the hotel is a little older but clean and comfortable. The staff was very helpful and special thanks to Carl who was very helpful in finding restaurants and public transportation. The hotel also offers free breakfast, which was nice when trying to watch the budget. Overall, I'd come back again.", "Date": "August 19, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "4.0", "Value": "3", "Service": "4"}, "AuthorLocation": "Detroit, Michigan", "Title": "“Great Location, friendly staff - we will stay here again!!”", "Author": "partyfamily", "ReviewID": "UR116595258", "Content": "We were looking for an affordable hotel to bring our kids to Chicago because it was close to Water Tower Place (American Girl, Lego store) and less than a mile to Navy Pier and Willis tower (Sears tower). Very clean hotel with mini fridge, microwave and mini sink area. Hot Breakfast consisted of waffles, eggs, bacon, muffins, etc. Parking was much cheaper than at most hotels. I would recommend this hotel to anybody and will certainly be coming back and staying at this location!!!!", "Date": "August 12, 2011"}, {"Ratings": {"Overall": "3.0"}, "AuthorLocation": "Lake in the Hills, Illinois", "Title": "“compact, clean rooms in nice location \"close\" to hubbub”", "Author": "ST61938", "ReviewID": "UR116530006", "Content": "i enjoyed this hotel ok. i was here for business and was able to reserve the room via accrued hotel points. That being said, i stayed here because i read suites in the hotel title and assumed i would have a small suite. perhaps that is available for a premium cost, i didnt enquire with the staff to find out. I found the room to be quite small - it was ok for me as a single, would be a challenge for 2 or more. the room layout was cramped - desk right next to door, big tv cabinet next to that, etc. just felt cramped. the room was very clean and the check in staff was very nice and friendly. this is a convenient location to the loop, mag mile, millennium park, etc. short walk to most of that, and not far from trains, etc. lot of restaurants in the area as well. overall thought it was average.", "Date": "August 10, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "5.0", "Value": "4", "Service": "4"}, "AuthorLocation": "Toronto, Canada", "Title": "“Friendly Staff, Great Location, Good Breakfast”", "Author": "Sonia1972", "ReviewID": "UR116491439", "Content": "My 9 year old daughter and I stayed at this hotel from August 2-5 2011. The location was great and the staff were friendly. The breakfast had a selection of waffles, eggs and bacon as well as toast, fruit and muffins.The hotel room was clean and had a great view. There are many restaurants around but I would not recommend eating at Pizzeria Uno's next door. I did not find the deep dish pizza tasty. The transit system is right there which made it easy to travel. The hotel is a 15 minute walk to Millenium Park which is worthwhile to see. Girodanos Pizzaria near the park was worth the 45 minute wait. I would definately stay at this hotel again.", "Date": "August 9, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Ocala, Florida", "Title": "“Great location”", "Author": "MeganD14", "ReviewID": "UR116345805", "Content": "Hotel is in a great location; we walked every where! The rooms are a little small, but well kept and the bathrooms are nice. We enjoyed the free breakfast each morning.", "Date": "August 6, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "3", "Overall": "3.0", "Value": "4", "Service": "5"}, "AuthorLocation": "Sault Ste. Marie, Canada", "Title": "“we had a good stay - great service and good value - a few problems”", "Author": "Summer5", "ReviewID": "UR116325693", "Content": "We stayed three nights at this hotel and would stay here again. This hotel is good value and close to everything. The hotel is hard to find at first as the sign above the entrance is not that obvious in day light. As recommended, we stopped in front of the hotel, one of us ran in and got the parking garage transponder. When we got back to the front desk we couldn't fully register because their computer system was froze up. The receptionist took us up to our room and later brought up the key cards. Our ninth floor room was small but with a great view of the Hancock building. Room faced the street but the traffic noise was never a problem. Room was kept clean. We forgot to close the safe one day and not one thing was taken. The toilet plugged up one morning but was fixed by the time we got back later that day. This hotel is conveniently located. We walked or took buses everywhere we wanted to go. There are many restaurants in the area. The streets were full of people - tourist, like ourselves, and people going to/from work. We felt safe walking the neighborhood.", "Date": "August 5, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "", "Title": "“Friendly downtown hotel”", "Author": "ts846", "ReviewID": "UR116237430", "Content": "I have stayed four times in this hotel. I have always found the hotel staff to be friendly. The rooms are neat and adequate. Complimentary breakfast is very good. I find the location to very convenient for shopping and eating out. There is a small fitness centre.", "Date": "August 4, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "3.0", "Value": "5", "Service": "2"}, "AuthorLocation": "San Diego, California", "Title": "“Great location, good value for money”", "Author": "LGoehle", "ReviewID": "UR116237347", "Content": "For the price, a good place to stay in the heart of Chicago. Few blocks to the shoreline, great shopping and musuems in the area. The rooms are small and reminded me of the size you often see in European hotels. The room included one occassional chair, a desk and chair, wardrobe, queen bed and TV. The bed is very comfortable, with soft pillows. The TV is older model- so no HD or flat screen. There is not wireless in the room, so need to use your USB port. The hotel had a small work out room and laundry, which would be handy if staying for a few days. There is no restaraunt in the hotel, but several options from low to high price in the immediate area. Parking was $27/night which was lower than the other garages in the area. The catch is that you are given a control to let you out of the garage- and then have to drive around the block to return the remote to the desk. Breakfast is a typical pre-packaged continental offering breads, cereals, fruit and juices. Not so good: Young reception staff in the evening and night, who in my opinion have not learned what customer service means. The walls are thin- you hear alot of the hallway traffic. I had reserved a queen bed corner room, figuring it might be a little smaller but a corner room would have less traffic and maybe be quieter. However, I was not booked into the corner room and still given the queen bed.", "Date": "August 4, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Rockville, MD", "Title": "“Excellent hotel”", "Author": "SereneRockville_MD", "ReviewID": "UR116171040", "Content": "The hotel's location is excellent - just a few blocks from Millennium Park and from the docks for the architecture boat tour. We hosted some friends in the evening, and the living room/kitchen set-up is ideal for that. - the fridge was large enough to hold a catered fruit platter and drinks, and the staff were very helpful, and brought us extra chairs. The doorman and front desk staff were very friendly. The bed was very comfortable. This was our second stay here, and we recommend it highly.", "Date": "August 2, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "", "Title": "“Friendly staff, comfortable, convenient & quiet!”", "Author": "LJinWA", "ReviewID": "UR115768449", "Content": "We couldn't have asked for a nicer place. We asked for a different room & were accommodated in a prompt & friendly manner by Laura at the front desk. Breakfasts were great every morning, the hot tub & sauna area clean & well maintained. Place was convenient to everything so didn't need to rent a car. Took blue line from o'Hare then red line to Grand. About a 1 block walk from there. When we checked out our flight wasn't for several hours & they stored our luggage to give us a few extra hours of sightseeing. We are coming back to this little jewel on Ohio Street.", "Date": "July 25, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "4", "Service": "5"}, "AuthorLocation": "Long Island,NY", "Title": "“Pleasant stay”", "Author": "nymx5793", "ReviewID": "UR114972508", "Content": "Stayed her for a couple nights in June 2011. Overall a very nice hotel and a great stay. Its a very well maintained Comfort Inn. PROS Price Location: Downtown ChiTown location CANNOT be beat. Within walking distance of the stores, buildings, Navy Pier Park, and the water. Awesome! Rooms: On the average to smaller side but everything was new. New tv, new carpeting, new bathrooms, etc. Very nice. Breakfast: Had eggs, sausage or bacon, pastries, waffles, cereal, oatmeal, juices and coffee. Oh, and it's free. Staff: Overall staff was pleasant especially the woman at the breakfast area. Free wifi CONS Housekeeping is a bit sluggish My view was: on one side a ventilation shaft, the other side a parking garage. Was not a big deal to me though. I had a great stay and will be back!", "Date": "July 2, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Michigan", "Title": "“This is the Place!”", "Author": "beachbum070", "ReviewID": "UR114963330", "Content": "If you need or want to stay in the River North area of Chicago, then look no further. Great rooms that are clean, great location, (walk to the Pier), and affordable! Staff is excellent in all respects and the breakfast is great, (waffles tooo!). Parking is extra but expected and reasonable. Right on the property.", "Date": "July 2, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Aberdeen, United Kingdom", "Title": "“Great hotel, great location”", "Author": "AberdeenM", "ReviewID": "UR114872667", "Content": "I booked hotel on Expedia and found it to be a good hotel with pleasant, helpful staff. I lost my wallet on the train in from the airport and the receptionist (Michelle?) was helpful in getting me checked in without a credit card so I could get to a phone and cancel credit cards etc. My room was comfortable and kept clean throughout my stay (12 nights). The complimentary breakfast is a fine start to the day but can get crowded at times. Free internet access is available in bedrooms. The hotel is one block from the Grand Red Line El station which is great for a cheap means of getting in from the airport. The central location is close to Michigan Ave shopping and surrounded by many restaurants and bars. The Loop, Millennium Park, Grant Park & the Art Institute are walkable in 10 - 20 minutes. And many attractions can be reached by a relatively short walk or short El ride. I have stayed in this hotel before (2005) and would not hesitate to stay again when I return to Chicago.", "Date": "June 29, 2011"}, {"Ratings": {"Cleanliness": "2", "Sleep Quality": "2", "Overall": "2.0", "Value": "2", "Service": "1"}, "AuthorLocation": "Kyoto", "Title": "“Sorry”", "Author": "tyhoon", "ReviewID": "UR114789529", "Content": "Roomm wa dark and narrow. Brekfast was minimum selection with limited number of table seats. It was my first experience to have something on my knees in the hotel. Furthermore,my room was not cleaned until my claim call at 4pm.", "Date": "June 27, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "3", "Overall": "4.0", "Value": "4", "Service": "4"}, "AuthorLocation": "Bethlehem, Pennsylvania", "Title": "“Affordable and would stay there again”", "Author": "stephmark08", "ReviewID": "UR114586226", "Content": "This was a good hotel, a little noisy at night but it is in a major city so you should expect noise. The room we had (room 303) had a big front window that was over the street and could be opened. It was a small room but clean... had a suprisingly good free breakfast every morning with muffins, cereal, toast, waffle iron so you could make your own waffels, eggs and meats, even mini yogurts. The juices were kept full and coffee was out 24 hours. Service was good. As for location it is 3 blocks from Michigan Ave and you are surrounded by restaurants and bars, from pizza to 5 star steaks to great dive bars with some fantastic food. The Red Line 'L' entrance is about 3 blocks away, and there was a bus stop right on Michigan Ave. We walked EVERYWHERE, and we felt safe all night. Chicago is a huge city and I would DEFINATELY stay here again, not a five star hotel but it is clean and conviniently located to everything!!!", "Date": "June 20, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Orlando, Florida", "Title": "“A friendly staff and excellent downtown location makes this a winner”", "Author": "littlewolf1956", "ReviewID": "UR111363317", "Content": "Stayed two nights in a double queen size suite. The room was very nice & clean. The beds were very comfortable. The entire hotel staff, from the front desk to housekeeping, was cheerful and friendly. The breakfast was fresh, tasty and well staffed. The parking garage is convenient and secure. This downtown location puts you right in the middle of Chicago and it's many great restaurants and tourist destinations. It's also close to a great jazz & blues record store and an awesome book store. I look forward to making this my home away from home on my return trip to the Windy City. Be sure to check out the manager's special - I got free parking by just showing my Cubs tickets when I checked in after booking directly with the hotel. Also, the sauna and whirlpool were fantastic as was the workout room. Thanks again to the entire staff for a job well done!", "Date": "June 3, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Oregon", "Title": "“Wonderful place to stay”", "Author": "smilinglady13", "ReviewID": "UR110173548", "Content": "The moment I showed up at the hotel exhausted from my trip there until I checked out, I received absolutely wonderful treatment. I especially enjoyed the lady that kept the breakfast area filled with food. She also had a pleasant comment and a nice smile. My stay was a week long, never a mean or grumpy look. I also liked the front desk people as they were very helpful to me. I had never stayed in Chicago before and did not have a car. By their help I was able to see all the items I had on my \"must do' list. I will certainly be returning to visit Chicago and staying here.", "Date": "May 27, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Waterloo, Iowa", "Title": "“Great Location, clean room”", "Author": "ladybeetle", "ReviewID": "UR109711399", "Content": "Stayed there during recent restaurant convention at McCormick Center. Not a very pricey hotel. My room was not big at all as some reviews said, I had a single, queen bed and small room, but clean. Room faced the front on the third floor. That was great for people watching but kind of noisy. Windows did open. I think drivers in Chicago need to honk their horns a lot. I could walk up and down steps no need to wait for elevator. Beds are middle of the road OK. Great location near Michigan Avenue and blocks from the river. It's not a bad walk to go across the river to Millinium and Grant parks, etc. If you get tired of walking you can cab back for about $10. Great restaurants and grocery/deli very near by. Around the corner from Nordstrom and other shopping. No pool, but OK hot tub, could have been hotter but had nice jets. Served continental breakfast in morning in which one could make their own breakfast sandwich, or make a waffle along with a donut/pastry and juice bar. Great coffee. Staff helpful and friendly. Parking is right next door, but the pedestrian exit is on Grand Ave so you have to walk around the block with your luggage. So if you are going with someone else drop them and the luggage first, then go park. I would map this or any location on mapquest and pull up shopping, restaurants and other items around it. I will stay here again next year for the convention.", "Date": "May 24, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Roslyn, New York", "Title": "“Great Stay in a Great City!”", "Author": "passionate-gardener", "ReviewID": "UR107300113", "Content": "I was with a Road Scholar tour and everything was terrific! The staff was helpful and courteous. The room was clean and quiet. Couldn't ask for more!", "Date": "May 7, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "3", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Edmonton, Alberta", "Title": "“Big Value in a Small Hotel”", "Author": "DisIllusioneD_52", "ReviewID": "UR107276349", "Content": "This hotel is in a heritage building just minutes on foot from the Magnificent Mile. The interior has been very nicely upgraded and belies the age of the building. The rooms are well-appointed and scrupulously clean. In fact, each room includes a fridge and a mini-microwave! Every member of the staff I came in contact with was unfailingly polite and helpful, especially Karl, the doorman/concierge. The continental breakfast includes a good variety of choices and is available for most of the morning. I didn't have occasion to use the onsite laundry facilities but knowing they were there was very reassuring. The room rate is reasonable, considering the location and amenities and I would stay here again.", "Date": "May 7, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "CA", "Title": "“Nice affordable place in a big city”", "Author": "JLB63", "ReviewID": "UR106548344", "Content": "A nice surprise. Room nice and big. Even thought I used points, The rack rate was around 1/2 of what my friends were paying downtown and they had a very small room. Would definitely go back again!", "Date": "May 2, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Jackson, Mississippi", "Title": "“Well worth the money!”", "Author": "moparallen", "ReviewID": "UR106490078", "Content": "Do you stay in a Hotel in Chicago for the view or the location? Yes I was also looking at the wall, but I wasn't there to see the city from my room window! We were able to walk everywhere we wanted, see everything we wanted, do just about everything we wanted. Flew into Midway, rode the Orange line to Roosevelt then changed to the Redline. Went straight to the hotel with no problems. I stayed 2 nights on seperate nights. Rooms were fine for the two of us. Bed was comfortable and the bathroom was clean. The workout center was better than many I have used at places that were way more expensive. I will be back.... The only negative was having to walk up 14 flights of stairs when the elevator was out. It was a weekend and it did take a while to get it fixed but the staff was trying hard to please.", "Date": "May 2, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Puerto Rico", "Title": "“great location and Price”", "Author": "julie_r04", "ReviewID": "UR106032821", "Content": "The Hotel have a great location,,Clean , comfortable and the staff very cordially and friendly.The hotel is near the red line train and the Bus Stops. Near Magnificient Mile and interest points. I will stay again.", "Date": "April 28, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Monterrey, Mexico", "Title": "“Great location and price”", "Author": "rrmz", "ReviewID": "UR106023678", "Content": "This is a great option for the Chicago area, well located, mantained and accesible, will certainly be my first choice for next visits.", "Date": "April 28, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "West Bloomfield, Michigan", "Title": "“Excellent location, superb staff, clean comfortable room.”", "Author": "Boss48322", "ReviewID": "UR105993038", "Content": "This is an excellent location in Downtown Chicago. Parking is a breeze as the parking is located right next to the hotel. The hotel is clean and the staff is very helpful and friendly. I needed directions on two occassions from two different desk personel and both times the interation was courteous and patient. The rate was reasonable and this hotel includes breakfast.", "Date": "April 28, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "West Lafayette, Indiana", "Title": "“Great location, everything you need at a reasonable price”", "Author": "ewachs", "ReviewID": "UR105986472", "Content": "I traveled here with my husband and our toddler (under 2). The hotel is in a great location, quite accessible to the magnificent mile and the bus (I believe close to the train/subway as well but we didn't use it). We went to the Field Museum by bus and walked back (a longish walk) and also walked to the area of the Art Institute of Chicago. The breakfast is basic but perfect for families. No complaints, I just don't know how it would be with two small children because the rooms are small so two cribs or even one cot would not fit.", "Date": "April 28, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Bloomington, Illinois", "Title": "“Location”", "Author": "narimasu70", "ReviewID": "UR105039710", "Content": "This hotel is centrally located, has a great complimentary breakfast to start your day off, and the rates were very low for downtown Chicago. The staff was very helpful and eager to direct. The only negative I have for this hotel is that we reserved a room with a living area attached, so that we could have a meeting area for conversations and planning, This had to be the most uncomfortable sofa ever designed.By the end of our time, most of us were sitting on the floor. Make sure to take the self park option if you're driving. They give you a transmitter to enter and leave the parking garage whenever you wish. It's also cheaper than valet parking and I beleive, a lot quicker.", "Date": "April 22, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Saint Louis, Missouri", "Title": "“Great location & Price”", "Author": "nixtravelz", "ReviewID": "UR102942546", "Content": "My husband and I stayed in a room with a single queen bed. The reviews are correct in that this is a very small room and the views out the window are of the dirty building next door. However, the hotel is very clean and I found the staff to be very nice and helpful, the price was great and you couldn't beat the location. Two other couples joined us for the weekend and found the accommodations to their liking as well. It was also very close to the subway system. One hint to travelers visiting for the first time...bring a map of the subway (including the loop). Fortunately, I brought one, otherwise we would have been lost! Make sure to check out Gino's East Pizza and Garret Popcorn while visiting. Loved it!", "Date": "April 5, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "3", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Bloomington IL", "Title": "“Great Location, and good price”", "Author": "rbt226", "ReviewID": "UR100433215", "Content": "We stayed here on St. Patricks day weekend and was packed downtown. The Hotel staff was good but not great. Im sure they were just busy with it being St. patricks day weekend. We had a non smoking room and it faced \"The Wall\" everyone talkes about. Not a huge deal since we were not in the room very often. The rooms were small but not to the point of it being to cramped. Our reservation was for a queen bed but it was only a full size bed. The bathrooms were very nice and up to date and good size. Overall great location and would stay again!", "Date": "March 16, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Denver, Colorado", "Title": "“Superb hotel for travelers on a budget”", "Author": "tomcunniffe", "ReviewID": "UR100201546", "Content": "Many travelers have contributed positive reviews of this hotel, and I agree with them completely. The rooms are small, but adequate; window views are not great, but the staff is very helpful and the location can't be beat. What amazed me most was the vending machines. How many times have you found a hotel's soda or snack machine with prices 2 or 3 times higher than on the street? Not here! Prices are EXACTLY what you would find outside the hotel. Plus, they provide a washer and dryer so you can do your own laundry at a buck per load! High time that a hotel treated their customers with respect. One warning: after getting used to having fresh waffles every morning (a major part of the continental breakfast), you'll want to buy your own flip-type waffle maker when you get home!", "Date": "March 14, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "London, United Kingdom", "Title": "“Cheap, clean, comfy. Great location with excellent amenities nearby.”", "Author": "therewasthisonetime", "ReviewID": "UR98197836", "Content": "This is a great hotel if you want a cheap, clean and comfortable room just North or the Loop district. The room itself was not the largest, but had a huge, comfortable bed, coffee making facilities and a good bathroom with shower. The breakfast nothing fancy, but still good, bagels, muffins, pancakes etc, all limitless. Location is excellent, loads of bars, cafe's, restaurants within 10 minutes walk, excellent connections downtown or uptown to the best Jazz and comedy clubs. There is free internet in all rooms, or if you don't have a laptop a computer in the lobby with free access. The only thing that I didn't like is that I had to leave.....", "Date": "February 27, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Spokane, Washington", "Title": "“A great value”", "Author": "robertsjs", "ReviewID": "UR97127474", "Content": "This hotel is clean and convenient to all of downtown Chicago. The Red Line is just a block or so away and Michigan Avenue is a short walk. There are numerous restaurants nearby including some of the famous pizza places that are worth the visit. The hotel room was pretty small compared to most but we didn't really spend that much time there other than to sleep. The bed and pillows were very comfortable and the room was very clean. The continental breakfast was very good and added extra value to the price. There was the normal cereal, do it yourself waffles, pastries, bagels, fruit, and several drink choices. This is a really good value and the location is great.", "Date": "February 18, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Strongsville, Ohio", "Title": "“Great stay with superior value”", "Author": "Familyman54", "ReviewID": "UR91129081", "Content": "Great location for shopping, food, and theaters. We walked to most of our sites. Suite worked well for our family of 4 with sitting area with second TV and wet bar. Good free breakfast with make your own waffle iron, juices, cereal, muffins. 24 hour coffee and in/out parking. Great Deal $$$. Stayed over Christmas; even had free giftwrapping room. We made use of the small fridge and microwave and the market next door. Staff was excellent! Fast, free internet right in the room.", "Date": "December 30, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Location": "5", "Rooms": "3"}, "AuthorLocation": "chicago, IL", "Title": "“Great location and price-small rooms”", "Author": "ntlwhlr", "ReviewID": "UR90262087", "Content": "We recently stayed at this hotel while sightseeing and Christmas shopping downtown. Our stay here was decent. 1. Price - we booked right on the hotel website for $76/night for a queen bed room. Can't beat that price downtown with a location like this. 2. Clean - the hotel common areas and our room was clean and everything worked well. 3. Location - we were within short walking distance of most things downtown (tons of shopping and places to eat) and if you parked at the hotel there was a free trolley to a bit more distant place such as Navy Pier. 4. Free breakfast was decent-only hot item was waffles, toast or bagels but they also had fruits, cereal, pastries, juices, etc. Not bad for free. 5. The room we had standard queen room is quite small. There was room for the bed, 1 chair and a small desk. 2 people do max out this room or 2 and a child in a small crib. Overall, a good stay and we would stay here again if we wanted stay downtown.", "Date": "December 19, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "3", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Marengo, Illinois", "Title": "“Very convienent location, walls a little thin though.”", "Author": "Cathy0216", "ReviewID": "UR88542715", "Content": "We chose this hotel because the rate was good for what we wanted. We arrived before the 3:00 check in time and they had a room ready! We were able to check in and relax before heading out shopping. The room was small but okay for a 1 night stay, it was clean and smelled good too. The only complaint we had was the people in the room next to us were loud and sounded like they were in our room. The bed was comfortable, the pillows were really soft almost too soft but nice. The next day when we checked out they held our luggage for us until we were ready to leave so we were able to do some more shopping without carrying around a suitcase and other stuff. The hotel staff was very nice and they made us feel welcome. I would stay here again in a heartbeat!", "Date": "November 29, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Iowa City, Iowa", "Title": "“Good deal!”", "Author": "magicdiz", "ReviewID": "UR87636993", "Content": "good location, near some delicious restaurants. Grand El Train stop on the Red Line is around the corner of the building. our room was small, but clean and organized: queen bed, two end tables, foot rest, leisure chair, desk, computer chair, and tv cabinet unit. the view however was another building, but we didnt care. we don't go to big cities to look out the window all day! concierge was very nice and informative. breakfast on the 2nd floor was great: bagels, do-it-yourself waffles, cereal, fruit, yogurt, muffins, pastries, coffee, juice, hot cocoa, ect.... PARKING: Parking goes as follows: first you park your car with the emergency lights on in the street in front of the hotel. run in to check in, the gal will give you a little plastic case with a built in sensor to place on the dash of your car. the sensor automatically opens the gate to the parking garage. the public parking garage, that has 3 different entrances around the block. one is about 20 feet from the hotel doorway on Ohio St., or one around the block on Wabash Ave., and one on Grand Ave. (doesnt matter which you enter with). Then when you are ready to check out of your hotel, leave the sensor on the dash until you get out of the parking garage, park it in front of the hotel with the emergency lights on again, run in to hand it over. the fee for parking is $25 with in/out priveleges (just leave that sensor on the dash to \"remote\" open the gate so you can come and go as you like). if after you've checked out of your room, you want to stick around in Chicago longer than 12:00pm check out time without dealing with where to put the car, they can let you keep your car there for another $10 until no later than 5pm. so we did that. it allowed us to take the train to some shopping areas without worrying about the car. hope that didnt sound too complicated!", "Date": "November 19, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "4", "Sleep Quality": "2", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Baltimore, Maryland", "Title": "“Well located and reasonable”", "Author": "macndave", "ReviewID": "UR87314448", "Content": "Nice location. Weber Grill restaurant adjacent. Convenient for my meetings. Really decent rate. Nice size room with appliances. On the other hand very smoky smelling. Noisy AC unit. Clerk seemed put out that I needed receipts for all 3 of our rooms at check out and the printer was acting up. Overall positive experience. Would stay again at the same rate.", "Date": "November 16, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "2", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Woodbridge Va", "Title": "“Lived up to expectations”", "Author": "WoodbridgeVA", "ReviewID": "UR86271180", "Content": "The staff at this hotel is truly outstanding. I was combining business with pleasure which meant that part of the trip was on expense account and part on my personal dime. I have had difficulty in the past with hotels splitting reservations and not uncommonly have had to change rooms. This did not happen here. I was able to make two separate reservations, called the hotel in advance and they prepared separate paperwork while keeping me in the same room. When I arrived early on the first day, the front desk staff reviewed my reservation, put my luggage in storage and provided precise directions to my business meeting. The WiFi in the lobby was down but two employees dropped what they were doing and reset the router in a matter of minutes so I could check my email. Throughout my stay, all of the staff went out of their way to be helpful and responsive. Two negatives, one minor and one major. The room included a work table and two padded chairs designed more for watching TV than working at a desk. A straight back work chair would have been more useful since the arms of the padded chairs would not fit under the desk. More importantly, there was some sort of construction going on behind the hotel and trucks were going in and out all night (except Friday/Saturday). This was a real problem when the trucks went into reverse and put on their back-up horns at 3:00 am. I mentioned this to the front desk and suggested they install noise dampening curtains until the construction was finished. When I return, and I will but when Chicago is not quite so cold, I will ask for a room away from the back and probably raise my rating of the sleep quality. Location could not be better. Three blocks to Michigan Ave. Six to Navy Pier. About half a mile to the Art Institute. Easy walk to both Hancock and Sears (now Willis) towers.", "Date": "November 7, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Sleep Quality": "3", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Kolkata (Calcutta), India", "Title": "“good spacious well located”", "Author": "Awful_Kgp", "ReviewID": "UR84607808", "Content": "The staff were very friendly and helpful, there were luggage storing facilities.Lovely location and kitchen facilities avalaible.-walking distance to the river and also the magnificent mile with plenty of shopping nearby-souvenir shops adjacent and opposite to the hotel-worth going back again", "Date": "October 24, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Sleep Quality": "3", "Rooms": "2", "Location": "3"}, "AuthorLocation": "Mumbai", "Title": "“we have found our chicago hotel”", "Author": "mrali52", "ReviewID": "UR83335397", "Content": "this was our third vacay to chicago and we have found the perfect hotel. there is not a better location...convenient to the train, the restaurant district and shopping right around the corner. it is perfect for flying in, then hit the streets running. clean rooms, clean hot tub and workout room, good breakfast and located right by a jewel/osco if you want to grab anything from deli soups to steaks to microveable items. The staff could not have been friendlier. STAY AT THIS HOTEL...you will find your perfect chicago hotel.", "Date": "October 13, 2010"}, {"Ratings": {"Service": "2", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "2", "Location": "5"}, "AuthorLocation": "Halifax, Canada", "Title": "“Average hotel in a great location”", "Author": "halifaxns", "ReviewID": "UR81713586", "Content": "The Comfort Inn and Suites was our home for 5 nights in Chicago in late September 2010. In my opinion, the hotel itself is a pretty standard 3 star property in terms of rooms, services, etc. However, given its excellent River North location and the fact I got a room for $100/night, I'm giving it 4 stars for overall value. Room - We were in a basic room on the 7th floor. The room was very small but manageable for two people for 5 nights. Our room only had a window into a very narrow alleyway looking out at a wall about 3 feet away. The queen bed was comfortable. There wasn't much storage space in the room, but after unpacking and placing our suitcases on top of the TV/entertainment unit, there was enough room for us to move around. Shower water pressure was good and the bathroom was a good size. Overall, the room furnishings were a little dated, but the room was clean and served its purpose. Location - Absolutely perfect for our trip. The hotel is located a 1 block walk away from the Grand El station on the red line which was perfect for getting to/from most of the sights we wanted to see. Travelling in from O'Hare on the El blue line was about 1 hour. The hotel is very close to excellent restaurants, bars and shopping. There is a grocery store across the street which came in handy for picking up snacks/drinks. I wouldn't even consider staying in another downtown Chicago area if/when I come back. Service - It was efficient but lacked any friendliness or personality. On our way out the first evening, we let the front desk know there was no TV remote in our room. When we returned after dinner, they had placed one in our room. Breakfast - It is included in the room rate and feautres pretty standard fare (bagels, toast, cereal, some muffins, juices, coffee, yogurt, apples/bananas, waffles). It was a good quick way to start the day. They use disposable plates/utensils so you can pick up some food and take it back to your room if you want. If you're not planning on spending a lot of time in your room and can get this hotel for a good rate, I'd recommend staying there for the convenience of the location.", "Date": "October 1, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "5", "Sleep Quality": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Vancouver, Canada", "Title": "“Good value for a night or two”", "Author": "thetravelduck", "ReviewID": "UR81408007", "Content": "This hotel was fairly inexpensive considering it's location. It also included a continental breakfast which got the day started in a simple but satisfying way. I found the front desk staff just barely friendly and not very well informed - sent me jogging in a very busy pedestrian area during rush hour, said the CTA was 30 minutes to O'hare(it's actually an hour). There was always someone there and I never waited for help. They gave me a room at noon despite the posted check-in time of 3 pm. There is a single computer set-up in the lobby area for printing boarding passes, etc which I used for that purpose with no problems. The room is smallish but equipped with non-wireless free internet and free local calls, the bed is comfy with lots of pillows and the bathroom was modern, clean and had a good shower. It was quite noisy at night. I think this may be related to nearby construction as it was a load humming/droning sound that was not happening during the day and was stopped by 3 am. There was also some traffic noise but it wouldn't have bothered me except for this other problem. There are a number of good restaurants within a block or two and the red line CTA is only a block which is why I chose this spot for ease of transport to O'hare. I would stay here again but look for a room on the quieter side away from whatever is going on out there at night or confirm that the construction is completed.", "Date": "September 28, 2010"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "OTTAWA, ON", "Title": "“GREAT LOCATION CLOSE TO EVERYTHING”", "Author": "LOVE-MJSTANGS", "ReviewID": "UR80295537", "Content": "My senior mom and I stayed for 3 nights during Labour Day long weekend. Hotel is an older (European style) but very comfortable and clean. Included free breakfast. Hotel rooms had microwave and mini fridge and bar sink which is very handy. It is close walking distance to all the main stuff. Restauarants everywhere. Public transit very easy to use. Red Line (subway) around the corner of hotel and took it to Chinatown (\"95th station\" going and \"Howard Station\" return), very fast 10 min from subway station to Cermak/Chinatown stations (6 stops). If you're lucky and it is not crowded you can catch the free Trolley that runs from Navy Pier to about State Street vica-versa. The Architectural Cruise with the First Lady is recommended very good and informative. \"Uno's\" for deep dish pizza (long line up) and \"Calfornia Pizza\" are down the street have great pizzas. Only negative thing about this hotel is the old fashion small TV and no scenic view from the hotel room.", "Date": "September 20, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Atlanta, Georgia", "Title": "“Comfort stay indeed!”", "Author": "munamunir08", "ReviewID": "UR77496818", "Content": "Great location. I stayed three nights with my husband and sister visiting us from London. The hotel was walking distance from the Mag Mile, Millenium Park & Art Institute, John Hancock Tower, Sears Tower and the Pier. How can you go wrong if it literally takes 5-10 mins walk to the city's landmark and a good breakfast inclusive of your stay? Highly recommend everyone to stay here.", "Date": "August 30, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "1"}, "AuthorLocation": "Chicago, Illinois", "Title": "“Ruined Wedding Night”", "Author": "ellobie", "ReviewID": "UR76509462", "Content": "I booked a block of rooms & our wedding night room four months prior to the wedding. We had about 10 rooms of people staying, though only 2 rooms booked through the block because their online deals were much better priced. When we arrived after our wedding, the front desk treated us horribly. The group sales guy had not actually made a reservation for us (even though he took all my credit card info to hold the room) and they were completely booked up. Rather than help us find a room at another hotel or do ANYTHING to help us out, the staff just told us repeatedly they didn't have a reservation for us. A friend went next door to the Embassy Suites and THEY found a room for us down the road at Hotel Indigo, where everyone treated us with the respect any person deserves. Afterward, the group sales manager ignored my phone calls and emails to find out what had happened to so royally screw up our wedding night. I finally had to reach out to the CEO of Comfort Inn to get anyone at the hotel to contact me. They did offer us a free night if I could stomach the idea of returning to their establishment. No thanks.", "Date": "August 23, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "3.0", "Value": "4", "Sleep Quality": "3", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Missouri", "Title": "“Good Location and Value”", "Author": "lindsaylou82", "ReviewID": "UR74672819", "Content": "My mom and I traveled to Chicago for a mother/daughter weekend and stayed Comfort Inn and Suites Chicago. It was very well suited to what we needed, just a short walk to the Magnificent Mile, Navy Pier, and other attractions. There are several close restaurants as well, including Uno Pizza, yummy! The continental breakfast was good, cereal, bagels, muffins, fruits and waffles. Breakfast was very busy but staff worked hard to keep it stocked. The only thing missing for us was peanut butter...oh well! Our room was very clean, and had a separate living area with refrigerator and microwave which came in handy. Night time in the hotel could be a little noisy, but this was mostly due to normal city sounds and inconsiderate guests. The fitness center was pretty small: a bike, treadmill, elliptical and a few weights. Front desk staff was very nice and helpful. Carl, the bellman was especially helpful. I would stay here again if returning to the area.", "Date": "August 10, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Granville, Ohio", "Title": "“For me it was great - for the bride & groom, not so much...”", "Author": "africandreams", "ReviewID": "UR72759911", "Content": "I found this hotel several months back when I was preparing to travel to chicago for a friend's wedding. With the AAA price and the location of the hotel, it was too good to pass up. It's about a block from an L station, which is fantastic. Michigan Ave is two blocks up and Lakeshore Drive is only about a 15 minute walk. You cannot beat the location. The continental breakfast was also great - make your own waffles, bagels, juices, fruit, yogurt - a lovely start to the day. The rooms were small, but in good shape - you could tell they had been recently updated. I didn't mind the small space because I knew I really only needed the room for sleeping and showering. If you want luxurious space to hang out in - this is not the place for you. Anyway - I had a great experience, but the bride and groom whose wedding i attended were not so lucky. They had booked a block of rooms for the guests and were told a room would be held for them, too. Fast forward to the wedding night (or really, 2am the morning after the wedding), the bride & groom show up and there is no room at the Inn. Yup. The front desk staff were none too helpful - their only reaction to the situation was to put the bride on the phone with the manager. That, ummmm, did not go so well. Between the bride, groom and myself, we were able to find them another room in town, but with no credit to the help of the hotel staff. With that being said though, I am rating this on MY stay - which was lovely. My only advice - if you book a room be sure you have a reference number!!!!", "Date": "July 28, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Chicago, Illinois", "Title": "“The place to stay in Downtown Chicago!”", "Author": "Walkthedream", "ReviewID": "UR69344280", "Content": "I would visit Comfort Suites again in Chicago! They have the best cleaning services and the beds were like sleeping on clouds! I will recommend this inn to everyone!", "Date": "July 1, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "South Dakota", "Title": "“Business trip pleasure”", "Author": "llovin", "ReviewID": "UR68695184", "Content": "The Comfort Inn & Suites fit all of my needs perfectly. I was away from home on a business trip, so I spent a lot of time at the hotel while I was not working. Wireless internet was great, and room was very clean.", "Date": "June 25, 2010"}, {"Ratings": {"Service": "2", "Cleanliness": "4", "Overall": "2.0", "Value": "3", "Sleep Quality": "3", "Rooms": "2", "Location": "5"}, "AuthorLocation": "Edwardsville, Il.", "Title": "“You get what you pay for”", "Author": "JRTheChief", "ReviewID": "UR68674900", "Content": "My spouse and I recently completed a 3 night stay at this property. We had stayed here a few years ago in a suite room and were pleasantly surprised. This time we stayed in a queen room with results that weren't so pleasant. It was obvious that since our last visit the hotel had done nothing in the public spaces other than basic maintenance. The carpet was worn, walls needed to be painted, furniture needed to be replaced.The queen room was small but serviceable. It's condition was OK. The regular lighting in the bathroom is poor. You should not have to turn on the heater lamp to provide illumination. The counter staff was adequate. The one staff bright spot was the bellman Carl who was very helpful and accommodating. That being said, he was only on duty the day of our arrival. This hotel is in a great location north of the river. It's a block from a red line subway stop. Unless you get a great rate at this property I'd suggest looking elsewhere for accomodations.", "Date": "June 25, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "3", "Overall": "2.0", "Value": "1", "Sleep Quality": "2", "Rooms": "2", "Location": "4"}, "AuthorLocation": "Troy, Michigan", "Title": "“Never Again”", "Author": "glowmom57", "ReviewID": "UR67981245", "Content": "Had booked the room earlier in the year requesting early check-in. Arrived, told room wasn't ready. My daughter had to change in the bathroom to attend conference. Upon return to the hotel later in the afternoon, the room we were given was double booked. Had to wait while they moved that gentleman out and recleaned the room. Staff is indifferent. For the price charged for the room, the hotel is quite plain, the inconvenience - never stay here again. Willing to pay more for a nicer, more friendly place", "Date": "June 19, 2010"}, {"Ratings": {"Cleanliness": "2", "Overall": "2.0", "Value": "3", "Service": "1", "Location": "5"}, "AuthorLocation": "Fort Wayne", "Title": "“Oversold with Poor Alternative Choices”", "Author": "FlyOverGuy", "ReviewID": "UR67730637", "Content": "I arrived at 7pm to find they had oversold the hotel and that I can not have the room I reserved months in advance. The manager sends me to a new hotel I am told that is a great hotel a little north of downtown. I know the city is jammed for NEOCON, I dont expect a $500 room from the Comfort Inn but that is all that is available downtown. He does offer to pay for the new hotel and gives me $15 for my 30 minute of parking time I have now wasted. BTW - Do not take the stairs out of the garage they are sewers. This new hotel turns out to be in Lincoln Park...this is not a downtown location as I find out but 3.7 \"Chicago\" miles away that takes me 20 minutes to find. This new hotel has a parking garage that is so conjested they wont let you park your own car. When I ask the attendant if this is in deed the hotel parking garage he snaps back with a challenging \"do you have a reservation?\" Scary guy and he is NOT going to park my car. I tell him yes but I am not staying, he says good your not staying. Wierd scary dude. Anyway, my night is busted, I have missed my gathering. I drive out to the burbs and grab a nice easy in and out hotel, have dinner and drive back into the city for my conference the next day. The Comfort Inn screwed up and they ruined my evening. It is interesting they had my phone number. They could have called before I arrived. Maybe they were hoping to charge me if I didnt show. I had to agree to give them 48 hours notice if I wanted to cancel or pay them the amount of the room. Thumbs down and next year at NEOCON I'll pay a few bucks more and avoid this joint.", "Date": "June 16, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "cowley, alberta", "Title": "“great value, small room”", "Author": "cowley_traveller", "ReviewID": "UR65739299", "Content": "If you want to stay right downtown Chicago and not spend gobs of money, this place is great. Rooms though are small but clean and comfortable. We expect smaller rooms in downtown locations anyway, so we didn't feel disappointed. The hot tub was great with all kinds of jets but we had to turn on the sauna to heat it up. Breakfast is the typical Comfort Inn type but the breakfast room is quite small. I'd stay here again.", "Date": "May 29, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Lancaster, United Kingdom", "Title": "“excellent”", "Author": "stella1001", "ReviewID": "UR65653013", "Content": "Perfect for shopping on North Michigan Ave (the Magnificent Mile) or getting to the major downtown sights like the Millenium Park, the Art Institute etc. Lovely hotel and very friendly staff. Would highly recommend.", "Date": "May 28, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Sleep Quality": "3", "Rooms": "2", "Location": "4"}, "AuthorLocation": "Creve Coeur, Missouri", "Title": "“It was ok...”", "Author": "ShopNSlots", "ReviewID": "UR63830938", "Content": "We drove into Chicago and had to call the hotel twice in order to find it! There is nothing outside to tell you where it is. It is wedged in between some other buildings and restaurants. Parking is 25$ a day with in and out privileges (thank goodness for that, but you really don't need to drive that much) but the garage has no connection to the hotel. You drive, you park, you walk out of garage and back into front of hotel. Breakfast is free and is a carb lovers delight. Cereal, pastries, waffles, milk, juice, tea and coffee (which is available 24/7). They did have boiled eggs. Our room was in back of hotel which had one window facing the parking garage and the other facing walls and the heating cooling systems. The beds were nice enough, it was great that we had a dorm size fridge and microwave in the room along with a bar sink. The room itself was a bit small and the bathroom had the TP situated where you had to reach straight behind you to get to it - poor 'product' placement. Best thing about this hotel was price we paid for it and it was walking distance to almost everything we wanted to get to. Oh and free internet!", "Date": "May 11, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "4", "Sleep Quality": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "UK", "Title": "“Good breakfast, good location”", "Author": "lowmaintenanceBrit", "ReviewID": "UR63758424", "Content": "Stayed here while trapped by volcano. Trying not to spend too much, so was really pleased with the generous breakfast. Easy to walk to from the subway stop, so didn't need to pay for a shuttle or taxi. Free internet. Clean and quiet.", "Date": "May 10, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "st johns, NL", "Title": "“Magnificant Location/Hotel on the Magnificant Mile”", "Author": "Mizzpicky", "ReviewID": "UR62937548", "Content": "I stayed at this hotel from the 23rd of April to the 27th. I have all but good things to say. Check-in was quick, staff were extreamely freindly. Some reviews say that the rooms are small, but for a weekend getaway I couldnt ask for a bigger room, it was clean had all the basics you would need and I would say it was an average size. The location of this hotel is amazing, everything you would want to see including all the main attractions, food, shopping are right at your finger tips. We only got a cab twice and that was beacuse it was raining. Restaurants that are close by that you have to dine at are #1 Texas de Brazil( one of the coolest restaurants I ever ate at) unlimited meat!! #2 PF Changs ( really good) and Portillos is good too. There is a liquor store attaced to the hotel and there is ATM Machine inside there. I suggest using a banks atm machine to be on the safe side. Water tower is amazing for shopping and so is Felines basement (all designer stuff extreamely discounted). The hotel also has small gym with sauna and whirlpool (good way to relax after long day of walking). ok the continental breakfast is the best i ever seen. Every fruit/cereal/pastry/bagel you can imagine, make your own waffle station, bolied eggs and english muffins, every juice/milk. Perfect to start your day, we never bought breakfast once in Chicago!! Tip get the \"Go Airport Express\" shuttel to the hotel from Midway airport. Get the return trip, its way cheaper then a cab, approx $30.00 return versus a cab that can be $75.00 each way in traffic hour. Overall hotel is great, staff are fabulous, breakfast is great and a money saver!! stay here espicially if one a budget ( your getting a great deal)", "Date": "May 1, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Arlington, Texas", "Title": "“Perfect location”", "Author": "Delilah19", "ReviewID": "UR62624240", "Content": "This hotel is 1 block from the red line train. (Grand stop) Lots of restaurants within a few blocks. We had a room with 1 queen bed that faced the side of another building and it was VERY quiet !", "Date": "April 27, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "1", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Washington DC", "Title": "“Great Location Large Room with Wet Bar”", "Author": "ChattiPatti", "ReviewID": "UR60369120", "Content": "We used our points to book this hotel for two nights during Easter week. Our room was large and had two window- not much of a view but we were on the 14th floor. Wet bar, coffee in room, microwave and minifridge plus free breakfast downstairs. Very quiet and the king sized bed was comfy with lots of pillows! Ethernet connection was great", "Date": "April 4, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Stockholm", "Title": "“great hotel in the heart of Chicago”", "Author": "StockholmBean", "ReviewID": "UR59418358", "Content": "Great hotel experience. As all American hotels you only get sweet, white carbs for breakfast. Be careful with using the in-room entertainement system, you'll get charged without prior notification", "Date": "March 24, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Jacksonville, Florida", "Title": "“Nice Hotel in a Great Location”", "Author": "MrEdnWilbur", "ReviewID": "UR55982272", "Content": "I'm a frequent guest of different Choice Hotels and this hotel is one of its better ones. The building is older but the interior is newer and tastefully designed. The rooms were clean and spacious. The bathroom was immaculate. The price of the room also entitles you to a free continental type breakfast on the second floor atrium. But its biggest attraction is its location in the heart of River North at Ohio St between Wabash and State Streets. This is where the restaurants, bars and shopping are located. And two blocks away is the Magnificent Mile. Very nice indeed.", "Date": "February 14, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Location": "3", "Rooms": "3"}, "AuthorLocation": "Milan, Italy", "Title": "“good compromise”", "Author": "mauhey", "ReviewID": "UR54765910", "Content": "Well located (close to the tube but you may easily walk downtown). Safe area. More than acceptable room. Easy. Nearby big drugstore. No frills but this is how it should be", "Date": "January 30, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Tulsa, Oklahoma", "Title": "“A great deal on a great place”", "Author": "brendaintulsa", "ReviewID": "UR49937978", "Content": "I had a huge surprise walking into our room on this hotel. I haved stayed at Comfort Inns before and they always prove to be clean, and nice and always a good deal for the money however this time I was completely shocked by how nice the lobby, hallways, room and bathroom was. To top off our stay, the complimentary breakfast was extremely tasty and the front desk clerks met every need we had with a smile. I had the pleasure of speaking to the one of the managers over the phone and she likewise did everything possible to make our stay perfect. To finish off, the parking at this hotel is almost half of all other parking in the downtown area and is convient to the hotel. The hotel is a close walk to Michigan Ave. and to lots of great restaurants. So, if you are looking for a great deal is an expensive city, give the Comfort inn hotel and suites a try and ask for a king room at the end of the hallway. That is where we stayed and the room was large and perfect!!!", "Date": "November 24, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Oxfordshire", "Title": "“Just what we needed for a short break”", "Author": "Busily_retired", "ReviewID": "UR49636340", "Content": "Room very comfortable (esp. after long flight). Reception staff most helpful to 2 strangers to Chicago, and breakfast bar excellent. Easy walking distance or public transport to everywhere we wanted to go.", "Date": "November 20, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Toronto, Canada", "Title": "“Good bargain”", "Author": "greenbackpack33", "ReviewID": "UR49376667", "Content": "For the price I paid it was an excellent stay -- 3 nights in Chicago. The room was a good size, the check-in staff was courteous and very nice, but the check-out staff was rude and unfriendly. Parking with in and out privileges were $25/night which is unheard of in the city. Definitely will come back again.", "Date": "November 16, 2009"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "redmond", "Title": "“nice hotel, rude check out agent”", "Author": "seattle_wannabe", "ReviewID": "UR46290928", "Content": "very nice hotel located in a very nice spot in downtown chicago. enjoyed the stay, smaller rooms but clean and with a european feel to it. breakfast was good. No wifi at rooms only in the 1st and 2nd floors, where the dining room is. and beware of the check out agent S., she might try to rip you off by charging you $10, just because you chekced out 25 min late! she won't even notify you! read your receipt carefully before signing!!", "Date": "October 8, 2009"}, {"Ratings": {"Service": "1", "Cleanliness": "3", "Overall": "2.0", "Value": "1", "Location": "5", "Rooms": "3"}, "AuthorLocation": "detroit", "Title": "“rip off on a good location”", "Author": "heiwe189", "ReviewID": "UR45355149", "Content": "Good location, but the parking prices are ridiculous and don't try to ask for favors on late check-out they steal another $20 for that and damn you if you don't get the car transponder back to them - another $75 threat. you pay for the day but you better get out of that garage before 12... after almost a week of staying there one would expect they would offer some niceties like an easy late checkout or some extended parking - wrong guess.", "Date": "September 28, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "3.0", "Value": "4", "Location": "4", "Rooms": "2"}, "AuthorLocation": "Copenhagen, Denmark", "Title": "“Good location, so-so hotel”", "Author": "af01", "ReviewID": "UR44628084", "Content": "Stayed here for four nights when visiting Chicago. The hotel is located just 10-15 minutes walking from the loop, and you can walk anywhere in downtown if your up for it. In the area around the hotel there are lots of good restaurants. We booked a queen room, the room is small and crampy. It is sort of long and not very wide, and then cramped with furniture making it kind of an annoyance when you have to move your suitcases all the time to pass through the room. For a longer stay, i think i would go crazy with annoyance. The free breakfast was good and very standard, including a waffle bar which is nice. All in all the hotel offered a great value for money, we payed about half of other hotels in the same area. But it comes for a price, the rooms are small and you do have to walk 10-15 minutes for the attractions.", "Date": "September 26, 2009"}, {"Ratings": {"Service": "1", "Cleanliness": "3", "Overall": "2.0", "Value": "2", "Location": "4", "Rooms": "2"}, "AuthorLocation": "Minneapolis", "Title": "“Would not go back.”", "Author": "MNtravelergirl", "ReviewID": "UR40856663", "Content": "First of all, if all you are looking for is location and a parking/internet bargin, I would suggest this hotel. Otherwise, forget it. I had a single queen room and it was tiny. There was barely any space to sit, except for the bed and at the tiny desk for a computer. The internet access is free-but it's hardwired and very slow. I tested the connection and it's capable of higher speeds, but they limit the speeds to a crawl. Not worth the hassle, even for free. There is not a fridge or microwave. The customer service is horrible. They forgot to clean my room and then admonished me when I asked for towels, tissues, etc when I returned to the hotel at midnight. I wasn't told upon arrival that it's good to unload before parking in the lot, so I assumed that the lot was connected to the hotel. I wound up dragging my luggage around the block, in front of the Pizzaria Uno and into the street (due to construction) in order to get into the hotel. And honestly, out of any dozens of hotels I've ever stayed at, this bed was the most uncomfortable. It was incredibly hard and the pillows were flat. My husband and I left with sore bodies and necks (and exhaustion from being unable to sleep) for two days. I just cannot recommend this hotel.", "Date": "September 11, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "KC", "Title": "“Great experience”", "Author": "melancholymarie", "ReviewID": "UR40213450", "Content": "The rooms were clean but the bedspread was not the prettiest. Just cosmetics though -- form follows function and this room functioned. I had room 701 and it was a good location --the window faced ohio street and there was just one room caddy corner to us noise level was very low -- even street noise. The bathoom was spick and span. Shiney tiles lined the shower wall and ceramic tile on the floor. Granite counter top/sink area. Bed was very comfortable and had a thin blanket in betwen the sheets ('cause I kick the comforter off anywhere I go - too risky). The sheets were white and clean. The pillows (5 of them) were downy soft and fluffy! I did not find the room to be too small. The hall did smell of smoke... but I didn't spend much time there and it did not effect the room. I am very antismoke and if the roomed smelled it would have been a BIG problem. It did not. Breakfast was included each morning (until 11am on weekends and 9:30 during the week). Cups, plates, bowls, and utensils were disposable. I would recommend bringing your coffee cup or glass from the room (near the ice bucket) down to breakfast to cut down on waste. Items: Cereal, yogurt, bagels, croissants, muffins, english muffins, danishes, instant hot chocolate/oatmeal, waffle maker, hard boiled eggs, cranberry/apple/orange juices, milk, apples and bananas. Carl the doorman was the go-to man for directions. Checkin and out was easy. They even held our bags so we didn't have to check in early and pay a fee. Equipped us with a map and recommended a few nearby sites and we were free to start our trip without lugging our bags with us. Location was great -- literally just around the corner from the CTA. Gino's East and Portillo's Hotdogs are within a short walk. The Mag mile is also very close and easily accessible by walking. Oh and complimentary internet access. I recommend it and will stay here again.", "Date": "September 8, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Westport, CT", "Title": "“Couldn't Have Been Better”", "Author": "momof2boys52", "ReviewID": "UR37412716", "Content": "Great experience. Beautiful, huge, clean suite with fabulous view of city and water. Friendly staff. Great location at beginning of Magnificent Mile. Paid $169 per night which is a good value for what we got. Highly recommend it.", "Date": "August 11, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Location": "4", "Rooms": "3"}, "AuthorLocation": "Southwestern Michigan", "Title": "“More Info Ahead Of Time Would Have Been Nice”", "Author": "Deluxe2k", "ReviewID": "UR36326932", "Content": "Be sure to ask how to get from the adjacent parking garage to the front door. There's no wifi, but there is hard-wired internet access. I couldn't get it to work, though. That may have been my issue, but wifi would be nice, to be sure. The hotel didn't charge my credit card until two days after departure and left the hold on the card until I called them about it three days after departure. The breakfast area is somewhat cramped and the choices are limited. Food quality was fair, but acceptable. Better food quality and larger selection for the rate charged would have been appreciated. Overall a decent enough experience. I'm on the fence as to whether or not I would return or recommend the property. I will admit to being partial to boutique hotels.", "Date": "July 31, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Kansas City, MO", "Title": "“Cannot be beat!”", "Author": "KrAshton", "ReviewID": "UR35936816", "Content": "Husband & I traveled to Chicago with another couple for a quick get-a-way. I found the Comfort Inn & Suites Downtown on lastminutetravel.com for $100/night. We couldn't have been happier with this hotel. We lived in Chicago for a few years, 10 years ago, so we know how important public transportation is in town. We were just steps from the red line and the 22 and 36 buses, as well as a 24 hour Jewel/Osco. We were there for 3 nights, ate and drank all over town & didn't step foot in a single taxi. We each spend $12 on a 3 day CTA pass. The hotel was super clean and very quite. It's true there are few rooms with views as it is sandwiched between two larger buildings. Personally, we don't go to chicago for the view. Staff was very friendly, lobby was clean and safe and coffee available 24 hours. We requested feather pillows and 5 were waiting for us upon our arrival. Yes, the rooms are small but provided everything we required. We hit up Chicago every summer and I look forward to staying at the Comfort Inn & Suites again.", "Date": "July 27, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "2", "Location": "4", "Rooms": "2"}, "AuthorLocation": "Seattle, WA", "Title": "“\"Motel 6\" in the city!”", "Author": "PikePlaceTraveler", "ReviewID": "UR34879702", "Content": "Mark be down as someone who was less than impressed with this positively-reviewed Comfort Inn. It is a semi-renovated hotel in the North Bridge area of Chicago. It's best quality is location - very close to the Magnificent Mile, and within walking distance of all the best sites in Chicago. But the downside.... Except for the handful of rooms facing the street, the rooms are like COFFINS. The hotel is sandwiched between two other buildings, and so most of the rooms face onto a lightwell. No matter what floor you're on, you feel buried. The room was totally no frills, in the same way that Motel 6 rooms are no frills. The room was clean, in the same way that Motel 6 rooms are (usually) clean. The in-room safe? It didn't work. Overall, less than impressed. If you're visiting Chicago, do yourself a favor and find a hotel that is situated on a corner of a block, so that you can get a room with windows and light and a view. I recommend the Comfort Inn only for the goth set.", "Date": "July 15, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Madison", "Title": "“Wonderful hotel in a great location”", "Author": "karigraf8", "ReviewID": "UR33653939", "Content": "My husband and I stayed at this hotel recently while visiting friends. I was pleasantly surprised by the front desk person who checked us in promptly and was very courteous. She also had helpful tips on where to shop and dine without spending a fortune, while experiencing places that were less \"touristy.\" Our room was clean and air conditioned when we arrived and the room was larger than we expected. Overall, our stay here was a great value, and would recommend this hotel for anyone who is staying in the downtown area.", "Date": "July 1, 2009"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Location": "5", "Rooms": "1"}, "AuthorLocation": "madison, wi", "Title": "“Very bad Customer Service...”", "Author": "mmdhar", "ReviewID": "UR33236924", "Content": "Front desk people are not friendly at all... as if they are trained to hate the customers. I found hair in my breakfast everyday... They have a fitness center...but, I wouldn't call it fitness center... They have atreadmill.. That's all...", "Date": "June 26, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Location": "4", "Rooms": "4"}, "AuthorLocation": "australia", "Title": "“a gem in a big city”", "Author": "paulvAustralia", "ReviewID": "UR31171406", "Content": "we selected this hotel from the internet,and it turned out to be fantastic,we had just spend the last two days on amtrak,travelling from utah.The location was great,fine restaurants and shops nearby and the city centre was just a couple of blocks,easily done by walking.The continental breakfast is free and you are spoiled with the choices available.The staff were tops they helped us and were always pleasant.The best thing of all was the cost,even though we booked over the internet,the rate was somewhat cheaper,but never the less,we would stay at this place again,whenever we come back this way.WE used this hotel as the yardstick to compare others on our adventure,sadly not many came close to it.", "Date": "May 30, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Barcelona, Spain", "Title": "“Well located, clean, excellent service and unexpensive!!!”", "Author": "PauBCN", "ReviewID": "UR27762663", "Content": "During my last visit I spent 5 days in this hotel. My room was simple and perhaps small, but it was more than I needed after walking Michigan and State Streets up and dawn all day long! The bathroom was very clean and it had everything a 4-5 star hotel would offer. My room was close to the ice machine and was a little noise when someone used it. Free Breakfast and Internet service were included in the price and I really appreciated that.", "Date": "April 10, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "dublin", "Title": "“location location location”", "Author": "langericious", "ReviewID": "UR26768052", "Content": "despite previous reviews about small rooms we found ours to be more than adequate 1501 on the top floor spotless to a t fine continental breakfast just 1 block off the magnificent mile easy walking distance from all the attractions for irish travellers fine food and drink at the kerryman bar just turn left outside the hotel and walk up to the rainforest cafe then turn right 2 blocks and there it is .the most spectacular scene is from the signature lounge in the john hancock building after dark u pay a few extra dollars on the drinks but the view is priceless and its higher than the observatory without an entrance fee and for the shopping macys and filenes basement down on state street are more comprehensive than those at the watertower end of the magnificent mile many great things to see and do in this lovely city has everything ny has only cleaner and quieter", "Date": "March 24, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "4", "Location": "5", "Rooms": "2"}, "AuthorLocation": "Everywhere", "Title": "“Spent a month here”", "Author": "skurny", "ReviewID": "UR25651984", "Content": "I actually was a long-term guest of this hotel because of a large project at work. I enjoyed the stay for the most part...the staff was friendly and helpful but my big issue is the rooms. I've stayed here on four or five seperate occasions and I've had one decent room. Some of the rooms are tiny! And by tiny I mean 10 feet by 15 feet max. I usually get put on the upper floors (15-17) and I'm not sure if that makes a difference or not but there's hardly room to move around. If you were only staying one night and were a solo traveler, it'd probably be fine. However, I'm usually there for at least three or four days straight. It's is a quiet hotel, which downtown is nice. However, if you open the window, you're immediately reminded that you're in downtown Chicago. That doesn't really bother me (I lived in New York for five years, Chicago for two) but keep in mind there is a fire station a few blocks away...and they're busy. Overall, I'd recommend the hotel but not for a long-term stay. Parking is $25 per night, which is pretty standard downtown, but beware.", "Date": "March 5, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Cairo", "Title": "“Excellent group sales & services”", "Author": "JAC-EGYPT", "ReviewID": "UR24229452", "Content": "Our group of 20 PAX were accommodated at the Comfort Inn Hotel in Chicago for a week. First of all, the group sales manager Marc Condie was extremely helpful and effective in getting quotation and finalizing the reservation. He proposed upgrade of 4 normal rooms to 4 suits. When the group has arrived to the property, they were settled very fast and efficient. Our stay was great. We would be happy to deal with this Hotel as a corporate client in future.", "Date": "February 5, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "London, UK", "Title": "“Great Breakfast and fab location”", "Author": "vikkismile", "ReviewID": "UR24056042", "Content": "I booked through lastminutetravel.com and this hotel came up as a 'secret location' option (where you're hotel isn't revealed until you are sent booking confirmation). The hotel was in a fantastic location, just around the corner from the subway and there is parking available right next to the hotel ($25 per night). The breakfast offered a lot of choice and in a buffet style whereby I could eat as much as I wanted to fill me up for a whole day exploring the city. The door staff are extremely friendly and helpful in answering questions about the city. I stayed two nights and towels and beds were made each morning after breakfast. The hotel rooms have internet available at no extra cost and although they are quite small there is a lot of storage space and an iron and ironing board in the room. I stayed on the 11th floor and had no problem with city noise and I couldn't hear noise from other rooms. I had a very pleasant stay and would absolutely stay at this hotel again.", "Date": "January 31, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Business service (e.g., internet access)": "5", "Check in / front desk": "4", "Overall": "4.0", "Value": "5", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Ontario", "Title": "“Good Place? Good Value? Yes!”", "Author": "localguy101", "ReviewID": "UR23144175", "Content": "I found the place to be a good choice. It is a great location - near the fancy shopping and transit and buses. The hotel is clean and I found the staff to be friendly. If you are coming to Chicago to see Chicago this is a great place to stay. Take the money you save and enjoy it on a nice meal or two.", "Date": "December 31, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Business service (e.g., internet access)": "4", "Check in / front desk": "4", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Sydney", "Title": "“Great location and good value for money”", "Author": "facilit8or", "ReviewID": "UR22186815", "Content": "I spent 3 days visiting Chicago on a side trip to a business meeting in another state. As I was traveling solo, I was interested in finding safe, well located accommodation within walking distance of the city highlights. Though the room was small (which I expected) it was well laid out with everything that I needed - including a desk, free internet access (cable), a well appointed bathroom, comfortable bed and adjustable heating. The hotel has no restaurant but is close to a supermarket and restaurants. A casual breakfast buffet is included in the rate and all day coffee and tea are available from the same mezzanine area. The staff were friendly throughout my visit and very helpful on my day of departure - arranging for a cab to arrive at exactly the time I needed it. The only suggestion I would make is that the inclusion of a small fridge would have enhanced an enjoyable stay.", "Date": "November 25, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Long Beach, CA", "Title": "“Perfect Location, Great Hospitality”", "Author": "Pwrof3", "ReviewID": "UR21954399", "Content": "When I booked the hotel, I wasn't expecting too much. I figured I'd have to take the subway everywhere to get around town. When I arrived, my expecttions were blown out of the water. This hotel has a supermarket on one corner, the Weber Grill Restaurant on another, ESPN Zone on the next block, Pizzeria Uno on the other corner, a movie theater one block away, and the Rainforest Cafe and Rock n Roll McDonald's one block away. There is also a Subway across the street for a quick bite to eat. Magnificent Mile is about 5 minutes down the street, Navy Pier took me about 25 minutes to walk. The Red LIne Subway that takes you straight down to the Loop is less than a block away. The location is amazing! The Hotel Staff were all very friendly. When my cab pulled up, the bell staff were immediately picking up my suitcase and putting it in the lobby. The front desk staff were very friendly and informative. They even went online to print my boarding pass on the day of my flight! The front desk staff even held my suitcase all day long after I had checked out, with no hassle. The maid staff cleaned the room very well every day. The room itself was very small, but expected for a 1920's hotel. The room, overall, was very modern and everything was very clean and functional. The view from the window was nothing but a brick wall, which was kind of lame, but not a trip killer. As such, the sunlight never came in to the room, so I always had to have a desk light on. This is a great hotel for the location, price, and staff.", "Date": "November 17, 2008"}, {"Ratings": {"Service": "1", "Cleanliness": "2", "Business service (e.g., internet access)": "4", "Check in / front desk": "5", "Overall": "2.0", "Value": "3", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Milwaukee", "Title": "“Great location, not so great service”", "Author": "Glitteranddust", "ReviewID": "UR21509417", "Content": "The hotel is very conveniently located-you can basically walk to the Magnificent mile in 2 minutes. It is also surrounded by great bars and trendy restaurants. The room is half the size of a regular hotel room but I think that was the right size for Chicago downtown and the price. The hotel needs some maintenance, especially the elevator (was kind of dirty look). I was fairly disappointed with the service-I called at 11 am in advance asking them whether I could have a 2 hour late check out (meaning check out at 2 pm paying 20 USD extra) and they said yes. But then every 15 minutes there was some maid coming or a call reminding me that I should check out. In addition, after I finally could not take it and decided to check out at 1 pm and asked whether I could check my bags, they said yes and then asked me to wait and I waited for 10 minutes. I decided to give up and the receptionist saw me leave and turned her eyes away.", "Date": "November 3, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "3", "Check in / front desk": "4", "Overall": "4.0", "Value": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Hollywood, FL", "Title": "“Good hotel, great location”", "Author": "jpintransit", "ReviewID": "UR21045627", "Content": "I enjoyed staying in this hotel. The location could not be beat. Just about everything was walking distance with plenty of restaurants and shopping along the way. Each corner I turned, I saw something else to do or see. I was only there 3 days but it felt like I got good use of my time because of where the hotel was located. However, if you are traveling to Chicago for a little R&R, this hotel may not be for you. It is located on a busy street and you defintely hear the sounds of the city, not to mention your neighbors. Also, the room is a bit small so a traveling couple or family may feel a little cramped and I did hear someone complain about a lack of cell phone service in their room. But if the room is just for sleeping, showering, and changing, then it is perfect. Oh and the continental breakfast was decent, you could even make your own waffles. All in all, I would highly recommend this hotel and will stay there again when I go back to Chicago.", "Date": "October 20, 2008"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Business service (e.g., internet access)": "1", "Check in / front desk": "3", "Overall": "3.0", "Value": "2", "Rooms": "2", "Location": "5"}, "AuthorLocation": "Tokyo, Japan", "Title": "“You can access to many shopping pionts by walk.”", "Author": "Ken_Boon_Yam", "ReviewID": "UR20806975", "Content": "My room charge was US$230 before tax per night. This is my record of the most expensive night in Comfort group ever stayed ($_$)... As somebody mentinoed below, the room is small, but you may find bigger room with just additional small expense. I feel this point when checking floor plan , not confirmed yet. Even it is small room, it is still better than tourists hotel in Hong Kong. I drove to Chicago , and it is very convenient of car park key which hotel provided me with US$25/night. Michigan avenue is famouse shopping , business street as you know. We can walk and enjoy this street. You may not need car while you're around city center for your visiting. Fleming's steak house is just second next buidling from this hotel. We took dinner here to celebrate our marriage day with good cooking beef and good taste of wine. Ah, Chicago!", "Date": "October 11, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Business service (e.g., internet access)": "3", "Check in / front desk": "4", "Overall": "4.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "San Francisco", "Title": "“Pleasantly surprised”", "Author": "cas0325", "ReviewID": "UR17208827", "Content": "I was expecting a typical downtown Chicago experience for $188 a night but what I got was so much more. The hotel is ideally located near all the theater, shopping and restaurants Chicago has to offer. The staff is helpful, the complimentary breakfast is more than adequate including make-your-own waffles and the sheets, pillows and towels and all high quality and comfy. Ask for room 1209 if you want tons of room and complete silence and privacy.", "Date": "June 25, 2008"}, {"Ratings": {"Cleanliness": "3", "Business service (e.g., internet access)": "3", "Check in / front desk": "1", "Overall": "1.0", "Value": "1", "Rooms": "1", "Location": "2"}, "AuthorLocation": "maine", "Title": "“Very poor Chicago hotel”", "Author": "travelpro74", "ReviewID": "UR17157481", "Content": "I advise buyer beware when considering this hotel. The rooms are very small, poorly furnished, and without adequate lighting. Most rooms have no natural light. Security is not adequate and do not meet minimal standards. I love Chicago, and have stayed at much nicer 3 star hotels for the same price. Chatting with others in the elevator only confirmed this is a general impression. I spent very little time in the hotel, and will never stay there again.", "Date": "June 23, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Check in / front desk": "4", "Overall": "5.0", "Value": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Manchester, United Kingdom", "Title": "“Great hotel - great location”", "Author": "StokePotter", "ReviewID": "UR16255836", "Content": "My husband and I had a week in Chicago at the end of April. We stayed at the Comfort Inn. From the very start, the service we received from all the staff was very good. The reception staff were very helpful and professional. About half an hour after we got to the room, reception rang to check everything was OK (which it was). We had requested a quiet room and this was sorted out for us. It had a dual aspect (although there was only a car park and the inner part of the hotel to look at), so this meant it was quite dark. However, the room was very large and comfortable. The breakfast was of a good standard. However, within the breakfast room, there really needed to be more tables and chairs, rather than sofas. There is a conference room next to the breakfast room, which you can use if there isn't a conference taking place. When we used the conference room, we got to talk to other guests. Chicago is a lovely town - very walkable. The Chicagoans were very friendly. I can recommend a baseball game at either the White Sox or the Cubs. The weather was quite variable - one day it was 80Â°F/26Â°C, the next 55Â°F/12Â°C. I can also recommend the Historic Skyscraper Architectural Walking Tour and dinner on the 96th floor of the John Hancock Centre. I will definitely return to Chicago and will stay at the Comfort Inn again.", "Date": "May 20, 2008"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "oklahoma", "Title": "“VERY CLEAN”", "Author": "boomer07", "ReviewID": "UR15513589", "Content": "Very clean. The hotel staff was excellent. Excellent cont. breakfast. Location is perfect. Bus and subway stops at the corner. Great for walking to many locations. Several restaraunts very, very close. Michigan Ave, only 2 or 3 blocks. The only problem with this hotel, if you don't get a suite, the rooms are TINY. But they are the cleanest rooms this side of Las Vegas. I would definately stay here again.", "Date": "April 30, 2008"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "Milwaukee, WI", "Title": "“Great Little Hotel in Big City”", "Author": "ILoveLondon", "ReviewID": "UR15058537", "Content": "I stayed at this hotel for 2 nights this past weekend. It is really a nice hotel - some old world charm (building is from the 1920's), but recently refurbished. Doesn't feel like a chain at all. Decor and fixtures are all modern and in excellent condition. We had a suite (my sister, 14 year old nephew and myself), and it came with microwave, refrigerator, sink in the living room. Bathroom, shower, beds - all great. Front desk personnel couldn't be nicer and more helpful - they really seemed to take pride in their customer service. They helped with bus routes, restaurants, etc. Continental breakfast very nice - hard boiled eggs, waffles, yogurt, juice, bakery. My only complaint (and this is getting picky) is that there wasn't enough seating in the breakfast area - too many sofas and coffee tables that should be replaced with tables. Last but not least - excellent location. Walking distance either way up Michigan Ave to Water Tower, John Hancock or other direction to Millenium Park and Art Museum. Convenient to buses on both State Street or Michigan Ave. Next door to ESPN Zone (great for kids). Chicago Tip: Get a visitor bus pass. They have them in train station and I believe John Hancock center too. $5 for one day, $9 for 2. Chicago buses are very convenient and easy to use.", "Date": "April 15, 2008"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Business service (e.g., internet access)": "3", "Check in / front desk": "4", "Overall": "4.0", "Value": "4", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Missouri", "Title": "“Great Location, Great Price, Great Breakfast”", "Author": "MidMissouriTraveler", "ReviewID": "UR14776177", "Content": "I booked this hotel for a vacation in Chicago, mostly to shop and eat on the Magnificent Mile. It was great; and it was only two blocks from Magnificent Mile. Somehow we ended up with a suite without asking for it or paying anything extra (probably because we got in so late). Parking was cheap ($25 compared to $46 at other hotels on the Mile), maybe because there was no direct parking garage access to the hotel and you had to walk out of the garage to get to the hotel. The breakfast was great and had everything you could think of. The rooms were very clean and mostly everything looked newish. The only reason I didn't give this place a five was that the comforters have not been updated to the duvet style like most other hotels. Also, because I was a Choice Privileges member (maybe Gold) I got check-out extended until 2:00.", "Date": "April 3, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Chicago", "Title": "“Suite LIfe”", "Author": "Doobies25", "ReviewID": "UR13834038", "Content": "I must say I was very impressed with the decor and the rooms. Definately not your normal comfort Inn & Suites that you see off to the road on the interstate. The bathrooms are very clean and has an elegant feeling to the design. The view of the North End of the chicago skyline is wonderful and everything is in walking distance as far as resturants and bars. I definately loved the bed that had 8 pillows that were not too hard or too soft. I would definately stay there again!", "Date": "February 25, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Check in / front desk": "4", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Brownsburg, IN", "Title": "“GREAT location, GREAT hotel!”", "Author": "kristirailey", "ReviewID": "UR13787180", "Content": "We stayed at this hotel for 3 nights in a suite. The room was very clean and well decorated. The hotel's location is an easy walking distance to ALL of the shops on Michigan Avenue. The hotel staff was helpful, however we didn't really need them too much. Go got a great rate through CRShotels.com. We would definitely stay there again!", "Date": "February 23, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "4.0", "Value": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Stockholm, Sweden", "Title": "“Nice 3 star Hotel”", "Author": "MathiasStockholm", "ReviewID": "UR12697333", "Content": "Me and my wife stayed at this hotel on our last days of our honeymoon in september 2007. Check in went smoothly. We had a nice standard room with a large bathroom. We paid 189 USD/night , which I thought was a great deal for this hotel. A complimentary breakfast buffet is served every morning. We loved it! When you stay here you will be in a fantastic location in downtown Chicago North side. Close to michgan ave and really close to clark street were a lot of nice blues clubs are situated. Right across from our hotel at State street you will find a place called Pops For Champagne. It was a really nice cozy place with Champagne bar and live jazz. Do check it out!! We love Chicago and will return again and again.. We will choose this hotel for our next visit.", "Date": "January 16, 2008"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "Omaha NE", "Title": "“Excellent Location and Experience”", "Author": "TravelingwithTandM", "ReviewID": "UR12271475", "Content": "Clean, quiet, comfortable. Great staff. Only hotel I have booked on line that responded personally to my request for quiet room. Could not be happier with location. Walking distance to everything north of the river, and just 1 1/2 blocks from Red Line. Recommend to anyone who wants to stay near the Miracle Mile, loves pizza, and is looking for a \"personal' sized hotel.", "Date": "January 2, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Business service (e.g., internet access)": "4", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "singapore", "Title": "“Fantastic Location; Great Breakfast”", "Author": "Muppetbaby", "ReviewID": "UR11709643", "Content": "I was in town for a conference and chose this hotel primarily because of easy access to the metro. It did not disappoint me at all and I am very pleased that my experience with the hotel is in line with all the good stuff I read about it from the web. First, the breakfast offered had a reasonable variety of breads, cereals and juices. LIke other reviewers, I too was bowled over by the hot waffles. The fact that all this was free really wowed me. Second, the hotel staff was SO helpful and polite when giving directions and assisting with requests. The metro was just 1.5 blocks away but I was hopeless with directions and one of the staff was kind enough to walk me there himself. In addition, they put me in a smoking floor the first night and I asked for a change of rooms. They gave me one the next day and helped me to move everything over. Later, I realized that I left my travel adaptor in the first room and they helped me to bring it back. I give a thumbs up to the service level in this hotel. Third, the location was just fantastic. I could get to everywhere very quickly either by metro or on foot. There was food nearby and a supermarket to meet my grocery needs. Finally, the condition of the rooms was good, everything was clean and the air smelt ok. All in all, I would definitely stay here again when I come to Chicago.", "Date": "December 20, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "London", "Title": "“Lovely comfortable place to stay”", "Author": "meadkelly", "ReviewID": "UR10408925", "Content": "Lovely hotel, complimentary tea and coffee is served 24hours a day in a really trendy lounge. Very clean, lovely beds, plenty of room. The bubble bath and sauna are great after a day of shopping. Staff were very helpful. Not much of a view from the bedroom, but we didnt care about that.", "Date": "October 28, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "4.0", "Value": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Cheshire, UK", "Title": "“Does exactly what it says on the tin!”", "Author": "Bimbohead", "ReviewID": "UR10063930", "Content": "We have just returned from the 2007 Chicago Marathon and stayed at the Comfort Inn in Downtown Chicago. The hotel is really well situated for Michigan Ave, where all the \"nice\" shops are and (crucially) if you are coming from O'Hare airport, as we were, it has a train station situated right around the corner. For $2 you can travel 18 miles into the city centre! What more do you want? Even more satisfying is the fact that the track runs parallel for a good few miles with the Kennedy Expressway, which seems almost permanently gridlocked, so you can congratulate yourself on saving time AND money getting the train! We found the hotel more than met our needs and expectations. I simply cannot understand why people are griping about it. Our room number was 1204 and I will admit it was a little dark, as it faced an inner courtyard with little natural light, but being on the 12th floor and not facing the main street has distinct advantages when it comes to blocking out traffic noise, so we were more than happy. We had a very comfy bed, with loads of pillows, great air-conditioning and a really cool bathroom, with a heated light on a timer. The shower worked really well, we had complimentary newspapers and the coffee making facilities were easy to use (although biscuits might have been nice)! The biggest benefit to us as a couple was free wi-fi, which enabled us to hold video conversations with our kids in England over the webcam. Saved a fortune in mobile phone charges! Breakfast was great. Lots of choice and plenty of it. The only downside for me was that the breakfast area was extremely small and you struggled to get a table, as the hotel was full of marathon runners all wanting to eat at the same time! The staff had no problem with you removing food to your room if you chose to do so. They even arranged for the hours to be altered on marathon day to cater for those who had to eat by 6am. I hope the staff got a bonus for being up so early! The staff were friendly and professional. No complaints whatsoever about them. I do wonder if people choosing this hotel and rating it unfavourably are expecting the Cannes Carlton. This is not a particularly \"high end\" hotel, but it is worth the money and does exactly what it says it will. You will have a comfortable night in the Comfort Inn! Whilst the Chicago Hilton might be grander (and it was, because we attended a party there) the food was cold, poor value for money and the staff much less friendly. Give me the Comfort Inn anyday!", "Date": "October 10, 2007"}, {"Ratings": {"Cleanliness": "3", "Check in / front desk": "3", "Overall": "1.0", "Location": "4", "Value": "1"}, "AuthorLocation": "Barcelona, Spain", "Title": "“Very basic and not what I expected”", "Author": "BraddyBarcelona", "ReviewID": "UR10035472", "Content": "This hotel is well situted for downtown Chicago, but is really very basic, and not what I expected. The rooms (allocated to me and my group) were very small, dark, with little daylight, backing on to a multistory car park. There were no hotel facilities at all! Only vending machines. No bar, cafeteria, restaurante, business center, nothing. A disappointing continential breakfast was served on the first floor in a small area with only 7 or 8 tables, and a funny kind of sofa arrangement. There was not enough space for all the guests wanting to take breakfast to sit down, and many had to stand up. The plates, glasses and cutlery were all plastic.The second day we all went out for breakfast. I guess this place would be okay for low budget travellers with low expectations, but it is by no means a mid-class establishment.", "Date": "October 3, 2007"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Sauk Rapids, Minnesota", "Title": "“great location”", "Author": "Mid-MN-Tourist", "ReviewID": "UR8612034", "Content": "5 of us stayed at the comfort Inn and Suites over Laor Day Weekend and thought it was a great location, continental breakfast was good. The hotel is clean and everyone is very polite. Thanks to trip advisor forums for the comments, it helped in our decision. We would stay here again the next time we are in Chicago. Lots of bar's. dining and attractions within walking distance of hotel. Thanks Chicago fro a great weekend !!!!!!", "Date": "September 3, 2007"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "4", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Brooklyn, NY", "Title": "“Comfortable and very convenient”", "Author": "Dancetraveller", "ReviewID": "UR8526116", "Content": "A step above other outposts of this extensive chain, the Comfort Inn Downtown boasts an excellent location just minutes from the Magnificent Mile and 20 minutes by foot from Millenium Park. It is modest, but the rooms are surprisingly comfortable, a step above your average strip mall Comfort Inn. There's marble in the bathrooms, and some rooms are set up like a suite. Ours, 1202, was divided into a living area, with mini-fridge, microwave, kitchen sink, large desk and television, and a sleeping area, with its own TV and AC unit. We loved this set up, and it added a level of luxury we weren't expecting. But be forewarned: if you're not in a suite, the rooms can be quite small--still with some premium fixings--but small, and many of the rooms face an inner courtyard with only a large shaft of light. Considering the noise of the city, this might be an advantage. And given all there is to do in Chicago, you might not need a lot of space. But to guarantee the space you need, look into the possibility of a suite. Service was accommodating and polite; housekeeping was wonderfully quiet and respectful. There is no bar or restaurant in the hotel (Japanese place next door is good), so there's no scene. There's a Whole Foods Market on Huron, three blocks away, which is great for stocking that mini-fridge with healthy snacks. A solid, comfortable establishment in the midst of a classy urban environment.", "Date": "August 29, 2007"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "St. Louis, MO", "Title": "“Very pleased with Comfort Inn & Suites on E. Ohio in Chicago, IL”", "Author": "sfowler", "ReviewID": "UR8497129", "Content": "Recently stayed at the Comfort Inn & Suites in the North River Chicago area on E. Ohio. The room was very clean, great towels and bedding and location was close enough to attractions (Navy Pier)) and transportation systems. Self-parking was available with in/out priviledges (which is a premium in downtown Chicago) and not too steep, and the in-house continental breakfast was good. Would definitely stay there again as it was very reasonable and suited our needs -- just don't bring a car if you can help it. Very easy to get around and save parking fees and aggravation.", "Date": "August 24, 2007"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "Santa Rosa, CA", "Title": "“Great Stay!”", "Author": "SonomaCo_Girl", "ReviewID": "UR8370191", "Content": "My husband and I recently spent 3 nights at the Comfort Inn and Suites in downtown Chicago and were very pleased with the experience. I booked it thru the website of the airline I used and got a great deal. Our room was on the 7th floor and faced the street, but was very quiet. We had a nice view of the city. The room was a little small, but very clean and the bathroom was especially nice. For a lower cost hotel, I thought the free breakfast buffet was wonderful - so much to choose from including hot waffles! We parked in the lot adjacent to the hotel ($25.00/night) but never needed to take the car out - we were convenient to everything. Navy Pier was an easy walk. Two years ago, we stayed at the Best Western River North, Chicago, and had planned to stay there again. Their prices had gone up, so I decided to try something else and I am glad I did. River North was fine and had free parking, but overall, I like the Comfort Inn better. The lobby was much nicer and they had someone there to help us book a city tour. If you prefer to spend more of your money on restaurants and attractions, but still want a comfortable night's sleep, I definitely recommend this hotel.", "Date": "August 7, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "2", "Check in / front desk": "5", "Overall": "4.0", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Frederick, Maryland", "Title": "“Good stay for visit to Chicago”", "Author": "sarah9540", "ReviewID": "UR8255597", "Content": "We stayed here for a 5 day 4 night trip to Chicago and if we come back to the city, we'll definitely stay here again. This hotel is within walking distance to many main attractions---the magnificent mile, Navy Pier, many very good restaurants (Pizzeria Uno is basically next door), etc. The staff is very friendly and helpful. The room was small, as described in other reviews, however we used it just to sleep and shower so it was perfect for us. If you want a place with a balcony and lots of sitting area, this is not the hotel for you. The beds were not bad----nothing exceptional like pillow tops or anything, but were good enough for a restful nights sleep. I was particularly happy about the hot water for the shower---plenty of it and definitely hot. They offer a continental breakfast which was more than adequate----especially if you plan on eating all the other foods Chicago has to offer throughout the day. There are bagels, cereal, fruit (a little lacking there), Belgian waffles, pastries and hard boiled eggs. Only downfall is breakfast is over at 9am during the week. Weekends is at 11am. Check in was at 3pm and very easy. Check out is at noon, but for $5 we could stay til 2pm. Our only complaint overall was the Internet service. There was supposed to be service in our room, however there wasn't. I'm assuming it was just a freak thing----just bad timing for us that the rooms were unable to get access. Service was available if you took your laptop to the 2nd floor (lounge area) or 1st floor (lobby). It was a slight inconvenience for us---however we were only using the Internet to search for a few local things and our email. We weren't here on business so it wasn't imperative for us to have access. If you definitely need service in your room for work or whatever, you may want to confirm there really is access always and make sure the outage wasn't just during the days we were here. On a side note, good places to eat: Giordanos for deep dish pizza, Pizano's (Italian---portions are huge--alfredo really good), Quartinos, Jakes (bar nearby---good bar food), Ditka's restaurant next to the Tremont Hotel.", "Date": "July 29, 2007"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Business service (e.g., internet access)": "4", "Check in / front desk": "4", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "North Carolina", "Title": "“Great Place”", "Author": "busyinWilmington", "ReviewID": "UR8240065", "Content": "Hotel was great, walked all over Chicago from our hotel. Very close to \"el\", restaurants and Michigan Ave. Walking distance to downtown business area and Navy Pier. Very clean. Room was a little small but more than adequate for a couple (you don't go to Chicago to stay in the room). Breakfast was adequate. We had a good view (Rm 801) but could see how the other side of hotel might not have such a great view (lots of buildings in way). Would stay again--got a good price for Chicago. Tip: Eat on the 96th floor of the Handcock Bldg.--make reservations for dinner or lunch (if you want a seat by window). Great view, relaxing, don't have to pay to go up to the observatory and can spend as much time as you want enjoying view and food.", "Date": "July 26, 2007"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "Michigan", "Title": "“Great Stay”", "Author": "sherikjrj", "ReviewID": "UR8212744", "Content": "Great location with easy access to all downtown attractions. Rooms are very clean and comfortable. Have stayed here several times and never disappointed. Staff always wonderful and willing to answer quesitons on how to get around town and where various attractions are located. Breakfast is always well stocked and delicious with a staff member on hand to keep things in order. This hotel is a MUST STAY!", "Date": "July 21, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "3.0", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Garden City, New York", "Title": "“Good location. A Little Expensive. Otherwise Just OK.”", "Author": "pixfield", "ReviewID": "UR8207188", "Content": "Good Points: Great location near Red Line metro stop Very courteous staff Close by to Michigan Avenue shopping Close to many good eating spots For those of you who like Pizzeria Uno, it is just steps away Clean, comfortable and quiet Not So Good Points: Price-at $270 per night for a suite I did not get a good value. Breakfast-pedestrian selection of sweet rolls, tarts, etc.", "Date": "July 20, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "4", "Overall": "5.0", "Value": "3", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Collegeville, Pennsylvania", "Title": "“Great hotel!”", "Author": "francocaro", "ReviewID": "UR8041980", "Content": "My boyfriend and I stayed at the Comfort Inn & Suites for two nights on June 29 - 30, 2007. The location of this hotel is excellent and we were thrilled to be able to walk everywhere over the weekend. If you are going to be there within the next 8 days (week of July 4, 2007), be sure to check out the Taste of Chicago! (www.tasteofchicago.us) It was great fun! The lake and Michigan Avenue are only a few blocks to the right when you exit the hotel. The hotel itself is very nice. Our room was very small, but we didn't mind since we didn't spend a lot of time in it. The bathroom was very clean, as was the entire room. We had only one small window, which looked onto a nearby wall, but again, we just wanted a place to sleep. The breakfast buffet was fantastic for me because there was a waffle maker! My boyfriend was a little disappointed. They offered coffee, juices, several cereals, hard-boiled eggs, pastries, and bagels. And the waffle maker of course, yum! The eating area is a little awkward since it was pretty busy both mornings and set up like a living room with a few tables nearby, but overall not bad. Just a tip, there are only two small elevators and they're pretty slow. If you are checking out near checkout time, are on a lower floor, and have lots of luggage, it might take a while to get an elevator that can fit you in. I saw several people waiting and not able to get in because of this. We flew into O'Hare (on the top 5 list of worst airports nationwide - lots of delays) and took the train/blue line to the Clark stop. It's very easy and only costs $2 per person. If you don't want to walk to the hotel from there, the cab ride is only about $5-10. I hope that helps! I highly recommend this hotel!", "Date": "July 2, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Argyle, Texas", "Title": "“Excellent Stay”", "Author": "ILoveTexas", "ReviewID": "UR7976255", "Content": "The staff at this hotel seemed to go out of their way to be courteous and helpful. The location is excellent, and our room was large, clean, and comfortable. We were really impressed and would definitely stay here again.", "Date": "June 24, 2007"}, {"Ratings": {"Cleanliness": "5", "Business service (e.g., internet access)": "4", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Arkansas", "Title": "“Great Hotel”", "Author": "Richbutnot", "ReviewID": "UR7956859", "Content": "We stayed here three nights with Choice Privilege Points which saved us close to $1100. The location is great, just a short walk to the bus stop on Michigan Avenue or the train on State Street. The folks at the front desk were very helpful and friendly. Continental breakfast was slightly above average. Hot Tub came in handy after walking museums all day. Room was very quiet with a fridge and microwave. Others have said the rooms are small, but ours was quite large. Plenty of room for two parents, two teenagers and an air mattress for one of the kids to sleep on. The only thing we didn't like was the double beds, but we couldn't find a hotel in the city with queen beds anyway. Would definitely stay here again.", "Date": "June 21, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Tennessee", "Title": "“fantastic location!”", "Author": "emalemaloo", "ReviewID": "UR7858851", "Content": "Our trip was a \"family\" trip, but all adults. Myself (34) and my parents (66 and 67). We had never done Chicago before, so we just picked a random hotel with a good reputation and went with it! What a lucky random pick! The hotel is about 2 blocks from all the magnificent shopping on the Magnificent Mile, has a ton of restaurants within walking distance, and has the nicest staff I've ever had the fortune to meet! We arrived at O'Hare and took a cab to the property, which ran about $42. They offer shuttle service through continental, but it was only going to save us about $6, so we just did the cab thing. When we arrived I was very ill (motion sickness from a cab ride, a total first for me), and as soon as my dad mentioned it, the bellman actually offered to run to the pharmacy for me if I needed it, and the front desk clerk offered to get me a Sprite from the machine downstairs! All the staff were like that, super friendly and willing to go to any lengths to keep you happy! The rooms are sort of suites. They have a single bathroom in the middle, and to the left is the bedroom (2 double beds, a dresser and a TV) and to the right is a small sitting area with a wet bar, closet, TV, desk and sleeper sofa. My parents took the beds, and I slept on the sleeper sofa. Quite comfy, surprisingly! I closed the bed up every morning, and when I came back at night, the maid had pulled the bed out, changed and remade the bed. That takes some dedication! The room was always spotless when we returned. The continental breakfast is offered daily 'til 10 thru the week and 'til 11 on weekends. Had your standard pastries, muffins, fruit, yogurt, etc. Also had a \"make your own\" belgian waffle station and a chaffing dish full of boiled eggs. Several kinds of fruit juice, milk, water, hot tea, coffee. Small sitting area, but we were always able to have a table. Within walking distance are: Big Bowl (Thai, great homemade ginger ale), California Kitchens Pizza, Weber Grill restaurant, PF Chang. There is a grocery store just around the corner (Jewel Osco), Bloomingdales Home and Design within Reach are across the street. The Grand Train Station is just behind the hotel. The #65 bus comes to that station as well. The hotel is a restored 1920's building and the lobby and mezzanine are beautiful. All in all, the PERFECT place to stay in downtown.", "Date": "June 16, 2007"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Business service (e.g., internet access)": "3", "Check in / front desk": "4", "Overall": "5.0", "Value": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Minneapolis, Minnesota", "Title": "“Great Value for the Price”", "Author": "mrbula", "ReviewID": "UR7568925", "Content": "My wife and I stayed at the Comfort Inn for a few days in April 2007 and were very impressed with it. While it can't be understated how small our room was--I'd estimate it came in under 250 square feet--it was well appointed, comfortable and very clean. The staff was friendly, and the continental breakfast was excellent. The location was what really made the deal for us. The Comfort Inn is only a couple of blocks from the Mile, and the nearest Red Line stop is just around the corner. The price was very good as well: Our two-night weekend stay came in under $300, including parking. A tip about requesting rooms: There are only four street-facing rooms on each floor, so if you want any kind of a view, you may want to ask ahead. Two of those street-facing rooms (including the one we stayed in) are incredibly tiny. If you want space, you may have to sacrifice your view. (See the floor map photo I uploaded to get an idea as to the different room sizes.) We'd recommend the Comfort Inn, and would definitely stay there again.", "Date": "May 9, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "4.0", "Value": "5", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Chicago, Illinois", "Title": "“Decent mid-priced hotel”", "Author": "brickbark", "ReviewID": "UR7551600", "Content": "This is a good hotel if you decide you want a good location within walking distance to the magnificent mile and VERY close to the red line subway. The rooms are tiny...I mean REALLY tiny. Everything was very clean, though, and the staff was EXCELLENT, very friendly and concerned with making it a great stay. Appears to be recently renovated. Good workout facilities and large whirlpool in the basement. The free breakfast was a nice added touch too. Parking is somewhat of a pain (no valet and you have to walk around the block each time you want to enter the hotel), but you get unlimited in/out privelages. Overall I would recommend it.", "Date": "May 6, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "4", "Check in / front desk": "5", "Overall": "4.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Boston, Massachusetts", "Title": "“Nice stay for the money”", "Author": "bear628", "ReviewID": "UR7444887", "Content": "I was pleasantly surprised with my stay at the Comfort Inn & Suites. I was only there one night, but the front desk was SO friendly and helpful. They quickly checked me in and answered any questions I had. The room was very clean, though it was a little small. I was placed in a handicap accessible room so I was surprised there wasn't more room around the sides of the bed. The bathroom was very spacious, my only complaint was there was no medicine cabinet or place to put my toiletries. The sink had a big soap dish on one side of the faucet so very little room for even my toothpaste, let alone my other stuff on the other side. The room was extremely quiet and dark at night. The window didn't have a view (just 3 other walls of what appeared to be the rest of the building). The A/C unit was a little loud when it kicked on in the middle of the night. It woke me up scared half to death when it sounded like a jet taking off in my room. I got used to it, but it wasn't the best. I had trouble connecting to the internet (I got the required CAT-5 cable from the front desk) but I don't know if it was because I was using a Mac or what. I didn't feel like dealing with it because it was late and I was checking out in the morning, but I'm sure if I called the front desk, they would have helped me out. The continental breakfast in the morning was fantastic. Lots of options to choose from, cereal, bagels, pastries, fresh fruit, yogurt my personal favorite, belgian waffles, and more. Perfect way to start the morning. I wish I could have stayed longer to get more of my stay but I was only in town one day for business. The location of this hotel was really ideal. They are right next door to several great restaurants including Pizzeria Uno (the original, I think) and Pizzeria Due (the second one) as well as Weber Grill and ESPN Zone. It was really easy to get to from the airport in a cab (about $34, before tip, with no traffic). All in all, I thought it was a great hotel for a great price right in downtown Chicago. I would definitely stay here again.", "Date": "April 26, 2007"}, {"Ratings": {"Service": "2", "Cleanliness": "4", "Business service (e.g., internet access)": "2", "Check in / front desk": "4", "Overall": "3.0", "Value": "3", "Rooms": "2", "Location": "5"}, "AuthorLocation": "new york", "Title": "“staff were not helpful!”", "Author": "hollabrolics", "ReviewID": "UR7428259", "Content": "we stayed that this hotel for one night, it's clean and updated. but the staff did did not help us, when we got a smoking room. we had asked for a non-smoking room. all other rooms were taken. oh, and the parking is $25 a day that suck! it's in the heart of the city which is a plus! warning you now, the rooms are 10 by 14. small as all hell.", "Date": "April 24, 2007"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Business service (e.g., internet access)": "4", "Check in / front desk": "4", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "plymouth, mi", "Title": "“Really Good Stay”", "Author": "adavici", "ReviewID": "UR7189680", "Content": "Stayed here in early March 2007. The location is fantastic, 2 blocks from Michigan Ave. The hotel is clean and quiet. Not the most spacios, but not the tightest either. No moldy shower, no warn out carpet, clean breakfast area. Parking is convenient in the garage directly behind hotel and It's $25 which isn't too bad by Chicago standards. The breakfast bar is decent - standard continental with a waffle maker, cereal, breads, rolls, etc... The view from our room was terrible - looking into a small, closed in courtyard of nastyness. If you need a view, request a room looking outside! The only other complain I had was the coffe at the brekfast area. It was literally undrinkable swill. Really, really bad. But hey, if that's the biggest complaint then it's not too bad! Plus there's a starbuck's right across the street, and a million more around Chicago. We'll stay there again for sure.", "Date": "March 19, 2007"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "central Illinois", "Title": "“Clean, stylish....very nice!”", "Author": "kjsdunn", "ReviewID": "UR6832804", "Content": "Good value for the location! Front desk and staff are very friendly. Everything was scrupulously clean, and appears to have been recently remodeled. Our first room was extremely small, but they moved us to a larger room when asked. The breakfast area and selection was also very nice and scrupulously clean.", "Date": "February 23, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "U.S.A.", "Title": "“Great Hotel”", "Author": "V.T.45", "ReviewID": "UR6636375", "Content": "What a GREAT hotel! We have stayed here once a month since Sept. 2006 for family business a total of five times. The staff is helpful and friendly.The parking garage located next to the hotel is very convienent ,with in and out privleges.Tons of restaurants and shopping all within walking distance.Very clean rooms a bit small but fine for the amount of time we are in the room.Plan on eating breakfast,they have a nice selection of quick foods(bagels, cereal ,fresh fruit etc). Good price for the location.", "Date": "January 21, 2007"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Business service (e.g., internet access)": "3", "Check in / front desk": "4", "Overall": "4.0", "Value": "4", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Lansing Michigan", "Title": "“Great Location, Great Hotel”", "Author": "robber-MI", "ReviewID": "UR6515739", "Content": "Did a last minute trip to Chicago before Christmas and stayed at the Choice Inn Downtown on Ohio St. This hotel exceeded my expectations. We had a 2 dbl bed suite.. very large, with the LR part separate from the beds. Nice view looking out on Ohio St. Beds were comfortable. Breakfast had normal items, and everything was fresh. Check in was quick and efficient. I think of Choice Inn as a mid-level hotel.. In general it seemed like we were staying at a much nicer hotel. I was very pleased with my stay and would stay again.", "Date": "December 29, 2006"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "4", "Check in / front desk": "5", "Overall": "5.0", "Value": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "nashville, tn", "Title": "“Excellent hotel and staff”", "Author": "muffin98", "ReviewID": "UR5935566", "Content": "Very clean hotel in great location; with a wonderful breakfast. Thanks to Tim and staff for a wonderful stay; they were great! We would definitely plan to stay here again.", "Date": "October 10, 2006"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Minneapolis, MN", "Title": "“Great location, great hotel for the price”", "Author": "eak99", "ReviewID": "UR5905523", "Content": "This hotel has such a great location - close to El stop on red line, numerous restaurants within a block or two, major shopping nearby. The staff was friendly and helpful, room was clean and quiet - there was no view, but when we wanted to see Chicago, we just went outside and walked around. We had a room with 2 beds, which was very spacious, and the small fridge and microwave came in handy. Oh yeah, the breakfast buffet was a nice surprise too, didn't know they had that, so we saved even more by being able to have fruit/juice, coffee, toasted bagels, etc. rather than going out for breakfast, then we had a nice lunch later at one of the area restaurants. I have stayed at several other hotels in Chicago, and this is hands-down the best in terms of location and amenities for the price. Speaking of price, I checked all the hotel booking sites and finally made my reservation through the Comfort Inns website and got their \"internet rate\" which was the lowest of all options.", "Date": "October 3, 2006"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "South St. Paul, MN", "Title": "“Good Hotel, Great Location”", "Author": "SSP", "ReviewID": "UR5882743", "Content": "This hotel has an unbeatable location and reasonable prices. There were three of us in our room, and it was nice size. We had a microwave and small refrigerator. There was plenty of room to stow our clothing. The hotel is right of State Street and only two blocks from the Magnificent Mile. There are dozens of good restaurants close by, and the hotel has a very good complimentary breakfast including waffles, cereal, yogurt, hard boiled eggs, etc. I'd definitely go there again on another trip to Chicago.", "Date": "September 27, 2006"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "4", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Cleveland Area", "Title": "“Great Room, Great Location”", "Author": "NEOTraveler", "ReviewID": "UR5778173", "Content": "My husband and I stayed at this hotel from 8/17 through 8/19/06. The location of this hotel is great. Very close to downtown shopping, Navy Pier, Millenium Park. Our room was super clean and I expected it to be small as most downtown Chicago hotel rooms tend to be. Our room didn't have a view, just of a nasty-looking alley and the building next door. We got a great rate of $129/night directly from the hotel's website (click on \"internet specials\" on the rate type). Also, continental breakfast was included which was a great savings considering the restaurant prices downtown. The hotel staff was very helpful and even printed our Southwest Airlines boarding passes free of charge (we've been charged $5.00 each for these in Las Vegas). It was overall an excellent value and an excellent room.", "Date": "September 7, 2006"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Business service (e.g., internet access)": "4", "Check in / front desk": "4", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Grand Rapids, Michigan", "Title": "“Great stay, again!”", "Author": "llint77", "ReviewID": "UR5534144", "Content": "This was our second time staying at this Comfort Inn. We were so impressed the first time we had to stay there again with our friend from Ireland. The location is perfect and the rooms are nice, clean, and the perfect size. We will definately stay there on our next trip to Chicago and our Irish friend is recommending it to his friends who will be visiting Chicago soon.", "Date": "July 31, 2006"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Check in / front desk": "3", "Overall": "5.0", "Value": "3", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Minneapolis", "Title": "“\"Un-Chainlike\" Chain Hotel”", "Author": "OLindquist", "ReviewID": "UR5509784", "Content": "This was a very nice hotel - a great location with personality. I did not expect a Comfort Inn to be located so conveniently nor be as upscale is this one. It dispels any negative connotation of a \"chain\" -- rooms that felt anything but cookie-cutter, a wonderful continental breakfast, and very helpful staff. Sleeping rooms were very comfortable, surprisingly spacious and appointed with high-end finishes. Only negatives would views of the side and back walls of its neighbors and a small \"street presence\". I have stayed in other \"value\" hotels in Mangificent Mile and would never go back to the others, having stayed here.", "Date": "July 25, 2006"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Sacramento, California", "Title": "“hidden gem”", "Author": "casualtraveler2011", "ReviewID": "UR5446464", "Content": "This hotel was a great find in downtown Chicago, a block away from the Grand Ave. redline stop and two blocks from Michigan Ave. The rooms aren't huge but comfortable with your own switch for the air conditioner/heater. The bed was extremely comfortable and the decor was nice and not the least bit run down. The bathroom was decent size with great water pressure. This is a well taken care of hotel. They serve a good complimentary continental breakfast each morning consisting of cold cereals, bagels/english muffins, and assortment of sweetrolls and muffins, criossants, fruits, hard boiled eggs, instant oatmeals, a variety of juices, and yogurt. It was served on the 2nd floor in a opened foyer area. During the work week, a USA Today paper was delivered to the room every morning. Choice Hotels offers a guaranteed lowest rate through their website or else they willl match, plus 10% off a lower priced website. I found the same $200 room for a $121 at Last Minute Travel,. I put in my claim, and got the room for $108 a night. The only glitch was that the hotel itself did not know it when I checked in but I had my paperwork with me, they accepted it and we spent a great 5 nights with them at half the cost. WARNING: If you find a lower rate, you have to compare it to their standard rates--you can't put in for any discounts, like AAA. I would definitely stay here again. We were there six days and couldn't have had a more centrally located hotel.", "Date": "July 10, 2006"}, {"Ratings": {"Cleanliness": "4", "Overall": "4.0", "Value": "3", "Service": "3", "Rooms": "4"}, "AuthorLocation": "Kansas City", "Title": "“Nice hotel, great location”", "Author": "gregbkc", "ReviewID": "UR5413887", "Content": "When I travel to Chicago I normally stay at the Best Western Hawthorne Terrace in Lakeview. Since that wonderful hotel was sold out (no surprise) I decieded to try this hotel since I got a great rate considering there was a large convention in town that weekend. Cons - 1: The towels in my room were just plain horrible, comparing them to sandpaper would be an understatement. If I ever stay here again, I'll bring my own. 2: Can't think of anything else! Pros - 1: Location - Red Line only one block away and the hotel sits right in the midst of everything Chicago is all about. 2: The staff was very pleasant. Easy/Quick check in. 3: The room was fantastic. (room 1103). Not sure if I somehow got upgraded, but I was expecting a small room with a queen bed. Instead we got a two room suite (two beds in one room w/ TV and another sitting room with sofa, TV, microwave and mini fridge). Nice contemporary decor and very clean. I'd definately stay here again if i was looking for a room downtown and the price was right.", "Date": "June 30, 2006"}, {"Ratings": {"Cleanliness": "5", "Overall": "4.0", "Rooms": "4", "Value": "4"}, "AuthorLocation": "Dayton, Ohio", "Title": "“No probs at the Comf.Inn...give it a shot!”", "Author": "CaptainBuckeye", "ReviewID": "UR5318514", "Content": "I feel obligated to ofer an opinion of the CI after reading about so many whining about such ridiculous things. If you want a large room, go to Las Vegas! Room was fine. Not super small. Had been remodeled, and the bath had been as well. I sen some even whine about the breakfast. You must be kidding. Most give you NOTHING. It was fine, with a good assortment of bagels, juices, etc etc. Yes it is a small area. So? We had NO view, unless you like a builing and alley. However the location is very convenient to THE mile, Hard Rock, ESPN, the Red line etc. We got a fairly decent rate (in comparison) on a site recommended to us, which was similar to price line. Bout $120 total I think. On a Sat. night too. I would recommend the place. Good luck.", "Date": "June 7, 2006"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Iowa City, Iowa", "Title": "“Pleasant Stay With Minor Problems”", "Author": "mimifg", "ReviewID": "UR5317950", "Content": "This hotel deserves to be in the Top 20 for all hotels in Chicago. It is comfortable, with appropriate amenities (whirlpool, dry sauna, small workout room, free breakfast). I stay here about 5 times a year when visiting Chicago. The staff are helpful and friendly but not overly solicitious (which is good in my book), the hotel is nicely decorated in the deco style and the rooms are smallish but easy to maneuver around - bathrooms are perfectly adequate with stocked amenities. I have noticed more and more families are staying here, and the breakfast room is a freak show of children at certain hours of the morning with Cheerios and Bananas all over the place, but on the whole it is a pleasant stay and very nicely situated downtown. This used to be a nice hotel for business and European travelers, but word has gotten out, prices have gone up, and you see many more \"t-shirt and white socks\" tourists with small children. Be forewarned if you mean to check in at 3 pm as it is crawling with tourists needing lots of advice from staff about where to go, what to do, where is the bus, where is the Red Line El (hint: around the corner at State St. to your left past Weber Grill). But hey, its a Comfort Inn, so it is what it is. Still, a good place to stay. Rooms are quiet. Beds could have a better thread count for the sheets considering the price of the room (which are crawling higher even during the slow seasons). My only real complaint is that the front desk staff (during my stay at least) are clueless to their internet service. Above the 3rd floor, the hotel is not wireless, which I would HIGHLY recommend to this hotel. I plugged in my computer and know how to handle settings (disable wireless, use LAN connections, etc.) and the hotel staff kept telling me it was my computer when I knew the problem was their connection (or lack thereof). When I called tech support, they told me the hotel indeed needed to reset their internet server, which no one knew how to do at the hotel, so the \"free internet\" didn't count this last trip. I moved over to the Palmer House for another stay later that week and plugged right in (they are also not wireless and charge 9.95 per 24 hours) and was immediately on the net. But then that is comparing apples to oranges - the Palmer House has its own I.T. staff. So for what its worth, a good hotel which is changing over to a more touristy spot.", "Date": "June 7, 2006"}, {"Ratings": {"Cleanliness": "5", "Overall": "5.0", "Value": "4", "Service": "5", "Rooms": "5"}, "AuthorLocation": "Rochester Hills, Michigan", "Title": "“Fabulous!”", "Author": "traveljunkee1", "ReviewID": "UR5041740", "Content": "Went for a \"girls' weekend\"; 7 of us stayed at the Comfort Inn. We had 3 rooms with 2 double beds, and one room with 1 queen bed. It was WONDERFUL. Everything was new, clean, contemporary. Our room had a fridge, coffee maker, microwave, wet bar, safe, hairdryer, two phones, CD player, and plenty of fluffy towels. Beds were comfy. Climate control worked great, and shower spray was nice and strong. Staff was excellent! Great customer service from everyone we encountered. Excellent continental breakfast (expanded) and coffee and tea available 24 hours a day. PERFECT location. Some of the complaints I read on Tripadvisor about rooms being too small ... our rooms with 2 double beds were quite large. The room with 1 queen bed was certainly smaller ... but I think you get what you pay for. There was some noise because our room was close to a parking structure (car alarms, etc.), but you gotta expect that when you're staying in a big city. Bring your foam earplugs and you'll sleep comfy and cozy like a baby. I travel extensively and this was an above-average hotel stay!", "Date": "May 8, 2006"}, {"Ratings": {"Cleanliness": "4", "Overall": "2.0", "Value": "2", "Service": "3", "Rooms": "2"}, "AuthorLocation": "Netherlands", "Title": "“Tiny and noisy”", "Author": "HotelfanNetherlands", "ReviewID": "UR4722748", "Content": "First the pros: in the city center with many dinner options around (Rush str., Weber's Grill, Starbucks just around the corner), the breakfast buffet was monotonous but ok. Several breads, donuts, coffee, milk, juices but everything on plastic plates. Very clean. Cons: tiny! And I say that being European. The rooms in this hotel are little cages. Suffocating atmosphere reinforced by the view from our window (see pix). The room hardly fitted me and my suitcase. Noisy! Terribly! The door of our room did not close well-and I mean the door giving to the corridor so we had to wake up the entire night (every night!) from the voices of other people coming in their rooms. Very unpleasant. The Internet did NOT work and noone cared. Basically the front desk staff couldn't care less about the guests. Unfriendliness behaviour which shocked me given how wonderful Chicagoeans are. So if you travel for business, you'd better forget about this hotel or be prepared to have a not working Internet and noone willing to fix the problem. Not sure if I will stay there again unless I cant find anything more decent at a similar prce in the city.", "Date": "March 21, 2006"}, {"Ratings": {"Cleanliness": "4", "Overall": "3.0", "Value": "4", "Service": "3", "Rooms": "4"}, "AuthorLocation": "Ireland", "Title": "“Nice place”", "Author": "A TripAdvisor Member", "ReviewID": "UR4373846", "Content": "I stayed here with my husband for the new year. Arrived on the 26.12.05 and stayed for 6 days. We booked a double room. We had 2 double beds, microwave, sink, tea and coffee making facilities in room which was great and a large bathroom. We made use of the in-room(payable)movies most nights. The hotel is in a good location - walking distance to all areas. We walked from the hotel to the aquarium but it is easier and quicker to take the metro. Walking took about 45 minutes but the metro took 15 mins. Metro is located just around the corner from this hotel. Breakfast is continental - bread, cereal, scones etc..but you can go down and grap what you want and bring it back to your room as the eating area is not very big - only about 5 table and chairs. There is a great food shop across the road, so you can pick up anything you need there, they have a great selection of sushi. On the other side of the road is the Red Lobester Restaurant and a great littel blues club - can't remember the name but it is tiny and they play good music. This hotel is by no means the fanciest hotel I have stayed in but it has everything you will need from a hotel and it is great value for the price!!", "Date": "January 24, 2006"}, {"Ratings": {"Cleanliness": "5", "Overall": "4.0", "Value": "5", "Service": "5", "Rooms": "4"}, "AuthorLocation": "Essex UK", "Title": "“Clean hotel. Very helpful staff”", "Author": "traceyse", "ReviewID": "UR4153670", "Content": "I booked our room at the comfort Inn directly through their website. It was my first time in Chicago, and we were looking forward to hitting the Thanksgiving sales. After a long and boring flight from the UK, we arrived at the hotel early. However the staff at the front desk managed to find us a room that was ready. We had a slight mix up at check in over the price of the room, but Tim managed to sort it out straight away. We booked a magifecent double, and compared to UK hotels it was huge. It was lovely and clean, warm and welcoming. We had a coffee maker and microwave, (which came in very handy, as we arrived on Thanksgiving and all the restuarants were closed. There is also tea and coffee available at no extra cost 24 hours a day from the breakfast area on the 2nd floor The hotel is the perfect base for entertainment and shopping. Starbucks one one corner, Bed bath and beyond and Jewel Osco on the opposite corner, Walgreens a couple of blocks away.Michigan ave and State street a few minutes walk. Just around the corner is the free Navy Pier trolley stop, and the CTA Red Line. I needed some bus and train information, because I had not taken my laptop I wasn't quite sure how to find the information I needed, the staff were more than happy to print me off some schedules from the PC'S at the front desk. All in all we had a lovely stay and would recommend the hotel to everyone. If I go back to Chicago again, this will be my number one choice", "Date": "November 30, 2005"}, {"Ratings": {"Cleanliness": "4", "Overall": "2.0", "Value": "3", "Service": "3", "Rooms": "2"}, "AuthorLocation": "Wright City, MO", "Title": "“Clean but tiny!”", "Author": "frauw", "ReviewID": "UR4128649", "Content": "I have stayed at many choice hotels in the past and I would have to say that I was disappointed in this one. The location is great! We only stayed one night as we were in Chicago to see a taping of the Oprah Winfrey Show. We got in about 10:30 at night and checked out at 6:40 the next morning so we spent very little time in the room. The room was one queen size bed and the room was not much wider than the bed. I have only seen rooms this tiny in Europe. I tried to book directly through the hotel but they would not take a reservation for only one night. I believe there was a convention or something. Therefore I booked through another website (ratestogo). It was the best deal I could find for the Magnicifient Mile in Chicago for that date. I believe the total came to $108 plus taxes. We parked in the recommended garage at $21 a night. However, you can only leave your car there until 12:00 noon the day of checkout. The guy working behind the counter let us leave our vehicle in the garage until 3 so we could shop a little after the taping and gave a different transponder to get the car out. You have to go outside the hotel to get to the garage. There was a tv in the room with cable but the picture was not even watchable. Since we were only there a few hours, it was not a big issue but was disappointing nonetheless. There is a continental breakfast served each morning starting at 7 am. Since we had to be at Harpo Studios by 7 a.m. (about $10 cab ride including tip from this hotel), I wasn't sure they would have anything set up. The gentleman in charge of breakfast had starting setting it up and my friend, myself and a business traveller were able to grab something to eat (muffins) but the beverages were not yet set out. I had previously stayed at the Raphael in March as it was cheaper but their parking (valet) is more expensive at $38. If I had it to do over again, I would stay at the Raphael, because the valet parking was worth it. The person I travelled with uses a motorized scooter and the valet parking would have been more convenient and the overall price would have been a couple of dollars cheaper. The Comfort Inn is in much better condition. than the Raphael as it has been recently remodeled and is very clean and also has a pool which I did not see. However, we had a much larger room and two double beds at the Raphael which made it more comfortable.", "Date": "November 20, 2005"}, {"Ratings": {"Cleanliness": "4", "Overall": "5.0", "Value": "5", "Service": "5", "Rooms": "5"}, "AuthorLocation": "Kansas City", "Title": "“Highly recommended!”", "Author": "goravens", "ReviewID": "UR4043763", "Content": "We stayed for the second time at the Comfort Inn in August 05. This time we upgraded to a king which was much more spacious than the queen room we had stayed in the previous time. As before, everything was clean, updated and contemporary. The room was very comfortable and quiet, and staff was helpful. The continental breakfast was a definite bonus since we could eat on our way out in the morning and not have to worry about eating that meal out. The location is terrific - between State St. and Michigan Ave. - and close to the subway stop too. I have no complaints whatsoever, and the price is great for downtown Chicago and the added amenities of a jacuzzi and breakfast. Terrific stay all around.", "Date": "October 22, 2005"}, {"Ratings": {"Cleanliness": "5", "Overall": "5.0", "Value": "5", "Service": "4", "Rooms": "4"}, "AuthorLocation": "Washington DC", "Title": "“Affordable hotel/excellent location”", "Author": "fflyer", "ReviewID": "UR3816131", "Content": "Location and apparent thorough recent renvovation makes this an excellent choice. The rooms, while not large, are huge by Euro standards. Everything appears new and sparkling. Breakfast, which is included, is well above average. This hotel will definitely be one of my choices when staying in Chicago LDF", "Date": "August 30, 2005"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Pittsburgh, PA", "Title": "“Great value, great location”", "Author": "jdf622", "ReviewID": "UR3781415", "Content": "This is a reasonably priced hotel with a great location. Itâ€™s within 2 blocks of subway, great family restaurants and Michigan Avenue. Almost everything downtown is within walking distance. No need to rent a car if you are staying here. Good continental breakfast. Safes in room, fast elevators. Adequate hot tub, sauna and workout room. Friendly staff also.", "Date": "August 17, 2005"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Gold Coast, Australia", "Title": "“Great Location!”", "Author": "A TripAdvisor Member", "ReviewID": "UR3742451", "Content": "We stayed at this hotel for 4 nights in May, 2005 and we were immediately upgraded upon arrival. For a reasonable price, we had a very comfortable suite and the maid's service was exceptional. The reception staff were pleasant and helpful. From E. Ohio, you could just about walk to everything, including the California Pizza Kitchen. We bought a transport pass and used it occasionally on \"The EL' and buses. For its location and price, the deal was very attractive.", "Date": "August 7, 2005"}, {"Ratings": {"Cleanliness": "4", "Overall": "4.0", "Value": "4", "Service": "3", "Rooms": "4"}, "AuthorLocation": "Boca Raton", "Title": "“Real Convenient”", "Author": "A TripAdvisor Member", "ReviewID": "UR3733055", "Content": "In the middle of everything. Price is reasonable. Nice hotel, great room for a family of five (separate room with a pullout couch), with free breakfast. Really in need of getting more shelf room in the bathroom and a few stains on the carpets. Parking is not real convenient. Accomodating staff. Nicely refurbished building. Otherwise, a great value for the area and I would stay here again.", "Date": "August 3, 2005"}, {"Ratings": {"Cleanliness": "5", "Overall": "5.0", "Value": "5", "Service": "5", "Rooms": "5"}, "AuthorLocation": "Iowa", "Title": "“Excellent Downtown Option”", "Author": "zzrider", "ReviewID": "UR3689190", "Content": "We stayed 4 nights July 16-20. 2 adults and 3 children ages 12-17. Very pleasant stay and very pleased with the entire experience. The high ratings are well deserved. I would stay here again. Location: Outstanding! Many great restaurants and attractions are within easy walking distance. We enjoyed Webers Grill, Pizzeria Uno, and Lawreys all within a block or two. Numerous other options available as well. Michigan Avenue and shopping very close. Close to transit service options. Hotel: Excellent. It was very clean, fresh art-deco styling. Parking garage $21/day with transponder to allow in/out access as desired. Room: Excellent. We stayed in a \"magnificent double\". The room had a wet bar, microwave, refrigerator, internet access (not wireless though), safe, coffee maker, iron, nice radio/CD/alarm. It was spacious for a non-suite room. Room for a roll-away bed, which was quite comfortable, not the typical bar-in-the-back style. The double beds were of satisfactory Serta quality. They were generous with their pillows which I found refreshing. The room was very clean and nicely lit. Our room was in the back of the building, which afforded no view at all, but was very quiet and free of street noise and lights. Amenities: Very good. The complimentary continental breakfasts were very nice, food was fresh. Coffee/tea available all the time. Fitness center is onsite, but we did not have time to utilize this. Sauna and whirlpool. No pool. Staff: Excellent. All were very friendly and helpul. They all seemed to smile. Some went out of their way to be of assistance without expecting anything in return. The few times we needed something (roll-away, extra towels, Yellowbook), someone brought them to our room within moments, no wait at all, the fastest service I've seen at any hotel ever. Price: Excellent. It is one of the least expensive options downtown, yet provides accomodations and service that could rival the much more expensive options. Negatives: very few. The air conditioning was weak, but then again it was around 96F every day. No view (but very quiet). A little hard to see the hotel sign from a distance (hotel is on the right side of this one way street). This is not an extravagant hotel, which makes it a very cost effective option. Those desiring a fancy hotel with extensive amenities would be disappointed. The service rivaled even the most expensive hotels I've stayed in. Those like us, looking for reasonable accomodations and a base from which to explore the attractions available in Chicago should be very pleased.", "Date": "July 21, 2005"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Columbus, GA", "Title": "“Location, Location, Location!!”", "Author": "A TripAdvisor Member", "ReviewID": "UR3588034", "Content": "We had a wonderful stay at the Comfort Inn & Suites on Ohio St. in May 2005 for 4 days. One block from the El, 1/2 block from the Weber Grill Restaurant, on the line for the Pier Shuttle. The breakfast was excellent and lots of options available. Front desk was very helpful We never needed a taxi and toured everything. A great city and a very accomodating hotel.", "Date": "June 20, 2005"}, {"Ratings": {"Cleanliness": "5", "Overall": "5.0", "Value": "5", "Service": "5", "Rooms": "5"}, "AuthorLocation": "Swindon - United Kingdom", "Title": "“Excellent”", "Author": "A TripAdvisor Member", "ReviewID": "UR3530502", "Content": "Stayed here May 24th - 30th and what a very pleasent stay it was. As other people have said a lot of the sites were within walking distance. I brought a $20 transit card and did not use it! I loved the Navy Pier and if you are looking for an alternative way of getting down to soldier feild and the feild museums then go by water taxi from the pier, $12 round trip and some good photo's to be taken from the boat of the skyline of Chicago. The staff were very freindly and helpfull If a light sleeper then maybe a higher floor and non street side might be better for you than my 5th floor street side (that did not bother me). Plenty of choice of what to eat from Mcdonalds to restaurants all within 5 -15 minute walk. I plan on going back to Chicago and will book here again. A very clean hotel in a superb location.", "Date": "June 5, 2005"}], "HotelInfo": {"Name": "Comfort Inn & Suites Downtown", "HotelURL": "/ShowUserReviews-g35805-d247154-Reviews-Comfort_Inn_Suites_Downtown-Chicago_Illinois.html", "Price": "$118 - $302*", "Address": "<address class=\"addressReset\"> <span rel=\"v:address\"> <span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">15 E Ohio Street</span>, <span class=\"locality\"><span property=\"v:locality\">Chicago</span>, <span property=\"v:region\">IL</span> <span property=\"v:postal-code\">60611</span></span> </span> </span> </address>", "HotelID": "247154", "ImgURL": "http://media-cdn.tripadvisor.com/media/ProviderThumbnails/dirs/67/62/6762810a6726b119fdb1fa9daa0fef8a3large.jpg"}}