{"Reviews": [{"Ratings": {"Service": "2", "Cleanliness": "1", "Overall": "1.0", "Value": "2", "Sleep Quality": "2", "Rooms": "1", "Location": "4"}, "AuthorLocation": "Los Angeles, California", "Title": "“hated it”", "Author": "twilight26", "ReviewID": "UR54952811", "Content": "My friend and I stayed here several years ago to go to a wedding. I was hoping for a funky and fun place that is close to shops and cafes. The location turned out to be great, but wow the room we stayed in was very very dumpy. I was truly disappointed and embarrassed that I booked such an awful room for us to stay for the weekend. The floors were dirty, the bathroom was dirty, everything smelled musty. It looked run-down and what I hated most was seeing built-in grime on the edges of the floors and walls. The bathroom door was grimy. Not a cozy place to stay; I think we avoided going back to the room until we had to. Ever since staying there, I've been extra careful about researching a hotel before booking. I would recommend if you are staying at this location (Fairfax/Beverly) go for the Farmer's Daughter.", "Date": "February 1, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Location": "3", "Rooms": "1"}, "AuthorLocation": "tucson", "Title": "“Had to put a towel on the bathroom floor”", "Author": "misledandliberated", "ReviewID": "UR24706434", "Content": "No Joke...Bugs fell on my face in the middle of the night. This place is disgusting. If you don't mind camping inside a hotel, this place is for you. There was black mold in the bathroom and around the windows. The room was cold and there was a cigarette hole in the sheet. I did not walk barefoot in this room. It was in a good location but that was the only positive. The heater worked well but there was about 3 minutes worth of hot water. The water got cold almost immediately. If you want you can try...But the place smells like stale hot curry and garlic....It's just gross and the staff couldn't care less...Even though they did shoot us a smile. Germaphobes...AVOID AT ALL COST...Unless you reallllly like to rough it.", "Date": "February 18, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "2", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "3.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "San Diego", "Title": "“OK FOR A COLLEGE STUDENT BUT NOT FOR YOUR GRANDMA”", "Author": "Makeupartistonthego", "ReviewID": "UR17256485", "Content": "The location was AWESOME , walking distance to LA's famous Grove and Farmers Market , along with other awesome places to eat. The neighborhood is nice and quiet. Im a makeup artist and was doing work all week in a studio very close to there and it was convient for me to get to work and back with no traffic etc. Here are the pros and cons The Cons first The Wifi was avaiable only by code and password that they provide you and if you are online and someone else is using the same online code it will say that is busy? The pool never gets sun ( BUT IS VERY CLEAN) The parking is limited ( 20 units in the building with only 8 parking spots ) and the neighborhood is PERMIT parking only . ( however I never had a problem with parking my car but did once when I came back late ( around 2pm the lot was full ) which led me to drive around a million times and I had to park in a lot next door and had to quickly move it by 6am before I got towed. The bathrooms are very very very very very dirty ( the walls have dirty hand prints and the floors are dusty. I cleaned the toliet myself to guarentee a clean seat for me. The room REEEEAKED of smoke They have non smoking and smoking rooms and you can smell the smoke straight through the walls even if your room isnt smoking ( this wasnt pleasent at all ) THE CONS The average hotel for this location is $250 a night I only paid $65 a night!!! They hotel owner was VERY VERY VERY NICE The coffee was always brewed in the morning and he had fresh pastrys that was tasty . The A/C worked great , the beds were cozy ( BRING YOUR OWN PILLOWS the pillows they have are flat as a pancake) The hotel was equipped with several camera and it seemed very safe. There are mircowaves and Refridgerators. The do clean your rooms for you and make your beds etc when you leave for the day and come back everything looks great. The showers are clean but as I mentioned before the floors in the bathroom was dirty and the walls were gross looking . Overall would I stay here again YES Would I reccommend this place to my grandparents NO WAY Would I reccommend to my friends or college friends SURE it is a good conversational piece. As mentioned before the location makes up for it.", "Date": "June 26, 2008"}, {"Ratings": {"Service": "3", "Cleanliness": "1", "Check in / front desk": "3", "Overall": "1.0", "Value": "2", "Rooms": "1", "Location": "4"}, "AuthorLocation": "Brooklyn, NY", "Title": "“Skeeeeeevy”", "Author": "emaky", "ReviewID": "UR15501394", "Content": "Have you ever gone without a shower in a motel because you feared coming out of it dirtier than you went in? The towels were probably white sometime back in the 80's (which may have been the last time they were washed). The stray hairs (of the short and curly variety) that littered the bathroom floor did nothing to help the ambiance. They dumped us (a family with a small kid) in a smoking room. It took days to get that smell out. Not fun. This, FWIW, was the start of a camping trip. The campsites we stayed at were cleaner, and the chemical toilets were fresher than this place's. On the plus side, the location is great!", "Date": "April 30, 2008"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Check in / front desk": "4", "Overall": "4.0", "Value": "4", "Rooms": "2", "Location": "3"}, "AuthorLocation": "Ottawa, Canada", "Title": "“good value at the Bevonshire Lodge”", "Author": "rob_hanson1979", "ReviewID": "UR11285588", "Content": "We booked the Bevonshire Lodge motel for 1 night, as we had tickets to the Price is Right, and CBD Television City is only a block away. We corresponded several times with management to ensure that our late arrival (12:30am) would be ok, and it wasn't a problem. They were expecting us when we arrived. The hotel is very small, only a few rooms, and it is in a mostly residential area. The room was actually a decent size, with 2 double beds, a mini-fridge and microwave, and an average bathroom. The rooms were decent, clean, and fine for what we needed. The rooms did show their ages, and the Air Conditioner/heater was fairly loud. For someone who needs a cheap place to stay for a night or two, this would be ideal. For someone who wants high quality, this isn't the place. Also, if you are staying for an extended period, please keep in mind that you will need a car. There is ample parking on site, considering the low amount of rooms available. The parking spots are small, however, so don't rent a hummer! Our midsize car barely fit in the spot. Close by is the above-mentioned CBS Television City, as well as the Grove and Farmer's Market's shopping areas. Starline Bus tours stops at the Farmer's Market, and you can buy tickets from the driver, and see Hollywood on the tour. Other than the eateries at the Farmer's Market/Grove, the only other spots close by are a bagel shop and a Subway. Again, the car will come in handy.", "Date": "December 6, 2007"}, {"Ratings": {"Service": "4", "Cleanliness": "2", "Check in / front desk": "4", "Overall": "3.0", "Value": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "rehovot", "Title": "“The best deal you can get there”", "Author": "shirgi", "ReviewID": "UR10782070", "Content": "We stayed in the bevonshire motel twice in the same trip. There are no cheap motels in LA, only in very bad parts of the city. Yes, the room was not very clean but it was big, the owner was very nice to us and considerated our needs. We too got a wake up call a bit early asking us to move the car, but it was only once in total of 4 nights. I wouldn't go there with children or if I could afford something more expensive, but for my budget it was the best deal you can get in centeral LA.", "Date": "November 12, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Check in / front desk": "2", "Overall": "3.0", "Value": "3", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Kent", "Title": "“Good Value - Unpleasant Owner”", "Author": "Quenyth", "ReviewID": "UR10474202", "Content": "I travelled alone - my first time in the States .Bevonshire Motel itself was a little better than I expected for the money, it was clean and pleasant enough for a short stay. I had read reviews on the web of a' surly owner', so on arriving late due to flight, I was pleasantly suprised to be greeted by a charming younger man who was polite and helpful. The next day I booked cabs from there for a destination a few blocks away giving him venue number and street..- presuming it would be a good cab service. The Russian Driver hardly spoke English and dindn't know the way ...expected me to navigate.. in spite of it being my first visit to the States. and overcharged me for the priviledge. Before going out I needed to operate the automatic drinks machine and Surly Man appeared and was rude and unpleasant, in spite of me remembering my ''pleases and thank yous.'' The next day I had asked' Pleasant Man' to order a cab for 6.00a.m. for flight home the next morning.. In the morning Reception was empty - no cab - and I had to hand in my key. I was told previously that it was 24 hr service..no worries. . Eventually Surley Man arrived - in dressing gown, muttering under his breath - snatched my key and slammed door in my face before I could ask about the cab. I sat outside in the dark , on my own ,for half an hour until a kindly Yellow Cab pulled over and took me to the airport. I'm not suggesting you dont go - but if you encounter this owner remember you have paid for your trip and expect the respect you show him to be returned.I did not find this nasty attitude remotely funny, it was disturbing, bullying is not amusing, under any circumstance. I would not recommend this Motel for single women. Sad really as the Motel is great value and the rest of the staff are lovely.", "Date": "October 31, 2007"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "San Francisco, California", "Title": "“Will stay here again”", "Author": "sealonsf", "ReviewID": "UR8263051", "Content": "- Super cheap for a major city - Free off-street parking - Large rooms with fridge and microwave - Free coffee and muffins in the lobby in the morning - Excellent location walking distance to Farmer's Market You really can't beat the price for such a great location - the Farmer's Market is my favorite place to visit while I'm in LA. We also walked to Canter's Deli the evening we stayed there - loved that. I wasn't expecting a five-star experience so was not disappointed. I disagree with the other person who posted that said the manager was ill-humored. He was quite pleasant to us - not overtly bubbly but certainly polite and when we asked what the checkout time was he said, \"noon or one if you would rather\" - very welcomed because it made it easy for us to take our time having a lovely breakfast at Farmer's Market on the day we left without having to move our car. I would stay at Bevonshire again.", "Date": "July 30, 2007"}, {"Ratings": {"Service": "3", "Cleanliness": "2", "Check in / front desk": "4", "Overall": "3.0", "Value": "3", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Vancouver", "Title": "“The Price was Right”", "Author": "yvrskyhag", "ReviewID": "UR7549163", "Content": "Went to LA to see the Price Is Right. We didn't expect much from the room because it was inexpensive compared to others in the area. It smelled like cleaner which is a good thing but I think family members must clean the rooms. The sheets were clean but the blanket on the bed left little to the imagination. Large rooms and the proximity to The Grove shopping and Farmers Market was great...about 10 minutes in a relatively safe neighbourhood. (I wouldn't walk it alone though). I would stay there again as I said the price was right and we had brought blankets with us to camp out on the street for the last night. At the gate 2pm Sunday for the 1:15pm taping Monday. Worth every minute of the wait to see Bob Barker and be in the audience. If you are going, bring an alarm clock and hair dryer if you need those items, although was happy to see a large bar fridge and microwave in the room. We didn't use the pool but as you can see by the photos you couldn't really hang out around it so don't book this hotel if you want to lounge at the pool, looked clean and inviting, if the weather was hot enough.", "Date": "May 5, 2007"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Check in / front desk": "1", "Overall": "1.0", "Value": "1", "Rooms": "1", "Location": "2"}, "AuthorLocation": "washington", "Title": "“Cleanliness and customer service...Failed!”", "Author": "boopchild", "ReviewID": "UR6822805", "Content": "We booked our stay in regards to the online reviews, previously posted and viewed. They were all positive. Unfortunately, our experience was nothing compared to the \"positive\" responses! The room was surface clean, but look closer and you will find, cigarette butts put out on the window ledge and the butts left to decorate the room! Gross-Gross-Gross!!! Understand now that this was a non-smoking room. We all 3 thought that cigarette smoke was apparent, but when we ask the hotel staff, they swore it was a non-smoking room, cause the sign on the door said so! Anyways, once the mess was found by us and reported to hotel staff, we were then blamed for the mess and told to leave the hotel without a refund! (Now understand, that we all 3 are non-smokers and have always been!) We were presented and treated with the worst customer service we have ever experienced on our travels. We all 3 were in a state of shock and disbelief. Two of us being business owners that specialize in customer service, we were not at all impressed. We packed our bags super fast and exited 2 nights early! A lost customer and review to a business that should specialize in both cleaniness and customer service!", "Date": "February 21, 2007"}, {"Ratings": {"Overall": "3.0"}, "AuthorLocation": "Des Moines, IA", "Title": "“Bevonshire Lodge -- Not bad for the price”", "Author": "amastel", "ReviewID": "UR6617314", "Content": "I chose this hotel because of it's price (we were looking for cheap) and proximity to CBS Television City where they film The Price Is Right, and based on reviews on TripAdvisor. I paid about $70 per night. When we first arrived, we weren't impressed with the lobby area; it looks like it needs a good scrubbing and coat of paint. The young man at the desk was very nice and helpful and we had no problems checking in. We were pleasantly surprised at the room itself as it looked like it had been painted recently and the carpet and bed linens were very clean. There was a small refrigerator which looked pretty old, but worked just fine. The TV also worked fine. There was a smallish pool in the courtyard which looked nice, but we didnt' swim. The only complaint about the room was that the bathroom was a little dingy. There wasn't mold growing or anything, it just looked like it needed a good steam cleaning and coat of paint. Parking was free and was located at the back and side of the building (although if people park over the lines, it's impossible for another card to park next to them). Medium or large cars might not fit. There is street parking in a very nice neighborhood if you can find it. We felt like the neighborhood was safe, especially since we had to walk about 3 blocks to stand in the for The Price Is Right tickets at 4 a.m. It took us about 5-7 minutes to walk there. If you're going to The Price Is Right, the Farmer's Daughter is the closest, but it costs twice as much. For the price, the Bevonshire Lodge met my expectations. I didn't expect \"chain hotel\" amenities (like blow dryers, irons and alarm clocks) and I know that I paid a lot less than I would have at a chain. I wouldn't take the kids for a week long vacation there, but for a brief stay for women trying to meet Bob Barker, it was just fine.", "Date": "January 18, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Clermont Ferrand", "Title": "“Great Place ! Highly Recomended”", "Author": "Donut90210", "ReviewID": "UR6320376", "Content": "Hi guys. If you're looking for a clean, safe, and really enjoyable place to stay in L.A., this Motel is the best we experienced in the city (we tried 4 on a 1 month trip). Great clean modern rooms, with large beds, private bath, fridge, A/C and TV. Rooms were cleaned everyday, and the owner is the kindest person we met in L.A. . There's a pool in the hotel, and this place was totally quiet and safe, even by night. Great, great, great ! All this for $70 per night, and ideally situated just near the farmer's market, restaurants and shops. the best to take some rest in family.", "Date": "December 3, 2006"}, {"Ratings": {"Cleanliness": "1", "Overall": "2.0", "Value": "2", "Service": "1", "Rooms": "2"}, "AuthorLocation": "london", "Title": "“Not clean”", "Author": "borderline", "ReviewID": "UR4625946", "Content": "The negative: dirty carpet, wallpaper falling off, I saw a cockroach in the bathroom. Old and not very clean towels. Even the reception needs a good cleaning. The positive: good sized room, bus stop right outside, good location. If you can pay a little bit more, go somewhere else, I know I will.", "Date": "March 15, 2006"}, {"Ratings": {"Cleanliness": "1", "Overall": "1.0", "Value": "1", "Service": "1", "Rooms": "1"}, "AuthorLocation": "Warsaw", "Title": "“Never again”", "Author": "A TripAdvisor Member", "ReviewID": "UR4047068", "Content": "We have been in USA for more than 2 weeks. Almost every day we stayed in other motel. But Bevonshire was the worst one. Dirty bathroom, bad smell in room, not enough parking space. When we moved out of there unfortunately I left my shoes in room under bed. When I called them the same day and told that I left shoes in room and I want take them back they said they didn't find anything. It is strong accusation but I must say that they have stolen my favourite shoes...", "Date": "October 24, 2005"}, {"Ratings": {"Cleanliness": "3", "Overall": "3.0", "Value": "4", "Service": "3", "Rooms": "3"}, "AuthorLocation": "richmond, VA", "Title": "“Satisfied”", "Author": "A TripAdvisor Member", "ReviewID": "UR3612283", "Content": "Overall, I had a good experience. My son's enjoyed the pool, while I got a nice tan. The hotel did not have a restuarant on the property but there was one next door so we grabed earlier breakfast. There are not a lot of amenities but the place does offer a reasonable price and rooms are cleans. I checked around the area and could not find a better price. I was initially concerned that the price was too low for the area and there was something wrong with the hotel. When I arrived and saw the rooms, I was really satisfied and the stay was good.", "Date": "June 26, 2005"}, {"Ratings": {"Overall": "2.0"}, "AuthorLocation": "Austin, TX", "Title": "“Not great.”", "Author": "MKeebler", "ReviewID": "UR3375857", "Content": "Limited parking. Room not clean. I waited until I checked into a new hotel to shower. Staff not knowledgeable of the area. Got 2 beds, but one was tiny. Would only accept a coupon for one day. Walking distance to the Grove Shopping center.", "Date": "April 19, 2005"}, {"Ratings": {"Cleanliness": "2", "Overall": "3.0", "Value": "2", "Service": "2", "Rooms": "2"}, "AuthorLocation": "London, United Kingdom", "Title": "“OK if desperate, otherwise look around more”", "Author": "NG-Lon", "ReviewID": "UR2493087", "Content": "We stayed here for two nights in early august, this was the only hotel that we had not pre booked on our two week trek around the best California has to offer and we paid the price for not researching the hotel properly. The Bevondshire is not a bad place but it is old, in dire need of redecoration and dirty around the edges, by this I mean that the sheets were clean along with the washbasin and shower however don’t look too close behind the doors or at the carpet or under the bed. I did feel the need to give the toilet floor the once over on arriving as it was far from sanitary. There is a pool however I doubt it has been used in the last ten years and I most certainly would not consider using it. On the plus side it did offer free parking and the location was good being pretty central, it also had an excellent bar / restaurant next door that we actually found ourselves in on both nights. The staff were friendly enough however they did wake us up at 8.30 asking us to move our car for no apparent reason. I would not recommend this place to other people however I am uncertain as to the standard of rooms generally in LA for this price, it may be the best you get and for two nights its bearable.", "Date": "August 25, 2004"}, {"Ratings": {"Overall": "1.0"}, "AuthorLocation": "Las Vegas , Nevada", "Title": "“Run down”", "Author": "A TripAdvisor Member", "ReviewID": "UR930927", "Content": "We went to the Bevonshire and we were really disappointed. It was pretty run down. The place needs a major renovation. It looked clean, but is just not in the best of shape at all. We did not stay there after looking at two rooms. It is old and everything looks frayed - including the carpets and the bedspreads. The pool looked dirty. The owners seemed nice, but the rooms were not.", "Date": "April 7, 2003"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "", "Title": "“Good and Cheap”", "Author": "A TripAdvisor Member", "ReviewID": "UR624392", "Content": "Friendly staff, convenient location, clean rooms, and a low price tag made three days in LA easier.", "Date": "June 19, 2002"}, {"Ratings": {"Overall": "1.0"}, "AuthorLocation": "", "Title": "“This Place is a DUMP!”", "Author": "A TripAdvisor Member", "ReviewID": "UR592926", "Content": "This place is FILTHY Dirty! The floors had vomit on them and hookers and drugs were present everywhere! It is unsafe! DO NOT STAY HERE!", "Date": "May 29, 2002"}], "HotelInfo": {"Name": "Bevonshire Lodge Motel", "HotelURL": "/ShowUserReviews-g32655-d248069-Reviews-Bevonshire_Lodge_Motel-Los_Angeles_California.html", "Price": "$89 - $93*", "Address": "<address class=\"addressReset\"> <span rel=\"v:address\"> <span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">7575 Beverly Blvd</span>, <span class=\"locality\"><span property=\"v:locality\">Los Angeles</span>, <span property=\"v:region\">CA</span> <span property=\"v:postal-code\">90036</span></span> </span> </span> </address>", "HotelID": "248069", "ImgURL": "http://media-cdn.tripadvisor.com/media/ProviderThumbnails/dirs/0c/41/0c4134c3ca19fbffb7169b5610a48d481large.jpg"}}