{"Reviews": [{"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "3", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Orlando, Florida", "Title": "“Good Choice, considering the city”", "Author": "Trockie", "ReviewID": "UR125604594", "Content": "I would rank this hotel a solid \"good\". The room was spacious, very clean, tastefully decorated and comfortable. The negatives were no elevator and on again/off again status for: A/C, TV and one morning the hot water. Most of the time it all worked but on a few occasions there were issues. Then again, it's Mexico. For the price range, it was definitely the nicest place we saw in Playa. It can be a little noisy in the evening due to music from nearby establishments, so earplugs are helpful. The people that were running the hotel were very nice. All in all, I would stay here again. Also, there is a convenience store, internet vendor next door and a lady that makes good empanadas on the corner as well.", "Date": "March 4, 2012"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "4"}, "AuthorLocation": "Lubin, Polska", "Title": "“I recommend this hotel”", "Author": "martynoi", "ReviewID": "UR117544450", "Content": "Very clean and nice hotel.The staff was also very nice and helpful. I recommend this hotel", "Date": "September 1, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "3", "Overall": "2.0", "Value": "2", "Sleep Quality": "1", "Rooms": "1", "Location": "1"}, "AuthorLocation": "boston", "Title": "“No”", "Author": "boston71", "ReviewID": "UR59472109", "Content": "I hate to say we did not enjoy our stay. I had such high hopes for Los Itzaes because of the TA reviews. But to our dismay, none of them held true. We were on the third floor - no elevators. So if you have luggage, just plan on this. Tip: travel light so you don't have to lug suitcase up/down 2 flights of stairs with NO air-conditioning. Rooms, bland and stale. Balcony/patio/terrace - non-existent. The french doors lead to a \"balcony\" of about 14\" by 40\". We had the choice to overlook 10th, which was a view of the rooftops across the street, which were covered in old dirty mattresses, tons of old and broken bottles, and a group of guys that were not \"family friendly\" types. So gross. So we settled for our other choice, 2nd floor overlooking the \"courtyard\" which was basically just an empty lot with a few abandoned buildings beyond, harboring some extinct washing machines and other discarded garbage. Such a nice view - not. The rooftop \"pool / jacuzzi\" (there is no pool, just a big cold tub) is freezing cold. I couldn't understand that, seeing now it was baking in the sun all day, every day. ?? The metal doors leading to it scraped against the concrete with a horrific noise. Etc. If you don't want quality, quantity or value - stay here. The A/C was stuck on freezing the first night and we had to argue our case for a 2nd blanket. If I ever I cheap out in Playa again, I will pick a hotel on the beach. This is only two blocks back, but a world away from the charm and feel of the appeal of the area. I didn't even take pics, and I take pics of EVERYTHING. Why bother? I didn't want to remember it. I would never go back, too many nicer properties for the same price on the water or on 5th. Sorry!", "Date": "March 25, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "3", "Overall": "2.0", "Value": "1", "Sleep Quality": "1", "Rooms": "2", "Location": "2"}, "AuthorLocation": "Texas", "Title": "“I suspect Fake Reviews, overpriced for what you get”", "Author": "BeenThereLeastOnce", "ReviewID": "UR59182663", "Content": "Great web site and promotion, but this is a low budget hotel. The rooms should cost about $70-$80, not $140+. Ran out of hot water, had to pay $12 to park across the street, only wifi is in the lobby, no clock in the room, the room keys are huge (not cards). Good location, but can be very loud. No drop off, or pull in, location for a guest to be dropped off at the hotel. You have to dump you buddy off in the busy street, then try to find some place to park. Then you find out that it cost $12 to park across the street. Plus, any request is responded to with a quizacal facial reponse, like \"do you really need that\". Got a better quality hotel down the street for $100 a night and free parking.", "Date": "March 21, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Sarasota, Florida", "Title": "“We Love Los Itzaes!! Fabulous location, very clean and was perfect!!”", "Author": "trvlbsrb", "ReviewID": "UR58178273", "Content": "A fabulous experience, and one of the nicest Hotels in town. Close to everything, safe to walk around even late night. The Wal-Mart was just 3 blocks away to stock up on water and supplies.. Awesome service, very clean and comfy. Loved the roof-top pool. Noone was ever there, so \"no tan lines\". The pool was a bit cold, but it didn't matter. The weather wasn't very hot, and cooler nights kept the water cool I suppose. We really enjoyed Los Itzaes, and will be back. I'm a travel agent, and wanted to try something not all-inclusive and I am definitely going to recommend to my tour companies to offer more EP Hotels in Playa del Carmen. So much more affordable than the all inclusives, and the restaurants are wonderful in the area.", "Date": "March 9, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "1", "Rooms": "4", "Location": "4"}, "AuthorLocation": "oregon", "Title": "“Big hotel quality, little hotel price”", "Author": "oregonjp", "ReviewID": "UR55606430", "Content": "The hotel entryway feels like a courtyard surrounded by hanging gardens and our room had french windows that opened onto a breezy balcony. The shower never warmed up much, but the room was very clean and had a fan and A/C, as well as a mini fridge, a safe, and a blowdryer. The hotel is located close to the Quinta, the beach, and various nightclubs, including the Coco Bongo---good if you want to shop, swim, and enjoy the nightlife--not so great if you need to get a good night's sleep. They don't furnish parking, but we found a free spot just up the block, and there is a pay-to-park lot around the corner.", "Date": "February 9, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "4"}, "AuthorLocation": "bloomington, in", "Title": "“the best deal in playa on a well located, reasonably priced hotel”", "Author": "Diogeron", "ReviewID": "UR53856394", "Content": "My wife and I first stumbled on Los Itzaes about seven years ago when we did a day trip to Playa from Cancun. Since an ice storm was coming in on the weekend, we extended our stay a week and moved to Los Itzaes from Cancun never again to return to Cancun. We stayed there on our trips to Playa for a couple of years and were always very happy with the cleanliness, spaciousness, location and price. We now have a place in Playa, but I just moved to Los Itzaes for three nights since my wife had three friends coming in for a long weekend of bridge. The hotel has lost none of its charm and thev've even added some tables on the rooftop, with a small pool and a view of the lights of Cozumel at night. Finally, the staff (family run, I think) is the same staff that has been there since we first went there and they are competent and friendly. Each room also has a small refrigerator, AC, and cable tv. Unless needs (wants?) a luxury hotel, it's hard to believe you would be disappointed with Los Itzaes.", "Date": "January 19, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Knoxville, Tennessee", "Title": "“A hotel I would recommend to anyone!”", "Author": "Lavishstyle", "ReviewID": "UR38437555", "Content": "I stayed at Los Itzaes Hotel on August 9-10, 2009. As other reviewers have said, the hotel is centrally located and close to so many places you will want to be. It’s just a short stroll to the bus station, great restaurants, shops, and the beach. The hotel is also a participant in Mamitas Beach Club, which would permit access to the beach if you want to use it. My travel companion and I never did use this service but it’s nice to know it’s there. I was impressed by this property from the start. The lobby is gorgeous! There are vines and plants hanging down from the top of the four floor atrium and it gives the impression of a cool oasis. They have everything from long pothos vines to small palm tress growing in there. It’s marvelous. We arrived late in the day on the 9th and at the reception we were met by Jose who we found to be friendly, welcoming, and helpful. It was nice to see a smiling face after our long trip to arrive there. Our room was beautiful! Soothing shades of green and cream. The floors were marble tiles (be careful not to slip) and the bathroom was entirely marble with a beautiful walk-in shower. The water pressure was strong and a hot shower was reviving after a long trip. There’s a little balcony too with French doors that overlooks a busy street. Despite the traffic, when these doors were closed we could hear no noise. The air conditioner was strong and state of the art. When the balcony doors were opened, the system shuts off so energy is not wasted. Clever! The beds were super-clean and very comfortable. I slept so well! The mattress was new and firm. We really enjoyed the rooftop pool. It’s really takes you away. You can see the ocean from the roof and all of surrounding Playa del Carmen. The pool is chic and stylish and a nice place to retreat to at the end of the day or even for a quick swim before you head out. On our last day we stored our luggage behind the desk and the staff was happy to do this for us. They were all smiles. I would recommend this great hotel to anyone. It’s fresh, modern, and stylish and comes at a great bargain since it’s not on the beach. It was a terrific stay in all aspects.", "Date": "August 22, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "New York, New York", "Title": "“excellent hotel”", "Author": "funromanticgetaway", "ReviewID": "UR19217783", "Content": "Los Itzaes is a great hotel! We have stayed at Los Itzaes on two vacations. Our latest stay was for 19 nights, and we loved it. The rooms are clean, and the hotel is lovely. There is a swimming pool on the roof where you can enjoy seeinig the sunset. The lobby is filled with plants and the chirping of birds. It felt like paradise. The hotel supplies beach towels. Los Itzaes also provides a free breakfast. We enjoyed the chilaquiles, hot cakes, and the fresh fruit plate. The hotel is located 2 short blocks from the beach. You can view the ocean from the roof and from some of the rooms. Each room has a small balcony. We will stay here on our next visit to Playa del Carmen.", "Date": "August 21, 2008"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "London", "Title": "“Loved this hotel”", "Author": "mark1308", "ReviewID": "UR15422555", "Content": "There are dozens of hotels to choose from in Playa Del Carmen but a lot of them are located on 5th avenue which is great if you want to be on top of the bars and restaurants but not so great if you want a bit of peace and quiet in your hotel room. Los Itzaes is on10th which runs parallel to 5th so it's close to all the action on 5th but far enough to get a decent nights sleep without interuption. The staff were fantastic and couldn't do enough for us. I made our reservation with the hotel directly and managed to get a deal that included all taxes, breakfast and free sun loungers on Mamitas beach. The receptionist will also give you fresh beach towels every day. I can’t wait to go back to this great little hotel.", "Date": "April 28, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "3", "Check in / front desk": "5", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "portland", "Title": "“Great location”", "Author": "hud687", "ReviewID": "UR12327994", "Content": "Nice clean rooms, great staff, close to everything. We really enjoyed our stay and would go back to this hotel.", "Date": "January 4, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Manistique, Michigan", "Title": "“Great Hotel!!”", "Author": "eleona01", "ReviewID": "UR8116352", "Content": "I loved this hotel! I went to Playa as part of a trip for my school's Spanish club. After spending a week in a crummy hotel in DF, this hotel was a welcomed relief! The bathrooms are amazing, everything is clean, the staff is fantastic, and it is right in the middle of everything. The rooftop pool was a very nice suprise as well. We were even able to get buses to pick us up at the hotel to take us to Chichen Itza and Tulum. Its a very short walk from the beach, and has a lot of nearby restraunts. Our room even had a nice balcony. Some friends of mine had a corner room and it too was fantastic. Don't pass up on this hotel!", "Date": "July 14, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "4", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Boca Raton, Florida", "Title": "“Great small hotel in Playa”", "Author": "mm6300", "ReviewID": "UR6183069", "Content": "Los Itzaes is just as nice as everyone in these reviews has said. I stayed there last night (November 26, 2006). The hotel is only a few years old, so it is still rather new and very well-maintained. The lobby with a skylight and hanging garden is delightful. And the rooms are clean, and spacious. The bathrooms are sufficiently large, with modern fixtures and a large glass-door shower. The room furniture is tasteful modern, and the king size bed was perfect - not too hard like so many in Mexico. The location is why the hotel is not as expensive as others this nice. It is on 10th avenue (between 6th street and 8th street), which is one block west of 5th avenue (go figure), which is where all of the restaurants, bars and shops are located. The beach is on the other side of 5th avenue, which makes it about two blocks away. Everything is very close and a safe short walk away. The hotel offers free parking in a secure lot directly across the street, and every guest receives a free breakfast of eggs with bacon, or pancakes, or cereal, as you wish. I usually stay in very nice business hotels and this hotel was fine for me. If you have trouble walking, ask for a first floor room because like almost all hotels in Playa del Carmen, there is no elevator. In summary, excellent new hotel in a good location for a terrific price.", "Date": "November 27, 2006"}, {"Ratings": {"Cleanliness": "5", "Overall": "5.0", "Value": "5", "Service": "5", "Rooms": "5"}, "AuthorLocation": "Atlantic City, New Jersey", "Title": "“Wonderful hotel!”", "Author": "primadonna11", "ReviewID": "UR4993125", "Content": "I wish that we had stayed here longer!! The hotel is very clean and lovely, with an overhead garden as you enter. The rooftop pool is beautiful. This is a smaller hotel with the most outstanding service- Cynthia Sanchez is a hard working, great hotel manager, and Viginia will make sure that you have everything that you need. We didn't stay very long here, because my fiancee and I wanted to go to an all-inclusive. So we only spent two nights here, then went to the Gala which was awful, so I wish that we had just stayed at LosItzaes!! The rooms are very clean and comfortable, and we loved the big shower. This place is worth every penny and more!!", "Date": "April 21, 2006"}, {"Ratings": {"Cleanliness": "5", "Overall": "5.0", "Value": "4", "Service": "5", "Rooms": "5"}, "AuthorLocation": "bloomington, indiana", "Title": "“A Real Find in Playa”", "Author": "A TripAdvisor Member", "ReviewID": "UR3353130", "Content": "This year marks the third year in a row I have stayed at Los Itzaes and, if I don't buy something in Playa, next year will be the fourth. I have traveled extensively for over 20 years and I love this hotel. I agree with the person who said it's hard to share these finds because you want to keep it to yourself. Rooms are very spacious, with a small fridge, air conditioning, cable television, etc. For the first time this year, there is a computer set up in the lobby and free for guests to check e-mail as long as you don't monopolize the computer. They say you are limited to 15 minutes, but if nobody is waiting, they seem not to care if you stay on longer. The staff, managed with great competence by Cynthia Sanchez Sosa, is uniformly pleasant, bi-lingual (at least) and will go out of their way to assist you. A stay comes with a pass to the beach, a beach towel for the day, and a lounge chair rental for free. You may also opt for breakfast included, which is very good and prepared and served very well by Juan Jose, who has been there all three years since I have stayed here if memory serves. I also am fond of the location. It is only three blocks from the beach, but one off 5th Ave., which can be noisy. Moreover, there is a great music bar across the street called \"Captain Dave's\" where Grady and his Fiends (sic...someone crossed out the \"r\" in the sign) hold forth nightly (picture attached). Overall, this is a hotel that you keep coming back to because you know the alternative is likely to disappoint.", "Date": "April 12, 2005"}, {"Ratings": {"Cleanliness": "5", "Overall": "5.0", "Value": "5", "Service": "5", "Rooms": "5"}, "AuthorLocation": "New York, New York", "Title": "“Excellente!”", "Author": "A TripAdvisor Member", "ReviewID": "UR3241070", "Content": "Myself and 2 girlfriends just stayed at Los Itzaes from 2/20/05 - 2/27/05 and we had a terrific stay at this quaint, clean and quiet hotel. The location is perfect as it's a 2 minute walk from 5th Avenue where all the shops and restaurants are yet you are not in the middle of it. We had access to the Playa Tukan beach club that was a lovely 10 minute walk through town. Helped digest the wonderful breakfast we got every morning. The staff was friendly and helpful, the rooms were spacious and cleaned everymorning. When we got back to our rooms from the beautiful beach, we were greeted with a animal shaped towel. The lobby is filled with beautiful fauna and Mayan artwork. I would return in a second. If you would like more information: nyctigress@earthlink.net", "Date": "March 2, 2005"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Belvidere, IL.", "Title": "“A Hidden Gem”", "Author": "A TripAdvisor Member", "ReviewID": "UR2484010", "Content": "Our stay at the Los Itzaes was super. It is a short block walk from 5th Ave. (close enough to the main drag, but without the endless parade of people). Enjoyed the unique tropical atrium as well as the rooftop pool, which was to ourselves most of the time. (I think there are only 16 rooms). Nicely furnished, marble baths, A/C, well maintained, clean,etc. The breakfast alone (included) was worth at least US$20 at the small Bistro in the Hotel front. For about US $70, a super value. There is a good Mayan resturant a half block away, as well as the \"full parade of resturants\" on 5th Ave. Captain Bob's is also a great resturant on 5th.", "Date": "August 23, 2004"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Melbourne,Australia", "Title": "“Pleasant Stay”", "Author": "Shooshy", "ReviewID": "UR850600", "Content": "My family and I(2 adults and 3 kids)stayed at Hotel Los Itzaes for 5 nights over New Years 2002/2003.The hotel is quite well situated on 10th avenue a short walk to the restaurants and action of 5th ave. The rooms were pleasant and well furnished although our kids room did have a musty smell-a common problem in this part of the world.Our room was fresh smelling and the a/c in both rooms worked well. We did not use the tiny pool but walked the 10 mins. to the gorgeous beach.The hotel provides vouchers for the Playa Tukan beachh club where you can use the beach loungers and order drinks and food.Coming from Australia we are not used to crowded beaches but we did enjoy the\"scene\" on the beach which had a very European flavour and great people watching.The turquoise water really is beautiful and lovely to swim in. The hotel staff was friendly and helpful although sometimes there was no-one who could speak English on the front desk. Breakfast was included in the small restaurant downstairs(run by the unflappable Eduardo)and was fine,My husband particularly liked the eggs and beans. We needed a doctor at one point and the hotel speedily and efficiently organised an English speaking doctor to come to our hotel. One point to note there is no elevator in the hotel and we had a lot of luggage to drag up 3 flights of stairs.If you are in a similar position perhaps ask for a lower floor.Overall we were happy in Hotel Los Itzaes which provides good value for money.", "Date": "January 30, 2003"}], "HotelInfo": {"Name": "Los Itzaes Hotel", "HotelURL": "/ShowUserReviews-g150812-d248822-Reviews-Los_Itzaes_Hotel-Playa_del_Carmen_Yucatan_Peninsula.html", "Price": "$103 - $160*", "Address": "<address> <span rel=\"v:address\"> <span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">Avenida 10 Lote 3 Esq. 6 bis</span>, <span class=\"locality\"><span property=\"v:locality\">Playa del Carmen</span> <span property=\"v:postal-code\">77710</span></span>, <span class=\"country-name\" property=\"v:country-name\">Mexico</span> </span> </span> </address>", "HotelID": "248822", "ImgURL": "http://media-cdn.tripadvisor.com/media/ProviderThumbnails/dirs/2c/74/2c74b63492271edd9af921ae3116643f1large.jpg"}}