{"Reviews": [{"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Sleep Quality": "2", "Rooms": "2", "Location": "4"}, "AuthorLocation": "Aalst, België", "Title": "“3 stars, nothing less, nothing more”", "Author": "Bram_Snoopy", "ReviewID": "UR126995400", "Content": "Friendly staff, near the public transport. Rooms are small and a little bit old-fashioned. We were sleeping on the street side, and it was very noisy.", "Date": "March 30, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "2", "Overall": "2.0", "Value": "3", "Sleep Quality": "2", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Philadelphia, Pennsylvania", "Title": "“Nearby Discotheque kept us up all night”", "Author": "Sara S", "ReviewID": "UR126639706", "Content": "This hotel was part of a package deal booked through Gate1 travel. It's about a 10 minute walk from the train station, not too far from a metro stop, and the staff was very helpful, but other than this I didn't really enjoy the stay. My sister and mom had to switch rooms because the bathroom in their first room was smelly. We had to change rooms after the first night because there is an all-night dance club right behind the hotel. We listened to loud, drunk, noisy smokers right below our window yelling until about 5am in the morning. If you book a room here, try to get it in the front of the hotel.", "Date": "March 25, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "2.0", "Value": "4", "Sleep Quality": "2", "Rooms": "2", "Location": "2"}, "AuthorLocation": "Pretoria, Gauteng, South Africa", "Title": "“Affordable but caters mainly for tour groups and school groups”", "Author": "Darren C", "ReviewID": "UR125737379", "Content": "The Hotel is well located in terms of public transport (bus stop and tram stop right outside) but the hotel caters for groups so everything is set to accomodate them. The room was a good size but however didnt have a proper shower, also the Hotel doesnt provide you with proper towels, more like a large bed sheet to dry yourself off with. Its very noisy if you take a street facing room, lots of traffic in the moring so be prepared to be woken up very very early. Breakfast is very very basic, basically coffee(not very good despite being in Italy), juice and bread with Jam/ chocolate spread. The hotel is clean and the staff are very friendly and helpful when asking how to get around Rome using the bus and trams.", "Date": "March 7, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Moscow, Russia", "Title": "“Budget hotel not far from centre”", "Author": "frepie", "ReviewID": "UR123895485", "Content": "The hotel is quite cheap, but if you come to explore Rome, this is a good one. The metro station is just 5 minutes walk. Central railway station Termini is not far (5 minutes by tram, which stops just outside the hotel; or 15 minutes walk). Also outside the hotel (near entrance) is bus stop and you can get from there to Collosseum, Vatican, Piazza Venezia. The hotel is more or less clean, although there was a strange smell in the corridors. The food is ok, the perssonel is very helpful (you can ask them about free map or Rome, by the way).", "Date": "January 31, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Australian", "Title": "“Budgwt hotel with no extras”", "Author": "Colgeo", "ReviewID": "UR122706639", "Content": "Budget priced hotel with no frills - no minibar, no hairdryer, very old portable 12\" TV-so no CNN or BCC. A bit noisy early morning when the cleaners start. You can hear them moving furniture on floor above. Very poor breakfast. However, it is clean and close to the Colesseum and the metro. It has a nice terrace garden to sit and read, or to have a late night coffee or drink. Have to pay for WiFi and internet, both of which are restricted to the lobby.", "Date": "January 7, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "3.0", "Value": "4", "Sleep Quality": "3", "Rooms": "3", "Location": "3"}, "AuthorLocation": "El Paso", "Title": "“Affordable and adequate”", "Author": "John W", "ReviewID": "UR122147097", "Content": "The staff were very polite and helpful and the place was spotless. It was very convenient to the bus lines (use the #5 across the street to get to the Termini train station and back). Breakfast was okay -- basically coffee, juice, and eight different kinds of bread. The shower gave new meaning to low-flow (more like a heavy mist). It took awhile to rinse. They still use old-fashioned metal keys, and the only way to lock the door is with a keyed deadbolt. Thus, if you lock the door and take the key with you, anyone left in the room can't get out. We traveled together, so we didn't ask for another key -- I don't know if they have more than one to give. There was a terrific stench in our room (turned out it was a dry floor drain letting sewer gas into the room) and there was a very loud nightclub behind the hotel with drunk people screaming (really screaming!) under our window nonstop from about 2-5 a.m. The window was actually well-built enough to block the noise (mostly), but we had to leave it open to vent the sewer gas. By the third night, we finally figured it out. We poured water down the drain to block the gas and closed the window. Problem solved! Suggestions: If you choose this place, ask for a room facing the street, rather than the courtyard behind, where the nightclub is. Also, if the bathroom stinks to high heaven, use the coffeepot to pour a few pitchers of water down the floor drain to take care of it.", "Date": "December 27, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Sleep Quality": "4", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Harper Woods, Michigan", "Title": "“Staff was friendly and room was fine”", "Author": "tlc111", "ReviewID": "UR121986740", "Content": "We just got back from a trip to Rome where we stayed at this hotel. I thought the staff was quite nice, so I have not had the issues other reviewers did. They were quite helpful with the best way to get to the attractions and even offered to arrange our transportation to the airport and pack us breakfasts since we had to leave before the breakfast at the hotel started. Rooms were simple, like a college dorm room, but we don't spend a lot of time in our room when we are on a vacation like this. We left in the morning and came back around 9pm each night. The bus and the tram stops are right in front of the hotel, so that was very convenient. The tram goes straight to Termini, so you can get anywhere from there, and a bus from in front of the hotel goes to the Colosseum.", "Date": "December 22, 2011"}, {"Ratings": {"Service": "2", "Cleanliness": "1", "Overall": "3.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "2"}, "AuthorLocation": "Los Angeles, California", "Title": "“Decent restaurant on site but too many tour groups”", "Author": "Cavalry S", "ReviewID": "UR121962871", "Content": "The restaurant on site has decent food and there is a small bar in the hotel lobby. Gets very crowded and busy in the morning due to the number of tour groups. About 20 minute walk to Colosseum and a 15 minute walk to the train station. btw, there is a night club outside your window so can get noisy.", "Date": "December 21, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "2.0", "Value": "3", "Location": "1", "Rooms": "3"}, "AuthorLocation": "", "Title": "“Unpleasant area. Not close to any attraction.”", "Author": "tshah1n", "ReviewID": "UR120430716", "Content": "Not next to any metro station. Bid station right in front of hotel however limited busesstops at it. Breakfast is a joke with no variety whatsoever. Not a walking distance to any major attraction.", "Date": "November 10, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Sleep Quality": "2", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Nambucca Heads", "Title": "“Friendly, helpful staff. Best coffee next door”", "Author": "angb61", "ReviewID": "UR119843571", "Content": "Stayed with a small school tour in October. Reception staff and restaurant staff were helpful and friendly. Rooms were basic and very noisy at night due to the nightclub operating next door. Breakfast was very basic with limited choices for hungry teenagers, although dinner was quite adequate and wait staff were very friendly looking after our students with second helpings of courses. This hotel caters to large tour groups and breakfast and dinner can be quite busy and noisy. The roof top garden terrace/bar was a welcome retreat at the end of a long day. The location is a bit further from the centre than I would have liked however there is a bus stop right outside the hotel. We stumbled upon the best and cheapest coffee in Rome at the small cafe two doors up from the hotel, well frequented by locals with very friendly staff and excellent value lunches. Overall a basic hotel which served our needs.", "Date": "October 28, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "3", "Overall": "2.0", "Value": "1", "Location": "2", "Rooms": "2"}, "AuthorLocation": "Harrow, United Kingdom", "Title": "“I would say this is a poor two star”", "Author": "rikesh007", "ReviewID": "UR119581621", "Content": "I was supposed to stay at the latinum across the road. Due to an incident there, I had to stay here. The room - this was ok. The worst are the bathrooms... Disgusting. I have pictures that I will upload. Our particular shower didnt work properly... The hotel didnt fix it as it was a Saturday night they said. The towels are not normal towels, they are the wafer thin towels... I have never seen these types of towels before... Not even in one star hotels!! The air conditioning on the 5th floor was extremely poor- turned off at midnight which meant it was very very warm at night. Itried leaving the windows open but got Mosquitos in the room that bit me as a result. And worst of all was the service... All the receptionists very unhelpf and rude. They couldnt turn the ac back on and told us 'sorry nothing we can do'... Een after looking at the bites on me. The shower that was broken and was spitting water - they said they can't do anything till Monday ( it was Saturday when I had these issues). The reception seemed to be getting annoyed at why we were complaining... I assure u these were obvious complaints. You expect the shower and AC to work if the hotel advertises it has these facilities. On the second day of our stay, they moved our room. But it was for a measly 6 hours until we checked out so didn't do us much good. Breakfast - poor. Don't know why they bother serving it to be honest. The hotel has a lift which is slow abs you will find yourself waiting forever to get on it. Overall, the staff were very rude, I was supposed to stay in a much nicer hotel but ended up staying in this poor excuse for a two star (it says its a 3 star online). Rome is a lively city but it's this hotel that spoilt it for us.. Almost ruined our holiday. Just avoid this hotel.. I would advise you pay a little extra and stay closer to termini or the via del corsa which is much more central to the attractions.", "Date": "October 22, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "San Gabriel, California", "Title": "“very clean and convenient”", "Author": "Salgal77", "ReviewID": "UR119413644", "Content": "THis hotel is located not too far from the train station and is across the street from a part of the ancient Roman wall. Bus stop in front of building, local train nearby. Double paned windows cut down on noise, that others have mentioned. Front desk helpful. the room was very clean - not large, but really how much space do you need? Restaurant served nice assortment of breads, cheese, meat, cereal and yogurt for breakfast,included.. Small convenience store and good restaurant in same building as hotel, in addition to the one in the hotel (which seemed more upscale.) Would definitely recommend for convenience and cleanliness.", "Date": "October 17, 2011"}, {"Ratings": {"Location": "2", "Overall": "3.0", "Value": "1", "Service": "1", "Rooms": "2"}, "AuthorLocation": "Des Moines, Iowa", "Title": "“Looks better in the pictures”", "Author": "travelingal8784", "ReviewID": "UR118325710", "Content": "From the outside the hotel is stunning and so it the front desk area. Once you get to your room you will be very surprised. We paid way too much for this hotel and the room was tiny with 3 twin beds. It was also VERY loud. The traffic outside this hotel is crazy and if you are a sensative sleeper, this hotel is not for you. It worked out fine for us because we were not in our hotel much. I traveled with my friends from America but we met up with friends that we knew and were living in Rome while attending college. We tried to have them up to our room and the front desk wouldn't let them come up. I thought it was very rude and insane that I had just paid for a room that my friends could not join us while we got ready to go out. I will go back to Rome but avoid this hotel.", "Date": "September 19, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "3", "Overall": "4.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Cardiff, United Kingdom", "Title": "“Nice clean hotel, friendly staff, enjoyable stay”", "Author": "jtchktrvl", "ReviewID": "UR117926189", "Content": "First time to Rome so was unsure what to expect. However the hotel provided us with a good overall first experience. The majority of the staff are very polite. 2 gentlemen in particular on reception (unfortunately don't know their names) were extremely helpful. We had a slight issue with our flights being cancelled during our stay and the gentleman on reception tried his best to help us all he could. We had to change hotels due to this as they were fully booked, but otherwise we would've stayed on longer. Some staff members didn't seem to like us bothering them but this was only 1 or 2 people. The service overall couldn't really be faulted. The rooms are very clean, but small. However, this wasn't a concern to us as we only really used it to shower and sleep! When in Rome you're barely in the hotel room anyway! Room had a small television with all Italian channels so we didn't really make use of it. There is a mini bar provided, which isnt too pricey and the hotel is against you bringing in outside food and drink (pretty common in most hotels) The hotel is located a little further away but most sights are within walking distance. There are buses and trams that leave literally from right outside the hotel but we decided to walk everywhere. The colosseum was around 10 mins walk and really easy to find. The only downside to the area of the hotel is the busy intersection of road it is located. At night it was pretty noisy and traffic goes on all through the night/early morning. It didn't make it too difficult to sleep since we were always exhausted from walking around all day anyway! The beds werent too bad. We had a twin room and found them quite small and not the most comfortable. The area might seem a little off-putting to some, but it is a safe place. As 2 young girls we walked around at night looking for local restaurants etc with no bother from any one. We did not eat in the hotel restaurant except for breakfast one morning. In all honesty it wasn't worth going to. Very limited and whats there really isn't the best. We only went once and avoided it the 2nd morning. There is a nice little Italian restaurant built into the front of the hotel too. We ate here the first night. It's decent food, friendly service and relatively cheap for Rome (which we learned after finding other more pricey places!) There is also a small shop outside to buy drinks etc. Wi-fi is available at the hotel, unlimited use for 6 euros. The only downside is you have to be in the wi-fi room and cannot use it in your bedroom. However, this was still not bad considering the 2nd hotel we went to wanted 5 euros just for 1 hour. Overall this was a very nice hotel. Did not have any complaints at all but I would not return unless I couldn't find somewhere else. It's clean and has friendly helpful staff. Only downside is it is a little further out, which is not a problem if you take advantage of the public transport in the area, but since we walked everywhere we preferred a hotel closer into the city.", "Date": "September 11, 2011"}, {"Ratings": {"Cleanliness": "2", "Sleep Quality": "2", "Overall": "3.0", "Value": "3", "Service": "4"}, "AuthorLocation": "Murrells Inlet, South Carolina", "Title": "“OK Hotel, not great.”", "Author": "Scooter_014", "ReviewID": "UR117431516", "Content": "I visited Rome in August 2011, and stayed 2 night at this Hotel. It is listed as a three star hotel, but I saw it as a two-star with possibilities of a three-star. The location is safe, and directly next to bus/tram stops which will take you to most places in Rome. It is also across from the Porta Maggiore, an old Roman structure directly across from the hotel. While the location is not bad, a location more centralized would avoid a 15-20 minute ride on public trans each time you want to explore the city. The limited subway line does not stop near the hotel, so a transfer to a bus or tram at the main train station is necessary. The helpful staff at the front desk can direct you to which bus routes to take. Keep in mind that the some bus routes run limited hours, so be sure to ask how to get back if you have a late night. The room I stayed in was reminiscent of a college dorm. The TV was small, and the furniture was very bland, but useable. The bedding was adequate. While my room overlooked the street, the window was able to quieten the street noise. The room was also air-conditioned, which worked beautifully. Please note that the towels and washcloths are not the terry material, but a made of a thin material similar to a bedsheet or placemat. They work, but are different. The room I stayed in, however, was marred by an ant infestation on the second night. The floors are tile, so after returning, I saw a large number of ants on the floor. I suppose the guests before me had spilled something under the bed, which was not mopped up. As I was there for only two nights, I did not request to change rooms. The breakfast is poor at best. There were limited selections of cookies and cereal. I would suggest skipping the breakfast and going out for a much better meal. In addition to the poor selection, the staff was slow to clean tables and refresh the items, so the place was also messy. If you go when they open, you might have better luck. Or just go out for breakfast. Upon checkout, my room was charged for a meal (which I didn't purchase). I denied the charge, and the fee was waived with no questions. If you are not spending much time in the hotel, and do not mind a bit of a commute on bus/trams to get to the city, the Hotel Portamaggiore might work for you. The next time I visit Rome, however, I will search to find a more centralized location.", "Date": "August 30, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "3", "Overall": "4.0", "Value": "4", "Service": "5"}, "AuthorLocation": "toronto", "Title": "“Nice basic hotel - okay for the price - Recommended”", "Author": "rockasia", "ReviewID": "UR115750350", "Content": "The hotel is ok but dont expect much luxury, you get what you pay for. We had a room for two and paid 66 euros for two per night, which is cheap in Rome's center. The room was very clean, the service was very good (receptionists are very nice and speak french, german, english italian and maybe more). The room is medium size but the beds were less good than we expected and there was a lot of noise in the morning. The breakfast was NOT good. You can choose between croissant and... wait for it... croissant, which are both not that good. There is coffee, juices, and a few crappy cereals. Location is very nice!!! Near buses and city trains, 10 minutes of bus from Central station (termini) and 5 minutes of walk from the metro. Internet is 6 euros, or you can ask the wifi password to someone that already bought it. Pros +Cheap +Clean +Location +Size of rooms +Fast wifi internet Cons -Breakfast does not offer many choices -Beds are not exceptional -Noise in the morning", "Date": "July 25, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "1", "Overall": "3.0", "Value": "2", "Service": "2"}, "AuthorLocation": "Nicosia, Cyprus", "Title": "“THE BAHAVIOR OF THE WAITERS WASH'T GOOD AT ALL”", "Author": "2401MARINA", "ReviewID": "UR113596664", "Content": "We were a big group we stayed there for 5 nights. The location af the hotel was ok and the rooms were clean! i admit that i left a tip for that. there were 2 bad thinks. 1) the noise we couldn't sleep ! and 2) the really poor breakfast and dinner provided Certain food you have to eat no buffet. one of my friends was diabetic and the other had high pressure. everyday was pasta salat potatoes and a kind af meat in small portions without any refil!!!! salad was without tomatoes!!! only 3 diferent greens.", "Date": "June 15, 2011"}, {"Ratings": {"Cleanliness": "3", "Sleep Quality": "1", "Overall": "2.0", "Value": "2", "Service": "4"}, "AuthorLocation": "London, United Kingdom", "Title": "“Three Star hotel worth only one Star!!!”", "Author": "Joanna82_29", "ReviewID": "UR113393671", "Content": "We stayed in this hotel for a weekend brake, and need to say that whole experience spoiled our trip to Rome. Really do not know where to start: firstly only one very small lift is provided in the building and you need to wait ages to get it, once you think you so lucky because you got the lift , there's another suprise verrrry long walk to you room, feels like walking through labyrynth- so if you are elderly be prepared! Then as other people said - I have never been in hotel so noisy as this one- and I do not mean the noise of the street- walls are so thin that you can here one smoking a cigarette!!!, cleaning ladies in the hall, conversation of people cheking- out- I did not sleep very well at all. Another disappointment is a very poor breakfast- and for 90 euro per night it's probably the most expensive coffe+ pastry that I had in my life- so be rather prepared to eat out or bring your own food. Ohh and last but not least - shower is so small that you feel claustrophobic while taking one! The only two good things I can say are: rooms are very clean, and recieptionists are very helpful. As for the rest - this hotel does not deserve to have three stars!!", "Date": "June 14, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Sleep Quality": "2", "Rooms": "2", "Location": "5"}, "AuthorLocation": "Brussels", "Title": "“OK but really noisy...I mean really noisy”", "Author": "KatjeBrussels", "ReviewID": "UR107647645", "Content": "This hotel is ok and is located in a nice historical area of Rome which is well connected while being far from the havoc of the real historical centre. Most of the rooms have been refurbished; they are very clean and the staff at the reception is helpful. The main problem is the noise. There is little isolation between the rooms and you can hear absolutely everything. The doors provide hardly any barrier with what is happening in the corridors. My sleep was bothered all three nights that i was there for different reasons (people being loud in the evening or checking out very early in the morning). Breakfast looks gloomy but that's not a huge problem as you can just run outside to get proper cappuccino. If you can get a decent rate then it's ok but don't go spending more than 150 € on this place as you can really get better stuff in Rome.", "Date": "May 10, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "cornwall", "Title": "“Ideally situated out of \"Busy Rome\"”", "Author": "happyfaceCornwall", "ReviewID": "UR107230529", "Content": "We took a short break to Rome to do the \"Historical Sights\" and didn't want to stay right in the centre. We found this hotel on the net and was pleasently surprised, as you (don't know till you get there) The hotel for a 3 star was very clean and quite sumptuous inside, the resturant was big and the food delicious and reasonably priced. We went B & B and actually only ate outside for one night as it was so good. The rooms were adequate and clean, the beds were changed every day. The downside was it is quite busy in Porta Maggiore as it is on a main route to Rome Train Station, but this didn't put us off, as there were double glazed windows in every room, and as we walked miles every day sleeping was no problem. We were 3km outside the city but the buses (No. 3) went from outside the hotel every 10 mins to the centre. Also to get to the Vatican City you caught the bus outside the hotel too- what a service!! I would recommend this hotel to anyone taking a short break to Rome, and if we ever went back would deffinately stay here again.", "Date": "May 7, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "3", "Overall": "1.0", "Value": "2", "Sleep Quality": "1", "Rooms": "1", "Location": "1"}, "AuthorLocation": "NJ", "Title": "“Do not stay at this hotel!”", "Author": "dedwards424", "ReviewID": "UR98222921", "Content": "This hotel was awful. After an overnight flight from JFK we arrived at this hotel around 11a.m. very tired. They said there were no rooms ready for us untill 1p.m. and would not even consider checking us in early. We had to sit in the lobby for 2 hrs. before we could get to our room to freshen up. Then they wanted to keep our passports for guarentee! We got them back with a little fuss. We should of turned around right there and left because it just got worse. Our room was very small and very noisy! The bed was very hard and all I could hear all night were sirens and trucks. I guess there were rooms on the other side of the hotel, but if you travel with a travel agency, (such as Gate 1) they give you the worst rooms. Then don't even think about asking these people a question! They act as if you are really bothering them, and sometimes won't even look up! I highly reccommend another hotel! Do Not Do Not stay here.", "Date": "February 27, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "3.0", "Value": "5", "Sleep Quality": "1", "Rooms": "5", "Location": "2"}, "AuthorLocation": "Stockholm", "Title": "“If it is your first time in Rome this is not the hotel for you”", "Author": "laststation45", "ReviewID": "UR89423470", "Content": "Rooms are OK, Towels are fine, the note \"Do not disterb\" is in the hotel file on the table. The only thing is that you hear everybody in the corridor as if they are talking to you in your room - was not a great experience. And we found ourselves walking by Colliseum many many times during our 3 days stay in Rome. So only if you really fond of Colleseum or not a walking type than this hotel is fine. Coffee in the mashines is good - I find it as soon as you cross Swedish border the quality of coffee increases drastically:) Breakfast is ok - something sweet and a coffee. Deffinatly will come back to Rome, but will avoid this hotel!", "Date": "December 9, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "3", "Overall": "1.0", "Value": "4", "Sleep Quality": "1", "Rooms": "1", "Location": "1"}, "AuthorLocation": "New York City, New York", "Title": "“Very disappointed..i do not reccommend”", "Author": "zs29", "ReviewID": "UR88888427", "Content": "I made the mistake of not checking reviews before booking thru Gate 1 and was terribly disappointed with this hotel. Location-not near anything and about an 8 minute walk from metro. Rooms are decorated probably like a hostel..or worse. Walls are paper thin and you hear just about everything. Cleaning ladies like to start really early and make a rediculous amount of noise..in addition they let themselves in freely into the room without much notice and before 9am(there are no \"do not disturb\"signs to put outside. Breakfast served was the worst I have ever experienced/tasted(a few sweet croissants and rolls). Front desk staff was very accommodating and helpful. Oh and towels were more like dish towels..just awful.", "Date": "December 2, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Stoke-on-Trent, United Kingdom", "Title": "“Nothing up with this hotel”", "Author": "Gungho_ED", "ReviewID": "UR87914695", "Content": "I recently stayed at this hotel and it was fine. The rooms and hotel in general were very clean...cleaned every day in fact. Everywhere in Rome is the same so why people are moaning the rooms are small is beyond me. Its to sleep in not live in. Any tram or bus outside takes you to Termini. From this place just ask at the info booths which bus or tram takes you to where you want to go. Thats all you need to know about Rome. The rest is the fun bit working it out. The guy name Richardo who works in the bar is a knoledgeable chap. Whatever your looking for he'll point you in the right direction. Right by the hotel literally 5 minutes walk away is the student area where theres a uni. This is the only place in Rome we found,with what you would actually call pubs/bars. The rest are cafes selling pizza and beer. No good for getting hammered in! The whole of Rome is a complete rip off though. Its minimum 10 euros for a couple of pints and if you like as many pints as i do on holiday, well you best take plenty of wedge.", "Date": "November 22, 2010"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Overall": "3.0", "Value": "2", "Sleep Quality": "3", "Rooms": "3", "Location": "2"}, "AuthorLocation": "São Paulo", "Title": "“Average - Old hotel, bad breakfast but fair location”", "Author": "gmiura", "ReviewID": "UR79078485", "Content": "The hotel is old and the rooms are just ok. The breakfast is bad. There was only a croissant, some cereals, milk, coffe and machine juice... The service is not impressive and the receptionist will not do anything to make you feel welcome in your vacations. The location is fair, there is a bus station right in front of the hotel and the Manzoni Metro station is 4 blocks away (10 min walking) but there is really not much to see around there, so you will have to take a bus/metro/taxi to go to restaurants, coffe shops and other tourist places . I think it does not worth the price for this 3 stars hotel since you can get similar hotels in better locations for the same price. Looking around, most of the budget or 3 stars hotels seems to be old so, next time I will choose a better hotel in a great location even if I have to pay more for that.", "Date": "September 11, 2010"}, {"Ratings": {"Service": "2", "Cleanliness": "2", "Overall": "2.0", "Value": "2", "Sleep Quality": "2", "Rooms": "2", "Location": "2"}, "AuthorLocation": "Fort Lauderdale, FL", "Title": "“Left a bad impressin of Rome.”", "Author": "Kay954", "ReviewID": "UR78691134", "Content": "My husband and I stayed here for our honeymoon in June. Just outside the hotel is a very busy intersection. Upon entering, the lobby area looke decent. The staff was not friendly but not rude. The room we were given had 2 twins (on our HONEYMOON) and they said they'd give us a different room but never did. The room smelt like sewage and wasn't very clean. The hallways were dirty and under construction but not kept neat. My standards were not very high but this was a great dissappointment. It left us a sour taste in our mouth as Rome was the last stop on our honeymoon. We had great experiences in Venice and Florence.", "Date": "September 7, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "England", "Title": "“best value we have found in central Rome”", "Author": "jcn1", "ReviewID": "UR74051049", "Content": "We stayed with a large group and this was the best in 8 visits on our budget- nice public rooms, helpful staff, reasonable food and , best of all, a huge roof terrace and bar which ment easy and pleasant evenings", "Date": "August 6, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "2", "Overall": "2.0", "Value": "3", "Sleep Quality": "3", "Rooms": "2", "Location": "3"}, "AuthorLocation": "Bristol, United Kingdom", "Title": "“just below average”", "Author": "jmohide", "ReviewID": "UR73494757", "Content": "The hotel is a 20 minute walk from the main train station and about a 10 minute walk from the nearest metro station. Upon arrival, we were disappointed with the room and after talking with reception, were offered a choice of 2 others, one of which we took. Rooms could best be described as antiquated, very basic but provide what is needed. The bathroom on the other hand left a lot to be desired and the cleanliness of the shower was very poor and a particular downside. Breakfast wasn't great either, nothing fresh on offer got rather repetitive. Although the hotel is slightly off the beaten track with regard to the main attractions (30 minute walk to the Colosseum) it allows you to get some descent food rather than just eating at 'tourist traps.' Had some really nice meals at small local places that otherwise would never had ventured to. Not great but am sure there are far worse!", "Date": "August 2, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "3", "Overall": "1.0", "Value": "2", "Sleep Quality": "1", "Rooms": "1", "Location": "2"}, "AuthorLocation": "st.louis, mo", "Title": "“Watch your belongings”", "Author": "krishnasaha", "ReviewID": "UR67796042", "Content": "Our family went to visit Italy this past May, 2010. Rome was our last leg of the travel. This hotel we stayed in for two days. Room ws hot, we asked for the air conditioner and we were told that they don't give air conditioners till month of June. Then we asked for a fan and we were told they don't have any, while I showed they do have one in the hosuekeeping room and no one is using that in the night, still they wouldn't give the fan. They ask us to open the window and the windows had no bars. When we opened the window there were music and loud noises from bar all through out the night. None of us could get a night sleep and to top this I by mistake left our new digital camera on the table and when we return the camera was gone. We complained to the front desk and we were told no it couldn't have happened in the hotel and would not do anything. We requested repeatedly to call the housekeeping lady who cleaned our room and they refused. They absolutely did nothing and we returned home without our camera. Never again will I stay in this hotel or recommend any one to stay here. If you still want to stay here for whatever reason watch your belongings. They will disappear unless you put them under lock and key.", "Date": "June 17, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "2.0", "Value": "1", "Location": "2", "Rooms": "1"}, "AuthorLocation": "", "Title": "“Beware the letter numbered rooms”", "Author": "Aqntbghd", "ReviewID": "UR65173237", "Content": "We were in a room named 1C but it wasn't on the first floor we had to walk thru the whole hotel and then climb one more floor to a separate part of the hotel. A bit noisy, clean and expensive hence the overall note. The breakfast was more like a tourist factorythan a typical Italian breakfast.", "Date": "May 24, 2010"}, {"Ratings": {"Service": "2", "Cleanliness": "1", "Overall": "1.0", "Value": "2", "Sleep Quality": "1", "Rooms": "1", "Location": "2"}, "AuthorLocation": "Rio de Janeiro", "Title": "“Very poor hotel!!!”", "Author": "pinkgisa", "ReviewID": "UR64033948", "Content": "I went to PortaMaggiore last week (May, 8, 2010) and stayed there for 4 nights. I can say that I know a few hotels in Europe and this one isn´t good. The room they´ve put me was horrible, I didn´t have place to stay there with my family and the luggage. Then, I asked at the reception if I could change to another room and they´ve put me in another one which was bigger but very, very noisy. I slept only with earplugs! The hotel isn´t clean, we could see that the furniture wasn´t clean. The bathroom had a leak! And there are no curtains at the box, so the bathroom´s floor gets wet when a person takes a shower. The location isn´t good either, we had to walk 15 minutes to get to the metro station and it´s not near the historical center of Rome. If u get a cab, it will cost 8 euros. The Coliseum is about 20, 25 minutes from Portamaggiore. I really don´t recomend this hotel, I´ve seen others near and they seemed better (like Mercure).", "Date": "May 13, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "4", "Sleep Quality": "3", "Rooms": "3", "Location": "2"}, "AuthorLocation": "San Diego, CA", "Title": "“Good Value hotel”", "Author": "SDTravelot_03", "ReviewID": "UR57812269", "Content": "This was my first trip to Rome from the states and my stay at the Portamaggiore was comfortable. It's an average hotel, but a good value. It's in an ok part of town, there is a bus that stops out front to take you to the train station. The only thing I didn't care for much about this hotel was the bathroom. The towels weren't made of terry cloth, they were more like dish towels and the shower was in the middle of the room so every time we took a shower it flooded the bathroom. Nothing too horrible to deal with, but not optimal either. Overall, was a good value hotel, decent transportation options.", "Date": "March 5, 2010"}, {"Ratings": {"Service": "2", "Cleanliness": "4", "Overall": "2.0", "Value": "1", "Location": "1", "Rooms": "2"}, "AuthorLocation": "Stockholm", "Title": "“Don't stay here...”", "Author": "Tjongo", "ReviewID": "UR49941751", "Content": "...unless you don't care about location, traffic noice, poor breakfast. The traffic outside the hotel is so loud and there is absolutely no sound isolation in the room. It feels as if you're sleeping in the middle of the square. There's a hospital nearby; we heard the sirens from the ambulances all the time. The breakfast was really poor, even the coffee was disgusting. The location, well, if you're going to Rome to see Rome, choose a hotel closer to the center. We had to walk quite some distance to get to the nearest metro station or bus stop for the buses to the center. This area isn't really walking-friendly. We were a group of 28 on a conference, but the facilities we had booked were not as described. The internet worked only in the reception and conference room. Would absolutely not stay there again.", "Date": "November 24, 2009"}, {"Ratings": {"Service": "1", "Cleanliness": "3", "Overall": "2.0", "Value": "3", "Location": "3", "Rooms": "3"}, "AuthorLocation": "Dublin and Italy", "Title": "“Really not professional”", "Author": "Sardirish", "ReviewID": "UR39739895", "Content": "I stay there for one night: the bathroom had no carpet and after a shower (there were no curtains) the floor get flooded easily. The hairdryer left a piece in my hand and wasn’t powerful. The room overlooked the square and I must say that it is very noisy day and night, I suggest getting earplugs. There is only one small elevator for 6 floors and long waiting, so if you don’t have luggage (impossible in an hotel!) is better to use the stairs: I haven’t seen any access/facilities for disabled). The cleaning staff stationed in front of the elevator talking loud and making comments about who passed and how many rooms they had to clean that day. For breakfast there are vending machines that distribute, among other things (I asked for a soya cappuccino, is not possible) fruit juice made with artificial powder and not with the fruit and taste very bad. The staff does not help people to understand how the “breakfast procedures” works or where to find what they need (I saw people searching around for a knife or teaspoon), the croissants were not fresh and you had also to wait just to have a cleaned cup. Absolutely unprofessional and, as Italian, I realize all those things gave a bad image to the tourists. Not recommended!", "Date": "September 4, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "2", "Overall": "2.0", "Value": "2", "Location": "3", "Rooms": "1"}, "AuthorLocation": "Athens", "Title": "“Definitely not a 3star hotel! Not suitable for people with disabilities!”", "Author": "bruto_gr", "ReviewID": "UR38032294", "Content": "As part of a group, my friend and I realised that we were given a far worse room than other participants. The twin room was too small; it barely fitted the two single beds! There was not enough space to put the 2nd luggage! A/C was not functioning. The minibar refridgerator was more like a cupboard (room temperature)! When we opened it, it was completely empty and there was this rude notification instead: \" If you require something, ask the reception and we will CONSIDER serving you!\" For God's sake, if I wish to drink some water, they would think about it? The room and bathroom were quite clean, but the shower was like a dark phone booth. There is a rule that encourages us to throw the towels on the floor, in case we wanted them to be changed. When we tried that, we realised that the cleaning lady just took them from the floor and hanged them again, dirty as they were!!!! I am embarashed to admit that in a period of six nights, the towels were changed once! In addition, the elevator was in the mid-floor and we had to carry our luggage. After noon the elevator was not operating. On the check out, I had to use the stairs from 3rd floor carrying my 20kgs baggage.", "Date": "August 18, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "3.0", "Value": "4", "Location": "3", "Rooms": "5"}, "AuthorLocation": "San Antonio, Texas", "Title": "“Decent Stay”", "Author": "gutierrez2002", "ReviewID": "UR37887042", "Content": "Rome was my last stop in a 2 week, 4 city vacation in europe and at first it didnt look like much. But the hotel room was very nice, the staff was not too helpful at first but once they get to know you they are a lot better. The terrace bar is pretty nice, also there is this little pizzeria almost next door that is very good. The bus stops right in front of the hotel and it takes 5 minutes to get to the Colosseo. Also, you can take a 15 minute walk to the Termini and catch the metro line A to most main attractions. If you happen to be out late, a lot of the buses stop at the Termini and all you have to do is take a little hike to the hotel, there is some grafitti around but the neighborhood is very safe. Good location, but will choose a closer one next time.", "Date": "August 17, 2009"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Overall": "2.0", "Value": "2", "Location": "2", "Rooms": "1"}, "AuthorLocation": "Hertfordshire", "Title": "“BELOW AVERAGE & NOT AS EXPECTED”", "Author": "Rossi59", "ReviewID": "UR34211839", "Content": "My Husband, Son & I stayed at Hotel Portamaggiore in June 2009. We checked the reviews before going and thought that the pictures on their web site looked very nice. They were taken from the best angles!! The rooms are very small and basic, Air conditioning poor, smell from drainage in bathroom left a bad smell in the room when it was shut up all day and was not very pleasant. No wardrobe space for a room with 3 people in it and only 5 hangers to hang our clothes. The hair dryer did not work and the shower is only a hand held one. No Tea /Coffee making facilities in the rooms. Our room was at the end of a long corridor and overlooked the roof terrace shown on web site photo. However, when you looked down out of the window the view was of a dirty scruffy yard and the noise from either staff or local people throughout the night was dreadful. We had to shut the windows to allow us to get any sleep and the room was very hot and stuffy as a result. The hotel was on a very busy street and traffic is constant. The trams stop opposite the hotel and this is the best way of getting around as it certainly was not in a great position and there was nothing immediately around the hotel. Tram number 5 or 14 takes you to the Termini, where you can get transport to where ever you need to go, all transport is very frequent and we never waited too long to get anywhere. We arrived early on the first day due to flight times and couldn't even get a coffee. The hotel bar does not open in the summer (only throughout the winter months) and the Roof terrace does not open its bar until 4pm. There was no food available at this bar. The snack/drink vending machines in the hotel were very expensive. Breakfast was nothing special...... pastries, processed ham & cheese, rolls (sometimes stale) and machines for coffee, hot water or juices. Some of the staff was more approachable than others and we were left feeling a bit of an inconvenience to them at times if we had a question or query. There was one incident where a group of school students, staying at the hotel were being noisy, banging around and moving furniture, yelling out of the windows late at night and the member of staff at the reception desk did sort it our when we complained. I certainly would not stay there again or recommend this hotel and feel there is a real need for improvement in both facilities and staff attitude toward paying guests!! Not good value for money! Tip: When Looking for a hotel .... Stars do not necessarilty mean quality, in Italy they mean the number of facilities the hotel may offer or its proximity or ease of transport etc.", "Date": "July 8, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Business service (e.g., internet access)": "3", "Check in / front desk": "3", "Overall": "5.0", "Value": "5", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Mumbai", "Title": "“Friendly”", "Author": "govinda1", "ReviewID": "UR32262825", "Content": "Good budget hotel with all the required amenities.The hotel employees are friendly and helpful. The Rooms are slightly cramped - but they're clean. Food is good .The location is also very convenient - bus/ tram stops just next to the Hotel. Its not far from the colleseum and the vatican.", "Date": "June 13, 2009"}, {"Ratings": {"Service": "2", "Cleanliness": "4", "Overall": "3.0", "Value": "1", "Location": "1", "Rooms": "1"}, "AuthorLocation": "Ohio", "Title": "“Tolerable but would not stay again.”", "Author": "GOND08", "ReviewID": "UR27093270", "Content": "My friends and I stayed in the hotel for 7 days in late March 2009. I read the reviews and looked at the pictures. Hotel Portamaggiore was average. I think the price is a bit high for the hotel. The one plus......The hotel was extremely clean. The location was ok but it would have been better if we were closer to a major piazza. There are two restaurants close to the hotel but everything else requires a long walk/taxi or bus. The bus stop is in front of the hotel which was nice. The rooms were basic, basic basic and not what was shown in the pictures. There were no drapes, no pictures on the wall no amenties such as iron, clock, radio. The beds were somewhat comfortable but one of them you could see was very saggy and had springs popping up. The biggest complaint was the noise. The hotel has tile everything so you hear every person walking down the halls at all hours. The cleaning staff starts very early (6 AM) and is very loud. There were a lot of slamming doors and loud carts rolling up and down the hall. The hotel also seems to book a lot of school groups. The kids are very loud. The last morning we were woke up at 4 AM by screaming neighbors. The staff was friendly but non-responsive to complaints about the noise or taxi trouble. They also failed to give us wake up calls as requested. Overall Hotel Portamaggiore was tolerable but I would not stay again.", "Date": "March 30, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Austin, Texas", "Title": "“Another great find from Gate 1 Travel!”", "Author": "AustinGirl500", "ReviewID": "UR25863508", "Content": "I was worried about this hotel after reading some of the reviews on here, but I should have trusted Gate 1 Travel because they've never steered me wrong before. Hotel Portamaggiore was perfect for our trip. The rooms were nice and clean, the breakfast was good and the location was convenient, only a short walk to the Metro. We had a great meal at the nearby Taverna St. Angela near the Manzoni Metro stop. If you're coming from the airport, just take the Leonardo Express to Termini and then hop on the A line to Manzoni and you're only a few blocks from the hotel. If you have time, take a walk through the impressive historic ruins of Portamaggiore just across from the hotel.", "Date": "March 9, 2009"}, {"Ratings": {"Cleanliness": "3", "Overall": "4.0", "Rooms": "4", "Service": "4"}, "AuthorLocation": "Tel Aviv", "Title": "“good hotel”", "Author": "sunflowerTelAviv", "ReviewID": "UR19597851", "Content": "my boyfriend and I (we are ~25) travelled to rome for a week and stayed in hotel Portamaggiore in rome. this is a very good hotel in our opnion . It is very close to a lot of bus stops & tramp stops that get you to the center in a ~10 min ride (lines 571,3). it's is also easliy accesible from the termini by bus (line 105). the breakfest is O.K. don't expect much but there is a nice pizza place right out side of the hotel and also a supermarket near by. the staff was very nice and hlepfull with everything we asked or needed. i'll mark cleaness as 8.5 out of ten. the price was good - we flow in the end of august. bottom line i will recommend this hotel to our friends and family. *P.S Thank you Antonio for your help and the lovely room. & sorry for any spelling mistakes.", "Date": "September 1, 2008"}, {"Ratings": {"Overall": "1.0"}, "AuthorLocation": "ireland", "Title": "“Disappointing”", "Author": "carrick101", "ReviewID": "UR14532456", "Content": "My boyfriend and I travelled to Rome for a romantic weekend and can only say that the Hotel Portamaggiore was huge let down on what should have been a fantastic weekend. The location on the hotels website is totally inaccurate with the city centre only reachable by an irregular bus service from outside the hotel or bu metro with the closest station a 15 min walk away. The staff were extremely unfriendly upon check in and got even worse as the trip went on. To say the rooms are basic is being more than kind. Our double room consisted of two below average size single matresses on a spring base, these were so ufncomfortable we had to try and sleep with the matresses on the ground! The noise of cleaning staff was deafening each morning not to mention the traffic outside! A truly disappointing hotel.", "Date": "March 25, 2008"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Check in / front desk": "3", "Overall": "4.0", "Value": "5", "Rooms": "3", "Location": "5"}, "AuthorLocation": "tennessee", "Title": "“Very Good”", "Author": "TennesseeLuv2travel", "ReviewID": "UR13686475", "Content": "I was concerned after reading some of the reviews here, but my concerns proved to be unfounded. we had a double and a single. Both were exceptionally clean, the double had a bath tub which was gerat for soaking feet after a long day of walking around. The hotel is super close to the major bus routes and are easy to navigate. The front desk staff was brusque, extremely brusque in one case, I finally made my companion ask him the questions. The woman who worked the front desk was much friendlier but both answered questions when asked and the woman was willing to make a call for us to change a tour. The continental breakfast did leave a lot to be desired, but it was protein and carbs and sugar in the drinks so it certainly is all you'll need ot start your day sightseeing. If you enjoy a lingering breakfast with great food and atmospshere make sure to eat somewhere else. In all I would not hesitate to recommend this hotel to my closest friends.", "Date": "February 19, 2008"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Check in / front desk": "3", "Overall": "3.0", "Value": "3", "Rooms": "2", "Location": "4"}, "AuthorLocation": "San Jose, California", "Title": "“Decent Hotel -- good value”", "Author": "thebeerhunter", "ReviewID": "UR13661434", "Content": "We stayed at this hotel for 3 nights in January 2008. A couple of big pluses for the hotel are its proximity to the Termini (you can walk if you don't have a lot of luggage) and also it's proximity to the colosseum, etc - a nice 20 minute walk away. As other posters have noted, the insulation in this hotel isn't great, so if you're a light sleeper you won't be able to get much rest. Because of the bus depot and tram stops right outside there's lots of traffic at pretty much all hours of the night. Starting at about 7:30AM housekeeping will start making the rounds, and they're pretty loud, too. We were in a room overlooking the piazza (we had a balcony, which was great!) so we got the brunt of the street racket. But we did find that sleeping with earplugs made a big difference. The breakfast spread is pretty lacking. If you've been to Europe before you know to expect cheese, breads, yogurt, etc. but here the rolls were really pretty stale and the coffee I found to taste burnt. We also had the unfortunate timing of staying there at the same time as an Italian school trip, so there were gaggles of kids everywhere making messes all over the breakfast room. The room was also very small. It basically fit our 2 single beds, a small desk, and nothing else. Still, the value and the location completely made up for these shortcomings, and we would consider staying here again upon a return trip to Rome.", "Date": "February 18, 2008"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Check in / front desk": "3", "Overall": "2.0", "Value": "2", "Rooms": "2", "Location": "1"}, "AuthorLocation": "Calgary, Canada", "Title": "“Adequate, bad location, nice terrace bar.”", "Author": "Beerboy", "ReviewID": "UR8473179", "Content": "Booked into this hotel with our tour group. The hotel is clean, decent, and looks nice but we felt there were some problems. Noise: The hotel is located on a major traffic area (circle) which led to a lot of noise. We had to sleep with the window closed a lot of the time which led to stuffiness and humidity in the room. Bathroom: The bathroom in our room smelt very very much like mold and we could see a lot of it growing on the tiles and the ceiling. I don't think it was the healthiest of places to be in. Location: Near the train station, it isn't the safest place to be. We didn't do much walking around at night. As one of the nicest things to do in Rome is walk around at night, shop, have a gelato, etc. it was disappointing to be in an area and at a hotel that did not offer any of this. On the plus side, the hotel is fairly close to a major church called San Giovanni in Laterano but don't try to visit at night. Pros: We did enjoy the beautiful terrace garden and bar on top of the hotel. It was very nice. Breakfasts: Nothing special here. The usual Italian hotel breakfasts of commercial ham and cheese, pastry, and machine made coffee. Try going outside to the bar/cafe near the hotel. For under a Euro you get a cappuccino to die for. Restaurants: There is a very good restaurant near the hotel called the La Pecora Pazza. The guys running the restaurant are funny and serve up some great dishes. All in all, I'm sure you can save a few bucks staying here but I don't think it is worth it paying to stay in this area. You'll end catching taxis all the time, especially at night.", "Date": "August 22, 2007"}, {"Ratings": {"Service": "1", "Cleanliness": "2", "Business service (e.g., internet access)": "1", "Check in / front desk": "1", "Overall": "1.0", "Value": "1", "Rooms": "1", "Location": "1"}, "AuthorLocation": "Ohio", "Title": "“Do not stay here”", "Author": "kismetkiss", "ReviewID": "UR8362699", "Content": "I stayed here with my study abroad group for only one night, and it was one of the most depressing nights I've had ever. Seriously, this place is a hole. The bedrooms are abysmal, dark, and depressing. The bathrooms are disgusting. Of all the places I stayed in Italy, this was by far the worse. Not to mention it is in a bad part of town. Not close to anything in central Rome, and admittedly could be dangerous as we were told by locals. Our move to our Roman apartments were a welcome relief! Also, the staff was not helpful and rude.", "Date": "August 6, 2007"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Check in / front desk": "3", "Overall": "2.0", "Value": "3", "Rooms": "2", "Location": "2"}, "AuthorLocation": "Belleville, IL", "Title": "“Was an ok experience”", "Author": "dk0311usmc", "ReviewID": "UR8063749", "Content": "Recently stayed at the hotel on my honeymoon booked through Gate 1 Travel as part of a Venice, Florence, Rome package. Im not sure if its the \"norm\" there or not, but there was a mass group of College students staying at the hotel on a big college group trip. I think it was a couple different schools there at once actually. The day we checked in I thought there was a line out the door to check in because there were hoards of kids with their luggage, in the lobby and streaming out the front door, I couldn't get in so I stood in line. After a minute or two I asked if this was the line to check in, and they said no, so they had to pass the word up to everyone to part the red sea and let us through to the counter. The room was small but efficient. Luckily when I was checking in I told them that I was on my honeymoon and hoped for a nice room. (I heard some rooms are nicer than others there, for the same price, maybe on different floors) then they told me they gave me a good room. Thank God we weren't on the same floor as the massive group of college kids because the hallways are all solid and tile on the floor, which works like an amphitheater for sound traveling down the hall, so it can get pretty noisy in the rooms. My wife likes sleeping with the TV on anyway, so we kept the TV on at night and that helped drowned out the noises that could possibly keep us up in the halls at night and in the mornings. The breakfast seemed pretty typical to what I had experienced in my previous hotels in Italy, nothing grand but it does the job. Again with the college kids staying at the hotel it seemed like most of the time when we went to and from our room, there was a big group of them hanging out right in the lobby. It almost seemed like 85% of the people staying in the hotel while I was there was with a college group. The front desk was helpfull with my questions, but a few of them didn't seem very excited to help, kinda like it was a chore. The 571 Bus stop is right in front of the hotel and takes you around to some of the touristy places, but don't try and take it on sunday or you will stand out there for 45 minutes like we did, and find that it doesn't run on sundays. The underground metro is a few blocks around the corner and goes to most touristy places or is within a reasonable walk to them. The little pizza shop next to the hotel right after the internet cafe, has very reasonable prices and has good pizza for something quick and good. So all and all, check to see if there are cleaner nicer rooms available for the same price when you check in. If you can tolerate it, I would leave the TV on at night to help the hall way noise. My room was on the other side of the piazza, so I didn't hear much traffic noises.", "Date": "July 5, 2007"}, {"Ratings": {"Overall": "2.0"}, "AuthorLocation": "Princeton, Illinois", "Title": "“A different experience”", "Author": "Alexa19702", "ReviewID": "UR6911771", "Content": "The hotel is not near the most touristic places but there is transportation in front of the hotel. Our room was on a 3rd floor on the main avenue side, which it make it noisy to sleep. The thermostat seemed to not be working since the room was always very warm, therefore we need to open the windows and at that time the pollution came into the room, It was not comfortable to sleep under those conditions but we managed, A good advise if you stay here is \"bring your own towel\" they use sort of big linen cloths what they call \"towels\" they do not dry very efficiently. the customer service was good as well as the food. Mike Anderson", "Date": "March 4, 2007"}, {"Ratings": {"Overall": "1.0"}, "AuthorLocation": "Chicago, Illinois", "Title": "“Previous review too generous”", "Author": "naomh", "ReviewID": "UR6797725", "Content": "I had read the reviews posted on this site after I had booked and after it was too late to change (Gate 1 Travel policy that stinks). I stayed there. The review that says that the hotel staff are not friendly is too kind. I would say the attitude is close to HOSTILE. Otherwise, the other reviews are correct - very noisy, too far to walk to major sites, poor breakfast, no Sambuka in the bar (my addition), wrong directions with respect to bus travel, etc. You are better off paying a little extra (or perhaps same/less amount) and staying elsewhere - close to Metro stop is one suggestion.", "Date": "February 15, 2007"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Bedfordshire", "Title": "“No complaints at all”", "Author": "CaptainBedfordshire", "ReviewID": "UR6715590", "Content": "A group of twenty two of us have just returned from a three night stay at the Pota Maggiore Hotel. Some reviews I had read were a bit worrying but my fears were unfounded. The reception, bar and lounge are smart,comfortable and inviting. The dining room large and lacking a little in atmosphere. Our bedroom on the third floor had a balcony and overlooked gardens and courtyards at the rear, it was not large but was adequate and clean with comfortable beds and was quiet. There was a safe and more than enough heating capacity for us. The bathroom was fine with a shower but no bath. The shower did tend to leave puddles on the floor but these drained into the drain in the floor with no problems. There was a hairdryer. Breakfast is a bit basic but perfectly adequate and the staff were friendly. I felt that we had excellent value for what we paid for our stay. Whilst not in the centre of Rome most attractions are within walking distance and the transport system is fine for those that are further away or if you want to rest weary legs. I have no hesitation in recomending this as an excellent value for money hotel. Mike Birdseye", "Date": "January 30, 2007"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Check in / front desk": "3", "Overall": "4.0", "Value": "4", "Rooms": "2", "Location": "3"}, "AuthorLocation": "Barnet", "Title": "“Splendid for a short breAK”", "Author": "JoyBarnet", "ReviewID": "UR6712657", "Content": "Just got back from a three night stay in the Porta Maggiore in Rome. This hotel I think is perfect for a short break 3 or 4 nights but not longer. We were in a room at the front of the hotel and for many people, especially if you are a light sleeper the noise from outside could be a problem. I am a very heavy sleeper but even so the traffic noise woke me at about 2am on the Saturday night. I understand the rooms at the back of the hotel are quieter. We were on the third floor and quite a way from the reception area which was not too much of a problem although the lift does seem to be old and possibly on its last legs. The room was very small as was the en-suite shower but for such a short stay I was not too bothered. I have to say when we arrived and let ourselves into the room it was stiflingly hot and very \"smelly\". However, we opened the window and turned off the \"fan\" and within an hour or so it was fine. The room was kept very clean although the bed was two singles pushed together with a double sheet over the top and thus a gap presented itself in the middle. We only stayed here on a bed and breakfast basis and I must say the breakfast was awful. All drinks i.e., coffee, juice, water etc., is from \"serve yourself machines\". The coffee was like mud. The food offered was not much better, cereal in tiny tiny bowls, hard bread, rolls and croissants and some tired looking processed ham and cheese. Needless to say we opted for the small \"very italian\" coffee shop next door where the cappucino was lovely, there was a great selection of mouth watering pastries and sandwiches and when I asked for an orange juice, two fresh oranges were squeezed right in front of me. Coffee, juice and a pastry for 2 came to around 6 euros. The hotel is approximately a 20 minute walk to the colosseum and the same to Termini station. Buses are available although we walked everywhere. Neither of the restaurants in the hotel looked up to much so we opted to find our own restaurants which were brilliant. For a short trip the Open Top \"hop on hop off\" tour buses are great and enable you to see everything and then possibly go back to look in more detail at anything that takes your fancy. The bar area in the hotel is very pleasant and not overly expensive. Most of the staff are extremely pleasant and helpful but there were a couple of exceptions, two particular reception individuals being quite surly and disdainful. We virtually saw everything we wanted to and although I would go back to Rome as I found it absolutely beautiful and beathtaking, this would not be for a few years. I would however consider staying in this hotel again. Joy Peck", "Date": "January 29, 2007"}, {"Ratings": {"Overall": "2.0"}, "AuthorLocation": "Kennesaw, Georgia", "Title": "“Clean but No Sleep”", "Author": "SouthernGeorgiaPeach", "ReviewID": "UR6616003", "Content": "I can say that the place is clean. There is a bus stop out front of the place, and metro is just a few walks down the street. And there is a good place to eat just a few doors down. And be sure to take an electrial replacement for your hair dryer, electric razor as if you do not, you will be out of luck. We were there for 3 nights and I was glad to get back home to get some sleep. The beds are not comfortable, you would hear everyone walking down the hallways, and even the people next store to you taking a bath. And the noise from the outside, could hear all sirens, buses, and cars. And the food was not good, and the waiters did not have good attitudes at all. Some of the front desk personnel were not friendly at all. And when we got there, the first night, there is such a smell inside the room. It will take your breathe away. We had to turn the heat off, open the windows and prayed the smell would disappear. If I go back which I know I will see Rome again, I Will Not Stay Here.", "Date": "January 18, 2007"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Business service (e.g., internet access)": "2", "Check in / front desk": "3", "Overall": "3.0", "Value": "3", "Rooms": "3", "Location": "1"}, "AuthorLocation": "California, USA", "Title": "“The hotel was good, but the location was bad...”", "Author": "prettyladylala", "ReviewID": "UR6475345", "Content": "We stayed at the hotel, which was located in Piazza Porta Maggiore, for five days. The hotel was clean and cozy, but old. The beds had hard matresses, but were twin size. The room was warm which was great, since the weather was cold. The room would steam up when you would shower. The bathroom was also old, but pretty clean. The showers were wither small or large tubs with warm water. The bathroom was pretty spacious. The staff was friendly and professional, but not very helpful. The breakfast was good. It consisted of cereal, pastries, juices, coffee, meats, and cheese. Enough of the hotel itself, I want to talk about the location. The location of the hotel was far from the city centre. We had to take the tube and two buses to get back to the hotel from the tourist areas. The hotel is not in a safe area. I was not comfortable with walking at night in the area. During the day, the area was nnot too bad, but be careful with your belongings. A couple was robbed infront of the hotel while we were there. Info only, you could take the 571 or 3 bus from the colosseum area to get back to the hotel. There are not many restaurants near the hotel. Overall, the hotel is okay to stay at. I thought the price was a little expensive for the hotel, especially since it was an old hotel and the location was far from the city centre. The hotel room is safe and clean and I might stay there another time.", "Date": "December 20, 2006"}, {"Ratings": {"Cleanliness": "5", "Check in / front desk": "4", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Atlanta,Georgia", "Title": "“Decent place for the money!”", "Author": "Mr.BAtlanta", "ReviewID": "UR6458285", "Content": "My wife and I stayed for 4 days and the staff was very helpful, room was clean and breakfast was more than adequate. The bus stop is right in front and the subway is only a short walk away. Lots of good restaurants (including the hotel) in the area. Only negative at the hotel was a sewer smell in the bathroom, not overpowering, but that was the only problem with plumbing. Everything you could want too see in Rome is a short bus or subway ride, so the location was great for us. If you use your hotel as a base of operations and not as the final destination (I.E.Holiday Inn with pool) then I would recommend it. Please be aware that this hotel is located on a busy Piazza and is noisy during the day, but was okay after 10 PM. We plan on returning to Rome and I would stay here again.", "Date": "December 18, 2006"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Business service (e.g., internet access)": "4", "Check in / front desk": "5", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "florida", "Title": "“loved it!!”", "Author": "jeanne200", "ReviewID": "UR6305980", "Content": "I just returned from a fabulous 8 day stay in Rome..single woman traveler and loved Hotel Portamaggiore..yes small rooms but the view was great!! very safe, no problems leaving valuables in room..I found the staff to be super helpful and went out of their way a couple of times for me..for a budget hotel..this is tops would stay there again..Breakfast was more than adequate..bus travel easy from hotel, great cafes to people watch..seemed really comical to me that when ever there was some sort of \"problem\" at the front desk as I walked by, it was always an American..Guess what people? If you are doing Rome right, I guarantee you will be so tired you won't hear any \"rolling\" suitcases..people talking etc..the minute your head hits the pillow you'll be out..I loved it!! thank you Portamaggiore", "Date": "November 29, 2006"}, {"Ratings": {"Cleanliness": "4", "Check in / front desk": "4", "Overall": "3.0", "Value": "3", "Rooms": "3", "Location": "2"}, "AuthorLocation": "Winston Salem, North Carolina", "Title": "“Neutral review”", "Author": "LAFRAGIA", "ReviewID": "UR6149510", "Content": "We stayed at Hotel Portamaggiore for three night in Nov. 2006. This was booked through Gate1 Travel as a Paris, London, Rome vacation on plan C. There were some positives and negatives. The main thing to stress is to remember that you get what you pay for. There is nothing extravagant. The room consist of a bed, desk, phone, refrigerator, safe and T.V. The positives are the cleanliness of the room, the helpful staff that spoke English fluently, a delightful breakfast that consist of glazed croissants, pastries, rolls, cereals, deli meats and cheeses, jams, cappuccinos, espressos, coffee, and juices. To continue the hotel has two lifts (elevators,) bar, restaurant and two lounge areas. The first negative and maybe the main one is taking a shower would flood the bathroom. This was not simple flooding. It was over the shower, all on the floor and coming out the bathroom. The drain in the shower could not handle the water flow and the drain in the bathroom floor could not handle the overflow. The second night to avoid the same occurrence we had to basically take a shower with a small trickle coming from the water spout. The problem was the shower is only able to handle maybe an inch of standing water afterwards it starts pouring over the shower onto the floor. So keeping the shower water down to a trickle was the only resort. Very inconvenient because showers took longer but it worked. The second negative was an un pleasurable odor in the bathroom. I would relate it to maybe a plumbing/sewage odor. The third negative was the rooms are not sound proof or even close to sound proof. The floors are ceramic tile (inside and outside the rooms.) You could hear anyone walking that was wearing hard bottom shoes, heels or pulling luggage with wheels. The halls echoed. You could hear everyone's conversation. When other people went in their rooms, it seemed like the doors would slam shut. It was very startling in the middle of the night to wake up with loud thumps and slams. At times it sounded like they were trying to get into our room, but they were not. The last negative would be the location. Hotel Portamaggiore is not really close to any landmarks. You can take bus 105 to the main station. I think it is called Termini Station (about a 5 minute ride) then get on the subway or take a bus transfer. We got an all day pass for the bus, train and subway and it was four euros. That's a pretty good deal, especially if you are trying to do the city on your on. If you are like me and the hotel is only used for showering a sleeping then you would be satisfied with this choice. I hope you don't have the bathroom flooding experience. Next time we stay in Rome I would like to have a hotel closer to the sights, but if you ask me would I stay here again I would say yes. I have included a few pictures and hope this review will help you.", "Date": "November 18, 2006"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Business service (e.g., internet access)": "4", "Check in / front desk": "5", "Overall": "3.0", "Value": "2", "Rooms": "2", "Location": "4"}, "AuthorLocation": "NYC and Montreal", "Title": "“Not Bad, but You Can Do Better for the Money.”", "Author": "JonusNYC", "ReviewID": "UR6051995", "Content": "The bed and breakfast I was staying at could not accommodate me for one evening of my stay in Rome (I booked last-minute), so they graciously found me a room at The Hotel Porta Maggiore, as it was close-by and known to be generally good... there were few rooms to be found on this one date. First of all, I had to spend DOUBLE what I was spending at the B&B... paying 125 Euro for a single accommodation. There was a time constraint and very few options available to me... so, I snapped it up. The room was small. And the walls were in need of a serious paint-job. Once you get past the very nice lobby and reception area, the halls and rooms are kind of shabby.... but, the furnishings inside are modern and very clean. Beds are comfortable... and despite the noisy area, new windows blocked most of the outside noise. Good cable. Then, I took a shower.... OY! Although everything was clean and the hot water was plentiful, within 3 minutes of my shower, the teeny tiny shower backed-up... I was knee-deep in water that was spilling out into the bathroom. When I stepped out to investigate, I noticed a secondary drain in the center of the bathroom.... that all the excess water was draining neatly into.... So, it appears that this was all expected.... the shower backs-up and the water drains via the center of the bathroom! All this is fine, but to go back into the bathroom later to use the toilet, be prepared to wade through whatever water is still on the floor. Excellent buffet-style breakfast with juices, pastries, fruit, cereal and cold meats / cheese for sandwiches. Coffee is by machine (not great). If you ABSOLUTELEY INSIST on a hotel experience, this isn't a bad place. I just found my B&B to be equally or more comfortable for half the price (with a fully-functional shower - LOL). This hotel seems to cater to tour bus goups and the like... so, maybe there are better deals to be had here. If you know your way around Rome, this is also a great location, as Porta Maggiore is a major hub for tram and bus service to the city. The hotel is right on the Plaza. Reception is EXCELLENT, helpful and completely fluent in English. No problems at ALL with credit cards... Amex is taken here, as well.", "Date": "November 3, 2006"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Business service (e.g., internet access)": "1", "Check in / front desk": "1", "Overall": "1.0", "Value": "1", "Rooms": "1", "Location": "1"}, "AuthorLocation": "Palo Alto", "Title": "“Hated The Hotel Portamaggiore”", "Author": "Susons", "ReviewID": "UR5972228", "Content": "Do NOT stay at this hotel. We just came back from 2 weeks in Italy. This was one of the MOST DISGUSTING hotels we have ever stayed in. We booked thru hotels.com. We saw 3 rooms, prior to our final one, which was barely better. The rooms & common area floors & hallways are tiled, which make it very noisy. You hear everyone rolling their suitcases & talking. There were cracks in the walls, both in the room & hall. The hall was smelly, like a sewer, the walls were paper-thin, you can hear your neighbor's conversation & TV, the towels were thin, like a sheet, the shower was moldy & very tiny, the front desk clerks were unfriendly, the breakfast was disgusting: 2 oz bowls for a poor choice of cold cereals, hard rolls w no flavor, unsweetened/unflavored yogurt, awful juice that was messy to deal with, & very poor coffee, from machines that you might find at a gas station/carwash...an insult really of a breakfast. If you face the street, the room shakes when the trains go by. The hotel is NOT a 3 star. It is barely a 1 star. I don't think any of the tour books recommend it. Plus it was not cheap. It is basically a dump. DO NOT BOOK THIS HOTEL. IT STINKS!!", "Date": "October 19, 2006"}, {"Ratings": {"Overall": "3.0"}, "AuthorLocation": "Scotland", "Title": "“A real bonus!!”", "Author": "EvaMc", "ReviewID": "UR5834265", "Content": "Good value for money hotel. I was travelling as a single traveller, so city hotels tend to be expensive and I needed somwhere that was reasonably close to the station as I was getting in late at night and wanted to avoid the dodgy taxis near the station. This is 10 mins walk, also on quite a few bus/ tram routes. The room was quite basic but very clean and with satellite TV. Modern shower room and despite some other reports on the noise, I have stayed in much noisier locations. Breakfast was plentiful - croissants, cereal etc. The big bonus was they have a great terrace bar which is quite big and very quiet and you can see the hills from it - a real bonus!! Try also the restaurant round the corner 'La Peccora Pazza' - very good food and service and very reasonable, worth a try!!", "Date": "September 25, 2006"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Check in / front desk": "3", "Overall": "4.0", "Value": "3", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Topsy Turvy Triangle", "Title": "“I had a good experience!”", "Author": "Ana54", "ReviewID": "UR5775774", "Content": "I guess I was lucky. I think my whole school group was lucky, because we all had rooms in the same wing, and my room was fine, and since I hear there was a good wing and a bad wing, I think we were in the good one. Nice huge bath. My two roommates took fair-length showers before me and then I showered for a fair amount of time and the water NEVER WENT COLD! Everyone was taking showers at the same time yet I could still have as much hot water as I wanted. The rooms, the bathrooms, even the hallways and dining room and lobbies were clean, especially the former two. I found it cool that there were bidets, lol. The beds were dpacious enough. Decoration, for a 3-star hotel, was really good. The breakfast was plain breads and often they were hard. There were only 2 kinds of juice: too-sweet orange juice and too sour other-citrus juice. The hot choc was okay. The croissants were okay. Had I known they had apple turnovers I'd have eaten them all. The cereal was boring but right now I'm really in the mood ofr it... as well as that juice! I liked the spaciousness of the hotel. It was loud when you opened the window in the room... ambulances, people shouting, etc. But the blackout drapes were cool, it was totally dark when you wanted it to be. It's an interesting piece of history; I think it's one of those buildings that has the same plumbing as it had in Ancient Rome. I'd stay there again, but I wouldn't want one of the crappy rooms... I'd request one of the good ones!", "Date": "September 6, 2006"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "London, England", "Title": "“Fantastic! No complaints whatsoever.”", "Author": "zimbotraveller", "ReviewID": "UR5581251", "Content": "I had already booked my accommodation at the Portamaggiore Hotel through a well know travel site when I then stumbled upon this site and read quite a few negative reviews for this hotel. As you can imagine I was very concerned and even considered cancelling my booking, but I decided to take the risk and stayed at the Portamaggiore Hotel for three nights....... and I'm glad that I did! The room was clean and comfortable, the staff were friendly and very helpful and even the breakfast which is usually not very good at 3 star Hotels was absolutely fine. What more do you want from a relatively cheap hotel!? I would definitely stay at this hotel again in the future.", "Date": "August 9, 2006"}, {"Ratings": {"Overall": "1.0"}, "AuthorLocation": "NY", "Title": "“Beware Hotel Portamaggiore !”", "Author": "OrangeThree", "ReviewID": "UR5497003", "Content": "I recently had the true displeasure to stay for 4 nights at the hotel Portamaggiore. I cannot think of a positive thing to say. The hotel staff was rude and inefficient. The hall I was on had and off odor to the air, but worse yet... the room smelled like cat urine. I was appalled and grossed out. Breakfast and dinner were included in the price of my stay (which was a group of about 65 people). At breakfast after the first day I left the hotel to seek edible nourishment from a local establishment. Dinner was edible but tasteless and mostly over cooked. It appears that the food was optional at times, because each evening some part of the meal was omitted because they did not have enough. No complaints were ever addressed. I travel for 4 or 5 times a year, for about a week each time. I have been in many countries, many situations ... Never had I had such lack of attention to hotel guests.", "Date": "July 22, 2006"}, {"Ratings": {"Cleanliness": "3", "Overall": "2.0", "Value": "2", "Service": "1", "Rooms": "2"}, "AuthorLocation": "Basingstoke, United Kingdom", "Title": "“Would not go back!”", "Author": "vidlerites", "ReviewID": "UR5433686", "Content": "We went back to Rome as a surprise trip for my husbands birthday. Staying at the Maggiore spoilt what otherwise would have been a wonderful time. I opted to stay here because it was mid-range in price and I thought it would be a little bit special. We made the mistake of walking to the hotel! It must be at least 2 1/2 miles. - Not welcoming in a 33 degree heat. I think more information should be given as to quite how far out of the way this hotel is. You need to take a 105 bus which will take you outside the hotel, or better still take a cab.The staff almost threw our keys at us on check in. No explanation as to which floor we were on, no information about breakfast or restaurant opening times. We finally found our room on the 2nd floor. First impression- basic but clean. The Air con wasnt switched on on arrival. Luckily a maid was passing the door - she had to phone down to reception to get them to turn it on. 5 minutes she said. We felt really lucky to have a balcony, until we opened the double glazed french doors- OH MY WORD! The traffic was horrendous. A very busy square greeted us with mad people in charge of cars, motorbikes, buses, and ambulances!!!! We closed the doors and waited probably an hour for the air-con to work. When it did it wasnt cold. We had a choice of warm moist air or traffic!. It is VERY hot in June so mostly we chose the traffic! Breakfast was not the best, and please dont eat the entrecote in the restaurant unless youve got a couple of days to chew it. The best thing about this hotel is the terraced bar.No food served here as advertised, but lovely to sit on a warm evening and have well deserved drinks.The hotel is a little too far from the city centre and there are only 2 buses that go to the hotel. The no 3 which only stops at the back of the Collosseum and the 571-which doesnt run on Sundays! However I can recomend the trattoria on the corner. Very nice. I will go back to Rome1 day because I threw my coins in the Trevi fountain, sadly I wont be returning to the Maggiore.", "Date": "July 6, 2006"}, {"Ratings": {"Cleanliness": "2", "Overall": "2.0", "Value": "2", "Service": "2", "Rooms": "2"}, "AuthorLocation": "glasgow, Scotland", "Title": "“would not go back”", "Author": "A TripAdvisor Member", "ReviewID": "UR4987562", "Content": "Last minute booking so did not read reviews until after booking confirmed unfortunately. Found room very small and while on the whole clean generally felt it could do with a lick of paint.Shower cublicle cracked and small with varying water pressure. Beds small single and felt that every time I turned over was on danger of falling out. Room was at front and very noisy, lot of traffic at all hours. Walls were also very thin so overall did not get much sleep. Breakfast was adequate but ate in restuarant one night and had the worst meal ever had in Italy. Staff at front desk were ok but not overly friendly or helpful. Would not stay here again nor recomend to anyone else.", "Date": "April 19, 2006"}, {"Ratings": {"Overall": "3.0"}, "AuthorLocation": "rochester, new york", "Title": "“Not Bad / Good Value”", "Author": "somuchworldtosee", "ReviewID": "UR4473269", "Content": "I stayed at Portamaggiore Hotel for 3 nights while in Rome. It was very clean and roomy compared to other European hotels in which I've stayed. The staff was very friendly and helpful. The location is also good. Most forms of transportation are right outside the door or only steps away. Only complaints I have are: The hotel is very noisy as the walls seem paper thin. Also, there is a discoteque located almost right across the street that stays open until at least 5 a.m. on weekends. The crowd can get a little noisy at times making it difficult to get much sleep. The breakfast was simply adequate...nothing too spectacular...but okay since it was included in the cost of the room. It consisted of mostly breads although there was some cheese, cold cereals, meager fruits and what looked like some sort of ham. I would probably stay there again. I think it's a good deal for the budget traveler. Not a good place to stay for families with small children due to the noise level and thin walls.", "Date": "February 20, 2006"}, {"Ratings": {"Overall": "1.0"}, "AuthorLocation": "Paris", "Title": "“Not so Nice As they Sell it!!”", "Author": "A TripAdvisor Member", "ReviewID": "UR4413236", "Content": "This hotel is Veryveryveryvery Noisy. The members are very nice, multilangage speaking, the rooms are cleans, but how noisy. Bus, tram, Cars, Motorbike, Poeople, Very noisy. Breakfast is correct, ham, cheese in slice and Cornetti, orage juice cofee.. etc. Sometimes no hot Water in the bathrooms (1 night/4). But another problem: dishonesty of the personnal, they propose taxis at 45 euros for the airport Ciampino, but in reallity it cost 20 euro in normal taxi from the road in front of the hotel!! We might have miss our plane because one of their taxi was late. (We took finally one in the road). So it is not very honest.", "Date": "February 4, 2006"}, {"Ratings": {"Cleanliness": "1", "Overall": "2.0", "Value": "2", "Service": "2", "Rooms": "1"}, "AuthorLocation": "Ontario", "Title": "“only 1 good feature”", "Author": "A TripAdvisor Member", "ReviewID": "UR4372246", "Content": "We stayed here for a portion of our Italy tour and it was not anything like we had expected, the bathrooms flooded, they were working on the exterior of the building so the construction started early, some rooms had mold and yucky's, the customer care was horrid and DO NOT use the safe provided, one of the ladies in our group did to secure some money and when we came back that night the safe was locked up but here money had been taken, and staff wouldn't comment. The greatest part of this hotel is the ambiance that is provided in the dining area and the entrace/stair case, it truly is historic and transports you to a nostalgic era.............great place we found is when we left the hotel and crossed through the wall on the other side of the street was a fantastic cafe, best cappucino in Rome!", "Date": "January 23, 2006"}, {"Ratings": {"Cleanliness": "2", "Overall": "2.0", "Value": "2", "Service": "3", "Rooms": "2"}, "AuthorLocation": "New Lambton, Australia", "Title": "“stink”", "Author": "A TripAdvisor Member", "ReviewID": "UR4300158", "Content": "Having just returned for a 16 day tour of Italy with a group of 40, I would like to comment on the 4 nights we stayed at this hotel. Several of the bathrooms flooded when the shower was used, most of the bathrooms had a sewage stink that was only partially alleviated by opening the windows. Most of the rooms had mould and paint flaking off, most rooms had some of the lightbulbs not working, some had TV's not working, only some rooms had a fridge or a safe. The new/renovated part of the hotel was much better than the old/yet to be renovated part. The hotel is not convenient to anything, the food was average, except for the vegetarians in our group, where it was abysmal, they were presented with a very large slab of cheese with a token bit of parsley as a main course!!!", "Date": "December 26, 2005"}, {"Ratings": {"Cleanliness": "4", "Overall": "3.0", "Rooms": "3", "Service": "4"}, "AuthorLocation": "Iowa", "Title": "“Decent, but not grand”", "Author": "A TripAdvisor Member", "ReviewID": "UR3927027", "Content": "while this is not the best of hotels, for those of us (ie students) this is a good choice. The price is reasonable, and the ammenities are sufficient. air conditioning is important! the shower thing sucked, yes, there was not opulent amounts of hot water, but it worked. the location is so so. however, if you are walking FROM termini. this place is easy to find. busses come by ever 10 min or so, and most are clean, i would stay away from the trams in the location. the staff speaks english and are very very helpful.", "Date": "September 20, 2005"}, {"Ratings": {"Cleanliness": "4", "Overall": "3.0", "Value": "3", "Service": "4", "Rooms": "3"}, "AuthorLocation": "Kaiserslautern, Germany", "Title": "“Very friendly and helpful staff”", "Author": "mmmirabal", "ReviewID": "UR3735156", "Content": "Pros:The one thing I really enjoyed about this Hotel was the friendly staff that was so helpful to my family and me. They showed us how to use the Metrobus, Rail, and just overall, where to go in general. We only needed the Hotel to sleep and eat breakfast (continental...and not bad I might add) and that was sufficient for us. You will need the entire day to see any major attractions so we were out by 0800 and in by 2000, so the hotel accomodations were sufficient to us not to mention the fact that we brought 3 kids along. Cons: The bath towels are like thin terry clothes with prints but they do the trick; the AC didn't work all that well; fridge didn't work to well either; no ala carte at their restaurant in the lobby for dinner", "Date": "August 3, 2005"}, {"Ratings": {"Cleanliness": "5", "Overall": "5.0", "Value": "4", "Service": "3", "Rooms": "4"}, "AuthorLocation": "Finland", "Title": "“Very pleasant hotel”", "Author": "A TripAdvisor Member", "ReviewID": "UR3729261", "Content": "Me and my boyfriend spend five night at Portamaggiore at July and loved our stay there! The hotel and the room were very clean, the room was tidyed daily and the towels were changed, TV and airconditioner worked fine and it was very pleasant to relax and sleep in the room after a long day exploring the city. The garden terrace was also nice place to be in the evenings. The staff was helpful, friendly and multilingual. The location could be better.. there is actually pretty heavy traffic going on outside the hotel... but the windows are new and keep the noise well outside. Walking time for example to Colosseum was only 15 minutes. And if you don't want to walk, there are six tramlines passing the hotel front. There are some nice restaurants just near by the hotel. We really enjoyed our holiday in Rome and in hotel Portamaggiore.", "Date": "August 2, 2005"}, {"Ratings": {"Overall": "2.0"}, "AuthorLocation": "Washington DC", "Title": "“Ehh”", "Author": "A TripAdvisor Member", "ReviewID": "UR3545007", "Content": "If you can find a better deal (or even pay slightly more), stay somewhere else. I spent four months studying in Italy and I stayed in hotels and hostels all around the country...this hotel had them all beat--and not in a good way! The bathroom was awful, the rooms gross. As a young American student I was given about as much respect by the staff as a Nazi.", "Date": "June 12, 2005"}, {"Ratings": {"Overall": "4.0", "Rooms": "4"}, "AuthorLocation": "Sydney, Aust", "Title": "“A great place to stay.”", "Author": "A TripAdvisor Member", "ReviewID": "UR3271235", "Content": "The hotel is great. We read the review on this sight and were worried about our booking. The review couldn't have been more wrong. The room was clean and the shower only flooded if you waved your arms about (just try to keep them down a little). The room was noisey with the double glazed windows open but with them closed there was no problem.The queen beds were clean and comfortable. Sadly the bath towels are bath sheets but they were clean each dayand there were plenty. The hotel is an easy walk from the Collaseum and the centre of Rome. We had a balcony that looked out on the porta itself. The staff were helpful and the food was great if somewhat erratic in the way it was served. I thought the hotel was great and would happily stay there again. Whoever wrote the negative review must usually only stay in five star hotels.", "Date": "March 14, 2005"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "SCOTLAND", "Title": "“lOVED MAGGI”", "Author": "A TripAdvisor Member", "ReviewID": "UR3090378", "Content": "Just returned on Sunday having spent 3 nights at the Hotel. Staff were very helpfull and very friendly. My daughter Jane treated me to this short break for my Christmas and it was a very worthwhile gift. I would certainly recommend the Hotel and have already done so to all my friends.", "Date": "January 27, 2005"}, {"Ratings": {"Overall": "2.0"}, "AuthorLocation": "Washington DC", "Title": "“Uhhhh! Whatever!”", "Author": "A TripAdvisor Member", "ReviewID": "UR2906834", "Content": "I stayed at this hotel during Thanksgiving 2004. I booked the package through Gate1 Travel. This hotel is on the far side of town, not really close to anything. However, public transportation is close by. The subway is a few blocks over and the street cars stop right across the street. This hotel has long winding hallways and misplaced room numbers. I stayed in room 3N and my parents stayed in 3P. I believe these are some of the newer rooms in a newer wing of the hotel. We looked at 4 rooms before we settled on these. The other ones were smelly and old. The bathrooms were OK. They had bedets in them if that's your thing. The showers were small and so were the beds. I believe the beds were actually smaller than US twin size beds. This hotel is mainly situated in a residential area. I found it hard to find decent places to eat and just have a drink. Most shops and restaurants close around 9 or 10pm so after that, you're out of luck. However, on the last night I found an all night hamburger/ hot dog stand on the other side of the train tracks. It served the purpose in a crunch. Overall, this hotel was OK. Besides, you're not staying in the room all day anyway. I felt safe around hotel, safer than downtown or on the Metro. You live and you learn. Make the best of it. The daily breakfast buffet is a European one. Don't come looking for hot food or fruit -only sliced meats and cheeses. ( I hate this!!!!) Oh! And forget any TV or Cable- it's all in Italian. Ciao!!! Enjoy Roma.", "Date": "December 21, 2004"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "New York City", "Title": "“Portamaggiore Hotel is a great find”", "Author": "micheller", "ReviewID": "UR2868998", "Content": "I had read a few disfavorable reviews about the PORTAMAGGIORE HOTEL and was dubious of the package I had purchased. However, my stay was very pleasant and the room was very nice and the location very close to the Metro Line A train which left us minutes from the hot spots. One thing if you are looking to go out the night life in the area is scarce and I would recommend the area surrounding Piazza di Spagna (Spanish Steps). THe staff was not very helpful. Except for one individual who worked in the late night, he was amazing at providing infomation. The day staff was somewhat clueless. Various reviews mentioned sirens in the middle of the night, we heard nothing but pure silence. The cappuccino next door is amazing. The hotel bkfst. can be skipped. I hope you love ROME as much as I did.", "Date": "December 7, 2004"}], "HotelInfo": {"Name": "Hotel Portamaggiore", "HotelURL": "/ShowUserReviews-g187791-d250498-Reviews-Hotel_Portamaggiore-Rome_Lazio.html", "Price": "$91 - $1,310*", "Address": "<address class=\"addressReset\"><span rel=\"v:address\"><span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">Piazza Portamaggiore 25</span>, <span class=\"locality\"><span property=\"v:postal-code\">00185</span> <span property=\"v:locality\">Rome</span></span>, <span class=\"country-name\" property=\"v:country-name\">Italy</span> </span></span></address>", "HotelID": "250498", "ImgURL": "http://media-cdn.tripadvisor.com/media/ProviderThumbnails/dirs/fe/36/fe364534283d13d417eac3ec65b43d225large.jpg"}}