{"Reviews": [{"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Hong Kong, China", "Title": "“Good value and location”", "Author": "Cindywan_707", "ReviewID": "UR126814822", "Content": "We stayed at this hotel for 8 nights. A very convenient location with a walkable distance to many attractives. Restaurants and cafes nearby but not so noisy as mentioned in the reviews, maybe because our room was not facing street. The staff were friendly and helpful. The ambassador cat, Isis, always stay at the hotel lobby to welcome you.", "Date": "March 28, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "cornwall, UK", "Title": "“Good value and central too.”", "Author": "annhig", "ReviewID": "UR126557424", "Content": "Very conveniently placed near the St. Michel/Notre Dame RER stop, the hotel was surprisingly quiet, though when we opened the balcony doors, the noise did increase a bit. We booked a deluxe room, which wasn't exactly luxurious but it did mean that we had quite a lot more room than is normal in a Paris hotel room, though this did not extend to the bathroom, which was extremely small. The shower was excellent, which at least partly made up for it. The staff were are friendly as we needed them to be, but we don't ask much of them so they weren't really put to the test. The morning we had breakfast it was good apart from the coffee which was stewed. Whether this was normal I can't say as we only had breakfast on the last day. We slept well and enjoyed the easy access to left and right banks and metro/RER that the hotel gave us, as well as the myriad restaurants and bars in the vicinity. Booking early [6 months in advance] using the hotel website gave us a very good price so that would be a good place to start looking.", "Date": "March 23, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Sleep Quality": "3", "Rooms": "5", "Location": "5"}, "AuthorLocation": "London", "Title": "“Dad's 90th birthday”", "Author": "Eva A Posted by an Easytobook.com traveler", "ReviewID": "UR126473595", "Content": "We had a great couple of days in Paris, the hotel was conveniently located, comfortable and practical. The staff we're friendly and helpful all in all a great trip. The walls are very thin and you can hear other rooms and noises but it wasn't a problem.", "Date": "March 22, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Charlotte, NC", "Title": "“Stayed for a week and would gladly return”", "Author": "PearlsMom", "ReviewID": "UR126445078", "Content": "I stayed at this hotel from March 5-11 and have nothing to say but good things to say. After reading many Paris trip reports and reviews on the website, I was better prepared for the trip. I took earplugs and had a \"sleep\" playlist on my ipod, but never needed them. I did hear my neighbors when they got a little loud at times, but never constantly. I was in room 505 and being that it was an upper floor, I heard normal street noise. Several nights I even slept with the balcony door open and wasn't bothered. After all, this is a major city so some noise is expected. My friend was in room 305 and she was bothered a bit more by street noise, but she also is from a rural area in the US, so she she's accustomed to quieter surroundings. My bed was comfy, and did not have plastic between the sheet and the mattress. I also packed my own wash cloths, as they were not provided. The hospitality of the staff was great, and I was also prepared to leave my room key at the desk whenever I left, so I took advantage of the in-room safe. I was also able to use the stocked minibar to chill a few sodas and bottled water that I purchased. Most importantly, the value and excellent location are what will have me returning again and recommending this hotel to friends. I booked early and directly with the hotel and got great rates for 2 single rooms. After a night of flying, we opted to take a taxi from CDG to the hotel which cost 65 euros, but on the return the hotel arranged a shuttle with one other hotel stop and the cost was only 32 euros for the two of us. We each bought a caret (10 metro tickets at 12.50, rather than then normal 1.70 per trip), but the metro sharing the same lines with the RER can be a bit confusing, even for someone who spent 10 years taking the metro in Washington, DC. It lacked just enough signage for me to give up, but we were able to take the RER to Tour Eiffel for our appointment to go the top (which I highly recommend as the lines were horrendous), the Invalides, and Musee d'Orsay, as well as the funicular up to Sacre Coeur so it wasn't a total loss. this hotel is so convenient to Notre Dame and the L'Open Bus tours which we used as transportation for the remainder of our trip. Another tip is to consider visiting the Louvre on Friday night when it stays open to 9:45pm. I had heard of crowds there, especially herds of people around the Mona Lisa, but it was much less crowded than I anticipated. Overall, we had a great first visit to Paris and wouldn't think of staying anywhere else.", "Date": "March 21, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "3.0", "Value": "4", "Sleep Quality": "2", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Los Angeles", "Title": "“Great Location with Some Downsides”", "Author": "Lauric921", "ReviewID": "UR126284896", "Content": "Having visited Paris many times, I am accustomed to the smallness of the rooms in most three-star hotels. I was excited to try this hotel because of the many rave reviews on this site. I will agree that the location is excellent -- in walking distance of many major sights, and near the St. Michel Metro and RER lines. However, its location in a busy pedestrian area made my street-facing room extremely noisy. The street noise didn't subside till about 2:00 each morning, but was then followed at about 5:30 by delivery trucks, trash pick-up, and construction vehicles. Also, there is little to no soundproofing between rooms. Perhaps if you are a light sleeper it would be best to request a non-street-facing room. My other issue was with the bed. The mattress was covered with a plastic protector, with the bedsheet directly on top of it. This made for a hot, rumply, uncomfortable bed. Weighing the obvious pro of the great location against the cons of the noise and discomfort, I don't think I'd stay in this hotel again.", "Date": "March 18, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Glasgow, United Kingdom", "Title": "“Shrt Stay Paris”", "Author": "thesupermum", "ReviewID": "UR126227568", "Content": "We have just returned from two nights at the Europe and will certainly go back. Its location is second to none, five mins from Notre Dame and the Seine (metro and RER Blue from CdeGaul airport). The hotel is between St Germain and the Latin quarter so it is a foody heaven. We managed, on the first night, to find the Irish bar!!! You can get the Batobus (river boat) from Notre Dame but we walked the river round to Eiffle Tower, stopping to see the Musee de Orsay on the way and walked back along the other bank via the Louvre. We didn't have the hotel breakfast but it looked good and was value for money compared to eating out (as we did).", "Date": "March 17, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Location": "5", "Rooms": "5"}, "AuthorLocation": "", "Title": "“Great boutique hotel in a wonderful location”", "Author": "SophieEnglandSydney", "ReviewID": "UR125708473", "Content": "This is a lovely small hotel situated in the most inviting part of town, just down the road from notra dame and just steps from the metro station. We paid a little extra for a larger room which had ample space, tv, fridge etc and great views over the quaint side streets. The bathroom was well equipped and I requested a bath which was lovely after cold days in Paris. Reception staff were friendly, although we had no need to call on them other than checking in and out. Cleaning staff did a wonderful job and were very friendly, always saying hello as you passed them. I would most certainly stay here again, it was a brilliant hotel experience and good value for money.", "Date": "March 6, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Melbourne", "Title": "“The perfect place in the Latin Quarter”", "Author": "cekips", "ReviewID": "UR125482312", "Content": "We have stayed here for over a decade whenever we go to Paris. It has all one needs as well as position, position, position!", "Date": "March 1, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "5.0", "Value": "5", "Sleep Quality": "3", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Colchester, United Kingdom", "Title": "“Perfect location for sightseeing”", "Author": "Pbakerpurple", "ReviewID": "UR124982721", "Content": "The location of this hotel could not be better. 2 minute walk from metro station (same line as Gare Du Nord), 2 minute walk to boulangerie, creperie, restaurants, cafes and only 5 minute walk to Notre Dame. Hotel is in heart of Latin quarter, which comes alive in the evening and a 3 course meal can be found from €11, although we paid €14 for soup, steak & chips, chocolate mouse (delicious!). Hotel itself is clean, with comfortable beds and helpful staff. As previous reviewers have said, it can be noisy in the evening and the dustbin men do come round very early in the morning However, this would be the same in ANY centrally located hotel and is worth the slight inconvienece (I heard the noise the first night but not the second). Would recommend this hotel to anybody who wants to wander around an authentic part of Paris where you can just soak up the atmosphere and relax. Will definetly stay here again.", "Date": "February 21, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "bavel", "Title": "“great stay!”", "Author": "benvaesen", "ReviewID": "UR124907806", "Content": "This hotel is worthwile its ranking. Simply because it's on a prime location, center of Paris, service is excellent, rooms are clean. Great value for money!! We stayed three nights and could easily walk the area (Notre Dame, Palais Luxembourg, Musee d'Orsay, Louvre, Place des Vosges) but also take the metro to discover some of the other monuments/musea. Great advantage are the restaurants nearby.", "Date": "February 20, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "3.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "5"}, "AuthorLocation": "", "Title": "“Perfect location!”", "Author": "LO_SD", "ReviewID": "UR124436588", "Content": "Right in the heart of the Latin Quarter... You just can't go wrong with the location. The front office staff are very kind and helpful. The whole place is recently remodeled and clean. The only downsides are that they make you leave your key (old skool keys) at the front desk any time you leave the premises. That made us sort of uncomfortable at first, but were quickly at ease when we saw that we really had nothing to worry about with leaving because they were trustworthy and definitely watched over everything. The other thing is that if you are on a budget, this place may not be the best fit for you.... Literally. We got the cheapest room they offered, and it.was.tiny. We got over it, but were shocked at first. Hey, it's Europe, so old, oddly sized rooms and bathrooms are to be expected. I would definitely recommend this hotel to others. You're a five-minute walk from Norte Dame.", "Date": "February 11, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Wiltshire", "Title": "“Great hotel in an amazing location”", "Author": "theperks", "ReviewID": "UR124211395", "Content": "Stayed here for three nights, room was clean and spacious (for a paris hotel room) and had a good shower and corner bath. Only downside on room was a couple of marks on the wallpaper which i guess were suitcase bashes. The hotel location is superb, the restaurants nearby might be a little touristy but there are some nice bars on place St.Michel and excellent local restaurants no more then a 15min walk away. Metro station perhaps 100yards from hotel on the same line as gare d'nord for the eurostar. Great place to explore the city, will stay again.", "Date": "February 6, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Chicago, IL", "Title": "“Wonderful Hotel, Wonderful Price!”", "Author": "gizellemarie", "ReviewID": "UR123764090", "Content": "I recently stayed here for a weekend with my sister and brother-in-law, and we could not have asked for a nicer stay or a better location. The price for two rooms for three nights was amazing, and the quality of what we got far exceeded my expectations. My single room was cozy, clean and lovely. The bathroom, while small (not an issue, I am one small person and don't need a large bathroom) was impeccably clean and nicely decorated. The shower had great water pressure and plenty of hot water. The closets are large with shelves and hangers- this may seem trivial, but I thought it was pretty luxurious for a hotel closet. My sister & hubby had a beautiful little balcony with a gorgeous view. The book of recommended restaurants in the lobby is a good resource and we were not led astray by it. It was the perfect hotel for my first trip to Paris and I would most definitely stay there again.", "Date": "January 28, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "New York City, New York", "Title": "“Greatest value in Paris”", "Author": "Jonathan T", "ReviewID": "UR123703982", "Content": "Just spent a few nights in the hotel and I couldn't be happier. The location is literally the center of Paris, walking distance to most of he great sites and thre is a metro station on the corner. The rental bikes, which is the greatest system ever, is right in front of the Hotel. It is conveniently located in the Latin Quarter which is one of the most charming areas in Paris. The rooms were clean, spacious and well equipped with all of the modern conveniences, for example large screen tv and free wi fi. The staff is extremely helpful and friendly. There is also a great restaurant which is part of the Hotel. Great food, great value. I have been coming to Paris for 29 years and this is the only place I will be staying from now on.", "Date": "January 27, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Location": "5", "Rooms": "4"}, "AuthorLocation": "", "Title": "“Very good location, good overall value”", "Author": "Litebright2011", "ReviewID": "UR123166510", "Content": "Stayed there for a weekend, it's in a very good location surrounded by restaurants and cafes, very easy to get to attractions via metro. The hotel is very clean and the staff are pleasant the rooms are small but nice. Good value for money I would recommend this hotel", "Date": "January 16, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Adelaide, Australia", "Title": "“Perfect location”", "Author": "SteveTravler", "ReviewID": "UR123147645", "Content": "What a great location. We stayed a week and loved every minute. So much is so close by:- RER station, Metro, River Seine, shopping up Bd Saint-Michel, dozens of restaurants within 50 meters. Luxembourg gardens and Pantheon a few hundred meters. The hotel was great, at the top of our budget for this trip but location made up for it. Room had double glazed windows, which we had open most of the time and let the atmosphere from outside waft in. Once closed at night it was nice and quiet even though there was still lots of activity on the street. It was on the fourth floor facing the street at the end of the corridor. It was clean and the on the small side, but it is Paris. Room had a minibar and a good closet. We did not try the breakfast but instead went along the street and bought fresh pattisserie for very little, also bought some yoghurt and stored in the minibar. Visit the Pantheon and they have a free tour of the dome. You can go outside and get a fantastic view of Paris. Also visit the plaza in front of Notre Dame at night - what a great atmosphere (Buskers, fire breathers and inline skaters doing incredible runs.", "Date": "January 16, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Brisbane, Australia", "Title": "“Great location, room & comfortable bed.”", "Author": "dasiln", "ReviewID": "UR122952656", "Content": "I booked the hotel through venere months in advance and check in was a breeze. The hotel was handy to a numerous metro stations and entrances. We loved the rustic look of the loft style room with decent sized bathroom. We were on Level 6, room 602 - a deluxe double room. The room was clean and the bed was extremely comfortable (if you like a pretty firm mattress). A few things weren't working - the fridge and the spa bath but didn't bother us. There was no iron/board and the staff were unable to locate one for us. They advertised sound proofed rooms, they are not. We were in a corner room so another room to the right of the bed, street on the left, nothing behind and other room on other side of bathroom. Didn't hear anything from the right room but was a bit annoyed while trying to relax in the bath and hearing everything going on next door. The action on the streets below is noisy but I was prepared and used earplugs so was fine. As for safety we had no issues - but we generally put a Do not Disturb on the door to skip daily services. We had one and no issues. The hotel cat was nice too, lazy around in the foyer.", "Date": "January 12, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "4"}, "AuthorLocation": "South Lanarkshire", "Title": "“Wouldn't hesitate to return!”", "Author": "weechooky", "ReviewID": "UR122838016", "Content": "Had a lovely 3 night stay here in December- staff all very helpful and friendly. Room was really cosy and pretty small (although no smaller than expected for Paris) but for a few nights it's certainly not a problem. We stayed room only and so didn't bother to pay for the breakfast which I think was about €12 each. There was a great wee cafe/bakery (Salon de The I think it was called) within 2 min walk that sold an express breakfast for 2 for €7.90 so we were sold on that! The location of the hotel is great with plenty of great restaurants within easy walking distance. The Metro is also only round the corner. All in all the hotel is great value and seems to be worthy of more than it's 2 stars. We would not hesitate to stay again. The icing on the cake was the adorable Isis the hotel cat!", "Date": "January 9, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Watertown, New York", "Title": "“Great 1st time in Paris”", "Author": "tommmaxon", "ReviewID": "UR122833812", "Content": "This was a wonderful place to stay because of it's location. We flew into Paris and hopped on the RER and got off a half a block from our hotel. We arrived much before the scheduled check in time but they had our room ready and we were able to get a little nap before venturing off into Paris. The service was efficient and friendly. One girl, Jeannine, seemed to be working every day and was very friendly and helpful. They made dinner reservations and gave us directions. The front desk was super. The room was clean and and spacious enough. It was quiet for the most part except for a short while on New Years Eve.....not a problem. I would recommend this Hotel to anyone who wanted to be in the middle of Paris and have access to Metro, buses, taxi, or jsut to walk around. So many shops and restaurants and things to see and do within walking distance. Even the Hotel cat was comfortable. Great place.", "Date": "January 9, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Ireland", "Title": "“great location and cute hotel”", "Author": "ACC1979", "ReviewID": "UR122676977", "Content": "you can't ask for a better location - even coming from the airport, you can take the RER and it's around the corner from the hotel. There are tons of restaurants around, supermarket, ATM, etc. Notre Dame is just around the corner. I love this location. The room was super cute with old stone walls and wooden beams. The size was decent, especially since this is Paris. nice bathroom, though it was kind of strange that there was no blackout curtain on the bathroom. People can't see in, but a lot of light comes through and there's no door separating it from the bedroom. (the toilet is separate with a door). Our room was on the second floor, i think it was 203. It had a little balcony with a table and chairs for two overlooking the pedestrian-only street below. Really nice. I def think it's worth getting a balcony room. We didn't eat breakfast - it was 12 euro or something ridiculous like that. With so many restaurants around, no need to pay that. Wifi was 5 euro for 2 days and worked fine. i would stay here gain", "Date": "January 6, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "3.0", "Value": "2", "Sleep Quality": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "San Francisco, California", "Title": "“Charming Hotel (with some cons to consider)”", "Author": "haysing", "ReviewID": "UR122616188", "Content": "I give the hotel 4 stars, but my particular room experience 3 stars. I had done a lot of research prior to making my reservation, and I was rather excited at this little find. The location is fabulous! It’s situated on a pedestrian street off Boulevard Saint Michel in the 5th Arrondissement in the excitement of the Latin Quarter/St. Germain on the Left Bank. It’s a bustling area full of cafes and restaurants. The River Seine is a short walk as are many sights: Notre Dame Cathedral, Sorbonne, Pantheon, etc. The hotel staff are polite and accommodating. And they have a special addition to the staff: Isis, a brown tabby cat, whom I was told is “the boss.” She wanders the halls, rides the lift, and greets guests. If you offer, she gladly accepts pets and cheek-rubs. Overall the hotel is quaint, charming, and well-cared for. A good balance of old charm and modern comfort. The following are the reasons my review is not higher. Please note that I’m traveling for an entire month with multiple destinations, so perhaps I’m being much pickier than I would be if I were enjoying a quick holiday then returning home. 1) Room size, 2) Noise, 3) WiFi Accessibility, 4) Breakfast… - Room Size: The rooms pictured on the website are either a select few or there is some trick of depth perception. They did not prepare me for my room (double with balcony on 5th floor), which was very, very tiny—a narrow walkway around the bed granted access to the balcony on one side and the bathroom on the other side. It was crowded for just me and my luggage; I’m glad I’m small and not sharing the space with someone else. - Noise: The website made a point of mentioning that the rooms are sound-proofed. This in particular caught my attention since it's a lively area, and I'm a light-sleeper. But the only things that seem to be sound-proofed are the windows. I heard little street noise, but I heard every sigh, giggle, and bed-frame bump next door, which started within an hour of my check-in and went on intermittently for the next two days. Then each morning vacuuming the hallway began around 9am and random knocking and banging started in from somewhere in the building—remodeling something perhaps? Point is that every noise traveled through the walls from all directions. Of course, this is the nature of an old building, but I don't understand why the hotel emphasizes sound-proofing when it’s not really a strength. - WiFi Accessibility - Every place I've stayed (every place in every city!) offers free wifi access for their guests. This hotel charges for the wifi. I believe it's 3 euros for 24 hours and then \"deals\" if you request longer time--I got one week for 10 euros. But when I went to connect, I discovered that the charge is \"per access point,\" meaning I had wifi on my computer, but if I wanted to also be able to use it on my iPhone, I had to pay another 10 euros. Ridiculous! - Breakfast - I've grown quite spoiled by gourmet breakfasts being included in the stay at other places that I was rather disappointed to discover that the breakfast here is 12 euros, and yet includes only \"continental\" items--pastries, juice, etc. Based on the size and noise in my particular room and the add-ons, I think it was overpriced. Depending on the importance of these four things to you, this is a charming place to stay in a great part of Paris!", "Date": "January 5, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Geelong Australia", "Title": "“Location, location, location!”", "Author": "travel_pair24", "ReviewID": "UR122592001", "Content": "If you are looking for a hotel that is right in the centre of everything-this is it! The room is very tastefully decorated and clean and with a huge closet. The staff are very helpful and friendly and it is only two mins walk to St Michel station with the Metro and RER and Notre Dame Cathedral is just across the Seine. There are over a hundred restaurants within 100m so eating out has many options and also Velib bikes right at the front door. Our room had a lovely little balcony over looking the street-Room 203 is right at the front and a great choice. The price is quite reasonable for Paris and we will definitely stay here again!", "Date": "January 5, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Sydney, Australia", "Title": "“Central location, great value, helpful staff”", "Author": "Elissa358", "ReviewID": "UR121691095", "Content": "I spent 3 nights at this fab hotel a month ago and I couldn't fault it for the price. As I was arriving in Paris at 9am after an overnight train, I confirmed with the hotel that there was somewhere I could leave my luggage prior to check-in. When I arrived, exhausted and in desperate need of a shower and a lie down, the receptionist checked with housekeeping and informed me my room would be ready at 10.30am. After a great buffet breakfast, I was in my room, unpacking and recovering by 10am. Amazing! The service and care amongst all of the staff I met was fantastic. The room was a little small but for one person it was the perfect size. I booked the cheapest available so I am sure the other rooms are more spacious. The furnishings and bathroom were new and comfortable and the room itself was quiet with a lovely view to boot. I would definitely recommend this little gem of a place to friends and family.", "Date": "December 13, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Cincinnati, Ohio", "Title": "“Atmosphere”", "Author": "tlynn63", "ReviewID": "UR121473240", "Content": "The Hotel Europe St. Severin is off of a main street and easity assessable to many of Paris' attractions. It is only a few doors down from the hustle and bustle of many many restaurants in the Latin Quarter. The room was much smaller than I think I have ever experienced but there was a huge closet and the room was clean. After only checking in the desk clerk always called us by name. We were given an upgrade to a balcony and that really made it for us! It was fun sitting on the balcony in the chilly night air looking down on the activity of the street. I would definitely recommend this hotel to the budget minded--but get a balcony.", "Date": "December 6, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "New York, NY", "Title": "“Great location, clean room, good value”", "Author": "rs695", "ReviewID": "UR121265776", "Content": "Having stayed in other hotels in Paris, this is as good as it gets for the money. As many other reviewers have noted, the rooms are small--as they are in nearly every other hotel in Paris--but otherwise well appointed, clean and comfortable. Front desk staff were friendly and helpful. Wifi is extra but reasonably priced at 5 euros per 48 hrs. The location can't be beat: For those who don't mind a bit of walking, nearly all the big sights in Paris are within a 20-30 minute stroll; for those who don't, the Saint Michel RER and Metro stations are just a couple of blocks away. We'll definitely stay here again.", "Date": "November 30, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Richmond, Virginia", "Title": "“GREAT!”", "Author": "Kurt F", "ReviewID": "UR121250281", "Content": "Found on trip Advisor and it was best choice we could make. Central to all of Paris - conveninet to metro, sites, cafes, ATM, ebven a Starbucks around the corner etc, Staff was great- room we had was deluxe double on 6th floor - great views! Quiet! Roomy!Great shower. Staff was joy to deal with, had a breakfest buffet that worked perfectly for us. Hotel cat was a doll as well! Biggest surprise: the italian restaurant - RIM- in the hotel is GREAT! Try it! Hotel was helpful in arranging reservation at restaurants, shuttle services etc. The city is beautiful, the people wonderful, and Hotel Europe Saint Severin just made it all better.", "Date": "November 30, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Fort Lauderdale", "Title": "“Excellent Location in the Latin Quarter”", "Author": "TRAVELHUBRIS", "ReviewID": "UR121074340", "Content": "The Hotel Europe St. Severin is a wonderful, authentic budget conscious accommodation. Minutes away from Nortre Dame and the Cluny museum, the hotel is just steps from the St. Michel Metro Station. The location makes it convenient to travel to all the top attractions. The rooms are spacious by European standards and have everything you need: comfortable bed, excellent updated shower and tub, mini bar (which you can use to refrigerate your own culinary treasures) hair dryer, Wifi at a nominal cost and a lovely balcony overlooking the quaint street. There is a restaurant attached to the property that I did not try but it looked okay. The small lobby area is managed by Isis the cat who sleeps and purrs on the velvety red chairs. The staff is helpful and pleasant without being overly effusive. I would recommend this hotel. Note: Avoid the restaurants in this area: They are tourist traps. A short walk will lead you to some excellent choices such as La Tournebievre.", "Date": "November 27, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Singapore", "Title": "“Great location”", "Author": "unfrequentflyer", "ReviewID": "UR120906873", "Content": "I stayed one night here as I was unable to get a room in a neighbouring hotel where I normally stay. I got a promotional price of 99 euros because I booked early, saving 60 euros. The reception area is cosy and quaint, and opens directly into the breakfast area and adjoining italian restaurant. The room was a fair size, and the bathroom was small but functional, fitting in a WC, wash basin and a shower unit. There was a large flat screen TV with a wide variety of international cable channels provided. Wifi was not free but the fee of 3E for a day is OK. However, the user code and password generated for wifi can only be used for one device eg either your iphone or ipad or laptop, not all three, and I didn't ask if I would have to pay 9E if I wanted wifi for all three devices. My room came with a small balcony with a table and chairs, so it was great to be able to sit 5 storeys up and people watch the bustling activity in the latin quarter below. The location is simply amazing. The RER B is just round the corner (St Michel station) which gets you door to door to CDG and Orly airports, the RER C also serves the stop which gets you directly to the Musee d'Orsay and Eiffel tower. Breakfast is charged at an additional 13 euros. It is a buffet, and the description in the lift says that in addition to the cold buffet of breads, danishes, cold cuts and cereals, a hot breakfast eg omelette could be provided on request. There are no hot items on the buffet, so i asked the nice waitress if I could have an omelette with ham and this was duly cooked fresh for me, which was nice. So I think 13 euros is quite good value.", "Date": "November 22, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Kent", "Title": "“Great value for money”", "Author": "Gloria H", "ReviewID": "UR120284613", "Content": "We were delighted to find that our hotel room on the second floor had a small balcony with table and chairs, overlooking the street below. The room also had a good size flat screen TV, minibar and safe. The bathroom had a big corner bath with a powerful shower attachment, and although small,the room was clean - and excellent for a 2 star hotel. Great location, in the heart of the Latin quarter and just a couple of minutes from the metro and bus service. Friendly staff and the only slight downside was quite a bit of noise at night, but this is to be expected if you choose this bustling area of Paris.", "Date": "November 7, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "3", "Rooms": "4", "Location": "5"}, "AuthorLocation": "", "Title": "“Quite satisfied”", "Author": "DAP05", "ReviewID": "UR120232056", "Content": "I recently stayed here as a solo traveler. The location was awesome and immediate area in a touristy locale. Steps from metro, bus, and RER. Easily walked to Notre Dame and St Chapelle. Wifi cost was affordable at 5 euros for 48 hrs. Room was charming and clean with balcony. Dominic at the front desk was especially helpful. I did not try the breakfast and instead ate at other places in the area. I would choose this hotel again!", "Date": "November 6, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Albuquerque, New Mexico", "Title": "“Friendly, convenient, charming, great value”", "Author": "AllGoodGifts", "ReviewID": "UR119767474", "Content": "I got an unbelievable price for a room here from Travelocity. The location is very convenient - less than a five-minute walk from the RER B line from the airport and the Metro, less than a 10 minute walk to Notre Dame, and right in the heart of a bunch of restaurants and cafes. The front-desk staff were very friendly and helpful. I had a room on the fifth floor with a little balcony and a cafe table and chairs - very charming! The rooms are small and not luxurious, but I paid a good bit more for a less-convenient hotel later in the trip and the room was no better (and lacked the cute balcony). The interior walls are probably a little thin - you could sometimes hear people in the adjoining rooms - but the noise from the street was never a problem, and overall I had no issues. The internet access is not free, but it cost something like 3 Euro for one day, which I had no problem paying. Personally, I loved the place, and would recommend it to anyone looking for a high-value hotel in an outstanding location.", "Date": "October 26, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "New York City, New York", "Title": "“HIgh points for helpful, friendly staff and small, but clean rooms”", "Author": "luxusreal", "ReviewID": "UR119715864", "Content": "It's Paris after all and rooms are small, but location and staff are 4 stars. If you want an active and convenient neighborhood in the Latin Quarter, this hotel is perfect! Well run by a friendly and helpful staff, you walk out the door to find yourself in the middle of restaurants, sightseeing, metro lines and steps from the Seine. We were very pleased with the service and cleanliness and would stay here again! Susan", "Date": "October 25, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "3", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Milan", "Title": "“Good hotel in a great location”", "Author": "trionichide", "ReviewID": "UR119468335", "Content": "This small hotel is nice and confortable. Our room was clean and nicely furnished, although a little bit dark, being at the first floor. The staff is helpful and polite. Above all, the location is nearly perfect for anything to do in Paris, being exactly above the Saint Michel / Notre Dame metro and RER station, with direct connections to both airports and many other places of interest. Unique spot is the lack of a wireless service in the rooms, although I've read comments by the owner that they are trying to improve the internet service.", "Date": "October 19, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Ireland", "Title": "“Great City Hotel”", "Author": "Twoadultsthreekids_9", "ReviewID": "UR119443542", "Content": "This hotel is conveniently located to Metro, great little restaurants and cafes. Extremely helpful, friendly staff (not to mention Isis the cat)! The room was quirky, rustic and very charming. We travelled as a couple with our teenage daughter and would recommend this hotel to any age group wanting safe city centre location. Great area to eat out breakfast, lunch and evening meals. We would particularly recommend a cafe called Boulangerie Artisanale for pastries, coffees etc. All in all a perfect hotel in a perfect city!!!", "Date": "October 18, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "3", "Overall": "2.0", "Value": "4", "Sleep Quality": "2", "Rooms": "2", "Location": "4"}, "AuthorLocation": "Knoxville, Tennessee", "Title": "“What Air Conditioning??”", "Author": "lrdecker1", "ReviewID": "UR119107883", "Content": "The location of this hotel is covenient to attractions, the metro, etc. Also convenient to many good and cheap restaurants (we liked Le Bourbon, the Hotel's restaurant and Marathon) but this proximity makes the area noisy in the evenings. The hotel has an elevator and our room was clean and moderately sized (which is relatively large by French standards). Everything worked well for us EXCEPT FOR THE AC (and we overheard other guests also complaining about the AC) and every time we talked to hotel personnel about the AC problem we got a completely different explanation/excuse. The bottom line, however, is that the AC is incapable of keeping the rooms comfortably cool!!!", "Date": "October 9, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Brisbane, Australia", "Title": "“Great hotel in a great location.”", "Author": "roddy_77", "ReviewID": "UR119097674", "Content": "Room was small, but that was to be expected in Paris. The holel was very clean and tidy and the rooms were boutique in style with rustic stone walls and renovated bathrooms. Fantastic location - could not have gotten any better position. In a pedestrian only section of Saint Michel. Beautiful restaurants and cafes surround the base of the hotel as well. Staff were extremely helpful and friendly.", "Date": "October 9, 2011"}, {"Ratings": {"Service": "2", "Cleanliness": "2", "Overall": "2.0", "Value": "1", "Sleep Quality": "2", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Santa Margherita Ligure, Italy", "Title": "“Good location - run down room, poor ammenities”", "Author": "MinceLikesElves", "ReviewID": "UR119089271", "Content": "The location of the hotel is good. This was overshadowed by the condition of the room - it was dusty, the shower floor was sticky and unclean, and the airconditioning did not cool. Our room was small and noisy from the street below. We intentionally left the \"do not disturb\" sign on our door when we left our room because we did not want our belongings to be touched. However, we returned to the hotel to find that it had been made up and upon speaking to reception the matter we did not even receive an apology. Do not stay here if you want to use the internet. The Wifi is slow, overpriced (should be free - we are not in the 1990s!!), and difficult to connect to. And it will disconnect you after 30 mins to an hour. This was one of our final hotels in our 10 week trip around europe and was definitely the most disappointing - there is better value elsewhere in Paris.", "Date": "October 8, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Somerset, New Jersey", "Title": "“Nice hotel, GREAT LOCATION!!”", "Author": "Taras P", "ReviewID": "UR119033124", "Content": "This is a great hotel in a fantastic location. It is literally steps from 'Sortie 2' of the St. Michel Metro station. We stayed in a double deluxe room and it was a very nice, adequately sized room. The only little hitch we had was that our shower was not draining, but once that was fixed, everything was just fine.", "Date": "October 7, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Los Angeles, California", "Title": "“Amazing Location”", "Author": "mrstj06", "ReviewID": "UR118746096", "Content": "This was our second time in Paris and we were set on staying in the Latin Quarter this time since we loved it so much last time. We couldn't have picked a better location. This hotel is right in the heart of the Latin Quarter, literally steps away from the Metro. Notre-Dame and the Luxembourg Gardens are only a short walk away. The rooms are tiny (but that's Paris) but they are very nicely decorated and cozy. Our room had a lovely window that overlooked the outside street. If you are looking for a well-priced, comfortable hotel in a great location...this is it!", "Date": "September 29, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Moscow, Russia", "Title": "“Very nice, cosy hotel with real french atmosphere!”", "Author": "RasaPr", "ReviewID": "UR118621474", "Content": "We spent 2 weeks at the hotel this august. It was my first time in Paris and I could not imagine better location for my first visit: very easy to keep on track it in the labirynth of small streets and it is in a walking distance from all main attractions. The staf is very friendly and the atmosphere is cosy, home like. Breakfast: if you like just your croissant and coffe for breakfast, skip the breakfast at the hotel and walk to one of many boulangeries around. The breakfast at the hotel costs 10Eur (croissant + coffe at boulangerie approx. 2-3Eur), but if you like your breakfast bigger it's worth to consider breakfast at the hotel as at the cafes around for french breakfast you will pay the same 10Eur. We definetly will go back to the hotel if travel to Paris.", "Date": "September 26, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Oakland, California", "Title": "“Terrific Hotel Staff and Location”", "Author": "Kjmama", "ReviewID": "UR118380023", "Content": "Great place to stay for a first time trip to Paris. The location is near public transportation, easy walk to sights - Notre Dame, Lourve; good area for people watching and affordable dining. The hotel staff was extremely helpful and friendly and the room was clean with a view to the streets below.", "Date": "September 20, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Quebec City, Canada", "Title": "“Very good hotel”", "Author": "Valch0u", "ReviewID": "UR118334392", "Content": "This hotel is perfect! The price was not too high, the place is amazing, the room and bathroom was clean, we had enough room for three people. I really don't have anything negative to say about this hotel. The service could be a little bit more sympathetic, but that's it.", "Date": "September 19, 2011"}, {"Ratings": {"Location": "5", "Overall": "4.0", "Value": "3", "Service": "4", "Rooms": "3"}, "AuthorLocation": "Vancouver, Canada", "Title": "“Heart of Latin Quarter!”", "Author": "kaycee2117", "ReviewID": "UR118161053", "Content": "We stayed at Hotel Europe Saint Severin at the end of August 2011. We arrived in the late evening via metro so we had a bit of trouble finding the hotel. It is super close to Saint Michel station but we were a bit lost finding the correct street. Street names are located on the side of buildings.The hotel is located in the heart of Latin Quarter, surrounded by wonderful restaurants, cafes and shops and there were people everywhere. The room is fairly small but clean and decent, but that is pretty common for Paris hotels. Despite the hustle bustle downstairs, the room is quiet and we weren't disturbed at all. We had breakfast every morning at Papa Boulangerie - a bakery just around the corner from the hotel. They had fresh croissants and other pastries.. so yummy! The hotel is steps away from Notre Dame Cathedral and a 20 min walk to the Louvre. We walked everywhere - the location is unbeatable. The front desk staff is very friendly and helpful . Only cons for this hotel is the small size rooms, the bed wasn't the most comfortable and the fact that the safe box is not bolted to the cupboard. They aren't any amenities either such as a gym or pool. Other than that, we highly recommend this hotel and won't mind staying here again.", "Date": "September 15, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Los Angeles", "Title": "“Perfect Hotel in a Perfect Location”", "Author": "MissSoCal", "ReviewID": "UR117957742", "Content": "We found this hotel by accident - I am so glad we did! The staff was warm, friendly and so helpful! We checked in late and the gentleman at the desk made it as easy as possible, he even upgrades us for free. The room was lovely and had a great bistro set on a balcony overlooking the Latin Quarter. It is conveniently located to Notre Dame, the metro and La Seine that runs parallel to the Louvre, Champs Elysees and eventually the Eiffel Tower. A chic place to stay in Paris. I would definitely stay there again!", "Date": "September 11, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "4.0", "Value": "4", "Service": "4"}, "AuthorLocation": "California", "Title": "“great place to stay :-)”", "Author": "Divers2go", "ReviewID": "UR117880573", "Content": "Hotel was rated 2 stars, I think it could be 3. Location is really accessible with all sorts (metro, RER, taxi, etx.) . Hotel is in the heart of Latin Quarter, a cozy place in Paris, with nice restaurants surrounding it. We stayed 3 nights/4 days here. The room was nice , a little bit small for a double (we booked a double room with balcony), should've booked a double deluxe instead bcoz they said its bigger , but anyways, everything we need in a room was there, safe box, mini bar, nice TV, telephone, wifi, and the bathrooms were cleaned everyday and replenished with amenities. We didnt hear a thing from outside, with all the traffics and restaurants, its good islolation they have with their window. But you could hear your neighbors ,I mean the door slamming . But it was ok. Only thing is every morning doors started slamming at 7 or 8 am, and not good for us who wakes up late . But still its ok . The receptionists were helpful and can speak english .. Will definitely go back here next time. But will book a deluxe double room instead with balcony, its the same price anyway ..", "Date": "September 9, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "5.0", "Value": "5", "Service": "4"}, "AuthorLocation": "Texas", "Title": "“Great Hotel, Great Location, Reasonable Rates”", "Author": "robertsfamilytx", "ReviewID": "UR117840915", "Content": "I stayed at this hotel during the last week of August and thoroughly enjoyed the experience. My room was nice and the bed was comfortable. It is also less than half a block from the Metro/RER station so getting around was a breeze. In fact, the RER line that connects to CDG stops there as well which made it very convenient. The hotel wireless connections were a bit slow but passable. The hotel is in the Latin Quarter and there are dozens of cafes within feet of the front door. Notre Dame is only a couple of blocks as well. I was a bit concerned that the street noise would be a problem, but the room was quiet enough. One suggestion is to ask for the room upgrade. I was given room 203 which had a great balcony where you can sit, people watch and enjoy a bottle of wine. If you can get that room, you will not be disappointed with the view!", "Date": "September 8, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Sydney", "Title": "“Excellent standard of accommodation in a good location”", "Author": "Marco10", "ReviewID": "UR117676016", "Content": "Excellent standard of hotel accommodation in a good location. Worth the additional expense for a balcony room.", "Date": "September 4, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "4", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Chennai", "Title": "“Comfortable, central and customer-friendly!”", "Author": "AshishChennai", "ReviewID": "UR117337689", "Content": "My wife and I booked at the hotel on the recommendation of a friend. We booked on their website and received an excellent deal for the Deluxe Rooms (corner rooms ending in 01 numerals!). We emailed the hotel just before we left home, and they replied promptly reconfirming our reservation. The Deluxe Rooms are the ones to book if you are staying here. We peeked at the other rooms and they did look a bit cramped. Our room had a lovely king-bed, big windows facing the street, a private toilet, and a wash-basin and giant jacuzzi discreetly tucked away in a corner. This is a room for couples. And don't let the washbasin and bath in the same room put you off. It actually adds to the aesthetics. Our room was huge, there was original stone and timber beams on one wall, and plenty of storage. Being centrally located right in the middle of the Latin Quarter meant that restaurant and street busker music filtered through the windows, as did the early morning garbage trucks. But being Indians and used to sound pollution in our cities, we actually felt quite at home and slept quite soundly! The service at the front desk was friendly, and Jamal, the night-duty manager, was very helpful, especially when figuring out how to open the tricky room lock as well as with directions, and an adaptor plug. The hotel is in the heart of the touristy restaurant district, and so you are spoilt for choice among an array of very average restaurants. There was a Lebanese restaurant that was great value. We skipped breakfast at the hotel and pampered ourselves at the closest Eric Kayser boulangerie, a favourite among Parisians. We walked to almost all the major sights - 10mins to Notre Dame, 15mins to the Ponte De Neuf and Louvre, and 5mins to the nearest metro. Perfect! We would not hesitate to book here again and highly recommend it for couples looking for a centrally located hotel in Paris, expecting a clean spacious room.", "Date": "August 28, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "florida", "Title": "“Two Thumbs up....Best place to stay in the heart of Paris”", "Author": "1luvtotravel", "ReviewID": "UR117297033", "Content": "This hotel is considered a 2* but it is much more than that. First of all the hotel is charming, the rooms are great, beds & bathroom are excellent, also very near both the RER and the Metro (super important in order to see Paris conveniently.) The Latin Qtr., talk about being in the center of everything, we'd go sightseeing in the daytime and at night we'd walk out of the hotel and had so many restaurants to choose from the streets of the Latin Qtr. were sizzling with locals,tourist and street entertainment, it's a fabulous place to stay and great for shopping, lots of shops both of tourist items and regular clothing & shoes just blocks from the hotel. The staff at the reception were super friendly & helpful, gave us a little map to the nearby grocery stores so we could get our son some milk & some snacks, and who can forget the hotel cat she is great, right away she becomes familiar with those staying at the hotel, if you dont like cats dont worry she doesnt come up to you she's usually just relaxing on of the hotel lobby sofa's or chairs. Book directly with the hotel, you'll get a much better deal, we did. We had requested a quiet room & that's exactly what we got, room 512 (triple) perfect size for our family and our 3 huge luggages. Internet was super cheap for Europe standards I think it was 5 Euros for 48 hours or something like that, great to stay connected with those at home. Turning in your key when you leave and picking it up when you return is not a big deal actually his is very common in Europe, it was like this in most of our hotel's during our stay in Italy. We will definitely return to this hotel when we return to Paris, and I recommend it to anyone looking for a good hotel with a great location without having to break the bank. It is a true gem in the heart of Paris.", "Date": "August 26, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "5.0", "Value": "4", "Service": "5"}, "AuthorLocation": "New York, NY", "Title": "“Beautiful hotel, great location, very friendly and helpful staff!”", "Author": "data_wrangler_nyc", "ReviewID": "UR117276741", "Content": "I stayed at this hotel with a friend for four nights, and it was the highlight of our trip. We got there in the wake of some confusion with other hotels, and the desk staff was extremely nice and very helpful -- they let us change our reservation from one bed to two beds, and let us check into the room early. For the rest of our stay, they were always bright and cheerful and super helpful when we had questions. The room was spacious and clean with a big window and a balcony ledge, all the furniture seemed pretty new and well-kept-up. Beds were comfortable. The bathroom was a little cramped, but that's all I can say bad about it. We actually spent some time hanging out in the room and it didn't feel cramped or stuffy at all, which wasn't the case with some other hotel rooms we stayed in. The location of this place could not be better. It's spitting distance from the Seine and Notre Dame, the Blvd St Michel metro stop which has numerous trains, and an easy walk to all kinds of great things in St Germain and île de la Cité. I would gladly stay here again.", "Date": "August 26, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Cardiff wales", "Title": "“Only a 2star!!”", "Author": "joylin", "ReviewID": "UR117141196", "Content": "This hotel is only rated a 2 * and in my opinion should be higher. We had 4 nights here and loved the location. The hotel staff were very friendly and our room was kept very clean. There is no kettle in the room but you can purchase a lovely cup of coffee from the breakfast room. Our room 405 was facing the front and i thought it would be very noisy but when we closed our windows at night we could hear nothing:) We are planning to go back to Paris next year and this will be our hotel of choice. The restaurant is also very good.", "Date": "August 23, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "", "Title": "“2 thumbs up!”", "Author": "Sflloyd", "ReviewID": "UR116930120", "Content": "Stayed in Paris with my boyfriend, we were not going to do a hostel because it's Paris! So I started looking at hotels. I came across hotel Europe because of the reviews on trip advisor. This hotel is in such a good location, just off the main st ( rue st Michel) which 100 busses frequent, this makes getting around so easy. Also within the same block of the hotel there is an abundance of international hotels & bars so there is definitely atmosphere of a night time. Some people may think it's to busy but we are in our 20's so it was perfect for us. Shopping is just along the main st, so ladies definitely push for this hotel... While my boyfriend had a nap one day after a long day of shopping on the champs élysées I snuck out to do some more and grab a coffee. The staff speak perfect English which was fantastic. I highly recommend this hotel because it's such a good location and the hotel was so lovely... Price was also great...", "Date": "August 19, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Location": "4", "Rooms": "4"}, "AuthorLocation": "", "Title": "“Lovely Hotel in the Heart of Paris”", "Author": "blinkentrip", "ReviewID": "UR116809885", "Content": "Stayed on the 5th floor in a room with a small balcony overloking the bustling street. The balcony was great, with a small table and two chairs, allowing one to have a glass of wine with cheese while watching the people in the street below. The room was furnished beautifully and kept very clean. No real noise from the streets with the windows closed. Important: the breakfast weighs in at 12 euro per person and they don't really tell you this. But: the breakfast is excellent, with fresh baguette, bread, pain au chocolat, juices, and a vast array of fruit jams. Well worth it!", "Date": "August 16, 2011"}, {"Ratings": {"Cleanliness": "4", "Overall": "5.0", "Value": "5", "Service": "4"}, "AuthorLocation": "Sao Paulo, SP", "Title": "“Loved it! Perfect location, great room.”", "Author": "JulianaGouveia", "ReviewID": "UR116751925", "Content": "I strongly recommend this hotel for tourists getting to know Paris, looking for easy access to public transportation, restaurants, cafes, and walking-distance activities and facilities in general. It´s right in the heart of Paris. The room was relatively large for Parisian standards, had charming decor, was clean and well kept and the shower was also good. To sum it up: this place offers great value for your money. I would definitely stay at Hotel Europe Saint Severin again.", "Date": "August 15, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "3.0", "Value": "3", "Service": "3"}, "AuthorLocation": "Dubai", "Title": "“Good location!”", "Author": "anabee", "ReviewID": "UR116707084", "Content": "The hotel is in a good location. Very close to a lot of transport options and food options. Infact just under the hotel and around it were heaps of tables set outdoors and many many restaurants packed with diners. There were also many hotels around this area. The rooms were a fair size. We did have problems with the refridgerator (not cooling) and air conditioner (dripping). Both reported, nothing done. The female receptionists were lovely, always smiling and helpful. The room keys took some getting used to, even had to help another guest as she struggled trying to get into her room. Notre Dame Cathedral is barely 5 mins away and we loved that we could see it everytime we went out somewhere. The boat cruise from under Pont Neuf was also walking distance, about 10 mins and we enjoyed the Paris by night cruise. It was a very lively area and the hotel felt safe. Speaking of safe, they do have safes in the room but they are not fixed. Just lying about in the cupboard. Internet station near the reception was 3 Euros for 24 hours. But their keyboard was way different than what we are used to so spent a lot of time sending off one email as was searching for keys and alt, tab, etc. All in all, we had a good stay.", "Date": "August 14, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "4.0", "Value": "4", "Service": "3"}, "AuthorLocation": "Perth", "Title": "“Gorgeous hotel in a FABULOUS Location!”", "Author": "EleesPerth", "ReviewID": "UR116673715", "Content": "This hotel is an absolute gem! Located in the Latin Qtr (Saint Germain), the hotel is surrounded by wonderful cobblestone steets filled with restaurants, shops & bars. The metro (underground) & RER (train) is extremely close by (Saint Michel Notre Dame the closest stop). This means you can get a train directly from both Paris CDG or Paris Orly on RER B. The train also goes directly to Versailles which is a must. The rooms were small but comfortable and very cute, a tad on the small side though (but what do expect from Paris). Overall a fantastic stay.", "Date": "August 13, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "4", "Overall": "5.0", "Value": "4", "Service": "5"}, "AuthorLocation": "Silver Spring, MD", "Title": "“Wonderful 2 star hotel”", "Author": "Sarah1104", "ReviewID": "UR116397596", "Content": "This hotel was just adorable. Everything about it was exactly what we were looking for for our first trip to Paris. Close to everything, Metro right outside the door, in the main part of the city where there is lots of action. We must have looked at 50 hotels on trip advisor before we chose this one (although it WAS the first one we looked at as well, so we could have saved ourselves the time :-)) The hotel is right on a busy street in the heart of the latin quarter. Pro: easy to find restaurants, wine, pastries, shopping, there is an easy-bike rental right outside, you just put your card in and pay something like $2.00 for a half hour bike rental. Con: this meant there was noise from the street as businesses got their morning deliveries and at night when the bars were closing. I didn't notice much of this noise, but I live in the city and am used to it. if you want total peace and tranquillity or are a very light sleeper this might not be your spot. There is a concierge 24/7 and all were very kind and helpful and spoke english. The room was cute and clean and the housekeeping service kept the room nice. Our bathroom looked recently remodeled and was very nice, although the shower was typically european (read: small!). We paid a bit extra to have a balcony, and it was well worth it, I liked sitting on the balcony watching people on the street with a bottle of wine at the end of the day. There was a fridge but it was only for the mini bar items, which was inconvenient because it would have been nice to have some snacks on hand after a long day. I didn't check the minibar prices, but i just automatically assume they are ridiculous. There was also a safe in our room. Bottom line, this hotel was more then I expected for something with a 2 star rating. The price was on the high end of moderate but was on par with other hotels we looked at in the area. We would certianly stay here again. One small caveat about the neighborhood is that it IS a touristy area, so some of the restaurants are blah to yuck. Ask the concierge for recommendations for good places. He recommended one for us that looked AMAZING. Sadly we were too late and they were totally booked, but be sure to ask!", "Date": "August 7, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "4", "Service": "4"}, "AuthorLocation": "Hastings, United Kingdom", "Title": "“A real gem of a hotel in a perfect location”", "Author": "dsilsby", "ReviewID": "UR116298143", "Content": "Having stayed in several Paris hotels over the years, I know that it's a bit of a gamble. At the Hotel Europe St. Severin we came up winners. The location is fantastic with a wealth of restuarants, bars etc within spitting distance. Easy access to public transport etc. Rooms were clean and very functional, with fully working AC, TV's and showers with plenty of hot water. The staff were realy friendly and helpful, despite previous reviews, and they all spoke very good english (even tolerating our attempts at French). We stayed as a family group and had 2 twins, 2 doubles and single room. For central Paris I found it to be be great value. I will defintely go straight back here on my next visit to Paris. No more Hotel roullette required!! P.S. If coming in from Gare du Nord then catch the number 38 bus to St. Michel....it takes you bout 20 metere from the Hotel.", "Date": "August 5, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "2", "Overall": "2.0", "Value": "2", "Service": "2"}, "AuthorLocation": "Troy, Michigan", "Title": "“Would never come back here”", "Author": "NTE1105", "ReviewID": "UR115797843", "Content": "We did not have a great experience at this hotel. The location is great, however the service, room size, and affordability don't measure up to anything they advertise. The reception/lobby area is not friendly and they just want you out of their hair as soon as possible. The room is tiny and the bathroom is even smaller. It was nice to be central in the Latin Quarter, however I would find a different hotel in this area as this was not worth the money we paid at all. it was the most expensive hotel of our European travels (Italy & Spain) and the smallest room we had out of the three countries.", "Date": "July 26, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Los Angeles, California", "Title": "“Nice Parisian Hotel”", "Author": "ladiesel", "ReviewID": "UR115779571", "Content": "Stayed here during the Paris part of our European Holiday. This is a very nice boutique style hotel in a great location, right smack in the middle of cafes, restaurants and shops galore! It is within walking distance to the Notre Dame Cathedral, Louvre Museum and Seine River Cruise starting point. We were a group of 5, so we booked a triple and double room. The rooms were a bit small, but it was just right for us. Our room had cobblestone wall which gave it an urban feel to it. It was also very clean and comfortable. Bathrooms were a good enough size and was also sparkling clean. The safe in the room was a little too small, we couldn't fit our laptop in it. Front desk people were very helpful and always provided us w/ directions whenever we asked. They even directed us to a self service laundry and that helped us save quite a bit considering the size of our group. One thing I would've liked was a room with a view. I asked upon check in, but unfortunately, they were all booked and the room we got had a terrace type balcony instead. It was okay, but again, it would have been nice to enjoy a view of Paris from our room. I will definitely make sure to request this in advance when we come back to Paris. Oh there was also an added bonus, if you're a cat lover like me, we got to meet the hotel cat Isis...she was a cutie! The hotel does offer wi-fi which isn't free but it's a deal at only 5 euros for 3 days. Cheapest wi-fi we found in Europe. Overall, I would definitely recommend this hotel and will book again when we return to Paris.", "Date": "July 25, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Location": "5", "Rooms": "4"}, "AuthorLocation": "", "Title": "“Great location with bustling activity on yr doorstep”", "Author": "Dibdurch", "ReviewID": "UR115628662", "Content": "Booked thru lastminute.com so got fab room with roof top views of paris for half the price-yay! Amazing location, close to everywhere and we cud see notre dame from our window. Quatre latin IS v touristy but we enjoyed meandering around for a couple of easy days. Receptionist spoke excellent english and couldn't have been more helpful. Check out pho 67 for fab vietnamese food nearby.", "Date": "July 21, 2011"}, {"Ratings": {"Cleanliness": "3", "Sleep Quality": "4", "Overall": "3.0", "Value": "2", "Service": "3"}, "AuthorLocation": "London, UK", "Title": "“Style over Substance”", "Author": "LinnyUKNZ", "ReviewID": "UR115572942", "Content": "The location is great, very central and on a mainly pedestrian street, however it is a little like tourist central, because of the number of eateries which have taken over the area. I've stayed at this hotel at least four other times over the last ten years, and I can say that I will not stay again unless they make improvements in the facilities they provide to guests, or if they reduce how much they are charging. The prices have increased over the years, but the quality of the hotel itself hasn't. The hotel is nice enough, pleasant decor and so on, but there is a lack of basic facilities; like tea and coffee facilities in the room (3 euros to purchase), there's no iron or ironing board in the hotel for guests to use if they need to (it went \"missing\" some time ago apparently). These basic things, are things that people expect to have available, when paying a decent amount of money to stay in a hotel. It was our wedding anniversary, and we hadn't been back to Paris for a couple of years, so we splashed out on their \"Superior Double Room with Balcony\" at 150 euros per night. There was nothing superior about the bathroom which was a shoe box and was a bit dated. They may have redecorated the bedroom areas a while ago, but the bathroom just had modern / newish accessories and things like the shower door didn't open or close easily… I could go on, but I won't. Essentially we won't be staying again, because there is more to be had for your money, at other hotel establishments. Not a Superior experience, for the Superior price charged!", "Date": "July 20, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "", "Title": "“Loved this hotel and the location”", "Author": "Mares22", "ReviewID": "UR115345140", "Content": "We stayed at Hotel Europe St Severin in end of June and absolutly loved it. THe hotel is much nicer than a two star although it doesn't have many amenities. Our room was excellent and spacious and the view from the room was great. The room was spacious enough for us (2 adults and 2 yr old that had a cot). The bathroom is very nice and is a good size. The location of this hotel in my opinion couldn't be beat. In the heart of the Latin Quarter, surrounded by cafes, resturants, small shops. Very Safe and everything is open late so you can walk around until early hours of the morning. Would definetely recommend this hotel, the only comment is don't get the breakfast, main great places to try around the hotel.", "Date": "July 14, 2011"}, {"Ratings": {"Cleanliness": "3", "Sleep Quality": "3", "Overall": "2.0", "Value": "2", "Service": "2"}, "AuthorLocation": "San Diego, California", "Title": "“Small rooms, poor service, great location”", "Author": "SanDiegoSusie", "ReviewID": "UR115250275", "Content": "We booked with th St. Severin as per a recommendation of a friend and the reviews on Trip Advisor. We were delighted when we arrived as the location was tucked away in a walking neighborhood filled with restaurants and shops. When we arrived, we found the room very small, even for European standards. We tripped over each other while we stayed there. The bathroom was even smaller. There was one small shelf, that barely held my lotion, toothpaste and toothbrush. I put my bathroom supplies, make up on the stand in front of the TV, as there was no other location to put it. There was only one towel rack, so we had to use the only chair in the room to dry the second towel. The shower was a regular-size, but the drain cover kept getting kicked around due to it's location and the fact that it was not adhered to the drain. I was worried I would trip on it. The hotel website said that they has a blowdryer in the room, so I left mine at home. The blowdryer was more like a hair burner. I can blow a better amount of air with my mouth and the dryer was too hot and seemed to burn my hair before it dried it! It also turnd off after 2-3 minutes and then would cool down about 7 minutes. It took 4 rounds to dry my sholder height hair, as it looked horrible due to the fact it dried on it's own and was overheated and became \"fly away\" hair that looked unconditioned. There was no space other than a closet with 6 hangers to put your clothing. There were 3 shelves, approximately 5 inched deep for clothing and one luggage/suitcase holder. We ended up not unpacking, but leaving our clothing in our suitcases. One of us used the suitcase holder for our luggage and the other used the foot stool (why they have it with so little room, who knows!) so that we could free up the small table for our computer. For the price, we had expected more. The room would have been fine for one person, but we were two and had booked a double room. We would not stay there again. We had a few questions for the staff, but they were unfriendly and not helpful at all.", "Date": "July 11, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "4"}, "AuthorLocation": "Wellington, New Zealand", "Title": "“Exceeded my expectations”", "Author": "hachii", "ReviewID": "UR115135333", "Content": "I have spent the last few nights at Hotel Europe Saint Severin. I cannot speak highly enough of this hotel. My room is tastefully decorated (perhaps recently refurbished), it is clean, there is good air conditioning, a very comfortable bed, and there is a lovely sunny balcony overlooking the street below. It is also very central - 2 minutes from St Michel metro station, 3 minutes from Notre Dame, and a rack of the fabulous Paris Valibo bikes outside. So it is very easy to get around. The staff have been very friendly, including tolerating me while I try to speak French (despite them all speaking perfect English). My room is compact, but plenty of room to move around, and plenty of room for a single room. I did see into another double (?) room, and it was very spacious. I don't think there is room service, but there are plenty of cafes within 1 min of the hotel. Wifi is €5 for 2 days. I will be telling my friends and family to stay here if they come to France.", "Date": "July 7, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Atlanta", "Title": "“Very nice hotel in a great location”", "Author": "Walsung", "ReviewID": "UR115113999", "Content": "We just returned from a 4 night stay at the Europe Saint Severin and really enjoyed our stay at the hotel. The hotel is located in a great location for visiting the primary sites of Paris. It is a 10 minute walk to Notre Dame and Saint Chapelle. The St. Michel Metro stop is barely a 5 minute walk from the hotel. We arrived from CDG on the RER St. Michel stop and had a quick walk to the hotel. There are plenty of restaurants nearby, and a very nice Boulangerie around the corner from the hotel. The area is busy in the evenings, but the street noise was not a problem from our room. We though the location was great. Our room was on the 6th floor (#602), and had a large and new bathroom with a jetted tub. The room had exposed timber beams, stone/brick walls, and dormer windows with views over the Latin Quarter. The bed was comfortable with crisp and clean linens. The room was very comfortable and atmospheric. Our friends were staying in the room next to ours (#601) with views of Notre Dame. Unfortunately, there were problems with their air conditioning not working during their stay. Their room was very hot, and never got fixed the 3 nights they were there, even though the problem was reported as soon as they checked in. All in all, we had a very positive experience with the hotel, and will stay there again on our next trip to Paris.", "Date": "July 7, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "3", "Overall": "4.0", "Value": "4", "Service": "4"}, "AuthorLocation": "Ontario, Canada", "Title": "“Great location, clean hotel, pleasant staff”", "Author": "Tyrolia-Joe", "ReviewID": "UR114811036", "Content": "OK, we liked this hotel. It's our first visit to Paris and we would definitely go back and we'd stay here again. The Hotel is a five minute walk from the metro stop at Notre Dame. It's in the heart (I think) of the Latin Quarter and in the middle of a lively section of Paris. The hotel seems to have ticked all the boxes for us. It was reasonably priced.. for Paris. The staff was friendly and it was well taken care of and clean. Right outside the door is a bike rental station and tons of eateries of all flavours.", "Date": "June 27, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Indianapolis", "Title": "“Great Hotel and Great Location in Latin Quarter”", "Author": "CHaskin", "ReviewID": "UR114544871", "Content": "We reserved a room with 3 single beds. The room was large, clean, and very attractive. We were in the heart of the Latin Quarter and enjoyed walking the streets and visiting the many different cafes. We were within walking distance of Notre Dame, and catching a boat ride down the river Seine. The receptionist spoke English and gave us many helpful hints. We would definitely stay here again.", "Date": "June 20, 2011"}, {"Ratings": {"Cleanliness": "3", "Sleep Quality": "4", "Overall": "2.0", "Value": "1", "Service": "2"}, "AuthorLocation": "Athens, Greece", "Title": "“Perfect location,room smaller than a hole,impolite reception”", "Author": "Tassos75", "ReviewID": "UR114457884", "Content": "the location is perfect,only 2 minutes from the Seine and the metro. the room on the fifth floor was supposed to be a...superior double room with a balcony.however,is is about 10m2, you can hardly move inside and the toilette will not fit you if you are more than e.g. 100 kg. i wonder if this room is a superior one, how the standard double room is...taking a look at the evacuation plan, we realised that it was one of the smallest on that floor. the balcony does not have chairs and table, as shown in the photos on the web site. the room's decoration and walls are not in very good condition. the wi-fi mentioned on the web site is not for free. the breakfast is poor and too expensive (double price), in comparison to the breakfast we found outdoors, and hardly any guest prefers it. one of the 3 ladies we met in the reception was absolutely impolite and rude. she never said goodmorning or goodevening, she never raised her head while speaking.", "Date": "June 20, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "3.0", "Value": "4", "Service": "4"}, "AuthorLocation": "Lamby80", "Title": "“Nice but a few things to note”", "Author": "Lamby80", "ReviewID": "UR113816517", "Content": "We picked this hotel because of the reviews on Trip Advisor and overall we were very happy with it. Having not been to Paris before, we were advised to stay in the Latin Quarter so that we would be central to everything. The hotel is in an excellent location, close to the river, the metro is literally around the corner. However, we found the area to be too touristy for us and if we went back would try and stay in the St Germain area, depending on the cost. The hotel itself is quite small, which we prefer and the staff on reception very friendly. We requested a high floor and did get this. We booked a superior double with balcony which according to the hotel website picture, has a small table and chairs to use but ours did not. We asked at reception and were told that this was because of health and safety. If you aren't going to provide them, dont advertise them! If i had known this, i would not have bothered booking this room and saved some money - pointless paying for something that you cannot really use. Also, the safe in the room is not locked down and could actually just be moved and taken out of the cabinet - again, defeating the object of having a safe! Would i stay there again if i ever visited Paris? Yes, as it is good value for money but i wouldnt pay for a room with a balcony.", "Date": "June 16, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "4.0", "Value": "4", "Service": "4"}, "AuthorLocation": "Wales", "Title": "“Lovely hotel in great location”", "Author": "Sian99", "ReviewID": "UR113209330", "Content": "We stayed here in January 2011 and had a lovely time. The hotel is in a great location and it was very easy to get here from the airport by train. We had a corner room overlooking the little square, it was very clean and done in a nice style with stone walls. It was freezing outside but the room was lovely and warm and very comfortable. The reception staff were very helpful and polite. We walked almost everywhere and only used the metro a couple of times as the hotel is in such a good location. There are a lot of restaurants nearby and although we avoided the ones very close (due to restaurant staff outside trying to drag you in!), we ate in a lovely restaurant with a view of the Notre Dame one night. The second night we went on a river cruise with dinner, which I can highly recommend. Fab hotel, great location and would stay there again on a return visit.", "Date": "June 13, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Zurich, Switzerland", "Title": "“Excellent: location, bed linen, room, staff - pricey but that's Paris”", "Author": "Kanaschwiiz", "ReviewID": "UR108846837", "Content": "at the intersection of multiple RER lines and many good Paris sights, this hotel pleasantly surprised us with a (relative for Paris) big, quiet room with good bed linens. We got a 3-bed room which was ideal with small child. Cat in lobby. Good shower pressure. Air conditioning/temperature control worked well. My wife will want to stay here again. Beds were not bad but not top. Hard to find much else to complain about.", "Date": "May 18, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Evanston, Illinois", "Title": "“Excellent Experience”", "Author": "Mia427", "ReviewID": "UR108338792", "Content": "This place was great. I was nervous about traveling to Paris alone without speaking French, but this place made it easy. The staff were very friendly, helpful, and all spoke English. The rooms were a little on the small side, but they would be fine for any solo traveler or couple. It was very clean, and the bathroom was well kept. It was especially good for the price. It is in a nice location (very close to Notre Dame and the Seine River). I made a friend who was staying in a different hotel for only a little less, and this hotel was way nicer and in a much better area. I didn't spend much time in my room, but it was comfortable. Highly recommended and I definitely plan on going back!", "Date": "May 15, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "2.0", "Value": "2", "Sleep Quality": "1", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Vienna", "Title": "“Don't stay here if you prefer to not wake up at 6:30am every morning!”", "Author": "Tintinsfreundin", "ReviewID": "UR107661918", "Content": "+ The location is pretty good + The room was nice furnished + The bathroom was also stylish + Fridge & Safety existent + Dark enough in the room to sleep + Aircondition + Possible to rent a bike down on the street + Close to RER - easy to reach Paris CDG + Within walking distance to Louvre, Notre Dam, Les Halles etc + The staff in the reception were friendly - We woke up 6:30am every morning because they were cleaning the street & picking up rubbish every morning on the street ---> that was VERY loud and annoying - very expensive breakfast --> should be included in the price for the room 153€ per night - very loud in the evening as all the pubs/restaurants had guests until 1am outside - no soundproofed rooms, possible to hear other guests from other rooms As I normally just spend time in the room at night I would prefer that it would not be so loud. As sleep is the most important thing in a hotel room. So don't pick this hotel if you want to have a good night sleep. Next time I will pick Un Ciel a Paris (B&B) or Les Toits de Paris (B&B) Those two are not so touristic and it is possible to have breakfast at their place without paying extra.", "Date": "May 10, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Jacksonville, Florida", "Title": "“Great Hotel In The Middle Of It All”", "Author": "mkings12", "ReviewID": "UR105207218", "Content": "After staying for 5 nights just this past week at the Saint Severin, I cannot say enough about this hotel. The location cannot be beat for being so close to everything you need, the staff is attentive and very patient, our room (#517) was spotless and very comfortable. Go for the deluxe room with a balcony. Even though it is tiny, it is just big enough to sit at the table and enjoy a bottle of wine and watch all of the activity below. My wife and I cannot speak to the breakfast they serve because the allure of finding that amazing brasserie was too much to resist each morning. They even went above and beyond helping our lost friends find us at Au Bougnat, and even calling ahead to the restaurant to let them know our friends were coming so we could move to a table of four. The only negative, if you can call it that is the lack of available plugs in the room, other than that, if you are looking for a clean, roomy space to call home right in the center of it all in Paris, you cannot beat this hotel!", "Date": "April 23, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "New York City, New York", "Title": "“Ah, balcony...”", "Author": "waiahbi", "ReviewID": "UR104029781", "Content": "My fiance and I chose the balcony room for a one night stay. I've always dreamed of waking up in Paris and sitting on a balcony, just watching the sky change colors. The room was small, but charming, and the bathroom was extremely new and clean. The reception is opened 24 hours, and the staff are all very friendly and speak fluent English in case you have questions. We did not take part in their breakfast as there were a few boulangeries by the hotel that opened early. Notes: only one outlet in the room, one in the bathroom; small space; wifi daily for 3 euro; safe in the room; mini bar; luggage room There's nothing like waking up and watching Paris wakes up on a balcony, next to buildings with balconies... for that morning, I was a Parisian.", "Date": "April 14, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Leeds, United Kingdom", "Title": "“Value hotel in prime location”", "Author": "donnelbr", "ReviewID": "UR103759046", "Content": "Stayed at the hotel for 2 nights. Front desk staff were helpful and spoke english. Rooms were simple but comfortable. Wifi was available for a fee. Location was excellent; very close to St Michel/Notre Dame station and in the heart of the Latin Quarter.", "Date": "April 12, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "London, United Kingdom", "Title": "“Very pleasant and surprisingly quiet”", "Author": "Jenny49_11", "ReviewID": "UR103483553", "Content": "We stayed for one night and the room was very pleasant overlooking an interior courtyard, newly refurbished and clean. Could not hear any noise from the Latin quarter right outside the front door. Absolutely excellent location and very good value for the price.", "Date": "April 10, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "manchester", "Title": "“A well priced gem in the heart of the Latin Quarter”", "Author": "whatsuptigerlily", "ReviewID": "UR102032521", "Content": "- 99euros for a double room ensuite, with a juliette balcony overlooking the street - small but completely acceptable room, double shower, lovely refurbishment of the rooms -dont be put off by the corridors, the rooms look much better! -the buzz of the latin quarter did not disturb me but it is a consideration for others who are easily woken -two minutes from st michel RER and metro, for ease of access to the rest of the city and the airport (trains to CDG regularly during the day). -the latin quarter is a fun place to drink, and you can eat cheaply if you are not fussy!", "Date": "March 29, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "", "Title": "“Fantastic location, very clean, friendly service”", "Author": "Monta22", "ReviewID": "UR101619366", "Content": "We stayed here in April 09 and were extremely happy with the hotel and the price. Best thing about the hotel is the unbeatable location, with so many iconic sites within walking distance: Notre Dame, Louvre, Shakespeare & Co bookshop, Luxembourg Gardens, etc etc, plus loads of cafes, restaurants, bars, shops and boutiques..... The room is very small but bed was comfortable and the bathroom is clean and adequate. Plus we had a little balcony with amazing view over the bustling St Germain streets. But no noise bothered us at night at all. To be honest, you won't want to spend any time in ur room with so much to see and Parisian life to discover!", "Date": "March 26, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Salt Lake City, Utah", "Title": "“Loved this hotel- great location!”", "Author": "janerenae", "ReviewID": "UR100407390", "Content": "I really enjoyed our stay in this hotel. We were in Paris for 5 days, and stayed here the whole time. You are right next to Notre Dame, and within walking distance of most of the major sites. You are also right next to the RER stop which makes it very convenience to get to the airport & also Versailles (if that is in your travel plans). Every person who worked there was very friendly & spoke English. The resident cat was very sweet as well. We had room 204- no balcony. I did not think the room size was an issue. Compared to other hotels we have stayed at in Europe, it was plenty of space. The bathroom was extremely tiny though, but it was functional & clean. Would definitely recommend this hotel.", "Date": "March 16, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "3", "Sleep Quality": "2", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Ierland", "Title": "“Great Location...”", "Author": "mdev", "ReviewID": "UR100148818", "Content": "The room really is tiny but judging by photos on this site it looks like some are a lot bigger than others. We had room 205 with a balcony which definitley added a nice Parisian/romantic feel to the room but I wonder if rooms without balconies are bigger? I would be interested to find out. I never stayed in central Paris before so I cannot compare it to anything else unfortunately. Check in was perfect and the girl was very friendly. The bed wasnt terribly comfortable but it was fine! The room was a bit chilly at times- I dont know if the balcony contributed to this but the air con/ heater most certainly did not heat the room up. Handy to have a TV, hairdryer little mini bar and plenty of storage space in my opinion. Some poeple have mentioned lack of safet deposit boxes and plug sockets but our roomm had plenty of sockets and a working safety deposit box. The room was cleaned every day and we received fresh towels also. Some people have conplained about the noise but I wouldnt even mention it to be honest. Everything closes really early (12/1 am) which surprised me after reading some of the reviews here. If you are staying in the heart of the Latin Quarter what do you expect ? Similarly I thought that the size of the bathroom was fine... Location is ideal- I booked meals in two of the top ten restaurants on TA and both were a short walk away (max 10/12 minute walk). Right beside Notre Dame and Shakespeare and Co and a direct line to the Eiffel Tower (RER C roughly 10 minute journey). You can catch a bus to the Louvre that takes you directly there roughly a 4 minute journey.... I have mixed feelings however while as I would recommend this to a friend I would ensure that they are aware of the room size, temperature in March etc. I really dont think I would bring my parents here as they would probably rather somehting a bit further out that has a bit more comfort. However I suspect that had I stayed in any other location I would not have enjoyed my trip to Paris as much nor would I have had time to see so much. There are plenty of little wine bars around if you take a stroll that are open till roughly 1.30/2 am and if you are into nightlife thats just around the corner too. I payed €120 for the room... I feel €100 would have been a fairer price OR if breakfast was included it would have felt like better value. I know that rooms are available for €80 - these were all booked up when we tried to book one but I think had I payed €80 per night I would definitley feel as if I had better value for money I dont think the extra €40 for a balcony is worth it. Some people have also said that the staff seemed rude...initally I also thought this but after my 3 day stay I can say that they were extremely helpful with everything and the guy on at the night time was actually very nice and accomodating to any request we had and tried to make conversation with us always. Overall location is excellent, if you can get a room without a balcony value for money is excellent, it is clean and friendly however if you are perhaps a little bit older and are looking for a luxurios break in Paris stay further out....if you want to stay in the action but still have a lovely romantic break this is the place for you!", "Date": "March 14, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Pembroke Pines, Florida", "Title": "“Wonderful, memorable experience”", "Author": "basulto", "ReviewID": "UR99602621", "Content": "A really, really cool boutique hotel. In the Latin Quarter, about 5 minutes walk from Notre Dame, with plenty of excellent and well priced places to eat within easy distance. The walk will take more than 20 minutes if you stop at as many bars and cafes as we did though...But more importantly, the room was very romantic, with a modern design..", "Date": "March 9, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "UK", "Title": "“Fantastic hotel in a great location.”", "Author": "Lydsmate", "ReviewID": "UR99302701", "Content": "I went to Paris with a friend and stayed here for the duration of our stay. The staff were very friendly and helpful. The room was small, but when you're in Paris, how much time do you intend to spend in your room? The restaurants near by were very cheap (between 10& 16 Euros for a 3 course meal) and were very tasty. Also it was perfect for the metro, as it was a short walk away from the metro/RER. I would defineatly stay here again and recommend it to a friend.", "Date": "March 7, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "4"}, "AuthorLocation": "London", "Title": "“Petfect location”", "Author": "KLHM", "ReviewID": "UR99299520", "Content": "This is a very comfortable, friendly and spotlessly clean hotel. The location couldn't be better for sight seeing and eating french food. Thoroughly recommend.", "Date": "March 7, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Plymouth, United Kingdom", "Title": "“fantastic”", "Author": "wilko-pink", "ReviewID": "UR97982829", "Content": "Just returned from a 5 night stay and had a fantastic time. - between 3 metro stations only a short walk - we got the metro direct from CDG airport - staff friendly and helpful - reasonable priced internet, could pay for a time block 24hrs up - right in middle of reasonable priced restaurants (from 10Euros for 3 course meal) - drinks nearby expensive but supermarket about 5 mins walk tha sold everything - room quite small but does not cause any problems - we were two friends sharing a double to save on price and the bed was plenty big enough - we found cheapest to book direct with hotel - rooms cleaned well daily - room looked nice had mini bar, tv, coat hangers, shelves and hanging space, air con heating, shower, lift - TV with international news channels - window over looking busy street but no problem with noise and we went to bed quite early - you can buy Disney tickets at the hotel (pay part to hotel and part when arrive) - area very safe and friendly - we did not get the breakfast but pastries from near by shop all in all had a great stay and would really recommend this area and hotel for a base for exploring paris", "Date": "February 25, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Location": "5", "Rooms": "3"}, "AuthorLocation": "Milton Keynes, United Kingdom", "Title": "“Great location, cozy room.”", "Author": "willbb1977", "ReviewID": "UR95724353", "Content": "The best thing about this hotel is its location. It is just off Rue St Michel near the Seine, so very convenient for rail links around the city and to the airport and eurostar direct on the Rer. Aside from this it is in the heart of latin quarter bustle so there are lots of bistro and shops surrounding. The italian below the hotel is excellent and worth forgoing eating just french food while in Paris. The room was the smallest on the floor (504) but it was spotless, well equipped, and had a balcony above the street adding to the atmosphere, without being at all noisy. Final note is the Velib station outside. Brilliant and convenient, paris rental bikes are just outside when you need to get somewhere without the hassle of the metro while burning off some of the previous days indulgence! Great little hotel, will return.", "Date": "February 7, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "2.0", "Value": "2", "Sleep Quality": "1", "Rooms": "2", "Location": "5"}, "AuthorLocation": "Paris, France", "Title": "“No hot water”", "Author": "clementine14", "ReviewID": "UR91281587", "Content": "Hotel is in a great location. Our room was small as expected, but what was not expected was the cold showers. We asked to move rooms, and were told none were available, although we are aware that the room next door was unoccupied as were we directed to shower there, (after we twice asked reception staff to address the issue of no hot water). Given the relatively high tariff, it did not seem unreasonable to expect a hot shower especially in the middle of winter. The rooms are not soundproof, nor are bathroom fixtures such as toilet seats attached to the toilet base, making urinating rather perilous. We checked out after one night, there was no apology nor reduction in tariff. We found an excellent hotel around the corner and would recommend Hotel Royal Saint-Michel to others looking for a hotel in this area.", "Date": "January 1, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Toronto, Canada", "Title": "“good value for money”", "Author": "stanf96", "ReviewID": "UR91070699", "Content": "the hotel is a great location. close to metro about 200 meters. close to notre dame. overall no problems. the rooms are small, it isn't the Ritz but overall is good value for money.", "Date": "December 30, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Tromso, Norway", "Title": "“Good Location - but very small room”", "Author": "Norwegian_Scofield", "ReviewID": "UR88949362", "Content": "Very ok hotel with a very good location. We pre booked direct from the hotel, and they was fast to answer and very polite. We requested a room high up and we ended up on the 6th floor, that was ok. But the room was a little bit disappointing, the pictures at internet is better than it seems. We had a very small rom, small bathroom, but it was clean and tidy. The people at the front desk was always very helpful. Nice restaurant that is also the breakfast room, but the people working there could smile a little bit...i did not feel so much welcome there. But after all, a nice hotel, good location, but it is a little bit expensive compared to others in the same area.", "Date": "December 3, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Sydney, Australia", "Title": "“Friendly front desk and nice, cheap rooms.”", "Author": "Ms_D_Writes", "ReviewID": "UR88332617", "Content": "We were looking for a hotel close to our favourite restaurants and bookshops and the Cluny, and selected this one entirely on those criteria. It was a happy chance! The front desk was populated with wonderful staff who were only too happy to help at any hour (including a 5am emergency confab when we were stranded thanks to broken-down Eurostars). In addition to the human staff, we were privileged to meet Isis, who made our stay even more special. Sited within easy distance of St Michel metro, and a very short walk from Notre Dame , it is a beautifully located hotel, there's even a velib stand right out the front. Rooms are very comfortable and large for the price and area. The bathroom in the triple room was pleasantly large, and included a full-sized bath. I also stayed an extra night in a single, which had the standard small Paris bathroom, but was nicely appointed nonetheless. We were there when the temperature plumetted and early blizzards rolled in. The heating was up to scratch in every part of the hotel, without being oppressively so. Next door is an Italian restaurant, which made me laugh at first, but we had the second-best meals of our trip there at a third the cost of the best. Aside from this and some of the good little street food stalls nearby, you're safer heading down to Saint-Germain for food, as most of the nearest eateries are more concerned with tourist trade. While it is really just a nice mid-price hotel, the excellent staff really lifted the experience of staying here and made it a firm fave for all three of us.", "Date": "November 27, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Minneapolis, Minnesota", "Title": "“Great Location”", "Author": "rockyjoe", "ReviewID": "UR88231658", "Content": "Nice hotel in a fantastic location. The hotel is within easy walking distance of many of the city's most popular tourist sights, including Notre-Dame, Saint-Germain-des-Prés, the River Seine, the Louvre and the Orsay Museum. It is also really close to the St. Michel Metro Station and near tons of restaurants. The room was very small but nice. Our room was on the street side and we did not hear any street noise. There is a computer in the lobby with internet access but it did not work well at all. It took me about 20 minutes to write one short e-mail (I gave up after that). The staff at the front desk were friendly and all spoke English.", "Date": "November 25, 2010"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Mexico", "Title": "“LOVE IT ... LOCATION LOCATION LOCATION”", "Author": "IceRonin", "ReviewID": "UR87950467", "Content": "The cat is cute ... but the hotel location is better. Lots of restaurants and a 3 minute walk from Notre Damme ... Excellent Hotel. Clean and friendly staff. GO FOR IT!!!", "Date": "November 23, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Bega, Australia", "Title": "“More than you expect”", "Author": "strevo", "ReviewID": "UR87727349", "Content": "We saw this rated as 2-star on trip advisor but it is much more than that. We had a great room and the location is superb. We had no problems with noise as the windows are double glazed. The staff were very helpful and friendly. In fact we had no problems at all. Lucky? Perhaps, but then again, this doesn't happen by accident. All things considered, this is a great place to stay. It doesn't pretend to be something it is not Steve and Pam", "Date": "November 21, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "2", "Overall": "3.0", "Value": "3", "Sleep Quality": "1", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Oslo, Norway", "Title": "“Good location - average hotel”", "Author": "winedine1", "ReviewID": "UR87170832", "Content": "The hotel have a very central location in the Latiner Quartier. The room is very small and the air condition dosen't work properly, and it was very much noise from the street all day and night. A simple hotel with good location.", "Date": "November 15, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Atlanta, GA", "Title": "“Great experience!”", "Author": "rsprouse", "ReviewID": "UR83741017", "Content": "We stayed here in October on our first trip to Paris. It was a little jewel box of a hotel. An outstanding location in the heart of everything. Plenty of great restaurant options within walking distance. The staff was very nice and our room was clean and modern. The only negatives that I can come up with is that the balcony rooms may be a problem for those that are light sleepers. NIghtlife is right outside your window and it stayed lively until the wee hours of the morning. The noise did not bother my wife or myself one bit, but we live in the city and like noise. We would gladly stay their again.", "Date": "October 16, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "2", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Tampa, Florida", "Title": "“Great location, nice staff, cute hotel cat”", "Author": "shan055", "ReviewID": "UR83504044", "Content": "My husband and I stayed at this hotel for 5 nights. The location is the best thing about this hotel - exceptional, one block from the St. Michel metro and a few blocks from the RER (airport train line), as well as a few blocks from Notre Dame. The rooms are average size, very clean, and average decor. The hotel staff was extremely friendly and helpful, and they have a great cat who sleeps in the lobby (Isis, she is a sweetie). There is one computer in the lobby that guests can use (you buy a Wi-Fi card from the hotel for 5 Eur per 24 hours, or pay for Wi-Fi in your room if you have your own computer). There are lots of restaurants around the neighborhood and the Latin Quarter is a safe and lively area. We stayed at this hotel years ago and returned this time to find the same nice place. One negative is that the street in front of the hotel is very noisy with restaurants and nightlife, so sleeping was a little bit difficult - ear plugs helped. The carpet in the hallways could use a little sprucing up, but all in all, a comfortable, clean hotel. Breakfast was 12 Eur so we got coffees and baked treats down the street at Starbucks and other surrounding cafes. We would definitely stay here again.", "Date": "October 14, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Melbourne, Australia", "Title": "“Location, location, location!”", "Author": "ozygurl1", "ReviewID": "UR82361229", "Content": "We stayed three nights in September, and couldn't have been more pleased. Only metres from the St Michel Metro station off the Boulevard St Michel, we were ideally located to explore the sights on foot. In addition, there were a multitude of restaurants and cafes right on our doorstep. The room was basic, but very functional, although the shower was miniscule. Hotel staff were friendly and service was of a high standard. Highly recommend to those who would like to really get a feel for Paris.", "Date": "October 6, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "London, United Kingdom", "Title": "“We have stayed here twice and would come back again”", "Author": "missoriginality", "ReviewID": "UR81781896", "Content": "We first stayed at this great little hotel in July 2010 and, on returning to Paris in September, chose to stay here again. The rooms are a great size (particularly for Europe!) and are clean and practical. The service is good - we were even given an upgrade to a deluxe room with a balcony for no reason! Although the best thing about this hotel is the location. Right in the heart of the Latin Quarter and an easy stroll to the Metro, RER, Notre Dame and many exciting restaurants and bars. I definately recommend staying here.", "Date": "October 1, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Milton Keynes, United Kingdom", "Title": "“THE hotel to stay at in Paris!”", "Author": "JWT0706", "ReviewID": "UR80448968", "Content": "We were pleasantly surprised with this lovely hotel - just across from the Notre Dame cathedral. Great value for money! We were 3 and this room had a fantastic, spacious room for 3 at £180! Classy, comfortable and trendy - we loved our room. Bathroom was good. Our friends stayed in the luxury suite upstairs and had breakfast thrown in which they said was very good. We skipped breakfast because we opted for fresh patisserie from the boulangerie around the corner. This hotel is a 20 minute walk to Les Halles and Le Marais. We also walked 20 mins in the other direction to get to la rue Mouffetarde. The staff were ok and friendly enough. I have stayed in various hotels in Paris and this one beats them all! I loved it and will definitely go back.", "Date": "September 21, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "4.0", "Value": "3", "Sleep Quality": "2", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Schrollbach, Germany", "Title": "“Clean, well-located hotel in the Latin Quarter”", "Author": "Steve_Cynthia", "ReviewID": "UR78756351", "Content": "We chose the Hotel Europe St. Severin for a weekend get away to Paris based on walking by it and being impressed by the lobby/staff on a past visit. This was our 10th trip to Paris over the past decade. In the past, we have stayed predomenently in the 7thArr. though we have also stayed in the 1st & 6th. The hotel was perfectly located two blocks off the Seine and just off of Rue St. Michel. Parking in the St. Michel parking lot was easy less than 100m away for a fee of 25 Euro per day. The hotel was clean, convenient, and the staff was freindly. The price was clearly indicative of the location and maybe a bit pricey for the 2 star rating but in our view was worth the money for the convenience. The Metro was a two minute walk from the hotel, as was the RER. The walk to Boulevard St. Germain was just 4 minutes, as was the walk to Notre Dame. We tried several resturaunts in the area that we recommend. Two that stand out are Le 24, which is off of Boul. St. Germain on an alley less than 500m from the hotel and served excellent traditional French food and Chez Ernest is a mere 90m from the hotel and served a fantastic menu at VERY reasonable prices. Some areas for improvement on the part of the hotel: (1) On two occasions we were given the wrong room key by the hotel reception. It only caused a minor inconvenience but the fact is that for the short period we had a different key in our posession, we \"could have\" had access to other folks rooms were we dishonest people. (2) The housekeeping staff apparently employs a color blind maid who cannot tell the difference between the bright red \"Do Not Disturb\" sign and the bright green \"Please Make Up Room\" sign. We had to stop her from entering one morning at 0900 while we were showering and preparing for the day. These minor issues aside, we do recommend the hotel and will stay there again when we visit the Latin Quarter.", "Date": "September 8, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Egypt", "Title": "“Location Location and Location”", "Author": "Dalia_Ghaly", "ReviewID": "UR77581474", "Content": "we spent 4 days in paris me , my husbnad, my 6 years old daughter and our 17th month baby , the hotel was in a very lively and vibrant neighborhood, the triple room was aith adequate size, the hotel staff was very helpful they let us check in early at 7:00 AM with no extra charges , though they neglect our request during booking about providing a cot but to be frank snce we spent all out time exploring the city we did not ask for it , the hotel is surrounded by dozens of resturants and night spots and they are opened till after 2:00 AM , it is 2 blocks away from st Michel metro station, 2 minutes walk to 2 stops of open tour, and 1 minute wlak from seine river , it is defeinietly better that Madeline area in which I stayed before, , overall the hotel is good with very resonbale price next time will stay in same neighborhood but I may try another hotel , I recommend it for young couples and families for the location and value for money", "Date": "August 30, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "3", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Raleigh, NC", "Title": "“Perfect location, great hotel”", "Author": "Eurotraveler14", "ReviewID": "UR72521305", "Content": "This hotel's location could not be more perfect for the Latin Quarter and sightseeing locations in that area. Everything is literally around the corner. The deluxe room price via their website was about average for hotels in the area so it was not a steal but acceptable for Paris prices. I requested a quiet room, so it was on the inner courtyard side and not the street side, which was blissfully quiet and peaceful. We couldn't hear anyone inside the hotel and certainly not any street noise despite being in a very busy part of town/street. A/C was great but hardly needed and the room was a nice size with a small sitting area, bed area and decent-sized bathroom. It was perfectly clean and nicely decorated. My travel partner who has quite high standards was raving about the comfort and location of this hotel.", "Date": "July 27, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Sleep Quality": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Brisbane, Australia", "Title": "“A gem on the left bank!”", "Author": "KylieW45", "ReviewID": "UR72480361", "Content": "I had discovered this hotel on the Trip Advisor website and what a find it is. The rooms are clean and well maintained and the location is fantastic. In the heart of the left bank and surrounded by great shops and restaurants, I'd highly recommend this hotel. The cost is very agreeable too!", "Date": "July 26, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Haifa", "Title": "“Excellent in all aspects”", "Author": "fistuk", "ReviewID": "UR72395748", "Content": "My wife and daughter have stayed in the hotel for six nights on the first week of July. It is my wife's fifth visit to Paris and the best one so far, primarily because of the hotel. It is centerally located in a safe yet busy quartier latin with all the facilities within close reach. Some tips which I used after reading the reviews. I called the front desk after making the reservation and asked for a quiet room because of the potential street noise. A quiet room which faces the hotel inward was reserved and my wife and daughter did not hear a sound! So all the noise sensitive sleepers can be reassured. The only but was that the room was a little bit smaller than the other rooms, but this was only a minor issue. There is no coffee maker in the room, so they brought an elecrtic kettle which was very helpful. Other than that, all reviewers praises are reconfirmed and we do highly recommend this Parisienne atmosphere hotel much more then any other chain hotels even with the same rating", "Date": "July 26, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "houston, tx", "Title": "“Excellent Choice”", "Author": "flamingo66", "ReviewID": "UR72312738", "Content": "Booked this hotel based on TripAdvisor reviews as I have good luck using the site in the past. Excellent location. Steps from the Metro and RER and a fairly easy walk to to Notre Dame, Louve, and Cluny Museum. Some decent restaurants in the surrounding area and some killer gyro shops. Hotel staff was very friendly although the English to French was not always great. But they got us where we were going. Room was on 5th floor with a small balcony we used for breakfast after buying some stuff at a local market. While the air conditioner is not up to Houston, Texas standards, it did fine and it was cool enough we could open our balcony doors at night to help it cool and the street noise was not an issue. Bath and furnishings were great with the wood floors and stone wall behind the bed. Would recommend this hotel to anyone. And the room staff always kept our room spotless. Also, while there, if you you time look into the bike tours of Paris offered by Fat Tire Bike Tours. We took the night ride and it included a boat ride down the Seine. Lots of fun and it is run by American kids so you get to practice your English again!!! Money well spent on the hotel and the bike ride.", "Date": "July 25, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Tampa, FL", "Title": "“A lovely stay--will return”", "Author": "Genyi1681", "ReviewID": "UR70057189", "Content": "My husband and I stayed here during our recent (and first) trip to Paris. It was a bit overwhelming trying to decide on a hotel, but I feel like we hit the jackpot with this one. We'll definitely stay here next time we are lucky enough to be in Paris. First off, its a fantastic location in the Latin Quarter, very central to the metro and close to Notre Dame. There are about a million cool shops and yummy restaurants within walking distance and many are very reasonable. Our room had a charming little balcony, and an exposed stone wall, which I though was very cool. Yes the room and bathroom were on the small side, but I understand this is common in Europe, and frankly I think it adds to the experience. Though we stayed for 5 nights, and Saint-Severin can be a busy street with nightlife, tourists, and performers esp. on the weekend, we didn't have any noise issues. The staff was very helpful, and spoke english very well, which was good since our french is terrible (though we did try, which they seemed to appreciate!) Finally, we really enjoyed the hotel cat, Isis, who was always sleeping on the sofa downstairs. It may seem silly, but she made the place feel quite homey and welcoming, and made us a bit less homesick for our own cats!", "Date": "July 7, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Boston", "Title": "“A Great Hotel and an Amazing experience”", "Author": "RWills81", "ReviewID": "UR70052658", "Content": "This hotel was a great place to stay and relax from the fast pace and large city of Paris. We had a room on the 5th floor with a balcony. Balconies and Paris are worth the extra price. The view down to the street gave us endless entertainment eating on our balcony from the food we picked up at the open markets or viewing the morning sun reflecting of the Paris rooftops. Not only was the balcony alone great but the room was much bigger than your average Paris Hotel with a comfortable bed and A/C. People complain about the noise outside as the Latin Quarters is a hot spot, I didn't think it was bad at all, close the windows you don't hear anything, open them up and its the sounds of Paris, can't go wrong either way. The staff was very nice and helpful, we didn't have a chance to eat dinner or breakfast at the restaurant and I would go back to this place again. You are around the corner from Saint Michael Fountain and less than 5 minute walk to Notre Dame.", "Date": "July 7, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Singapore, Singapore", "Title": "“Excellent location in Paris”", "Author": "snarfley", "ReviewID": "UR68715005", "Content": "Yes, it's expensive for the size of the rooms, but the location is excellent. Paid a little extra for a balcony, which is worth it. Rooms have everything you need. Right near the RER if you have a flight from CDG to catch (which I did). Near great shopping, food, sights. Would definitely stay here again.", "Date": "June 26, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Bridgend", "Title": "“an amazing experience”", "Author": "nightress", "ReviewID": "UR68569965", "Content": "I really enjoyed everything about my stay with the hotel. The room was stunning and very quite, we did check out trip advisor and most guest said that it was loud till 3 in the area, and tbh i didnt have any problems i found it to be quite i heared no noise at all. The hotel is in a great loaction, its just around the cornor from notra dame and about 20min walk to the louvre. If you dont want to walk far the metro is aroud the cornor, or the boata bus which stops at every major attraction. The staff where very friendly and willing to help out as much as they could reguarding directions. I loved the little cat isis. The hotel had a very friendly atmosphere. I loved the whole atmosphere of the area when we stayed, There was a whole music festival on the monday, tuesday there was street dancers and perfoming art dancers. I'm not sure if we where lucky or it here all the time, but for me it made the trip a lil more special and exciting. I'm defo planning a return trip with my partner. I loved isis the cat she was so friendly.", "Date": "June 24, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "2", "Sleep Quality": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Florida", "Title": "“OK but I would look elsewhere first”", "Author": "randyg1124", "ReviewID": "UR66799532", "Content": "The room was very small but was mostly clean, stayed on the 4th floor which had a balcony. A/C did not work either did the TV. Location is good. The breakfast is not worth the 12 euros (very much a rip-off). Staff was OK. I would look elsewhere first.", "Date": "June 7, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "toronto", "Title": "“A most wonderful stay in Paris.”", "Author": "vmcj", "ReviewID": "UR66737763", "Content": "This was our third stay at this hotel and can't imagine staying elsewhere. The hotel rooms are much more than the star ratings would indicate. They are clean and quiet despite being in the midst of the Latin Quarter hub of St. Michel. Only minutes to the Seine, Notre Dame, Saint Chapelle, cafes, restaurants, shopping etc. The staff are the friendliest of all hotel staff we have come upon during many visits to Paris. The staff are helpful, knowledgeable and go above and beyond to make your stay a pleasure. We would definitely recommend this hotel.", "Date": "June 7, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Houston", "Title": "“Great location”", "Author": "clausmte", "ReviewID": "UR66028227", "Content": "-First of all the location of this hotel is excellent, just two blocks from the Metro St. Michele /St. Germain, and easy to get to from the Airport CDG Roissy. -The staff is very helpful, they speak very well English, and reccomended us a nice restaurant to celebrate my birthday. -There are several cafes and restaurants to choose, however it is worth it to walk a couple of blocks south of boulevard St. Michel to avoid the \"tourist\" restaurants, and find nicer and cozier places. Overall the whole area is full of life, you see a lot of people -locals and tourists, walking in the streets, having a drink or eating the outdoors cafes. -Our room was clean and spacious. We had a suite, and for our surprise it was like a little duplex, very peculiar and nice. -We went last May so the weather was very nice in Paris. We were lucky in that sense because we did not see any A/C unit, and had to open the windows, but we slept very well, although for some people may be difficult due to some noise during the night, but it is not very bad. We could see from out window the NotreDame cathedral. -There is a cute cat who lives in the hotel, her name is Isis, and according to one of the staff members -\"She is the boss\" - We are a young to not so young couple (our age average is 46 years old of age), so we think for us and for younger people, this is a good place and location, maybe for bigger families and people who would like a more relaxed time, this location may not be suitable. -Overall a great experience. We are planning to go back to Paris and stay in this hotel again.", "Date": "June 1, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "5.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Newton, Massachusetts", "Title": "“Very good value for money. My 3rd time at this hotel...that says it all”", "Author": "LRO2008", "ReviewID": "UR65372451", "Content": "Once again, i was not disappointed with the St Severin. Had a comfortable room on the 4th floor,over looking the Rue St Severin...my favorite location in the hotel. The front desk staff all speak English and are very helpful, in our case particularly so for my friend when her flight back to the US was cancelled -becos of the volcano ash problem -and she had to stay on for 4 extra days. The hotel is located steps away from the St Michel Metro station, and Notre Dame is a 5 minute walk. There are literally dozens of restaurants nearby.", "Date": "May 26, 2010"}, {"Ratings": {"Service": "2", "Cleanliness": "4", "Overall": "3.0", "Value": "4", "Sleep Quality": "2", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Dallas Tx", "Title": "“very nice hotel”", "Author": "jdawg2201", "ReviewID": "UR60687760", "Content": "This was a very nice hotel in the Latin Quarter. The hotel staff was very helpful. The room was small but that is common in Europe. But very clean and look nice. the bet was comfortable. The room had a nice little mini-bar. The location was in a good location for me, it was around the block from RER and the Metro, and just across the bridge fromNotre Dame de Paris. The only down side was the room was noisy from people on the street. but that did not bother me. Now the strange thing about this hotel was you left your key at the desk when you left. but over all for the price a very nice hotel and would stay there again next time i go.", "Date": "April 7, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Telford", "Title": "“Very good hotel, nice area and helpful staff”", "Author": "Nath182", "ReviewID": "UR57784937", "Content": "Very nice hotel, clean and is around 2 minute walk from the Notre Dame and 15-20 mins to Le Louvre. There are around 30 restaurants within a 1 minute walk from the hotel so you can always find somewhere to eat night and day. The only thing I could note would be the lack of power sockets in the room, we were in room 214 and the only power socket in the room was behind a large wooden set of drawers containing the safe and the fridge which were plugged into the socket. Other than that the room was perfect, a comfortable bed, a nicely decorated ensuite bathroom with shower. There was a lot of noise from outside but the double glazing windows kept the majority of that out. Overall I would definately recommend the hotel to anyone staying in Paris and wanting a central location.", "Date": "March 5, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "London, United Kingdom", "Title": "“A Gem”", "Author": "Stephen_Lloyd", "ReviewID": "UR57494876", "Content": "6 of us stayed for two nights on the last weekend of Feb and had a wonderful time from this hotel. Between us we had rooms 215, 216 and 514 - all were fine although 514 was slightly larger and more modern, with more sun as it was on a higher floor. From start to finish there was very little to complain about with the hotel. Previous reviews have mentions the luggage room is not locked so hardly secure, don't leave anything valuable in the bags stored there, which is common sense, and we did open our window on the second floor to cool the room which was quite hot when we came back - but the noise from the street was minimal and certainly not a problem. There's some bustle but it closes at a reasonable time. Arriving at the hotel from the airport was a snip on the train, just 4 stops and a 200 yard walk. Going back took longer due to weekend working on the lines, whic his worth checking as the delay could be significant and cause a missed plane. Our flgiht was cancelled and the hotel staff were helpful in finding rooms for us and also in contacting Air France. This is the Latin Quater, it's a busy area, so there's a lot around you in terms of places to eat, drink and walk. Do not come here for a quiet reclusive weekend, it simply will not happen. Worth noting there's a Canadian bar nearby where beer was actually affordable. Paris is expensive these days. The Eglise is lovely and a very plesant surprise. Public Internet access is a single Pc in the foyer, a bit slow and a French keyboard to get used to. Overall we can't wait to go back", "Date": "March 2, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "4", "Sleep Quality": "1", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Massachusetts", "Title": "“Impossible to Sleep Here!”", "Author": "EricaLynn", "ReviewID": "UR57111667", "Content": "I really really wanted to adore this hotel, where my husband and I stayed for three nights in November 2009. When we got off the RER B from CDG at the Notre Dame/St. Michel station without having to change trains and then had to carry our luggage less than a half-block to the Hotel Europe Saint Severin, I bragged to my husband about how I’d clearly done a great job picking a well-located hotel. We entered the charmingly worn lobby and were greeted by the resident cat, and I was in love. We arrived around 8 in the morning and learned that the hotel was completely full, so our room wouldn’t be ready until the official 1 pm check-in time. We therefore stored our luggage (note that storage is in an unlocked closet hidden around a corner from the reception desk, so I wouldn’t describe it as secure) and ventured out to wander around the city. Our room was ready when we returned at 1:00. We booked a superior double room with balcony and had requested a renovated room at the time of booking, after having read here that some rooms have yet to be renovated. Reception had noted this request and confirmed that they were assigning us to a renovated room, located on the second floor. We avoided the hotel breakfast and Italian restaurant, since this is Paris and there are much better dining options everywhere you turn. Of note, staff spoke excellent English and were generally helpful. The hotel had an odd practice of requiring guests to leave their room keys at the front desk when they left the property, but we rarely had to wait long to get our key back when we returned to the hotel. I did notice that even if we came in and spoke with a receptionist we’d not previously seen, all we had to do was state our room number, and we were handed the key without any confirmation we actually belonged in that room – obviously, traveling with valuables is a bad idea in general, but this particular hotel definitely had some lax security practices. We used a tiny creaky elevator to bring our luggage upstairs but otherwise used the stairs throughout the rest of our stay. The clean, tastefully-decorated room was somewhat small but pretty typical for Europe, and the layout and use of a pocket door for the bathroom optimized the use of space. There was a decent amount of drawer and hanging space, and the small safe in the armoire could accommodate several cameras, a netbook, and important documents. Double doors opened to the balcony, which was essentially a narrow platform running along the outside of the building, with iron gating used to provide symbolic (though not really physical or visual) separation of the balcony areas for neighboring rooms. There was a tiny outdoor café table and two chairs situated on the balcony, and the view was of the bustle of the pedestrian Rue Saint-Severin. This bustle is a great segway into why I would never again stay at this hotel, as incredibly charming, well-located, and reasonably priced (for Paris, anyway) as it was. When I travel, I spend very limited time in my hotel room and generally use it for the sole purpose of sleeping. Unfortunately, sleeping is virtually impossible at the Hotel Europe Saint Severin. The noise from the street is incredibly loud at all hours of the day, be it a weeknight or weekend night. We thought we might get some relief when the restaurants closed in the wee hours of the morning, but apparently this is when construction vehicles move in to take advantage of the lack of pedestrians – they started doing work on one of the buildings across the street using very heavy equipment and lots of loud machines. My understanding from reading reviews was that double-glazed windows in the renovated rooms meant guests could hear very little from the street, but that couldn’t be further from the truth! I travel a fair amount and was prepared with earplugs, yet even with these in (coupled with a dose of sleep medication one night out of desperation!), the noise remained unbearable. It’s worth noting that I’m a light sleeper, but even my husband (who could probably sleep through a home burglary) was disturbed by the noise. Further complicating things is the fact that the hotel’s HVAC system is set up such that it can provide either heating or cooling, but not both. Because we were there in November, they’d switched over to heat for the season, and the switching process is apparently complicated enough that it can’t be modified to account for weather fluctuations. The weather during our stay was unseasonably warm (in the 60s F), and there was clearly a lot of additional heat being generated from the building, as it was VERY hot in our room. For perspective, I should mention that I get cold very easily and frequently set the heat in my home to 75+ degrees and still shiver a bit…so for me to feel the hotel room was uncomfortably warm is saying a lot. Not realizing the HVAC circumstances, we turned our room thermostat to cool with the fan on high. This only made it hotter, as it blew hot air instead of cold (this is when we spoke with reception and found out that there was no functional A/C). So what choice did we have? Right, we opened the balcony doors. There were two huge problems with this, however. As I mentioned, the balcony wasn’t really separated from the balconies of other rooms, so anyone could have simply walked into our room while we were sleeping. The bigger problem, as I’m sure you’ve guessed if you’ve been reading this entire review, is that the open doors meant the already-atrocious noise situation became completely intolerable. Even in writing this review, I’m nostalgically recalling the romance of the hotel and its location. But I can’t stress enough that no matter how tempting it might seem, you should avoid staying here if you want to get any sleep at all – it’s not worth ruining your vacation because you’re simply too exhausted to enjoy it!", "Date": "February 25, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Oslo, Norway", "Title": "“PERFECT hotel”", "Author": "pu9", "ReviewID": "UR56887484", "Content": "I stayed there with my friend for 5 nights. When we first arrived the receptionist was very friendly, and helped us with everything! And it stayed that way through our entire stay. This was really the best hotel I've stayed at in Paris so far. Great location, a good bar street, and if you take the metro a couple of stops you come to a great shopping quarter(saint german). We slept like baby's each night in our fantastic room. Its a mystery this hotel is just rated as a ** hotel, because it really felt like so much more! I'll definitely go back there!", "Date": "February 23, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Kuwait", "Title": "“Amazing location and Great valuey for money”", "Author": "Traveller_818", "ReviewID": "UR56449485", "Content": "We booked online for this hotel from their main website for 6 days stay (Feb 10-16, 2010) and didn't found any problem. Right away on the same day of my booking I received a confirmation for my booking from the Hotel. Great value for the price since its a two star hotel but the location is amazing. We didn't have problem going to any place since the hotel is very near to RER St Michel station. We didn't even book for any travel tour (considering we have kids along with us), we are just travelling by ourselves thru train. Very accessible and restaurants are just outside the hotel door. Mc donalds is near and you can even see a small supermarket just a block away from the hotel. Hotel staff (Canan, Ana and the rest of staff) are very helpful and accomodating. They even arranged our shuttle to pick us from the airport at a very friendly price. So no worries at all. Wifi is also available for a small fine. We tried the breakfast from the hotel and found it fair for the price but we suggest to try also from other restaurant outside that have same cheap price. We will definitely stay on this hotel for our next visit.", "Date": "February 19, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "5.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Copenhagen, Denmark", "Title": "“Amazing value for money”", "Author": "CopenhagenBella", "ReviewID": "UR55663986", "Content": "This is a great hotel, and I'd fully recommend it! Friendly staff in a truely charming, original parisian hotel, in a great location!", "Date": "February 10, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "2", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Suffolk", "Title": "“Brilliant base for easy access”", "Author": "wdb30", "ReviewID": "UR55101143", "Content": "We did weekend with another couple and walked, wined and dined a lot! Ask for a balcony, only £10 a night more. V small room but OK for a base. Tiny but really nice bathroom. Bad sleeps though, A/C made a noise but didn't cool the room, have to keep 2nd floor windows shut for noise so very hot and sticky night. Probably my fault for forgetting to raise it with the hotel!ichel Metro and hence everywhere else. Plenty within short walking distance too, check out the narrow alleys just to the west for some great restaurants, but watch the bar that charges £10 for a pint. Say hello to the famous cat that sleeps 24/7 in reception. Would stay here every time in Paris!", "Date": "February 3, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "2", "Location": "4", "Rooms": "3"}, "AuthorLocation": "Seattle, Washington", "Title": "“Good Location (In the Heart of it All)”", "Author": "kprunella", "ReviewID": "UR50648951", "Content": "- Good Size Room (Queen Bed) - Very Clean - Walking Distance to Notre Dame. - In the Middle of Resturant and Market Area Review: Stayed 1 Night at this Hotel. This was twoard the end of our One Month Trip. Started out in paris for 7 Nights at a different Hotel then made our way around the country back to Paris for one more night. It's a easy walk to this hotel from the Metro (St-Michel). It's in a pedestrian area with many Resturants and Markets. The hotel staff wasn't very friendly, but they where helpful. The room was spacious, clean and had a nice view of the market area. Safe Location. Fairly quiet being in such a busy, populated area. Good size bathroom very clean. Small Service Elevator. Quick walk to Notre Dame. Near the Metro Line that can take you to the Louvre and Orsay. We walked it was about 15 mins. Directions: From Paris Gare Lyon. Take Line 1 (La Defense) to Chatlet. From Chatlet take Line 4 (Porte d'Orleans) to St-Michel. From there it's a quick 8 Min walk south-east from the Station.", "Date": "December 4, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Location": "5", "Rooms": "2"}, "AuthorLocation": "San Juan", "Title": "“Could not beat the rate, Great Location”", "Author": "MSK-SJ", "ReviewID": "UR49174219", "Content": "I have never left a review before so this is a first, this might be long but these reviews have been so helpful. We booked directly though the hotel's website which gave us the cheapest rate. The location is off the corner from Place Saint Michel, there is a Metro Station right there. We found this to be one of the best stops because if you used the Metro as much as we did, the Saint-Michael / Notre Dame stop is well connected to other Metro lines. The Hotel is also about two blocks from the Notre Dame cathedral. It's location was great for all the tourist attractions. This is not a 5 star hotel, it is two star, but since we wanted a safe, clean place just to sleep and at an affordable price this fit the bill. The staff was friendly and spoke very good English, in fact we arrived early and they got our room made up in an hour. They have an area to leave baggage, don't freak out, there is no lock on the door and they don't give you a ticket but apparently it's safe -- our bags where there upon our return. Since from all the reviews I have read that Paris hotel rooms are small I was mentally prepared and our room was small. The room was very clean, comfortable bed, don't bring big suitcases, they have an armoire to hang your clothes, small flat panel TV (that had CNN intl). The shower is small but had excellent pressure and very hot water but word of advice bring your own toiletries, the Hotel only provides a bar of soap. The downside is since we were there during the start of winter we would open the windows to let in the cool air (since they turn off the AC) and since our room faced the street you would hear the noise from the street which included loud bars, cafes, drunken Parisians singing at the top of their lungs and at 5:00 am the beep, beep, beep of the garbage truck and weekends were worse. See if you can book a room towards the inside. I would not book with breakfast included since there so many restaurants all around and right around the corner to the left was a bakery that was open very early that has baguettes and croissants and good coffee. The area of the hotel is in the Latin Quarter, so it looks like something out of a postcard from France with cafes and cobblestone streets and lots and lots of restaurants and tourist shops. You're near the area of the Sorbonne, so there are a lot of students. By the way, you also have to leave the key every time you leave the room with the front desk which took us a while to get used to, but nothing happened. There is no free wi fi, you pay about 3 euros and they give you a code which is good for 24 hours, but as we found out free Wi FI is quite rare in Paris, if your lucky, some Mcdonald's have it but it was very iffy. I wouldn't recommend this Hotel for a family but for a couple or a single traveler, this is a good hotel with an affordable, central location to get to all your must see stops.", "Date": "November 14, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Location": "5", "Rooms": "3"}, "AuthorLocation": "UK", "Title": "“Excellent for short stay in Paris”", "Author": "manyplaceslittletime", "ReviewID": "UR48546872", "Content": "Superb location, clean and tidy hotel. Staff are friendly , knowledgeable and helpful. Good breakfast (cost 12 Euros). Cheapest rooms are very small but comfortable. Lovely resident cat (ISIS). Wi-Fi (charge). Lots of restaurants in the area. An excellent base to explore Paris, we will stay there again. Book directly on the hotel website - these are the cheapest rates.", "Date": "November 5, 2009"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "Austin, TX", "Title": "“Great second stay!”", "Author": "texgem", "ReviewID": "UR48450771", "Content": "Second time to stay here, and I wasn't disappointed! The five star is for the value and cleanliness. Great location in the bustling st Michel area. Literally steps away from st Michel metro station and an easy walk to Notre dame. It's located on a side street, and a balcony room is a must. The staff are extremely friendly, helpful, and speak English. The room was adequate, bed comfortable, and bathroom was clean with great water pressure in the shower. Will definitely stay here again! The restaurant across the street, Le Menhir, is also very good.", "Date": "November 3, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Location": "5", "Rooms": "3"}, "AuthorLocation": "Australia", "Title": "“Great location, affordable value for money hotel .”", "Author": "Italytrippers", "ReviewID": "UR47365381", "Content": "My husband and I stayed at Europe St Severin for 3 days last week. This was our 3rd visit to the St Michel area, all in different hotels. Still looking for the right hotel! The Europe St Severin hotel was value for money for the rate I paid. I suggest the proprietors of the Europe St Severin invest a bit of time and effort into a spruce up of the hotel. My initial impression was of a hotel being loved to death. It is obviously very popular and the location and pricing are great but just a bit more attention is required. Our room was clean as was hotel itself. All staff were very friendly, helpful and spoke English happily. Our polite efforts in French are excruciatingly awful. We had a balcony room overlooking Rue de La Harpe, which with restaurants the length of it is very noisy and smelly unless one loves Indian, Asian et al. The combined aromas wafted up and into the room. Double glazing on doors and windows would be advantageous. Rubbish dumpster and street washing trucks very early in the mornings made an horrendous noise and late night restaurant clients were also audible. The hotel guests were not noisy in themselves but noise from rooms and corridors did travel. The bedroom was spacious, had the most floor area we have had in a Parisian hotel. As is common in France the toilet was a tiny room separate from the bathroom area, which was a very small open plan door-less space with large corner bath behind the built -in wardrobe wall. No privacy with visibility from bedroom area. The shower is going to cause water ingress behind the tiled walls. Other critiques have mentioned the idiosyncrasies of the handheld showers and in a building the age of this one I'd have concerns about structural damage it must be causing. 2 of the bedroom lights had the wobbles and required maintenance attention. Room had appropriate furniture and bed was one large bed, in Europe called a Matrimoniale - not two large singles pushed together, so that was good. Overall decor spartan but adequate. The wooden floors are very cold in winter, in fact the room was very cold but admittedly winter arrived unexpectedly early in Paris. Bed with duvet was warm and comfy. I particularly sought out a room with balcony which we valiantly used in spite of freezing conditions out on it (not hotel's fault obviously) but suggest they ditch the absurd recycled black rubber tyre chairs. They might be waterproof but are ugly, uncomfortably low, only suitable for people the height of a pygmy. Two weatherproof outdoor chairs of a normal height would enable guests to enjoy their balcony and watch whatever is going on up and down the streets. The area is lively and vibrant. The main hotel lift is very large and modern. The reception area is large but all furniture was shabby and uncomfortable and maintenance was overdue on the odd chair or more. The tiny area used for the breakfasts is not adequate for the number of clientele however I suggest what was available was not worth 12 Euro PP. A Macdonalds is at the other end of Rue de La Harpe, a Boulangerie and Paterisserie is around the corner and across the road next to Chez Clement the gorgeously kitsch Happy Days Diner had a wonderful choice of basic meals, including breakfast, for extremely good prices. A hearty breakfast for 2 there would not cost 12 Euros. We had a dinner at Chez Clement and at Happy Days and both meals were perfect whilst going from one end of the spectrum to the other price wise and the diverse decor at both venues was lovely. I recommend both. The St Michel area is a very easy Tourist location due to the St Michel Metro/RER links, and proximity to the Seine, Notre Dame, and numerous other easily accessible sites. It is perfect for walking around and by following the Seine and crossing the many ponts the majority of must see Paris monuments and museums etc., will be reached.", "Date": "October 20, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Location": "5", "Rooms": "3"}, "AuthorLocation": "Ottawa, Canada", "Title": "“Great location, helpful staff, room slightly larger than average”", "Author": "RossOttawa", "ReviewID": "UR47140158", "Content": "Within easy walking distance of Notre Dame, lots of good restaurants, near St Michel Metro. Deluxe double room with wrap-around balcony with table and two chairs on each side of the wraparound was very comfortable. The front desk staff was very friendly and helpful. The hotel cat (Isis) sleeps all day in the middle of the couch in the lobby and appears to be in charge of the operation. Breakfast, as is usual in Europe, was expensive so we went to a great bakery just around the corner. A bit noisy in the evening but not bad considering location. WiFi was available at 5 Euros for 48 hours.", "Date": "October 18, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Location": "5", "Rooms": "3"}, "AuthorLocation": "Brazil", "Title": "“Good hotel in the heart of Paris.”", "Author": "afmachado", "ReviewID": "UR47120375", "Content": "The hotel has a marvellous location, near the Quartier Latin, Notre Dame, Boulevard Saint Michel and Sena River. There is a Velib bike point in front of the hotel, making your transportation in Paris easier. The double room is quite simple and small, but very clean and confortable for a 2 star hotel. Because of the location, the rooms tend to be a little noisy.", "Date": "October 18, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "2", "Location": "4", "Rooms": "3"}, "AuthorLocation": "Miami Beach, Florida", "Title": "“Great Location, Mediocre Hotel”", "Author": "MiamiBeachTraveler_9", "ReviewID": "UR46208908", "Content": "The hotel overall leaves much to be desired, particularly given the prices. Our room was musty, our bathroom small, and overall it was a rather dismal, uninspired place. However, we opted to pay more for a room with a balcony, which was its saving grace. Eating baguettes and brie and drinking wine out there was perfect, as was the location.", "Date": "October 8, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Location": "5", "Rooms": "4"}, "AuthorLocation": "North Vancouver, Canada", "Title": "“More Than We Hoped For”", "Author": "Linnybee", "ReviewID": "UR45424407", "Content": "My husband and I spent 5 nights in Paris at the Hotel Europe Saint Severin. We were extremely happy with our stay and would definately not hesitate to stay there again in the future. The location is excellent! The hotel is convenientely located on a charming pedestrian street in the latin quarter (5th Arrondisement). There are lots of restaurants in the surrounding area. We ate at a restaurant close to the hotel every night we were there. We even tried the restaurant just off the hotel, it was good Italian food - the pizzas and pastas were delicious. Some of the restaurants in the area can feel a little touristy or tacky, there seems to be nicer restaurants just a block over in the St. Germain district, again extremely close to the hotel. The metro station is literally around the corner from the hotel and has metro and RER service. Also, the Seine River and Notre Dame Cathedral are about a two minute walk from the hotel. We absolutely loved the location, right in the heart of everything. The hotel staff were very friendly and helpful, they all spoke fluent english. The hotel seems clean and modernized with a large (for Paris) elevator that can easily hold 4 adults comfortably. Our room was a decent size with a decent sized bathroom with shower. My husband and I are tall (6'-1 and 5'-9 respectively) and we didn't feel crampt. The bed was very comfortable after a long day exploring the city. The only draw backs were minor, the air conditioner really didn't work at all, it just spat out drops of water and made noise but, we never contacted the front desk about it so, it may have just been out of order. Also, the walls are quite thin (you can hear your neighbours talking) but, we were lucky in the fact that we didn't have noisey neighbours and I think thin walled hotels are pretty common in Paris. Overall we were extremely happy with the Hotel Europe, it was great value for money, we would stay there again and wouldn't hesitate to recommend it to friends. It really added to a very enjoyable time in Paris.", "Date": "September 29, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Rohnert Park, California", "Title": "“Friendliest Hotel in Latin Quarter”", "Author": "lvitsa", "ReviewID": "UR45254590", "Content": "As most European Hotels have small rooms, we weren't expecting much. On arrival we were offered an upgrade for a small charge. The regular room was larger than we expected, but the suite was iresistable. The staff, especially Anna, were extremely friendly and helpful. The restaurant was excellent as was the staff there. 10% discount at the restaurant, if you're staying at the hotel. Perfect location, right around the corner from Notre Dame, metro 1/2 block away. It is a busy street, but we were never bothered by noise. The best hotel we've stayed at in Paris.", "Date": "September 28, 2009"}, {"Ratings": {"Service": "1", "Cleanliness": "3", "Overall": "3.0", "Value": "2", "Location": "5", "Rooms": "2"}, "AuthorLocation": "Sachsen b.A, Germany", "Title": "“Great location, staff and facilities lacking!”", "Author": "hobnobsmausi", "ReviewID": "UR42643120", "Content": "Although I loved the location and access to the metro.... there were some problems. Firstly, we dropped off our bags and the front desk person directed me to a park house they recommend. The streets she told me to take were ONE WAY in the wrong direction. Fortunately I know the area so managed to find another way. Secondly, she neglected to tell me that they had a special rate/deal with the park house and I had to tell the garage when I parked. This resulted in me paying almost DOUBLE for the parking and also prevented me from taking the car in and out (which would also have been possible). Next there was the room, supposedly a double deluxe, but not so big at all. Only two electric plugs in the entire room which mean no recharge for a mobile phone while watching TV or using the refrigerator. We paid extra for internet, but it was not working. I telephoned the front desk and the guy seemed really irritated that I had to call him twice. Also, the maid came and woke us up Sunday morning because she wanted to make up the room. We asked her to go away. Later the telephone rang and it was the housekeeper calling to ask us if they could come, again they woke us up. We requested they leave the towels outside of the door, but again the maid came and woke us up later. Granted it was later in the day, but we were out all night and wanted to sleep. The price of 179euro per night was not SO good, but again the location made me like the place, I just wish the staff gave better information and was a bit friendlier.", "Date": "September 18, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "3", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Kuala Lumpur", "Title": "“Tres tres bien!!!”", "Author": "JadoreVACATIONS", "ReviewID": "UR39976649", "Content": "We stayed in this hotel last year during summer. The hotel location is great, near the train, the restaurants – easy access to everywhere. The most unforgettable about this hotel, is the kindness of its staff – especially Dominic (I apologized if I spelt your name incorrectly). He is such a nice person and tried really hard to accommodate us. FYI, we were sooo smart that we didn’t book any hotel in Paris (as we thought that “there’s gonna be a lot of hotel in Paris”) but we were dead wrong. (it was summer & apparently lots of people like to go to Paris during summer) We were walking & walking like mad couple looking for hotels with our 2 big luggage. Finally we ended up at this Hotel. There were no rooms in the hotel at that moment, but Dominic helped us & actually made us felt very safe. He said only 1 room will be available the next day, so we agreed & paid the deposit & he let us to leave our gigantic luggage in the storage. And we strolled all night long in Paris, just walking & had endless coffee/tea/juice because we had no place to sleep that night & we didn’t want to sleep at the lobby as that would make Dominic look bad & we were aware it’s a hotel not a wellfare…LOL. But we actually had fun walking at night in Paris. It was cold & tiring but at the same time it was lovely. The hotel ‘s room was nice but I think it was pretty small. But of course we were really thankful we had a room to stay. I definitely like the location. And they have this cute cat!!! If we ever come to Paris again, I’d definitely stay in this hotel again (will make early reservation though..haha) . To Dominic, keep up the good work !!! You saved our life!!! Merci beacoup Monsieur Dominic!!!!!", "Date": "September 7, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "3", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Madison, Wisconsin", "Title": "“Nice hotel”", "Author": "lovetotravel52", "ReviewID": "UR36785546", "Content": "We stayed at this hotel for 7 nights at the end of July. We had probably the smallest room in all of Paris. Some of the reviews talk of refurbished rooms but we did not seem to have one of those. The room was extremely small...we had room to walk around the bed. However, the room was clean. The wall coverings looked a bit dated. The bathroom was clean..the shower had a door and good hot water. We did have a balcony so that helped. The balcony looked over St. Severin a main tourist street. We were on the 5th floor and did not hear any noise once the balcony doors were closed. The room did have airconditioning...although not quite to US standards but it did help to keep the room cool. There was a stocked refridgerator that we kept some water in. All that said, we did really enjoy the area and were only in the room to rest or sleep. The staff were very helpful and nice. They arranged at Yellow Shuttle van for us back to the airport. Right on time. Really close to RER and METRO stations. We did not have breakfast at hotel but it shares a room with the Pizza Restaurant (Pizza was excellent). We would stay here again but probably would get a larger room.", "Date": "August 5, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Los Angeles", "Title": "“Met every expectation and more - plan to return”", "Author": "CookieDartmouth", "ReviewID": "UR35718142", "Content": "We had heard that hotel rooms in Paris were small - but the deluxe double at Hotel Europe St Severin was generously sized and well equipped. Room for two adults to do yoga. We paid a little extra to get the deluxe double, and since we were staying almost two weeks, we were given one of the refurbished rooms. I believe that everyone who works there is so accomodating that if you ask in advance, as we did, to have one of the renovated rooms, you will get one. It was not noisy. We never heard a conversation or even a vacuum cleaner. Our windows were double paned, which was good, because Quartier Latin is noisy - although that's why we chose it. We saw street performances of all kinds from our window. The surrounding area has every kind of restaurant imaginable in low to medium price ranges, and better restaurants within short walking distance (it's practically in San Germaine des Pres - it's literally less than a block from the St Michel Metro and it really is 10-12 minutes leisurely walk to Notre Dame's interior). There is a boulangerie around the corner, a mini-mart one block a way, a Monoprix two blocks away, and a refrigerator in the room. We had a nice sized closet and a good sized, ergonomically designed bathroom. I asked for a tub with hand shower and that was lovely. We had a balcony (two of them actually) with two small tables and four chairs. The elevator was big by Parsian standards, but the delightful curving staircase was lovely to use as well. The 10E breakfast was better than any nearby café breakfast, although the cafés are fun. There's an internet café a block away and wifi in the lobby (it may reach to the rooms, we didn't try to use it). The staff is so kind and really looks out for you. The bed linens are superior, better than most American motels/hotels. They have wood floors, very good for those of us with allergies. Everything was very clean. Check-in was literally 1 minute. Taxis were arranged and completely on time. Service was personal but never intrusive. Other residents included college athletes and their coaches, people from other parts of France, several groups of Spaniards, and many Brits and Americans. The interior decor was charming and it really is centrally located - about two blocks from the Cluny Medieval Museum, 15 minutes leisurely walk to Rue Moufettard or the Pantheon, very close to all the wonderful cafés and shopping of Boulevard San Germain - and near the Seine. To us, the combination of balcony, accordian music or clarinetist, crisp linens, beautifully painted room with some exposed stone walls was quite romantic. There is parking nearby/underneath if anyone wanted that. There's a quite decent Italian restaurant on the first floor and the staff made wonderful recommendations for other places up the street.", "Date": "July 25, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Boston", "Title": "“Best location!”", "Author": "Vacati0nier", "ReviewID": "UR35615672", "Content": "This hotel has the best possible location for sightseeing in Paris: - 1 min walk (literally) to metro / RER station (direct line to Charles de Gaulle airport, 35 min ride) - 3 min walk to Notre Dame de Paris, as well as to the stop for 3 lines (green, orange and blue) of sightseeing tour buses - 5 min walk to Seine river cruises (Vedettes du Pont-Neuf) - 10 min walk to Jardin du Luxembourg, Pantheon - 20 min walk to Musée du Louvre - In the heart of the Latin Quarter (tons of restaurants, pedestrian streets, live performance). Hotel itself is small but very clean. Staff was friendly and helpful, everyone at front desk spoke English. All rooms are of slightly different size, so I guess it is matter of luck which one you get. Our room was small, but comfortable enough for 2 persons. It had AC, LCD TV, and big bathroom with large bath tab. Windows were overlooking small street with restaurants, Saturday night it was a bit noisy over there, but after closing windows (turned on AC for the night) we did not hear noise at all. Room had few scratches on the floor and walls, but was very clean. It also had mini bar in a small fridge. We did not have a chance to try Italian restaurant at the hotel, but once had a dinner in the small French restaurant across the street (named Lemenhir) and both food and wine were excellent. For breakfasts we went to small patisserie on the corner of Rue de la Harpe and Rue de la Hachette for freshly baked croissants and coffee. The only cons is the price - but all hotels are expensive in Paris, and here you pay for good hotel at the best location.", "Date": "July 23, 2009"}, {"Ratings": {"Cleanliness": "5", "Overall": "5.0", "Rooms": "4", "Value": "4", "Location": "5"}, "AuthorLocation": "Gatineau, Canada", "Title": "“I would stay there again”", "Author": "ColetteFC", "ReviewID": "UR34635776", "Content": "We were 3 couples at the hotel. We all enjoyed our stay. We appreciated the location. It was at a walking distance to all major attractions. Clean room with comfortable bed, recently renovated bathroom, good size shower with plenty of hot water, refrigerator and safe in the room, acceptable size room with closet and cupboards for storage. Large lift, computer in lobby (10 Euros for one week, unlimited use), friendly and helpful personnel at front desk. We had a room facing the street (on 4th floor). We didn't hear the noise from the street if we closed the window and the curtains.", "Date": "July 13, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Location": "5", "Rooms": "4"}, "AuthorLocation": "New Orleans, LA", "Title": "“Great Location!”", "Author": "StefBec", "ReviewID": "UR32308071", "Content": "This hotel is in a great location! It's only a few blocks from the Metro and walking distance to Notre Dame. The neighborhood is very active with many restaurants and bars. The staff were very friendly and speak English. The hotel has an elevator and a cat that lives in the lobby. Ask for a room overlooking the street. We will definitely stay there again!", "Date": "June 14, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Pittsburgh PA", "Title": "“Location and value!”", "Author": "kmcmom2", "ReviewID": "UR31719499", "Content": "Stayed in this hotel for two nights. Booked two rooms, one for my college age sons and one for my mother and myself. Newly renovated with exposed stone and brick. Hardwood floors. Airconditioning. Beautiful tiled bathroom. No balcony, but were able to open up the french door style windows (floor to ceiling) and sit on the chairs in the room to sip wine and watch the world go by after dinner. Very lively area with tons of sidewalk tables to eat at with nightly performances by jugglers, kick boxing demonstrations, and quartets. Not boisterous, just enough energy to make it interesting. Elevator was useful, breakfast was good, staff spoke English. Only downside was that our taxi driver had a problem finding where to drop us off, as the street is pedestrian only. When we were leaving the hotel desk called a cab for us, and it was able to get to the front of the hotel to pick us up.", "Date": "June 6, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Location": "5", "Rooms": "3"}, "AuthorLocation": "San Juan Capistrano, CA", "Title": "“Perfect Location!”", "Author": "GoneSouth10", "ReviewID": "UR30908793", "Content": "My wife and I stayed in this quaint hotel for four nights. Location was the primary factor for us as my wife had never been to Paris and she wanted to experience the essence of the city - and it delivered! The room we had was small, even by European standards, but clean and comfortable. Because we were starting out on a four week trip, we had a LOT of luggage, so that made the room a little cramped. However, it's Paris, so we weren't looking to spend time in the room anyway. BTW, the rooms are not standardized, and I think we may have ended up in one of the smaller rooms (at least that's what it looked like from the floor plan). Also, we got a room with a balcony, which helped. The neighborhood is great with a lot of food choices (although stay away from the tourist spots between the hotel and the Seine!) and very convenient Metro and RER stops that will put you anywhere you need to go in Paris. The Louvre, Notre Dame, Ile St. Loius, the Sorbonne, Jardin du Luxembourg (and many other sights) are all within easy strolling distance, with the Eiffel Tower, Champs Elysees, etc, reachable by a more ambitious, but certainly do-able, walk. Overall, if you don't mind the tight quarters, this is a great hotel and a great value!", "Date": "May 27, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Israel", "Title": "“Great location, clean. Great value!”", "Author": "sadde1", "ReviewID": "UR30312877", "Content": "Location, Location, Location!!! In the heart of the Latin Quarter, close to many restaurants, 3 minutes from the Notre Dame, 1 minute from the Metro, simply a perfect location. Location is the biggest asset of this hotel! The rooms are small, clean and basic. A small bathroom+shower with hot water, a TV and a (free) safe. On the second floor, the rooms have a balcony. There is an elevator, so no need to carry your bags up the stairs. The breakfast is very basic. It's OK, but you can find much better in one of the coffees nearby. There is an air condition in the rooms, but ours didn't work even after we called main desk to fix it. We managed without it, but in the winter or summer, it better work! The room is a little noisy, there are a lot of emergency vehicles passing in Boulevard Saint-Michel and you can hear them in the room. The walls are thin and you can hear some noises from other rooms. It's not too loud and after walking all day, we slept like babies and noise didn't bother us. The corridor smells! It's probably the old carpets or the wooden walls. No smell in the room. There is also an internet corner (not free). The staff was friendly and helpful. We came to the room to shower and sleep, for that, it is a great hotel in a fabulous location, and with a fair price. It's a 2 stars hotel, with 2-3 stars facilities, 2-3 stars price and 5 stars location.", "Date": "May 19, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Texas", "Title": "“Great base for exploring”", "Author": "mkhtx", "ReviewID": "UR27393124", "Content": "We stayed at the Hotel Europe Saint Severin Nov. 22-27th, 2008. It was our first trip to Paris, so I spent literally hours researching hotels before deciding to book this one. I was pleased with our choice. The room had a small balcony with a little table and chairs. It was well-organized for a small room. There were shelves in the closet for storage. The bathroom was updated, with a shower, clean tile, and room to put things on 2 shelves. We didn't spend a lot of time in our room, but it was clean and just right for a couple. The mini-frig was restocked every day, and the prices were very reasonable on the drinks. We never got up in time for the breakfast, so I can't comment on that. We visited the pizza/Italian restaurant next door....very busy on a Saturday afternoon, when we arrived. We also visited Lutece restaurant (on St. Michel, less than a block away). Liked both restaurants, and they were kind about our pitiful French! The staff at the hotel was always friendly. You do have to leave your key at the front desk each time you leave the building, but it was never a problem....there is always someone on duty. Noise was a small problem only one night......there was a family with a baby next door, and we could hear almost every word. They were gone the next day, though, so it was quiet the rest of the time. Noise from the street did not seem to be a problem...the sound-proofed windows sealed it out. Great base for exploring....several metro stops nearby.....however, be careful to note that they can be confusing with similar names. When we arrived from CDG (took RER B), we literally walked around about 30 minutes before we found our hotel, even though it was probably only a block or so away.....just kinda confusing. Notre Dame (my favorite sight in Paris!) is VERY close, and we walked there several times at night and during the day. I would definitely stay here again.", "Date": "April 4, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Berkeley Springs, West Virginia", "Title": "“Hidden Gem with great location”", "Author": "FlipperEastCoast", "ReviewID": "UR25690777", "Content": "I have stayed at the Saint Severin twice and have not been disappointed. Most recently I took my teenage daughter to Paris over Chirstmas. It is a block from the RER and we were able to check-in early after our flight arrived - thank goodness. The hotel staff was quite friendly and full of suggestions. We were greeted by Isis, the hotel cat, whom my daughter developed quite a relationship! By the end of the week, Isis had followed us to our room - much to my daughter's delight. We stayed on the 4th floor with a window to the street (dec 2007) - traveler's pictures are quite accurate. This room was small but adequate, besides we spent our time outside traveling to all the sites and shopping. It was quiet and there was no odor of smoke. We skipped the hotel breakfast and ate at several of the close by cafe's and crepe stands. In December of 2004, I stayed in a single room on the second floor - I had requested non-smoking, but that means if you are not smoking in the room it is non-smoking. The room on the second floor had a nice balcony, but was located above the restaurant which made for a noisy night. A highlight of the trip over Christmas 2007 was to walk to midnight mass at St. Severin. The hotel has been in the process of upgrading the hallways since my stay in 2004 and was still being worked on in 2007, but I never heard any noise as did other travelers. The location is central to sightseeing in Paris and I can't wait to talk my other daughter for her first trip to Paris too!", "Date": "March 6, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "3", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Chester", "Title": "“Wonderful, Excellent & Perfect”", "Author": "k1rst_l", "ReviewID": "UR23542551", "Content": "We arrived at the hotel late on Friday 9th Jan and checked in with a lovely and very helpful man on reception. His English was very good. We asked about anywhere near by for food even though it was near to midnight and he immediately went next door to speak to the adjoining pizza restaurant that were closing and managed to get us a table. The food and wine there was great and the staff very pleasant and helpful even though we were keeping them from closing. The hotel was newly decorated and the hallways and staircase were lovely. The room was perfect & again well decorated & clean. We were on the top floor and had a small balcony also which added to the charm. On Saturday morning we needed to find a certain bank and spoke with the lady on reception. Again her English was very good and she bent over backwords to help us and found the nearest branch and called them up and spoke to them about our query and translated the response. She then gave us a map and directions and off we went. The hotel is in a great location and surrounded by great restaurants and bars and near to metro. On Saturday evening another gentleman on reception called us a taxi and was again very pleasant and helpful. On Sunday, we were called in the room at 11.30 (check out time) but we did not get down til just after 12 but they were fine and not at all moody like some places can be and they looked after our luggage all day. After travelling all over the world, I can say that all in all, this is definitely one of the best hotels I've ever stayed in! We went on the free walking tour in the afternoon which is highly recommended and starts just around the corner from the hotel. We also saw Le Lido show which was just wonderful and again highly recommended. Thank you for adding a pleasant stay to our thoroughly wonderful weekend in Paris!", "Date": "January 14, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Business service (e.g., internet access)": "3", "Check in / front desk": "2", "Overall": "2.0", "Value": "2", "Rooms": "4", "Location": "5"}, "AuthorLocation": "London", "Title": "“Nice but noisy”", "Author": "Michael12358", "ReviewID": "UR23275921", "Content": "Noise is a problem here - from building renovation work during the day, and other guest rooms at night. They are removing carpeting from some bedrooms for the authentic parisian look but if you're underneath these rooms, like we were, the LOUD footfall and scraping chairs etc is highly intrusive at night. General denial that there's a problem but otherwise friendly staff, excellent location on one of the pedestrian streets in the heart of the Latin Quarter, good decor, and rooms clean but small (even the superior we paid extra for barely fitted in the bed). Wouldn't rush back.", "Date": "January 5, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Check in / front desk": "5", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Daytona Beach", "Title": "“A Friendly Place in a Foreign City”", "Author": "Datonabeach", "ReviewID": "UR20859422", "Content": "This was our first time traveling to Paris and we were not sure what to expect. We reviewed the comments of others and decided on this hotel. Upon arrival at CDG my luggage was lost. There is no control over the claim process, so be sure your luggage is promentally marked. This situation was explained at the front desk upon arrival to the young lady in charge, Soleil , who took complete charge of retriving the luggage from a woman who mistakingly took the wrong bag. She took this task upon herself and followed up to happy conclusion. The hotel is in the final stages of renovations. The room we had (#206) was refurbished with a new bath ,new furniature, and repainted. The halls were being carpeted and the walls were being touched up. They are doing a nice job of restoring this 18th century property. The neighborhood is in great location . The Metro is around the corner and RER is across the street from there. Taxie stand is there too. The area is loaded with Bars and restaurants of various ethnic types, with the traditional French dominating. The hotel has a good breakfast service(10E). The best part is the hostess who is friendly and willing to help you with your french langague skills.... The room we selected had a balcony which provided an extra deminsion of interest to our stay. The insulated windows provide soundproofing , as it is noisey at night with the busy restaurants and bars. This is an excellent tourist hotel for anyone who wants to be in the heart of the action of Paris. I recommend this hotel highly. P.S. Thank You Again Soleil", "Date": "October 13, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Check in / front desk": "3", "Overall": "4.0", "Value": "3", "Rooms": "5", "Location": "4"}, "AuthorLocation": "melbourne", "Title": "“Great hotel !”", "Author": "esjac", "ReviewID": "UR20694398", "Content": "My friend booked this hotel for us to stay in. It was in a great location - very central. We were very happy with our room -it was modern, clean, great bed, amazing view, perfect size. However, our friend got a room that had not yet been reburbished. Therefore my advice is when booking make sure you get a brand new room. I would also recommend staying in the marais area if you are still deciding.", "Date": "October 7, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "4", "Check in / front desk": "5", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "U.K", "Title": "“A good sized room”", "Author": "lelanni", "ReviewID": "UR19522289", "Content": "Stayed here for 3 nights from 25/08. Last year stayed at the Albe just around the corner. Booked a superior double inc breakfast for £280 through active hotels, Room was much more spacious than Albe, a proper double bed ,lovely white duvet and 2 pillows each. Safe, Sky TV and B.B.C. World . mini bar. Had room 318 next to elevator but not disturbed. Breakfast ,we felt was good considering the prices elsewhere, a pot of tea each, orange juice, cereal, fresh fruit salad, ham , cheese , croissants, bread, jams, hard boiled eggs-enough to keep us going till 2-3 p.m. Reception ,pleasant and good on security. Cleaners , very efficient and friendly / Room overlooked back and I wish that I had paid the difference to get a balcony- they are proper balconies with table and chairs and I could have watched the world go by whilst beloved had his 2hr nap (!) Bathroom was small but with a shower screen - if you are more than a size 16 , check the size of the bathroom by e- mailing them- they speak english and will reply promptly. Smoking allowed! Paris very expensive- 4.6 euros for a cup of tea, wine 4-10 euros for a small glass, bring a bottle opener and get wine from a supermarket. Two scams in Paris- Person stops you and asks if you have dropped a gold wedding ring- once you have stopped they ask for money- 2nd one person is giving out what looks like free advertising paper. if you take one they let you walk about 10 paces and then accuse you of not paying, they refuse to take the paper back and you end up giving them 2 euros", "Date": "August 29, 2008"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Check in / front desk": "3", "Overall": "3.0", "Value": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Glasgow", "Title": "“great location”", "Author": "scotties2", "ReviewID": "UR18959265", "Content": "we stayed here for 5 nights, the location is great, right bang in the middle of the Latin Quarter with so many restaurants and bars. 10 minutes walk from Notre-dam and 5 minutes from the Seine. Hotel was OK, we had a superior room with balcony on the 5th floor, to say it was small was an understatement, the bathroom was tiny and you definately couldn't swing a cat in it. But for the money it was clean and the sound proofing was really good considering the location and the staff were very friendly, especially the hotel Cat. The breakfast at 10 Euros wasn't worth it, we only took it one day and then went outside after that. It was really easy to get to from Airport, Metro straight to Saint Michel and then a 5 minute walk, but be warned it isn't very well signed and we spent ages finding it, we unfortunately went into the Latin quarter and should have stuck to Rue Saint Michel where it is one block from the Seine and about 10mtrs down Saint Severin. Good tip, you should do the L'open top bus for 2 days, at 32 Euros each it seems a lot, but it is worth every penny, there are 4routes you can take and they cover everywhere of main interest in Paris and you can jump on and off whenever you want, with full commentary, if you upgrade this ticket to the A la carte at 39 Euros you can also use the river boats. The buses run every 10 minutes and have various pickup and dropoff points all around the city. On the whole we had a great time, very expensive as the £ isn't doing well against the Euos, our dearest cup of coffee was 5.50 Euros. Coupe in 50's from Scoland", "Date": "August 14, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Maryland", "Title": "“Very Good Hotel in Great Location”", "Author": "McQCrew", "ReviewID": "UR18040756", "Content": "Rented two rooms for my family of 4--a superior double and standard twin. Overall the hotel was much better than expected for a 2 star property! I also had 4 business associates that stayed here with me and they were all very pleased with the hotel. There is still some renovation going on so sometimes it was a little noisy during the day, but then we weren't spending the daytime in our rooms! The room's renovation seemed complete, and they were very nice--the double was very large for a typical European hotel room and the twin was a good sized. The beds in both were excellent. The location is outstanding--around the corner from 2 metro/RER lines, easy walking distance to Notre Dame and many other sites (we do a lot of walking, and even the Louvre was an easy walk). it is surrounded by an enormous number of restaurants--we found oursleves returning to the area for dinner very night just due to the broad variety and quality of restaurants. The streets are very active at night, providing a lot of entertainment, but the rooms were quiet enough to sleep well. The hotel staff were all courteous and extremely helpful too. Overall this is a very good hotel and great value!", "Date": "July 19, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "4", "Overall": "3.0", "Value": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Toronto, Canada", "Title": "“Great location”", "Author": "et-toronto", "ReviewID": "UR17622267", "Content": "Great location in the Latin quarter - although can be noisy on a weekend night - into the wee hours. Our room was larger than most and we had a lovely oval bath tub (a rare find in Paris) with separate w/c. The bathroom was small otherwise. The staff were very helpful. The hotel seemed to be under construction which we were not made aware of, but it did not infringe our stay. The breakfast was expensive, but it was good!", "Date": "July 7, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Business service (e.g., internet access)": "3", "Check in / front desk": "4", "Overall": "3.0", "Value": "4", "Rooms": "2", "Location": "5"}, "AuthorLocation": "Lisbon, Portugal", "Title": "“Excelent location but small rooms”", "Author": "HelenaLisbon", "ReviewID": "UR17502507", "Content": "Me and my husband stayed here a long time ago: December 2005! Ooopss.... Good things about this hotel: good price, small walking distance from the train and metro (Saint Michel station), very central (Notre Dame is very close), many budget restaurants around the corner. Bad things: the room and bathroom are very small, so if you need a lot of space for you and your luggage... forget it!", "Date": "July 3, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "3", "Business service (e.g., internet access)": "3", "Check in / front desk": "4", "Overall": "4.0", "Value": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Los Angeles, California", "Title": "“Helpful Staff, Great Location”", "Author": "LDP98", "ReviewID": "UR17403033", "Content": "I am so glad to have found this hotel through TripAdvisor! This was my 7th time in Paris, and my best hotel experience yet. I have stayed in both fancier and crappier Paris hotels, but what made this average hotel great was the helpful staff and fun location. Throughout the week, there was just one receptionist, so it was easy to establish a relationship with her. She was so patient with my French abilities - with other Americans and Brits she spoke English - and I got lots of conversational practice as she helped track my father's lost luggage from AirFrance! She advised a nearby inexpensive store to buy him replacement clothes, and kept me updated on the status of the luggage delivery. When it finally arrived, she remembered which of our two rooms was my father's and had the bag waiting for him in his room when we returned from siteseeing. This was my elderly parents' first time in Paris, and I was nervous that the Latin Quarter location might be too loud for them. It was no problem, however, as the thick walls and windows kept out the noise. But actually they loved the bustling neighborhood anyway! We didn't use the nearby subway, as it's not wheelchair accessible for my mom, but the location allowed for easy strolls to the Roman bathhouse ruins at the Cluny, the St. Severin church, and even Notre Dame and St. Chappelle. We used the neighborhood taxi stand to travel longer distances.", "Date": "July 1, 2008"}, {"Ratings": {"Service": "2", "Cleanliness": "2", "Business service (e.g., internet access)": "2", "Check in / front desk": "2", "Overall": "2.0", "Value": "2", "Rooms": "2", "Location": "3"}, "AuthorLocation": "Dublin", "Title": "“A bit overrated”", "Author": "Paulapie50", "ReviewID": "UR15457270", "Content": "I am not sure all the reviews are true on this hotel. The beds are comfortable, but as an asthmatic feather pillows and duvets are a no no and they could not accomodate me with syntethic ones so i was wheezy all weekend, plus it is clean but a bit old and dusty which didnt help me at all. The hall areas leading off to the bedrooms are disgraceful to be honest and could do with a major overhall.. The reception area is nice but small and they do good Pizza in the restaurant.. Its also an easy to find place.... Originally we had a refurbished room which was a shoebox and dusty even though newly done( Bizzare!!). We moved rooms as i wasnt happy with the first one, but I had only asked for the room to be cleaned, we were told that was not possible so they moved us to one that was not refurbished and it was dreadful: bigger, dirtier and a bit sad looking (point of story dont change rooms you will be punished)..but at least we could walk around the room without falling over the bed like in the reburbished one. The old room also had a shower that you could stand up in as the reburbished room there was only a bath and a hose and no shower curtain so you would have to sit in the bath, not very practical really.. If your staying make sure its on the 2nd floor so you can get a balcony otherwise its not good value and the rooms are also a little biggger on that floor ..They seem to be proud of that floor, maybe its the only one truly finished..we obviously were no where near this floor... I thought the staff were stressed out, overworked and a little rude, but I suppose thats Paris. All in all I dont think the hotel was good value and was a bit dissapointed as the reviews made the place seem like it would be good value and at the most I expected it to be clean, friendly and comfortable which I am sad to say wasnt any of these. It was in an ok location but I have to say their are nicer ones if you are on a budget like i was. St Severin is a little cheesy, all mediocre french restaurants that overcharge you (beware the free drinks) and full of pickpockets..Also beware of sitting outside to eat in this area, my mobile was stolen from a restauarant table and it was gone so quick I have no idea who took it...my partner was convinced it was the waiter!!!!! You really need to watch your posscesions in Paris, I think it is worse now than Barcelona which seemed to be the consensus of other travelers we met. You can get better in Paris for 150 euro a night...its less than a 2 star in our eyes...and if i went back to Paris I would be staying in a different location.... most likely near the St Germain area where you get a better class of restaurants for a better price...", "Date": "April 29, 2008"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Business service (e.g., internet access)": "3", "Check in / front desk": "5", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Bath", "Title": "“Enjoyed the Stay”", "Author": "TamlinVisitor", "ReviewID": "UR14740744", "Content": "I stayed for 4 nights at the end of March with friends, and enjoyed it. After navigating the murky world of Paris hotels at fairly late notice I was relieved to have chosen a goody. I really just want to reiterate points made in previous entries; - location superb - staff friendly and welcoming - rooms pleasant, clean, nice showers with ready hot water, slept well - note that no kettles or irons (this is normal for europe apparently) Remember that it is a 2 star, so there are no extra frills. As of end of march renovations have progressed, paint smell has gone, but for those who really care about their corridors; the carpets in the halls are showing the signs of the work.", "Date": "April 2, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Check in / front desk": "5", "Overall": "5.0", "Value": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Bournemouth, England", "Title": "“Great location”", "Author": "andyb949", "ReviewID": "UR14442931", "Content": "This is a two star hotel, so if you want luxury you should look elsewhere. What it is is a charming place in a brilliant location. My single room was very small (and the bathroom was absolutely tiny), but did have a double bed and I also had a balcony overlooking the street below. As it was a busy area this meant I could hear noise from outside, but it was never enough to be disruptive. My room had a safe, but no kettle. Decor was okay, although the corridors were being done up as I was there. The hotel's main selling point is its location. Notre Dame is down the end of the road; the Louvre a pleasant fifteen minute walk along the Seine (perfect for getting there early and beating the queues); and the Jardin du Luxembourg ten minuters in the other direction. The Metro station on the corner has limited lines (although does include Gare Du Nord and the two airports), so make the five minute walk across the river to the Chatelet station and you will be far better served. The immediate vicinity has hundreds of cafes, bars and restaurants and very lively, bustling atmosphere. There's so much to do in Paris at night, but you can waste whole evenings just wandering around the area eating crepes and watching the musicians and other performers in the streets. The hotel was good value and the staff, as others have said, excellent. Would happily stay here again.", "Date": "March 22, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "2", "Check in / front desk": "4", "Overall": "3.0", "Value": "3", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Milton Keynes", "Title": "“Great location, pity about the renovations!”", "Author": "Kirkson", "ReviewID": "UR14280416", "Content": "The hotel is very well located, 50 yds from a Metro station, with lots of cafes, restaurants, and shops in easy walking distance. We had a Superior room, which although small, was well decorated and generally clean, and despite looking over a busy road, the room was quiet. However, the carpet in the room was very worn and dirty, and the corridor to our room was being redecorated during our stay (as was every other corridor in the hotel). Therefore, the room reeked of paint (no one thought to open the corridor windows!!), and we were woken up on two occasions at ~8am with hammering and sandpapering. Despite several comments to the reception people and the manager, and their offer of another room, nothing was done to improve this aspect of our stay. Saying that, the staff were friendly and polite, and when we arrived to find our none-smoking room actually had a dual role as the hotel's ashtray, they were quick to offer us several alternatives. Overall, if we return to Paris on a budget, this hotel might be worth revisiting, but there are better areas to stay in and much nicer looking hotels if you're prepared to do the hunting on-line. And book early!!!!", "Date": "March 14, 2008"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Business service (e.g., internet access)": "3", "Check in / front desk": "3", "Overall": "2.0", "Value": "2", "Rooms": "2", "Location": "5"}, "AuthorLocation": "Chicago, IL", "Title": "“Great location”", "Author": "WindyCiteTraveler", "ReviewID": "UR10070049", "Content": "General review the same as everyone else re: size, location and generally friendly staff. No safe, radio or balcony with my room. Did periodically get cigarette smoke and noise from another room. (Bring ear plugs, room freshener and play television as needed.) Before adding my words of advice, I must add that knowing what I know now, I would consider staying there again since I now have all the information I need. With the remainder of my review, I will share information to help you know what you need to know now. 1.) After checking in, you will be shown where they serve breakfast. This DOES NOT mean that breakfast is free. At this point they charge 10 Euros a day which seems expensive (bread, jelly, cut up fruit, ham, cheese, yogurt, coffee and juice). You are better off eating at a bakery. 2.) They supposedly can arrange shuttle service to and from Charles de Gaulle airport but most did not seem to know that. Your best bet is to take the train, so pack lightly. It is risky to arrange a shuttle through them since there really is no guarantee that they will follow through. But now you know. A cab ride is another option though expensive, around 55 Euros. 3.) Last, but NOT least, stay away from rooms ending with \"18\" or you will be next to the noisy elevator. Unless something is available that day, you will have to wait (have fun sleeping). FYI, for yoga and meditation classes, rasa-yogarivegauche.com is within walking distance. Take St. Germain direction opposite Seine, turn left on St. Germain and then left on St. Jacques. Also while there is a small grocery store down the street, take St. Michele (away from direction of Seine) to St. Germain and cross street. One of the side streets has a great grocery store. Good prices for food, wine and candy bars. Okay, this is more than just info. about hotel but should enrich your time there.", "Date": "October 12, 2007"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "New York", "Title": "“Great location in Paris”", "Author": "surpasspro", "ReviewID": "UR10008124", "Content": "We stayed at the Europe saint severin at the beginning of September and found it to be a great hotel. Its only a couple of block from the RER train station and since I was taking that train from the airport, it worked out. If you carrying a lot of bags the train my be a pain, so get a taxi. The room we had was #602 with nice space and a big bathroom. I looked at the floor plan in the hallway and all the rooms in the hotel seem to be different sizes. Some are really small and others really big. Ours was on the larger size. The bed was really comfortable and we slept well. We didn’t have a balcony, but didn’t need it since you can open up the windows and see out. Since we stayed on the 6th floor we had to take the elevator up to the 5th and carry our luggage up a flight. I think that is only for certain room on the 6th floor not all of them, so if that’s a problem you should ask about it. The hallways are under construction, but it wasn’t a big deal for us. Also, yes, it is noisy outside since of the location. We were tired from walking around and after we fell asleep we didn’t get woken up by the noise. After a certain hour everyone goes to sleep. The location was great, since it is only a couple of blocks from notre dame. From there we walked to the louvre and so on. So the hotel was a good launch pad to start site seeing. There was no lack of restaurants and shops around. We ate breakfast at a bakery around the corner. The location was great and our room was nice for the price… I would stay there again.", "Date": "September 26, 2007"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Business service (e.g., internet access)": "3", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Dalkey Ireland", "Title": "“Super location, fantastic balcony”", "Author": "SETDalkeyIreland", "ReviewID": "UR8735705", "Content": "My (23 year-old) son and I have just returned from a great weekend in Paris. I found Hotel Europe-St. Séverin through Trip Advisor and was attracted first of all by the location; I emailed the hotel directly after I booked asking if possible to have a room with a balcony. Our experience there was all we hoped and more. The location couldn't be more convenient and vibrant (travellers who get upset by street noise should go somewhere else - like the middle of the countryside!) Dozens of restaurants literally on the doorstep, the Seine 50 meters away, metro station, river boat, major sites ditto. The hotel staff were extremely friendly and nice, and our 5th floor balcony was simply fantastic. I recommend Hotel Europe-St. Séverin to anybody wanting an authentic and memorable Paris experience. sue.tulk@gmail.com", "Date": "September 17, 2007"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Business service (e.g., internet access)": "3", "Check in / front desk": "3", "Overall": "4.0", "Value": "3", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Fredericton, Canada", "Title": "“Very well situated”", "Author": "Charlie1998", "ReviewID": "UR8665567", "Content": "This hotel is very well situated in the Quartier Latin and the RER line to CDG airport which is the reason my partner and I chose it. It is easy to walk to the major sites: Notre-Dame, Ile de la Cité, the Louvre, the Beaubourg, the Marais, Saint Germain des Près, etc. Other reviewers have noted that the hotel is noisy because of the location and that is true but we came prepared with earplugs. So thanks to everyone else who has contributed a review! The hotel has been recently renovated and there is still some finishing work to do in the halls, but the decor of the rooms is great. Clean, clean, clean. We had a room with a balcony so were able to spend some time just watching the street life and that was fun. Staff was helpful. Breakfast was good. Isis the cat added her own brand of aloof charm.", "Date": "September 6, 2007"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Business service (e.g., internet access)": "2", "Check in / front desk": "5", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Miami", "Title": "“Great location, nice Parisian hotel”", "Author": "AndrewinMiami", "ReviewID": "UR8127678", "Content": "First, the location is excellent - RER to St Michel and 2 minutes from the station entrance. The elevator can take 4 people and luggage comfortably - most in Paris are postage stamp size but then the buildings are from the 1800's so PLEASE don't compare to any US chain hotels. I have stayed here twice and the bathrooms are above average Parisian downtown hotel size and quite clean. Again, this is Paris not USA so don't try and compare. I had a 5th floor room with balcony this time. Yes it can get noisy at night but then you are close to the center of the tourist dining area. My room had A/C which kept the room fresh with the windows closed. The only downside is no wireless internet in the rooms and the service in the lobby is poor. However, often you can catch a stray unsecured signal. ISIS, the cat, makes up for the internet to some degree. PS if you can speak some French, use it - the receptionists do appreciate the effort!", "Date": "July 16, 2007"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Business service (e.g., internet access)": "2", "Check in / front desk": "5", "Overall": "4.0", "Value": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Ottawa", "Title": "“Met our expectations, fanatastic location”", "Author": "Keefucious", "ReviewID": "UR7989876", "Content": "Above all, this hotel is in an excellent location and close to all the major sites. We loved it for that. I had requested a 2nd floor balcony and was happy that we got i because our room (216) was a double and fairly small. The bathroom was spotless and had a standup shower with good water pressure. The bed was comfortable , and the pillows good, the room had working air conditioning (but we didn't need it). The doors to the balcony open up, and we did leave those open at night, and yes, it was a little noisy but we expected that in this location which we knew was busy. The noise was there, but it didn't bother us. Te staff was extremely friendly and very accomodating. They spoke english with no problems.", "Date": "June 25, 2007"}, {"Ratings": {"Overall": "3.0"}, "AuthorLocation": "Oslo, Norway", "Title": "“Great quaint place, but expensive!”", "Author": "jfburkhart", "ReviewID": "UR7970472", "Content": "Stayed here for a conference meeting. It was a terrific spot with very polite reception staff. The breakfast staff is another story! The breakfast is also not included... and very basic (but the bread is delicious as are the croissants, but aren't they all in Paris?). It was in the process of being partially renovated.. or it's just not up to very high standards... the hallways were a little dirty it seemed. All in all, the location is great, if you want to be in the HEART of the latin quarter, and the rooms despite being over a busy night scene street are quiet (good windows). We had a small balcony which was nice. The bathroom was nice, clean, but not spotless (some mold high on the tiles in the shower). Would recommend it as a safe bet, but nothing that will completely overwhelm someone special... might be back... but probably would take a chance on exploring some other properties (there are hundreds) in the same area.", "Date": "June 23, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "3.0", "Value": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Leeds", "Title": "“Lovely hotel but loud”", "Author": "Rusty_Jones", "ReviewID": "UR7960974", "Content": "My partner and I stayed here for two nights in June. A lot of the things about this hotel were great. The staff were friendly and courteous, the room was large, comfortable and spotlessy clean, the location is brilliant - minutes away from St Michael station and within walking distance of most top attractions - and the service was excellent. We had to postpone our departure to Paris due to illness, so called the hotel the morning we were due to go to see if we were able to cancel our first night. Not only did they let us do so without charge, but when we arrived a day late, they had upgraded us to a deluxe room. But that was the problem... The room looked fabulous - when you look at pictures of the hotel exterior, it's the one on the second floor, with the balcony wrapping around the front of the building. We were very excited about sitting out on our little table and watching the bustling street below. However, at night, the noise from the street was immense. I am renowned for being able to sleep through anything, and although I could drop off ok, I was continually woken up - and that was with all the windows closed. Drunken partygoers scream and shout until about 3am - which is fair enough, we were there at the weekend. But then, from about 4am, the street cleaners come out in force and start banging about empty bottles and rattling shop-front grilles. This, coupled with strange bangings from inside the hotel led to two very tired and grumpy people each morning. Other reviewers say that noise wasn't a problem, so I'm guessing it was just this room, which I think was number 203. Unfortunately though, it's enough to put me off staying here again.", "Date": "June 22, 2007"}, {"Ratings": {"Overall": "1.0"}, "AuthorLocation": "usa", "Title": "“what's that smell?”", "Author": "jcrew01", "ReviewID": "UR7391603", "Content": "My wife and I stayed here for a couple of hours in a room that had some strange mildewish like smell. When we went to the front desk to complain they suggested we open the windows. Gee, why didn't I think of that? So we did, for a couple of hours while we strolled around and had breakfast. When we got back the odor was even stronger. The front desk handed us a key and said try another room and see if it suits us. The room was one floor up directly above our old room. It seemed to be the source of the smell. The hotel appeared to be almost vacant and we had reservations for several days there, but they wouldn't think of upgrading us even though they put us through such an ordeal. It's almost as if they wanted us to leave. The rooms were extremely small and not very clean. If you're a student who plans to be too drunk to care about all the noise and smell, then this place is somewhat cheap.", "Date": "April 18, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "4", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Bowie, Maryland", "Title": "“I loved this place”", "Author": "boo2U", "ReviewID": "UR7374862", "Content": "We loved it!! my boyfriend and I started our French vacation with a one day lay-over in Paris before we continued onto to the French Riviera(Nice) I booked this in part because I wanted to go to church and didn't want any hassles on getting a cab , I just wanted to be within walking distance to Notre Dame. I decided on this hotel because of the advice from others on this site. I was very , very happy ...ok, the halls were under construction but who cares about the hallways.......the room was roomy, clean, comfortable and they gave us a room with a balcony, (I totally begged and begged when I made the reservation and again when I confirmed it and again when I got to the front desk) again, I knew to do that because of all the reviews about the balconies.....anyway, the bathroom was HUGE with a great shower....you could have had a party in that tub. there was a mini-bar, and the room was a good size for Paris, and at night we sat on the balcony drinking wine , It was perfect and the hotel staff was very friendly. We were in the center of things, with cafe's, and markets and as a side note, the hotel offers breakfast but we didn't purchase that because we were leaving the next morning pretty early on our way to Nice and don't eat that early, but we wouldn't have gotten it anyway because there are so many cafe's around ...everything was perfect . Also, although our room overlooked the street below, noise was never a problem. In my room on the 5th floor, there were no exposed wires like other people have mentioned, no single \"lightbulbs just sticking out\", there was none of that in our room...in the hallways, yes, but not in our room. I loved this hotel and would recommend this to all my friends.", "Date": "April 16, 2007"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Business service (e.g., internet access)": "1", "Check in / front desk": "1", "Overall": "2.0", "Value": "1", "Rooms": "1", "Location": "5"}, "AuthorLocation": "Hillsborough, North Carolina", "Title": "“Rip Off! Misrepresented Dump with Great Location”", "Author": "DenverJerry", "ReviewID": "UR7294299", "Content": "The room pictured was labeled as a triple room on their and Venere's site, but when we got there they said \"sorry, although it says triple room (claimed a mistake after I showed them on my laptop because they did not believe me), it is a triple suite and you can't have it\". This was especially disappointing in that they had erroneously canceled our reservation earlier (claimed computer error), we rebooked at a better rate which they also cancelled claiming another mistake (in rates). They called us to tell us the first cancellation was a mistake and still good after we had booked the better rate and said they would perhaps work with us when we arrived. I told them there was no need to work with us if they just gave us the room pictured on the site at the higher reservation rate. They agreed. The room we received was a dump with horrible beds and very little room (nothing like the pictured and promised room). The rooms, halls, etc. were very shabby with pulled up carpet, stains, thin walls, dust, dirt, and construction mess everywhere. Their attitude was that I was being unreasonable to expect the room pictured and promised at the promised rate and doubted that I had talked to anyone at the hotel (THEY CALLED ME to avoid the lower rate booked after they erroneously cancelled me). The location (area) was fantastic, so it is a shame the operators and their websites are such a fraud and a sham. I would have definitely booked another hotel when comparing if I knew their pictures were fraudulent and will never stay at this dump again. 2 star rating is a real stretch.", "Date": "April 8, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "4", "Check in / front desk": "4", "Overall": "5.0", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Tallinn", "Title": "“Great place to enjoy Paris”", "Author": "AnneliTallinn", "ReviewID": "UR6815878", "Content": "We stayed in the hotel in February 2007 and will recommend it as a really great place to anyone looking for two star hotel that is super clean, cosy, friendly and located in the heart of Paris, just 2 minutes from Seine and Notre Dame. We have travelled a lot and could say the hotel can be ranked as 3 star hotel. While many hotels adverstising themselves at various net booking sites claim to have very central location but turn to be much more far from center, that particular hotel really is at great location. Its in most lovely Latin district, with tens of great restauraunts, some clubs and coffee shops around. The hotel was very clean and the staff, specially the young staff, was very friendly and helpful. With us they had some booking error at first but they fixed it very quickly and professionally. You can take you breakfast buffet for 10 euros in the hotel but we recommend to try also some local coffee shops just next street where you can get you hot fresh croissants and coffee for less price and feel more parisian and less tourist. And as its so close to Seine, have at least once the breakfast with you take-away-coffee-and-croissants sitting on river stairs next to Notre Dame. If you stay in the hotel we will also recommend you a lot to visit Latin Paradise cabaret show in the same region (some 15 min walk from the hotel and Notre Dame) that was absolutely great and is conisidered as one of the very best cabaret shows in Paris. We have seen several shows like that and it was really just great - very professional and also tasteful. Around the corner from the hotel great music was played at St. Michel street, starting 23 and lasting over hour on weekends. And once in Paris, check also the Notre Dame concert and mass times from net before you go - thats definately \"must to do\" at least once when you stay so close to ND. And one more tip - in case you arrive on Monday for a week or for long weekend, check the \"carte orange\" travel ticket that you can buy also at airport metro or RER station - the ticket for 1-5 zones that costed only 31 euros included return ticket from airport to Paris central, week long free travel in all Paris (all bus lines, metro and RER trains included) and even RER trip to Versailles, some Paris nearby areas, so its great to know that if you wish to see around. The hotel is located at very safe area and bus, metro, RER stops are just around the corner.", "Date": "February 20, 2007"}, {"Ratings": {"Overall": "3.0"}, "AuthorLocation": "holland", "Title": "“super location”", "Author": "chilenitaHolland", "ReviewID": "UR6628495", "Content": "We stayed here during the new year weekend as it was one of the few hotels that still had available rooms. The location is great, right next to the metro, and some excellent restaurants in the st. germain area. The hotel is located right on the edge of the busy latin quartier, we had a room facing the street and had no noise problem. The hotel is being renovated inside. Our room had the bathroom new and finished, but the room was half way done. Our room was tiny, but clean with a little balcony. Its very basic. The hotel offers breakfast but it was not included in the price. We chose to get our morning coffee with croissant in one of the many cafes near by. (there is a starbucks around the corner). Overall basic hotel, great location, a bit expensive but for new year's weekend.... can't complain.", "Date": "January 20, 2007"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Check in / front desk": "3", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "London, England", "Title": "“Great location”", "Author": "Saralondon", "ReviewID": "UR5912305", "Content": "We chose to stay in this hotel because of its great location. I know Paris well as I lived there for a year and knew this would be a great area to stay in. The hotel is just off Place St Michel, less than 5 minutes walk to Notre Dame and 5 minutes walk from the more upmarket Saint Germain area. The hotel itself is on a very touristy street, full of restaurants and as a result is always very lively. However, although our room overlooked the street, noise was never a problem. Considering this is a 2 star hotel, our room was great. The room was perfectly clean and a good size for Paris, the beds comfortable, TV, good sized wardrobe. The bathroom was completely clean and modern and seemed to have been recently installed. If you want a romantic break in a luxury hotel, this is not for you. If you want to make the most of being in Paris, its sights and nightlife, then this is a great place to stay.", "Date": "October 5, 2006"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "England", "Title": "“Top Location”", "Author": "hipappa", "ReviewID": "UR5710813", "Content": "Stayed for 5 nights, excellent location bang in the middle to the Latin Quarter, all the sounds of Paris straight through your bedroom window, double glazing is exellent when you,ve heard enough. Air con very good, powerful shower. Hotel generally very clean and all staff friendly and helpful. I would use this Hotel again", "Date": "August 26, 2006"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Check in / front desk": "3", "Overall": "3.0", "Value": "3", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Valley Cottage, New York", "Title": "“Love the Latin Quarter”", "Author": "bikes&boats", "ReviewID": "UR5614143", "Content": "$239 per night. I forgot I paid that much, wow. But I can't complain too much cause it was a terrific location in the lovely latin quarter. It is tucked amongst small streets and not on a main plaza or boulevard. We stayed on the top floor so we had a quaint slanted ceiling and the bed was on a raised platform. The room wasn't that small by Paris standards. It was a \"Superior Double Room\" according to my Expedia reservation. I later found out I could have saved some money by making the reservation directly with the hotel. The mattress was large enough for two but it was kinda flat. Not sure how old it might have been. The bath was in the room so everything got wet when we took showers. no curtain??? the bathroom was neat but tiny. just a sink, mirror, and toilet. We walked all over from this hotel. had a great time!", "Date": "August 15, 2006"}, {"Ratings": {"Cleanliness": "3", "Overall": "2.0", "Value": "1", "Service": "3", "Rooms": "1"}, "AuthorLocation": "North Carolina", "Title": "“Pokey rooms, but right location”", "Author": "LeatherFoot", "ReviewID": "UR5459260", "Content": "Don't be fooled by the pictures on the hotel web site or in the lobby. The rooms are generally small unless you book directly with the hotel as ask for a specific one. Try the second floor as they have balconys and tables overlooking the street scene. The room we had didn't have any proper light fixtures, just wires poking out of the wall with light bulbs attached. It seems to me that if you book with one of the online travel companies, you won't get a good room. We booked at Hotels and paid for a superior room. If superior means lights hanging on wires I dare not consider what a standard room is! The bathrooms are OK and in general the place is fairly clean and the rooms quiet. This is important if you want to be right in the Latin quarter as it gets pretty noisy outside with all the people, restaraunts and traffic. The room had A/C but didn't work too well, especially when it was hot, but better than nothing. Breakfast at 10 euros is a bit steep for what you get. Go to a local bakery, and Starbucks up the road and save a bundle. Location is great, walk to Notre Dame, Pompideau Center and all the sights around the Quarter. There are a couple of Metros close by, and an easy trip to all the other sites in Paris and much cheaper and quicker than taxis.", "Date": "July 12, 2006"}, {"Ratings": {"Cleanliness": "4", "Overall": "3.0", "Value": "4", "Service": "4", "Rooms": "2"}, "AuthorLocation": "new orleans", "Title": "“Budget hotel in a great location”", "Author": "greecube", "ReviewID": "UR5372614", "Content": "We booked this hotel based upon the reviews read here, as I was looking for a nice hotel room, not too expensive, in a good location, and which could fit 3 comfortably. I can say, after spending 4 nights at Hotel Eurpoe St Severin, that the reviews are accurate: I booked a triple room for me, the wife and our 10 year old son. The room faced the inner courtyard and was very quiet, not small but not too big either for a triple (2 single beds and a sofa/sleeper). But it offered zero privacy, so the next night we rented a double at single occupancy price for the kid (this room was very small but the bathroom was roomy, go figure). He really enjoyed it, but it may be cramp for 2 adults. Overall, the place \"felt\" like a budget hotel. Nothing fancy, and I was not disappointed in our choice. The hotel staff were very nice and helpful. We did not eat breakfast at the hotel, since there are so many places nearby with better fare. We did eat dinner at the rerstaurant, and it was very good and relatively inexpensive. Of course, the location was great, being steps from the Metro/RER, bus lines, and close to Notre Dame. We attended the high mass on Sunday at the St Severin Church, just around the corner, which turned out to be one of the highlights of my trip.", "Date": "June 21, 2006"}, {"Ratings": {"Overall": "3.0"}, "AuthorLocation": "Sweden", "Title": "“Great location”", "Author": "Madeleine76", "ReviewID": "UR4998750", "Content": "We stayed for two nights at the hotel Europe Saint Severin during a quick weekend trip to Paris. These are the main advantages: - Located just a few blocks from the Notre Dame, we walked to all sights in Paris. - Located in cosy pedestrian area with lots of restaurants and creperies. - Very convenient and close to the RER station St Michel (train to/from Charles du Gaulle airport) - Friendly staff - Clean bathroom and sheets, but the carpet... I don't want to know. However, there were also some disadvantages: - Very small room (103) (but we didn't spend that much time in it anyway) - There seems to be some renovation going on, and our room could need it. Also the hallway shows a lot of wear and tear. - Noise from the street below didn't stop until four in the morning, I guess that's what can be expected in that area. On the other hand, it gave a true parisian feel. - Our toilet seat was cracked, but was replaced after the first night. I think I will try another hotel next time in Paris. This hotel was OK, but not more than that.", "Date": "April 24, 2006"}, {"Ratings": {"Cleanliness": "4", "Overall": "4.0", "Value": "5", "Service": "5", "Rooms": "4"}, "AuthorLocation": "Ballina, Ireland", "Title": "“Location Location”", "Author": "mierman1", "ReviewID": "UR4982714", "Content": "We really enjoyed our stay at Saint Severin. The room is small but the location was perfect and very convienent from the airport Metro line. The staff was very friendly and helpful. If you plan on spending alot of time in the room, you might not care for it but if you want to get around town easily and enjoy the city, St. Severin will be good for you.", "Date": "April 17, 2006"}, {"Ratings": {"Overall": "2.0"}, "AuthorLocation": "Alexandria, Virginia", "Title": "“Hit or miss hotel-we missed”", "Author": "GGG1228", "ReviewID": "UR3624709", "Content": "I know that Paris hotel rooms are small but our room was small even for Paris standards. We had no place to put our suitcases and could barely walk around our bed (and we are not large people). We wish they would have left out the TV stand and given us the extra room instead. The room was dark even with all the lights on. We much preferred the Parc Saint Severin that is about a block away. I noticed a map of the hotel rooms for our floor on the inside of our door. It looked like a jigsaw puzzle. Some of the rooms were much larger than ours. I guess we just got an unlucky draw. The restaurants in the area are decent but not great. If you're looking for fine dining, this is not the place. However, if you want to have the option of getting a dark chocolate gelato or a nutella crape at midnight, this is the area for you.", "Date": "July 1, 2005"}, {"Ratings": {"Cleanliness": "4", "Overall": "4.0", "Value": "4", "Service": "3", "Rooms": "3"}, "AuthorLocation": "Tamworth, Staffordshire", "Title": "“Very Convenient”", "Author": "A TripAdvisor Member", "ReviewID": "UR3619797", "Content": "The hotel was very conveniently situated for Notre Dame and River Seine. On arrival by RER from Charles de Gaulle we couldn't believe how near the Metro was, and how easy the hotel was to find. I would highly recommend this 'cosy' hotel with 'Allo 'Allo style restaurant/bar. The food and service in the restaurant was excellent!", "Date": "June 29, 2005"}], "HotelInfo": {"Name": "Hotel Europe Saint Severin", "HotelURL": "/ShowUserReviews-g187147-d250927-Reviews-Hotel_Europe_Saint_Severin-Paris_Ile_de_France.html", "Price": "$148 - $332*", "Address": "<address class=\"addressReset\"> <span rel=\"v:address\"> <span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">38-40, rue Saint Severin</span>, <span class=\"locality\"><span property=\"v:postal-code\">75005</span> <span property=\"v:locality\">Paris</span></span>, <span class=\"country-name\" property=\"v:country-name\">France</span> </span> </span> </address>", "HotelID": "250927", "ImgURL": "http://media-cdn.tripadvisor.com/media/photo-s/02/3e/e9/11/hotel-europe-saint-severin.jpg"}}