{"Reviews": [{"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Location": "4", "Rooms": "1"}, "AuthorLocation": "", "Title": "“Terrible!!!! Don't stay in this motel”", "Author": "ogarcia76", "ReviewID": "UR126089441", "Content": "Accomodations: Dirty, poor tv and cable, insecure door locks, no pests control, worn out towels and bedding; outdated, all rooms and structures need to be renovated, noisy, no parking during night because they have a club and the customers take all the parking  Service: terrible  I am a PR resident. Tourists: their are plenty other hotels that represent us better, stay away from this one.", "Date": "March 14, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Texas City, Texas", "Title": "“has been wrongfully rated”", "Author": "sfccastro", "ReviewID": "UR125770564", "Content": "i have read all the horror storys from this site but I have to post my experice in la cima .i have been living here for 2months and all i can say it has been one of the best places i have been in a long time .examples any thing brakes u tell the front desk franky or daniel come an fixes it before you return ,lunch lilly is wonder full she makes the best criolle food ,for dinner papo my respects this guy can make a mean churrasco,and jose the GM theres nothing you can ask that wont get done from a romatic arrangement to choclates on ur pillow .these examples i wanted to put out there because the ratings on here are not accurate from my expierince here.oh when you arrive nichole is usually at the front desk more than happy to greet you and answer all your questions .the bar usally playing music just pull up a chair an ask coquie or jessica for a medaalla and enjoy yall be here for a while especiually if you like rock.the noise from my room i cant even hear it so you be the judge of this great place that is 10 min from the surfing and 5min from base", "Date": "March 7, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "San Juan, Puerto Rico", "Title": "“It is really a Motel...”", "Author": "Lici3", "ReviewID": "UR124928834", "Content": "We stay for a weekend and the location was very good. The room was clean but need to be updated. We pay the breaksfast with our reservations and that was a great mistake They serve coffee in a very small foam cup, no orange juice or oatmeal was available and were in the menu. The personnel was very nice, they were very sorry for not having the ingredients like jelly, yogurt, any fruit, even milk run out. They have a pub that is very noisy so ask for rooms faraway the music. For a week-end close to the beach and some nice restaurants it is ok, not for special occasions,,,,and don't pay the breakfast in advance.", "Date": "February 20, 2012"}, {"Ratings": {"Service": "1", "Cleanliness": "3", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "2"}, "AuthorLocation": "New York City", "Title": "“Bedbugs Nightmare!!”", "Author": "CityGirl94", "ReviewID": "UR122166066", "Content": "After declining 2 rooms for broken windows and a leaking toilet, we finally settled for the 3rd room. We started itching the moment we stepped in, in the morning we realized with horror that we were bitten by bedbugs. The place looks like it was frozen in the 70's, the air conditioner was noisy, leaking water and didn't cool the room. The furniture was broken and scratched. The bathroom had tiles that were broken and the towels were so threadbare I was afraid to use one for fear of rippping it apart. This is not a hotel, but a poorly kept motel. We are still dealing with the bedbugs problem. We regret not leaving the moment we saw the broken windows. About the only positive is they have good internet connection.", "Date": "December 28, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "2", "Overall": "3.0", "Value": "2", "Sleep Quality": "2", "Rooms": "2", "Location": "4"}, "AuthorLocation": "Mexico", "Title": "“Location is good but very dated”", "Author": "CliveTMexico", "ReviewID": "UR119494452", "Content": "We have stayed at this Hotel twice, the first time their was a problem with the toilet, the second time we made the mistake of asking to be on the ground floor which happens to be by the pool. The room we had on the second floor was large,furniture very dated and the mattress was too small for the bed frame. We found, other than the toilet not working, the shower was dangerous as the floors are very slippery when wet and with the shower stalls design its virtually impossible not to get water on the floor. The one by the pool about a third less in size. The furniture is very dated but the shower was dated but not as dangerous. The location is good. It has two restaurants and a bar on premises and very good restaurants across the street and nearby. Its also close to the beach with transportation. As far as price goes, you get what you pay for.", "Date": "October 19, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "2.0", "Value": "2", "Sleep Quality": "2", "Rooms": "2", "Location": "4"}, "AuthorLocation": "Glen Ridge, New Jersey", "Title": "“Below Average”", "Author": "wepagirl", "ReviewID": "UR118763714", "Content": "My Husband and I stayed here 5 nights in Xmas of 2009. We were booked at the Marriott for the first 5 nights so we were looking to save a few bucks plus my brother was staying here and he said it was good. We arrived and were shown several rooms so we did get to choose the best available for us. I guess we got what we paid for. Rooms are dark and below average, internet only available if you stay in the main building and in a room close to the front desk as the signal is weak. The bar downstairs gets loud on the weekends but didn't bother us really. The only problem is the parking lot gets very crowded but there is a security guard in the lot that secures you get a parking spot if you are staying in the hotel. The hotel was empty for the most part as this is their low season but a few more people checked in the closer it got to xmas day. Airport is close about 5 mins. away and you do hear the airplanes. Jobos and Crash Boat beaches are very close. Overall it's not a place I would stay again if I had another choice but if you are on a budget and don't mind not having the simple luxuries then I could recommend this place in the offseason. I hear from the locals that the high season is insane at this place. I have to say that if I had to do it over I would have stayed at the Marriott the full 10 days. In fact, we did have the chance to do it over xmas of 2010 so we rented a gorgeous private condo in Jobos Beach and that was excellent!", "Date": "September 29, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "3.0", "Value": "3", "Service": "4"}, "AuthorLocation": "Carolina, Puerto Rico", "Title": "“Bare bones hotel, clean, attentive staff.”", "Author": "enatal", "ReviewID": "UR117971417", "Content": "Hotel is close to Rafael Hernandez Airport in Aguadillla. First room I was given was way hot and the a/c dd not cool. I asked for another room and the attendant found another one which the A/C unit was just installed. Room was clean and well kept, only one window did not close and the staff managed to close it for the A/C not to drain out. WiFi signal was very good and reliable. If you stay, ask for the back building, whih is closer to the swimming pool and away from road and bar noise. Room conditions vary depending on which one you're given. Cable TV lineup has no premium channels. Staff is very attentive and helped me out while there.", "Date": "September 12, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Sleep Quality": "2", "Rooms": "2", "Location": "5"}, "AuthorLocation": "Brooklyn, New York", "Title": "“Affordable and Pleasant”", "Author": "celo123_11", "ReviewID": "UR108844269", "Content": "My Husband and I haven’t been to P.R. in about 3 years and decided to take a weekend trip. I booked last minute reservation at the La Cima hotel. I have to say we had a great time. It is located near the best beaches in Aguadilla and Isabela. The restaurant offers great Creole meals at affordable prices and a friendly staff. We stayed in a deluxe hotel room which was nicely furnished with a king size bed. We enjoyed our stay very much.", "Date": "May 18, 2011"}, {"Ratings": {"Service": "2", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "2"}, "AuthorLocation": "Bronx, New York", "Title": "“A Piece of Crap”", "Author": "HonestyandtheTruth", "ReviewID": "UR79575910", "Content": "When we arrived there, there was an awful stench. There was a truck that was cleaning a septic tank which means they were cleaning out crap. It smelled really bad, I wanted to throw up. The receptionist was very nice, but she booked us a room right next to the crappy truck. When we entered the whole room stunk, even with the AC on. We told her and she switched our room. It rained on that day and when we came back the bathroom and part of the bedroom floor was flooded. We got very upset and left the next day. This hotel looks beautiful on the outside, but inside it's horrible. Old style furniture with old blankets and cheap towels. The t.v. were from the 50's and there was no soap, shampoo, lotion, or conditioner. The pillows were uncomfortable. The sitting area near the pool was poor, the table is old and the chairs looked like they were about to break off. I ate at the restaurant with my family, I ordered french toast, it was good, but my mom ordered asopao de camarones (shrimp soup) she took one bite, and that was all she ate. She said the rice was hard and the shrimps were like rocks. Oh, and the truck full of poo didnt leave until the day we checked out, ewww.", "Date": "September 14, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "3", "Sleep Quality": "1", "Rooms": "1", "Location": "4"}, "AuthorLocation": "", "Title": "“It's a Motel not Hotel”", "Author": "jaimeaus", "ReviewID": "UR78704862", "Content": "The only thing going for this motel is the location to the airport, approximately one mile. All rooms have outside doors, always a safety concern for me. The A/C was a wall unit, either on-very cold or off, very hot in the room. No adjusting control. The furniture was old, worn and beat up. No shampoo and only one small bar of soap. The towels were old, threadbare and small. My phone did not work and neither did the cable TV, the TV was small and from the 1970s. When I went to the front desk and told them about no phone service or cable TV, they said a tree on fallen on the line and no adjustment was made. Stay away from this motel. There are better choices nearby as I found out later.", "Date": "September 7, 2010"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Sleep Quality": "2", "Rooms": "2", "Location": "3"}, "AuthorLocation": "Brooklyn, NY", "Title": "“Ok - Budget Hotel”", "Author": "Geri168", "ReviewID": "UR77599353", "Content": "We were in Aguadilla to visit family for a few days and wanted an inexpensive hotel. We spent $95 per night and it had 2 beds and a few other amenities. We really disliked the fact that it had carpeting. (hate carpeting. especially in the caribbean). The hotel is older but we only needed it sleep and shower (and hold our personal stuff). We would probably not stay here again.", "Date": "August 31, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Sleep Quality": "3", "Rooms": "1", "Location": "2"}, "AuthorLocation": "Yabucoa, Puerto Rico", "Title": "“Cheap motel, not a hotel”", "Author": "papomasan", "ReviewID": "UR73819340", "Content": "roaches, a/c leaking water, furniture looks like they got it from a hard sale, No hot water, frig was rusted, no iron, bathroom walls had fungus, pool was nasty, pool area full of trash, beaches were so far away you needed a car to get their. Nothing like there internet page promotes, it's all a false statement. This by no means is a 2 star hotel, it's a 0.02 point MOTEL. As a matter of fact, I've been to better motel for 25 dollar a night.", "Date": "August 4, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "2", "Overall": "3.0", "Value": "5", "Sleep Quality": "5", "Rooms": "3", "Location": "3"}, "AuthorLocation": "New Jersey", "Title": "“Met our needs & our budget”", "Author": "phillygalks", "ReviewID": "UR62002937", "Content": "La Cima was comfortable, but by no means 5 star. The room was decorated in a cheery manner with sherbet like paint colors. The bedding was fresh and clean. The bathroom was older, but clean. The fan was dusty, the curtains and shower curtains (like most things in the humid weather of Puerto Rico) had a bit of mildew. Chinese restaurant on site was tasty.", "Date": "April 20, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "4", "Sleep Quality": "4", "Rooms": "2", "Location": "1"}, "AuthorLocation": "Boston, MA", "Title": "“A possessed ceiling fan...a great bed”", "Author": "polycloud", "ReviewID": "UR61377574", "Content": "We picked this hotel from the reviews and it's true it's literally right next to the airport runway. We though there would be small planes taking off, but there was definitely one huge military cargo jet or something. But the biggest annoyance was this one ceiling fan that we couldn't turn off, so it was on all night. That was tolerable though. The price was reasonable, and the bed and pillow was just somehow the perfect blend of softness and firmness. I've been in many 4 star hotels and for some reason, this cheap hotel had the most amazing mattress. I wish I could take it home with me. The staff was polite...neither too friendly or rude. We wanted to stay at a bed and breakfast in Rincon but they were all booked.", "Date": "April 14, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "2.0", "Value": "5", "Sleep Quality": "1", "Rooms": "1", "Location": "5"}, "AuthorLocation": "Tampa, Florida", "Title": "“If you want a cheap room to save money (to play with later), this is the place.”", "Author": "Trips_All_The_Time", "ReviewID": "UR60925936", "Content": "My wedding was local and when La Cima had agreed that they would give me a discounted rate, they didn't honor it when people started to book. I had to call back to get it situated and people FINALLY got the slightly cheaper rate. Upon arrival, it was decent in our room. The non-english speaking security guard didn't know what to tell our guests when they had them check into dirty rooms or when they needed a cot. He didn't even understand them. WIRELESS INTERNET WAS ON ONE BAR AND TOO WEAK TO DO ANYTHING ONLINE. I really didn't spend ANY time in the room. More of my time was at the local beaches, or the pool so it didn't bother me as much (and I happened to have one of the decent rooms in the place). It was apparent that they hadn't been this busy in a long time. Towels were periodic and most looked like some I would use as household rags (holes). Couldn't tell the difference between pool or bath towels. Some rooms were fine BUT some obviously had not been used or maintained in quite some time with piles of dust, cigarette stink, air vents half falling down, rusty everything, etc. It has a local bar (that is only fun with a large group of friends) with pizza across the street that we cleaned out of alcohol, chinese food is below some of the rooms in one of the buildings, Killer Tacos is the next gas station over (yum). My recommendation, if you are a penny pincher or can be a little rowdy with your friends, this is the cheapest around (that you can get away with partying). Otherwise, go to the Marriot.", "Date": "April 10, 2010"}, {"Ratings": {"Service": "2", "Cleanliness": "1", "Overall": "1.0", "Value": "2", "Sleep Quality": "2", "Rooms": "1", "Location": "2"}, "AuthorLocation": "New York", "Title": "“I would NEVER recommend this hotel to anyone.”", "Author": "AConnor", "ReviewID": "UR60739948", "Content": "I recently traveled to Aguadilla for a wedding & needed a hotel close to Villa Montana beach resort (where the ceremony/reception happened). There really wasn't a choice about it as the entire the entire wedding party & guests ended up staying at La Cima. We hoped for the best. Here is my review: Check-in: After a long flight to Aguadilla & EXPENSIVE cab ride ($35 for literally a 2 mile ride) we were greeted by a front desk person who spoke NO english. He couldn't make our party of 5 extra keys, and there was no one to help us bring bags to our room. We reserved the 2-bedroom apartment for our group of 5. Ahead of time we requested a cot for the 5th person. When we got there - no cot. Night 1 the extra person had to sleep on the couch. There weren't even extra pillows or blankets - and the guy at the front desk was unable to find us any. (When we went to talk to the english speaking front desk clerk the next day she tried charging us $15 extra per day for the cot - luckily I had my confirmation letter stating that there was no extra charge.) The living area of the apartment was alright, old furniture, but decent in size. There was a full kitchen, but of course no pots or pans. The bathroom had no fixutres, just bare bulbs hanging over the mirror. Moldy shower/floor (other wedding guests actually went out and bought their own cleaning supplies to clean their bathrooms!!), no shelf for toiletries, 1 roll of toilet paper (which is all were were ever given on any day), the carpets were FILTHY - and we never saw a maid with a vacuum our entire stay. They only used mops & brooms. HOW do you clean carpet without a vaccuum. YUCK. The door to the back patio got stuck twice (and the knob had to be removed by maintenance). Not too big of a problem since we only used the patio to hang wet suits since the table & chairs were so filthy, and who wants to sit on a patio surrounded by barbed wire (seriously). The pool area is decent. Except that there are only 5 lounge chairs (3 of which are broken & missing slats). Every day the pool area was PACKED with screaming Puerto Rican kids (not sure if they were local or guests) - and it's a TINY pool (backyard sized). The jacuzzi was more of a whirlpool - not warm at all. Good luck finding a pool towel. Apparently you have to know to go to the laundry room and ask housekeeping for a pool towel. Why wouldn't they put the pool towels near the pool? The website says that La Cima has a pool w/BBQ area. The BBQ area is across the parking lot from the pool area. There is one stone table, a dirty charcoal grille, and a bar. Our entire stay the bar had a dirty rolled up carpet laying on top of it. It's also beside the \"game room\" which is chain locked shut. The website says that La Cima has 2 air-conditioned restaurants on-site. In reality - there is NO restaurant on site at all. It is closed. So is the bar or \"cocktail lounge\" they claim to have. The \"exercise facility\" had 1 weight bench and was not airconditioned. The complimentary business center with internet access - wasn't working. In order to get to a beach you will need to rent a car. The hotel is a good 7 minute drive to a beach (although once you get there, the beaches are definitely worth it). I felt the need to write an honest review - because I was definitely duped by reviews written before me. All in all, I had a great time in Puerto Rico because of the people I was with - DEFINITELY not thanks to La Cima hotel.", "Date": "April 8, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "3", "Rooms": "3", "Location": "3"}, "AuthorLocation": "NY,NY", "Title": "“nice hotel for the money”", "Author": "sweetdi60", "ReviewID": "UR58935312", "Content": "stayed here 7 days with my 2 sons, ages 11 and 23. room was clean and adequate, air conditioner was satisfactory. they have 2 restaurants on the property and we tried both. the Chinese restaurant was ok, but the other was exceptional. both breakfast and dinner were great. customer service was great, everyone very nice and helpful. going back to PR this summer and will definitly stay here again.", "Date": "March 18, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "3.0", "Value": "4", "Location": "3", "Rooms": "4"}, "AuthorLocation": "Carolina, Puerto Rico", "Title": "“No frills, close to Aguadilla airport”", "Author": "enatal", "ReviewID": "UR53866546", "Content": "Stayed there for work travel. If you are looking for clean hotel, close to the Aguadilla (BQN) (formerly Ramey Air Force Base), this is a place to consider. Certainly you will need a car for traveling around the area, etc. It is mostly for travelers coming in/out of the Aguadilla Airport because of the crazy flight schedules. It is located near the road, depending on the room, you may hear road noise. It is also close to the airport, but there is not much airline traffice noise. Has swimming pool, wireless internet (did not try...) restaurants, etc. Parking is shared with a restaurant and pub in the same location.", "Date": "January 19, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "4", "Rooms": "5"}, "AuthorLocation": "Clearwater, Florida", "Title": "“Wonderful parador - very plush”", "Author": "mctom", "ReviewID": "UR53230431", "Content": "We traveled around the island and stayed in 3 paradors and 3 hotels. La Cima was the best place we stayed!!! At sailed through check-in and the housekeeper went to our room to turn on the AC and unlock the door. There was some delay in the keys being activated to work instantly but it worked fine when we returned from dinner. The bed was huge, soft, and clean. The bathroom was large with clean towels and hot water! (We did not have this experience at other places we stayed) There was a TV, fridge, microwave and coffee pot in the room. The only complaint might be that a couple of the wondows did not completely close, but the AC worked fine and kept us cool. We were only here for one night, but liked the room immensely.", "Date": "January 11, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "atlanta", "Title": "“surprised exceeded expectations!”", "Author": "wakaromo", "ReviewID": "UR52807078", "Content": "This was a welcome stay after a long drive from San Juan! Lucy the lady at the front desk was very welcoming, lovely and honest! even told us to take a higher floor becoz of mosquitos! the manager who was called from home came and showed us the room, he was a great honest man and i think he is the owner! the room was spacious, clean, quiet and had tv, microwave n fridge which were very helpful when u have a 5 yrs old asking for milk at night. we got a deal 3 days 2 nites including breakfast n dinner! what more would u ask! i would return and yes the beach n airport are within very easy reach! did i meantion the food at the hotel was great! they have friendly people and treated us with utter hospitality even with out very limited spanish! we will be back and besided the rooms, the pool and fun too, clean, safe and in a good location right in front of the rooms. the security is great both for the rooms and the cars. there is even a digitally lockable safe in the rooms! it is very easy to find, 9km from highway 2 right on the road on road 110 on the way to aquadilla air port (BQN). the may need to update the room decor, but rooms are very clean and its easy to get clean towels. we stayed 4 days 3 nights and even then we didnot exhaust all that La Cima has to offer, the gym, game room, spa etc. over all we have stayed in other hotels in PR but this one is tops. not a 5 star but very family friendly and safe place.", "Date": "January 7, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "2", "Location": "3", "Rooms": "1"}, "AuthorLocation": "Ponce", "Title": "“Poor housekeeping”", "Author": "MannyPonce", "ReviewID": "UR32836087", "Content": "We changed 3 times rooms the same day because the AC wasn' t working properly. Also, the romms carpets and bathromms was too dirty.", "Date": "June 21, 2009"}, {"Ratings": {"Overall": "3.0"}, "AuthorLocation": "Puero Rico", "Title": "“Yes it Was loud”", "Author": "alexandrabenavent", "ReviewID": "UR32333956", "Content": "Im stayed with my husband in this hotel \"LA CIMA\" to melt a little of stress from the kids, But really with all the music from the bar dont expect any relaxation Cause its not going to happen", "Date": "June 14, 2009"}, {"Ratings": {"Service": "2", "Cleanliness": "2", "Overall": "2.0", "Value": "1", "Location": "3", "Rooms": "1"}, "AuthorLocation": "flex71", "Title": "“Too Loud”", "Author": "flex71", "ReviewID": "UR30772248", "Content": "What a horror seen. The rooms need some help from the fashion police. We stayed here for a night due to a concert being held at a near by airport. When we got back from the concert we found the hotel parking area to have a concert of its own. A few folks parting, drinking and listening to loud music all from the trunks of there cars. Turned out some were staying in the room right next to us. From the time we parked our car and got to bed no sight of management personnel or security on the premises. I’m guessing security was nowhere to be found because the noise continued well into the night.", "Date": "May 26, 2009"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Overall": "2.0", "Value": "1", "Location": "3", "Rooms": "1"}, "AuthorLocation": "Maine", "Title": "“Loud”", "Author": "abconnolly", "ReviewID": "UR30710844", "Content": "We stayed here for one night before a very early flight. Very close to the airport. The room was fairly clean (except for the questionable blanket), but old and ugly. It looked like it was furnished from a garage sale. It's an old motel basically. It would have been fine for a nights sleep before our flight if the noise wasn't so bad. Our room was over the bar, which was very loud and was still going strong when we checked out at 4am complete with half naked drunk women in the parking lot. Management is well aware of the noise because the office (which is open all night) is right across the parking lot. The traffic from the road never let up either with cars honking in the parking lot all night. Looking back, we would have been better off having a late dinner and going to the airport to sleep on a bench for a few hours.", "Date": "May 25, 2009"}, {"Ratings": {"Cleanliness": "1", "Overall": "1.0", "Rooms": "1", "Location": "5"}, "AuthorLocation": "puerto rico", "Title": "“stopped by to see friends”", "Author": "torres_fabre", "ReviewID": "UR23661709", "Content": "la cima has been around for so many years and its known to be a well kept clean family owned parador. i still remember when the resraurant was way up front. it was pretty much the only one in the area. so for many years i have recomended la cima to family and friends that have come down for some fun in the sun annd everyone has left happy. some friends of mine came down for a quick stay so i send them to la cima like i normaly do. i went by to have a few drinks with them i think i should have stayed home. all thay spoke about was how rundown the hotel was. sad to say it was true. the out side of the parador was in bad shape it was full of water and had nice size pot holes in front. i did not go up to the room but from what i was told my friends were not to happy. no i did not stay in la cima but i wont recommend it to anyone anymore. the last reveiw posted was probably right.", "Date": "January 18, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Flower Mound, Texas", "Title": "“Perfect Stay!”", "Author": "goodbull", "ReviewID": "UR16890527", "Content": "After talking to some people who had been to PR several times, we decided to leave San Juan and explore the island. When looking for places to stay during our trek across the NW side of the island, we made sure we consulted the \"experts\" on tripadvisor. As usual, they were right on the money! La Cima was a delightful place to spend a few days. It is close to some great beaches and has a great pool area itself. The staff made us feel welcome and the rooms were very clean. For the money, you cant beat it! Make sure you go horse back riding nearby! They take you to an amazing secluded beach! http://www.tropicaltrailrides.com/", "Date": "June 13, 2008"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "pittsburgh", "Title": "“didn't stay but LOVED Nomadas!!!”", "Author": "mexicanhatdance", "ReviewID": "UR15939602", "Content": "We stayed at a beach house in Isabela and traveled all over the island...Nomadas was by far the best meal we had! salmon was cooked perfectly, the salads where amazing(mixed greens, good tomatoes and good dressing hard to find in most places), the churrasco steak was the best i've ever had. we even got dessert--which we never do--but figured it would be worth it if it was as good as dinner.", "Date": "May 11, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Puerto Rico", "Title": "“Home away from home”", "Author": "EmJay_1956", "ReviewID": "UR15335468", "Content": "After 30 days here I think I can give an opinion. The stay has been home away from home. Started in room 301, great studio for a long stay, but got tired of the stairs and carrying my computer and papers up and down everyday and asked to be moved. I packed they moved me to 102 in front of the Pools and jacuzzi, love the sound of the waterfall at night. The 2 restaurants have great food and are very accomodating with special requests of things not on the menu. Got to be on a first name basis with the Fantastic Staff, from Frankie, Gladys, Lucy and even the cheff at the Nomada Rest. Rooms and grounds very clean. It is not the RITZ but it is sure a nice place to stay!!! Thumbs Up from me. The resident at 102.", "Date": "April 24, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Lake Placid, Florida", "Title": "“Very nice--will return”", "Author": "BroncoBill", "ReviewID": "UR13517281", "Content": "I just returned from a 4 night stay at this hotel, and I will definately return. I was in Room 103, which is by the pool. The room was very clean on arrival, and housekeeping was there every day to straighten it up. The room was quite large and had a very comfortable king-size bed, a sofa/sitting area, microwave, refrigerator, coffee-maker with daily refills of coffee, in-room safe, hairdryer, a liquid soap and shampoo dispenser in the shower, and an iron/ironing board. The cable TV worked perfectly, and the water was VERY hot in the large shower. On the property is a cocktail lounge which is open until midnight, a Chinese Restaurant, and a Continental restaurant, which is also open for breakfast. Breakfast was around $6.00, and the dinners ranged from $7.00--$16.00. The food was quite good, and any special requests were not a problem. There is also an exercise room, and game room for guests to use. The staff was extremely friendly, and helpful in planning day trips. For $85.00 a night, this hotel is a great value--and location wise, you can't beat it. 10 minutes to anywhere in town. The hotel looks better than the photos.", "Date": "February 13, 2008"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Business service (e.g., internet access)": "3", "Check in / front desk": "1", "Overall": "1.0", "Value": "1", "Location": "3"}, "AuthorLocation": "Coamo", "Title": "“Terrible experience with the manager”", "Author": "noover", "ReviewID": "UR8115088", "Content": "Terrible experience....We stayed in this \"hotel\" with my wife's family on june 22 through june 24 2007. My wife's family arrive first and did the check in for all of us. We arrive later in the night. Next day we came to front desk to ask for the pool purses and after waiting there for about 20 minutes my wife an I asked very gently if there were a problem on giving us the purses. The manager came out from his office yelling at us and threatening with his hands(almost hit us) with a complete lack of respect attitude accusing us of trying to use the pool without a reservation. He was asking me to pay a ridiculous high additional amount for my 10 months old infant child. After discussion the trip was ruined . He apologized with my wifes family for his attitude. Anyway the pool had cigarette smell and a lot of drunk people drinking inside it and throwing ice. I don't recommend you to stay here. Partially it was my fault, some friends told me not to stay there.", "Date": "July 14, 2007"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Business service (e.g., internet access)": "5", "Check in / front desk": "3", "Overall": "3.0", "Value": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "wilmington, nc", "Title": "“Good but Loud at times”", "Author": "nomadicthought", "ReviewID": "UR6820886", "Content": "The hotel was very nice for the money. But we stayed in a room right above the lobby and across from the bar. It was very loud at times with the street traffic and the bar played music (which we could hear every note) until midnight. Otherwise the staff was friendly but not very knowledgable. When we asked for a Mexican restaurant close by we were sent to Taco Bell (when there was a good Mexican restaurant right down the street from the hotel!). All in all, not bad for the money and the rooms were clean.", "Date": "February 21, 2007"}, {"Ratings": {"Cleanliness": "4", "Overall": "4.0", "Value": "5", "Service": "4", "Rooms": "4"}, "AuthorLocation": "Westminster Ma", "Title": "“Great Value”", "Author": "A TripAdvisor Member", "ReviewID": "UR4727762", "Content": "Stayed here on a business trip and was pleased with the staff, proximity to the airport, room and especially the rate.", "Date": "March 23, 2006"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Xenia, OH", "Title": "“Pleased”", "Author": "A TripAdvisor Member", "ReviewID": "UR1925285", "Content": "We arrived late in the afternoon after a very long flight and drive. The lady at the check in was very friendy and nice. Our room was on the second floor. Everything around the hotel was clean and kept up. Our room was very clean and you could tell it was well cared for. We ate breakfast there and it met the demand. Nothing special. I would go back there in a heart beat. Our experience was good, better than our friends that stayed in San Juan.", "Date": "May 11, 2004"}], "HotelInfo": {"Name": "La Cima Hotel", "HotelURL": "/ShowUserReviews-g580452-d251392-Reviews-La_Cima_Hotel-Aguadilla_Puerto_Rico.html", "Price": "$82 - $108*", "Address": "<address> <span rel=\"v:address\"> <span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">Carr. 110 km 9.2</span>, <span class=\"locality\"><span property=\"v:locality\">Aguadilla</span> <span property=\"v:postal-code\">00603</span></span>, <span class=\"country-name\" property=\"v:country-name\">Puerto Rico</span> </span> </span> </address>", "HotelID": "251392", "ImgURL": "http://media-cdn.tripadvisor.com/media/ProviderThumbnails/dirs/18/85/1885e0c0fc540c0f9cb8a88c01004e781large.jpg"}}