{"Reviews": [{"Ratings": {"Service": "1", "Cleanliness": "2", "Overall": "1.0", "Value": "1", "Sleep Quality": "3", "Rooms": "2", "Location": "3"}, "AuthorLocation": "swansea", "Title": "“Look elsewhere”", "Author": "andy K", "ReviewID": "UR127331854", "Content": "Rude staff. Room was cold and when I asked to turn radiator on was told \"we don't put the heating on at this temperature\" so there was no heat in the room! Breakfast - a joke. Boiled egg, cheese slice, toast, sachets of honey or marmalade. Smell in room like damp or staleness.", "Date": "April 5, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Sleep Quality": "4", "Rooms": "2", "Location": "4"}, "AuthorLocation": "Norfolk", "Title": "“You get what you pay for”", "Author": "sammijNorfolk", "ReviewID": "UR126139449", "Content": "Wanted two nights stay in London so needed somewhere very cheap as on a tight budget and this hotel was it so i wasnt expecting to much from it, had a double room which was very small, a shower and toilet which was clean, breakfast was ok cereal, toast, juice all very basic but if moneys tight this was fine for a couple of nights and the location was ok shepherds bush underground is the nearest tube then its just a 5 min walk to the hotel. Rooms could do with a lick of paint, new carpets and some newer furniture to make it a bit more of a pleasant stay.", "Date": "March 15, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "2", "Sleep Quality": "2", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Huddersfield, United Kingdom", "Title": "“Weekend Stay?”", "Author": "A TripAdvisor Member", "ReviewID": "UR126101908", "Content": "The room provide was didn't have enough room for 3. Window not secure, smelt as you walked down the stairs. I wouldn't recommend this to my friends or colleagues. Breakfast was shambolic.", "Date": "March 14, 2012"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "1"}, "AuthorLocation": "Tarragona, Catalonia, Spain", "Title": "“OWNERS ME MY ITEMS STOLEN”", "Author": "Oscar S", "ReviewID": "UR124309014", "Content": "I forgot personal belongings in the basement room we stayed. They said they had my items, but refuse to send ... 2 carriers have gone through my prepaid items and the hotel refused to deliver them. MY OPINION ABOUT THE Kensington Suite Hotel IS THAT STEAL TO THEIR CUSTOMERS! ITS MY CASE. IM WAITING 2 MONTHS AND NOTHING!!!", "Date": "February 8, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "2", "Overall": "2.0", "Value": "2", "Sleep Quality": "3", "Rooms": "2", "Location": "3"}, "AuthorLocation": "Logan, Utah", "Title": "“Not as advertised”", "Author": "Barbara H", "ReviewID": "UR122525368", "Content": "We arrived at the hotel and the desk clerk was very nice, but when we went up to the room, it was not what I had booked. I had a larger room with a balcony. When I went dow to talk with him, he stated we did have a balcony--window!!! up high with pidgens on the ledge, not what I would call a balcony. Since he said there wer no other rooms, we took the room, but feel it was falsly advertised.", "Date": "January 4, 2012"}, {"Ratings": {"Service": "2", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "4"}, "AuthorLocation": "Portsmouth, United Kingdom", "Title": "“JUST DON'T DO IT!!!!”", "Author": "Sue T", "ReviewID": "UR122107511", "Content": "We needed a hotel near Olympia for the horse of the year show,we would have had a better time staying in a stable(with the Horse!). The staff were uninterested.The rooms we had were very cramped both rooms had stained toilets,no plugs in the basins ,one room had a completley rotten shower door,the other room the shower track was so filthy we did not use the shower,both rooms had handles hanging of the doors. The family room had two single beds and a pull down sofa type bed behind a curtain. The bed was surrounded by holes in the floor.A microwave was balanced on a chair.The batteries in the television remote control were actally coroded so unable to use.The radiator thermo stat was broken so on hot all the time. Continental breakfast was very very basic. A very unpleasant stay indeed.", "Date": "December 26, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Location": "1", "Rooms": "1"}, "AuthorLocation": "", "Title": "“Flea Pit. Don't even think about it unless you are accustomed to living in depravation.”", "Author": "fozzie68", "ReviewID": "UR121084936", "Content": "This is not a 'Suites Hotel' as there are no suites. It is not even a hotel, but more like an over priced hostel and judging by the clientele it is more than likely a bail hostel. It isn't even in Kensington, but Shepherd's Bush. It boasts three stars but doesn't deserve one. If you arrive early you will not be allowed to check in. If you want to leave your bags and go shopping, there is a £5 charge but the storage is the corner of the lobby and insecure. We saw a weekend deal at £95 for one night including breakfast which sounded like a good deal. The room was grotty and I felt physically sick; I could have cried. The carpet was disgusting and the room stank of stale beer. Stupidly we paid cash on arrival and could not get a refund. So we left, wiped our feet on the way out and savoured the fresh air.", "Date": "November 27, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "2.0", "Value": "3", "Sleep Quality": "3", "Rooms": "2", "Location": "5"}, "AuthorLocation": "Newcastle, United Kingdom", "Title": "“Not Impressed”", "Author": "NORTH-CHEF-CRITIC", "ReviewID": "UR119298094", "Content": "I often frequent London on business and after traveling for a long time my first thoughts are relaxing in my room and a bite to eat. When i arrived at this hotel I thought the taxi driver had made a mistake yet he assured me this was the right place with a grin that could only mean this place has a reputation, this put me on the defensive instantly and my phone was ready to ring my boss. When i checked in the staff were polite if not very talkative but seemed to know what they were doing so I got my items and went to the room, it was old to say the least but it wasn't bad enough for me to risk my job over so I got into the bed to relax, again the bed was average and not particularly comfortable but it did the job, I choose to eat out at a local restaurant and as your in a upmarket area of London your spoilt for choice. This helped as k managed to stay out as much as possible. All in all a average stay but with some poor patches, I don't usually right reviews unless it's a terrible stay or a fantastic one, but this one seemed to need a little attention after seeing there trip advisor. It's not great but not terrible like the review says it probably falls into the category of poor unless your a bit pretentious and expect the best wherever you go. Not the type of hotel you would treat yourself to or make a special trip, personally I think the fact it's in Kensington gives it the best and worst criteria so it's for yourself to try if your on a budget but want to be in a nice area of London.", "Date": "October 14, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "5", "Overall": "4.0", "Value": "5", "Service": "4"}, "AuthorLocation": "Florida", "Title": "“Affordable, SO convenient!! Small, older rooms in classic Victorian townhouse.”", "Author": "ibgayle", "ReviewID": "UR116666550", "Content": "Flew into London alone, no reservations and pretty much no budget! After a 10 hr flight, a hostel was an unbearable thot, so I sat at Heathrow & called around to find a cheap, one night stopover, where I would not actually pick up fleas. These guys were not chatty but quite courteous, adjusted the single price down to just a bit over what the hostel charges for a bunk bed, and even gave me excellent directions including which trains, then which bus and the stop - WHICH IS RIGHT OUT THEIR FRONT DOOR! So convenient - I would've had more trouble trying to navigate & park a rental car, thereby saving a small fortune, if not my life (London drivers!) My 2 twinbed room was small but comfy, right by the lift! - not a walk-up. There's a tiny kitchen cupboard, w/ fridge, microwave, teapot, clean! china and selection of teas. After running around London all evening, I was able to bring back a curry from Harrods food court to watch late night British TV, and had my own yummy pasties for breckers next am! The all-new bathroom looked like a demo from the DYI showroom - gorgeously tiled, new fixtures, just gleaming, nearly steamed myself w/ the endless hot water. Small, yes, but for a few pounds more, I was spared the shared-bath hostel!! Tho on a busy street, my room had a big window looking out on the quiet back yard. Next am, rainy, but just a few steps out to the bus, and on to the train for Dover. SO grateful for this hotel, it is very easy to stay here, and I'll be back!", "Date": "August 13, 2011"}, {"Ratings": {"Cleanliness": "1", "Sleep Quality": "1", "Overall": "1.0", "Value": "1", "Service": "1"}, "AuthorLocation": "sheffield", "Title": "“TERRIBLE NIGHTMARE”", "Author": "sheffieldzec", "ReviewID": "UR115861899", "Content": "we have just got back from a 3 night stay at this hotel due to work commitments in london and needing somewhere at short notice to stay. what can i say ! i could have cried when i walked into the hotel and saw the state of the place,it was 11.30pm and we had been travelling half the day otherwise i would have found another hotel to stay plus my daughter was not feeling well so we had no choice but to stay put. on entering the hotel i found the reception to be cluttered with old items of unused stacked firniture which were piled into a corner.the man who sat on reception was very rude.there was a man at recption complaining about the state of his room and this immediately got me worried.when i opened the door to our room i was devastated. it was supposed to be a twin ensuite room.it was tiny. there were 2 single beds and a tv on the wall, nothing else,no wardrobe or chairs to sit on.the carpet was filthy with all sorts of spillage stains and iron burns on it and it looked as if it not been hoovered for months.the beds had clean on with old dirty woolen blankets and throws which i removed before we got into bed.on the hotel booking site it stated that all rooms had tea making faccilities and mini bar but ours had a kettle with no lid that would not work ,2 cups that were chipped and a filthy empty fridge, there was no bar in the hotel.most of the bulbs were out,the shower was filthy,toilet seat hanging off and no waste fixture in the sink. the bathroom smelt horrible and the bedroom smelt fusty.we decided as it was late to go to bed and sort it out in the morning.there was loud music coming from the room next door which went on all night and no one from management came to stop it.the next morning we got ready to go to work for the day and went down to what was supposed to be a continental breakfast.the breakfast room was in the basement of the building. it was filthy and smelly and was full of what seemed liked assylum seekers. i wondered if maybe the hotel had some arrangement with the local council doing B+B for refugees as it looked that way. it certainly was very uncomfortable being there. breakfast was a joke. there was 2 hovis loaves still in the wrappers placed at the side of a toaster, a large fruit bowl full of cornflakes[no other cerial choice],a few tiny packs of marmalde probably 1 for each guest but no more,a jug of orange and coffee in a small household teasmade type dispenser.i had to ask for a cup as there was no crockery or cutlery on hand. we decided we would get breakfast elsewhere so left. when work had finished for the day we stayed out as long as possible so as not to have to go back to this hotel.it certainly ruined my stay in london and i would urge people thinking of going to stay there definately not to. it is a horrendous place. i dont know where the photos on the website have come from but they are not of the kennsington suite hotel .this place should be closed down!!!!!", "Date": "July 27, 2011"}, {"Ratings": {"Cleanliness": "1", "Sleep Quality": "2", "Overall": "1.0", "Value": "1", "Service": "1"}, "AuthorLocation": "Oslo, Norway", "Title": "“Horrible rooms, breakfast and unpolite staff”", "Author": "Jen190479", "ReviewID": "UR115624907", "Content": "I was here 18.7-20-7 togetteher with two friends. The wiew from the window: several old ,dirty toilets left in the garden. Terrible carpet, dirty. The shower was about to fall apart. The staff, especially the guy who sat in the reseption wednesday morning, was terrible unpolite. We had to pay £ 10 to leave our luggage at the hotel some hours before we had to go home. The brakfast: swet, old cheese and jam. A small breakfast room. We dropped the breakfast the other morning. Don,t stay at thi8s hote. Tent would be a better alternative. The girls from Norway", "Date": "July 21, 2011"}, {"Ratings": {"Cleanliness": "1", "Sleep Quality": "1", "Overall": "1.0", "Value": "1", "Service": "1"}, "AuthorLocation": "Moscow, Russia", "Title": "“never ever again”", "Author": "taratuta", "ReviewID": "UR115578054", "Content": "dear travelers, there is no single good word to say about this hotel. Unfriendly staff behaving like they do you a big favor to let you in. Horrible dirty room. Smelly toilet. This is not value for money. This is not smth which may cost 99 GBP per night for double room. My partner and myself were very disappointed with the quality of this place. It was far from what was declared and shown on pics. Beware.", "Date": "July 20, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "2", "Location": "3", "Rooms": "1"}, "AuthorLocation": "", "Title": "“Not hospitable!”", "Author": "aid81", "ReviewID": "UR115246448", "Content": "We knew before we arrived not to have much expectations due to the price and previous reviews. Rooms are tiny, all reception area is cluttered. Asked the older man on the desk can we leave our 2 bags at the desk while we go to get breakfast, he said yes but will be £10 charge. This will give you an impression of the kind of place it is not even a goodbye out the door for our 3 night stay. Stay away from here!!", "Date": "July 11, 2011"}, {"Ratings": {"Cleanliness": "2", "Sleep Quality": "1", "Overall": "2.0", "Value": "1", "Service": "2"}, "AuthorLocation": "Northampton, United Kingdom", "Title": "“Rip Off”", "Author": "1VC", "ReviewID": "UR115210072", "Content": "Checked In on Saturday afternooon for a 1 night stay. Chose the location due to Central London being very full and expensive but partner also needed to get to LHR early on Sunday morning so thought easy access to the Picadilly line - lo and behold, engineering meant there were no direct trains to LHR so could have stayed elsewhere! Payed £169 for a double room which was tiny and due to being situated on the main road very noisy too, especially as you couldn't shut the sash window and the secondary glazing did nothing to block the noise - there were emergency sirens passing by frequently and the road was very busy even to 4am in the morning. The sheets on the bed seemed cleaned but the orange/brown velvet throw on the bed was something to be desired and that was removed before getting anywhere into bed. The carpet was filthy and the en-suite extremely small and dark. This is one of the worst places I have stopped in and for less money have stayed 5 star in central London (appreciate may be at other times of year). I would not recommend this and for this kind of standard, I'm sure we could have got a Travelodge or something similar for a cheaper price but better quality. One to be avoided I think.", "Date": "July 10, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Location": "4", "Rooms": "3"}, "AuthorLocation": "", "Title": "“Give them a break it was fine :-)”", "Author": "Thebringhursts", "ReviewID": "UR114955998", "Content": "After reading reviews about the hotel after we booked (yep short notice) i was dreading it ! But.. The staff were all really polite no complaints there.. The hotel other than a few boxes laying around was clean.. The room was small but again clean with an ensuite wet room again clean.. It wasn't one of the best hotels I've stayed in but it Definately wasn't the worst.. Give this hotel a break :-) if you just want somewhere to stay without breaking the bank and want somewhere clean then this hotel is for you !!!", "Date": "July 2, 2011"}, {"Ratings": {"Cleanliness": "2", "Sleep Quality": "1", "Overall": "1.0", "Value": "2", "Service": "1"}, "AuthorLocation": "Norwich, United Kingdom", "Title": "“I would have written a nice review but...”", "Author": "Pop170", "ReviewID": "UR114687055", "Content": "We stayed at this hotel last night. It is basic but for the money you cannot really complain. However, I realised that we had left both of our iphone chargers in the room. So, naturally, I called up the hotel to inform them of this thinking that they would either have found them or would double check with their chambermaid and then call me back... no. They hadn't been handed in so there was no more they could do. I was somewhat taken aback by this because when you leave something at a hotel I would expect them to find it, and be able to send it back to you but when I tried to explain this, the guy who answered the phone then became very aggressive and was pretty much shouting at me down the phone and then ended the conversation by hanging up the phone on me. NOT what I would expect as a paying customer of the hotel. ABSOLUTELY DISGUSTED. Some people may say what do you expect when it is so cheap to stay there, and I am not bothered by fancy facilities etc but regardless of the price I expect hotel staff to have common courtesy towards their guests.", "Date": "June 23, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "2"}, "AuthorLocation": "Wigan, United Kingdom", "Title": "“An absolute disgrace”", "Author": "KirstyMitchell", "ReviewID": "UR110721469", "Content": "When arriving at this hotel we were informed by the manager that he had no recollection of our booking at all, stating we did not book any rooms. However, this was not the case as we had booked two triple rooms and had our confirmation letter to prove it. The manager then went on to say we had booked (after our details had been spotted on the manager’s computer by on of our group members) but we had cancelled. This again, was not the case. Our rooms had been cancelled by somebody at the hotel and we as a group feel our rooms had been resold at a much higher price due to it being the Champions League Final night. I would not advice anybody to stay at this hotel. Not only was the small lobby area unclean the hotel manager’s attitude towards myself and my group member was an absolute disgrace. May I add the toilet area was also unclean; I would not let a dog toilet in those conditions not alone a human being.", "Date": "May 31, 2011"}, {"Ratings": {"Service": "2", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "bergamo", "Title": "“BASIC BUT THERE'S EVERYTHING YOU NEED.”", "Author": "marta74bg", "ReviewID": "UR104609067", "Content": "Very good location to visit the city. Situated on a bit noisy road but not a big problem. Rooms and bathrooms small but very clean! Good and abundant breakfast. Definitely to recomend for a budget and short stay in London.", "Date": "April 19, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "2"}, "AuthorLocation": "bath", "Title": "“Worst Hotel I have ever stayed in!!”", "Author": "bathloulou", "ReviewID": "UR100200293", "Content": "This hotel should be closed. It wasappaling.. I am not sure where to begin. The bathroom was filthy, the loo seat didn't fit ,it was dirty. the shower didn't work and there were no plugs in the hole. When asked at reception for a plug they told us to put a breakfast ceramic bowl in the sink to catch the water so my partner could have a wet shave. What?!! rediculous. The beds were uncomfortable, there were used cotton buds on the floor. There was damp on the walls with plaster falling off. The window did not shut and one of the pains of glass was broken. Our view was on to the supposed garden which was full of rubbish , ladders and bins and cigarettebutts from the kitchen staff who smoked outside the back door while we ate some manky toast and drank awful coffee. It was dreadful and so we left early in the morning and moved to another hotel as we could not bear to return. Even though we had paid a stupid amount of money to be treated so badly. Never ever again. I wish I had read the other reviews before we went as it really should be shut down.", "Date": "March 14, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "1.0", "Value": "2", "Sleep Quality": "1", "Rooms": "1", "Location": "4"}, "AuthorLocation": "Bilbao, Spain", "Title": "“Worst impossible”", "Author": "Jator-C", "ReviewID": "UR99552087", "Content": "After arriving to the Hotel, we noticed several things: the location was near from the Holland Road, a street with lots of traffic. For saying just two things: there was no double cristal in the room, so that I was unable to sleep in the whole night; and the shower stucked, so that the full bathroom got flood, because it was not a shower tub, but just a hole in the ground. Fortunatelly, the following day, they swaped my room, and it was quite better. Finally, to cap it all, after checking out, we asked for leaving our handluggage in the hotel, and they asked for FIVE POUNDS for that service, for each of the rented rooms. Any of this things in my country cannot be called even a one-star hotel. This one was supposed to have three stars! Awful.", "Date": "March 9, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "4"}, "AuthorLocation": "wales", "Title": "“Worst hotel we have ever stayed in”", "Author": "prague69Wales", "ReviewID": "UR91604879", "Content": "Rooms very small and cramped Tried to get 3 of us into 1 room eventhough we had booked and paid for 2 rooms Shower door didnt close Found used condom under bed! Breakfast consisted of cornflakes ,boiled eggs and cheap sliced bread still in wrappers Staff very unprofessional. Nobody smiled or spoke. Even staff on reception were not friendly I could write a book on it but be warned!", "Date": "January 3, 2011"}, {"Ratings": {"Service": "2", "Cleanliness": "5", "Overall": "2.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "3"}, "AuthorLocation": "Suffolk", "Title": "“Would definately NOT recommend this place”", "Author": "Tisme67", "ReviewID": "UR90235461", "Content": "My daughter & I stayed here in a twin room that was barely big enough for a single bed let alone 2 singles. The beds & pillows were desparately uncomfortable, The sheets & blanket didn't fit properly. The thermostatic control on the radiator was broken so we couldn't turn the heating off, we had to leave the window open during the night, the traffic along the road is relentless so a very noisy night. Coupled with the fact that the light switches in the en-suite were broken therefore the lights could not be turned off & the en-suite door handle was broken so the door could not be closed causing light to stream into the bedroom. By the shower there is nowhere to stand shower gel or shampoo. We were so desparate to get out of there, we didn't even stay around for breakfast, so can't comment on the food, but other guests did tell us the food was dreadful. So not to sound completely negative, on the plus side, there was plenty of tea, coffee, sugar &milk in the room, more than is normally supplied in hotels. The cleanliness could not be faulted. Would I stay here again???? Not if my life depended on it", "Date": "December 19, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "2", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "2"}, "AuthorLocation": "Bradford, United Kingdom", "Title": "“An absolute Disgrace, staff so ignorant, a horrendous place”", "Author": "Queako", "ReviewID": "UR89671829", "Content": "Anyone reading this i urge you, for your own sake, do not stay here. We would not return if we were paid. The staff here are absolutely disgraceful, extremely disrespectful, ignorant, self centred, rude and very unhelpful in every way. Thats from the so called manager to other staff on the front desk throughout. Cannot stress enough just how igorant these people are, tried to check outsame day and the next morning (on a 2 night stay) and were unable to get any refund. This is such a horrible place, the rooms are so, so small and no drawers or wardrobe in any room! Showers tiny, no plug in sink, browkn lights hanging off wall, shelves broken and hanging, toilet roll holders missing with dangerous screws left in place. Central heating red hot and doesnt turn off, very uncomfortable. An absolute disgrace for any money paid to stay here, let alonme what we did. The one plus point for this 'hostel' is that the door opens to leave.......Please do not bother, this is not a one off poor review, please take note.....", "Date": "December 12, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "1"}, "AuthorLocation": "Halifax, United Kingdom", "Title": "“Everything about it a disaster and nothing like it claims”", "Author": "anonymous37_10", "ReviewID": "UR89671593", "Content": "Rude staff who are only interested in money not your comfort. Pokey rooms with no cupboards or draw space so couldnt unpack. Claimed to be in heart of Westend - not true whatsoever Believe me you dont want to stay here", "Date": "December 12, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "5", "Overall": "3.0", "Value": "2", "Sleep Quality": "3", "Rooms": "2", "Location": "4"}, "AuthorLocation": "Portland, Oregon", "Title": "“Hostile staff and management”", "Author": "highflyer2202", "ReviewID": "UR81976279", "Content": "The location is good in that it's near a Tube station and there are plenty of shops and restaurants around. However, the staff is unhelpful and rude. They reluctantly gave us towels (when it was their fault that they didn't give us enough towels). The rooms are cramped. The advertised wi-fi doesn't work. TV didn't work correctly. For the price, the only redeeming things about it are the location and the cleanliness. But it wasn't a good experience overall.", "Date": "October 3, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "1"}, "AuthorLocation": "Brooklyn, WIsconsin", "Title": "“Americans beware!”", "Author": "MLSBrooklyn", "ReviewID": "UR76236079", "Content": "After a full day of travel we were very happy to find our hotel. Much to our surprise (we, one single woman and one couple) found ourselves dealing with an unlwelcoming and hostile owner behind the front desk. He stood up, spread his hands across the front desk, all the while sighing as if we were causing him great distress, thrust paperwork in front of my sister and DEMANDED she fill it out. He proceeded to inform us that we would be getting two rooms because he did not have a family room, (who cares!?!) that he no longer booked through Expedia because of the mistakes they made (it was obviously his lack of intelligence that resulted in the booking errors), and that we would not be getting breakfast because we didn't request it. At the last comment, an unidentified, and previously unseen gentleman in the waiting area added an emphatic \"Yeh, you tell them\". We went to our rooms, found them unacceptable (mostly because of our greeting and fact that my sister is disabled and was not comfortable) and returned to the front desk to inform him that we would not be staying at his hotel. He lounged back in his chair, spread his hands and said \"what, what's the problem!?! I'm giving you two rooms for one.\" I informed him that he was arrogant, belligerent and condescending. He responded \"no, it was you, walking in here, looking at me and judging\" (he was middle eastern). When, in reality, he looked, judged and condemned us the minute we walked through the door. DO NOT STAY HERE EVER!!!", "Date": "August 21, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "3"}, "AuthorLocation": "Toulouse, France", "Title": "“This hotel is a joke! It's just not funny”", "Author": "Dajtay", "ReviewID": "UR73348811", "Content": "This has got to be by far the worst hotel I have ever stayed in. The room given to my partner and I was Room 34, which can only be described as smaller than a rabbit hutch. The room was dirty, small, badly designed and equipped. 1, Toe nail found on desk next to phone!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!! 2, Fully equipped kitchenette = Small cupboard with tiny fridge, sink and a microwave. unfortunately the position of television on wall rendered the \"kitchenette\" almost unusable. 3. Room was so small, if you have 1 suitcase you have to climb over the bed to access the other side of the room. Thus enabling you to peer through the filthy window to the street below. 4, Bathroom = Shower unable to keep constant temperature, lighting inadequate and worked randomly when tapped repeatedly. Dirty. 5, Internet = Free if you can access it. However not being able to see or connect to the network does not in my eyes constitute free internet. Pathetic! 6, Reception on television very poor. 7, Continental breakfast = Joke! Toast, cornflakes, and offee. Where was the fresh fruit, maybe a croissant or pastry? Pathetic. That also extends to the Breakfast room, which was also small dirty and cramped. I could not get my legs under the table to sit straight! In conclusion my advice would be, do not stay at this hotel under any circumstances even if your life depended on it. It's just not worth the hassle and disappointment. IT IS A RIP OFF! How it ever achieved 3 stars will remain a mystery to me for eternity.", "Date": "August 2, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "1"}, "AuthorLocation": "Toronto, Canada", "Title": "“Horrible...run away as fast as you can!!”", "Author": "quilter60", "ReviewID": "UR68114873", "Content": "Background: final night of a three week trip to UK. Everywhere we stayed was booked ahead and pre-paid. This was our only bad experience. First off, we were told breakfast was 7:30 to 10:30 in the morning. I will return to this point. Upon registering, we only received the magnetic key entry--nothing else. We deposited our luggage in our room. To say we were disappointed would be an understatement. We returned to the front desk to ask where we could find a pub for supper. \"Up past the turnabout\" was the response. We set out walking--we ended up picking up snacks from a corner store, never did find a pub... We were afraid to walk on the carpet in bare feet--dirty, and covered with burn marks from an iron. Who knows what was lurking in amongst those fibres. One of the beds was jammed up against the window which looked out onto a dirty yard full of garbage. The window was open, and there were several flies buzzing around the room which we were unable to send to a better place. Although the sheets were clean, there was no mattress pad between me and the mattress, and I still have a bite that hasn't healed now 5 days later. We went for breakfast just before 9:25 am. We were abruptly told that breakfast was over. I asked for a bun or croissant, nope, nothing, breakfast is over. Upon attending to the front desk, I was told to consult the card that I had NOT been given the night before. It was shoved into my face, and emphasized that the card distinctly said that breakfast was over at 9:30. It didn't seem to matter a whit that I didn't get that card, or that I was told 10:30. When I asked for a refund of the breakfast, all that the manager would say is \"Not my problem\". So we were out the cost of our breakfast in addition to a lousy night's sleep. I wouldn't recommend this to my worst enemy!! This place has no customer service, and no respect. The cab driver who picked us up and took us to the airport also said, very politely, that this place does not have a very good reputation. Wish I had known this before hand!!", "Date": "June 20, 2010"}, {"Ratings": {"Cleanliness": "1", "Overall": "1.0", "Rooms": "1", "Value": "3", "Location": "5"}, "AuthorLocation": "Oxfordshire", "Title": "“Don't do it!”", "Author": "Daisycakes_10", "ReviewID": "UR61419434", "Content": "I booked this on late rooms . com as it was the cheepest.( You certainly get what you pay for.) I'd booked as was attending a conference nearby , had an early start and the hotel was the only thing | had to pay for. When I said the address to the taxi driver - he just laughed and said something along the lines of \" If you go missing, I'll let the police know\" !! The front desk gent was more than keen for me to pay asap and issued me with a room key. The damp smell from the room hit me as soon as I opened the door. I was a really hot, noisy room and VERY small. The double bed took up most of the room and the carpet was heavily soiled. The wardrobe door was missing and the bedside table was covered in a thick layer - or possibly layers of dust. I'm slightly asthmatic and could feel myself starting to wheeze! The bathroom was tiny and heavily scaled in lime scale. I decided I couldn't stay, so booked into the Hilton around the corner . I came back to get my bags and said to the front desk guy I was moving as 'some colleagues were staying there'. He simply replied - No refund. Say no more. Incidently, the Hilton was gorgeous !", "Date": "April 15, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "4", "Sleep Quality": "3", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Nottingham", "Title": "“Good value - but very basic”", "Author": "CT2503", "ReviewID": "UR60796508", "Content": "We went to take my daughter to London for the weekend to see the sights. This hotel was good value, and not a bad location as it was 5 minutes walk from Shephards Bush tube. The room was small, shower not great and walls really thin - we could hear all conversations in the rooms next door. But, we weren't there much as we were there to see London, so for a value stay with a reasonable location, I would recommend.", "Date": "April 9, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "manchester", "Title": "“lovely stay here”", "Author": "julie09Manchester", "ReviewID": "UR60416995", "Content": "the staff on the desk were very happy to help and friendly, room was very clean and just what is needed to have a comfortable stay, the breakfast area was nice and clean and 2 young ladies were constantly keeping the continental breakfast bar topped up. We will definitely be returning to this hotel again this year with our son.", "Date": "April 5, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "1"}, "AuthorLocation": "Swansea, UK", "Title": "“Room double booked”", "Author": "Annime", "ReviewID": "UR59272163", "Content": "We booked a triple room at this hotel but never got to stay there. A couple of days ago we were contacted to say it was double booked........we were booked in over the Easter period so it has not been easy to find alternative accomodation. Not sure how we came to be double booked or why it took 3 weeks to inform us.......I suppose we should be glad they did before we arrived on the day. Given the reviews on here I am quite relieved we have found suitable alternative accomodation!", "Date": "March 22, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "1"}, "AuthorLocation": "Gualdo Tadino, Italy", "Title": "“The wrost booking department”", "Author": "AlessandroIngrosso", "ReviewID": "UR55874276", "Content": "I don't know the hotel... Do you know what happened? I booked a room and as per policy they charged to my credit card the deposit. At list I called the hotel and they told me: your reservation has been cancelled because your credit card is not valid. I can't understand the reason but I really would like to say to evereybody to be carefully...", "Date": "February 13, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Location": "5", "Rooms": "4"}, "AuthorLocation": "North Carolina", "Title": "“Easy accessability, very helpful staff, good value”", "Author": "MGKIA", "ReviewID": "UR53138371", "Content": "My sister and I chose this hotel based on location and fact it had a working lift (new). Previous reviews had described the room as extremely small. If you have been on a cruise ship, the room is set up the same way. Furnishing were new. Room was very clean and quiet. Bathroom was spacious, no problem with hot water. Breakfast was standard continental with choice of breads, jams, cereals, eggs, juice. Bus stop was within 200 meters of front door. Tub station was about a 10 minute (American) walk or 5 minutes if you are used to walking. The in room frig had a small freezer and the microwave would make it easy to heat a snack or meal. Across from the tube station is a shopping mall with a very nice grocery.", "Date": "January 10, 2010"}, {"Ratings": {"Service": "2", "Cleanliness": "2", "Overall": "3.0", "Value": "4", "Location": "5", "Rooms": "2"}, "AuthorLocation": "London, United Kingdom", "Title": "“You get what you pay for”", "Author": "Hels1807", "ReviewID": "UR49549190", "Content": "I booked a night to stay in the Kensington Suite Hotel without reading any of the reviews on this site. I book last minute off a cheap restaraunt as I was staying in London for a night as working early the next day. It was one of the cheapest places I found with my partner and all we really needed was a room in London. Thats what we got. The location is definitely the best part of the hotel as its a very short walk to the shopping centre with loads of restaurants. The hotel certainly didn't live up to the pictures on it's website but then for the price we paid we were happy whith what we got. A small, but clean room, clean bathroom and a quick checkin. The guy was friendly enough and chatted about football as we checked in. We didnt have time to go to breakfast as we left early but overall the hotel was fine for a stopover.", "Date": "November 19, 2009"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Location": "2", "Rooms": "1"}, "AuthorLocation": "London", "Title": "“\"Be Aware\", Dirty Bathrooms, Tiny Rooms, Over Charged !!! \"”", "Author": "silviarossi", "ReviewID": "UR49151106", "Content": "This is the worst hotel i have ever stayed at in my entire life. They over charged us and gave us the most cramped dark corner room with dirty carpets and dirty bathroom. It was hard to sleep from the smell of the toilet even when the door was shut. There were items missing from my suitcase. We only find out in the last day out of our 3 days stay so we couldn't proof anything. Good luck ! if you already booked this hell", "Date": "November 13, 2009"}, {"Ratings": {"Service": "1", "Cleanliness": "2", "Overall": "1.0", "Value": "1", "Location": "3", "Rooms": "1"}, "AuthorLocation": "wiltshire", "Title": "“What a rip off”", "Author": "ryalls59", "ReviewID": "UR48251093", "Content": "Well another day another bad hotel!! The only good thing about this hotel is the location. The reception guy was to busy smoking his fag to be bothered to check us in properly. The room wasnt big enough to swing a cat in with ripped up carpet, leaking shower, no bin for any rubbish. When asking for the code to use the apparent WIFI which it states you can use in this hotel the guy told us we had to pay £5 for the privelege, although at the same time he told us it wouldnt work very well in our room! But wanted us to pay for the pleasure anyway, when challenging him about this he said it stated this charge on there web site but not on Late Rooms so it was there mistake, i pulled the hotel up on my phone and there was no such charge so he had to give in and let us have the code, although he said he was going to speak with the manager about this so called MISTAKE! We paid for breakfast in the amount and believe me it wasnt a cheap hotel. When getting to the RESTAURANT! it was like being in a corridor, there was only 7 tables for 40 rooms, and the so called breakfast was just cornflakes, toast, a very very hard boiled egg and coffee, that was if you could get in there along with everyone else trying to at the same time, and if the staff had cracked a smile would of been nice but not even an utter of good morning nothing they just totally ignored you. All in all a horrible hotel with very rude staff for a lot of money.", "Date": "November 1, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "3", "Rooms": "4"}, "AuthorLocation": "Los Angeles", "Title": "“Dear Lord, what happened?”", "Author": "Alittlebitofthat", "ReviewID": "UR45865061", "Content": "Upon reading some of the other most recent reviews, I'm shocked. The hotel was darling and oh so good priced when I went there to stay last year. (I escaped from York House hotel which I originally had reservations with, to this one, and felt as if I had gone from hell to Heaven. The funny thing was, when I told the man at Kensington's front desk about this, he looked at me pointedly, and asked, \"York House Hotel? 27-28 Philbeach Gardens?\" It turns out that he and his partners had previously owned York House Hotel before selling it, to the God-awful people that now ru(i)n it. And then he was kind of sad. We both were.) The room I had was a nonsmoking double used as a single, and it was completely, spotlessly clean, which for there being a kitchenette in the room and for my standards, takes some responsible human beings to do. It was indeed small, and kind of hard to move around in, but all you needed was there. The kitchenette included a microwave , a mini fridge (Godsend when you are trying to save money when traveling!), sink, dishes and utensils, detergent, and teabags and coffee and kettle. The owner even had the thoughtfulness to put up a plank of wood on top of the bed so you can put your books, eyeglasses, cups, and whatnots there. There were overhead reading lights, too. The bathroom was fine. Everything looked pretty new, and was clean. The bed was comfortable, the sheets and cover new and clean. Something else worth mentioning--I stayed in a nonsmoking room cluster, and during my first night my neighbor (also nonsmoking room) started smoking, which was beginning to make me sick. I went down to the receptionist to gripe, and the nice, and somewhat boisterous Indian man made the smoking neighbor come out to apologize to me. :) I loved this place, and thought I might have found my own little spot, when I go to London; it's kind of heartbreaking for me to see all these bad reviews now, becuase it held a darling little place in my heart. Does anyone know whether they had changed owners during the past year?", "Date": "October 5, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Location": "4", "Rooms": "4"}, "AuthorLocation": "London, United Kingdom", "Title": "“the best ever”", "Author": "braveheart0891", "ReviewID": "UR41483249", "Content": "very nice hotel i recommend for every one .good price,location,facilities.specially the kichenette.", "Date": "September 14, 2009"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Location": "1", "Rooms": "1"}, "AuthorLocation": "Portsmouth", "Title": "“\"Urine Heaven!!\" NOT”", "Author": "PortsmouthRhonda", "ReviewID": "UR41131578", "Content": "This is without a doubt the most disguting place I have ever had the displeasure to step foot in, the smell of urine was so overwhelming it was outrageous. There was a mouse trap in the room and a carrier bag over the smoke alarm!! The kitchenette was actually a cupboard. We dared not even look under the duvet or check the sheets! Although we saw the funny side afterwards at the time it was not funny. The manager was refusing to refund us but after letting everyone else know about it as they arrived he eventually gave in to my demands. Very threatening behaviour from the manager. We ended up having to pay £500 for another hotel for the night as everywere else was booked that night. PLEASE DO NOT GO HERE!!!!!!!Should not be allowed :)", "Date": "September 12, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Location": "3", "Rooms": "3"}, "AuthorLocation": "Letchworth, United Kingdom", "Title": "“I will be there again”", "Author": "aguyfromitaly", "ReviewID": "UR35805151", "Content": "I've been in this hotel 4 days for business. Honestly, reading the past interview I wasn't pretty sceptic doing the reservation, but finally I say \"Well I've been in so many place, let me have a look also to this one\". Great choice Andrea. Hotel clean, small but cosy room equipped with mini-bar, micro wave, lcd 22\", ensuite, free good wi-fii connection. The continental breakfast didn't offered so much choice, but for the price I got the room (45£ per night bf included) in London I cannot regret anything. The location is good enough. 8 minutes fast walking from Shepherd's bush underground station (that's at the end of zone 2 on the central line). I will certainly go there again if I need to stay once more in London. If you are italian, and you'd like to read my italian review, you can find it at http://blog.teammatelabs.com/post/2009/07/24/Dormire-a-Londra-Kensington-Hotel-Suite.aspx", "Date": "July 26, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "4.0", "Value": "4", "Location": "4", "Rooms": "4"}, "AuthorLocation": "berecca13", "Title": "“Great location, free wifi, good service and great value for money!”", "Author": "berecca13", "ReviewID": "UR35697617", "Content": "Although there seem to be quite a few negative reviews on this hotel, they appear to be mostly from double and triple rooms. I did see inside one of the double rooms when I was there, and it was miniscule! However I stayed in a single room, which was quite a decent size, considering most budget hotels in London are tiny! The room had everything as stated on the website: microwave, fridge, sink, private bathroom (although the shower had no curtain!), a tv (with about 40 channels!), air con, a cupboard, chair, mirrors, soap and shampoo, kettle with tea and coffee, cups and plates, hairdryer, an iron on request and best of all, free wifi! The service was also very good, with my bed being made everyday, room tidied and vaccumed and clean towels everyday. However the inside of the toilet bowl could have done with some cleaning....The man on reception was very helpful, he even let me print from the printer free of charge. Breakfast was nothing special, but sufficient! Eggs, toast, cereal, milk, orange juice, jam, tea and coffee. The location of the hotel was excellent, very close to shops, pubs and the underground. Although they told me Kensington Olympia was the closest train, it is an Overground train, and doesn't come as often. Shepherds Bush Underground is almost as close, and much more convenient as it is on the Central line with trains coming and going every few minutes, and will connect you to anywhere! The hotel is about 5-10 mins walk to Westfield London in one direction, and High Street Kensington in the other direction! In saying all of this, there were a few negative things, such as the annoying card to get into the room (instead of a key) that decided to stop working sometimes. It was annoying staying in the room with reception right above me as I heard everyone as they came in and out. Also the tv came on by itself every morning. Kind of a good wake up call, but some days I wanted to sleep a little past 7.30am.... Overall, the Kensington Suite Hotel was great value for money (I booked it on Rates to Go for 45 pounds per night). I had no major complaints, the free wifi was a definite bonus, and the location was excellent. If you are staying by yourself in London, it is a good little place to spend a few nights! After all, you're not really going to spend that much time in your room anyway with so much to do and see in London!", "Date": "July 24, 2009"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Location": "3", "Rooms": "1"}, "AuthorLocation": "Madrid", "Title": "“Of the bad ... the worst”", "Author": "Icepat", "ReviewID": "UR34741203", "Content": "The room we were given was in the basement of the building and was incredibly different from what it is shown in the hotel webpage. The walls were full of dampness and the bathroom had no shower pan, and the floor was not swept once during the two weeks we were there.Even so, the most serious complain we have about the hotel is the fact that they make misleading advertising on their website. Just as you enter the webpage, it states that \"The Kensington Suite Hotel offers wireless Internet Access (Wifi) throughout the hotel, free of charge to hotel guests\". However, when we tried to access their Wifi connection, we could not. When we asked the recepcionist about it, he told us we had to pay 5 pounds per day to use it, contrary to what the website offers (free of charge). He got very excited and literally said (shouted, in fact) that the Wifi was free when they opened the hotel, but now it was not, and that he could not be bothered with changing what it was on the website. Also, he told us we were not the first ones to complain about this, but he did not care and he did not allow us to make an official complaint in the hotel either. He ended the conversation with a \"Good luck if you intend to make a formal complain\". Thus, the staff was far from being nice with us. Our general experience was very negative and we would not recommend this hotel to anyone.", "Date": "July 14, 2009"}, {"Ratings": {"Service": "1", "Cleanliness": "4", "Overall": "1.0", "Value": "1", "Location": "3", "Rooms": "1"}, "AuthorLocation": "Luxembourg", "Title": "“NOT Suites by any imagination!”", "Author": "Cindi2", "ReviewID": "UR32317284", "Content": "I booked because their website stated this 3 star(!) hotel had spacious rooms, ALL of which had A/C, as well as kettle, toaster, fridge, microwave and minibar. In reality, the double ensuite I paid 80 GBP for had a double bed - period. The room was so small, I could not even lay flat or open a small carry-on piece of luggage. The A/C never worked - it was extremely hot, and incredibly noisy with the window open. There wasn't a wardrobe or table of any kind, much less refrigerator! I have no idea why they are called \"Suites\" - they don't come close. The breakfast room was too small and too crowded to waste my time for a piece of toast, so I didn't bother. It wasn't worth the money, and it was totally misrepresented on the website. It was clean and did have free internet. If they had honestly stated all you receive is a bed and offered a fair price, I would not feel so deceived. However, they didn't - so I would never consider staying here again. Don't waste your money.", "Date": "June 14, 2009"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Location": "1", "Rooms": "1"}, "AuthorLocation": "Galashiels", "Title": "“Don't go here.”", "Author": "ThegirliesGalashiels", "ReviewID": "UR26659318", "Content": "After having booked a triple and a twin room in this \"hotel\" on 22/08/08 we arrived on 13/03/2009 to be told that we could not have the rooms we booked. We were being offered 3 twin rooms instead - and not the same rooms for both our nights stay. When we asked why this was the cse when we booked so far in advance we received no reply and at no time did we even receive an apology. The man who was at reception said he could show us a room for three but in his words \"you won't like it\". How right he was. It was tiny and had a very bad smell. It was entered from outside the hotel and on the way to the room we passed a suitcase lying on the ground with a large hole burnt in it. He then showed us to the rooms we were allocated and they were not much better. The access to the rooms was via a very small lift and if there is a fire in this hotel I do not know how anyone would get out safely. He was extremeley unhelpful and RUDE. In the end we didn't even check in to this hotel and I would not receommend it to anyone.", "Date": "March 23, 2009"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Location": "3", "Rooms": "1"}, "AuthorLocation": "Leeds, United Kingdom", "Title": "“Worst Hotel I Have Ever Stayed In!”", "Author": "cathgWestYorks", "ReviewID": "UR26173463", "Content": "Myself and friend booked this hotel through Late rooms we booked 2 single rooms for a thursday night it cost £61 each . If we had paid £25 each it would have been too much. The only positive I can say about this hotel is that the reception area looks clean and tidy! Because the rest of the hotel isn't! One of the rooms had no, they had been pulled down from the pole! The bathroom was dirty. the room very small. I am sure that there is much better hotels in London than this one! I try not to be negative in my reviews because I appreciate that peoples opinions do vary but there was nothing positive to say about the rooms or the staff! I'm usually happy if the room is clean and tidy because I 'm never in there long! But this hotel is very poor!", "Date": "March 14, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "2.0", "Value": "3", "Location": "5", "Rooms": "2"}, "AuthorLocation": "Spain", "Title": "“Great Location but very basic”", "Author": "Irishgirlabroad", "ReviewID": "UR25107938", "Content": "Good location between Shepherds Bush and Kensington Olympia tube stations so ideal for anyone attending exhibtions at Olympia (7 minute walk). Check-in was smooth and staff were friendly. Room I stayed in was sold as a triple room however it would be impossible for 3 adults to stay in it with any degree of comfort. The room (I could not in all honesty describe it as a suite) was generally clean and warm (there were 2 central heating radiators plus an additional controllable heating unit) and additional 2 blankets were provided: In the \"kitchen\" it had a mini fridge, sink and electric kettle (with some teabags, coffee, mlk, sachets etc) however there were only plates and cups for 2 people. There were 2 flat screen tv's with numerous UK tv channels. There was a lack of seating space (except for the beds or the one small metal table and one metal chair provided) although this is not surprising as there is literally no where to put them ! The overall general maintenance was lacking any real care - in fact some aspects were positively dangerous particularly the bathroom (which was basically a sink, toilet and handheld shower). Anybody taller than 5ft 6\" would have a problem having a shower - without running the risk of electrocution if the water hit the electric light fitting immediately overhead. Also, no hairdryer supplied. There was only 3 hangers in the wardrobe (so one each !) The advertised wi-fi did not work (and in spite of booking site advising it as free in all locations of the hotel) ...I was advised that there was in fact a charge of 5 pounds per day for using it. Breakfast is basic, cereal, boiled eggs, toast etc..and only available from 07.30hrs-09.30hrs even at weekends but at least gives you something to get the day going. . It shoud also be noted that some of the rooms are located in the basement area of the hotel with direct access from street so quite noisy from the traffic at times as well as from other guests returning to the hotel at night. There is no alarm or safety deposit box available for valuables. The steps to/from hotel and external rooms are quite narrow and made of black marble so very slippy in the rain. Apart from cost value I would look for alternative accommodation if intending to stay more than one or two nights...and you just want a bed.", "Date": "February 24, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Business service (e.g., internet access)": "3", "Check in / front desk": "2", "Overall": "2.0", "Value": "3", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Cape Town Central, South Africa", "Title": "“Winter Specials”", "Author": "ChristelleC", "ReviewID": "UR24197420", "Content": "The staff are helpful and tried their best to sort the problems out, but uopn arrival, too many things did not work. The hairdryer, the fridge, not enough towels, room too hot, and the booking was queried. KSH had excellent winter rates, with a very conveniently situated bus stop.", "Date": "February 4, 2009"}, {"Ratings": {"Overall": "1.0"}, "AuthorLocation": "upper hunter NSW", "Title": "“Our worst in Europe”", "Author": "mwamark", "ReviewID": "UR18288198", "Content": "Having spent six weeks in Europe, mainly staying in 2 or 3 star hotels which were always up to expectations or, in Ireland in B and B's which were invariably excellent , our 3 night stay at the Kensington Suite Hotel , London was a major disappointment. Some of the faults I list below. 1. Our bedroom, located , we were to find, in the basement, had an unlockable window which gave a view of a messy yard. 2 Three beds were squeezed into a very small room 3.There was nowhere to put our luggage.or hang anything (although there was a microwave). 4 .The shower had a broken towel rack, with parts on the floor. 5. There was no bath mat, no toilet roll holder. 6. The bathroom sink had a wine bottle lid stuck inside its plug hole. . This could have been easily removed with long pointed pliers (which we were not, of course, carrying with us). As a result of the lid being there, the plug could not be used to fill the basin. 7. The heating was piped in ...and very hot. One heater was up against one of the beds. 8. The window, with a broken cord, had to be propped open. It also needed cleaning. We listed all these faults, some of which could have been easily fixed, and gave the list to reception when we left for the day after our first night there. When we came back that evening, nothing had been attended to, nor was anything done before we checked out. The breakfasts at the Kensington Suite were poor by comparison with Continental and Irish breakfasts. Only one cereal was offered. The milk to go with it was unrefrigerated. The only hot item available was a boiled egg . There was not enough seating in the dining area, for the number of peoply wanting to eat. Kensington Suite was , I repeat, a major disappointment", "Date": "July 26, 2008"}, {"Ratings": {"Overall": "1.0"}, "AuthorLocation": "West Yorkshire", "Title": "“The worst hotel experience I've ever encountered!”", "Author": "blackhalo", "ReviewID": "UR18030894", "Content": "I really feel that I must warn other potential visitors about the appalling way I was treated by this establishment. I had a room booked at the Kensington Suite Hotel (Formerly the Westfield Suite Hotel) for 3 nights, which I had chosen based on the fact that it had 3* facilities and what appeared to be cosy rooms that looked rather lovely for the price, and that it was in an ideal location which was quiet and fairly close to where I was working. Upon arrival at the hotel, I was greeted by a receptionist who took down my name and bank details, before informing me that I would not in fact be spending my first night at this hotel because there was a problem with my room. I asked reasonable questions such as where I would be sleeping, I was ignored and simply told \"another hotel. I call a cab now\"; was then sent across to Ascot Hotel in Paddington, where the cab driver had been instructed to hand an envelope to reception. I was left standing and waiting in reception for 20 minutes while the receptionist took a cig break and slowly dealt with a couple of people in front of me, and I was finally dealt with only to be informed that I'd been sent to the wrong hotel (before he resorted to having a good laugh about it with his colleague as if some sort of inside joke! Incredibly rude!) By now I was starting to feel rather wound up, as it was actually beginning to seem as though this was no more than an elaborate scam to take my money with no intention of providing a place to stay. So I was handed the envelope back and told I had to walk a few hundred yards down the road to another hotel, which was far from the 3* quality I was expecting during my stay, but perhaps a 1* - a cold family room that reminded me more of a bed-sit than any hotel I’ve ever stayed in! I called up the hotel to complain, and felt as though I was being spoken down to; basically the receptionist made this out to be no big deal, informing me that “It’s only for one night”. In the end I decided that this was too much of an inconvenience for me, as this also meant that I would have to cart my luggage across London during rush hour trying to switch locations in time to get over to work for 9AM, and I managed to make alternative arrangements. I was promised a refund that night, which three days later I am still waiting on. I have no clue what the rooms in the hotel were like, but the level of customer service I received was shocking and I can only imagine how bad they treat guests when they actually stay at the hotel!", "Date": "July 19, 2008"}, {"Ratings": {"Service": "2", "Cleanliness": "2", "Business service (e.g., internet access)": "2", "Check in / front desk": "3", "Overall": "1.0", "Value": "1", "Rooms": "1", "Location": "3"}, "AuthorLocation": "Telford", "Title": "“Tiny!”", "Author": "Tooley1988", "ReviewID": "UR13059851", "Content": "THE ROOM- was really tiny they put 3 beds in our room & if three people did sleep in the room it would of been very wrong because all the beds where next to each other. bathroom was really small you couldnt move around it at all & the shower was just about big enough to do a 360 in it. the whole time i was there they did not change my bed & did not take the rubbish out the room when i left in by the window. BREAKFAST- The breakfast was rubbish we asked for a full english the first day we was there & full english is defo not what you would call it. they gave us one sasuage & 1 bacon & the bacon was cold & sasuage was cheap. they gave us a handful of beans & a egg and all that took 25mins to come to us. the tables where rubbish because the chairs would not go under the table so you would have to have your legs to the side to sit down. THE HOTEL- the hotel if you could call it that, its just two old victorian house knocked into two & put as many rooms in as possible. It looked really nice when you walked in but if it was raining at any point then you would slip on the stairs going into the place as they were mable steps. THE STAFF- One of the staff oldish kinda man was really poilte but the rest did not talk one bit to you. Would i tell people to stop there.... no i wouldn't!", "Date": "January 28, 2008"}, {"Ratings": {"Cleanliness": "3", "Business service (e.g., internet access)": "3", "Check in / front desk": "3", "Overall": "3.0", "Value": "4", "Rooms": "2", "Location": "4"}, "AuthorLocation": "Berlin, Germany", "Title": "“good value for money”", "Author": "trippieBerlin", "ReviewID": "UR12718308", "Content": "Rooms are tiny but clean and functional and mine had a new bathroom. I booked last minute so was offered a very good deal(£30). Breakfast is not worth mentioning: Eat out! Loction is very good. Compared to other hotels I have stayed in London this was a real bargain and cleaner than most in that price range. You can´t hang out in the room(no space), but if you just need a place to sleep and a good shower for little money this is worth considering.", "Date": "January 17, 2008"}], "HotelInfo": {"Name": "Kensington Suite Hotel", "HotelURL": "/ShowUserReviews-g186338-d736380-Reviews-Kensington_Suite_Hotel-London_England.html", "Price": "$103 - $475*", "Address": "<address> <span rel=\"v:address\"> <span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">128 Holland Road</span>, <span class=\"locality\"><span property=\"v:locality\">London</span> <span property=\"v:postal-code\">W14 8BD</span></span>, <span class=\"country-name\" property=\"v:country-name\">England</span> </span> </span> </address>", "HotelID": "2514320", "ImgURL": "http://media-cdn.tripadvisor.com/media/ProviderThumbnails/dirs/37/5f/375f95eaeb2de7dbd4f3427dc27eff585large.jpg"}}