{"Reviews": [{"Ratings": {"Service": "3", "Cleanliness": "2", "Overall": "3.0", "Value": "2", "Sleep Quality": "1", "Rooms": "2", "Location": "4"}, "AuthorLocation": "Wheaton, Illinois", "Title": "“Not worth the price”", "Author": "Chivo1962", "ReviewID": "UR127250460", "Content": "The hotel lobby was very small to accommodate all the people checking in, the rooms were noisy and the beds need replacement. The breakfast Buffett was composed of canned fruit that tasted horribly, powder eggs worst than the ones in the army, old cereal, etc. Bathroom ran out of hot water, carpets were not clean and the halls were small. I felt for the price over $120.00 a night they owed me better than this kind of service. The only vonvenience is that is close to U of I other than that I do not find a difference with a motel for $65.00 a night. I will not stay here again.", "Date": "April 4, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Tennessee", "Title": "“Nice comfortable hotel, Close to the University & busy train tracks”", "Author": "TinySwimmer", "ReviewID": "UR126972435", "Content": "I was here for a business meeting at the U. of Illinois. The hotel was less than a quarter of a mile from my meeting on campus, making it easy to walk and not have to deal with university parking. The suite was very comfortable, the Internet worked very well, and the free breakfast and dinner buffet was typical Homewood. The staff was efficient and helpful. My only complaint is that this hotel in across the street from a busy railroad track with several noisy trains that woke me during the night. To avoid the noise, stay at the Hilton Garden Inn next door, and get a room on the west side of the building.", "Date": "March 30, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Springfield, Illinois", "Title": "“great place to stay!”", "Author": "teri h", "ReviewID": "UR125359066", "Content": "Stayed here with 4 girls while we were in town for a concert at the Assembly Hall. The service was exceptional! Very friendly staff. We were able to check in early upon request. Suites were very nice. Beds comfortable. Kids loved pool/spa area. They have a great outdoor patio area with fireplace and grills as well as a basketball court....only 5 minute walk to Assembly Hall...", "Date": "February 28, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "5", "Location": "3"}, "AuthorLocation": "Pekin, IL", "Title": "“Always pleased with our stays here.”", "Author": "fballwidow", "ReviewID": "UR124642049", "Content": "We love the feeling of coming home at this location as we've stayed over the Valentine's weekend for the past 3-4 years. The hotel is a great value if you factor in the size of the suites, the quality of the finishes, and the breakfast. We've never stayed during the week, but they offer light meals which are posted on the refrigerator in the room. Rooms have granite countertops, dishwashers, microwaves and all the utensils you need. We were able to check in early when we arrived, and we appreciate the noon checkout, as it seems more and more that 11 is the checkout time. Breakfast always has at least 3 hot items, and the staff make it feel more like a restaurant than a cheap continental breakfast hotel. Very impressed with the pool and whirlpool. The location is bit strange as it's kind of tucked in to the parking lot of the much larger Hilton Garden Inn. But it's OK, it seems to be the less busy, more intimate place.", "Date": "February 15, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Raleigh, NC", "Title": "“Good place to stay for a few days”", "Author": "Turlough705", "ReviewID": "UR122331666", "Content": "We always stay here when traveling to Champaign. The rooms are great (full fridge, working stove). Friendly staff. We love the sauna and pool (always pretty empty). They also have free dinners during the week (but we never ate these since we are vegetarians).", "Date": "December 31, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Streator, Illinois", "Title": "“First Class”", "Author": "RR146", "ReviewID": "UR122188193", "Content": "I often frequent the Champaign area for business. I always look forward to staying at the Homewood. Donna and her friendly staff really go out of their way to make me feel at home. Everything from the rooms to the pool is first class. The Champaign Homewood definitely sets the bar for quality and service!", "Date": "December 28, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Creve Coeur, Missouri", "Title": "“Nicer than expected & a great deal.”", "Author": "Bucklebear", "ReviewID": "UR122145713", "Content": "Holiday time is packed for my family located in Champaign, so this year my husband, daughter, and I opted to stay in a hotel to free up some room for other travelers. Our eight-year-old enjoys a hotel pool immensely. It's like giving her an extra Christmas gift. The room is very clean. The king bed is comfortable, the bathroom spotless, and there is a full kitchen with full sized fridge, microwave, cooktop, dishwasher, and sink. The fold-out couch was a perfect spot for our daughter. The free breakfast is very good quality. It's a large variety of good food. Lots of fresh fruit and healthy options as well as eggs and sausage and a waffle bar. Good coffee. No Truvia, but there is Splenda - a key consideration when I travel. I hate having to supply and carry around my own sweeteners. The staff is very friendly. I had no trouble securing a later check out, and maintenance was very responsive when I requested extra towels. The pool area is well maintained and attractive. The only drawbacks are very minor ones. They are not, in my opinion, enough of a big deal to detract from my 5 rating. The wifi is much slower in the rooms than in the lobby. When you're working from your hotel room, this is a consideration. The second minor drawback is the amount of chlorine this pool uses. Our visit may have corresponded with freshly shocking the pool, but the smell of chlorine was a bit strong. I bought a pre-paid deal through Homewood Suites website and got the room for $78 a night. I felt this was an excellent value for the quality of the room, the convenience to my family's homes, and the quality of the breakfast. I will most definitely stay here again for busy family gatherings.", "Date": "December 27, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Lisle, Illinois", "Title": "“Gathering place”", "Author": "Gary K", "ReviewID": "UR122142600", "Content": "We've stayed here over the holidays as a central locale for the family get-together for several years now. The hotel and the staff are perfect. They are accommodating, friendly and helpful. They will work with us to make sure that it all goes smoothly. Rooms are great. Clean, spacious.We'll be back.", "Date": "December 27, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "", "Title": "“Home away from home.”", "Author": "JJ2986", "ReviewID": "UR122119028", "Content": "I spend about 8 weeks a year at the Homewood. It's clean, comfortable and nice. If I have an issue that needs attention, the staff is very accomadating. Donna Wickersham has a courteous and dedicated staff. After a long day at work, it's nice to come \"home\" to something familiar.", "Date": "December 26, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Woodstock, IL", "Title": "“Outstanding!!!!”", "Author": "DeAngelo C", "ReviewID": "UR121962723", "Content": "I have stayed there numerous times over the last 2 years and have not had a better experience at any other hotel! The staff is 2nd to none, from the top down. Everyone is very friendly, warm and helpful, they go out of their way to make you feel at home! That is a true testiment to the Management especially Donna Wickersham!! the accomodations are spotless and very comfortable, the meals are always very good with a nice variety. I will only stay at the Homewood when I'm in Champaign! 12 out 10 on a 10 scale!", "Date": "December 21, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Champaign, Illinois", "Title": "“EXCELLENT --- EVERYTHING!!”", "Author": "GrammyA", "ReviewID": "UR121553235", "Content": "After researching several properties in the Champaign area we chose to make our 3 to 6 month extended stay at the Homewood Suites. The hotel itself offers everything you would expect of a high-level Hilton.... but the staff is the real bonus. From housekeeping to the GM - they treat you like family and make sure that everyday you are with them your needs and expectations are met. BEFORE making a decision based on other reviews be sure to check out the dates of those comments.... the negative ones certainly do not apply at this outstanding property! Great location, super clean property, great hot breakfasts daily, super dinners FREE Monday thru Thursday, heated pool & hot tub, fitness room, high speed Internet..... you name it... they provide it. Our current temp home here has been a wonderful experience and you will not be disappointed if you choose this hotel for your option for 1 day or as many as you need!", "Date": "December 9, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Illinois", "Title": "“Super clean, comfy, great stay!”", "Author": "Ixplore2", "ReviewID": "UR120530576", "Content": "I stayed here on a shopping trip with my mom and her friend. The room was perfect for us because we could sit and talk in the common room. We could have all used the bedroom, but my mom's friend slept in the common room on the couch. The room was extremely clean and the breakfast was tasty. The staff was very friendly. I highly recommend!!!", "Date": "November 13, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "4.0", "Value": "3", "Service": "4"}, "AuthorLocation": "Pittsburgh, Pennsylvania", "Title": "“Nice hotel, close to campus and downtown”", "Author": "bk_t1", "ReviewID": "UR117326592", "Content": "There was an event happening at iHotel, but I chose Homewood Suites because I'm a Diamond HHonors member. The property and room was very nice for Homewood standards, housekeeping was good, and the breakfast service was also surprisingly good and the area kept clean. Free parking (some lot sharing with the HGI next door) and free wifi. Also, a Walgreens across the street. I recommend and if I were in the area again, I'd stay here.", "Date": "August 27, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Little Rock, Arkansas", "Title": "“Very nice, Recommend 100%”", "Author": "sheasley84", "ReviewID": "UR116566494", "Content": "I had to stay here for a friends wedding so I wasn't really expecting much in the way of a hotel but I have to say I was blown away at how nice this place was. Their breakfast buffet was very good and free. The room was very spacious and comfortable. There were many restaurants within a 10 walking distance from the hotel which was very nice. The best part about the room was things were very quiet throughout the hotel so we weren't bothered by any noise. If you're planning on making a trip to Champaign, definitely keep this place high on your list you won't regret it.", "Date": "August 11, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "4", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Wisconsin", "Title": "“Great stay! Close to the University.”", "Author": "Lislcat", "ReviewID": "UR116526683", "Content": "My husband told me to review this for him. He stayed at this hotel for 2 nights for business. His business meetings were at the University, so this was a perfect location. He loved the dinner and drinks included with the price of the room. He also had a free breakfast. His room was clean and he had plenty of room. His bed was comfortable. He said that he will definitely be staying there again. Plus, we were able to get HHonors points.", "Date": "August 10, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Knoxville, Tennessee", "Title": "“A wonderful hotel for a stay around our son's wedding.”", "Author": "worldtravelinggrandm", "ReviewID": "UR116320156", "Content": "We made this hotel our home away from home for six days around our son's wedding. It was absolutely wonderful. Several of our family were also here, and I was so glad I had suggested this hotel for their stay. We especially appreciated the staff, who went out of their way to make us comfortable and welcome. The breakfasts and evening receptions were really good, and so convenient while we were so busy. Having books and videos available for our little grand daughter to borrow was a real plus, and the staff were so nice to her. The facilities were always clean and well cared for. The staff was exceptional.", "Date": "August 5, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Chicago", "Title": "“I. Can't. Believe.... how great this place is.”", "Author": "Freal", "ReviewID": "UR115923907", "Content": "So, I was visiting Champaign for a friends wedding. They had rooms blocked at this hotel and at the I-Hotel. I opted for this one because it had continental breakfast and I'm so glad I did...and for more reasons than just the breakfast! First off, the lobby is nice and clean and the frontdesk staff greeted me the second I walked in the door. My check in was quick and efficient. This might not seem like a big deal, but I've stayed at plenty of hotels where it seems you are the first person to have EVER checked-in because it takes them so long. People checking in at hotels are usually weary travelers who do not want to wait forever to get into their room, so I really appreciated that. Second, the room was incredibly spacious and very clean (as were all common areas). There is a kitchenette which was nice because we could keep leftovers AND a microwave to reheat! Heaven! Third, there is a Gumby's pizza next door, 'nuff said Fourth, and this is the real humdinger, the breakfast was NOT what I consider a continental breakfast. It was a delicious hot meal AND they changed the offering (new selection) the second day of our stay! They had scrambled eggs with chives & cheese with sausage patties on the first day (Sat) and scrambled eggs with bacon on the next. Furthermore, they have all kinds of other treats; boxed cereal, yogurt, oatmeal, cream of wheat, pastries, a large selection of teas (Tazo brand at that), and fresh fruit salad. Last, I just want to mention a couple of the extras that really sealed the deal for me. They have free wi-fi, neutrogena hygiene products, and you can go down to the front desk and pick a DVD from their selection (not huge, but with recent releases and truly something for everyone) that you can take to your room to view....ALL FREE. Plus, I saw a sign in the elevator that said \"Join us in the lobby for complimentary dinner and drinks M-Th\". Now it's getting almost comical. Now I've stayed at some very nice hotels, so it isn't like one of the Clampett's is at the helm right now. I've seen the luxuries and footed the bill and I have to say that I was easily just as comfortable here. Besides, I still find it mind boggling that fancy hotels always charge for internet. What's with that?!?!? Dear Homewood Suites of Champaign, Good work.", "Date": "July 28, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "IL", "Title": "“Lovely Hotel”", "Author": "Patti0", "ReviewID": "UR115912190", "Content": "We stayed at the Homewood Suites in Champaign last weekend. What a lovely surprise! We attended an outdoor wedding that day and were so relieved to get back to our beautiful, cool hotel room. The decor was lovely, bed clean and comfy and the free breakfast the next morning was very nice. Would highly recommend this hotel and plan on staying here the next time I'm in town, whether for business or pleasure.", "Date": "July 28, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "4.0", "Value": "4", "Service": "4"}, "AuthorLocation": "San Jose, California", "Title": "“Spacious suite for the price”", "Author": "DavidLau", "ReviewID": "UR111194786", "Content": "What you get is a living room area, small kitchen - with pot/pan/dishes/utensils, bed area. Mid-range decor. Just shower, not bathtub. Free wifi. There's a design flaw - whenever the shower door is opened (opens outward), it drips alot of water onto the bathroom floor after you have taken a shower. Free hot breakfast everyday (not particularly exciting food choices) & FREE DINNER during week-nights (I didn't get a chance to try this). There's a small gym room & pool on the first floor. There's a tiny convenience \"store\" next to registration desk where you can buy sundries as well as frozen food. There's also free DVDs you can borrow for the DVD player in your room. There's a fully stocked computer room across from registration. Two computers - each with a printer. Also a fax/copy machine. All free.", "Date": "June 2, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "4.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Chicago USA", "Title": "“Loved this hotel. been there before and will return.”", "Author": "GataFeliz", "ReviewID": "UR111027435", "Content": "stayed here last may and again this year for university conference. best service almost like the Ritz and yes ive stayed at these overpriced hotels as well. instant service, free fax, very courteous, great breakfast and nice light dinners, fresh fruit and salads are fresh thank you, not wilted. was quiet and clean, can open windows, free wireless, spacious rooms and Neutrogena products. cab service is quick, about 1.5 mi from train and university and city buses close by. walgreens next door by and also cute coffee shop. best of all is little kitchen!! also bed mattresses are wrapped in protective covering so no dust mites or bed bug issues- im in public health and this place is hygienic.", "Date": "June 1, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Dallas, Texas", "Title": "“Perfect hotel for UIUC college visit”", "Author": "TXwonderer", "ReviewID": "UR92238486", "Content": "We stayed at the Homewood Suite one night for the UIUC college visit. The hotel exceeded our expectation. The room is big with a living area and kitchen. The complimentary dinner (Monday - Thursday) and breakfast choices are good. It is a bit far from the highway but the university campus is right across the street.", "Date": "January 8, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "3", "Sleep Quality": "3", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Springfield, IL", "Title": "“Close to U of I Campus”", "Author": "RiverRunneth", "ReviewID": "UR89832103", "Content": "Nice property within walking distance to the University of Illinois at Champaign. Nice room, nice lobby area, outdoor patio and basketball. Biggest disappointment was that the pool was shut down and no on ever told us until we got there and then offered no other options. coupons or discounts. This is the main reason we stayed here. Kids disappointed. Room was expensive. Breakfast was busy and severally lacking and hot water was hard to come by. Otherwise, everything was above board and what you wojld expect from a Hilton property.", "Date": "December 14, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "orlando", "Title": "“Good value for your Money”", "Author": "EmEs", "ReviewID": "UR75424492", "Content": "I stayed at the Homewood Suites for a week end and thought it was a great value. The room/suite was large with a fully equipped, small kitchen. Granite counter tops in the kitchen and the bath are a nice addition. Breakfast daily and dinner Monday - Thursday are thrown in with the reasonable room price. THe hotel is also at the edge of the U of I campus and close to the football stadium. There is an indoor pool as well as BBQ grills outside, next to the basketball court. Good value, for sure!", "Date": "August 16, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Location": "3", "Rooms": "5"}, "AuthorLocation": "Indianapolis, Indiana", "Title": "“Near campus but several miles off the...”", "Author": "wmhendrix", "ReviewID": "UR70931889", "Content": "Near campus but several miles off the interstate. Attached to the convention center and Hilton Garden Inn. Lots of good restaurants within one mile radius.", "Date": "July 14, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "3"}, "AuthorLocation": "Atlanta, Georgia", "Title": "“Rockin' Air Conditioner”", "Author": "PaintTheCity", "ReviewID": "UR70553745", "Content": "Homewood Suites has become my favorite hotel chain - consistently I'm happy with my stay. This hotel is a bit off the main highway, but not too far - the a/c was incredible, the bed, the shower were fabulous. A great night's sleep. A neighbor restaurant delivered dinner in 15 minutes to my room - loved that. Well kept up, perfect for a comfy stay.", "Date": "July 11, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "3", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Mumbai", "Title": "“Very comfortable hotel”", "Author": "Srikg", "ReviewID": "UR69168941", "Content": "Stayed there for a week on business. Very good rooms and service.", "Date": "June 30, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Texas", "Title": "“Outstanding Hotel”", "Author": "TravelinManTexas", "ReviewID": "UR68138468", "Content": "This is the second time that I have stayed at this hotel. I have stayed at a lot of hotels over the years and I think that this is one of the nicest hotels that I have ever stayed at. The hotel looks new. The room is huge. Everything in the room is top notch. Even the bathroom looks great. I stayed here because it is close to where my father lives and I loved the last time that I stayed there. I payed $119 for Saturday, June 19th for room 309. Also, it is nice to walk into a hotel room late at night and there is a note that there is a bottled of water in the refrigerator. Other hotels leave a bottled of water in the room but you either have to pay for it or it is room temperature. The hotel is next door to the Hilton Garden Inn.", "Date": "June 21, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Henderson, Nevada", "Title": "“Excellent hotel - close to campus”", "Author": "SharonB2", "ReviewID": "UR65124822", "Content": "My husband and I stayed here during commencement weekend at the University of Illinois. The room was clean and spacious, the towels soft and fluffy, and the bed very comfortable. We had a king suite and could not have been more pleased. The breakfast area was busy but there was ample seating and plenty of food. Parking was great and the staff very friendly. We will stay here when in town again. The location is excellent! The free Internet access was a great perk.", "Date": "May 24, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Location": "4", "Rooms": "5"}, "AuthorLocation": "IL", "Title": "“Beautiful Room and Excellent Hospitality”", "Author": "Meridian_k", "ReviewID": "UR40065619", "Content": "I recently held a staycation/sleepover for my daughter's 13th birthday party. The room was spacious and inviting. It had all the amenities we needed. The front desk and house keeping staff were responsive and courteous. It was truly excellent hospitality! My daughter and I stayed in this hotel in 2007 and had an awful stay. However this stay was perfect!", "Date": "September 7, 2009"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "Franklin Park, IL", "Title": "“Pearl in the country!”", "Author": "BlueIrishEyes", "ReviewID": "UR37128342", "Content": "I was expecting a cramped room, given the many features that the description of a studio king had, and was I wrong! I was totally wowed by the spacious room, full kitchen, immaculate, assorted selection of popcorn, coffee and good shampoo, two different sized bars of hand soap for the wonderful separated bath vanity. I love showers and this room had a spacious one, with high overhead showerhead, giving me even more room. The business center was fully stocked, and the comp breakfast substantial. I have stayed in this area before, but never at Homewood. it is by far the pearl in the sea of hotels. I'll never stray from here when booking again!", "Date": "August 9, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "5.0", "Value": "4", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Chicago", "Title": "“Great home base”", "Author": "Packs-alot-9", "ReviewID": "UR34627679", "Content": "This hotel exceeded our expectations. We had a two-room king suite. My favorite undocumented features were the overhead light and ceiling fan in the bedroom, the separate thermostats for the bedroom vs. the living room, the tall shower head, the light in the shower, and conveniently located electrical outlets that can be used for ironing (in the bedroom and also in the room's foyer ). These people didn't miss a trick! The water pressure and temperature in the shower were good. The staff was very friendly and helpful. The wired and wireless Internet were both great. My husband played a game over the wired connection, and I was easily able to surf over the wireless connection. You can also send a print job from your room and enter a code when you reach the business center to start your print job (I didn't test this, but instructions were in the room). One thing that surprised me was that the vanity was in a good-sized nook next to the closet and not inside the private area of the bathroom. Some light from the vanity area does spill into the bedroom. This isn't ideal if two people are keeping different hours. However, it's a good arrangement when two people are trying to get ready at the same time.", "Date": "July 13, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "San Diego", "Title": "“Home Away From Home!”", "Author": "delledge", "ReviewID": "UR32993096", "Content": "WOW! This is a great hotel. Several items are critical to me: comfortable beds & pillows, clean rooms, nice & knowledgeable staff. They exceeded in each of these areas, and more. Location: On the edge of campus. About a mile or so from the cute, revitalized downtown of Champaign. Within walking distance of a yummy frozen custard shop, next door to a 24-hour Walgreens. Rooms: Spacious. Includes full-sized fridge, microwave, stovetop, sink...wonderful. Climate control is easy to maneuver. Room temp always perfect. Windows could open a few inches to get fresh air. Bathroom: Great shower! Neutrogena products. Complimentary Breakfast: assorted hot and cold items. Definitely better than average. Nice-sized dining room with different-sized tables. Several TVs w/news or cartoons:-) I wish I didn't have any negatives to report, but I do have 2 things: 1) Custodial services for public areas did not keep up with hallways. I always saw dishes, plates, glasses along guest floor hallways...the same dishes, etc for hours and hours. Trash cans outside and in the breakfast area did not get emptied often enough. 2) Parking was a challenge. This hotel is next door to the Hilton Garden Inn and Conference Center. That property hosted several wedding receptions during our stay, making parking very difficult in the evenings. I will definitely return to this hotel again. I rarely find myself so comfortable at a hotel, and this one was fantastic. And, I can't close my review without complimenting the friendly staff: front desk, breakfast staff, housekeeping. All were wonderful.", "Date": "June 23, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Odenton, Maryland", "Title": "“Oh...Home Sweet Homewood!”", "Author": "Toowordy", "ReviewID": "UR32502618", "Content": "Homewoods are our favorite and we finally got to one on Day 13 of a cross-country road trip. We're a family of 4 on a military move from Alaska to Florida. Our military rate was $109 before taxes, and it once again felt criminally low for what you get here. The hotel's location isn't very convenient to the Interstate if you're just passing through, but it's practically on the UofI campus and it's very close to downtown. There are plenty of nearby eateries, but it's a Homewood, so you don't really need them! We stayed on a Monday night and it was chicken fajitas. They were delicious and the kids gobbled them up. There was desert, salad, rice, a taco bar, and of course free beer and wine. This location didn't ration the booze and was self service. Breakfast was also great with hot and cold selections, great coffee service, and all kinds of baked goods. The pool and hot tub were spacious, clean, and nice and included a shower area. The kids were loud but no one could hear it outside the pool area. The fitness center was big enough for 5+ people to use simultaneously. The business center has 2 computers with printers. Our room, a one bedroom, was great. The king bed was comfortable with nice sheets and covers. The pillows were soft and numerous. The TVs were nice LG flat panels with good cable and no \"hotel menu\" stuff. You can rent new DVDs at the front desk or there are a bunch you can borrow from the business center. The bathroom (which is in the bedroom side of the suite) was standard Homewood (very nice) as was the kitchen. The door between the bedroom and living room was heavy and made both sides feel private. This hotel in a college town was hosting some summer seminar classes as well as a fire fighter's training session. For how young and fun the clientele looked, it was an extremely quiet evening. The hallways are quiet and the rooms are quiet. I really wish we weren't in such a hurry through town. I give Homewood Champaign my highest recommendation! If you haven't ever stayed at a Homewood, start here!", "Date": "June 17, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Chicago, Illinois", "Title": "“Everything about our stay was wonderful.”", "Author": "TripsAndTreks", "ReviewID": "UR31228654", "Content": "We stayed at The Champaign-Urbana Homewood Suites during Graduation weekend. Despite the fact that the hotel was full, we had every kindness extended to us. The hotel was very clean. The morning breakfasts were very busy, but staff was continually replenishing the buffet and we never had trouble finding seating, even though we had a lot of family staying there. My son was commissioned into the Navy that same weekend, so we had a big group. Two of our rooms were adjoining, and this was perfect for gathering in between the scheduled ceremonies and events. We were so busy, but my mother-in-law liked to sit in the beautiful lobby and read during her downtime, my sister and nephew liked the pool, and many used the business center to stay connected to their email and fantasy sports teams! Both my sister and I left clothes in our rooms by mistake when we checked out, and the hotel staff was super-helpful in getting our belongings back to us. If I am ever in Champaign again, I will definitely stay here! Thank you Amanda, Melinda, Kiya, Rahsima, and everyone at the Homewood Suites in Champaign!", "Date": "May 31, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Brooklyn, NY", "Title": "“It's wonderful!”", "Author": "megan73", "ReviewID": "UR29055393", "Content": "I really enjoyed my stay here. The rooms are fantastic. Breakfast AND dinner. The gym is great. Staff is very friendly.", "Date": "April 29, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "3", "Business service (e.g., internet access)": "5", "Check in / front desk": "4", "Overall": "5.0", "Value": "5", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Champaign, Illinois", "Title": "“It's the little things that make all the difference ...”", "Author": "Mandy_Beth", "ReviewID": "UR23835568", "Content": "My husband's colleague recommended the hotel, since I was tagging along with him for meetings that we knew would take 2 - 3 weeks. What a value! The price we're paying includes really good internet, breakfast and (Monday-Thursday) dinner WITH wine and beer. Granted, we've chosen to eat out some, but, if money were tight, you could really stretch your dollar here. Beyond that though, the service has been wonderful ... housekeeping even figured out what time I work out and made a point to clean our room in that half hour, so as to not inconvenience me. Really above and beyond!", "Date": "January 23, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Central IL", "Title": "“The best hotel in the aea!”", "Author": "sms1045", "ReviewID": "UR17975498", "Content": "I have to say that I have stayed in alot of hotels in Champaign and this one beats them all! They offer free \"light\" dinner Monday-Thursday. It is not a \"light\" dinner...it is a full meal! They have salad, a vegetable, a starch, and a main course. They even have rolls and desert! Beer and wine are free as well. Every morning you get a great breakfast with service that can't be beat! When I need a place to stay in Champaign they will be the first one I will call!", "Date": "July 17, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "3", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Savannah", "Title": "“Wonderful staff”", "Author": "GritsSavannah", "ReviewID": "UR17698061", "Content": "We stayed there over the Memorial Day week and the hotel was always a welcoming respite to the busy days. The breakfast got us off to a good start each morning and it was lovely to end the day with a good dinner and glass of wine each evening. (all complimentary of course). This hotel is really a good value for the money and all of the amenities were clean and well taken care of. Our room was spruced up each day (they must have been majic about knowing when we were out). We never saw them but the suite was always clean. Audrey in the kitchen was an absolute phenomenon. She catered to whatever need you had at the moment and was always willing to go out of her way to insure your meal was great.", "Date": "July 9, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "4", "Overall": "5.0", "Value": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Dallas, Texas", "Title": "“Great New Hotel!!! Lots of Room, Very Clean!”", "Author": "cvhdvd", "ReviewID": "UR12322482", "Content": "The Homewood Suites Champaign was great. We stopped overnight with three kids on our drive from Texas to Michigan and the hotel was easily accessible from I-57. Upon check in, which was a reward stay, I asked if the store had milk for my youngest daughter’s bottle. The front desk staff told us not to buy any and went back to the kitchen and brought us up a pint of milk on the house. When we got up to the room it was clean, new, and spacious. The hotel was built in April of 07. The king bed was very comfortable and the couch had a pullout bed for my boys. Fully equipped kitchen complete with a dishwasher. The hotel was quite empty the night we stayed, it was very quiet. The hotel sits on the main street, lots of restaurants; we went to dinner at Fridays about a block down the road. Both TV'S in the room were flat screen and 37 inches. The indoor pool was great for the kids after a day of driving; however the hot tub does not have bubbles, how strange. Breakfast the next morning was great, with eggs, burritos, sausage, and all the fixings. This summer we will defiantly stay again! A+++", "Date": "January 4, 2008"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Business service (e.g., internet access)": "1", "Check in / front desk": "1", "Overall": "1.0", "Value": "1", "Rooms": "1", "Location": "2"}, "AuthorLocation": "Chicago", "Title": "“Management is a Nightmare & Homewood Suites Is Dirty!!”", "Author": "pharmd01", "ReviewID": "UR10916713", "Content": "This hotel has a horrible management team. I checked out after a 4 day stay, they CHARGED my account for an EXTRA DAY. I called up immediately to let them know this, and OBVIOUSLY TO BE CREDITED BACK THIS CHARGE. However, one of the two rude mangagers, RENE, stated that she could not credited me back until she did an investigation!! There was nothing to investigate --I WAS OVER CHARGED!! They continued to ignore my calls so I had to call Hilton Headquarters and file a complaint against this hotel. I would advise anyone to check their bills when leaving this unethical establishment because they have a tendancy of overcharging, and eventually you will have to call headquarters to get your money back--which takes up to 5 weeks!! Oh also, if you do stay here, bring some cleaning supplies and clean towels because the rooms are very dirty and the towels do not always get changed!", "Date": "November 19, 2007"}, {"Ratings": {"Service": "2", "Cleanliness": "4", "Business service (e.g., internet access)": "4", "Check in / front desk": "2", "Overall": "3.0", "Value": "2", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Glenview, Illinois", "Title": "“Nice place, but service needs some fine tuning.”", "Author": "Sleepyhead52", "ReviewID": "UR8281432", "Content": "Came to Champaign for a college visit. The physical plant was basically fine in the rooms and lobby. The whirlpool spa, we were told, \"doesn't have bubbles\", by the maintenance man. Just a giant bathtub, I guess. Bed was very comfy, with pillowtop comforter. Service orientation in general, however, really needs some attention. When we arrived just after midnight, the desk clerk seemed annoyed at our arrival and was perfunctory at best in checking us in, spewing out pool and breakfast times by rote, making no eye contact, not asking if we needed help, etc. We went to the complimentary breakfast service 45 minutes before the scheduled closing, and there was no coffee, hot water, pastry, orange juice, or bacon. After finally getting a clerk's attention, they managed to bring out some coffee and water, but nothing else, despite specific requests. The attitude of the maintenance guy above was on the same level. I guess I would hope that a new hotel like this would be eager to please and make that clear to their employees, but such is not the case, at least not yet.", "Date": "August 2, 2007"}], "HotelInfo": {"Name": "Homewood Suites by Hilton Champaign-Urbana", "HotelURL": "/ShowUserReviews-g35790-d632535-Reviews-Homewood_Suites_by_Hilton_Champaign_Urbana-Champaign_Illinois.html", "Price": "$132 - $159*", "Address": "<address> <span rel=\"v:address\"> <span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">1417 South Neil Street</span>, <span class=\"locality\"><span property=\"v:locality\">Champaign</span>, <span property=\"v:region\">IL</span> <span property=\"v:postal-code\">61820</span></span> </span> </span> </address>", "HotelID": "2514999", "ImgURL": "http://media-cdn.tripadvisor.com/media/ProviderThumbnails/dirs/6d/6e/6d6ea5b55420703bd5ec71b2e2ceb87a5large.jpg"}}