{"Reviews": [{"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "2.0", "Value": "1", "Sleep Quality": "3", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Portland, Oregon", "Title": "“2 stars says enough!”", "Author": "Kevin C", "ReviewID": "UR122985779", "Content": "The hotel was nice and the employees were for the most part friendly. The reason for the 2 stars was the fact that for 4 people to have a small breakfast we paid $178.00. This was Ridiculous!!!! $11.00 for a small glass of orange juice... I had oatmeal and orange juice, and nobody in my party had anything more extravegant than that. NOW I know why they don't put prices in there breakfast menu. A piece of advice, DON'T eat at this hotel, go to a local cafe or something.", "Date": "January 12, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "athens", "Title": "“INCREDIBLE, UNFORGETABLE, PLENTY OF LUXURY STAY”", "Author": "thambelina", "ReviewID": "UR41859061", "Content": "This was a trip to remember not only because it was my honeymoon but because we could'nt have found any better hotel for it. The spot was ideal, only 5 min.from 5th avenue by walking not to mention the breathtaking view over the park.", "Date": "September 15, 2009"}, {"Ratings": {"Service": "2", "Cleanliness": "2", "Business service (e.g., internet access)": "3", "Check in / front desk": "2", "Overall": "1.0", "Value": "1", "Rooms": "2", "Location": "5"}, "AuthorLocation": "Boca Raton, Florida", "Title": "“Tired, Overpriced and OLD Hotel - Avoid at all costs.”", "Author": "BMIGamingDotCom", "ReviewID": "UR6104447", "Content": "Given room as compensation for a speaking engagement in NYC for two nights, so I did not even pay for the room... That said, this is definitely one of the worst \"high end\" hotels in NYC I have ever stayed at, and I am a very frequent business and pleasure visitor to NYC. Although the lobby area is grand and ornate, the beauty of this hotel stops on the ground floor. Will not even go into the ongoing construction of apartments in this building and the very ugly exterior entrance. The hotel rooms look as though they have not been touch since the 60's or 70's (and to bolster that claim, just look to the 70's era touch tone phone in the bathroom and the 60's era dial phones in the floor lobby). Furrniture, fixtures and carpet are very shabby for a 4+ star hotel, especially one that was charging my hosts over $600 per night for the privilage. Room was extremely small - Very much felt like a typically \"Holiday Inn\" experience, but without ice or drink machines on any floor (you need to call for everything and they take forever). Although most of the the bell, housekeeping, door and security staff are very pleasant and helpful, this does not translate to the reception, conceirge or room service areas. Phone calls to reception took ages, everything from the drinks to the roqm service menu are terribly overpriced, even by NYC standards. Requested a pack of smokes for a guest to be delivered to the room from the gift shop ($8) and was told upon delivery the charge was $28 ! When I checked into the room and called the front desk to complain about the room condition and to ask if where was another room available, was on hold about 20+ mins, just for them to tell there was nothing they could do for me.", "Date": "November 10, 2006"}, {"Ratings": {"Cleanliness": "4", "Overall": "3.0", "Value": "3", "Service": "2", "Rooms": "3"}, "AuthorLocation": "Scotland UK", "Title": "“Great location”", "Author": "tpadvisorwalker", "ReviewID": "UR4400433", "Content": "We stayed for 4 nights in November. Average sized room but a fantastic view over Central Park. Buffet breakfast was included in the rate which was very mediocre. Most of the staff were quite pleasant but the girl who checked us out was insolent. It was not a good last memory! The hotel is in an excellent location and the view superb but not sure we would spend the money there again.", "Date": "January 31, 2006"}, {"Ratings": {"Cleanliness": "2", "Overall": "2.0", "Value": "1", "Service": "2", "Rooms": "2"}, "AuthorLocation": "south jersey", "Title": "“Majorly disappointing.”", "Author": "ladytravelsagian", "ReviewID": "UR4388656", "Content": "Booked room for one night. very pricey. requested park view prior to check in - could not accomodate. Room was nice but worn, Windows were blocked by wooden fences. Called night manager to change rooms and was told none available. Offered breakfast. Upon getting into bed, there was what appeared to be a large chocolate smudge on the bed. called the hotel manager - very sorry - and asked me if I would like breakfast. The make up mirror in the bathroom was melted. Bathroom very small. bellman staff very nice. The hotel managers could use some improvement. Seem to give the standard answers but not very sincere. Mr. Barry Sternlicht should be ashamed to rent this room out and at that high a price. Very disappointed, I would have booked elsewhere had I known the windows would be blocked by a fence. and the room was so-so.", "Date": "January 25, 2006"}, {"Ratings": {"Cleanliness": "5", "Overall": "5.0", "Value": "3", "Service": "5", "Rooms": "5"}, "AuthorLocation": "San Francisco, California", "Title": "“Outstanding service, spacious room, no heavenly shower”", "Author": "bewtrip", "ReviewID": "UR4003303", "Content": "We stayed in a Grand Deluxe room for 5 nights. The service was impeccable. We did not make use of the Butler service except for ice, pillows, towels and other things that housekeeping would normally handle. Every request was fulfilled promptly and most graciously. The room was very large with a spacious sitting area. We arrived about 7AM after taking a red-eye flight. Of course, our room was not available. However, after seeing how tired we were, the management very graciously offered us the use of a small room in the Westin section of the hotel, and arranged to have our bags sent up. We were able to shower and nap until our room was ready. Truly a very gracious gesture on their part, and very much appreciated! This may have been due to our being SPC gold card members. Regardless, it was a lovely thing to do. This hotel gets outstanding marks for service, which was universally outstanding. Everyone at the hotel, reception, concierge, maids, doormen, security, butlers, bellmen, were wonderfully attentive and friendly. They greeted us by name whenever we came or went, freely offered assistance, and truly made us feel welcome. The only negative comment I have is that the bathrooms in the St Regis club rooms do not have the \"heavenly shower\" we experienced in the small Westin room. When I inquired about this, I was told that this was not provided by the St Regis Club rooms, only in the Westin. What a mistake that is!! The heavenly shower was without a doubt the best shower I have ever experienced in a hotel, anywhere. The shower in our St Regis club room was just barely acceptable. It leaked due to the seal having long since worn away, so that every shower led to a flood on the marble floor. The bed, however, was extremely comfortable. We did miss having a menu of pillows from which to choose. The St Regis club offered only 2 choices: foam or down, neither of which were quite right for us. It makes no sense to me that the Westin rooms offer more amenities than the St Regis Club rooms. However, the room was wonderful and extremely quiet. We ate at Botanica, which was lovely if expensive. The food was excellent and beautifully prepared. The spa locker rooms were disappointingly bare bones. The massage I had was wonderful. But you got only one small towel in your locker. No washcloths, no extra towels. Considering the prices, this is unacceptable. There is a lovely shop, called R. N. Joseph Fine Art, that is filled with paintings and exquisite furnishings and works of art, as well as estate jewelery. Although expensive, the offerings were exceptional. We ended up purchasing 3 paintings! The location of the hotel could not be better. Central Park South, within walking distance to 5th Ave, the theatre district, all sorts of shopping and restaurants. Easy access to subway, and of course, Central park. We felt perfectly safe walking around that area at all hours.", "Date": "October 9, 2005"}, {"Ratings": {"Cleanliness": "3", "Overall": "3.0", "Value": "4", "Service": "3", "Rooms": "3"}, "AuthorLocation": "Chicago, IL", "Title": "“It's About Location and the Compromises That Come With It”", "Author": "airportrpg", "ReviewID": "UR3847816", "Content": "Yes, the St. Regis Club is a Starwood Property, and the Westin brand flies overhead, but the St. Regis Club somewhat ambiguously rides piggy back on these brands and pretty comfortably so. This is an old building, and the rooms are comfortable and, in some instances, stunningly large for the city. It is a profound value proposition. We paid about $340/night for a large King with a very spacious sitting area. Not bad for prime position on Central Park South, a block from the spectacular new Time Warner Building on Columbus Circle, a block-and-a-half from Fifth Avenue, 2 blocks from the N/R/W/Q subway line, and a short walk from Times Square. And staying at the St. Regis Club means sharing the Essex House lobby, which offers a great brunch in Botanica as well the sublime haute cuisine of Alain Ducasse. It seems a forgone conclusion to me that this gracious building will disappear into the arms of condo development in the not-too-distant future, following in the footsteps of The Plaza and the Inter-Continental Central Park...It's just that the address on Central Park South is far more valuable for residences than for hotels. It's all quite sad, really, since there is no better place to stay that on Central Park South and the Essex House allows you to do it at a fairly reasonable price and in a wonderful sense of style and comfort.", "Date": "September 7, 2005"}, {"Ratings": {"Cleanliness": "5", "Overall": "5.0", "Value": "4", "Service": "5", "Rooms": "5"}, "AuthorLocation": "Tucson, AZ", "Title": "“Completely satisfied”", "Author": "A TripAdvisor Member", "ReviewID": "UR3531803", "Content": "My wife and I stayed at the St. Regis Club for the first time for six nights in May. We were quite impressed with the entire experience. Check-in was highly efficient, and we were pleasantly surprised when we entered a room that exceeded our expectations. We had reserved a large double room that turned out to be larger than advertised--really an unparitioned suite. Excellent city view, clean, quiet, very well furnished, very comfortable bed, everything worked, no signs of neglected wear, average-size but very nice marble bathroom. A family member joined us for a couple of nights, and the large and sturdy roll-away had a surprisingly thick mattress that was very comfortable. The public spaces were all pleasing. We especially enjoyed the cozy bar with fireplace. We found the staff to be friendly and helpful throughout our stay. The location, of course, is superb. This is certainly the place we will stay when we return to New York.", "Date": "June 6, 2005"}, {"Ratings": {"Cleanliness": "4", "Overall": "2.0", "Value": "3", "Service": "1", "Rooms": "5"}, "AuthorLocation": "", "Title": "“Dreadful service for a hotel of this class”", "Author": "JCW", "ReviewID": "UR3506786", "Content": "So the upside is that the rooms are lovely, the location is great, the Alain Ducasse restaurant is stunning (even if it's bizarre not to be able to charge dinner at the hotel restaurant to one's room bill). The downsides? Easily the worst service standards of any 5* hotel I've ever stayed in. Things not working, slow responses, laundry not returned, rude staff, incompetent billing. Just not acceptable.", "Date": "May 28, 2005"}, {"Ratings": {"Cleanliness": "4", "Overall": "4.0", "Value": "4", "Service": "4", "Rooms": "5"}, "AuthorLocation": "Los Angeles, California", "Title": "“Central Park and All”", "Author": "Marcmarc", "ReviewID": "UR3342957", "Content": "My wife and I just returned from our stay at The St Regis Club at the Essex House. It is an old world comfort station. A spacious room, in the very best location. I lived at the Essex House for four months in 2000 and it bacame my second home. Always happy to return.", "Date": "April 7, 2005"}, {"Ratings": {"Cleanliness": "5", "Overall": "5.0", "Value": "5", "Service": "5", "Rooms": "5"}, "AuthorLocation": "Fayetteville, Arkansas", "Title": "“VERY Nice Hotel & Beyond Expectations”", "Author": "NASCARFLASH24", "ReviewID": "UR3260857", "Content": "Once I find a nice place to stay, I'll keep returning, as long as I feel it exceeds my expectations. That is how I feel about my recent stay at The Essex in New York City. I had read a few prior TripAdvisor reviews, and wondered if I had come to a different place. The lobby was beautiful, all staff from reception to housekeeping to the gentleman standing guard to protect you at the elevators, showed their very professional training. I was always greeted by very friendly staff with a smile. My enormous and clean room on the 10th floor overlooked beautiful Central Park The beds are Westin's Heavenly Beds and are as wonderful as their name implies. I brought my pekingese with me, and she was treated as royally as I was with her own Heavenly Pet Bed. I have always previously stayed at The Lowell on East 63rd, but it has become a little too pricey. The Essex is in an excellent location, and if you're like me, you can walk for a few minutes and enjoy the great feel of New York City to and from this wonderful hotel.", "Date": "March 9, 2005"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Cambridge, UK", "Title": "“Christmas at the Essex House”", "Author": "LittleLittle", "ReviewID": "UR2970985", "Content": "We stayed at the St Regis Club of the Essex House over Christmas and must say that the service was great. We had a wonderful room overlooking the park - the butler service was a nice touch! We found all the staff to be very attentive. Breakfast is expensive but there are some great cafes around the area that offer a good breakfast. They also charge for the use of the internet in the rooms at $15 for a 24 hour period which seemed expensive - especially as a lot of hotels are offering free wireless connections!", "Date": "January 2, 2005"}, {"Ratings": {"Overall": "3.0"}, "AuthorLocation": "Stony Brook, New York", "Title": "“Should be better”", "Author": "DrRJS", "ReviewID": "UR2866171", "Content": "This hotel is all right in general, but, for these room rates and the way it bills itself as a luxury hotel, it should be great. Here are the good features: The hotel is attractive and the rooms are comfortable and well-appointed, with pleasant decor that has a solid feeling. The staff is well-trained to be polite and gracious. The location is superb (central park, theater district, shopping). Here is what is not so great: The fitness room is mediocre. (For example, I like quality elliptical trainers and this gym has only two old-fashioned ones that are not in good working condition.) There is a scent that is spread in the air in the fitness room that they presumably think makes it smell good, but it is an irritant. Fresh air would be preferable. They have the temerity to charge a $10 fee per day for use of this subpar facility on top of the expensive room rates. The fitness center opens late on weekends, so people who are on business trips do not have time to exercise if they want to get to work on time. If the quality of the fitness center is important to you, this is not the hotel for you. Also, when I went to the concierge for assistance in finding a gym for early Saturday morning, he only checked one facility that opened even later than the one at the Essex house and then said forget about it. I would suggest there was not much interest in meeting my need. When I asked him about a specific gym in another hotel on a nearby street, he ignored the question. I had to call around the city on my own to find a solution. On the higher floors of the hotel, the entire size of the floor is small, so that it is difficult to escape the noise of the elevators. Also annoying is the snobbery associated with room assignments. I am an average dumpy-looking, but well-groomed, 50 year old woman (and a physician who is a national expert in my field and award winning professor) and when I travel, most desk clerks automatically assign me to a less desirable room than they would someone they consider more important. My experience at this hotel was no different than usual. I am disappointed about this. I am waiting for a hotel in which people are assigned rooms based upon their preferences, the date of the reservation and the amount they are paying rather than the reaction of a 25-year old desk clerk to how they look and whether this clerk considers the guest worthy. In fact, when I made a specific request to be away from the elevators and the clerk said she had a perfect room for me, it turned out to be right next to the elevator- it was impossilbe to be any closer to it without actually being in it.", "Date": "December 6, 2004"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "", "Title": "“good & cramped in manhattan”", "Author": "A TripAdvisor Member", "ReviewID": "UR2453081", "Content": "Being from LA I would think this is wayyyy to expensive for the little suites you get but by Manhattan New York city standards this is class all the way! The rooms are about 1/2 the size of a regular suite so be prepared. The location is the best part...the horse and buggies are parked right out front of the hotel which borders the central park. Talk about New York ambience...a 5 min walk in all directions will take you to either Park ave., 5th ave, the Met museum, and time square...it doesn't get better than this...take a buggy ride and be a tourist! It's fun...I even rode the subway..umm..wouldn't suggest that but...this hotel has friendly staff armed with maps and resteraunt suggestions .. they are up all hours..and ready if even if you stumble in around 5am ..hehe", "Date": "August 16, 2004"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Huntingdon, United Kingdom", "Title": "“We loved it, fab location in a fab city!”", "Author": "buffgirl73", "ReviewID": "UR2062089", "Content": "We loved this hotel. It was our first trip to New York and set us up for high expectations from there onwards! From walking into the lobby we were treated wonderfully and the 5 star service continued throughout the trip. The linen was crisp and clean and the bathroom was impeccable. Little touches like the turndown service are nice but seem to be a dying tradition. The room was very 'compact' as are most NY rooms but great. The old huntsman lodge style bar reminded me of an old fashioned UK pub but with good service and the room service was the best we've had! As you can tell we loved this hotel!!!!!", "Date": "May 15, 2004"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "Liverpool, England", "Title": "“Very Friendly”", "Author": "A TripAdvisor Member", "ReviewID": "UR1769514", "Content": "Stayed at Essex House in New York in March 04. The staff are very friendly and rooms are excellent and kept very clean. Drinks in the bar are very reasonable priced. It is that good that we have booked the same hotel for over christmas.", "Date": "April 8, 2004"}, {"Ratings": {"Overall": "2.0"}, "AuthorLocation": "San Francisco, CA", "Title": "“Pretending to be a St. Regis hotel”", "Author": "A TripAdvisor Member", "ReviewID": "UR1729231", "Content": "At the beginning of March stayed at St. Regis Club in NYC above the Essex Hotel. Not worth it at all if you are looking for St. Regis quality and service. Starwood should not be claiming that this hotel is in the same class as the others, this will damage their reputation. I have stayed at the Lanesborough and other St. Regis hotels and could not believe this one. The first room they showed us had two of the three windows blocked with a wooden fence (!) and I think she actually expected that we would stay there. We insisted on another room, which they provided, but come on!! The 2nd room was pretty good, however they do not have the service concept together and seemed rather stunned when I called about problems or with a request. The \"butler service\" was non-existent--a true silent butler. It was impossible to get ice in the room for 2 days, then suddenly there were three buckets. Had to ask every day for facecloths, they forgot them every time--you would think that after the 1st request they could have made a note of it. Forgot the turn down service on one of 3 nights. (They gave us a plate of fruit when I mentioned these oversights.) A lot of the general staff are very nice, but they don't seem to be supervised very well by management. Starwood should just hook these floors up with the Essex and forget trying to pretend that this is a 5 star St. Regis hotel.", "Date": "March 17, 2004"}, {"Ratings": {"Overall": "3.0"}, "AuthorLocation": "Redlands, CA", "Title": "“Nice, Clean Hotel and friendly staff but far away”", "Author": "A TripAdvisor Member", "ReviewID": "UR1274943", "Content": "We stayed at the essex house in September of 2001 and we loved our room. It was well furnished, clean. We had a double bed and lots of space for a new york hotel room since most are so small. The Lobby is not too impressive but the lounge/bar was relaxing. We spent most of our time touring the city and found it to be pretty far from most of the action. A good 20 minute walk got us to Time square. But at least it was down Broadway. But when we wanted to see central park all we had to do was literally cross the street. If you are looking to be close to everything, I would suggest staying at at hotel around 46th street or so. If you are looking for a place close to central park, this is it. I've been back to NY but like staying closer to time square.", "Date": "September 6, 2003"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "washington, dc", "Title": "“A cut above in new york city”", "Author": "dctravelingman", "ReviewID": "UR1129537", "Content": "What a magnificant time we had at th St. Regis Club at the Essex House in New York city. The St. Regis Club is a hotel within a hotel. We loved our room with two luxurious marble tile baths. The lobby was extravegant, the service and staff was friendly and available. I have stayed in New York city on numerous occassions, usually in Times Square, but never again! This is the civilized way to go, elegant and upscale without sacrificing location. Give it a try, you won't be disapointed!!!!", "Date": "July 6, 2003"}, {"Ratings": {"Overall": "3.0"}, "AuthorLocation": "PA", "Title": "“Shouldn't be a St. Regis”", "Author": "A TripAdvisor Member", "ReviewID": "UR922685", "Content": "I stayed here about the same time as the previous reviewer, December 2002, but what a difference a few days can make. I've stayed here about 20 nights in the past few years, always in a park suite. It was always elegant and underrated. In fact, this is where I came after moving from a downtown hotel on 9/11. Friends are always impressed by the views. I care more about the service. This time, it was a busy holiday weekend. But on top of that they held two press junkets, so both the Essex House and The Club were jammed and the staff overwhelmed. I had problems getting the butler (who was apologetic, but that's kinda their signature item), they missed an important wake-up call, which I never use - it was that important. Room was completely dark when I checked-in and they missed a turndown service (specifically requested). Not smooth for a thousand bucks a night. Concierge and restaurant were unreachable. They seemed more concerned with coddling the young starlets at the junket, who will never stay there again, than a frequent guest, who probably won't either. Good for a package deal in the summers (very quiet), but there's a reason it doesn't make the ratings. Try the real St. Regis, Trump Int'l or R-C (they're trying really hard to be number one).", "Date": "March 23, 2003"}, {"Ratings": {"Overall": "3.0"}, "AuthorLocation": "", "Title": "“Going downhill”", "Author": "A TripAdvisor Member", "ReviewID": "UR837759", "Content": "Was a very good place. Now just average except for great location.", "Date": "January 16, 2003"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "Merchantville,NJ", "Title": "“Class on Central Park South”", "Author": "A TripAdvisor Member", "ReviewID": "UR826066", "Content": "My Wife and I stayed here during Christmas week last year. We are staying again this year. This is a first class hotel that does not get flustered when busy and offers excellent packages. The location is convienent to everything in Midtown and the Upper East and west Sides as well as all the amenities that Cental Park has to offer. The rooms are beautifully appointed and there is round the clock butler service. The Bijan toiletries are a nice touch. The lounge/bar is first class as is the Cafe Botannica. For those who enjoy afternoon tea the Essex House has one of the better spreads outside Cape May. I have not dined at Alain Ducasse but their ratings are excellent.", "Date": "December 19, 2002"}, {"Ratings": {"Overall": "1.0"}, "AuthorLocation": "San Francisco, CA", "Title": "“Has Been”", "Author": "A TripAdvisor Member", "ReviewID": "UR721566", "Content": "Such a waste. With a great location, this hotel has become a run of the mill, boring, upscale version of a Motel 6, but with pretention. The staff is clearly just doing a \"\"job\", the facility is run down, and who cares if it has an amazingly overpriced \"special occasion\" restaurant. Stay away!", "Date": "October 23, 2002"}], "HotelInfo": {"Name": "The St. Regis Club at the Essex House, New York", "HotelURL": "/ShowUserReviews-g60763-d239836-Reviews-The_St_Regis_Club_at_the_Essex_House_New_York-New_York_City_New_York.html", "Price": "$319 - $649*", "Address": "<address class=\"addressReset\"> <span rel=\"v:address\"> <span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">170 Central Park South</span>, <span class=\"locality\"><span property=\"v:locality\">New York City</span>, <span property=\"v:region\">NY</span> <span property=\"v:postal-code\">10019</span></span> </span> </span> </address>", "HotelID": "2514474", "ImgURL": "http://media-cdn.tripadvisor.com/media/ProviderThumbnails/dirs/2d/8d/2d8d0dc655ea9dcd1feaa91cfc5b1ce51large.jpg"}}