{"Reviews": [{"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Amsterdam, The Netherlands", "Title": "“Beautiful hotel, great location, spacious rooms”", "Author": "OandO-AMS", "ReviewID": "UR127092167", "Content": "Stayed here for two nights for a romantic weekend in Paris. As a member of 'small luxury hotels of the world' we got an upgrade to the junior suite. Very spacious and nice. Although I personally prefer a bit more design furniture, the room had a nice and cozy atmosphere. Breakfast was included: nothing too special but good and fresh. The location is truly excellent in the heart of the city. We loved it.", "Date": "April 1, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Location": "5", "Rooms": "5"}, "AuthorLocation": "", "Title": "“5 star location and 5 star price!”", "Author": "Toyo3", "ReviewID": "UR126351732", "Content": "We are in the middle of our stay. I booked through Expedia and requested a roll away bed for my son which I am always concerned with especially in a smaller boutique hotel and through a third party(Expedia). Checked in at noon and the room was ready with the rollaway already nicely placed. Room has high ceiling and very comfortable. Marble clad washroom and shower is spacious enough especially for French standard. As my son put it, small lobby big rooms while some others like the Westin is the exact opposite. It is very expensive but if you want a 5 star location and hotel how can you go wrong with 1 Place Vendome address???", "Date": "March 19, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "2", "Location": "5"}, "AuthorLocation": "Oslo, Norway", "Title": "“Good value but dated interior”", "Author": "Gudleiv", "ReviewID": "UR125007911", "Content": "Staying at place de Vendome next to the Ritz will never be cheap. At EUR 250 for a single room the price I paid was very good. Room is small, interior ok but dated, and quiet. Service was great, and the \"lobby room\" which is based on the second floor has been redecorated and works well. Would recommend it for the price!", "Date": "February 21, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Boston, Massachusetts", "Title": "“Fabulous location and lovely small luxury hotel”", "Author": "alexandradf", "ReviewID": "UR123249352", "Content": "I stayed at the Hotel de Vendome during Paris fashion week and thoroughly enjoyed my stay. The location is unbeatable, right at 1 Place Vendome, amidst the swanky shops and neighbors with the Ritz Paris. The rooms are small but come with all luxury ammenities. My favorite part was the beautifully designed breakfast room overlooking the street below. For my full review, with personal photographs of the property, please visit my blog post at: http://www.destinationsperfected.com/2012/01/paris-france-hotel-de-vendome.html", "Date": "January 18, 2012"}, {"Ratings": {"Overall": "3.0", "Service": "1"}, "AuthorLocation": "Paris, France", "Title": "“Problems with the restaurant's staff”", "Author": "Max L", "ReviewID": "UR122382004", "Content": "Not being guests at the hotel, my friend and I had a less than pleasant service on the part of a lone waiter that held the fort at the hotel's first floor restaurant on 1st January 2012. First off, we waited for about 10 minutes for him to appear; then he made us wait for another 5 minutes before offering us a table (most of the tables in the hall were vacant). He did not speak any English; fortunately, my companion spoke French. The waiter was brusque and nonchalant from the start:virtually every order had to be made twice as they were never executed on first attemt. Then, things got even worse as he imagined that we were staring and laughing at him (indeed, we looked in his direction occasionally trying to draw his attention -- mostly in vain). After i complained, informally, to some one who appeared by the end of our ordeal and looked his senior, the waiter came up to my companion (as he could speak to him in French) and, after a short exchange, threatened to beat us up after 11 o'clock, \"at the back of the hotel\" where he demanded we should show up. I have been to all sorts of places but have never experienced anything like this -- and in a 5-star establishment at that!", "Date": "January 1, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Houston, Texas", "Title": "“Perfection”", "Author": "Colleen M", "ReviewID": "UR122237681", "Content": "My husband and I just returned from a trip to Paris for Christmas and our anniversary. My husband had been to Paris before and gave me a list of hotels to choose from. We ultimately decided on this hotel. As Texans, we loved that the hotel was the Texas Embassy when we were a country and we loved the location. When we arrived we were given excellent service. We are pretty low maintence guests so there was not much that we asked of the staff but they were always kind and wonderfully helpful when we did need something. We had a junior sweet on the first floor, and it was amazing. The bed was harder than most but we couldn't stop talking about how comfortable it was and how well we slept. We walked nearly everywhere from the Place Vendome and it was beautifully lit up for Christmas time. We each had our own bathroom (one in the sitting room and one by our bedroom) there was a room for bathing and getting ready and a closet room for our bags and clothes. The furnature was beautiful and the automated lights, sound and curtain system made it feel modern even though we were surrounded by a beautiful older feel. Unless we hopped over to the Ritz, I wouldn't want to stay anywhere else in Paris. It was like a dream.", "Date": "December 29, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Miami, Florida", "Title": "“Fabulous!!!”", "Author": "samlupowitz", "ReviewID": "UR121827620", "Content": "Location? Beyond Perfect! Staff? Wonderful! Room? Beautiful, and they up-graded me to a suite without my asking!!! On a scale of 1 to 10? 11. I will never stay anywhere else, when in Paris.", "Date": "December 17, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Tetbury, United Kingdom", "Title": "“Wow another amazing stay.....”", "Author": "LMc070", "ReviewID": "UR121615308", "Content": "Let me explain why.. The kingside bed allows us to sleep perfectly after a great day shopping. Getting ready with the music you love playing on the sound system in your room, certainly gets us in the party mood but apart from soundproofing, perfect sized room with two toilets & a separate bathroom & walk in wardrobe, the service is outstanding. We have never stay anywhere with such attention to detail.. The people that work here loved this hotel & their jobs. We have had a small team of people taking care of our every need.. After booking us into the VIP Rooms, the hotel provided us with a dedicated assistant to ensure we had a great night, then sent a second person from the hotel to check with my husband that we were having a lovely evening.. Stunning room, space, perfect quiet in the absolute best location. We love this hotel, they help make our trips to Paris perfect. Thank you.", "Date": "December 11, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "4.0", "Value": "3", "Sleep Quality": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "u.s.", "Title": "“charming hotel”", "Author": "nimo5", "ReviewID": "UR119837642", "Content": "We had booked 4 rooms, 3 of which were really not so nice, too small no views to speak of, my room quite dark, only l window in the bathroom, very uncomfortable, strange locations for electrical outlets, etcetc. The location is very good and prices more accommodating. I like the fact that it is small. There is no lobby to speak of so if you want to go to a lounge area to talk etc there really is no place. The restaurant is located on the first or second floor, the atmosphere quite charming, the food good although very rich as is most french food, and very expensive. When the bill came we asked if the tip was included and the waitress went on and on in a confusing discourse eventually saying 'no' which was a lie of course because we later found out all tips are included in the bills, even in small cafes. I felt that was quite deceptive and we never returned to eat there. The concierge staff also is not very helpful. I might return there only if I knew what room I would be assigned.", "Date": "October 28, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Vancouver", "Title": "“Hard to beat.”", "Author": "WillieVancouver", "ReviewID": "UR119077325", "Content": "My wife and I spent 2 nights a the Ritz prior to moving down the street to the Hotel de Vendome. The Vendome had a much, much better room rate and the the staff were just as polite, friendly and professional. The building is beautiful and has been restored with great sensitivity to its illustrious past. Everything was immaculately presented, the rooms and common areas were all finished to the highest standards. The only downside might be the lack of a pool and bar. There is a restaurant which we were unable to try. I would strongly suggest staying in the Hotel de Vendome, save several hundred dollars per night and, if you want lavish facilities outside of your room, walk the half block to the Ritz.", "Date": "October 8, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Location": "5"}, "AuthorLocation": "New York City, New York", "Title": "“HOME AWAY FROM HOME IN PARIS”", "Author": "June747", "ReviewID": "UR118788277", "Content": "My most favorite hotel which is not so easy to say in Paris.I love it because its so intimate.The BEST LOCATION IN PARIS, The rooms are so comfy.the staff couldn't be more friendly,knowledgeable and makes you feel at home. Because its a small luxury hotel, you get to meet other interesting guest in the restaurant,while eating or working..", "Date": "September 30, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Helsinki", "Title": "“Fabulous address for a three star hotel”", "Author": "PeterHelsinki", "ReviewID": "UR118350756", "Content": "When reading the RAVE reviews of visitors on Tripadvisor about this hotel I wondered whether I had missed something while staying there In September this year. Of course the address is something to swoon about but as far as the hotel is concerned, I have my doughts. The area around the lift looks like a jewel box with exquisite marble but the only other public area, the dining room, is completely out of character with the architecture of the hotel. The breakfast was stardard and the dining room hopelessly understaffed. The congierge was polite but the rest of the staff hardly greated one. One the whole this is a good three star hotel with stellar prices. I advise travellers to rather go to the Ritz.", "Date": "September 20, 2011"}, {"Ratings": {"Location": "5", "Overall": "5.0", "Value": "5", "Service": "5", "Rooms": "5"}, "AuthorLocation": "Boston, Massachusetts", "Title": "“Absolutely Extraordinary”", "Author": "USofArugula", "ReviewID": "UR118134411", "Content": "For three lovely nights, a friend and I stayed at the Hotel de Vendome to celebrate my birthday. I've been to Paris many times, but I don't usually stay in luxury hotels (so, forgive me if the things I remark on are standard). First, location: it's always charming to stay in the 1er, and this is about as 1er as you can get. Right on Place Vendome, a two minute walk to the Hemingway Bar, kitty-corner to an Annick Goutal, two blocks down from Tuileries, 5-ish minutes from Colette, 10-ish minutes from Laduree r. Royal. Awesome. Easy access to big tourist destinations: Tuileries (as I mentioned), the Louvre, the Opera Garnier, and the Madeleine are all an easy walk away. Close to both the Tuileries and Concorde metro stops, you have pretty good metro access. Plus, between the hotel itself, and the Ritz just two minutes away, you'll never have problems getting a taxi. The rooms themselves are spacious, with pleasant views, offering maximal control over the amount of light let in. During our stay, our room was tidied twice each day. One of the nicest touches was a weather report for the next day which was delivered during the evening cleaning--including sunrise and sunset times, enabling you to plan your twilight activities (the Eiffel Tower, Bateaux Mouches, walks along the Seine, etc.) for optimum romance. There was also an international newspaper delivered daily. The staff was wonderful; they provided excellent suggestions for restaurants and places to go out. There was never any kind of concern that they might be sending us somewhere subpar, to dine and drink amongst the tourists. Rather, they sent us to places that, given our relative youth, had both excellent, innovative fare, and were rather \"branché.\" They were always attentive, polite, and helpful, without being overly-assuming. In brief, the service was perfect. If you have the funds, I would highly recommend the Hotel de Vendome. To date, it has been my most exemplary hotel experience.", "Date": "September 14, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Newport Beach, California", "Title": "“Extraordinary stay in Presidential Suite--5 star all the way”", "Author": "Tar Heel Bill 92", "ReviewID": "UR117923915", "Content": "My husband and I recently returned from a Denmark/France trip for a friend's Danish wedding, and ended at the Hotel de Vendome for 2 nights before flying home to the USA. For comparative purposes, we also stayed 2 nights at the Nimb in Copenhagen; 2 nights at Bromoelle Kro in Denmark, site of the wedding; and 4 nights at the Hostellerie de Plaisance in St. Emilion, France. I was a little apprehensive about this property, given that we normally stay at Aman, Four Seasons, Mandarin Oriental, and Relais and Chateau type properties--and because I was eager to try the Park Hyatt Vendome instead. We had previously stayed at the Pavillon de le Reine, but we wanted to stay more in the Vendome area of Paris. We settled on the Hotel de Vendome partly due to price and partly due to my usual preference of staying in a small luxury hotel when at all possible as opposed to the many grand hotels. We absolutely made the right choice! We booked the Deluxe Suite but were upgraded to the Presidential Suite on our arrival. As this was our first time at the hotel, we were pleasantly surprised--and were awestruck by the Presidential Suite. While we have stayed in bigger suites (the Presidential Suite at the Four Seasons Prague comes to mind), we really were impressed with its size, layout, and its impeccable French design. There was no doubt that this was Paris. One of my hesitations about the Park Hyatt (and Four Seasons) is that those hotels can sometimes feel slightly less authentic. The Hotel de Vendome felt inimitably French--while still retaining all of the high levels of service and luxury that we crave. The Suite was almost perfect--it even had its own huge sun deck looking into the courtyard of the Hotel, with almost complete privacy since all of the windows on the other side were shuttered. It had a lovely drawing room leading to another entry vestibute opening into the main living room and dining area, with a separate couch area to the side opening into the bedroom. French doors and natural light abounded, with the walls slightly sloping inward as we were on the top floor. The bedroom had automatic shades that provided complete blackout conditions for sleeping, something we cherish at home. The master bathroom was the only caveat to a perfect room--it was a bit small for the size of the suite. But we still found it more than functional and beautifully designed. Service could not have been friendlier or more efficient. It definitely felt like we were in a high end boutique luxury hotel as opposed to a major 5 star masterpiece--a plus for us. We had dinner at the hotel on our last night--1 Place Vendome is absolutely French again, beautifully designed and with a very lovely 4 course pre-fixe menu that we enjoyed tremendously (though you could also order a la carte if you wished). Service was excellent and prompt, and the food was outstanding. We took note that the restaurant was almost full on a Friday evening, even though this is obviously a small property with a less known restaurant, and we also noted that we seemed to be the only Americans present. We enjoyed that immensely, even when we had a minor translation challenge or two. Our only real gripe is that their complimentary wireless internet constantly required us to re-authorize every day. That was a bit annoying. But that's it--a smaller bathroom and good internet that needed me to put in a code once a day. Those were our only complaints! We did have drinks at the nearby Park Hyatt on our first evening. It is a beautiful property, and I certainly like its style more than that of the Four Seasons here in Paris. That being said, I was startled at how happy I was that we were staying at the Hotel de Vendome and not the Park Hyatt. The Presidential Suite certainly helped, but we would have been in a suite nonetheless at either property. I am curious as to how the Deluxe Suite would compare, but the hotel as a whole is wonderful. My husband and I agree that the Hotel de Vendome is our new address for Paris. Considering the price we would have paid for a Prestige Suite at the Park Hyatt, the Deluxe or Presidential Suites here at the Hotel de Vendome are a bargain. Bravo!", "Date": "September 11, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "4", "Service": "5"}, "AuthorLocation": "Vancouver", "Title": "“Wonderful hotel with excellent location”", "Author": "avalVancouver", "ReviewID": "UR117919913", "Content": "We have been to Paris numerous times. This time we chose to stay in a boutique hotel and saw the reviews on Tripadvisor for this hotel. Definitely recommend it although somewhat pricey. We were there for 6 nights and the location is superb. We could walk to the Tuilleries, the Louvre, to the various Metro stations, to Opera, Gallerie Lafayette, Printemps, etc. The breakfasts were memorable but after a couple of days we chose, for a change, to walk to the nearby Eric Kayser bakery for a suberb fresh Viennoise or choc or almond filled pastry or plain croissant and fresh coffee each morning or a great salad at lunch. Staff was very courteous and friendly. Rooms were very well decorated and clean. Service was superb. Our only suggestion, it would have been very nice to have had a kettle and a couple of cups in the room for those days we came back to hotel tired and did not want to order room service or go out just for a cup of tea. Even 5 star hotels are now starting to do this.... Overall, excellent hotel and we would certainly come back.", "Date": "September 10, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "4.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Atlanta, Georgia", "Title": "“Fabulous”", "Author": "I_L0ve_Travel_Too", "ReviewID": "UR116547832", "Content": "The hotel was perfectly located. A block from the Ritz in Paris for a fraction of the price. Absolutely loved it. The staff was gracious and helpful. The highlight was breakfast served by professional staff. Will definitely be back.", "Date": "August 11, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "San Francisco, California", "Title": "“This hotel was totally awesome and so were the staff.”", "Author": "ebolds", "ReviewID": "UR115754905", "Content": "The suite was so beautiful we hated to leave it to go sightseeing. The staff were extremely courteous and helpful. Definitely considered one of the best hotels I have stayed at .", "Date": "July 25, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Naples, Florida", "Title": "“We will only stay here from now on!”", "Author": "alex3485", "ReviewID": "UR115543250", "Content": "This was my third time to Paris and it is great finding a small luxury hotel in the heart of Paris, that we would actually want to return to again and again. We had a junior suite and the room was large and beautiful. The staff at the front desk was more than helpful with arranging tours and dinner suggestions. They made dinner reservations for us each night, places we could walk to that were outside and casual, but really good food. The Godiva chocolates each night were perfect. We walked to the big Ritz around the corner for a drink, but we were very glad we stayed here instead for half the price with better, larger rooms! We used the lounge upstairs to hang out while we waited for our plane in the evening, and also got an early check in when we arrived from a long flight from the US. I cannot say enough good things about this hotel, if you want a chain hotel and a large crowd this is not the place for you. If you want a quiet, elegant spot this is your hotel!", "Date": "July 19, 2011"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "Orlando, Florida", "Title": "“Great hotel in the heart of the jewelry district in Paris”", "Author": "watergirlg8", "ReviewID": "UR113483043", "Content": "I stayed in this hotel as part of an award for top sales in my organization. I attended this trip with two of my associates, and one spoke beautiful French. The rooms were big with big bathrooms -- keep in mind, that we shared a room with full size beds in it. We were able to walk everywhere close. Food was easy to obtain if we did not want to go out and the last week we were there, I became ill. They had a doctor at my room within 30 minutes and the cost was minimal. I was perscribed everything my US doctor would have as well. We did the tourist tours during the day, then ventured out at night from the hotel every evening. The people who run this hotel are very cordial and accommodating -- this one comes highly recommended! M:)", "Date": "June 14, 2011"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "Port Macquarie", "Title": "“Charming, Cosy & Elegant”", "Author": "TravelersofOZ", "ReviewID": "UR113292533", "Content": "The position of this hotel is why I chose it. Perfectly positioned in a wonderful area to explore. The hotel is Charming, Cosy & Elegant. I was greeted with excellent service. My room was smallish but beautifully decorated and elegant. The bed was incredibly cosy, Breakfast was great, made extra special by the staff. I enjoyed my stay and look forward to return. Thank you Hotel de Vendome", "Date": "June 13, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Enid", "Title": "“Outstanding Hotel...traveled all over the world and this hotel was absolutlely first class!”", "Author": "kyle1216", "ReviewID": "UR108563178", "Content": "My wife and I were on a trip to Africa with a stopover in Paris. We researched hotels in Paris and selected Hotel De Vendome. They had one bad review at the time, but many other very good reviews. We couldn't be happier. We were on an overnight flight and arrived very early and were welcomed with a warm greeting. The room was romantic, music and the furnishings were perfect. The restaurant was great, food and service terrific and the waitress even provided us the CD that was playing so we could purchase. We are brining a VIP this fall to Paris and will book this hotel again. My wife and I travel the world and I am pleased to recommend this hotel. Kyle and Carol Williams, Enid, Oklahoma, USAl.", "Date": "May 16, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Edinburgh", "Title": "“Ssssssh! Don't tell a soul.”", "Author": "Gingersheep", "ReviewID": "UR107326279", "Content": "I love this hotel - this was our third stay and it just gets better and better. The hotel is small and therefore the service much more personal. I really want to keep it to myself, but that wouldn't be fair, I cannot recommend it highly enough.", "Date": "May 8, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "San Diego, California", "Title": "“Extraordinary and personal service ,best experience in Paris!”", "Author": "ite76", "ReviewID": "UR104318901", "Content": "The very friendlly and knoledgable staff were always incredible. You can tell there is wonderfull management by the great overall experience i had. From the front desk, roomservice, restaurant, concierge and always going out of their way to be helpfull. Amazing location, and super convinient and beautiful to walk everywhere!, can't wait to go back!", "Date": "April 17, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Corona del Mar, California", "Title": "“outstanding,high quality and personalized attention to detail”", "Author": "Daly_11", "ReviewID": "UR104078207", "Content": "What a terrific and great customer service we received during our incredible stay.Outstanding proffessionals, excellent service and amazing personal attention. One of the best locations in Paris near to the best sights and tourist attractions. We'll defenitlly be back soon!", "Date": "April 14, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Cape Cod", "Title": "“Excellent Choice”", "Author": "Diane B Posted by an Accorhotels.com traveler", "ReviewID": "UR95610203", "Content": "Hotel de Vendome is ideally situated for walking to all the major sites in Paris. This boutique hotel has a small lobby but large soundproof rooms which are decorated beautifully. The bed was very comfortable. The restaurant was extremely pricey so we did not eat there but restaurants are everywhere in Paris so that was not a problem. I would return to this hotel when visiting Paris again.", "Date": "February 5, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Miami, Florida", "Title": "“Must experience to understand the level of class and excellence”", "Author": "bazingaLV", "ReviewID": "UR92474424", "Content": "Stayed with my husband over the New Years Holiday (I know, a year late in posting) in 2009-2010. I had my hesitations regarding the size (boutique hotel) and the cost. I can honestly say, I have never, ever experienced such an amazing overall stay at a hotel in my life (even since then). My husband and I try to do one luxury trip a year, and the stay at Hotel de Vendome in Paris is the marker that we hold all other hotels to moving forward. Just as a testament to the service level and ambiance of this luxury boutique hotel - we are going BACK December of 2011 for the Christmas holiday. The rooms are spectacular and elegant. We stayed in a Junior Suite overlooking Rue Castiglione (and Godiva). Floored at the size of the room - was huge compared to US standards and off the charts compared to European rooms. The living room furniture was exquisite, the bedroom was massive and the walk in closet - yes, walk in closet - i have goosebumps just remembering. The service is over and above what you would expect from a 5 star luxury hotel - they remembered our names every day (yes, in PARIS) everyone was spot on with smiles, assistance - from housekeeping, porter, concierge, front desk - and the most adorably sweet bartender in the restaurant who not only got me tasting the most amazing chips (they are purple), served us amazing drinks but told me which was better, Cafe du Magotts or Cafe de Flore for Hot Chocolate. As I mentioned - every hotel we stay at is compared to Vendome - and they do not live up, including the St. Regis in Rome, The Hilton Auckland, etc. I have stayed in many countries and in many hotels - including trying to find another place through slh.com (Small Luxury Hotels of the World of which the Vendome is a member) and *nothing* lives up to my expectations - the Vendome is the epitome of service and standards in Paris. Upon arrival, we received a bottle of Champagne in the room, a gift basket from Guarlain, and of course, the daily Godivas on the pillow. You are less than walking distance from the Louvre, the Tuelleries, metro stops, jewelry shopping at palace vendome and a block or two from Galleries Layfayette, PrinTemps and Opera Garnier. Across the street corner is a great little bistro, Le Castiglione - which had great food (especially Onion Soup and excellent wine selection). The rooms are also sound proofed - you cant even hear anyone in the hallways, including service. Truly peace on earth :) and apparently there were kids on our floor, and we did not even know. There are only a few rooms on each floor (and an amazing elevator!!) All of our needs were met, sometime before we even asked - the food was impeccable, the surroundings exquisite (even that word does not do this hotel justice) and I am counting the days until December 23rd of this year till we get to go back to our little slice of heaven for Christmas!!!!", "Date": "January 10, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Tetbury, United Kingdom", "Title": "“Life Saver!”", "Author": "LMc070", "ReviewID": "UR91185495", "Content": "We needed a great hotel quickly and Trip Advisor ratings lead us to this amazing place... We are delighted! Not only did they discount the room rate but we are now in the most beautifully quiet room, looking forward to spending the next few days in total luxury. The staff have been delightful and we are so relieved we have found this little gem in such a stunning location... Thanks to all who've written reviews about this hotel we love it!", "Date": "December 31, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Atlanta, Georgia", "Title": "“Ideal Location”", "Author": "sfinestone", "ReviewID": "UR88671892", "Content": "My wife and I have visited Paris numerous times, but this is the first time we stayed at Hotel de Vendome. The location is perfect, within easy walking distance to many points of interest. The hotel is a lovely boutique hotel. Our room was very small, with virtually no view. This was difficult for a 4 night stay. We were on the firth floor, where only one other room completes the picture of what appears to have been the attic. It was not until we used the stairs (rather than the quaint oval lift) that we realized floors 1 through 4 appear much nicer than the 5th, and all appear to have good views of Place Vendome or Rue St. Honore. We requested the Trip Advisor free breakfast when we booked, but the hotel politely refused to honor it. The restaurant and bar were intimate and delightful. I would recommend this hotel with the one caveat: request a room that is not on the 5th floor.", "Date": "November 30, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "San Francisco", "Title": "“Excellent Botique Hotel in the Heart of Paris”", "Author": "tnttraveler1965", "ReviewID": "UR83274293", "Content": "A small hotel with a great location among the finest (and most expensive) properties in Paris. Our room was exceptionally large by Parisian standards and it was amazingly quiet even though it faced directly onto Rue Saint Honore. The hotel is well maintained and spotlessly clean. The staff was often (but not always) eager and helpful. They did a good job recommending some near-by restaurants and making reservations, although they clearly don't seem to have the clout of a concierge from a major hotel. The breakfast room appeared to be adequately staffed, but one person seemed to be cheerfully doing most of the work. This same service imbalance seemed to afflict the front-desk staff. Compared to other Paris hotels of similar high quality, this property is surprisingly well priced. Perhaps it will become more well known and raise its prices accordingly, but for the monent it is a well-priced gem for those who are looking for a small, quiet, high-quality, convenient place to stay in Paris.", "Date": "October 13, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Paris", "Title": "“Discreet Charm on the Place Vendome”", "Author": "VINGTparis", "ReviewID": "UR82587559", "Content": "Hotel Vendome Napoleon, dressed in his fine Roman generals’ costume stares down at you from above on his perch in the centre of The Place Vendome. Some distinguished addresses adorn this grand courtyard, but, in a quiet corner one remains, the most discreet. Number One, Place Vendome, the location of the 4 star deluxe Hotel Vendome. The hotel is somewhat of a surprise, neighbouring but not overshadowed by the imposing Ritz hotel just around the corner. On the contrary, this building has a pedigree that far exceeds that of its neighbor. Once the ancestral home of the Vendome family (for whom the historic place is named) built in 1727 and once the embassy of the Texas Republic, when it was first recognized as its own country. Imagine. Paris, Texas. You know you are in for an intimate experience as soon as you step through the door. The hotel's ambience envelopes you as you enter the quiet lobby, with its inlaid Italian marble floor, and crystal chandelier that sparkles above. The suites are all decorated in unique combinations of traditional French antiques and art. A beautiful corner room suite, with an elegant French master bathroom in Italian marble and a huge tub even has a guest bath for your visitors, just off the petite salon. The layout of the room, the historic views and the handsome bedroom in traditional French Blue Toile patterns is impressive. The entire operation is handled by its Chief Manager, Ms. Etiennette Clamouze. Like a quiet, yet commanding general she manages a diverse staff of professionals who work behind the scenes to keep the guest's experience seamless, enjoyable, with impeccable and personalized service. Location is everything in Paris and with this emplacement there is not a metro, bus, taxi or limousine service that won’t take you to where you want to go. Shops, cafes and the nearby fashionable districts are so close, its dangerous (but in a really good, way). Executive Chef Dider Aniès is at the helm with his award winning team, creating seasonal menus using fresh ingredients. The recently renovated Mezzanine bar and restaurant has local business people flocking there for lunch. For the fashion set, the décor in the restaurant is perfect: Michele Bonan, a designer who has already made his mark at some extraordinary hotels has taken what once was a rather stuffy atmosphere and made it fresh and chic. Soft dove gray walls and silk draperies accent the painted wood paneling to create the background setting that is dreamy and subtle. The restaurant windows overlook the famous rue Castiglione. The surprise of a black and white ‘hounds tooth’ club chairs with pink accents makes the décor both masculine and feminine, comfortable and inviting. There are no bells and whistles here to distract you from the comfort and quiet of the place. With beautiful appointment, quality service and wonderful “home made” food this hotel is a unique “Classic Parisian” luxury experience.", "Date": "October 8, 2010"}, {"Ratings": {"Overall": "3.0"}, "AuthorLocation": "Charleston, West Virginia", "Title": "“I Guess the Great Service took a week off!!!!!”", "Author": "wesleydarl", "ReviewID": "UR81522336", "Content": "We just returned from a wonderful week in Paris. Our suite at the Hotel de Vendome was lovely. Worth the extra. However, this wonderful service we kept hearing about must have taken the week off. One of the desk employees actually turned up her nose when we asked for directions for the metro. The mini bar and restaurant prices were way out of line. The continental breakfast below European standards. Previously we had stayed at the Raphael. The room was not as nice but the service was superior to anything we experienced at the deVendome. An address does not make for a great hotel. Don't get snookered...", "Date": "September 29, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Egypt", "Title": "“The unbeatable location & great staff leave you no choice: stay here!”", "Author": "Shakers_7", "ReviewID": "UR81307932", "Content": "My family and I had been to Paris a few times before, but never did we enjoy it as much and that is really thanks to Hotel Vendome. The location of the hotel is unbeatable - in a manner of minutes you can reach - even on foot - all the major sites, the hot shopping spots, restaurants and bistros; you name it and you can reach it from that elegant hotel. At 1 Place Vendome you feel you are part of history, and even the hotel building itself gives you that feeling. The hotel staff are a major factor as well - not only do they greet you with a smile and a very warm welcome but are willing to help with anything you need and go even beyond the extra mile from restaurant and tour reservations, to even one of the very nice and kind gentleman, running down the street on the final day of our stay, helping us hail a cab to catch our flight. It was a Saturday and the cab company that was supposed to pick us up never showed up!! I would like to also single out Sophie (I hope I got the spelling right) who is a real gem. Moving on to the rooms, we were nicely upgraded to a suite that was very spacious, had a lot of storage space (we travel with a lot of luggage), equipped with all the amenities you can think of (down to a stapler, ruler, scissors, post it notes, etc) and spotless clean. Godiva chocolate at night was a real treat. The bathrooms are also spacious and very clean. The only drawback in our room, was the absence of windows that one can open and that could sometimes give you the feeling of being boxed in. They smartly try to overcome that feeling, with floor to ceiling mirrors. Free internet is an additional plus. All in all, if ever going to Paris again, this will be not only my number one but sole choice. The place is magnificent and certainly adds to your enjoyment of this lovely city. Tip: Do not miss out on breakfast at Angelina and the delicious and heavenly hot chocolate speciality of the house.", "Date": "September 28, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Roswell, Georgia", "Title": "“Absolutely wonderful in every way!”", "Author": "Kteach6849", "ReviewID": "UR71044477", "Content": "This may be the finest hotel we have ever stayed in! It is an elegant, intimate boutique hotel in a fabulous location. Our junior suite was exquisite - quiet, spacious and beautifully decorated. The entire staff - reception, restaurant, housekeeping, room service, valet - seem to anticipate your wishes and pleasantly and efficiently provide excellent service. We had both an excellent lunch and a memorable dinner in the hotel's restaurant. The food was excellent, the decor delightful, and the service exemplary. We are already planning our next visit.", "Date": "July 15, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Mamaroneck, NY", "Title": "“World Class Style able to accomodate Americans”", "Author": "EyeGuy2020", "ReviewID": "UR63942236", "Content": "Wow, what a great weekend in Paris in the Spring! The hotel was great, the location, down the block from the Louvre, the Gardens Tuileries, The Opera, and of course Galleries Lafayette. This hotel is in the center of Paris. The staff was great, as one would expect of a world class hotel. Breakfast was a delight of flavors and textures with the room service continental breakfast. The concierge printed out maps from my Google searches. They made great recommendations for restaurants that were within walking distance. I can't say enough about their ability to help me enjoy the weekend. I only speak English, that was Not an issue. I wish other hotels would learn from the staff at this one. The beds were turned down every night, the room was spotless. The public restaurant was a nice place to sit and rest for a few moments. They did not push drinks or require to buy a snack to relax in the public room/ restaurant bar. These people helped make my trip to Paris fun enjoyable, and trouble free. I highly recommend them to anyone that wants to be in the center of Paris and enjoy the sights and flavors of a great city.", "Date": "May 12, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "3", "Rooms": "3", "Location": "5"}, "AuthorLocation": "New York, NY", "Title": "“Old fashioned style but very good hotel”", "Author": "Bebe38", "ReviewID": "UR59524548", "Content": "For the right bank, the location can't be beat. Just a few steps (but not in) from the gorgeous Place Vendome and The Ritz. Service was welcoming and efficient, a pleasure. The hotel and our room are old world in style and while we find it rather old fashioned - like your rich aunt would stay there - it is well done. The only flaw was that we faced the street (rue St. Honore) and could hear the late night partyers at the Hotel Costes bar/lounge coming and going. And the garbage trucks in the morning. You might ask for a room in the back if this is a concern. Staying at the Vendome is not an exciting or interesting experience, but rather a refined and comfortable place in a superb location.", "Date": "March 25, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "3", "Location": "5", "Rooms": "4"}, "AuthorLocation": "London", "Title": "“Romantic break in a wonderful part of paris”", "Author": "Leese25", "ReviewID": "UR54390771", "Content": "We booked this via Eurostar and was very pleased with the hotel. The room at the very top of the hotel offered no view but the room was really lovely and spacious. The bathroom had a separate room for the toilet which is also a luxury you don't normally find on a city break. Everything from the room door to the furnishes were very plush. The hotel staff were pleasant although we did not really speak to them as we know Paris so well, we don't need help. But we did hear them helping some Americans and they were polite, professional and helpful. We did not take any meals at the hotel - preferring to find our favourite spots. The hotel is in the smartest area of Paris and felt reassuringly safe. I would recommend this hotel for couples, not somewhere I would want to take our daughter - just a romantic break for my husband and I!", "Date": "January 26, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Australia", "Title": "“Brilliant Hotel, location and room”", "Author": "jigitsr", "ReviewID": "UR52720701", "Content": "This was a lovely small hotel (29 rooms) located right in at the Vendome, around the corner from the Ritz. The location was brilliant, right on Rue Saint-Honoré which has the most amazing shopping and close to Louvre and gardens. It was priced beautifully and the room was HUGE by Paris standards. I am a bit of 5 star girl when I travel and I loved this place. The bathroom was enormous, with lovely fluffy towels, robes, slippers and great big bath to soak in at the end of day walking around Paris. The staff were always friendly, accommodating, and the hotel was spotless. It is a great option if you are a traveller not interesting staying at a large chain of hotels. I will definitely stay here again.", "Date": "January 6, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "aussietraveller00", "Title": "“Great hotel, even greater location ... just a great stay”", "Author": "aussietraveller00", "ReviewID": "UR52285031", "Content": "We had booked this hotel 6 months before we visited Paris, we contacted them directly for the best rate, which was miles better than any other offer out there. We stayed 10 days. The service is on the whole 1st class, yet does fall down at times. We had an exceptional price for a Double Deluxe Room; however we were upgraded to a Suite. Amazingly we weren’t told we had been and it was never mentioned, we just happened to notice that it said Suite on the door. I thought this was nice as there wasn’t a big deal made of the upgrade. A nice touch. As we were in Paris Christmas day, we went out for lunch and a walk around a near deserted Paris. When we came back to the hotel the room had been tidied – which we didn’t expect for Xmas day, and they had left some chocolates, a small note wishing us a Merry Xmas along with a small gift bag which contained a sample of perfume from one of the local perfume shops. This was a very nice touch. The room was BIG, and when you consider Paris hotel rooms it was positively enormous! The room was lovely, nice towels, bathrobes, great big king bed, marble bathroom, a sitting area, desk area etc. We had lunch on our first day in Paris in the hotel. Lovely food, however, expensive verging on the point where I almost asked if it was a joke. We also had dinner in the hotel one night. The price was fair, yet the food was delicious. It’s a nice cosy atmosphere and the dinner service is very attentive - unlike the lunch service, when it is considerably quieter. The hotel is small, 25 or so rooms, so you are not bumping into other guests all the time. Being in the Vendome area it is ideally suited to the wonderful high end shopping - nice to see how the other half live, ha! I would highly recommend staying here. You won’t be disappointed.", "Date": "January 1, 2010"}, {"Ratings": {"Cleanliness": "5", "Overall": "5.0", "Rooms": "5", "Service": "5", "Location": "5"}, "AuthorLocation": "Brussels", "Title": "“beautiful hotel, excellent setting, lovely staff”", "Author": "Travelleralways2", "ReviewID": "UR49141343", "Content": "I stayed for one night for business and really liked the hotel a lot. I would use it again for personal travel. The staff were excellent. I had a large front facing room.", "Date": "November 13, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "3", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Tayport, Scotland", "Title": "“Paris is magical, Vendome is very nice too”", "Author": "gcarr2803", "ReviewID": "UR48472563", "Content": "Stayed 2 nights in a double deluxe. Arrival and check-in were very good (even shown through to the office to use their Internet connection when the PC for guests in the reception area wasn't working). Room was very nice. Had breakfast one day and it was fresh and very tasty - very relaxing as only 1 other table being used (unlike most places to eat in Paris where there is a tendency to cram a lot into a small space). All very relaxing. Staff were very friendly and approachable - very unlike the Paris stereotype (in fact this was true everywhere we went in Paris). Location is excellent and even though in the city centre it was quiet and peaceful. Paris itself was fabulous, too much t do, too little time. Even thought the unfriendly stereotype was busted in this trip, another one was not - its not a place you want to go to on a type budget - Paris is not a cheap place, but on th whole it is worth it!", "Date": "November 4, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Location": "5", "Rooms": "4"}, "AuthorLocation": "London, United Kingdom", "Title": "“Excellent location and luxurious hotel”", "Author": "Spuggers", "ReviewID": "UR47559016", "Content": "The hotel is a fabulous find for a stay in Paris. it is in a great location next to the Ritz and the Rue St Honore (great for shopping) and quite convenient for walking around Paris - which is easy to do to get to most of the areas. The hotel itself is almost perfect. The rooms are quite spacious (Deluxe level) and the bathrooms are in good condition. the staff are friendly and always willing to help. the hotel is fairly priced. It is not cheap, but you are getting value for money as it is a Small Luxury Hotel. You don't need to stay at one of the well known hotels to get a great experience. I felt other hotels would take you for granted, whereas this hotel seems very appreciative of your custom - and so they should in this economy. The recently refurbished dining room is very stylish and very comfortable. Breakfast is fresh. No real complaints I can think of...", "Date": "October 23, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Helsinki", "Title": "“small luxury hotel”", "Author": "mankubus", "ReviewID": "UR39357282", "Content": "good: 1. location is perfect, there is Ritz hotel in the same building. 2. not large but really cosy and finely designed room. 3. we've been having breakfast alone in the restaurant every day, that proved it was a small luxury hotel. 4. maids did their job good. bad: seems like the hotel is overpriced a bit, especially if you take crisis into account.", "Date": "August 31, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Location": "5", "Rooms": "5"}, "AuthorLocation": "bologna", "Title": "“fantastico”", "Author": "niklablack", "ReviewID": "UR37880780", "Content": "all superb, friendly personal, great luxury rooms, perfect service whole time, service in room non stop", "Date": "August 16, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "1", "Location": "5", "Rooms": "4"}, "AuthorLocation": "prague", "Title": "“Great location,beautiful deluxe suite”", "Author": "emma4646", "ReviewID": "UR33536473", "Content": "We stayed in a deluxe suite for a weekend with the 2 kids(2,10) in June. One week before arriving at the hotel,I noticed that the hotel had \"blocked\" a 1 night stay(650 euros) on our credit card: strange procedure,never happened to me before although I travel quite often! The suite was spacious and lovely.The ALL marble bathroom with separate toilet was exquisite and luxurious.There's also another toilet near the entrance of the suite.The dlx suite is actually 1 bedroom connected to a living room by a hallway. Our suite was ready when we arrived with a baby cot in the bedroom and a small bed in the living room for our daughter. The hotel is small but feels cozy. Although it's located near a street corner,the windows don't allow much noise to be heard.The staff there is great! They always smile and are ready to help with any requests. Obviously,the location cannot be beaten:on the Place Vendome! Another detail which I thought was odd: once I came home and checked my internet banking...noticed that the hotel had also blocked money when I checked in. I was pretty annoyed! I called the hotel to ask them to fax a letter to my credit card company and unblock the 2 amounts which they did graciously. Aside from the credit card incidents,I have no complaints about this lovely boutique hotel.", "Date": "June 30, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "4", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Edmonton", "Title": "“Wonderful x 10!!! Great Location, amazing staff and great room.”", "Author": "JeffreyJ123", "ReviewID": "UR17312184", "Content": "This was my third choice of places to stay in Paris. The other two were less money, but in the end, I thought that location would be key. The hotel experience started with the doorman and did not stop. The room was great, albeit a bit small by North American Standards. Well appointed. The staff was amazing. I had difficulty with my laptop and could not connect to the Internet. After a few minutes of their staff trying to get it to work, they offered me another computer to use. Sure enough it worked and I was on my way. The breakfast was a good selection for Continental Style and the fresh juice was very nice. Absolutely recommended. A few blocks for the Number 1 Metro line and great restaurants near by.", "Date": "June 28, 2008"}, {"Ratings": {"Service": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "4", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Newry", "Title": "“Lap of luxury in Gorgeous part of Paris!”", "Author": "FionaCC", "ReviewID": "UR16718508", "Content": "Absolutely gorgeous hotel situated in the heart of paris short walk to louvre etc. Gorgeous hotel lap of luxury, hotel restaurant with very fine food delicious! Quite expensive though but worth it for a special occasion. Around the corner from the Ritz and walking distance to Arc de Triompe etc.", "Date": "June 6, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "2", "Check in / front desk": "5", "Overall": "5.0", "Value": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Missouri", "Title": "“Ideal location and affordable luxury.”", "Author": "GrandmaG", "ReviewID": "UR13936598", "Content": "Hotel de Vendome spoiled us for future Paris trips. The location is within walking distance of many tourist sights and attractions. If not, the metro stop is just minutes away. Plus, if you take the Roissey Bus from CDG, it stops at the Opera Garnier which is an easy walk also. For our first trip to Paris, I wanted a traditional Parisian hotel and HdV fit the bill. We stayed in a double-deluxe room, which was extremely spacious and included a huge bathroom by big-city standards. The black-out drapes worked beautifully as we dealt with jet-lag, keeping out light and street noise. All staff members were attentive and helpful. But, it seemed, the doormen knew all! TIP: I strongly recommend Royal Madeleine for lunch or dinner. It's within easy walking distance. Also, we enjoyed nearby Chez Flottes for a relaxing breakfast.", "Date": "February 29, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Check in / front desk": "5", "Overall": "5.0", "Value": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Arlington, Virginia", "Title": "“Beautiful Hotel in a Beautiful City”", "Author": "Freespirit22206", "ReviewID": "UR13436294", "Content": "This was my first time in this beautiful city. I thoroughly loved this hotel. I was there for 9 nights in November. The weather was cool and comfortable - not too rainy. I was a solo traveler in need of some serenity time, so I wanted to stay somewhere comfortable and in a central location. (Luckily, I did considering I was there during the Metro strike.) I was able to walk to anywhere to all the arrondisemonts. The hotel is charming, and in classic French decor. The bathroom was spacious and extremely clean. Room service was impeccable as well. The hotel staff was very gracious and professional...cute too , i.e. 'Marcel' :-) I will definitely return!", "Date": "February 10, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "4", "Check in / front desk": "5", "Overall": "4.0", "Value": "5", "Rooms": "4"}, "AuthorLocation": "Dublin", "Title": "“Lovely Hotel in a great location”", "Author": "bspoll", "ReviewID": "UR8682083", "Content": "Stayed for one night in the Hotel de Vendome and couldn't have been happier with the location and the staff. Got a good rpice on Expedia and would love to go back again.", "Date": "September 9, 2007"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "Essex, UK", "Title": "“Excellent hotel”", "Author": "If_only", "ReviewID": "UR8429275", "Content": "My husband and I stayed at this hotel for our anniversary. We have been to Paris nine or ten times and whilst we have been very fortunate with our choice of hotels on each visit, we have rarely stayed at the same hotel twice, preferring to keep looking for that one hotel which meets all our requriements. Well at last we have found it! Three things really stood out for us: 1 Location - it was perfectly placed to make sightseeing in any direction easy. The Louve is only a few minutes away, ditto the Opera. The hotel is near the Opera and Tuilleries metro stations which means no tourist attraction is too difficult or too far to get to - same goes if you decide to walk as we do. 2 The staff - The most friendly hotel staff, they could not have been more helpful and polite and nothing was too much trouble. As soon as we walked through the door we were made to feel totally welcome and this continued throughout our stay. 3 The room - Both the bedroom and bathroom came off a small lobby area in which there was a wardrobe and mini bar. We had a standard room and the room was perfectly adequate for our requirements, it was beautifully decorated with those final touches which made it just that little bit more special. The bathroom was also more than adequate and beautifully decorate. We did get a peek into a larger room across the corridor and next time we may upgrade, if only for the fact that they faced the road and we are avid \"observers\" of what is going on outside - however it would depend on cost. The housekeeping was excellent, towels used early evening were changed whilst we were out so that in the morning we had another set of clean towels. Finally we both agreed that the bed was the most comfortable we have ever slept on - even better than our own at home and we had to really force ourselves out of it in the morning, especially after a long day walking the day before! In summary, this really is an hotel which should be tried, obviously our view is just that, our view, what another person may be looking for may not be what we look for, but if you are looking for polite staff, perfect location and comfortable rooms then this is for you. It is not a cheap hotel however, but for us it was really worth every penny.", "Date": "August 15, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "3", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Boston, Massachusetts", "Title": "“Luxurious hotel in a great location”", "Author": "TravelSimBoston", "ReviewID": "UR8419934", "Content": "My husband and I stayed at the small and beautiful Hotel de Vendome for 9 nights in August. This was our first visit to Paris, and we had a hard time deciding where to stay, but we were very pleased that we settled on this hotel. Although our room was small (we booked the hotel's smallest room) it was very clean and quite luxurious. The marble bathroom was a good size with a soaking tub (and a bidet!). All the lights were controlled by a central electronic box which worked very well for us. The staff was very attentive and helped us book restaurant reservations and confirm our transportation arrangements (we don't speak French). One day when it rained heavily, the staff gladly provided us with umbrellas for the day. The hotel is located right in the heart of Paris, very close to the Louvre. We were able to walk to most places we wanted to visit. If you like walking, you can easily walk to the Champs-Elysees and the Arc de Triomphe from the hotel. It's also located very close to many excellent shops and restaurants. All in all, a wonderful hotel in a very beautiful city!", "Date": "August 14, 2007"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Check in / front desk": "4", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "", "Title": "“excellent stay”", "Author": "linlees", "ReviewID": "UR7848399", "Content": "Hotel was great value on expedia and we were very pleased with our experince - stayed 4 nts. Mentioned on our bkg that it was our anniversary & there were Rose petals on the bed - bottle of bollinger delivered to our room - really special touches . Concierge booked a restaurant for 1st nt ( Le sens) which necessitated a taxi & was absolutely appalling -s oa big disappointment! avoid this restaurant at all costs!!) Had lunch at Le cinq - AMAZING !!! service , food, atmosphere was the BEST!. Ate at Senderens - expensive and very good but nowhere near as good as Le cinq!. Hotel is walking distance from the Louvre and location is very convenient - lots of local cafes and restaurants - concierge a bit disappointing - they did not seem to know the good restaurants nearby. Would definitely recommmend the hotel - small , intimate, nicely furnished ( happy hour in the bar - 2 for 1 drinks - check this out ! they make a great cosmo but it was not well publicised - we found out by chance!) Enjoy!", "Date": "June 14, 2007"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "England", "Title": "“Great Hotel”", "Author": "Jason66", "ReviewID": "UR6724517", "Content": "We stayed in this small Hotel in January and loved it. It was extremely quiet during our three night stay Friday - Monday. The room was great and spacious with everything you could need. The location is perfect - you are a three minute walk from the Metro but we did not use it as you could walk to all the major sites very easily. The Louvre is five minutes walk max. We did not use the restaurant (It is very cosy and cute) but we decided to eat elsewhere. One thing we did note - Breakfast is 28 Euros - Stop at any cafe, and there are many, and its breakfast for about 8 Euros - We ate breakfast at the Cafe! The hotel staff we very friendly and helped book our meals in Local restaurants - they called and made the reservation for us! If you like shopping - especially expensive shopping then you will be in heaven - all the major shops are just outside the hotel entrance..... We would go back.", "Date": "February 1, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "4", "Overall": "4.0", "Value": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Asia", "Title": "“Luxury in excellent location”", "Author": "hearts_in_asia", "ReviewID": "UR6551326", "Content": "We stayed at Hotel de Vendome for 3 nights. The location was perfect, close to shopping, the Opera, the Concorde and the Louvre. Champse Lysee was still walking distance but as it was freezing during our stay, we liked taking the metro better. The hotel itself was lovely, clean and the staff were always professional. We booked into the classic double (the least expensive), so it wasn't huge but still big enough for Paris. The only criticism I have is that we stayed on the top floor, and the room only had one window and insufficient artificial lighting, so it was quite dark in the room. The highlight was definitely the marble bathroom, with how cold it was outside it was ideal to take long warm baths after the long days out. The bathroom was huge and gorgeous! All in all, we would definitelly stay there again, but then we had a special rate and not the 460 Euro (!!) a night as advertised on the web.", "Date": "January 4, 2007"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Check in / front desk": "4", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "warrington, england", "Title": "“A delightful little hotel”", "Author": "smilingtravellers", "ReviewID": "UR6357956", "Content": "We stayed here for one night and it was a fantastic experience. The staff were excellent, nothing was too much trouble and the room was beautiful. The location of the hotel was perfect, handy for shopping and the main sights. We spent an evening on the Bateau Parisienne and I would highly recommend this to anybody looking for a romantic evening in Paris. The boat was decorated for Christmas and looked fantastic, the food was exceptional as was the service and entertainment. We booked this through the hotel. All in all a wonderful couple of days away.", "Date": "December 10, 2006"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Philadelphia", "Title": "“Perfect hotel in a perfect location”", "Author": "VanGogh2", "ReviewID": "UR6314614", "Content": "We have stayed at this gem of a hotel 4 times, most recently in November, '06. The rooms are gorgeous and spacious. The small bar and dining room warm and inviting. The front desk staff doubles as concierges and have gotten me opera tickets as well as being responsible for making sure two suitcases were shipped on to an hotel in Madrid. We absolutely love staying here and adore the location right in the middle of our favorite part of Paris.", "Date": "December 1, 2006"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "3", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Toronto ,Ontario", "Title": "“Fantastic boutique hotel in a superb location.”", "Author": "multilingual", "ReviewID": "UR6104646", "Content": "We didn't know what to expect however upon our arrival we knew it would be excellent. First of all a warning: the candid photos posted on this site for this hotel are NOT CORRECT and should be removed. The photos posted here are of another lesser hotel and do not come close to the actual hotel. For a true representation see the \"Hotel Photos\" section. The Hotel de Vendome is situated on the Place de Vendome in Paris. An excellent location in the 1st arrondissment in the somewhat swanky right bank. A short walk across the Jardin des Tuilieres and you are in the left bank. You are central to everything and the area itself is exceptional. The Hotel is luxurious from the small lobby to the very well appointed rooms. Linens, the bathroom and overall comfort were exceptional. You got the sense of true quality and luxury. Will definitely book this hotel again and it is now our first choice whenever we are in Paris. Highly recommended.", "Date": "November 10, 2006"}, {"Ratings": {"Cleanliness": "5", "Overall": "5.0", "Value": "5", "Service": "5", "Rooms": "5"}, "AuthorLocation": "Cumbria", "Title": "“Perfect in every way”", "Author": "MutleyCumbria", "ReviewID": "UR5476042", "Content": "I decided to push the boat out and suprise my wife with a short break in Paris, after an agonising (and prolonged) look at the multitude of hotels on offer I booked a junior suite at The Vendome. On arrival we were met by two very pleasant and extremely helpful receptionists who booked us in with a minimum of fuss, showed us to a wonderful DELUXE suite, a free upgrade, explained the electronic gizmo's and left us to it. On returning that evening we found the bed covered in fresh rose petals and a complimentary bottle of champagne in the cooler. The room was spotlessly clean, towels changed twice a day, bed linen every day and chocolates on the pillow every evening. The location was perfect 5 minutes from Place de la Concorde and the Louvre. The Bar and Restaurant are small but welcoming. We have nothing but praise for this hotel and its wonderful staff. Yes its on the pricey side but come on guys if you want to earn those much sought after brownie points take her to number 1 Place Vendome and reap the rewards.", "Date": "July 17, 2006"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Pawleys Island, South Carolina", "Title": "“Luxurious boutique hotel”", "Author": "Travelgalle", "ReviewID": "UR5467056", "Content": "This hotel is flawless in its beauty. The rooms are beautifully decorated and above average in size. There are marble baths with nice deep tubs. The room we stayed in was very quiet considering our room faced the main street in front of the hotel. The closet space was large. Beware the mini bar prices, my husband spent approx $40.00 on three cokes.The one drawback we experienced was that the staff knew very little english. This made directions or suggestions for restaurants difficult. The location was great, with proximity to the Lourve, Champes Elysees and wonderlul shopping. For easy transportation use the Bataboat along the Seine, which takes you to all the sights and is inexpensive. A nearby restaurant which was fairly inexpensive and had wonderful food was La Fregate at 1, rue du Bac. Overall it was a great experience.", "Date": "July 14, 2006"}, {"Ratings": {"Cleanliness": "5", "Overall": "5.0", "Value": "5", "Service": "5", "Rooms": "5"}, "AuthorLocation": "Ottawa, Canada", "Title": "“Superb and private”", "Author": "A TripAdvisor Member", "ReviewID": "UR5355605", "Content": "A flawless suite and exceptional service equalled a great weekend to remember. For my wife's first visit to Paris I booked a full suite, and she was swept away by the history (the building housed the only embassy Texas ever opened), the exclusivity of the property, and by the elegance and beauty of the decor. Located right on Place Vendome, it is two blocks from the Louvre and the nearest Metro station. Due to the age of the building, there is only one small lift and it is round in order to fit up the space bewteen the stairs. Suites come with security cameras to allow you to view visitors at the door, and with two bathrooms and two televisions. Staff were ever so helpful and efficient, and fresh roses adorned the room each day. We would definitely return to the Hotel de Vendome.", "Date": "June 17, 2006"}], "HotelInfo": {"Name": "Hotel de Vendome", "HotelURL": "/ShowUserReviews-g187147-d190671-Reviews-Hotel_de_Vendome-Paris_Ile_de_France.html", "Price": "$400 - $1,22", "Address": "<address class=\"addressReset\"> <span rel=\"v:address\"> <span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">1 Place Vendome</span>, <span class=\"locality\"><span property=\"v:postal-code\">75001</span> <span property=\"v:locality\">Paris</span></span>, <span class=\"country-name\" property=\"v:country-name\">France</span> </span> </span> </address>", "HotelID": "2514856", "ImgURL": "http://media-cdn.tripadvisor.com/media/photo-s/01/f1/88/63/hotel-de-vendome-s-restaurant.jpg"}}