{"Reviews": [{"Ratings": {"Overall": "2.0"}, "AuthorLocation": "Juneau, Alaska", "Title": "“It's Right For Some, and Very Wrong for Others”", "Author": "rikerd", "ReviewID": "UR78888414", "Content": "I've stayed at the Allerton on 3 occassons, twice on business on once while on vacation. It's an experience you need to take with an open mind. The visitor's area is clean, safe, affordable, and in a wonderful location. Other parts of the facility help the less fortunate. Don't leave valuables in your room, and don't get too upset if you need to buy your own toilet paper, or a light bulb. The TV was old, the gas stove didn't work, and yes, they turn the heat and hot water off at night, and back on around 5:00 in the morning. I've stayed for as long as a month at a time, and quickly became part of the eclectic group. This place serves a purpose. Be nice to the staff, especially the very large guard at the door.", "Date": "September 9, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Pennsylvania", "Title": "“The Allerton Hotel is a GREAT place to stay in NYC”", "Author": "grc102", "ReviewID": "UR26534683", "Content": "We stayed at the Allerton on several occasions and hope to stay there again, I heard it will be reopening and hope that is true. The rooms were clean, well stocked and the staff were excellent, location is great. I have nothing but GOOD things to say about my many stays there.", "Date": "March 20, 2009"}, {"Ratings": {"Overall": "1.0"}, "AuthorLocation": "New York City, New York", "Title": "“I live across the street from the Allerton..”", "Author": "goldfisharenice", "ReviewID": "UR6543964", "Content": "I live across the street from the Allerton. It's not a hotel, it's a homeless shelter. Why it has a website and all is beyond me..", "Date": "January 2, 2007"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Business service (e.g., internet access)": "1", "Check in / front desk": "1", "Overall": "1.0", "Value": "1", "Rooms": "1", "Location": "5"}, "AuthorLocation": "New York City, New York", "Title": "“No Way - homeless shelter”", "Author": "ChelseaNYC", "ReviewID": "UR5954386", "Content": "Chelsea is a great neighborhood with multi-million dollar homes within steps of this hotel. Unfortunately, this is indeed a Welfare/homeless shelter -- I live one block away and cringe each time I must walk by this hotel based on the caliber of those who live there and hang out on the corner. This is not a place to spend a vacation -- spend more and get a true hotel.", "Date": "October 14, 2006"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Glasgow", "Title": "“The hotel my father saw..”", "Author": "A TripAdvisor Member", "ReviewID": "UR5405526", "Content": "Better than what I'm used to. Came over from Glasgow after a lot of walking. Arrived 13th July 2005. Thought the standards were pretty high - better then my midden back home! Had a wee machine in the room for pressing your crimpoline. Would recomend it to all my brothers.", "Date": "June 28, 2006"}, {"Ratings": {"Overall": "1.0"}, "AuthorLocation": "ct", "Title": "“not a hotel.... a SHELTER”", "Author": "A TripAdvisor Member", "ReviewID": "UR5342954", "Content": "this hotel is basically a homeless shelter. upon entering the building you see the clerk sitting behind a bulletproof window. outside of the building were several homeless-looking people who were waiting to also go inside. i am usually not one to judge by looks, but these people looked as if they were drunk, high, and penniless. have you tried looking for pictures of this so-called Allerton \"hotel\"? did you find any? NO- because it is a homeless shelter. who wants to take pictures of that??? DO NOT STAY HERE.", "Date": "June 14, 2006"}, {"Ratings": {"Cleanliness": "3", "Overall": "2.0", "Value": "3", "Service": "2", "Rooms": "2"}, "AuthorLocation": "Sligo, Ireland", "Title": "“Cheap but cold!!!!”", "Author": "DMD75", "ReviewID": "UR4386232", "Content": "I spent a few days in NY at the start on December and stayed at the Allerton Hotel/Hostel.Its not the most glamerous place to stay but its clean and the staff are nice but don't always pass on messages. The biggest problem I found was that NY in Decenber is cold and the heating was turned off at night and it was extremely cold!!! The location is not too bad and there is a lovely cafe over and up 1 block. Not a place to stay if you like comfort but okay if your on a budget.Also security is on the main entrance but the locks on the bedroom doors are poor to say the least.", "Date": "January 25, 2006"}, {"Ratings": {"Overall": "3.0"}, "AuthorLocation": "Rome", "Title": "“Simple but pretty clean and cheap”", "Author": "smartie_p", "ReviewID": "UR2241709", "Content": "Nothing special, but pretty clean and cheap. To me, it's the best place for young travellers because of its good position inside Manhattan and its very good rates. Nothing special about the staff but, once again, at this price you can't ask much better.", "Date": "July 1, 2004"}, {"Ratings": {"Overall": "3.0"}, "AuthorLocation": "London, UK", "Title": "“basic but clean, good value and decent people”", "Author": "A TripAdvisor Member", "ReviewID": "UR1544148", "Content": "I am picky - have even made a whole group of people move conference hotel in the past, so am dismayed at the negative description of the Allerton in another review. It is in an excellent position, the rooms are clean if spartan and the staff are friendly - if you are! There are 3 sections, one of which is for visitors and yes the other sections house people in less fortunate circumstances. It is totally hassle free and if my tourist dollars help a few people back into a regular life, then that's great. If you take the 'cheap n cheerful' view you'll go back there again and again.", "Date": "January 9, 2004"}, {"Ratings": {"Overall": "2.0"}, "AuthorLocation": "", "Title": "“The Allerton is really good value!”", "Author": "A TripAdvisor Member", "ReviewID": "UR1543936", "Content": "Well I was there in September from the UK with my 73 year old mum who had never been to the USA before and she thought it was fine - and, no, that's not because we Brits are used to crappy places. For Manhatten it provided an excellent base for getting around in a clean, safe and extremely good value setting. My sister has also stayed there twice and I had stayed there once before and think it is 'characterful', even the food van that parks outside and the visiting social worker. Yes, we could have paid more and stayed in the Holiday Inn, but there's plenty of those in London if we wanted a bland experience. The Big Cup cafe opposite and the lovely East of Eighth restaurant nearby are also great places.", "Date": "January 9, 2004"}, {"Ratings": {"Overall": "2.0"}, "AuthorLocation": "Chicago, IL", "Title": "“ALLERTON a dump?”", "Author": "A TripAdvisor Member", "ReviewID": "UR1518696", "Content": "I visited on 5th to 10th December, 2003. Hotel appears to have a fresh exterior, etc. Things are looking up here and in the whole neighborhood. Several new restaurants have opened and store qualities are rising. Right on the corner of 8th Ave (One-way North-bound to Penn Sta) Bus #20 and short block from the tube station for trains 1 and 9 that runs from way up North to Battery Pk. 7th Ave is So. bound from Penn Sta. VERY handy situation but not for the very fussy.", "Date": "December 15, 2003"}], "HotelInfo": {"Name": "Allerton", "HotelURL": "/ShowUserReviews-g60763-d93384-Reviews-Allerton-New_York_City_New_York.html", "Price": "$87 - $129*", "Address": "<address class=\"addressReset\"> <span rel=\"v:address\"> <span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">302 West 22nd Street</span>, <span class=\"locality\"><span property=\"v:locality\">New York City</span>, <span property=\"v:region\">NY</span> <span property=\"v:postal-code\">10011</span></span> </span> </span> </address>", "HotelID": "2514475", "ImgURL": "http://media-cdn.tripadvisor.com/media/photo-s/01/d9/bd/0d/allerton.jpg"}}