{"Reviews": [{"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Vienna, Virginia", "Title": "“Excellent Hotel”", "Author": "fun2travel63", "ReviewID": "UR127515258", "Content": "My daughter and I just stayed at this wonderful hotel. The room was nicely decorated and had nice extra touches. The hotel is small but well thought out.The staff were friendly and spoke perfect English. They were very willing to help with making reservations and calling a taxi for us. The location is excellent. It is in the heart of St Germain and close to several metro stops. We will stay here again.", "Date": "April 9, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Location": "5", "Rooms": "4"}, "AuthorLocation": "", "Title": "“Tastefully appointed, fantastic location”", "Author": "Velvetgemini", "ReviewID": "UR127434704", "Content": "Great location in St Germain des Pres, around the corner from Cafe de Flore and the Latin Quarter. The hotel is in hhe ptocess of being renovated. My room was quite small, but very tastefully appointed, which made up for the lack of size to a large degree. Staff was very helpful as well. Free wifi works well. Only downside is the breakfast, which was a good buffet but kind of a ripoff at over 20 euros. Would stay there again, but would eat at a bistro or cafe in the mornings instead, as there are great bakeries at rue du Buci a block away.", "Date": "April 7, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Istanbul, Turkey", "Title": "“perfect place to enjoy paris”", "Author": "nilkalak", "ReviewID": "UR127256847", "Content": "Good location, Nice clean rooms, Easy internet access, Friendly staff Very pleasant overall", "Date": "April 4, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "4.0", "Value": "2", "Sleep Quality": "3", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Riyadh, Saudi Arabia", "Title": "“2 single beds pushed together does not make a double...”", "Author": "sandy_abstentia", "ReviewID": "UR125658494", "Content": "...especially when they slide apart in the night and you start to fall in to the gap. the mattresses themselves are darn good. Just not doubles. Location, of course, is brilliant. Rooms (quite a bit) bigger (and better arranged) than many in Paris; modern and a bit self-consciously stylish, bath and shower big enough to use and worked well. Pricey though. If you can make do with (quite a bit) smaller rooms and money matters but you still want something boutiquey and to be able to walk everywhere, the Hotel Verneuil in just about as good a location a few 100 metres away, with a more traditional decor is worth thinking about. Also you get a free laugh every morning at the Madison - assuming you don't pay the 25 euros a head for breakfast and go and have a better brekkie for half the price in any number of places on the door step.", "Date": "March 5, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "London, United Kingdom", "Title": "“excellent”", "Author": "callingitlikeitis", "ReviewID": "UR124915070", "Content": "Yes, it's a good hotel in a good location: if you can get a good price, don't hesitate. Didn't like the decor much, though.", "Date": "February 20, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Lausanne, Switzerland", "Title": "“Location good, staff great”", "Author": "pwarne", "ReviewID": "UR124797640", "Content": "We have been looking hard for a Paris hotel we would like to go back to, and this is it. Clean rooms ( a little compact), great view of St German-des-Près, the location couldn't be better for us. The staff are attentive and make you feel they actually like having you there. A keeper.", "Date": "February 19, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Monterrey, Mexico", "Title": "“Excellent Experience”", "Author": "Virgilio1961", "ReviewID": "UR124262964", "Content": "Great Place, Great Vicinity, Great Atmosphere. Two Metro stations at walking distance.", "Date": "February 7, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "4"}, "AuthorLocation": "essex", "Title": "“Very Welcoming”", "Author": "lyndaessex", "ReviewID": "UR123112985", "Content": "My husband took me to Paris for my birthday and the hotel was perfect. Lovely view overlooking the church, in walking distance of everything, excellent breakfast which was included in the price, free Wi Fi and very helpful, charming staff. Room was a little small but we were never in it except to sleep. Would certainly stay there again.", "Date": "January 15, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Pittsburgh, Pennsylvania", "Title": "“Wonderful property”", "Author": "EconSean", "ReviewID": "UR120571472", "Content": "I stayed at the Hotel Le Madison from Nov. 8 through 11, and highly recommend this hotel. I stayed in room 31, which overlooked the interior courtyard. No view, of course, but exceptionally quiet (which is most important to me). The room was small, which may come as a shock to visitors from the US who have never been to Europe before. That said, it was very nicely decorated and quite clean. I must say, the bed was the most comfortable I have slept on in a hotel. The staff were welcoming, friendly, and helpful throughout my stay. You are within a few feet of Metro line 4, and a block or so from line 10, a bus stop is right outside the front door, and the tourist bus stop is just a few feet away too. Cannot get much more convenient. To top it off, Rue de Buci is less than 5 minutes away by foot, with many great food options there I have been to Paris many times, stayed in many hotels, and this is by far my favorite; I will definitely stay here again during future trips.", "Date": "November 14, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Plano, Texas", "Title": "“Homey and wonderful!”", "Author": "Suze912", "ReviewID": "UR119941858", "Content": "It was my first time to Paris and I was concerned about my lack of Francais, and the perceived snootiness of the French...I found NONE of that in Paris and certainly none at the Madison Hotel! The lobby and salon took my breath away. Our room on the 7th floor, while small by USA standards, was beautiful in its dramatic decorating and twinkly ceiling lights. At the end of our four-day stay, I noticed that my suitcase was ripping open. I asked at the desk if they had any kind of strapping tape. The desk clerk looked around, apologizing, even looked in the bagerie and couldn't find any...he later located some and brought it to me at breakfast. And breakfast! Two wonderful ladies working there took excellent care of our large group when we gathered there very early before a tour of Paris. When my husband and I left for the airport, our last words were...\"See you next time!\"", "Date": "October 31, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "San Jose, California", "Title": "“Perfect French Hotel at resonable price.”", "Author": "Trisha C", "ReviewID": "UR119571173", "Content": "We just got back from our quick trip to France last night. Thanks to tripadvisor.com I was able to narrow down hotels in our price range. I was encouraged to book this hotel because of all the positive reviews and pleasant appearance of the hotel. We thoroughly enjoyed our stay at the Madison Hotel. The staff was very friendly and courteous and most spoke English which was very helpful. The beds were so comfortable with down pillows and down comforters!! Our travel agent accidently booked us in a standard room with a single double bed. Being that we are not a couple, the gentleman at the front desk was very understanding and put us in a room with two separate beds. The dining room and complimentary breakfast was nice. If you are up to walking a half hour to the Eiffel Tower, then I would say the Eiffel Tower is in walking distance. It is probably about a mile to a mile in a half away. But the walk is pleasant. The hotel is in a picturesque French neighbor hood with lots of little shops up and down the street. Our room had a great view of the St. Germain chapel from our window. Hope to return one day to stay longer than our two short nights we stayed this week. Overall, nice experience! :)", "Date": "October 21, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "3", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "london,england", "Title": "“A classy hotel with a great location!”", "Author": "rkahn", "ReviewID": "UR119519099", "Content": "I booked this Hotel for a 2 night stay with my mother. This is a beautifully renovated hotel located right at St Germain des Pres. Very convenient for taxis, metro and buses and well located to so many attractions. We received a very warm welcome, and the staff was helpful and polite at all times. Our room was 'Privilegie', which meant larger than than the standard. It was very tastefully appointed. Very confortable bed and linens, lovely brand new bathrooms and really nice soaps, creams etc. The room was very quiet, facing the 'courtyard' (no view) but I think the front facing rooms would be quiet as well due to the double glazing. We ordered a continental breakfast to our room. Very good and timely service. I would return again.", "Date": "October 20, 2011"}, {"Ratings": {"Location": "5", "Overall": "5.0", "Value": "4", "Service": "5", "Rooms": "5"}, "AuthorLocation": "Jacksonville, Florida", "Title": "“Surprise birthday gift for husband”", "Author": "cultureseeker10131", "ReviewID": "UR118071996", "Content": "Madison Hotel is centrally located for just about everything you could want to do in Paris. The St. Germain Metro stop is practically at the front door and a few blocks away you can walk along the Seine and head to Notre Dame. Hotel staff is very helpful. They made several dinner reservations for us as my French dates back to college days. The double room was not spacious but was beautifully appointed including separate shower/sink and toilet rooms and a view of the boulevard. Black-out curtains allowed us to sleep until 9:30 (us early birds usually get up with the sun). Champagne and macaroons awaited us per my request and we had a lovely time. Will definitely stay there again.", "Date": "September 13, 2011"}, {"Ratings": {"Location": "5", "Overall": "5.0", "Value": "5", "Service": "5", "Rooms": "5"}, "AuthorLocation": "Vancouver, Canada", "Title": "“Loved this hotel.”", "Author": "joymoot", "ReviewID": "UR118028449", "Content": "Despite Paris being rainy and cool, Madison Hotel was a perfect refuge in a fantastic area. The staff were incredibly attentive and polite. They called us a car (a nice one) to get to the airport, and there were always enough umbrellas for the guests. The hotel was super clean - fair warning - our room had a euro style shower (no curtain) so the water would get everywhere. It was so nice (and smart on their part) to have complimentary slippers. It was located in a fantastic area. Venturing behind the hotel brought you a packed restaurant area - it was really hopping at night. You couldn't be more convenient to the subways, and even though we faced St Germain, literally right over entrance to the hotel - we never heard a thing. The windows made it virtually soundproof. They do have couple of loud neighbors, but what can you do? We will stay there again for sure, it was everything we wanted in a hotel and we didn't want to leave. Merci!", "Date": "September 12, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Mexico City, Mexico", "Title": "“We received more than expected.”", "Author": "Schaechter J", "ReviewID": "UR117141392", "Content": "Your hotel was recommended by friends who had stayed there on several occasions. We are familiar with Paris, since we had visited the city many times through the years (on one occasion even rented a flat for a month). The price was above what we usually spend on accommodations, but amply justified by the excellent breakfast, very courteous and helpful personnel and location, as you can see by the \"Excellent\" ratings we are granting to your poll. We are amply recommending your hotel to all of our friends, warning those who have not traveled to Paris of the relatively small rooms in the city. Thank you for making our stay enjoyable.", "Date": "August 23, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "4", "Service": "5"}, "AuthorLocation": "New York City, New York", "Title": "“Awesome boutique hotel in great neighborhood”", "Author": "Sigalit3000", "ReviewID": "UR115764081", "Content": "This is my first TripAdvisor review. The site has been so helpful to me in finding hotels and I want to contribute as well. I stayed at the Madison Hotel for 7 nights when I was in Paris for a business meeting in June, and had a really great stay. I was in a deluxe room facing the street on the 7th floor. Room and bathroom/shower are smaller than what we are all used to in other parts of the world, but that's just how it is in Paris. After I settled in and mentally adjusted to how small it is, I was actually super-comfortable and really loved the room. The hotel and the room are very clean, all rooms have been recently renovated and are stylish and modern. Maid service was great. Staff is friendly, helpful, and speaks great English. New flatscreen TV in the room worked great and I really liked the showerhead with all the different light options. Central air conditioning there actually works and even though I was facing the street I didn't have any issues with noise at all and slept great. Many people at my business meeting had various complaints about their hotels, but I had nothing but good things to say about my hotel. And of course, the location really can't be beat. St. Germain des Pres is a vibrant and lively neighborhood with great shops, restaurants, and nightlife all around and close to transportation and everything else. As a solo female traveler I always felt completely safe walking around even late at night. Really great place.", "Date": "July 25, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Boston, Massachusetts", "Title": "“Perfect in every way”", "Author": "mp1563", "ReviewID": "UR115396596", "Content": "Our stay could not have been better, we arrived in the early afternoon to our room ready. it was small and comfortable, with a great clean bathroom, staff was very helpful and the neighborhood perfect. I think the ideal location to spend a week in Paris.", "Date": "July 15, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "3", "Service": "5"}, "AuthorLocation": "Cambridge, Massachusetts", "Title": "“Wonderful staff, great location\"”", "Author": "JudyKLB", "ReviewID": "UR114873287", "Content": "June in Paris can be hectic and crowded so ending the day in a quiet, peaceful setting is very important. This hotel is very well situated and impeccably clean. But mostly the staff at the desk, Jean Charles, Christian and Caroline are professional, knowledgeable and very helpful. Lovely visit with my daughter....will e back with the manfolk.", "Date": "June 29, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Toronto", "Title": "“Great hotel, perfect location”", "Author": "Nexi1", "ReviewID": "UR114230929", "Content": "The Madison Hotel is in an ideal location, on boul. St. Germain de Pres across from the Church. Metro and On/Off bus are within a block. Hundreds of cafes, restaurants and stores are within blocks. Five/ten minute walk to the Louvre and Musee d'Orsay. The rooms are very comfortable, free Wi-Fi and very helpful front desk staff.", "Date": "June 18, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Carmel Valley", "Title": "“great location and value...hip”", "Author": "sharken", "ReviewID": "UR113208929", "Content": "After a lengthy search on the internet for a reasonably priced hotel near St .Germaine de Pres we discovered this amazing hip hotel. Very clean, modern, quiet, convenient and ...what a great breakfast! (Included in our price). Everything you could want for breakfast including fresh squeezed OJ. We'd definitely recommend this to friends and stay here again ourselves.", "Date": "June 13, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "North Fort Myers, Florida", "Title": "“An Oasis of Peace and Quiet Amidst the Parisian Bustle”", "Author": "grusleucogeranus", "ReviewID": "UR113092020", "Content": "My wife and I recently returned from a ten-day trip to Paris (our fourteenth) where we stayed, for the first time, at the Hotel Madison in the city's Sixth Arrondissement. Despite having had previous pleasurable stays at other upscale Parisian hotels, including l'Hotel and Relais Christine, we decided to try the Madison because of its recently completed renovation and, for us, ideal location proximate to the Eglise Saint-Germain-des-Pres and the Saint-Germain Metro station literally right outside the hotel's entrance. From the moment when we first arrived at the Madison until the early morning of our departure, my wife and I were positively overwhelmed by the sincere and caring attitude of the entire staff, from the Front Desk personnel to the delightful young ladies who were in attendance in the dining room throughout the breakfast hours. There was absolutely nothing that we requested, no matter how insignificant or important, that was not addressed immediately, and always with courtesy, aplomb, and a warm and endearing smile. The hotel itself, which is immaculate and impeccably maintained, is most pleasant indeed, its now tastefully renovated and redecorated work completed, and exudes a combination of warmth, comfort, and charm. The dining area, where breakfast is served, is especially bright, airy and appealing. \"Exceptional\" and \"sumptuous\" are the words that my wife and I assign to the breakfast meal, an extensive buffet of eggs, meats, cheeses, fruits, juices, rolls, breads, yogurts,cereals, preserves, hot and cold beverages, etc. ... and as suggested previously, attended to by a staff of positively charming and incredibly attentive, over-the-top customer-focused young waitstaff. Our room, which was in the rear of the hotel and overlooked the courtyard, provided us with something we had never experienced on any of our previous stays in Paris ... absolute and total QUIET!! Throughout our entire ten day stay at the Hotel Madison did we hear ANYTHING at all in the way of intrusive noise ... either from within, nor external to the hotel. In this regard, the Madison is a true haven ... an oasis of peace, if you will, amid the bustle and cacophony of the city's Sixth Arrondissement. And what can one say of the location except that it is among the best situated and most accessible that Paris has to offer. Nearby to internationally renowned cafes, restaurants, designers and chocolatiers, close by the tumult of the Buci area scene, a scant few minutes away from the contrasting serenity of Luxembourg Gardens, the at-your-front-door Paris Metro station and Line #4, which provides easy access to the entire city, Hotel Madison is ideally positioned to explore the area on foot, or to quickly be transported by Metro to the entire city and the environs beyond. In conclusion, my wife and I feel that, in the Hotel Madison, we have discovered Paris's IDEAL home-away-from-home, and intend to make it our Parisian address on every one of our future visits to the city. And why not? Simply put, it is the best of the very best!!", "Date": "June 13, 2011"}, {"Ratings": {"Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Moscow, Russia", "Title": "“well-designed rooms, good location, great staff”", "Author": "stanMoscow", "ReviewID": "UR108207355", "Content": "i liked the place a lot. the only unpleasant thing was the fact that the room was made up even after i left a \"dont disturb\" sign - i personally dont like this sign to be not respected, but I'm sure for many it is not important at all. all the other aspects were very good - the staff is very attentive and friendly, the rooms are well-designed and in every small thing you see smth special, you see that people really tried to make it a not-just-another-standard-hotel definitely recommended", "Date": "May 14, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "3", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Sydney", "Title": "“Great Location - Perfect Parisian getaway”", "Author": "PaulPSydney", "ReviewID": "UR101452045", "Content": "Spent 3 nights at this hotel in the middle of March with my wife, business partner and his wife. We both upgraded to modern rooms. It cost 330 Euro a night including breakfast. A little bit expensive but the upgrade was worth it. We were both on the first floor, rooms 15 & 16 and looked straight out onto St Germain. The rooms were excellent, especially for Paris, good size modern bathrooms and with the window closed no noise from the main road. Check in was good, were welcomed by a lovely lady at reception and every time we went there to make an enquiry, nothing was a problem. Again very good for Paris. Buffet breakfast was nice and we were able to order omlettes or eggs freshly cooked. Wi Fi was free. Location was the best. Have been to Paris on 3 other occassions and have stayed previously at Opera and Champs Elyesee areas. The difference with this area is that you really feel like you are in Paris. Lovely little coffee shops and restaurants in cobble stoned alley ways and boutique shopping around every corner. A great area to go for a walk and to get lost.", "Date": "March 24, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "4", "Overall": "1.0", "Value": "2", "Sleep Quality": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "New Braunfels, Texas", "Title": "“The poor service from the Hotel Madison spoiled a wonderful time in Paris”", "Author": "EuropeTraveler123", "ReviewID": "UR97652674", "Content": "We were enjoying our stay at the Hotel Madison until the last day of our stay when we realized a terrible mistake...our travel agent had accidentally booked us a night short and we had nowhere to stay! I admit that this was our travel agent's fault but the disdain with which we were treated by the staff was unacceptable. We arrived from a day of sightseeing to the hotel. The man at the front desk asked which rooms we were staying in and when we answered in the affirmative told us that we were staying there no longer. He had been forced to turn away the couple that would have had one of our rooms. My children were crying in the lobby as he rudely told us to vacate the premises and that he been informed by the maids that we had not yet packed are bags and possibly thought we had another night. What idiot would ignore them and then have the nerve to be a complete jerk in front of my wife and kids. My family and I were forced to stay in a 3 star hotel down the road and experienced far better service there than we did here. I would not stay in the Hotel Madison again if my life depended on it!", "Date": "February 22, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "London, United Kingdom", "Title": "“Brilliant all round”", "Author": "willowschool", "ReviewID": "UR85940456", "Content": "We stayed for 2 nights at this excellent hotel. Beautifully presented 'quirky' rooms with all the amenities you could want! Location was superb, just paces from the metro. Staff, even during a computer melt maintained their humour. Good English is spoken, an asset to those Brits who do not speak good French. Locality great for restaurants.", "Date": "November 4, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "2.0", "Value": "2", "Sleep Quality": "1", "Rooms": "2", "Location": "5"}, "AuthorLocation": "Jersey", "Title": "“Not a Boutique Hotel on floors 2 & 3”", "Author": "HelenCI", "ReviewID": "UR78875122", "Content": "Booked this hotel as I knew the location & it’s advertised as a refurbished ‘boutique’ hotel completed in May 2010, good reviews, it looked to fit the bill perfectly. Checked in not disappointed so far, at the room & my heart sank this was not the light bright welcoming boutique hotel, I had just checked in to. - The décor was old and traditional, a dark cheerless room. All walls covered in dark green colour with little yellow diamonds & traditional furniture. Not recently refurbished –it looks like none have on the 2nd & 3rd floors (see photo’s marked `not boutique`) so beware. - I booked a single as it advertised a double bed, it wasn’t - more a ¾ bed, it seemed low & was v. uncomfortable (cheap). I had asked if the hotel was fully booked, the receptionist looked surprised & said it was and ‘you have a double bed’! I would have gladly upgraded. This room spoilt the stay, not that I would have booked this in the first place had I known! (There was no option to book a single deluxe, but wonder if there are singles on the refurbished floors) - It was close to the metro a +, so assume the low deep rumbling sound I could hear was exactly that. Went with the air con fans outside the window. Generally noisy. - Bathroom has a small shower you’ll have little room to manover (I’m 5’3, so not sure how a taller person would cope) so don’t drop the soap! & there’s no where to put any soaps or shampoo etc. you have to put on the side of the sink and reach out. - No English TV or radio channels, apparently a satellite issue (for 5 days?) no news or music. - Well stocked drinks & nibbles but very expensive 6 euro’s for a coke & 8 for a large mineral water (total £12). There’s a Monoprix with everything you may need, open til 7pm, a minute away you’ll get a coke for less than 50 cents & 2litres of Evian for 80 cents. Positives excellent location for cafes, shopping & sightseeing. Staff friendly & it is clean. Internet pc in lobby. Will not be returning.", "Date": "September 9, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Lancaster, PA", "Title": "“Perfect”", "Author": "gardenmom57", "ReviewID": "UR74802522", "Content": "Beautifully updated boutique hotel. Great location, within walking distance to cafes, transportation, shops and museums. Very quiet rooms. Our room was quite large and the bathroom was large as well. We would definately stay there again..", "Date": "August 11, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "illinois", "Title": "“Fantastic location, outstanding room, average staff”", "Author": "Scfamily05", "ReviewID": "UR74300287", "Content": "We stayed at the Madison for 4 nights and had 2 rooms. My husband and I stayed in a \"privilege\" room which was well appointed, sleek, immaculate quiet and had plenty of storage space. The hotel is ideally situated and can't be beat - in the heart of St Germaine on the left bank - and is walking distance to great shopping, cafes, the Seine, Louvre and Notre Dame. The only slight negative for us was that the staff was not overly friendly or specific with recommendations and directions. This could be due to the language barrier and our lack of familiarity with the area. Overall, a positive experience in an outstanding location.", "Date": "August 8, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "3", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Jacksonville", "Title": "“Wonderful charming Boutique Hotel in the heart of St Germain”", "Author": "2Jax", "ReviewID": "UR66078556", "Content": "My wife and I stayed at the Madison recently after the hotel was refurbished. I do not know how the hotel was prior to the the refurbishment which was completed in March 2010, but it was a wonderful boutique hotel in an absolute perfect location in Paris. The staff was more than helpful and had a friendly and positive attitude. It seems that only 5 or so people work the front desk at different times so we really got to know the staff. While there was no \"concierge\" on call the staff did what it could to assist when we asked questions. This is a charming small hotel. Do not expect amenities like a full time concierge and other amenities you might have at a bigger place. The rooms we spacious for a large European city and well appointed. Our room looked out on the church at St Germain Des Pres. You really do not get better than that! Even though we were on a busy boulevard, our room was quiet. For those who might enjoy French TV there is a plasma TV and an IPOD docking station for music. The only real drawback was the price. You can probably get more for a cheaper price, but you will lose some of the spaciousness and the location. If going across the street for a stop over at Le Deux Maggot, dinner at Lipps or just a 10 minute walk to the Seine speaks to you, then this is the place for you. If you do not like boutique hotels or if you are looking for something a little cheaper, than there are plenty of other hotels to choose from. We enjoyed our stay, but maybe next time we will find something not as expensive.", "Date": "June 1, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Silver Spring", "Title": "“A wonderful hotel in a great location”", "Author": "DaveHMaryland", "ReviewID": "UR63955411", "Content": "The Madison Hotel is especially ideal for those using the Paris metro and bus system or those wanting to walk to many of the famous Paris sites. Located across the street from the Saint Germain des Pres Church and very near the famous Les Deux Magots and Cafe de Flore cafes, the Madison is just a few steps from 3 bus lines and the number 4 metro station. We spent a week at the Madison in a quiet room that faced away from rue St. Germain. The front desk made all the reservations at our special restaurants and when we asked about a local dining place, the recommendation was perfect. One caution - Paris was very warm in late April, but the hotel air conditioning did not go on until May 1. On May 1, the outside temperature dropped and the air conditioning was turned on. Go figure. The bathroom arrangement was slightly unusual in our room. One closed off area had the wash basin, a full sized bath tub and a separate shower. In a separate closed room was a claustrophobic toilet with a small wash basin, but no soap or towels. Breakfast was very ample and the dining staff was friendly and helpful. There is no restaurant on the premises, but the popular rue de Buci, with its many restaurants is only two blocks away, The Madison offered special deals which made this ideal location less expensive and we thoroughly enjoyed our stay there.", "Date": "May 12, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Denver", "Title": "“Terricifc”", "Author": "YouWillMarryHer", "ReviewID": "UR55586809", "Content": "I really, really enjoyed staying here. The staff were great and very helpful. I would recommend this hotel to everyone.", "Date": "February 9, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Location": "5", "Rooms": "3"}, "AuthorLocation": "Edinburgh, Scotland", "Title": "“Couldn't find a better base for a trip to Paris!”", "Author": "LAC06", "ReviewID": "UR54400267", "Content": "We stayed with Hotel Le Madison for four days, over Christmas 2009. The room, although small (as is every other Paris hotel room, so no loss there) was modern, clean and tidy, and spruced up every day. The bathroom was nice and new, and very fresh with modern, if a little unusual, decor. The best things about the hotel are: 1/ Staff - incredibly friendly and helpful (and they sent us a christmas card!) and 2/ Location - right in the well-to-do St Germain area, but just a 5 min walk to the river and Notre Dame etc. Metro station right outside, but we ended up walking everywhere, including Arc de Triumph, Louvre, Musee D'Orsay, Chans Elysses etc. Spent most of our evening time in the bars and restaurants of St Germain, and exploring its windy streets through the day, in-between big ticket attractions. St Michel is next to St Germain, and much more touristy so perhaps avoid at night, but in a very, very expensive city, the prix-fixte lunch offerings were most welcome! All in all, a great, inexpensive hotel to stay in and I'd recommend it to anyone taking a short break.", "Date": "January 26, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Location": "5", "Rooms": "3"}, "AuthorLocation": "Sammamish, Washington", "Title": "“Great location and nice comfortable hotel”", "Author": "TravellingDutchie", "ReviewID": "UR46105165", "Content": "We stayed in the Madison hotel for 5 days in March on a romantic trip. The hotel was comfortable and felt right for the St. Germain neighborhood. Right on the doorstep are nice brasseries and great shops, and in less than a minute you can take a metro to anywhere in Paris.", "Date": "October 7, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Frankfurt, Germany", "Title": "“Great hotel in a perfect location!”", "Author": "Bozziegirle", "ReviewID": "UR42702953", "Content": "We spent a weekend at Le Madison and were very happy with the hotel. It's rooms have been updated so they are very modern as well as the bath. The hotel is very clean, and located right next to the metro in the heart of St. Germain. Fantastic location! You can't go wrong between the location, the modern rooms and baths, and cleanliness. The two famous cafes are just blocks away.", "Date": "September 18, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Location": "5", "Rooms": "5"}, "AuthorLocation": "London", "Title": "“Great hotel in a great location”", "Author": "Websterfamily", "ReviewID": "UR37355498", "Content": "The hotel was excellent. Rooms very modern and well equipped. Great location very close to metro, cafes (great for breakfast), bars and restaurants. The staff were very friendly and helpful. Easy walking distance of the Louvre etc. Fully recommend", "Date": "August 11, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Rio de Janeiro, RJ", "Title": "“Very good hotel in a great location”", "Author": "LordBY", "ReviewID": "UR35201435", "Content": "The hotel is very nice and the staff is friendly. Rooms are clean. I just think that this hotel is overpriced. Of course it is a great hotel in a great location, but I don't think it is worth what is charged. Another thing: The internet access is very very expensive at the hotel, don´t use it unless for an urgent reason.", "Date": "July 19, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Alabama", "Title": "“Loved those twinkle lights”", "Author": "Biblioguy", "ReviewID": "UR34300985", "Content": "The location, in the heart of the St. Germain de Pres neighborhood and within easy walking distance of the Louvre, Orsay, Luxembourg Gardens, Notre Dame and other major sights could not have been more ideal. The staff was extremely friendly (amazingly friendly by Parisian standards) and went out of their way to be helpful during the entire time we stayed there. We stayed in a newly renovated room on the 6th floor with a small balcony overlooking Boulevard St. Germain. The room was small by American standards, but average for a French hotel. It was clean, well appointed (all the modcons--Bose docking station, flat screen, etc, etc) and very quiet with the windows shut (no street noise at all, surprisingly). I saw several of the other rooms where my traveling companions were staying and they were all similarly appointed with the upgraded decor. I did peek in a couple of open doors on the lower floors as I wound my way down the stairs (slow and tiny elevators) and noticed that they hadn't yet been modernized and looked a little \"tired\" in comparison to our rooms. We're very experienced travelers and used to unusual plumbing, but it still took us a little while to figure out the post-modern shower. The oddest feature of the room was the color changing fiber optic twinke lights installed in the ceiling. Don't get me wrong, we loved them--it's just that it seemed they were a bit out of place here and more in keeping with a hotel room in Vegas or a honeymoon hotel. Breakfast was included in the rate we paid, and it was quite good with all the usual offerings. If I were going back to Paris any time soon (I wish!), I would stay here again without any hesitation.", "Date": "July 9, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Los Angeles, California", "Title": "“Great room, great staff, great location, great breakfast - just great!”", "Author": "tessakit", "ReviewID": "UR27935596", "Content": "We did not have a single complaint about our stay here. In fact, we will return next year. Why take a chance elsewhere? This was the perfect place for us to stay. The typically reserved Parisian staff are really fun and friendly once you get past their facade - we were laughing and joking with them by the end of our stay . They were very helpful in making restaurant reservations for us numerous times. The breakfast was darn good too. For shopping, eating, sightseeing, and getting around via the Metro, you could not pick a better location. The room and bathroom was obviously recently remodeled with all the modern conveniences. We stayed during construction and we were totally unaffected by construction in any way.", "Date": "April 13, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Philiadelphia, Pa", "Title": "“Unbeatable location and a good value”", "Author": "Lori44", "ReviewID": "UR27205342", "Content": "Stayed three nights at this lovely little property in the heart of St. Germain. The location is ideal for visiting Paris. The Musee D'Orsay, Louvre and Notre Dame are all within easy walking distance, and for visiting further locations there are two metro stations within a block, one for the 4 line and one for the 10 line. Just around the corner is the Rue de Buci market and lots of great shopping and restaurants. You are a stone's throw away from the two most famous cafes in Paris - les Deux Magots and Cafe de Flore. The \"Privilege\" room we stayed in was large by Paris standards, with lots of closet space (so we weren't tripping over our bags the whole time) and some nice amenities - bathrobes and slippers, a nice-sized mini-bar, and an electric kettle and instant coffee/tea. There were also wine glasses and a corkscrew provided if you wanted to pick up a bottle from the wine store on the next block. The bathroom had both a bath and a seperate shower enclosure. We had plenty of hot water, but not enough pressue to use the shower's massage features. Our room also had some interesting lighting features - a glowing red \"border\" around the headboard, and fiber optic twinkling lights in the ceiling over the bed that sent us into peals of laughter the first time we accidenatally activated them. But neither of these are noticeable at all if you don't have them on, and I have to admit that they were kind of mesmerizing. Breakfast was included and was okay - similar to the free breakfast you would get at a chain hotel in the US. I wouldn't have paid for it if it wasn't included, but it was convenient to be able to grab it and go before a long day of sightseeing. The staff was charming and helpful. The concierge confirmed our dinner reservations and the desk staff printed out boarding passes and helped us change our seats for the flight home. As we were checking in on Friday morning we did overhear one couple complain about noise and vibrations from some remodeling that was being done, but no work was done on the weekend we were there. Overall, a very lovely stay in a clean, charming hotel with an unbeatable location. We paid a great internet rate of 175 euros per night, including breakfast and wireless internet, and thought it was a great value at that price.", "Date": "March 31, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Oregon", "Title": "“Great Place to stay in Paris”", "Author": "dndholland62", "ReviewID": "UR26611209", "Content": "Excellent place to stay in Paris if you desire to capture the true Parisian culture of everyday life. The hotel is located right on the Rue de Saint Germain; a Metro connection located in front, 5 minute walk to the Louvre, 10 minutes to Notre Dame, what more could a first time visitor to Paris ask for! The staff is very freindly, helpful and tolerent of our bad French; in other words they were grasious hosts who spoke very fluent english. We stayed in the updated Priviledge Rooms, so our breakfast and internet service were included in the price. We thought the price we paid was a good value when you consider the location and what the room offered. Breakfast was very good; with a small buffet, but more than enough to get your day started.There are literally dozens of cafe's within walking distance to suite any cuisine your pallet desires. When we make plans for a return trip to Paris, we will stay at the Hotel Madison.", "Date": "March 22, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Check in / front desk": "3", "Overall": "3.0", "Value": "4", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Bellevue, Washington", "Title": "“Nice little hotel”", "Author": "hypathia", "ReviewID": "UR21543289", "Content": "This hotel is located on the Blvd Saint Germain in Paris which is great because it has everything on it. Food of all kinds, clothing stores, specialty stores and bus and metro access. The hotel is set back slightly from the street and is very quiet. The lobby is well cared for and the staff helpful. The room was small but for one person adequate. The bed was comfortable and the linens clean. The bathroom featured a bidet and a toilet as well as a shower. The shower was small and this hotel suffered from water that went from scalding to cold to lukewarm so showers were not always relaxing. Also the shower stall was small and I bumped my elbows on the inside when trying to wash my hair. Again I am 5'2 and 125 pounds and I found it very small with little room to spare. The room was fairly quiet but I could hear my neighbors coughing and could tell when they were talking. Also the doors slam with authority if you don't take care in closing them so this sound is frequent. Breakfast is 15 Euros and is much too expensive. You have a very small selection of cheese, bread, fruit and beverages. There is a pastry shop across the street or two blocks up on the right hand side up the street is a covered market and a really good pastry shop with a white awning is there. This was a nice hotel and I would stay here again although I thought room rate was a bit high.", "Date": "November 4, 2008"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Check in / front desk": "3", "Overall": "2.0", "Value": "2", "Rooms": "2", "Location": "4"}, "AuthorLocation": "USA", "Title": "“Disappointed in St. Germain”", "Author": "UsaMiko", "ReviewID": "UR20531613", "Content": "I stayed there for two nights after a wonderful week in the southwest of France. The room was very small - even for Paris, and the shower was so small the water would spill out onto the bathroom floor. I found the staff to be reasonably helpful, but they seemed a bit rushed. I escaped as soon as I could. Area is lovely, but would not stay here again.", "Date": "October 1, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Almaty, Kazakhstan", "Title": "“A great place”", "Author": "stephentaynton", "ReviewID": "UR18781132", "Content": "If you want to stay right in the middle of Paris you cannot go past this hotel. It is on Saint Germain and offers everything Paris can give the traveller. The hotel is clean, and our room had a great outlook to St. Germain De Pres - worth it. Clemant (I hope I have spelt his name right) who worked on reception was a gem, he organised restaurants and even drew a map to find the nearest cyber cafe. Breakfast was okay by French standards. The rooms were great with nice beds with soft duvets. We did move rooms as our first bathroom had problems with the showers but this was quickly fixed up by reception and we were moved to a balcony room. Overall a great experience and worth all the positive comments about it.", "Date": "August 9, 2008"}, {"Ratings": {"Cleanliness": "4", "Check in / front desk": "5", "Overall": "5.0", "Value": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "London, United Kingdom", "Title": "“Excellent Location!”", "Author": "BMac3009", "ReviewID": "UR18609306", "Content": "My boyfriend and I stayed at this hotel for two nights over the weekend and had a brilliant time. The hotel is about 20 metres from the St Germain des Pres Metro stop (line 4 - same line as Gare du Nord for the Eurostar). We arrived very late on the Friday night but the hotel has 24 hour check in and the receptionist was friendly and helpful. We were checked in with the minimum of fuss and were made to feel welcome. Our room was a decent size (for Paris!) and comfortable - the bed was REALLY comfortable (but we do like firm beds!). The view wasn't great as we were at the back of the hotel but we didn't mind because it meant it was quiet (although the windows are double glazed). All the rooms have air conditioning. The bathroom was well equipped and very clean. We booked our room through Expedia and it was on a room only basis. If we had eaten breakfast at the hotel it would have cost us 15 euros each so we opted out and had breakfast at the famous Cafe de Flore over the road instead which was very tasty and a great taste of Parisian cafe life! The only thing I wish we could have had was tea and coffee making facilities in our room but room service was available if I had really wanted a good cuppa! The overall service was excellent. We did not have an iron with us and the staff were extremely helpful in finding one and an ironing board too. All in all - great location, fantastic staff and comfortable room. I would definitely stay there again.", "Date": "August 4, 2008"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "New York City", "Title": "“Charming and Convenient”", "Author": "Carol L. W.", "ReviewID": "UR15282580", "Content": "Just returned from a week at the Hotel Madison on the Blvd St. Germain in the 6th......marvelous for convenience, the deluxe double was extremely spacious for Paris, had a separate wc (love that!) and excellent storage; breakfast is included in the rates and served in the rear of the antique filled main lobby and is excellent with a lot of choice and very fresh options. Staff at the desk is quite helpful (we have been to Paris many times so didn't ask for information but overheard others doing so and they were very informative). They even have a library and they encourage you to take the books up to your room including many guide books and maps. And, it lies within two blocks of two different metro stops (different lines) so very easy to use transport; a bus stop is directly in front of the hotel and the new rent a bike program has a stand right out front as well.....if you are a good walker, it is only three streets to the Seine and then the Louvre is directly across; the d'Orsay is less than a half mile walk as well.", "Date": "April 23, 2008"}, {"Ratings": {"Service": "1", "Cleanliness": "3", "Check in / front desk": "4", "Overall": "2.0", "Value": "3", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Buenos Aires", "Title": "“A terrible loss”", "Author": "passionfortravell11", "ReviewID": "UR14718730", "Content": "The hotel was very centrally located, in a nice neighbourhood. But one day, I left my wallet in a bag instaed of putting it in the safe. The problem was that when I arrived from a day in Paris I realized that my wallet along with the money inside it was gone! I was sure I hadn´t lost it because that day I had not worn a bag/backpack during the day and therefore theft was the only possible option... I asked in the lobby and they couldn´t give me any answer and therefore my wallet became untraceable. Nevertheless the person in charge was nice enough not to charge us one night (which didn´t cover all the money that was stolen). This episode almost spoiled my whole trip. Also, the room was comfortable and had was colourful but pleasant.", "Date": "April 1, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Check in / front desk": "4", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "uk", "Title": "“Just the ticket!”", "Author": "gadflyUk", "ReviewID": "UR13122484", "Content": "This is a very solid, comfortable, well-appointed hotel in a central vibrant location (Cafe Flore, Deux Magots, Petit Zinc and Lipp right on the door step) that is well served by the public transport system. Many of the tourist sites are walkable. There are dozens of excellent shops,cinemas, restuarants and brasserries close by in the classy St Germain-des-pres/Boul Mich. It has a good selection of room types and the decor in all areas is charming.(Oak, tapestry, thick carpets, brass work, mirrors, reproduction Impressionist paintings, subtle lighting etc). A very comfortable residents' lounge, a pleasant bar - hotel prices of course! - and neat breakfast room providing a first rate buffet breakfast with substantial choices, white linen tablecloths (civilization!), comfortable chairs, efficient staff and lots of space. Generous supply of free international newspapers each day. Spacious lifts by Paris standards. Internet available but much of Paris is now WiFi. The bedrooms are compact but by no means cramped. Good use of mirrors adds light and space. Reasonable storage facilities. Bathrooms are bright, well planned and efficient. TV, telephone, mini-bar and room safe (no cost).There is the normal sound leakage through walls but it is not excessive. Very slight tremble is discernable from the metro on occasions. Rooms are well serviced and stocked with towels, toilet requisites, extra duvets, pillows etc. No tea/coffee making apparatus. No trouser press but each landing has a shoe valet machine.Sweets on the pillow each night, however! Efficient light-proof curtains and good controllable central heating and double glazing. All staff were helpful, efficient, friendly and multi-lingual - so you don't get much chance to try out your French! (The same applies to most of Paris these days.) House maintence was unobtrusive and effective, sustaining a spic and span ambience. Frankly, it could pass itself off as a four star compared to many I've been in in Paris. Very slightly above middle range prices but the compensation is that you get value. I'll definitely use it again, indeed it will almost certainly become my hotel of choice for Paris. It was overall a nice surprise. Hurrah! (At last!)", "Date": "January 30, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Check in / front desk": "5", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "berkshire", "Title": "“friendly and professional”", "Author": "deanakim", "ReviewID": "UR8538340", "Content": "we went to paris to stay for the night and to eat at Alcazar (terence conran designed restaurant, that incidently is fab), the maitre d suggested the madison and called and booked us a room from the restaurant when we booked our meal. We went straight round, staff were very welcoming and helpful about things to do, and we felt very comfortable. Room was lovely clean, and nicely decorated, bathroom large and really loved the tiled floor, and the little lift was very cute too. Breakfast included in the price and was good. Wouldnt hesitate to stay there again. Great location for all our wanderings in paris, and wonderful array of cafes nearby, with Alcazar restaurant being a 5 mins walk away.,", "Date": "August 29, 2007"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "london", "Title": "“Merci”", "Author": "tiffanyLondon", "ReviewID": "UR8089050", "Content": "We have had the most lovely stay, thank you for all; The service was wonderful and the location was perfect. We even loved our room ! Thank you We will be back next year !", "Date": "July 10, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "3", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "atlanta", "Title": "“wonderful”", "Author": "steff8383", "ReviewID": "UR8073966", "Content": "My wife and I had stayed at the Madison Hotel briefly in 2004 and were looking forward to our return. The hotel staff was incredibly upbeat and friendly upon our arrival and check-in was a breeze. We stayed on the 7th floor facing the front of the hotel. Our room was very clean and compfortable. Looking out the balcony size window we could look left and see the Eiffel Tower and Dome Church, to the front right was Notre Dame and straight ahead was the St Germain Church. Wow. We just couldn't get enough of the view. I cannot think of a better location in Paris. We walked to the Louve several times. An excellent Itallian restaurant is next door, famous cafe's and brasseries one block away a grocery and pharmacy all right there. The Metro station is a stone throw away and also a stop for the Bus line and the Open Bus Tour. The breakfast buffet was excellent every morning with all the attributes of Contenential and Full English. Our stay was everything that we could have hoped for and highly reccommend the Hotel Madison.", "Date": "July 7, 2007"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "Wichita, Kansas", "Title": "“Great Place to Stay”", "Author": "skyetraveler2000", "ReviewID": "UR8000254", "Content": "My husband and I just returned from a short stay at the Madison. The staff was extremely helpful and friendly; the breakfast was more than we expected and included in our rate; our room was clean, and nice size, loved the fabric wall coverings, a large bathroom; access to everything we wanted from hop-on bus, metro, cafes, taxis. Cannot say enough good things about this experience. We will return to the Madison our next trip.", "Date": "June 26, 2007"}, {"Ratings": {"Service": "2", "Cleanliness": "2", "Check in / front desk": "3", "Overall": "2.0", "Value": "2", "Rooms": "2", "Location": "5"}, "AuthorLocation": "London", "Title": "“Disappointing”", "Author": "SBudd", "ReviewID": "UR6779157", "Content": "This was our second visit to the Madison. The first visit, in April 2004, had been marred by some dreadful plumbing problems, but we decided not to hold that against the hotel, s**t happens, right? However after this second visit we have run out patience, and we certainly won't be going back for a third attempt. The hotel is shabby, the rooms pokey, the beds downright uncomfortable. And having requested a non-smoking room we were greeted by the unmistakeable aroma of stale cigarette smoke and the tell-tale sign of ash trays on both bedside tables and on the writing desk. And there are some fairly bizarre house rules, such as the refusal to provide an iron in the room 'for security reasons'. Eh? In the interest of fairness I have to say that breakfast is good, and of course the location is wonderful. But at E235 per night this hotel is over priced, even by Parisian standards.", "Date": "February 11, 2007"}, {"Ratings": {"Cleanliness": "3", "Overall": "2.0", "Value": "3", "Service": "3", "Rooms": "3"}, "AuthorLocation": "melbourne,australia", "Title": "“Left a sour taste”", "Author": "williamhart", "ReviewID": "UR5444359", "Content": "This hotel is very well placed. However if things do not go well, the staff appear extremely unresponsive. I accidentally left my new polar fleece jacket behind in my room when I checked out. I realized my error by the time I reached the airport and immediately contacted a friend still staying at the same hotel. However, hotel staff told her my jacket could not be located. Given that very few staff would have had access to my room, I felt it should not have been difficult to trace my coat. I faxed a letter to the hotel but have not had the courtesy of a reply. The experience has left a sour taste in my mouth and I could not really recommend this establishment. The quality of a hotel is shown by how they handle a difficulty and this hotel performed terribly. I should mention that I had given the manager of the hotel a present of a book on Australian Aboriginal art as he appeared very interested, and found his lack of response surprising regarding my coat.", "Date": "July 10, 2006"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "Charlotte, North Carolina", "Title": "“Great Hotel”", "Author": "stanelrod", "ReviewID": "UR4994826", "Content": "We were in Paris in early April, 2006, and stayed at the Madison Hotel. The staff was very pleasant and helpful. The breakfast was more than we have had available at some other hotels in Paris. The room was a good size and the baths with marble floors were very nice. We had a room on the \"courtyard\". There is not a courtyard, just a view at the aircondition equipment. Our friends had a room on the front. We found the room quite and we did not pick it for the view, there is too much to see in Paris to spend time in the room. The metro station is about 200 feet fromt the front entrance. On St. Germain with great resturants near by. We would recomend and will stay there again.", "Date": "April 22, 2006"}, {"Ratings": {"Cleanliness": "3", "Overall": "1.0", "Value": "1", "Service": "1", "Rooms": "3"}, "AuthorLocation": "UK", "Title": "“Not a Good Choice”", "Author": "NYer_in_London", "ReviewID": "UR4561787", "Content": "We have been to France many times and have always had a wonderful time. Unfortunately, for our last trip, we chose the Madison Hotel. Our second night, a problem with the heating system was creating noise so loud in our room that it was not possible to sleep. We live in a large city and are not particularly susceptible to noises. They're attitude was that there was nothing they could do. We ended up leaving to find another hotel. They consequently charged us for the room for that night when it was uninhabitable! While, their location is good, their decor and their service are not commensurate with the prices they charge. I recommend any other hotel in the area.", "Date": "February 28, 2006"}, {"Ratings": {"Cleanliness": "5", "Overall": "5.0", "Value": "5", "Service": "4", "Rooms": "5"}, "AuthorLocation": "New York", "Title": "“Loved the Madison!”", "Author": "MYS79", "ReviewID": "UR4027289", "Content": "My boyfriend and I stayed at L'Hotel Madison last month, and all of the positive reviews lived up to the hype. With exquisite detailing in the lobby and breakfast area, not to mention the stairwells, hallways and bedroom, we were impressed that the hotel felt homey and welcoming, yet had the feel of an upscale establishment at the same time. We stayed in Room 22, which faces the \"courtyard\" -- the one caveat we would point out is there is no \"courtyard\" as the hotel email confirmation would suggest -- the less pricey rooms overlook a narrow outside corridor with an air-conditioning unit and there is absolutely no view. However, the room itself was well furnished and roomy (at least by Parisian standards). It's hard to explain the decor, but with taffeta walls and bright colors in the bedroom (and interesting marble and tiling in the bathroom), it was well furnished and unique--we hardly minded not having a view. However, I did get to peek at the rooms facing the boulevard -- if you can spring for one of them, it would be worth it! The service at the hotel was fine -- brisk, polite and helpful -- everyone was very nice, but don't expect anyone to exude friendliness -- I don't think that is Madison-specific, but is just what you should expect anywhere. Location is THE best in Paris -- If you're going, you should definitely stay in the Saint Germain de Pres area, particularly the 6th district. The hotel is walking distance away from Musee D'Orsay, The Louvre, etc... We highly recommend the hotel, not only because of the location but for the well-furnished rooms and above-average service!", "Date": "October 16, 2005"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "", "Title": "“Great Hotel in the Left Bank”", "Author": "A TripAdvisor Member", "ReviewID": "UR3984969", "Content": "Stayed at the Hotel Madison for a week in August 2005. Ideal location close to two subway lines which is important for getting around. Staff was friendly and spoke English. The rooms overlooking St-Germain boulevard are woth the extra cost. The rooms are clean and quite as the windows are double pane. Good Breakfast with cereal, eggs, meat. More like traditional American buffet. The hotel has about 40 rooms. More expensive than some hotels in the area but is a premium location. Walking distance to the Louvre, Notre Dame and the Orsay. In the heart of the 6th Arrondissement on St-Germain Boulevard.", "Date": "October 3, 2005"}, {"Ratings": {"Cleanliness": "5", "Overall": "5.0", "Value": "5", "Service": "4", "Rooms": "5"}, "AuthorLocation": "Seattle, WA", "Title": "“Beautiful rooms”", "Author": "bborrus", "ReviewID": "UR3984527", "Content": "The bedroom and bathroom are large by Parisian standards and are beautifully decorated by any standard. The bed was firm and comfortable, and the reading lamps were more than adequate. The Madison is well-located on blvd. St. Germain des Pres in a delightful neighborhood close to legendary cafes, great restaurants, and shopping. Two metro stations are less than a block away.", "Date": "October 2, 2005"}, {"Ratings": {"Overall": "3.0"}, "AuthorLocation": "Colorado", "Title": "“Good Location, horrible beds”", "Author": "chmas", "ReviewID": "UR3534371", "Content": "I just returned from a Med. cruise and three night stay in Paris. We stayed at the Madison after reading all of the great reviews on this site and other research. It is very true, that the location is fabulous--couldn't be better. However, the hotel was not at all impressive. The beds were tiny, low to the ground, lumpy and hard. Each morning I was awakened by the sound of running water. You could hear the plumbing through the walls and it was very loud. The staff was nice enough; however, they recommended the worst restaurants. The meals were so bad, and expensive, that we wondered if it wasn't a kickback sort of deal. I would not stay there again.", "Date": "June 6, 2005"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "Oconomowoc, WI", "Title": "“A treat worth waiting for”", "Author": "Paytons", "ReviewID": "UR2804836", "Content": "We attempted to secure a reservation at the Madison in the past, however it was always full. This September (04) we managed to get in and found it well worth the wait and the somewhat greater expense. The better rooms on the front of the hotel overlooking Blvd Saint Germain are truely the best. The breakfast room and public rooms on the street level are gorgous. The help were much nicier than I had been led to believe they were downright friendly as a matter of fact. Only blocks to great cafe's, night life, and the never ending parade of character to be found on the boulevard at any hour of the day or night. Excellent shops in the immediate area, I haven't a clue as to where you could park a car if you have one, cabs and the metro are readily available. An excellent hotel, in a world class area, what could you want...a french breakfast, they have that too.", "Date": "November 3, 2004"}, {"Ratings": {"Cleanliness": "5", "Overall": "5.0", "Value": "5", "Service": "5", "Rooms": "5"}, "AuthorLocation": "Northern California", "Title": "“Madison is as good as ever--and that's very good indeed.”", "Author": "Underhill", "ReviewID": "UR2604162", "Content": "We spent three nights at the Madison last week and found it excellent in all ways. The fairly recent redecoration has resulted in lovely rooms (we saw two besides our own), and the atmosphere is more that of a private home than a commercial establishment. Our spacious room, #23, faced the Boulevard St-Germain; the tall windows looked out on the church of St-Germain-des-Prés, a lovely view. The windows' double-glazing kept noise to a minimum, and the quiet air-conditioning kept the temperature quite comfortable. Room 23 now has walls papered in a soft-green fern pattern, edged in subdued gold brocade. In addition to the twin beds we had a comfortable day bed covered in green velvet, with cushions suspended from a brass rail at the back. There were a susbstantial chest of drawers and a pretty antique desk near the windows, along with a lovely light green slipper chair. Nightstands with a drawer were on either side of the beds. The closet had a section for hanging clothes and another with shelving. Between the closet and the beds was a wide three-level unit that was perfect for storing suitcases and other items and ideal for packing without backache. The long bathroom had two sinks, a bidet, and a tub with shower, shower curtain (!), and laundry line. The humidity extractor worked so well that laundry dried very quickly. Room lighting was more than adequate, and the lights by the bed were paraticularly excellent. The lamps on the desk and chest of drawers added to the room's ambiance. The halls are now done in blue and yellow and provide a cheery note on dark days. The room next to our own was done in blue and white toile, while our friend's room had wonderfully whimsical wallpaper (elephants, yet!) and fabric in shades of blue. The Madison's location is ideal, right in the middle of the St-Germain area and only a few blocks from the Rue de Buci (and breakfast at Paul's). A métro is just across the street , and within half a block are two taxi stands. Only a few doors away is Vesuvius, a lively Italian restaurant, and other ethnic places are also near. The hotel's reception staff were amiable and helpful; we've seen the same faces on all three stays now, a good sign. This was our third stay at the Madison, and the hotel will certainly be our pied-à-terre in Paris in the future.", "Date": "September 27, 2004"}, {"Ratings": {"Cleanliness": "5", "Overall": "4.0", "Value": "5", "Service": "5", "Rooms": "4"}, "AuthorLocation": "PA", "Title": "“Excellent, excellent, excellent”", "Author": "small_fry1", "ReviewID": "UR2361872", "Content": "We just spent 5 fantastic nights at The Madison. The location is fantastic, a short walk to the Seine, Louvre and more. Right in the middle of some of Paris's most famous cafes and nightlife. The service was excellent. Our room was wonderful. We highly recommend The Madison and their staff.", "Date": "August 2, 2004"}, {"Ratings": {"Cleanliness": "5", "Overall": "5.0", "Value": "4", "Service": "5", "Rooms": "5"}, "AuthorLocation": "Omaha, NE", "Title": "“The perfect place to stay”", "Author": "Emil48", "ReviewID": "UR2217806", "Content": "This is a wonderful hotel. It was convient to everything we wanted to see, an easy walk to major attractions. The subway was only a few steps from the door. At night you could open your window and hear the acordian or saxaphone player then the windows were newer and when shut all outside noise was eliminated. The rooms were very nice with many extra features. We will be back for sure.", "Date": "June 23, 2004"}, {"Ratings": {"Overall": "3.0"}, "AuthorLocation": "Philadelphia, PA", "Title": "“Mostly great”", "Author": "A TripAdvisor Member", "ReviewID": "UR2171967", "Content": "We stayed at the Madison for 3 nights a few weeks ago. We got a deal on a travel website so we got a good deal - paid 175 euro instead of 220 for a double room. We were supposed to get a courtyad view but we actually got a boulevard view. It was great! Only thing, there was a mysterious drop of something on the toilet seat when we arrived which we had to clean oursleves. Also the safe wasn't working. Other than that no complaints! The room was big enough for us (2 people), and it wasn't loud. The staff at the desk were polite to us.", "Date": "June 8, 2004"}], "HotelInfo": {"Name": "Madison Hotel", "HotelURL": "/ShowUserReviews-g187147-d228699-Reviews-Madison_Hotel-Paris_Ile_de_France.html", "Price": "$286 - $573*", "Address": "<address class=\"addressReset\"> <span rel=\"v:address\"> <span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">143 Boulevard St Germain</span>, <span class=\"locality\"><span property=\"v:postal-code\">75006</span> <span property=\"v:locality\">Paris</span></span>, <span class=\"country-name\" property=\"v:country-name\">France</span> </span> </span> </address>", "HotelID": "2514940", "ImgURL": "http://media-cdn.tripadvisor.com/media/photo-s/02/21/88/3c/madison-hotel.jpg"}}