{"Reviews": [{"Ratings": {"Service": "1", "Cleanliness": "2", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "3"}, "AuthorLocation": "Downham Market, United Kingdom", "Title": "“DON'T DO IT!!!”", "Author": "rentonraver", "ReviewID": "UR121560878", "Content": "Just arrived this afternoon. Had booked through laterooms 2 weeks ago. The main reason i chose this particular hotel was that it was billed as having smoking rooms available. This was not the case. However, having got over that annoyance, we were directed to our cupboard! To call it a room would be a gross exaggeration. It looks like a cell and the toilet/shower cupboard is unbelievable, your knees are squashed behind the door if you manage to get the door shut. Unlikely i will manage a shower as the toilet overhangs the shower tray. I intend , to leave in the morning. Really disappointed.", "Date": "December 9, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Location": "5", "Rooms": "3"}, "AuthorLocation": "", "Title": "“Perfect location”", "Author": "Lindleann", "ReviewID": "UR119111204", "Content": "The best thing about New Dawn is the location and breakfast. A boiled egg is served which is not common at many B&Bs. I would rate this place as a small step up from a hostel. My room and bed was tiny, resembling a prison cell. And the shower is at the end of the bed with a curtain so its very easy to get mold in the room, although my room was clean. The toilet is up the corridor and it is crooked. So you sit wonky. And the tv is on the wall by the bed so it's kind of useless unless you stand up or sit on a chair to watch tv. My room faced the street that had the pub so was noisy at night then again in the morning with garbage trucks. If you want budget accommodation and a break from shared hostel bedrooms then this place is fine. Plus it's a short walk to shops, eateries, a station and Hyde Park.", "Date": "October 9, 2011"}, {"Ratings": {"Service": "2", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "3", "Location": "4"}, "AuthorLocation": "London, Storbritannia", "Title": "“VERY GOOD BUDGET HOTEL IN CENTRAL LONDON”", "Author": "Posted by a Hotell.no traveler", "ReviewID": "UR119014285", "Content": "Hotel New Dawn is a deacent small hotel typical for the Bayswater aerea. It is very well located close to the restaurant area at Bayswater. This is a budget hotel, but it delivers well in its category. The room was not extremely small as they can be in London, the beds were good, friendly staff. Fairly clean. Even warm water in the shower. A little terrase at the front of the hotel, as well. Not a hotel to spend the day in, but you do not come to London for staying in a hotel, do you? Recommended as a good place to sleep at low budget in London centre. Ivar Arntzen, Norway", "Date": "October 6, 2011"}, {"Ratings": {"Cleanliness": "3", "Sleep Quality": "1", "Overall": "2.0", "Value": "2", "Service": "2"}, "AuthorLocation": "Helston, United Kingdom", "Title": "“Well that wasn't quite what we expected!!!”", "Author": "Linda B", "ReviewID": "UR117991468", "Content": "We wanted a cheap few days in London and found this hotel through Totalstay.com, admittedly it only cost us £157 for three nights, but oh my days!!! The pictures that you see on the website must be of their best room and there can only be one as the room we got was nothing like that. You walked in and there was a double bed pushed up against the wall with room for a bedside cabinet next to it and that pretty much covers the width of the room. The bed itself incidentally is like an old fashioned camp bed with a metal support running across the middle and squeaks every time you sit on it never mind move in your sleep, at least it was comfy though!! To hang your clothes there were some pegs on the wall at the end of the bed, there was a telly but you could only watch it's reflection in the mirror on the opposite wall!! The windows do not appear to be double glazed and if you want to get any sleep before midnight good luck, there is a pub on the corner and you hear every patron as they leave it doesn't really get quiet until about 12.30 and the road noise starts up again sometime before 7, I swear it would have been just as quiet if we had camped on the pavement, it certainly would of been more spacious!! The bathroom, well what can I say about the bathroom, from sat on the toilet you could swivel to your right and have a complete shower literally, swivel to the left and you could clean your teeth!! I couldn't stand in there and stretch my arms out because it wasn't wide enough, my other half described it best as saying \"did they get that out of a caravan?\" Macdonalds did a tremendous amount of business from us whilst we were there as they sell very good tea for 98p, which is handy seeing as there are no tea or coffee facilities within the room. In fairness the room was clean and it's price did mean we could do some extra things whilst we were there, but next time I think it may be stars over price!!", "Date": "September 12, 2011"}, {"Ratings": {"Cleanliness": "2", "Sleep Quality": "1", "Overall": "4.0", "Value": "4", "Service": "2"}, "AuthorLocation": "Lowestoft, United Kingdom", "Title": "“you get what you pay for..”", "Author": "rozzi1", "ReviewID": "UR111420311", "Content": "a basic hotel, ideal if you just want to stay there to sleep not hang around in, rooms are small and basic, would have been nice if there was tea/coffie facilatys in room, we had to bring in coffie from maccyd's what was just round the corner... had breakfast there, as we felt uncoftibal going to breakfast in the basement (youngens/students) but was pretty much near all the shops, ice rink ect... was a good walking distence to go to oxford street, cheap/good value.. will retune but hope it will be more quiet... and we WILL bring our kettle with us !!! (we need our cofffie!!!!) good place", "Date": "June 4, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "2"}, "AuthorLocation": "Cardiff, United Kingdom", "Title": "“One word: APPAULING!!!”", "Author": "welshgirl1234", "ReviewID": "UR109228468", "Content": "If you stay here then good luck! We checked in this tuesday, We were meant to stay for two nights, but within 3/4 of an hour we checked out! The one good thing I guess is that they gave us a full refund! As we walked in the entrance was messy and looked like it had not been repaired or painted in years! We checked in at the reception with a gentleman who did not know we were coming even though we had booked directly through their website!! He rang someone and shouted down the phone to stop any further booking. Not a great start! We were then given out key. I asked for a hair dryer and yes I was given one, but it took two members of staff a lot of fuss and agression to find one! It was all pretty uncomfortable from the start. We then went to our room which one can only describe as pokey! there was mold and condensation everywhere, making it hard to breathe, the bedding was dirty with hair and bits all over it! We asked if we could see another room, the man angrilly showed us another room. We went next door to an even smaller room. Someone else has written a very good description of the \"Bathroom\" (You can have a shower as your sat on the toilet) you could bearly stand up! We thought maybe we could just bear the 2nd room as it did not smell of damp, but then when we went to open the blind we found there was nothing to pull it up. We asked the man about it! This is the hilarious moment that we decided we wanted to leave... he walked over to the blind and said \"Oh dear someone has stolen it!\", if it wasn't already bad enough he told us to leave the room for 5 minutes! Where apon someone came up the stairs with a power drill and a blind! It really is fawlty towers!!! The lights in the landing flicker it smells odd and the staff are rude and scary!!!!! When we were stood in the landing, we decided to leave and find somewhere nice to stay, I went to the door, when I knocked, I was shouted at! A very odd and horrible thing to happen! We told him we did not want to stay and when he realised that he had shouted at me not a member of staff he backed down and gave us a full refund! I was left horrifed at the whole experience! I didn't know wether to laugh, cry or shout! We left asap and can only advise you all to NEVER EVER EVER STAY THERE!!! I would have prefered to have stayed outside in the park!!!!!!!!!!", "Date": "May 21, 2011"}, {"Ratings": {"Overall": "3.0"}, "AuthorLocation": "Adelaide, Australia", "Title": "“Fine for the price, good location”", "Author": "Kathleen068", "ReviewID": "UR102792382", "Content": "The hotel is nothing special. The rooms and bathrooms are small and the hotel is old. It was fine for the price though but if you are looking for the Ritz at a bargain price this probably isn't a good option for you.", "Date": "April 4, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Manchester, United Kingdom", "Title": "“JAIN”", "Author": "Jean11173", "ReviewID": "UR85946547", "Content": "Good location, 2 min walk from bayswater station, 5 min to Queensway station, convinient to buy anything all shops there, hydepark, whiteleys shopping centre, cinema, tesco, waitrose all are nearby this hotel. staff was friendly and helpfull. i prefere to stay again when go again london. more important not bad in cheap price forget about all little things.", "Date": "November 4, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "2", "Overall": "2.0", "Value": "2", "Sleep Quality": "2", "Rooms": "1", "Location": "4"}, "AuthorLocation": "walsall", "Title": "“Bad! Cheap but not good value for money.”", "Author": "griffithsm74", "ReviewID": "UR83858533", "Content": "Had a quad room booked but given a triple and single - splitting us up. Told check in was 2pm when had been told midday on phone. We were going to a show in the West End at 2pm so this was no good. Put my foot down and was allowed to check in midday. TINY room, bad beds, comically small bathroom. No kettle, no glasses/cups. Cold, hard-boiled eggs for breakfast. Give it a miss. Looks good from outside but it's what's inside that counts.", "Date": "October 17, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "2.0", "Value": "2", "Sleep Quality": "2", "Rooms": "1", "Location": "5"}, "AuthorLocation": "Newcastle", "Title": "“Great location but poor quality”", "Author": "gurfran", "ReviewID": "UR82244217", "Content": "The most basic hotel we have stayed in. It is more a low-level hostel. The room was small; the bathroom was the tiniest it could possibly be (See attached photo); the beds' springs made the beds uncomfortable (My husband had back pains for a week after sleeping on one of the mattresses for 2 nights. Then we switched and the other bed was more comfortable for him). But the staff were helpful: fixed several things that needed fixing. Location is the main positive: close to Bayswater and Queensway tube stations and central London. If you just want a room near the action of London, and don't expect to be in your room much, and don't expect much of your accommodation, it can be worth it. When you consider what you can get for the price of this room in other parts of the world it is an eye-opener, but in London you have to expect to pay through the nose as the whole country is outrageously expensive.", "Date": "October 5, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "4"}, "AuthorLocation": "Manchester, UK", "Title": "“Nothing new about new dawn!!”", "Author": "Opalmoon", "ReviewID": "UR76103676", "Content": "Awful....really really awful....where do we start? Room, small. Bathroom, small. I know this is London, but really, you could barely move at all. You could actually sit on the toilet and take a shower at the same time....it was a girlie holiday so we just laughed it off and to be honest after a few drinks, we didn't quite notice the damp patches, stained carpets/sheets, thin, thin towels. Breakfast? Well, you might as well go to McDonalds around the corner. I'd give 5 stars for entertainment, we spent one night out on the veranda looking at a prostitute walking her patch right in front of the hotel. Stay somewhere else!", "Date": "August 20, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "1"}, "AuthorLocation": "England", "Title": "“Worse than a gulag”", "Author": "harveyt252", "ReviewID": "UR70817261", "Content": "I stayed here and it was simply the most awful place I have ever stayed in. I stayed when the snow was falling and the windows were jammed open and the only bedding was a sheet. I slept under my own clothes to keep out the cold. The toilet was unflushed and there was no toilet paper whatseover. The electrics in the room scared me as they appeared to be unsafe, as there were copper wires visible. When I complained about the room, the hotelier or manager came to my room, and proceeded to shout at me. Under no circumstances stay at this hotel. It is the worst of the worst.", "Date": "July 13, 2010"}, {"Ratings": {"Service": "2", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "2"}, "AuthorLocation": "Birmingham", "Title": "“Dreadful!”", "Author": "Aytoun Posted by an OctopusTravel traveler", "ReviewID": "UR58634909", "Content": "This was clearly the worst hotel I have ever stayed at! I hope it is closed down.", "Date": "March 15, 2010"}, {"Ratings": {"Service": "2", "Cleanliness": "1", "Overall": "1.0", "Value": "4", "Location": "4", "Rooms": "1"}, "AuthorLocation": "Austria", "Title": "“Nicht empfehlenswert”", "Author": "Saleilles", "ReviewID": "UR51944346", "Content": "Service was questionable, the staircase to the room was narrow and we had to climb up to the third floor. The room was for 3 persons but in the size of a shoe box. It was impossible to stand up right at the same time with some else The window had a hole and could not be fully closed. Nevertheless the heating worked and it was not cold. The bathroom was in the size of a closet, but it contained everything and was clean. It was however not possible to wash your hands within the room unless you would like to sit in the toilet while doing so. There was simply not enough space. The good thing about the hotel was that it was located near the metro line. Although breakfast was included we didn't risk it since hygiene was more than questionable", "Date": "December 27, 2009"}, {"Ratings": {"Service": "2", "Cleanliness": "1", "Overall": "1.0", "Value": "2", "Location": "4", "Rooms": "1"}, "AuthorLocation": "Melbourne", "Title": "“Cheap and Nasty”", "Author": "geo1111", "ReviewID": "UR50592984", "Content": "Dont even bother booking at this hotel. Sure its cheap, but I would of preferred to pay more for an actual decent hotel. I stayed in a teeny tiny room with very poor facilities for only 2 out the 3 nights that I had booked (I just had to get out of there). The temperature of the shower was either freezing cold, or boiling hot. It had a very musky kind of smell, and there was only 1 powerpoint located underneath in the bed. The supposed free breakfast was dry toast with a selection of jam, with a boiled egg on the side. Staff did not seem to be friendly or approachable. Future visitors to London should avoid the New Dawn Hotel!", "Date": "December 3, 2009"}, {"Ratings": {"Service": "1", "Cleanliness": "2", "Overall": "1.0", "Value": "1", "Location": "3", "Rooms": "1"}, "AuthorLocation": "thefrenchgirl", "Title": "“bad”", "Author": "thefrenchgirl20", "ReviewID": "UR41080016", "Content": "very very bad hotel look like a hostel , there is no lift and the breakfast is very very simple from 8 to 9.30!! in revanch its a good place near the central of london,", "Date": "September 12, 2009"}, {"Ratings": {"Overall": "3.0"}, "AuthorLocation": "Lutterworth", "Title": "“Cheap, Cheerful, Basic with Nice Staff”", "Author": "ramsdale4", "ReviewID": "UR39463275", "Content": "You cant argue with the price. We wanted a roof over our heads after a concert at Hyde Park. We found this place and we were happy enough. The room was clean and it had a bed and bathroom facilities so what more can you want. Admittedly the bathroom was difficult to use being over 4ft tall but we it was adequate enough. The staff were very nice and we had a breakfast which soaked up some of the night befores alcohol! Basically if you want a cheap room to get your head down then this is the place!", "Date": "September 1, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Location": "5", "Rooms": "4"}, "AuthorLocation": "london", "Title": "“Friendly, helpful staff”", "Author": "LondonJone", "ReviewID": "UR36108948", "Content": "Great hotel with very friendly staff, comfortable clean rooms", "Date": "July 29, 2009"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Location": "5", "Rooms": "1"}, "AuthorLocation": "Dublin", "Title": "“Dont stay here no matter how cheap”", "Author": "beckybox101", "ReviewID": "UR32954041", "Content": "We booked a double and a triple room in this \"hotel\" the triple room was basically the attic with very narrow staircase to it that we had to haul our luggage up! It had bunk beds squashed into a room i wouldnt even consider a single room there was no curtains in this room and there was an actibe bee hive in the window we asked for curtains and to get to bee hive removed this wasnt done we then asked for another room we were given a double room with a matress on the floor and the radiator was leaking so bad it socked the matress needless to say we didnt stay got a full refund after much hassle with staff that suddenly couldnt speak english!! The night we did stay on the ground floor there was young men outside in the courtyard the whole night drinking and shouting they werent staying in the hotel and when we complained (about 3 times throughout the night) the receptionest didnt even go outside! We were awake the entire night!! Do not stay here EVER i dont care how cheap it is you might as well be on the streets!", "Date": "June 23, 2009"}, {"Ratings": {"Service": "2", "Cleanliness": "1", "Overall": "1.0", "Value": "2", "Location": "4", "Rooms": "1"}, "AuthorLocation": "Ireland", "Title": "“The worst Hotel we ever stayed in”", "Author": "Tangent11", "ReviewID": "UR25375534", "Content": "This hotel should not be listed as a hotel. It is more like a hostel than a hotel. The only difference between this and a hostel is that the New Dawn Hotel has all private rooms. I know that it is probably impossible to find a private room at a cheaper price in the middle of London, but I would rather pay the extra 10-20pounds a night and get something decent. The rooms are very very small. The bathroom is a joke, when you are sitting on the toilet you are practically sitting in the shower, and the sink is right in front of your head. The New Dawn provides towels, a very small bar of soap every day and has a TV in the room. Bring your own toilitries if you decide to stay other than that. The window in our room was broken and we were unable to properly close it. It was very noisy in the pub near our window and so it was pretty difficult to sleep. Breakfast consisted of Tea or Coffee and toast. That is it don't expect any more. The hotel will store your luggage if needed but they don't have a secure room to do this so you do so at your own risk! Overall, I would never stay here again or dream of recommending it BUT if you are a backpacker on a very tight budget and want a small step up from a hostel then you might consider staying here. I have stayed in a worse place, but because this place calls itself a hotel, it is the worst hotel I have ever stayed in. To call itself a hotel is a complete lie! It should not be legal!", "Date": "March 1, 2009"}, {"Ratings": {"Overall": "2.0"}, "AuthorLocation": "PAris", "Title": "“Great Value...not sooo bad”", "Author": "williamsparis", "ReviewID": "UR24108196", "Content": "I found the hotel not half as bad as the reviews. According to the staff thay have had a major refurbishment that was still ongoing during my stay, which was rather annoying. But the linen was nice and clean the room was cleaned daily as were the toilets. the staff were not the most helpful but the bed was new as was the paint on the walls and the carpet. The breakfast was served in a pleasent room downstairs. Of course the best part was the price. I stayed in central london for 4 nights and paid £120 and got free breakfast. I walked everywhere during my stay...to Hyde park, oxford street the museums. Good considering the price.", "Date": "February 2, 2009"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Business service (e.g., internet access)": "1", "Check in / front desk": "1", "Overall": "1.0", "Value": "1", "Rooms": "1", "Location": "1"}, "AuthorLocation": "Stockholm", "Title": "“The worst hotel ive been to!”", "Author": "patrik_sweden", "ReviewID": "UR18108922", "Content": "Dont book this discusting hotel. Trust me. Unbelivible that this is legal to rent this kind of rooms to people. Me and my friend paid 170 pounds for two days, we were in the room about 5-6 hours total because it was so terrible.", "Date": "July 21, 2008"}, {"Ratings": {"Service": "2", "Cleanliness": "2", "Check in / front desk": "2", "Overall": "2.0", "Value": "4", "Rooms": "2", "Location": "5"}, "AuthorLocation": "Netherlands", "Title": "“be fair please”", "Author": "kam123", "ReviewID": "UR15864154", "Content": "I have stayed in the New Dawn about two times on two different occasions and I must say I do not dream of going back.. Yet I do seem to have a different opinion of the hotel from most of other reviewers. I found the staff to be exhausted but helpful. The rooms were indeed dark and seemed very neglected and bathrooms appeared mouldy and in need of repairs or some other care though they WERE cleaned daily with bleach. Altogether, I see it simply as a you-get-what-you-pay-for situation. The place IS central - 5 mins walk from Bayswater, 7 min from Queensway - and you have to be unfair to complain about the comfort of the place when paying only about 40-50 pounds per night in London. And don't forget you do your breakfast with eggs:)", "Date": "May 9, 2008"}], "HotelInfo": {"Name": "New Dawn Hotel", "HotelURL": "/ShowUserReviews-g186338-d569845-Reviews-New_Dawn_Hotel-London_England.html", "Price": "$71 - $223*", "Address": "<address class=\"addressReset\"> <span rel=\"v:address\"> <span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">95 Inverness Terrace</span> | <span class=\"extended-address\">Bayswater</span>, <span class=\"locality\"><span property=\"v:locality\">London</span> <span property=\"v:postal-code\">W2 3JU</span></span>, <span class=\"country-name\" property=\"v:country-name\">England</span> </span> </span> </address>", "HotelID": "2514301", "ImgURL": "http://media-cdn.tripadvisor.com/media/ProviderThumbnails/dirs/93/b8/93b82a9b3065ed298c7da65bc5fe38391large.jpg"}}