{"Reviews": [{"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "3", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Frankfurt/ Main", "Title": "“I will definately come back”", "Author": "N H Posted by an Easytobook.com traveler", "ReviewID": "UR127356068", "Content": "it was a perfect central location(!!) but as I expected: it costs silence and some sleep, but the hotel was clean& the staff was very friendly, so always again!", "Date": "April 6, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "London, United Kingdom", "Title": "“Location Location Location”", "Author": "PLWildash", "ReviewID": "UR127219269", "Content": "If you want to stay in New York on a relative budget and want to be near to pretty much all the action, this is the only choice really. It is a couple of blocks from Madison Square Garden, which has Penn Station underneath it so if you are travelling by Amtrak it is perfect or if you want to jump on the metro to the airport or anywhere else. You can easily walk to Times Square and even Central Park. The Hotel itself is clean and comfortable, the dorm beds appear to be pricey compared to elsewhere, but its New York and they are spacious and en suite. The patio area is also handy to meet other travelers. The only thing that could make it better value for money is if there was breakfast included. On my next visit to New York, i will be staying here again - if i can book far enough in advance anyway!!", "Date": "April 3, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Emmaus, Pennsylvania", "Title": "“Great Location and Service”", "Author": "edeangelis", "ReviewID": "UR126715997", "Content": "Great location just a block from Penn Station. Our room was clean and small. We elected to have a shared bathroom, which was fine. The staff was great - told us where to find food and fun things to do. I would come again!", "Date": "March 27, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "", "Title": "“Best possible place for price in New York city”", "Author": "Kieran1987", "ReviewID": "UR126558644", "Content": "The hostel is located really close to midtown a stones throw from Madison square garden and times square. We arrived and were warmly welcomed by the man on check in. He offered us a free upgrade which was great. The room was nice and clean and looked out onto 8th avenue. Nice roof terrace and air con were a bonus, would recommend to all.", "Date": "March 23, 2012"}, {"Ratings": {"Overall": "1.0"}, "AuthorLocation": "CA", "Title": "“run for your life”", "Author": "NoneNamedYet", "ReviewID": "UR126122094", "Content": "the dept of housing , not to mention a few other authorities, should come here to check things out. in seriious need of inspecition", "Date": "March 15, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Melbourne, Australia", "Title": "“Location, location, location!”", "Author": "Karen L", "ReviewID": "UR125635320", "Content": "I can't complain about this hostel at all! My sister & I shared a double room which was small but this is NY after all! And my sister (2nd time visitor to NY) said it was bigger than the 4 person dorm room she'd stayed at previously. The hostel is close to Penn Station & Times Square so navigating via subway or on feet is a breeze. Bearing that in mind, being close to the action does mean there are sirens and street sounds going (the city that never sleeps!) but we'd brought earplugs and eye masks anyway so problem solved. There's no kitchen or microwave but plenty of food options nearby to cater from budget to higher-end tastes. Reception was welcoming - always attentive and ready to offer local knowledge or assistance so thanks to Issa, John, Tyron and Waz. The rooms are a feature - whimsically painted homages to NYC - and we stayed in the Esther Williams room but can't wait to stay in the Orbit room for my next visit. There was an issue with plumbing but nothing in life is infallible! Once I'd notified reception, they got onto it straight away and I was able to shower 30 mins later. Water pressure could be stronger but people should really relax and not complain about every little thing - you're on holiday and some things are out of anyone's control so you just gotta go with the flow. Overall, the hostel was clean and if anything needed attention it was promptly dealt with so couldn't ask for more. I'd recommend the Chelsea for the price, location and a quirky hostel with character.", "Date": "March 5, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "2", "Overall": "3.0", "Value": "3", "Sleep Quality": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Auckland, Auckland, New Zealand", "Title": "“Great location and average cleanliness”", "Author": "Johannes Y", "ReviewID": "UR124594267", "Content": "I should have gotten an alias; now I feel obligated to be neutral if not generous. The hotel is close to Penn Station and Times Square, which is a big plus. The lack of an elevator, on the other hand, is a minus, especially if you've got a lot of luggages with you, but good thing the staffs are happy to help you with the luggages so it's not too much of a problem. Inside your room, you can have a calm and soft conversation with the people on the street without having to raise your voice; I'm not sure whether that's an advantage or a disadvantage, but since the car honks quite often join your conversations, I guess most people would choose the latter. I've also used the showers in the hallway and the one in a superior room; the water pressure was weak. The apartments aren't entirely clean; there's a layer of dust on the floor. Furthermore, the toilet is occasionally faulty. I did not experience any livingstocks, my companions in the other room however, did. The staff members are friendly, namely the boy from Haiti and Mr Clermont. I wish Tripadvisor would let me rate out of 10 instead of 5.", "Date": "February 14, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "5.0", "Value": "5", "Sleep Quality": "3", "Rooms": "5", "Location": "5"}, "AuthorLocation": "The Netherlands", "Title": "“Very good for the price!”", "Author": "smattijs", "ReviewID": "UR124538359", "Content": "We stayed with the three of us one night at the Chelsea Star hotel in a deluxe room with one king-size bed and one sofa-bed. We were a little early but they already let us put our stuff in the room, while the maid was still busy. The sofabed was broken that afternoon, but when we returned that evening they had fixed it. Everything was clean. The location is really good and so is the price, I would return again. Front desk is not very fast, but very much willing to help you have a good time in NYC. Tip: bring earplugs, cause NYC is one loud city!", "Date": "February 13, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "4.0", "Value": "4", "Sleep Quality": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Calgary", "Title": "“Second Visit”", "Author": "JBen", "ReviewID": "UR124531546", "Content": "Just returned from my second stay at the Chelsea Star. I'm very surprised at the negative reviews by fellow travellers. I find the staff and location exceptional. The rooms are a good size for a NYC hotel. And for a budget hotel it was clean and in good repair. Dollar for dollar I am very satisfied and would highly recommend it for budget travellers. I would far prefer to spend my dollars on all that NYC has to offer and save a few bucks staying at the Chelsea Star.", "Date": "February 13, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "3", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Komarno", "Title": "“planning to stay at Chelsea Star in the future too”", "Author": "R N", "ReviewID": "UR124516971", "Content": "Usually I don’t write reviews but this time I could not resist, i always stay at the Chelsea star when I am in NYC (least 6times last few years) and I have to strongly disagree with the reviews before. The manager and also the staff were always kind and helpful. Best location – hotel is located next to the Penn Station in the middle of Manhattan from where you can access subway and trains. Noise – NEW YORK is the city which never sleeps. You can’t expect the entire city to be quiet just for you. Of course you can still ask for a backyard facing room which is a little quieter. Rooms – hotel has a variety of rooms – from dorms, single room with a shared bathroom through superior, deluxe rooms and also apartments so everyone can find the one which fits him (I prefer superior room with private bath) Cleanliness – the rooms are generally clean with daily towel changing I am planning to stay at this hotel in the future and I would recommend this for a friend.", "Date": "February 13, 2012"}, {"Ratings": {"Service": "1", "Cleanliness": "2", "Overall": "1.0", "Value": "1", "Sleep Quality": "2", "Rooms": "1", "Location": "4"}, "AuthorLocation": "auckland", "Title": "“Never again in my life!!”", "Author": "michelle l", "ReviewID": "UR124320071", "Content": "Terrible experience, first, there are rats!! The manager response to that was ''This is New York, there will be rats'' Toilet constantly gets blocked, their response was ''it's the forth floor it happens when it's so high up'' (Well i have stayed in hotels 10 floors and more high, never had that problem.) They overcharged my credit card three times the amount, luckily i checked before i left or i wouldn't have realize till much later, he said it was a system mistake. When refund did not show immediately, I questioned, manager's reply was ''we run a multi million dollar company here, we won't do anything about $90.00 refund, go to your bank and ask them'', talk about customer service!! Refund did show up 2 days after, but overall impression of hotel and staff was unreliable and unwelcoming, feels like a scam to stay there! After raging, they decided to give us 30% discount on room and compensation on the food eaten by the rats. Only positive place about this place? The location. If you want to live with rats, not having a working toilet to use, and possibly facing a very unfriendly manager, then stay here, but i advice you to constantly check your bank account to make sure they don't scam you. Otherwise, no matter how tight your budget is, please pick somewhere else. Never would i ever want to step into this place again.", "Date": "February 8, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "3.0", "Value": "4", "Sleep Quality": "2", "Rooms": "2", "Location": "5"}, "AuthorLocation": "", "Title": "“Okay if you are on a budget”", "Author": "Hundborg", "ReviewID": "UR123688647", "Content": "I stayed at Chelsea Star for 5 nights in oct. 2010. The rooms are a bit dated. The bed was horrible since the matress was cover in plastic under the sheet (probably to avoid bedbugs), and the plastic was crankling at night. The rooms has thin walls. The location is wonderful with everything within walking distance. The staff were friendly and helpful. We wanted a place to stay at night and that we got. The price is great compared to other hotels in Manhattan. I'd recommend it to anyone just looking for a affordable place to stay at night while in NYC.", "Date": "January 27, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Adelaide", "Title": "“Really good, great for price.”", "Author": "Schmaxx", "ReviewID": "UR122451885", "Content": "Like others who have reviewed, I was skeptical of the cheapish price and exterior of the building. But boy was I wrong! My friend and I shared a Dorm room with 2 bunkbeds in May 2011. We got upgraded from a 4-person dorm to our own 2-person room as it was available and the staff thought it would be nicer. It was very Clean and with good A/C!! Great in the warm summer heat of NY. As a Dorm we shared a couple of bathrooms with the rest of the floor, but no real problems there. It was really cheap for NY, but friendly service all round from the staff. There is a nice little communal outdoor seating area with tables and chairs available and is relatively quiet. It's in a good location, not too far from the big Penn Station, and the rest of NY. We had stayed 2 nights and enjoyed them both, especially the A/C. Recommended highly for those on a budget visiting NY.", "Date": "January 3, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "3.0", "Value": "4", "Sleep Quality": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Wales", "Title": "“Good location, great staff!!”", "Author": "Tezza06", "ReviewID": "UR121496719", "Content": "I stayed at the Chelsea Star for 6 nights in December and wanted to share my pro's and con's. The only thing I could fault the hotel on was that our room was facing 8th Avenue and was very noisy, especially Friday night and was constantly woken up by traffic. Also the shower on the 1st floor was cold and poor pressure so used the bathroom on the main floor which was lovely and hot!! Although the room was small (and got fuller and fuller with our shopping bags) it was big enough as all you do is sleep there. I took fleece pj's as I was expecting it to be cold but the hotel was lovely and warm and most nights only slept under the thin sheet. All the staff were really friendly and were able to offer recommendations and advice on where to go, what to do etc.....I couldn't fault any of them and appreciated all their help. The location was good as it was only a short walk from the subway, loads of shops, food and Times Square. All in all you get what you pay for at this budget hotel so don't be expecting the lap of luxury. It's clean enough, safe enough, good location, great staff and free wifi and coffee. There's no lift though so wouldn't stay here if you couldn't do quite a few stairs. I would definitely stay here again but would request a room at the rear of the hotel.", "Date": "December 7, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Sleep Quality": "2", "Rooms": "3", "Location": "3"}, "AuthorLocation": "San Diego, California", "Title": "“Clean Cheap Room under $100 bucks”", "Author": "TravelSeguro", "ReviewID": "UR121443426", "Content": "Stay in room # 302 with own bathroom, avoid the rooms facing the street, they aree too noisy! Overall, a clean place to get some rest, shower and get out to the city. Subways and Buses are 3 blocks away.", "Date": "December 6, 2011"}, {"Ratings": {"Service": "2", "Cleanliness": "2", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "2"}, "AuthorLocation": "Dubai, United Arab Emirates", "Title": "“Terrible”", "Author": "HHDXB", "ReviewID": "UR120631487", "Content": "I was recommended this hotel by a friend, and unfortunately something must have happened between her staying there and me staying there... The room was clean, although the linen was just provided (clean sheet - not sure if the blanket had been washed) bed was not actually made. My room had the bed built into the wall and an open plug source right near my face, so not sure about he alt and safety there. Ceiling had clearly been fixed and patched up (no fresh coat of paint or even an attempt to match up the paint in the room). Extremely noisy with people traipsing up and down the stairs constantly and doors slamming. Shared bathroom was always disgustingly dirty or occupied (don't actually know how people can make a place of cleanliness dirty, but they did) - and I didn't have a hot shower in all the time I was there, which (fortunately) was only 2 nights. Won't be staying here again - it was the only time that I felt unsafe in my entire 2 week NYC trip. I'd rather pay a bit more for a VAST improvement on what you get. On a positive note, the guy at the front desk was friendly.", "Date": "November 15, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Vancouver, Canada", "Title": "“A great way to see Manhattan on a budget”", "Author": "PucciniFan2011", "ReviewID": "UR120630828", "Content": "Chelsea Star Hotel is the best value for money in an expensive, world-class city like New York. I stayed in the 'dormitory' accommodation. At $ 60.00 per night, in a secure, clean facility - it was very good value. Comparable private accommodation in \"chain hotels\" seemed to start at $ 350.00 per night which is excessive. This was November 2011. The room and hotel premises are clean. Because the roomates in my room did things at different times than me, I only saw them for max 20 minutes each 24 hours, so it was like having a private room. It can be an issue if your roomates are anti-social or inconsiderate, but I was fortunate in that respect. I was respectful and my roomates from Switzerland, France and Brazil were respectful too. All in all a fantastic visit to New York - thanks Chelsea Star, especially John and Issa.", "Date": "November 15, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "5"}, "AuthorLocation": "Lausanne, Switzerland", "Title": "“What was that smell????”", "Author": "swiss-sarah", "ReviewID": "UR120231225", "Content": "This is the WORST hotel that we have ever stayed in, ever including a non-ventilated bunker in Verbier and a hut in Africa. DON'T GO HERE, it may pose a health risk!! The front staff are very helpful and charming, maybe this was to make up for the fact that the hotel rooms are seriously offensive. Our first stop after checking in was to buy some air-freshner for the room . big mistake buying the same one as I have at home because now every time the scent of 'white linen' hits my nose I am taken immediately back to the rancid stench of which we were trying to cover up! We stayed one night - granted most of this night was spend in the Irish bar across the road as we decided that the only way we could possibly sleep here was to get as drunk as possible. Even after checking out the next day, the smell followed us about - What was that smell anyway? Dead bodies, rotting flowers, the great unwashed - something lurking under the bed - we never checked that as we were too scared to put our heads near the floor to look under the bed. NEVER EVER stay in the place - it is a hole of stinking misery!", "Date": "November 6, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Apeldoorn, The Netherlands", "Title": "“Great when on budget”", "Author": "Sander J", "ReviewID": "UR119683501", "Content": "Rooms are small, but that's normal in NYC. Location is great. Penn-station is walking distance, and around the corner are multiple 24/7 stores and a Subway-restaurant. There are also a lot of restaurants close to the hotel. WiFi is free, and worked great. The rooms and bathrooms are cleaned daily. Don't expect a luxury hotel. It is a great hotel to stay when on a budget. It's clean, and offers everything you need. When in NYC you are only in your room to sleep.", "Date": "October 24, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Location": "3", "Rooms": "1"}, "AuthorLocation": "Cape town, South Africa", "Title": "“Horrible!!!”", "Author": "diekudus", "ReviewID": "UR116964226", "Content": "I booked this hotel ( superior room) over the internet for my stay in New York during August 2011. After 23 hours of traveling i arrived at the hotel at 1 pm and was not allowed to see the room before 3pm as this was the rules and they were not prepared to make any exception. I requested to see the room as it looked nothing like i imagined or what was advertised. The furniture is old and tacky, only certain channels of the \"flat screen\" tv worked, the shower was broken, the bath plug was not working, the flushing mechanism of the toilet was broken, the safe was left of the dresser table (not even mounted). When i brought this to the attention of the front office manager i was offered another room for the next day. Honesly, if you want to waste your money on this dump with yello hand painted stars on the roof and walls, be my guest. I eventually checked out the next morning and checked in at the Gem Hotel 300 W22 for $40 a night cheaper, with room service, coffee, tea in the room, clean linen and most of all professional, friendly staff... A full package and far superior than this rat hole. Its nothing what they advertise it to be... Be warned!!!!!!", "Date": "August 19, 2011"}, {"Ratings": {"Cleanliness": "1", "Sleep Quality": "1", "Overall": "1.0", "Value": "1", "Service": "1"}, "AuthorLocation": "Melbourne", "Title": "“Change of management? It's gone downhill”", "Author": "Pinkybee", "ReviewID": "UR116550529", "Content": "The new management are useless! BRING BACK JOHN! I've stayed here before and loved the first visit. Our 2nd visit in Dec 2010/Jan 2011 not so much. Our room had no heating during a blizzard and despite telling the staff earlier in the night they claimed that the heating was still being switched on, however at midnight and the radiators being stone cold they FINALLY moved us to another room and admitted the heating was broken. Stayed again in July 2011 and brought along friends who had come for our wedding. So disappointing as we had talked 3 into changing their booked accom to stay here so we could all be together. One of our friends turned up to be told his booked room wasn't available anymore but it turned out they had just screwed up their booking form. On our 2nd stay of the July trip our friend advised the staff we were checking in and that she gave permission for us to access her room as she had our bags. We turned up, checked in and were told we couldn't get our bags and that she needed to email them if she wanted us to go into her room. I understand that they were worried about security, however she had spoken to the same guy (the French guy) who said it was okay, we had shown our ID to him, he still said no. In the end she called him and went over it AGAIN and we were allowed in to get our bag. The internet still drops out on the first floor, I asked if they could reset the router as they had the 4 previous visits so that it would work but the same guy told me he would not as they never have internet problems. In 18 months and after 5 stays at this place I can assure you, the wifi drops out constantly on the first floor. He refused to press a button, just a mere button, it was too much to ask of him! We will never stay here again", "Date": "August 11, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "4.0", "Value": "5", "Service": "5"}, "AuthorLocation": "canada", "Title": "“well center”", "Author": "monicdavid", "ReviewID": "UR115924532", "Content": "This hotel is a easy getting there from the train station (Penn), 5 min. walk; easy getting around to visit and easy getting around to find a place to eat. . We received a very good service and the staff was open to optimize our room for a good price. The room was large enough with a clean bathroom, AC and TV. We recommend it for the private room.", "Date": "July 28, 2011"}, {"Ratings": {"Cleanliness": "3", "Sleep Quality": "2", "Overall": "2.0", "Value": "1"}, "AuthorLocation": "Warsaw, Poland", "Title": "“Don't go there”", "Author": "Jemand0", "ReviewID": "UR115770923", "Content": "The place consist of two parts: hotel and hostel. I stayed for 2 nights in hostel in 2-beded dorm. At first sight the hostel looked good. It had an attractive and nice decoration. The stuff is nice and helpful. The room was tiny and beside the bunk bed there was some kind of closet and a TV. The bathrooms were clean and generally ok, however there was only the one shower per storey - it was definitely not too much! If you expect any kitchen - forget it. There are no kitchen facilities except of a single microwave oven. And at the end, the worst thing - I saw several times the mices running in my room! IMO - The place is not worth staying there. It is expensive (I paid 60$/night) and doesn't offer anything more then overnight. If you would like to stay in Chelsea, better go to \"Chelsea International Hostel\", just few blocks away. You will get there better service and pay less.", "Date": "July 25, 2011"}, {"Ratings": {"Cleanliness": "3", "Sleep Quality": "2", "Overall": "4.0", "Value": "4", "Service": "5"}, "AuthorLocation": "Nottingham", "Title": "“Cute wee place, shame about the location”", "Author": "Tango_Tango45", "ReviewID": "UR115360167", "Content": "We arrived very late at night and we were welcomed in and upgraded to a private room which was great! All the artistry was so fun and the place was great. It is right nearby to Penn St station so if you dont want/need to be near times square; its a great midtown location. The air con was a bit loud but it was a great place for what we needed it for", "Date": "July 14, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Location": "4", "Rooms": "5"}, "AuthorLocation": "Perth, Western Australia", "Title": "“Great location, great staff, no kitchen!”", "Author": "Bec17", "ReviewID": "UR115231025", "Content": "Chelsea Star was a truly pleasant surprise. The staff are professional and friendly. The rooms are clean and secure- although my bed (top bunk) was a little wobbly. My room had air conditioning and a very clean bathroom. In fact, as far as hostels go, 'clean' would be the best word to describe it- a very important budget travel factor! Free wi-fi, nice deck area with power connections, umbrellas and deck chairs. Guest lounge is tiny- really just a room with a coffee machine, washer and dryer but what more do you need- there's enough to do in NYC without needing the hostel to entertain you! The only draw-back is that there's no kitchen, which makes eating a slightly more expensive venture, but if you don't want to go far, there's an incredible deli across the road. I read some really negative reviews about Chelsea before I arrived and I'll be honest- I'm yet to see any of the negatives I was expecting. I'd definitely stay here again! :)", "Date": "July 10, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "4.0", "Value": "4"}, "AuthorLocation": "Lehigh", "Title": "“Great place to stay in New York, affordable and close to everything!”", "Author": "EJUpHill", "ReviewID": "UR115044202", "Content": "Chelsea Star in New York City was a great place for our family to stay during our trip to NYC! It was the most affordable place I found when looking for a hotel. I wanted something close to Penn station and Chelsea Star is a block away. The room was all we needed, it was the Deluxe room that had two full beds and a private bath. chelsea Star also has other affordable rooms for the single traveler in which you share a bath down the hall. It was not fancy but everything was just what we needed. Everything was clean, they had coffee and tea available and a great patio to enjoy. A washer and dryer were available if needed. The only negative was that they did not have an elevator so we had to lug the suitcases up two flights of stairs. I would stay here again if going back to NYC! .", "Date": "July 5, 2011"}, {"Ratings": {"Cleanliness": "1", "Sleep Quality": "1", "Overall": "1.0", "Value": "1", "Service": "1"}, "AuthorLocation": "Toronto, Canada", "Title": "“Don't ever attempt in booking this hotel!! For REAL!”", "Author": "siusin021", "ReviewID": "UR115025363", "Content": "This hotel is very dodgy. They have charged my credit card even before I arrived and for some reason, my credit card bounced back and the card could not be used anymore (before a vacation, seriously!). After exchanging money and carrying cash to my destination, I didn't know it was the hotel's problem until I arrived late at night and they told me and showed me some e-mails that I wasn't aware of. The emails was in some other person's name (not my travel agent's name) and some other receipt showed me that the transaction didn't go through. Anyways, they even told me that the hotel was full and that I would have to go two blocks down to another area if I wanted to stay with them (they don't have elevators, so you have to move your luggage up and down the stairs before you get to the lobby or main doors). Luckily a young girl sitting at the lobby with her luggage told me that happened to her too! So I went over there and told her we should really get the hell out and find another hotel together. In the wee hours of the morning and a busy week in NYC, we were lucky to find a decent and better looking hotel for a higher price. Thank gosh! Anyhow, I thought that was the end of the whole situation and the hotel wouldn't bug me anymore. After 2 weeks later, my travel agent told me that they tried to charge her credit card again!! I think besides writing on this site, is there something else we could do? But Im not sure they have good measures in place if someone sued them or something?? JUST BECAREFUL OF THIS CHEAP DODGY CRAPPY HOTEL!!", "Date": "July 4, 2011"}, {"Ratings": {"Cleanliness": "2", "Sleep Quality": "2", "Overall": "3.0", "Value": "4", "Service": "5"}, "AuthorLocation": "Essex, England", "Title": "“Great location but remember that you get what you pay for!”", "Author": "Bowtell", "ReviewID": "UR111546097", "Content": "Right near the Penn station and the subway, it's a great base for moving around the city. The staff were wonderfully friendly and helpful. Cheap internet and free tea/coffee avaiIable. I booked a double room with shared bathroom for myself and a friend but we were upgraded to the private queen. The prices are very good for this sort of location but the hotel itself had several faults I'm not sure they can/will deal with as a budget hotel/hostel. 1) Stairs! Lots of stairs! The man behind reception was incredibly friendly and carried my case up the stairs for me as I was pregnant at the time but I still had to lug my tired butt up and down the stairs several times a day. 2) Noise. I know it's New York City but the windows were single glazed and there was lots of traffic noise. Luckily, my friend always packs earplugs! 3) Because it is also a hostel, you have lots of \"bohemian\" types that stay and there also appears to be some semi-permanent residents. There was a party in a room on our corridor and the staff went to stop it which led to a screaming fit at 3am about residental rights. 4) The shower was just a dribble in the private room. We didn't want to complain as it was a free upgrade, we just strolled down the hall to the shared showers or took a bath. 5) One day the maid just failed to show up to make the beds or refresh the towels. 6) Now this is the only reason I have rated the hotel as low as I have - the other elements I fully expect of a budget hotel.....on the last night a mouse ran from under the desk for a minute then ran back. All in all though, I can't complain for the price we paid for such a great location and friendly service. We felt safe and the rooms were well heated and secure.", "Date": "June 5, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Newcastle, Australia", "Title": "“Budget, Clean, Great Location”", "Author": "XXKobieXX", "ReviewID": "UR110034675", "Content": "The Chelsea Sat Hotel has been extended, therefore one half was slightly newer. These are where the apartments are, I believe. We stayed in the 4th floor apartment. Literally the only pain was the fact that there was no elevator, so hauling of our big suitcases was involved. Not much of problem if you ask me. The room was clean and plain. But for what we paid and where we were located it was above and beyond. You don't spend all that much time in your room, so why does it need to be flashy? Staff were very friendly. Penn station and madison Sq garden are round the corner- 5 min walk. Time Square is also within walking distance - maybe 10 min from memory. My friends and I got back quite late some nights and we felt safe in this area, but of course we were still being wary. = Fantastic New York experience!", "Date": "May 26, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Location": "5", "Rooms": "4"}, "AuthorLocation": "", "Title": "“I'd go again Great location and friendly service.”", "Author": "Peevery", "ReviewID": "UR106871119", "Content": "I had a private room with a private bathroom. It was clean, secure and I would stay here again. 10 minutes from classic tourist NY attractions, 3 books from major subway stations, great food around in south manhattan! John helped me when I got there android me everything I needed to know, supplied me with a map and some helpful tips and o was on my way! This is a great place for those travelling in a group, who aren't planning on spending a lot of time in their hotel room (not that it's a bad room), and who enjoying walking. Although this hotel is centrally located it is nice to be able to take the subway to the end of the line and walk the various villages to end up back at the Chelsea star. I was supposed to stay at another location and it was flooded so the booking agency I used moved me to this hotel/hostel. I booked my 3 day trip last minute so places were a little expensive. I am not sure about the price of the Chelsea star because i didn't have to pay any extra fees for having to be relocated.", "Date": "May 4, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "5.0", "Value": "5", "Sleep Quality": "2", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Vancouver, BC", "Title": "“Clean, Friendly, Central Hotel in New York City.”", "Author": "BCAmanda", "ReviewID": "UR101942617", "Content": "It is always difficult to find a clean, affordable place to stay in Manhattan. Chelsea Star Hotel was a great place to stay. I stayed in a 4 bed dorm style with shared bath. The bathroom was clean and had shelves to put things on. The water pressure was good and we had hot water everyday. You could hear quite a bit of street noise at night, so bring ear plugs! The staff was friendly and very helpful. This location is awesome. I walked to Time Square and Penn Station, and I could even walk to the Flat Iron District! The metro is only a couple blocks away, so it was very easy to get around. The roommates I had were amazing, and we ended up hanging out quite a bit too. It was a really great experience to stay here!", "Date": "March 28, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "3.0", "Value": "4", "Sleep Quality": "4", "Rooms": "2", "Location": "5"}, "AuthorLocation": "Melbourne, Australia", "Title": "“Average hotel, BRILLIANT location”", "Author": "jk121255", "ReviewID": "UR98153870", "Content": "After reading some of the reviews on Trip Advisor about the Chelsea Star, I was a bit worried about my stay. However, I would recommend it to travelers on a budget. Yes it doesn't have an elevator, and it's a \"walk-past-and-you'll-miss-it\" kind of place as it is literally a door in the side of the wall. The people at the front desk are really nice and helpful and will gladly lug your luggage up the stairs for you - I had an elephantine suitcase which the staff member cheerfully lumped upstairs for me. Make sure to get maps, brochures and coupons from the front desk :) It's a no frills kind of place. I stayed in a Superior room as I was pretty keen to have my own bathroom. The decor is pretty dated but the room was a decent size and was reasonably clean. The walls are kinda thin so you can hear if someone next door is watching TV or having a chat or walking down the hallway. But if you're in New York you're not going to spend that much time in your room anyway. The major draw card for the Chelsea Star Hotel is the location. It's right across the road from Madison Square Garden and Penn Station, and is a short walk to the Empire State Building, and the blue and red subway lines. You can even walk to Times Square and Fifth Avenue from there. As with the rest of New York there are heaps of eateries around the place, and if you're feeling lazy about breakfast options then the hotel is right above a Subway sandwich shop. The hotel itself is not fancy. The staff and the location is the main reason why I'd recommend it to other travelers.", "Date": "February 26, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "3", "Rooms": "4", "Location": "5"}, "AuthorLocation": "", "Title": "“Great Choice”", "Author": "Musigal", "ReviewID": "UR97766273", "Content": "I was scared after reading some of the reviews, but this was a fine hotel. There aren't any \"frills\" but it was very clean and the bathroom was new and had nice Mexican tile. Much much nicer than I expected. The bed was fairly comfortable. There was MUCH more space than I expected. Definitely great for the money. Would stay here again, but don't expect luxury. The desk staff were SO NICE, they even carried my overloaded suitcase down the stairs at the end of my stay because I was all dressed up for a singing gig. It's great for solo travelers! I felt safe walking there from Times Square at night. Definitely recommend. The best part was that it was also very warm on a cold winter's night. Some places skimp on the heat, but not this place. A+ Also, there was FREE internet wi-fi which my friends who paid double and stayed down the road at a lux hotel didn't even have-- they had to pay a lot of money for it.", "Date": "February 23, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Ipswich, United Kingdom", "Title": "“Excellent location!”", "Author": "popkid", "ReviewID": "UR93998878", "Content": "This hotel is in a brilliant location. Penn Station is practically opposite the hotel, which can get you anywhere....saying that, it's within walking distance to Madison Sq Garden, Empire State Building and Times Square. The staff here were excellent, couldn't fault them. My flight got delayed by a day and they found me a room for an extra night, and helped me keep checking my flights. I stayed in a dorm room and shared with 3 other people. We had 1 bathroom between the four of us which was fine. It was regularly cleaned and made some friends while I was there. Theres no food or alcohol allowed in rooms, which sucked a bit but can understand why, keeps everything tidy. It was freezing in NYC when I was there but our room was so so warm, it was lovely coming in from the cold. Heating was on full blast all day....it did get a bit too hot at night, and found it hard to sleep. The Wifi went down on the last 2 days and was 'waiting to be fixed' which was a bit of a pain, but as I said the staff helped me check flights etc.... when I needed to. Will be staying here again in December. Brilliant place if people are travelling alone or just wanting something cheap and cheerful.", "Date": "January 21, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "3", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Canberra, Australia", "Title": "“Awesome! love the location & helpful staff”", "Author": "vas_yieng", "ReviewID": "UR80653571", "Content": "Room is clean & cozy, fun decoration! Just short walk from the Penn Station, safe & convenient. Will stay there again for sure.", "Date": "September 22, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Wellington, New Zealand", "Title": "“Definitely a Star Attraction”", "Author": "mwrnz", "ReviewID": "UR72940077", "Content": "First up, I can't believe the negative reviews posted about this hotel. You get what you pay for, and having just spent two weeks at Chelsea Star I can honestly say it offers value for money, it's clean, has friendly staff and is ideally located. Sure, there are no lifts, the AC units can be noisy and you can hear the NYC nightlife occasionally going feral. But, hey, it's well priced. Our room was well cleaned on arrival, and was cleaned every day. The staff helped us with our cases, and always had a smile. The basement washing machine and dryer worked well, and were much cheaper than the nearby laundries. So give it a go people, after all you're in the Big Apple - you should be about and about for at least 18 hours a day anyway!", "Date": "July 30, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Kingston, Canada", "Title": "“I was nervous after reading other reviews, but I was pleasantly surprised.”", "Author": "Pinksandles", "ReviewID": "UR71690965", "Content": "The staff are very friendly and accommodating. You can ask them anything. The recommendation for the Greek place across the street was great! We came by train and it was a two minute walk from Penn station to the hotel. The hotel is made up of two buildings. We were traveling with another family who ended up in the other building. To get from our room to theirs we had to go down 3 flights of stairs outside then up 4 flights of stairs. We were told of this when we booked. If you are traveling with others you may want to request to be in the same building. The stairs are also a pain if you have a lot of heavy luggage. We had a large room with a kingsize bed which was quite comfortable, including the sheets and pillows. Although we were on 8th Ave. the window air conditioning unit blocked out the sounds from the street. My 14 year old slept on the pull-out couch and there was a cot for my 11 year old. Plenty of towels and pillows for all of us. No problems with the wifi. All in all, we would definitely go back to the Chelsea Star. I may just make sure to make requests for rooms near our traveling companions when booking.", "Date": "July 20, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "5", "Sleep Quality": "3", "Rooms": "2", "Location": "5"}, "AuthorLocation": "Colorado", "Title": "“Don't book then complain!”", "Author": "Budgetcouple", "ReviewID": "UR70512691", "Content": "This hotel is fine for a place to sleep. We had a double room with shared bath. Yes its small but there is room for your luggage and a place to sleep. It is nothing special except the location . Staff are friendly. There is a outside terrace area with a few tables to sit and relax. When you are buzzed in you are greeted with about 15 steep stairs to the check in desk. Then depending on where your room is you may have another 15 steep stairs to go up. You get what you pay for and if you are in NY to see the sights and/or enjoy the nightlife you are in a fantastic location. Walking distance to almost everything. Empire State building, Time Square, Penn Station and the pier.", "Date": "July 11, 2010"}, {"Ratings": {"Service": "2", "Cleanliness": "4", "Overall": "5.0", "Value": "4", "Sleep Quality": "2", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Melbourne", "Title": "“Amazing location! Returning in Dec”", "Author": "Pinkybee", "ReviewID": "UR69631176", "Content": "Loved the location, it's just so convenient to Penn Station and accessible to everywhere-my husband and I love to walk everywhere so may not be as described as the same by others who don't walk much. There are 2 delis on the corners, the best cheesecake and amazing pizza within a 1 min walk-couldn't think of a better location anywhere. The staff made some fantastic recommendations of places to visit and to eat (Joshua Tree and Starlight Diner). Staff are friendly, and will only engage with you if you go out of your way to engage with them- which suits us fine as we're pretty private people when we travel and keep to ourselves generally. It's loud as mentioned, but you get that in NYC so nothing to complain about. Rooms are small and a shared bathroom but you get that with affordable hostels. We found the rooms and bathrooms to be very clean and tidy. The only downside was that the free wifi was pretty slow and dropped out constantly. It's a hostel, if you've travelled before you'll get what you've booked :) Have booked a stay in Dec/Jan so pretty happy.", "Date": "July 4, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "1", "Overall": "2.0", "Value": "2", "Sleep Quality": "2", "Rooms": "2", "Location": "4"}, "AuthorLocation": "Stockholm", "Title": "“Don't try to save money on accommodation in NYC!”", "Author": "From_SwedenStockholm", "ReviewID": "UR65189643", "Content": "We didn't expect luxury, since it's one of the cheaper hotels in NYC/Manhattan, but we should have had a superior room and did exepect it to be at least cleaned before checking in. And even this hotel isn't really that cheap. First of all, they had overbooked the hotel, so we had to stay at another hotel the first night. We got compensated by getting a free upgrade to a appartment suite (with refridgerator and micro-wave) for the rest of our stay, which was good since they don't serve breakfast at the hotel. We had to check out from our first-night-hotel at 11 AM and we didn't get our room at Chelsea star until 2 PM and even then it wasn't properly cleaned. They had more or less just changed the bed linens and the towels. The floor was dusty, the kitchen sink was dirty with leftovers and the garbage can was full. I mean, they knew we were coming from the other hotel shortly after 11 AM and they could have started the cleaning round in our room, to get it done in time. During our stay I didn't see them clean any more either. Just fresh towels and they made the bed.", "Date": "May 24, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "2"}, "AuthorLocation": "Leeds, United Kingdom", "Title": "“Shocking!!!!!!”", "Author": "emmajohnson_hogg", "ReviewID": "UR63917313", "Content": "Please take my advice and never book into this dump - advertised as hotel on internet nothing more than a grubby hostel above a subway shop in realtiy, from start to finish was absolutely terribel, themed room = Dirty prison cell with Palm tree on the wall, both my boyfriend at I wept at the state of the place but seen as though we had checked in in the middle of the night (after waiting 1 hour outside in NYC with all passports/credit cards and money) on our first trip to NYC we had to endure one night in this tip. Nearly spoilt our valentines get way, booked into Hotel New Yorker next morning as would rather have slept on a bench in Central Park (Probably safer and cleaner). New Yorker Best Hotel in Manhatten and for not much more money. PS the bullet hole in the sign outside should have given us some indication of the place. Save yourself the heartache.", "Date": "May 12, 2010"}, {"Ratings": {"Service": "2", "Cleanliness": "2", "Overall": "3.0", "Value": "3", "Sleep Quality": "2", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Melbourne", "Title": "“can't beat the location, but that's about it”", "Author": "j_girl9", "ReviewID": "UR63915638", "Content": "The Chelsea Star Hotel is on the corner of West 30th and 8th Avenue so obviously there is a bit of noise in the background, but nothing that would stop me from sleeping. The location is good for a budget NYC hostel, however you can definitely get a nicer place for the same place a bit further out on the train line (see HI New York up on Columbus). I'm in a 6 Bed dorm all girls, the bathroom is quite large, with a shower/tub ensemble, mirror's a bit high (but I'm just short)... however there is a full length mirror, which is always a bonus! Lots of powerpoints, free really good wifi, small terrace/courtyard... BUT the one thing that will stop me from ever staying here again... STAIRS. There is no lift in this building, and for a couple of 5ft girls, dragging 20kg suitcases up stairs is NOT FUN. Overall, still a nice place if you're looking for a hostel right in the middle of the city, reasonably priced for the location, and if you can handle lugging your suitcase up the stairs :) Oh and no lockers in the room, and no kitchen (that I could find)... the website kinda talked this place up more.. however staff are friendly enough. It is a hostel not a hotel. -Bunk beds are super creaky, impossible to get off the top bunk without squeaking -You can hear people walking and talking in the corridor, the floor above you, and out in the courtyard :( -There's no hooks in the bathroom! However, it's a good place to set up camp if all you're going to do is sleep there- but if in New York again I would try another place.", "Date": "May 12, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "2", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Michigan", "Title": "“Great if you're on your own and don't mind bunk-beds”", "Author": "DocMoMan", "ReviewID": "UR63656573", "Content": "Lets me start with the bottom line. Three nights in Manhattan, across the road from Penn Station, in May... all for under a $100, is always a steal. Add a rat-free habitat, free WiFi (which worked 50% of the time) and a complimentary postcard and you have yourselves Chelsea Star Hostel on 30th and 7th in mid-town Manhattan. Now here’s the downside: you never know what kind of roommates you’re going to get. My room had 6 bunk beds in it. The room was spacious, clean wood floor and connected to another room (a much bigger one with 8 beds) by a short aisle that housed 4 smallish bathrooms (each with a dwarf sink and a reasonably clean shower). They are all shared, first-come first-(clean)get basis. Since I got up at 4:30 every morning, I mostly enjoyed an uncontaminated bathroom with a dry floor. Windows faced 30th street with sound of trucks, screaming pedestrians and police sirens kept entertaining me for most of the night into the wee hours of the morning. Fortunately, I had earphones and earplugs, so wasn’t bothered much. There is no cooling system in the room, not even a fan. When it hit the high 70s one night, it got really hot and humid in the room. So bring a tiny fan (air conditioner if possible). I had the upper tier bed so my downstair neighbor’s movements in the bed were not a source of bother for me. Can’t say the same thing for him/her (never got to see them because I would be the last one to arrive after everyone had fallen asleep). The location is great, service is so so (they basically stay out of your business), hygiene is acceptable for a single person (not if you have kids) and the price unmatched. I will put forth a guarded recommendation – stay here only if you can’t find anyplace that’s less than $100 a night.", "Date": "May 9, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "4", "Sleep Quality": "2", "Rooms": "2", "Location": "4"}, "AuthorLocation": "Columbus, Ohio", "Title": "“What you pay is what you get”", "Author": "sam20093", "ReviewID": "UR60281480", "Content": "Upon arriving in the Chelsea Star hotel, I was feeling somewhat apprehensive living in a 8 bunk bed room. Never have I stayed in a hostel before and twas an interesting experience, to say the least. The room size was decent, it was connected to the other bedroom which made me feel a little uncomfortable. It felt like a 16 person room. The bathroom was tiny. I couldn't wash my face without splashing water everywhere! They also didn't provide towels which was a huge turnoff. The bed was relatively comfortable despite the annoying noise it made. Needless to say, my expereince staying in the Chelsea Star was average. I paid $30/night so I guess what you pay is what you get.", "Date": "April 3, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "5", "Overall": "1.0", "Value": "1", "Location": "3", "Rooms": "1"}, "AuthorLocation": "Cork, Ireland", "Title": "“Do not stay in chelsea star!!!!”", "Author": "dermc26", "ReviewID": "UR59483018", "Content": "This hostel is really expenseive for what its offering, and they falsely advertise. I booked a twin room with ensuite, which was meant to be 2 single beds, and turned out to be a very small double bed, to be fair, they were good about refunding the booking, but its a pretty crap place to stay having seen what is available!!!", "Date": "March 25, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Location": "5", "Rooms": "2"}, "AuthorLocation": "Australia", "Title": "“Good budget choice in a great location”", "Author": "IndigoClover", "ReviewID": "UR51978229", "Content": "We stayed in the Japanese themed room (double room with shared bathroom). Hotel was clean and comfortable. The room was very small but that didn't worry us as we only used to to sleep in. The noise from 8th Avenue is loud (as others have mentioned), however, I'm not sure it would be much better elsewhere in midtown. I got earplugs and was fine. The shared bathroom was kept very clean. However, it was quiet busy in the morning around 8o'clockish and we had to wait a couple of times to get in (no wait in the evenings or early morning). The hotel is located close to Penn station, Madison Square Garden, the Empire State building and Macy's. It is also close to all the main subway lines (except the green one which you can just transfer to later down the line). Times Square was approx 15mins walk. Staff were very friendly and helpful. I would recommend this hotel to anyone on a budget wanting a good location.", "Date": "December 28, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Location": "4", "Rooms": "3"}, "AuthorLocation": "Melbourne", "Title": "“Nice experience!”", "Author": "Lucyingemann", "ReviewID": "UR50844840", "Content": "Obviously being a budget hotel, it isn't fancy in the least, but it is safe, the staff are extremlely friendly, and the location is fabulous! We had a private room which was of a good size, and had a nice newly renovated bathroom. This hostel is within walking distance of everywhere, you can walk down into chelsea, and greenwich village and across the broadway or opposite direction up into the upper west side, and times square etc.. The only complaint i have is of the strong noice from 8th ave, as New Yorkers have serious beeping their horn problems and it is never quiet! Also there is a nightclub across the road so on a saturday night - dont expect to sleep! There are also mattress protecters on the bed's so that you are sure that you will not get eaten alive whilst you sleep by bed bugs! All in all pleasant experience as in NYC, u rarely spend time in your room, so this is the type of place where you can base yourself and go off and explore the amazing city without feeling guilty of expensive hotel costs. :)", "Date": "December 7, 2009"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "", "Title": "“Small but nice”", "Author": "lgetwan", "ReviewID": "UR50653004", "Content": "Single rooms in the Chelsea Star hotel are quite small, but painted & equipped nicely and very clean. The noise from the 8th avenue is remarkable, but hey, it's the city that never sleeps! ;-)", "Date": "December 4, 2009"}, {"Ratings": {"Service": "1", "Cleanliness": "2", "Overall": "1.0", "Value": "1", "Location": "3", "Rooms": "1"}, "AuthorLocation": "United States", "Title": "“Unless you like furry company and lots of noise, go elsewhere!”", "Author": "emmka", "ReviewID": "UR50308303", "Content": "The same night we checked in we saw a mouse run in our room. We found droppings from the mouse in our bathroom on numerous occasions. Our door was left wide open by housekeeping (which appeared to have done nothing all week except empty the trash). We stayed in a dorm room and had also reserved an apartment suite. Part of our party arrived two nights before the rest of the party. We asked to see the apartment and talked to them about it two times. However, the night before the rest of our party arrived we were told the apartment had been given away. The noise is horrible! There were people talking outside our windows all night long. Not a place for young children with the language we heard. Had to use ear plugs, but still heard plenty of noise. Hard mattresses and cheap bunk beds. Very disappointed and would never recommend this hotel to anyone.", "Date": "November 29, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Location": "5", "Rooms": "2"}, "AuthorLocation": "Reykjavík", "Title": "“A great choice for the budget traveler”", "Author": "ibboibbo", "ReviewID": "UR50010242", "Content": "We received a warm welcome from the very friendly staff when we arrived at the hotel. We had quite a luggage which we had to carry all the way up to the second floor of the hotel. With that tedious job out of the way, we were happy to find that our double room was quite nice - small, but very nice with a view over 8th avenue. The room was clean, and the shared bathroom/shower was always spot clean and relatively unoccupied in spite of the hotel being fully booked when we were there. It would have been nice to get Internet access in the room, but there was a nice terrace next to the service desk where you could sit outside and connect to the Internet. In all, I must say that this is a good choice for the budget traveler. The room we stayed in was extremely tiny but we managed to stay there although we had four fully loaded suitcases by the end of our stay. Don't expect any luxuries there since this is in fact a budget hotel, but a very nice one at that - One I would definitely recommend to fellow budget travelers looking for a stay in NY at a good location, with friendly staff, for a reasonable price.", "Date": "November 24, 2009"}, {"Ratings": {"Service": "1", "Cleanliness": "5", "Overall": "3.0", "Value": "2", "Location": "4", "Rooms": "3"}, "AuthorLocation": "Auckland", "Title": "“Nice decor/location...poor service”", "Author": "luci144", "ReviewID": "UR49582032", "Content": "We stayed here for a week in November whilst holidaying in NYC. At first we were excited to see the lovely decor of the hostel - clean bathrooms, brightly coloured walls, a lovely terrace with tables and chairs and a nice room. We had a double bunk bed and a TV, so it was very cosy. You do have to walk up a staircase when you enter...you can get one of the staff to bring your bags up if necessary. There's no lift. The wait for the shower was a bit ridiculous as there was only 1 per floor, so you'd set the alarm to get up nice and early but could be looking at a long wait. Nothing too dire though. There were 3 toilets per floor which was good. For the price we paid (this was the most expensive of 3 hostels we stayed at in America), our expectations weren't met. Our first hostel was half the price for pretty much the same duration stay and also included free breakfast and wonderful service. I was in the top bunk and only had a bottom sheet and very thin blanket. Our first night, we were both freezing and asked for extra blankets the following day - they never came. We asked two more times after this for extras and again, they made a note but they never arrived! Three times!? Our room was also quite noisy and it was sometimes difficult to sleep (not the hostel's fault however). Otherwise, the room was comfortable and the location was good. The worst thing was that this hostel insisted they had organised us a 4am airport shuttle for when we checked out. We confirmed this twice the day before and they were very casual and reassuring it would be there. At 4am that morning, the shuttle hadn't arrived. In 15 minutes, the guy on the counter rang dispatch and they hadn't received a booking. Surprise surprise. At this stage, we were panicked about getting to the airport while the hostel guy wanted all the details so he could file a report with management. He said a taxi would take 20 minutes to arrive so we were best to go out onto the road and hail one ourselves. We each had 2 suitcases and a handbag and no key to get back into the hostel, so I had to wait with all the bags, holding the door open in the hallway while my friend had to run out and flag one down. We felt this was appalling and unfair on 2 girls at 4am. Luckily we got one, but all this stress so early before our flight didn't seem necessary! We feel better service would have made all the difference.", "Date": "November 19, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "3", "Overall": "3.0", "Value": "5", "Location": "5", "Rooms": "3"}, "AuthorLocation": "Massachusetts", "Title": "“Funky with great staff!”", "Author": "cootmom", "ReviewID": "UR49215808", "Content": "I liked my room w/private bath, very clean and bed very comfortable. The desk staff were the friendliest, offering me an umbrella and a lot of good advice. The location is perfect, right near Penn Station and convenient to every subway line. Only drawback was a very noisy street outside but what can you do? It's New York! They let me check in early and let me leave my luggage after I checked out. Perfect for budget travelers and the non-fussy about amenities. There is no elevator, although the staff helped me carry my bag up. Good exercise!", "Date": "November 14, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Bern, Switzerland", "Title": "“Great value in the heart of big apple!”", "Author": "salvitraveller", "ReviewID": "UR48883442", "Content": "We think, to have found the best deal in New York City! Very good prices and perfect location opposite Madison Square Garden. Although booked the smallest room (shared bath), we got a free upgrade (bigger room with private bath!) because of non-availability of the small room! According to other comments, this seems to be a common behaviour... :-)", "Date": "November 10, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Location": "4", "Rooms": "2"}, "AuthorLocation": "Cairns", "Title": "“Good location, ok rooms and value”", "Author": "bel81", "ReviewID": "UR48208623", "Content": "I stayed at the Chelsea Star Hotel for 5 nights in Oct 09. All the reception staff I encountered were very friendly and helpful, even when I told them at 11pm at night that my TV remote control was not working. After a change of batteries did not work, they organised for house cleaning to leave me a new one the following day which was greatly appreciated. The room I stayed in was basic - bed, chair, small rack with 3 coat hangers, and a small TV. It took me a few days to realise the smell that hit me each time I opened the door was in fact the smell of the Subway downstairs.... it wasn't unpleasant, but not overly enjoyable either. The bed was comfortable. My only complaint would be the white blinds on the window behind the bed that do absolutely nothing to block out the light from the street. I ended up buying a sleeping mask. The noise level was what I'd expected for a hotel on the corner of 8th Ave. The location was terrific - I went to sporting events at Madison Square Garden on 2 of the 5 nights and it literally took me less than 5 minutes to walk back to the hotel. It is extremely close to the subway entrances to Penn Station.", "Date": "October 31, 2009"}, {"Ratings": {"Overall": "1.0", "Value": "1"}, "AuthorLocation": "Toronto", "Title": "“Unexpected”", "Author": "Ilan_M", "ReviewID": "UR47546471", "Content": "I booked a room for three nights via the web, received the confirmation. When I went to the the hotel the front door was locked and a note said no vacancy. I rang the bell and when I walked upstairs, front desk staff told that all rooms are booked. Even though I had a confirmation, the front desk staff keep telling me to come back next day since no rooms available. Later I was able to find an other hotel near by. Still Chelsea star hotel charged my credit card, now I have to waste more time on getting a refund!!.. poorly managed hotel", "Date": "October 23, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "3", "Overall": "3.0", "Value": "5", "Location": "4", "Rooms": "3"}, "AuthorLocation": "Birmingham, UK", "Title": "“A great budget place in NYC”", "Author": "claire1976_9", "ReviewID": "UR46518313", "Content": "We were on a three week trip in the US and couldn't afford the expensive places in the city so we found this budget place. The reviews were good and the price was okay. We were pleasantly surprised. It's got a real hostel feel so pretty laid back. The staff were really friendly and went out of their way to help you. It was close to a subway stop which meant we could catch the subway from the airport to the hotel, and was easy access for all the main attractions. The traffic outside was quiet noisy but you would get that anywhere in New York, but the hotel itself was quiet. We had a shared bathroom which was fine, but as with any shared bathrooms, we sometimes had to queue and it got a bit flooded, but just go in with your flip flops and it's fine! Would definitely recommend this as a place to stay if you're on a budget. It had internet access, free maps, washing machine and a nice outside terrace to sit on.", "Date": "October 11, 2009"}, {"Ratings": {"Overall": "2.0"}, "AuthorLocation": "England", "Title": "“TINY rooms, literally a bed in a box! take earplugs!”", "Author": "cityangel87", "ReviewID": "UR41052306", "Content": "We stayed in one of the private rooms in the Chelsea Star for 5 nights in July. It was our first time staying in a hostel and we didn't expect anything flash, just the basics. We were greeted by extremely friendly and helpful staff at the reception desk and our check in was very smooth. The first thing we noticed when we opened the door was how ridiculously tiny the room was! It fit a double bed, but there was no room to move around, especially when we got our suitcases in. The bathrooms were very clean and we always got up early so never had to queue to use them. We got clean towels every day and I have no complaints to make about the cleanliness of the hotel or our room. I have nothing but praise for the staff at the Chelsea Star - they helped us with everything from where to go for a good night to how to use the subway system! The hotel is located on W 30th Street, just off 8th Avenue and is a great location for exploring the city. It is very close to Penn Station and Madison Square Garden, and Times Square is a simple 10-15 minute walk. One of the things I do have to comment on about this hotel is the level of noise at night. There must be a nightclub located nearby, as I was kept awake every night by people fighting and shouting in the streets and it was quite scary! that was the main issue for me, so if you decide to stay here, take earplugs! I would recommend this hotel as a place to stay if you are looking for something basic and can put up with the noise on a night! I've stayed in many hostels since the Chelsea Star and have had better experiences", "Date": "September 12, 2009"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Overall": "2.0", "Value": "3", "Location": "4", "Rooms": "1"}, "AuthorLocation": "Australia", "Title": "“Tiny room.... VERY noisy!”", "Author": "YIWAN", "ReviewID": "UR40150566", "Content": "Steep flight of metal stairs from street to hotel (situated above shops) so be prepared to struggle up with your luggage.... then found that the room we had booked for three nights was not available.... we were two friends travelling together so we had requested a room with two beds.... they INSISTED that the 'twin room' we booked meant one with ONE small double bed in it.... too late to find somewhere else.... We had the room next to the shower and toilets (shared by all rooms.....) with the American flag painted on all four walls.... when standing in the middle of the room you could reach out and TOUCH BOTH WALLS! At least we didn't feel encouraged to spend any time in the room other than to sleep.... which WAS difficult as the traffic and street noises outside our window kept getting louder as the night went on..... Clean towels were provided daily and the hotel (really just a hostel...) felt safe and in a good location, just a couple of blocks up from Penn Station. Cheap taco restaurant ($2!) nearby.", "Date": "September 8, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Location": "3", "Rooms": "3"}, "AuthorLocation": "London", "Title": "“Great hostel if you're expecting a hostel”", "Author": "Erica_B1979", "ReviewID": "UR39556400", "Content": "I booked this hostel for myself (British) and my american friend from California. I thought the hostel was great, she hated it. Though she did admit that it was very clean and that the staff were very friendly. Basically this is just a small room with a bed (and TV). But it doesn't have all the commodities and comfort as would have a 3-4* hotel. But as a hostel it's fantastic and way better than the London hostels or even some of the dump hole 3*hotels you can find here in London. I don't think we had the best room though (coney Island theme), the room next to us looked a lot better (sorry I don't remember room numbers!). The location is great and its very clean and staff are very helpful. Warning very central so therefore very noisy! The shared bathroom was always very clean. So if your visiting NYC and looking for a cheap but clean place to sleep after a day of visiting this is your place. If your looking for a Hotel room then look else where. I will definitely go back here, my american friend definitely not.", "Date": "September 2, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "2", "Overall": "2.0", "Value": "2", "Location": "2", "Rooms": "2"}, "AuthorLocation": "cat1983", "Title": "“Only if your DESPERATE”", "Author": "Cathal M", "ReviewID": "UR34395315", "Content": "This was a hotel on the second floor of a building that looke like a back entrance to a shop or resturant. their is no stairs so if you have alot of bags or heavy bags then your in trouble. The rooms are clean but small. the have shared bathrooms that must only be cleaned once a day as i arrived late evening about 8pm and the toilet bins was overflowing. the hotel does have outside patio that you can smoke or drink if you wish. the internet is $2 dollars for 20 minutes. overall only if you have on a budget and desperate would i say for you to stay here.", "Date": "July 10, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Location": "5", "Rooms": "4"}, "AuthorLocation": "New York City, New York", "Title": "“great location, great staff, very helpful staff”", "Author": "Maria59066", "ReviewID": "UR33155950", "Content": "The staff were very helpful. The location was excellent, 2 min walk to trains station. Lots of good places to eat close by and you can walk to great shopping areas. The room was excellent, had everything i needed.", "Date": "June 25, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Location": "4", "Rooms": "4"}, "AuthorLocation": "Brasil", "Title": "“wonderful stay, really nice staff”", "Author": "flaviabass", "ReviewID": "UR32833943", "Content": "I stayed in a dorm room, there were no lockers, but definetely it was not a problem. A little too small when the room is full because everybody gets too much luggage.. but it's ok. I met some really nice guys from Israel, Germany and Spain.. and we've had some fun together. The staff was really very nice, helpful and I have nothing to complain about that. They didn't change the linen during my whole stay, but I had taken mine, so it was ok for me as I had foreseen it. Internet for $2 (20 min), free coffee in the morning, hot water shower... I'd go back.", "Date": "June 21, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Location": "5", "Rooms": "4"}, "AuthorLocation": "newcastle upon tyne", "Title": "“Excellent Location”", "Author": "eileen24", "ReviewID": "UR31778824", "Content": "Our first impressions from outside of the hotel was OH MY GOD what have we let ourselves in for, as basically it was a secured blue door with a flower stall next to it. We pressed the buzzer and was admitted into the building, I struggled up a steep flight of stairs with both my friend's case and my own as she has back problems. However there to greet us was a lovely guy on reception who couldn't be more helpful advising us on the hotel conduct and although he could not leave the desk (hence me lugging up the cases) was realy pleasant and helpful. We had room203 which was a cosy room which had a comfortable queen size bed and colour tv, air con and very clean spacious bathroom. The location is excellent and the day staff were very pleasant and helpful advising us where and where not to go. Clean towels were issued daily and plenty of toiletries were provided. There was internet access, washer, dryer, telephones, coffee making facilities down in the basement as you enter the front door to the left. All in all very good value for money, clean, friendly and excellent location.", "Date": "June 7, 2009"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Overall": "2.0", "Value": "2", "Location": "2", "Rooms": "1"}, "AuthorLocation": "R_1970", "Title": "“You dont get what you paid for”", "Author": "R_1970", "ReviewID": "UR29389369", "Content": "I staid here with friends because they were low on cash so they staid in a the bunk rooms they had fun even though they were accused of not paying and were woken up at 830 am by staff cleaning the room but they were happy with the $35 a night stay, i had a privet room with bath tv that only had 3 working channels no a/c and the hot water didn't work. Like i said i only staid here because i wanted to be near my friends but next time i think i will pay the difference in price for them and stay at a nicer place, if your low on cash and want to stay in a bunk room I guess this is your best bet but if your looking for a nice clean cheep place with amenities you can do better", "Date": "May 5, 2009"}, {"Ratings": {"Service": "1", "Cleanliness": "2", "Overall": "2.0", "Value": "3", "Location": "5", "Rooms": "2"}, "AuthorLocation": "New York", "Title": "“Disappointing”", "Author": "littleurchin28", "ReviewID": "UR28918390", "Content": "Stayed there numerous times in 5 years. Last time, the place seemed run down, even after remodeling. When I was there twice in the fall, they were friendly, upgraded my room and it was clean. Six months later, the room I stayed in happened to be the same one I stayed in before and it was pretty beat up. TV was broken, the paint on the walls was chipped and scuffed and the bathrooms were always a mess. Nobody helped me carry my suitcase to my room and they seemed like I was bothering them every time I asked a question at the front desk. The straw that brok the camel's back was when I went to pick up my luggage from storage after I checked out, the guy told me to get it myself! It was buried under two HUGE sports bags that weighed about 60lbs. each. I was struggling to dig my bag out and he looked right at me and didn't even offer to help after I paid $3 to have it stored. The internet service is worse than dial-up and the wireless signal continuously cuts out. I regularly stay at the Chelsea Star, but I'm questioning whether I'll ever go back. If you're going to Madison Square Garden, the location can't be beat, but I'd check out other hotels in the area first. I am extremely disappointed in the down-turn this place has taken.", "Date": "April 28, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "4", "Rooms": "4"}, "AuthorLocation": "new york", "Title": "“What a WONDERFUL hotel !!!!!!”", "Author": "Cookieavenue", "ReviewID": "UR27698935", "Content": "My wife and I stayed at the Chelsea star hotel for a week and it was GREAT !! The hotel is located one block away from 34 street Penn station which was very convenient because getting off the train it was easy to spot (big yellow building right at the corner of 8th ave). The Chelsea star hotel is a walk up hotel, I wish they had an elevator but that was a minor inconvenience because when we ring the door bell a young man with a Chelsea star shirt told us to walk right up and he brought our bags right up the stair case. When checking in we were greeted by the concierge which was really helpful, explaining how to get around in the city, places to go and eat and gave us discount passes to clubs and museums. We reserve a Superior room for $189 plus tax but he told us that we were getting an upgrade to a Deluxe room which was amazing. The room was very clean,comfortable and spacious but located on 8 ave which was quite noisy at times but we use ear plugs so that wasn't much of a problem. The house keepers changed our sheets everyday which was a plus. There was also a lounge area in which you can drink and eat which was very funky with all the lights. When checking out we needed help with transportation and so the front desk ordered a car to pick us up at the hotel and they also stored our bags for a fee of $2 dollars for big bags. I recommend this hotel to those who are looking for a discount and great service and great location, def will book again in the future.", "Date": "April 9, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Kennewick, Washington", "Title": "“Best For The Budget!”", "Author": "redbearwa", "ReviewID": "UR27382449", "Content": "Absolutely my favorite hotel in New York City! If you are going to NYC on a budget . Located, just across Madison Square Garden,Penn station and the A C E subway lines. It's central to broadway and shopping areas.Although small in size, the unique themed rooms make up for alot! Great Staff cant wait to return.", "Date": "April 4, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Knoxville, Tennessee", "Title": "“Quiet, comfortable and affordable”", "Author": "tumbleweeds023", "ReviewID": "UR26227201", "Content": "Reviews on Tripadvisor were generally so positive that we thought we'd give this place a try. We checked in with no problem after booking on-line and requesting a quiet room because we were just getting back from a really, really long flight. The man at the desk told us that he upgraded us from a double room to a queen en suite at the same price, which was really nice. The room turned out to be very, very quiet, clean and comfortable - for the price, actually, it was a great deal! The bed was comfortable, the bathroom had all the amenities and it had a good, safe feel about it. That morning, there was a pot of coffee on the main level for guest's use, and breakfast was just a minute away by foot. Location was excellent - less than 2 blocks from Penn Station and very convenient to many restaurants, it's in a lively part of the city. The only negative that I could give it was having to haul our considerable luggage up a narrow flight of stairs to the check-in area and up a second narrow flight of stairs to the room. But all things considered, that was a very minor inconvenience!", "Date": "March 15, 2009"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Colorado", "Title": "“Nothing major to complain about, what a deal! Great staff too!”", "Author": "oregongirl", "ReviewID": "UR24409041", "Content": "I highly recommend this hotel for anyone on a budget. The Chelsea Star has a great location just a few blocks from Penn station and every hub you want to connect to, plus it is a short walk up to 34 avenue from 30th and from there, great shopping, access to Times square, old diners, etc. My husband and I stayed here for a few days while visiting our son and while he attended Comicon. We requested a superior room in a quiet area (we had room 304) which comes with its own bathroom complete with tub/shower. Our room was exceptionally clean and comfortable, basic but what else do you need? Our bath was tiled in blue and yellow, kept very clean. We did have to request two extra towels and pillows as you get just the basics, but we requested extra and picked them up at the front desk and it was not a problem. Like all the other linens and bedding, they were very clean. Each day our bed was changed and made up and bath cleaned, etc.. Part of the hotel is a hostel, but if you want privacy and your own bath, the superior room is the way to go. Cost? Inexpensive for two people in NYC at only $119 before tax per night. The front desk clerks were helpful and kind and the two we spoke with went out of their way to help us out. There is a faint odor of pizza through the building, I think it is because there is a microwave in one area where people constantly warm up slices of NY pizza, and the walls are not soundproof--we could hear the people upstairs stomping on the floor in the middle of the night, but it wasn't that big of a deal. As for mice--not a sign of them. We had food in our room and wastebaskets with food containers and scraps and no signs of mice. I think it depends on the part of the building you go to. When we return to NYC, we will definitely stay here again, but if you want luxury, large rooms, room service, with a high price tag, this isn't going to be your pick.", "Date": "February 9, 2009"}, {"Ratings": {"Cleanliness": "4", "Business service (e.g., internet access)": "4", "Check in / front desk": "4", "Overall": "4.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Sydney", "Title": "“Great place for a great price in New York CIty”", "Author": "parkoSydney", "ReviewID": "UR24066243", "Content": "We needed a hotel in NYC for 5 people without having to get 2 hotel rooms and we found this gem. Location is great, not far off 34th st area and surrounded by subway stops. The apartment we had was on the top floor of the annex building next door and was 3 flights of narrow stairs up which was the only down side. On arrival they organised some guys to help us up with our luggage. The apt was really big and we had plenty of room for 4 teens + 1 adult and lots of luggage. Kitchen basic but great for breakky and snacks. TV mostly had great reception and the heating was good - too good sometimes and we had to leave windows open a bit and the apt was cleaned daily. We didnt need the hotel staff for advise so I cant say either way on that but for the price it was a great place to spend a week.", "Date": "January 31, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Business service (e.g., internet access)": "3", "Check in / front desk": "3", "Overall": "3.0", "Value": "4", "Rooms": "3", "Location": "4"}, "AuthorLocation": "London", "Title": "“Cheap and central, but cheap for a reason”", "Author": "Funktious", "ReviewID": "UR23294622", "Content": "If you're on a budget but want to stay in central New York then you could do worse than the Chelsea Star, but there's a reason it's cheap! Good points first; wonderfully central, friendly staff, lots of tourist information scattered around, internet in the lobby. Our deluxe room was large and clean and we felt safe. The down side however, was the noise from 5th Avenue, which yes, you have to expect from such a central location but was incredibly difficult to sleep through. And then there was the mouse... I must reiterate, the room was definitely clean, but having some chocolate in a bag on the sofa, we soon discovered that New York mice have an incredible sense of smell and spent an entertaining 20 minutes in the middle of the night chasing a mouse out of the room! And that's the attitude you need for the Chelsea Star; you're staying in central New York for a pittance, so it's worth putting up with the noise and potential mice! If you don't think you can, then book somewhere a bit more expensive or further out.", "Date": "January 5, 2009"}, {"Ratings": {"Service": "1", "Cleanliness": "3", "Check in / front desk": "1", "Overall": "2.0", "Value": "2", "Rooms": "3", "Location": "4"}, "AuthorLocation": "SLC, UT", "Title": "“Dumped on Street!”", "Author": "mannswiss", "ReviewID": "UR23083533", "Content": "Chelsea Star dumped us on the street at midnight! We had to find another place to sleep! Read below for the story. Pros of the Chelsea Star: Relatively Clean Location Cons of the Chelsea Star: Noisy all night from the traffic of a very busy 8th Ave. - and low quality windows/insulation of the room They messed up our reservation, dumped us on the street, and didn't take any responsibility for their mistake, they didn't even offer an apology. Our experience: Our original reservation was for a 4 night stay for 8 people occupying an entire 8 person dorm room. We were able to secure very good cheap tickets to the broadway show “Wicked” the day after our original checkout date. We called and changed the reservation to a 5 night stay. We made a follow up call about a month later to confirm that the reservation had indeed been extended to include that 5th night. Both times we called, to change the reservation and then to confirm the reservation change, we were assured that everything was fine and that the 5th night (dates were reiterated) was reserved. When the first part of our group arrived in Manhattan and tried to check in they were not allowed to because they were too early (even though we had asked the Chelsea Star in advance that it be alright for us to come that early). The did let us leave our bags behind the check-in desk but no paperwork or payment was processed. When the second part of our group arrived (different flight) and checked in Chelsea Star would not let us do so unless we paid for the entire group. So a member of this smaller group who was not the head of our group and subsequently did not make the reservation paid with a credit card. Chelsea Star did not collect any contact information nor did they provide us any paperwork outlining reservation details or such. Being jet-lagged and tired and overwhelmed by the busyness of the city and assuming we were dealing with a responsible company we did not verify that what we had there is what we actually had reserved (it would have been wise for us to verify that Chelsea Star had not messed up our reservation). We enjoyed our vacation until on the 5th night we returned to Chelsea Star at approximately 11:30 PM and we found all of our belongings in plastic bags mixed together and piled on top of each other in a storage room. The Chelsea Star front desk staff member informed us that our room was now occupied by other people and we needed to get out. We were kicked out on the street with our belongings in garbage bags at almost midnight to find somewhere to sleep. So we ended up dragging our our belongings a few blocks down the street to the Chelsea International Hostel where they had vacancy (per the Chelsea Star staff member). Needless to say the stress and fear of not knowing where to go for shelter in the middle of the night, along with the late hour of the night, we did not have a good night sleep, we were stressed beyond belief, agitated at each other, and had a miserable time the next day. It really ruined our overall experience. After the vacation (and as we were getting kicked out) when we tried to talk to the Chelsea Star staff and manager we got a very aggressive and derogatory response from them that basically told us that they had done nothing wrong, we were at fault, and they frankly didn't care – they had our money and good riddance; go find somewhere else to sleep. We understand that mistakes happen. They made the mistake of messing up our reservation, we didn't catch their mistake. We would have appreciated them doing all they could to make up for it. We didn't expect them to kick out other guests – that isn't fair to the other guests who did nothing wrong. It would have been professional if they had found us another place to stay, given us time and space to pack up our things, arranged for transportation to the new place to stay, offered an apology for the mistake, paid for our stay elsewhere, and/ or refunded some or all of our cost of our stay. (Any single one or combination of these things would have been much better than – get out “I don't want to have to deal with this at midnight” - and we do have an audio recording of the staff member saying that to us). (I personally own my own business and when I make a mistake I do everything that I can to make it right. It is the right thing to do and I care about my customers. Not good business practices to act like the Chelsea Star did at the time of our stay and since then.) As you can tell if you are reading this review we still have very strong feelings about how we were treated and how it effected our time in New York (5 months later). Our recommendation is to find another place to stay that care about their guests and not just about their money, that have the means to take care of emergencies, that stand up and face their mistakes, that don't take the attitude in the end of good riddance get out of our hotel. (Update: Before posting this review I emailed it to the Chelsea Star Hotel and gave them a chance to do something about it. It has been almost 4 weeks now and I have received no reply from them, another indication that they do not care about their customers and have no problem treating people poorly.)", "Date": "December 29, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "West Virginia", "Title": "“Great location and price”", "Author": "MrsGable", "ReviewID": "UR22922186", "Content": "I went with three friends and we stayed in the apartment suite. Our room was very clean and the hotel staff was very helpful. The only problems were the noise from the street and our room was very hot. While this is a wonderful place to stay due to location and the availability of parking garages ( a bit expensive, call ahead to find local garages), I do not know if I would recommend it to someone in their 30s. This is a perfect spot for someone in their 20s who wants a safe, clean, inexpensive stay.", "Date": "December 22, 2008"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Business service (e.g., internet access)": "3", "Check in / front desk": "2", "Overall": "3.0", "Value": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Singapore, Singapore", "Title": "“One of a kind”", "Author": "bluechick33", "ReviewID": "UR22547667", "Content": "The Chelsea Star is very centrally located, just across Madison Square Garden, and within walking distance to many major sights. A walk to Times Square is about 15 min, Macy's 5 mins. I even walked to the Cheyenne's Diner for yummy pancakes. The room was much smaller than I thought, I can't even open my luggage. Definitely not for claustrophobics. But by the 2nd day, I'm used to it. The shared bathrooms were usually empty and very clean. You can book the van that brings you to the airport from the front desk. Free internet at lobby.", "Date": "December 8, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Business service (e.g., internet access)": "3", "Check in / front desk": "3", "Overall": "4.0", "Value": "4", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Rio de Janeiro", "Title": "“Great Hostel”", "Author": "dedji", "ReviewID": "UR22212139", "Content": "Chelsea Star is in a very good location, has very nice staff, clean rooms,and the price for only 10 streets away from times square, is not the worst. I definitely recomend it!", "Date": "November 26, 2008"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Business service (e.g., internet access)": "4", "Check in / front desk": "3", "Overall": "2.0", "Value": "2", "Rooms": "2", "Location": "5"}, "AuthorLocation": "England", "Title": "“Great location, but not NY's best kept secret”", "Author": "Monkey0810", "ReviewID": "UR19455809", "Content": "The location of the Chelsea Star is perfect - next to Madison Square Gardens and Penn Station. You can walk to the Empire State Building and 5th. However, after staying at the Chelsea International Hostel the night before, we felt it represented poor value for money. A private double, with shared bathroom is $130 per night; 10 blocks down the road, you can get the same for only $85 (and you get a sink in the room). The shared bathroom was always in use and you had to queue to get in. At night it was also really noisy. If you don't mind a bit of a walk or a bit extra on the Subway - go with the Chelsea International.", "Date": "August 28, 2008"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Business service (e.g., internet access)": "3", "Check in / front desk": "3", "Overall": "3.0", "Value": "4", "Rooms": "2", "Location": "4"}, "AuthorLocation": "UK", "Title": "“Just about OK”", "Author": "ChristianNS", "ReviewID": "UR19420349", "Content": "We stayed here twice in a couple of months. Once in a Double with its own bathroom, and once in a double with shared bathroom. The hotel is in a great location, 5 minutes walk from Train/Metro station. It is very easy to get to from both JFK and Newark airport. On the downside it is very noisy. There is a lose drain cover on the road outside the hotel, and it makes a lot of noise every time a car driver over it. On the ground floor the noise was very annoying. The dulux room was a lot better, and had a decent wall mounted AC unit, which kept the room cool. In the normal double, the AC unit was a window mounted one located about 6 inches from the pillow of the double bed. It was too small for the room, and couldn't keep it cool, but big enough to cause neck-ache by blowing on your head. There are too many rooms sharing the bathrooms for my liking. As a summary: Good for a few nights, but don't expect to get the best nights sleep. It is cheap, and ideal for the city, and generally clean.", "Date": "August 27, 2008"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Business service (e.g., internet access)": "3", "Check in / front desk": "3", "Overall": "3.0", "Value": "5", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Madrid", "Title": "“Perfect for the price you pay for it.”", "Author": "Clara1234", "ReviewID": "UR18220432", "Content": "The dormitory is incredibly clean, including the bathroom, we had air conditioning and the people at the desk were correct. You can have a nice chat in the common area, but that gets a little too noisy for the people inside the dormitory that's just by it. Overall, I'd recommend it, great location, price and accommodation.", "Date": "July 24, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Exeter, New Hampshire", "Title": "“Cute Boutique”", "Author": "veggiecat", "ReviewID": "UR18208335", "Content": "My husband and I stayed at the Chelsea Star last week. We had tickets to a show at Madison Square Garden and couldn’t have asked for a more convenient location! The Chelsea is right across the street! There is ample parking near by although it’s pretty pricey. (Probably reasonable for NYC though) There are also many restaurants to choose from within a couple of blocks in different price ranges to suit any budget. We were on a tight budget for our trip so we needed something reasonable but NOT a fleabag. The Chelsea fit the bill perfectly. We stayed in one of their “superior” rooms with a private bath. The décor was hip and cute and the room was very clean if a bit “cozy”. The staff was very pleasant and helpful as well. If you are looking for luxurious amenities this hotel is not for you. But, they provided enough basics including WIFI service that we didn’t mind not having the 4-star experience. We had read that one of the few complaints was that the location is noisy. It is, (Hey! It’s New York City!) however, we had no problem getting a good night’s rest. All-in-all the experience was very pleasant. We would recommend the Chelsea and would definitely stay there again.", "Date": "July 24, 2008"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Check in / front desk": "4", "Overall": "3.0", "Value": "4", "Rooms": "2", "Location": "4"}, "AuthorLocation": "Harrogate, United Kingdom", "Title": "“OK”", "Author": "angwri", "ReviewID": "UR18101108", "Content": "I find it difficult to grade this place. As a hostel it is very good, but as a hotel only OK. The location is convenient for Penn Station & Madison Square Garden. The area is OK (but I wouldn't want to venture much further west). I came in on my own after midnight & it was fine, as there are always lots of people around. I had booked a single room with shared bathroom at a cost of $115 per night. The bed was surprisingly comfy (despite the plastic mattress cover). The bedding & towels were clean. I never had to queue for the bathroom & always found it to be clean. The TV had a TV & chest of drawers (no hanging space). It was painted in a vile yellow colour & did feel a little \"cell-like\". The stairs & doors were all metal & added to the prison feel. The reception & courtyard were pleasant. I found all the members of staff to be very polite & helpful. I will have been one of the older residents (mid 40s) but I found all the kids staying there to be quiet & considerate. However, I cannot reiterate how much street noise there is in the area (all night long). Nothing much you can do about it-it's New York!", "Date": "July 21, 2008"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Business service (e.g., internet access)": "4", "Check in / front desk": "4", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Melbourne, Australia", "Title": "“Great location, good price, no complaints!”", "Author": "Driftingkiwi", "ReviewID": "UR17685384", "Content": "Booked a couple of nights here with only a few days notice - options for cheap accomodation in NYC are always limited, never mind anywhere worth staying in summer at short notice, so I wasn't really expecting much... but my expectations were definitely exceeded! As other reviewers have mentioned, reception is up a flight of stairs - I was carrying a pack so no issues there, but if you're looking for elevators and a concierge service, best find somewhere else. No hassles at check-in. I was staying in the cheapest option ($89 + tax per night, single room with shared bathroom) - the room was very small, with a noisy air-conditioner and quite a bit of road noise, so ear plugs are a must. Seriously though, when you're staying in such a central location in NYC, a bit of noise has to be expected, surely? Bathroom was generally kept clean, so no complaints. I wouldn't have wanted to spend all day in my room just because of the size, but given that I was out all day and night (hey this is New York after all!), it was absolutely fine. I liked the place enough to book another couple of nights for a few days later on my way back through New York - this time I booked a double room as no singles were available, for an extra $20/night. Was very pleased to find when I got back that I'd been upgraded to a double room with it's own bathroom at no charge - this was a lovely clean room, queen bed, very spacious, with a spotless bathroom. Wireless internet access worked fine for me, until my laptop hard drive died at least... So much to see and do within a few blocks - can also highly recommend stopping in for a pint or two at the Molly Wee, an Irish bar just over the road from the hotel. Overall, highly recommended if you want a room at a reasonable price (for NYC) in a great location.", "Date": "July 9, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "2", "Check in / front desk": "3", "Overall": "4.0", "Value": "3", "Rooms": "4", "Location": "4"}, "AuthorLocation": "florida", "Title": "“Good price”", "Author": "yoyiFlorida", "ReviewID": "UR17505872", "Content": "The price for the type of room and location was very good considering how expensive hotels in manhattan are. We stayed in the superios suit and the service was very good. Only downside is that the building has no elevator...and the stairs are very tight", "Date": "July 3, 2008"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Business service (e.g., internet access)": "2", "Check in / front desk": "3", "Overall": "3.0", "Value": "3", "Location": "3"}, "AuthorLocation": "Calgary, AB, Canada", "Title": "“Great Locaton & Clean, but bring earplugs”", "Author": "loislane101", "ReviewID": "UR17037070", "Content": "We stayed in this hotel in early June in a Superior Room and were fairly pleased with it. The rooms are small, but very clean. My only complaint would be that the walls are a little too thin. Thank goodness for air conditioning in more ways than one. Several rooms seem to have hardwood floors, which greatly increases the noise level within the hotel. Very convenient to Penn Station, only one long block, and we never felt uncomfortable walking back to the hotel, no matter the time and our cards worked every time. The patio was a nice space to relax in. The free wi-fi was very weak and kept cutting out, so a bit frustrating. The staff is okay, not as friendly as I would have liked, but it WAS in the middle of a heat wave (98 degrees), so maybe that made the difference (giving them the benefit of the doubt). They always answered all our questions in a courteous manner.", "Date": "June 18, 2008"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Check in / front desk": "3", "Overall": "4.0", "Value": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Belfast", "Title": "“Intense decor!”", "Author": "maevedave", "ReviewID": "UR15481588", "Content": "Great value - we payed $99 for the room per night, which worked out very cheap between two, especially with the current strength of the pound against the dollar. Plus points - We had booked a room with a shared bathroom and got upgraded to an ensuite. The room was clean and bright, if a little bit small and totally lacking in storage space for clothes. Bathroom was a good size, clean, plenty of hot water. Great location, near Penn station if you need to get a cab, easy enough to walk to Greenwich village, lots of drugstores, bakeries, off licenses near-by too. Downsides - Very noisy at night! Not so much other guests in the hotel as noise from the street, no soundproofing on the windows so you can hear everything. There is a also a less than salubrious 'bikini bar' right next door so it can be a bit dodgy coming back at night, especially given the fact that the card you are meant to swipe in with often doesn't work and you have to ring the bell. Staff aren't exactly incredibly helpful (although they are friendly enough). Not a lot of internet access for such a big place, and no real communal area for guests to hang out in. There is a roof terrace guests can use, but this is really only a bonus in the summer months.", "Date": "April 29, 2008"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Business service (e.g., internet access)": "1", "Check in / front desk": "1", "Overall": "1.0", "Value": "1", "Rooms": "1", "Location": "3"}, "AuthorLocation": "Canada", "Title": "“Never again”", "Author": "fruchick", "ReviewID": "UR15156472", "Content": "I was in the unfortunate position of not being able to get a room at my first, second, or third choice of hotels for a Saturday night in the city. In need of simply a place to rest my head for the night, I booked a dorm room at the Chelsea Star, thinking I would check the place out for a potential week-long stay in a full-size private room this summer. I didn't much want to be there to start with, but I think the front desk staff wanted me there even less. When I checked in I was in a time-bind (had to be at a class nearby in 15 minutes), and the woman in line to check in just infront of me was ultra sweet and let me cut ahead. The woman behind the desk, though, thought this meant she could take her sweet old time. The archaic check-in system is a joke. I also realized during this time that the delightful meaty smell permeating the building was from the Subway restaurant downstairs. I had requested a bottom bunk when making the reservation, which they of course did not accommodate. There are also NO lockers in the rooms, and I didn't trust leaving my belongings in the \"lobby\" (more on that later). So me and my laptop, camera, and iPod traveled together for the remainder of the day and evening. These are MIXED dorm rooms, and as I woman I will never put myself into that situation again. Disgusting, loud men made up the bulk of my roommates, and the guys on each side of me snored all night. The window faced 8th Ave, which was added noise. The bathrooms... yikes. I figured I would stay cleaner if I DIDN'T shower in the morning. I checked out as early as humanly possible. A few people ahead of me did the same, and they complained to one of the staff members that the bathroom in THEIR dorm room also did not have a hook or anything to put clothes on -- so they had to put their clean clothes on the bathroom floor. I involuntarily shuddered at the thought. The staff member just said \"yeah\". Nice. Soon, there was nobody in the front desk area except me and one staff member, and when I sat down on one of the two long padded benches and pulled out my laptop, the following exchange took place: \"Are you waiting for a cab service?\" \"Uh, no.\" \"Then what are you waiting for?\" \"Waiting for my laptop to start up so I can check my email.\" \"Well, you can't sit there.\" \"I'm sorry??\" \"You have to go to the lobby.\" \"What is THIS?\" \"Not the lobby. Go down the hall and take a left.\" He seriously shoo'd me out of the empty check-in area and made me sit in a tiny, dirty room (spilled coffee and sugar *everywhere*) with internet kiosks, and nowhere to set down my laptop. But I wasn't there for long -- all the wifi connections security-enabled, and no password posted or provided to me. So I consider that \"free-wifi\" advertised on their website a myth. Needless to say, I won't be booking a room there for my week in August.", "Date": "April 20, 2008"}, {"Ratings": {"Service": "2", "Cleanliness": "5", "Check in / front desk": "4", "Overall": "2.0", "Value": "3", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Long Beach, California", "Title": "“Both excellent and horrible. Read on to find out why.”", "Author": "lombaxian", "ReviewID": "UR14340514", "Content": "I've been to this hotel twice. Once I was in a normal hotel room, one with its own bathroom so it was one of their higher end models. The other time I got one of their hostel dorm beds. First of all the hotel part: This is a clean place, just great. It was a great sized room and a great sized bathroom, considering you are in New York. The shower was large and even had a seat in it. I've seen $300 rooms that were smaller in this city. The room had a nice big TV and DVD player and we were more than satisfied. The area inside the hotel was cute and colorful. At this low price, you can't beat the quality, the amazing location, and the simple bang for your buck. It's tops. Now for the hostel part, with the bunk beds: This also is a clean part of the hotel. The bunk beds are located in small apartment units that have been converted to dorm rooms. I did notice mold on the ceiling of the bathroom but that is not a huge deal in my eyes. But there were some glaring problems that are not quality-related. First of all, the staff used our room as a hallway, literally. Literally. I can't stress that enough. The supply closet was in our room and also it was an entrance to the backyard and other places. So at 9am you would have a staffer come right in and pass through or rustle through the closet. They would not knock. This was not an isolated incident, this happened every 30 minutes to an hour on every day of the 3 days we stayed. They would not lock the door when they did this and if we locked the door they would unlock it. This is unprecedented. I have never been in a hotel or hostel where the staff simply barged into your room at all times of the day. Secondly, there is no lobby or other room indoors to hang out. This is a hostel so you have many strangers in a room together. You need a way to get out of the room to relax so you won't bother people. But unless you are staying during good weather and sit down outside (and only during the day), you will be stuck in the room, unable to do much of anything like talk or read or use your computer because of your sleeping roommates. Thirdly, since you are in a dorm situation with 9 strangers in a room, it would actually be beneficial to keep the bathroom out of the room and put several bathrooms in the hallways for the whole floor. This is not the case. The bathrooms are in your room. So when you wake up, prepare to wait 2 hours just to empty your bladder as every single one of your 9 roommates will be in line for it. If you have a bad bladder, you'd best go somewhere else. Get yourself 2 roomies or more and rent out one of the higher end rooms and skip the dorm beds. If you want dorm beds, go someplace else unless your party can fill all 10 beds in a room. If that is the case then by all means, since this is the cleanest hostel I've ever seen in New York, go for it.", "Date": "March 17, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "2", "Business service (e.g., internet access)": "3", "Check in / front desk": "4", "Overall": "3.0", "Value": "3", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Sonoran Desert, AZ", "Title": "“Hmmmm.....”", "Author": "medcat3", "ReviewID": "UR14173962", "Content": "Where do I start? I have a hard time writing a negative review for the Chelsea Star mainly because it is such a bargain for the price. I booked directly through the hotel's website and got the $79/night deal! That being said, for some reason, the Chelsea Star was just, well, ...average. Bathroom and washroom facilities are shared. The other people staying on my floor were not particularly tidy and, at times, the bathrooms were not that clean. This is not the hotel's fault. I was, however, disappointed by the fact that my room only got 4 television stations. 2 of the 4 stations were the exact same one. One station was in Spanish and the last was HBO. Sometimes CBS would come in clear and other times it would not. This may not be a big deal to some people but I enjoy going to new places and watching local news and other city broadcasts after a long day of touring. As far as Wi Fi, I could not log on to the hotel's Wi Fi from my room. Free Wi Fi may only be available on the hotel's first floor. There are pay-by-the minute computers and printers available in the lobby that have access to the internet. The truly redeeming aspects of this hotel are the front desk staff and the location. The hotel is literally one block from Madison Square Garden and the Subway. I walked to 2 Knicks games during my stay. It is just a few blocks walk to Times Square. I felt very safe not only around the hotel but in Manhattan in general. Nice police presence. Overall, I recommend the Chelsea Star for its unbeatable price and location. However, it may be worth it for some people to spend a few more dollars per night for reliable television and private bathrooms.", "Date": "March 9, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Business service (e.g., internet access)": "4", "Check in / front desk": "5", "Overall": "4.0", "Value": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Birmingham, England", "Title": "“Excellent Place¬”", "Author": "Kugsy", "ReviewID": "UR13044975", "Content": "My boyfriend and I are aged 27. We booked to go to NY for a week so didnt want to spend loads on a hotel as trust me some were so expensive!! Anyway found the Chelsea Star Hotel on the internet. Price you cant beat it. Location was fantastic. I read all the reviews on here before I booked so thought we should write what we thought as I know alot of people rely on these! We flew into JFK and got the tube non stop to the subway at Pennsylvania station and first thing we saw was the Emprise State Building - wow. We walked to the hotel and only took about 4/5mins - slow pace :o) so I would definitely recommend the tube! The hotel front is literally just a door off the road and when you get buzzed in you walk up big flight of stairs (if you need help just let reception know and they would send someone down) Anyway we got buzzed in and went up to reception. Lovely blonde lady checked us in. We had booked a double room with shared bathroom however the lady said would we mind staying in the room for 3 nights then be upgraded to a private double with ensuite at no extra charge - we didnt mind at all. The shared room was on ground floor, very small just double bed and a single open wardrobe and TV on the wall so did wonder where I was going to put all my shopping. However it was fine. Shared bathrooms were clean and they are on every floor so if one was busy then you just go upstairs. I kept leaving my shampoos etc in the showers but as they are constantly cleaned I never saw them again so make sure you dont leave anything! I used to just go the toilet in my pyjamas no one cared! The private doubles was a lot nicer, it was on the second floor. Room was large with table/dresser big wardrobes and of course the ensuite bathroom. I must admit the private room with shared bathroom was good for first couple of days but i think if going for a whole week I would definitely book private double room with ensuite just for the space and cosyness. All in all I would recommed this hotel to all. Yes you are on a busy road but to be honest what Manhatton hotel is not? It never woke us up anyway but hey maybe we arnt as fussy as some people on here!!?? You do get what you pay for... We found reception always helpful, We booked a helicopter trip with them, the Greyhounds tour 48hr is well worth doing at start of trip as you get to see everything. Macys is only 10min walk from hotel and dont forget to go claim your discount card if you are from outside the US at the service desk that you can use on all purchases for 3 months! If we went back to NY we would defnitely stop here again.", "Date": "January 27, 2008"}, {"Ratings": {"Overall": "3.0"}, "AuthorLocation": "London", "Title": "“Chelsea Star - Great location”", "Author": "munnke", "ReviewID": "UR12646825", "Content": "Great location, slap bang in the centre of Chelsea means you can walk anyway within Manhatten in about 20 minutes. Staff are very helpful and the apartment we had was ok. Cleaning staff were very efficient each day (but wouldn't make beds if you left personal belongings in it). Our apartment was at the front of the building on the second floor and we needed ear plugs to drown out street noise at weekend. Also heating was unreliable and came on at strange times. We were cold occasionally at night.", "Date": "January 15, 2008"}, {"Ratings": {"Service": "1", "Cleanliness": "3", "Business service (e.g., internet access)": "1", "Check in / front desk": "1", "Overall": "2.0", "Value": "2", "Rooms": "2", "Location": "4"}, "AuthorLocation": "melbourne", "Title": "“More like chelsea one star hotel”", "Author": "tonymelbourne123", "ReviewID": "UR12368934", "Content": "The room was decribed a newly renovated.... a coat of paint and the bed was the only thing that was new. We where on the top floor at the front of the building, it was very noisy. The window did not even close properly. The staff where not very helpfull and rude, we had to ask for; The heating to be fixed: they would not fix our heating we asked numerous times for it to be fixed as we had none. The only solution was to give us a plug in bar heater. ( it was below 45F for all of our stay) The TV aerial to be connected to the socket as it needed to be rewired, in the end we did it our self. Housekeeping did noy give us towels which we had to ask for more than once. It was a chore to get them to do anything for us and at times they where just rude. WIFI internet was free but hardly worked.", "Date": "January 6, 2008"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Business service (e.g., internet access)": "3", "Check in / front desk": "5", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Toronto", "Title": "“pretty decent place”", "Author": "wolfatron", "ReviewID": "UR12092840", "Content": "First of all, if you are looking for a wheelchair accessible place, this is not for you. Otherwise, read on. The hotel is located at the corner of an intersection (30th and 8th) and it doesn't really look like a hotel from the outside (looks like it's connected to a convenience store) so be careful if you are driving and looking for it. Once you find the hotel's door, you need to get buzzed in and then climb a flight ot steps to get to the front desk. This might be tricky for those of you who have heavy luggage or multiple suitcases. But once you get past that it's pretty good. I booked a triple room at the Chelsea Star for three nights but before I left for New York, I heard about a huge snowstorm that was going to hit the U.S. and Canada on the night I was supposed to be leaving. I called Chelsea Star and told them that I might be delayed because of the storm, and I was told that my reservation would be honored even if I arrived a day late. I was supposed to arrive on a Monday, but the storm pushed my arrival to Tuesday, so I told the hotel that if they wanted, they could rent out the room for Monday night. When I arrived at the hotel on Tuesday, I was told no one had recorded that I was going to be arriving late and that my triple room had been taken. I was very distraught, but fortunately, the guy at the desk was very nice and he said that the Chelsea Star would upgrade my reservation and put my friends and I in an apartment suite and only charge me the triple room price. I forgot to ask the check-in guy's name but he's a soft-spoken Caucasian man with curly-ish black hair. If you want great service, go to him. He made suggestions for transportation (where to go to use the subway, what kind of metro cards he thought we might need) and pointed out a few things we could do (ie. take the free Staten Island Ferry to see the Statue of Liberty). He also suggested a decent nearby breakfast place :) You can also ask for Lilah. She's very nice too. But I wouldn't recommend talking to one of the night-staffers (guy with a Russian accent). He wasn't exactly rude, but he seemed bored/ disinterested, which isn't something you really want in a customer-oriented business. Before I left for New York, I spoke to this guy on the phone about being delayed because of the weather and he wanted to charge me for arriving on Tuesday instead of Monday, even though I had already explained to him that I had called the hotel about the situation the day before. I can understand it if a hotel charges me for being late or for cancelling if I call the day before or on the day that I am supposed to be checking in, but I informed Chelsea Star about the situation two days before I was supposed to arrive, which is their deadline before they start charging cancellation fees. But I found everything and everyone else to be quite good :) The hotel was located in a good place, just steps from Penn Station. The apartment suite is actually in the building next to the hotel. My friends and I stayed in room 1N, which was on the first floor and facing the street. The room itself was pretty good (2 double beds, private bath, small tv, kitchenette with sink, microwave, mini fridge, cups, plates, utensils) but in the early morning, noise from the street did wake me up sometimes but I tend to be a light sleeper. The room was comfortable and clean and gave you what you needed. I checked for bed bugs and I was happy to see that there were none (mattresses were wrapped in plastic to prevent bug infestation). Housekeeping also showed up each day to tidy up, and hot water and pressure were pretty good in the shower. The only drawback I really have to say is that heating for our room was very strange. It was generally ok, but at night, sometimes it became very hot, and we had to crack open the window while we slept. I'd stay here again, but I think it's because I lucked out with the apartment suite. I'm not sure how things are for people who stay single, double, triple and quad rooms. I checked out the shared bathrooms near the front desk and thought they were ok. There were two rooms with only a toilet (clean but only enough room to sit down on the toilet) and one room that has a toilet and a shower (it's a private room made for one person). There's 2 computers near the front desk, which costs $2 U.S. for 20 minutes. One of these computers is in a small room. You can get coffee and hot water in there in the morning but don't expect it to be a common room, because it's sort of small. But there's a little rack in the room that offers cards that describe NYC restaurant and attractions. It's a good resource if you're not sure about what to do. All in all, I had a good time at Chelsea Star and I would recommend this place (or I guess the apartment suite) to other student travellers.", "Date": "December 30, 2007"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Bermuda", "Title": "“Great Location, Great Place !”", "Author": "Leafly", "ReviewID": "UR11219857", "Content": "This hotel/hostel is a 10 minute walk from Time Square ! The best part is that when you fly into JFK you can take the 30 minute ($12) Long Island Rail Road to Penn Station and then the hotel is a 2 minute walk. We booked a Superior room at $199 a night, the room was spotlessly clean, the bathroom was brand new and the staff were really helpful. I had read the hotel was in a dodgy neighbourhood but we did not find that the case at all. The walls are like paper you can hear noises from the rooms above and next door to you but if you are in New York to shop and go out, it really doesn't matter. I highly recommend this hotel for the budget traveller !", "Date": "December 3, 2007"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "scotland", "Title": "“Brilliant place- would go back”", "Author": "aberdeenlass1903", "ReviewID": "UR10963529", "Content": "Booked this place not knowing what to expect but was delighted when we saw our room. We booked a suit with bathroom and we were fortunate to get a room at the back of the hotel (room 405) so very little noise. The room was very clean and was cleaned everyday. We were there for 5 days but by the end of the week the maids had actually just left our new clean folded sheets on our bed as we do not like the tightly tucked in sheets and pull them off when we get in!!! It was nice to know that they were getting used to our habbits!! I did get a glimpse of room 105 which was the NYC themed room and YES it was small but it was nice and clean. To give you an idea- the double bed was against the wall and you can only get in from one side- but this room was used to store our luggage when we left so it is spacious enough!! I did also take a look at the bathrooms which are shared and they are very nice. They are all tiled and have a modern look and most importantly CLEAN!! I only saw the bathroom occupied once when I was passing so it doesnt seem to be a problem sharing. This place is really central and a real bargain for manhattan! We will definately consider going back should be return to the city.", "Date": "November 21, 2007"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Check in / front desk": "4", "Overall": "4.0", "Value": "5", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Washington State", "Title": "“Funky, inexpensive hotel!”", "Author": "rowdy921", "ReviewID": "UR10900241", "Content": "I booked one of the apartments for a three-day stay. The location was perfect, and we loved the room. We had two queen beds, a kitchenette, and a newly remodeled bathroom. There is a lot of street noise throughout the night, and since we were on the street level, we could hear trucks, taxis, emergency vehicles, and people on the street. We weren't bothered by it though. I would stay here again. The price was much less expensive than the \"uptown\" hotels, and we had a great time!", "Date": "November 18, 2007"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "Texas", "Title": "“Wonderful inexpensive apartment suite”", "Author": "Austintogo", "ReviewID": "UR10802401", "Content": "Helpful staff in office! Very satisfied with choice. Rooms clean and spacious. Great location to see the sights and close to Penn Station. Across the street from a bakery that serves an excellent cup of coffee. Only complaint is the uneven steps that we took to go up to our room. If you stay in the suites pay attention as you climb up the steps to your room as several people in our party tripped going up the steps. The stairs are not exactly the same height.", "Date": "November 13, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "4", "Overall": "5.0", "Value": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Philly", "Title": "“I Love NY”", "Author": "Ludichrissy", "ReviewID": "UR10141669", "Content": "My husband and I stayed at the Chelsea Star, in a Superior Room Thursday - Saturday. Having read a lot of reviews I was sort of nervous going in. Any fears I had quickly subsided. I knew to expect a small entrance and non flashy exterior. Upon arrival, in a rainstorm, we had to be buzzed into the hotel. (After you get your room key you have instant access and do not need to be buzzed in and out.) You are greeted by a flight of stairs. At the top of the stairs there is a registration office. The people in the office were busy, but very polite. The room was spacious and clean. The bathroom was spotless. The bed not so much on the comfy side. I asked for extra towels and pillows and they were quicky, and politely, delivered. The cleaning staff was professional, polite and very cheery. The roof deck was quite nice and comfortable. There are a few tables, with large umbrellas. The room was directly facing 8th ave. There was ample air conditioning which wasn't used too much because it went from hot to cool while we were in town. It is a busy area so there was a lot of traffic and noise. Being from a city and now living in the suburbs, it was wonderful! I welcomed the noise and was able to sleep easily for once. Admittedly we didn't spend a lot of time in the hotel but when we were there we had no complaints. This location was convenient to everything. A block to the subway. A block to the train station. Close to MSG. Close to Macy's. Such a variety of restaurants and cheap but yummy eats. Mexican, Pizza, 24 hour Deli, Thai, BBQ, Burgers, and Irish Pub, all within one block. I felt very safe. The streets were always busy and there were always a lot of people around. We plan on staying here again.", "Date": "October 19, 2007"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Business service (e.g., internet access)": "4", "Check in / front desk": "4", "Overall": "3.0", "Value": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Piedmont", "Title": "“the best hotel in NY!!!!!!”", "Author": "Saretta", "ReviewID": "UR10076326", "Content": "This is a very nice hotel, in a very good location (near time Square, Empire state building, pennysilvania station, near the 34th street). Our room ( asuperior room) was clean, with a large bathroom, air conditioner, flat tv. We had towels changed every day. The staff is helpful, friendly (there is also a girl who speaks italian!): you can use the pc (with 2 dollars you can surf for 20 min. the Net); there's a nice terrace where you can smoke, have breakfast or lunch or everything you want. This is a very good position, central and near the subway (thre's a big station under madison square garden(Penn station) where you can take metro or trains going to Washington, ecc). This is a good solution for people who want to visit the city and not stay in the hotel all the time.", "Date": "October 14, 2007"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Check in / front desk": "4", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "New York City, New York", "Title": "“Perfect!”", "Author": "sarahufl", "ReviewID": "UR10071388", "Content": "Planned a long weekend in the city with girlfriends from college. All of us were recent graduates, so money was an issue. There were 6 of us traveling together so we booked a suite. We paid somewhere between $120 and $150 a night, I can't remember exactly. We were all plesantly suprised by the accomodations. The room was huge, had 2 beds, a full kitchen, a nice bathroom and a large closet. The wood floors were nice and clean, clean bedding and towels. We obviously didn't spend much time in the room as we were there to site see and party. But the time we spent there was very enjoyable. A few small complaints- the neighborhood is a little sketchy, so avoid walking outside alone in the dark, the door was very difficult to lock and unlock and required wiggling and jostling to get it open and closed. It was a bit hot, since there was no AC. Also, the street noise is very loud, especially since we were on the ground floor. We were awakened by bickering drag queens right outside of our window at about 5am, where they proceeded to scream for several hours. Overall, I would recommend this hotel to anyone. Very good value for your money.", "Date": "October 12, 2007"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Business service (e.g., internet access)": "3", "Check in / front desk": "4", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "UK", "Title": "“Pretty Good”", "Author": "DJHSutherland", "ReviewID": "UR10012435", "Content": "My 1st ever stay in a hostel and I was quite suprised. It was very clean, they have a small communual area to meet random people. Its a small place, some of the staff can't be bothered but others are helpful. Id reccomend it to people but everyone has different expectations and standards. It's smack bang in the middle of everything with subways 1 to 3 blocks away that go in all the directions you need. I stayed in 2 shared rooms, 1 was a lot bigger and bettre but at the end of the day a clean bed is all you need, if your tall stay away from the top bunks..Shared room had showers that were cleanded daily. Again one was a lot better than the other but both of a good standard.", "Date": "September 27, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "4", "Check in / front desk": "5", "Overall": "3.0", "Value": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "toronto", "Title": "“huge room, clean place, but loud street noise”", "Author": "wendals", "ReviewID": "UR8467800", "Content": "we stayed here for 3 nights (thurs, fri & sat). it's clean and the staff were very friendly. we booked a superior room. the room was HUGE with a big private bathroom. #401. comfortable king size bed and a pull out sofabed. the sofa was comfy to sit & lay on. but when opened up to the bed it was really uncomfortable, like laying directly on the bar/springs. there was a/c in the room which was great cuz it was extremely hot while we were in nyc. our only real complaint was the noise level from outside. our windows faced 8th ave and since it's on the corner of 30th street it's extremely noisy at all times of the day. non-stop horn honking, sirens or people (there are 3 or 4 bars/pubs/clubs in the area which are open til 4am!). we had earplugs but it didn't help much. i'm told since this is nyc you'll get noise no matter where you stay but it was too much for me so be prepared if you are a light sleeper.", "Date": "August 21, 2007"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Business service (e.g., internet access)": "3", "Check in / front desk": "4", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Portland, OR USA", "Title": "“Cute little place...would definitely stay again.”", "Author": "stephrj76", "ReviewID": "UR8139888", "Content": "When I called the hotel directly, they advised they had no more doubles. So I went to hostelbookers.com and found a double with shared bath for $49.50pp +tax. I booked the room and made sure to call the hotel directly before I left for vacation to make sure they had my reservation....and they did. :-) When we got to the hotel, I was pleased to see that the front door was locked and secure. We had to buzz the office to let us in....but once you get your room key, that will let you in. The stairs were steep going up to the front desk, but the staff was friendly and helpful. We checked in and went up more stairs to our room. This hotel has no elevator/lift, but other than the first set of stairs, they aren't too bad. We had a double bed, and the room was tiny, but it worked for us since we only stayed one night. There was a window that looked out onto the street, and there was also a window A/C unit that worked perfectly fine....which was awesome because the night we arrived was very muggy. The only downside, was that there was a big gap between the window and the A/C unit which let A LOT of road noise in...but we managed to drown it out enough to get to sleep. The room itself was very clean along with the bedding and towels that were provided. The bathroom down the hall was surprisingly clean...considering we were sharing it with others, and we had no problem getting in when we needed to. The rooftop terrace that is mentioned, isn't really what it seems. I thought there would be a view, but there isn't because it's situated in the middle of the surrounding buildings. It's nice to hang out on, but it really offers no view. All in all, I really liked this hotel and would definitely stay again. It's in a great central location and it's not nearly as spendy as all the other NY hotels. And if you have problems finding availability, check hostelbookers.com or another website as the hotels usually \"sell\" a number of rooms to diff. websites. Feel free to email if you have any questions.", "Date": "July 17, 2007"}, {"Ratings": {"Cleanliness": "3", "Check in / front desk": "4", "Overall": "4.0", "Rooms": "3", "Service": "5"}, "AuthorLocation": "vienna", "Title": "“great and fun!”", "Author": "gelavie", "ReviewID": "UR8132124", "Content": "great and fun place to stay. centraly located and nice people. can recommend it to everyone!", "Date": "July 17, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Sydney, Australia", "Title": "“Chelsea star a little oasis within a big city”", "Author": "cj22cj22", "ReviewID": "UR8120874", "Content": "Spent a night in private room, very clean, very unique, very much a memorable visit. location is ideal within 10 blocks of times square, 2 blocks of madison square gardens and a leasurely stoll down to greenwich village. perfect. staff were friendly and helpful, the recent terrace is a welcome addition to the hotel providing somehwere cool to rest your weary feet after a day sightseeing. would use this hotel every time i visit NYC.", "Date": "July 15, 2007"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Business service (e.g., internet access)": "3", "Check in / front desk": "4", "Overall": "4.0", "Value": "5", "Rooms": "3", "Location": "5"}, "AuthorLocation": "bruxelles", "Title": "“Best deal in NY!”", "Author": "celine&yanni", "ReviewID": "UR8111207", "Content": "Obsiously the best deal in NY! The hotel rooms are small but confortable and clean and the manager is very helpful and professional...and cute also! This hotel being located midtown is at walking distance of everything there is to see in NY and in a very animated area. Lots to do around. Staff was very friendly and accommodating. I especially appreciated the terrace at the back where you can sit and relax , with the trees of the neighbouring gardens, a feeling of quiet and nature in the heart of the city. Will definitely go back there as soon as possible!", "Date": "July 13, 2007"}, {"Ratings": {"Service": "3", "Cleanliness": "2", "Check in / front desk": "3", "Overall": "1.0", "Value": "1", "Rooms": "1", "Location": "2"}, "AuthorLocation": "Phoenix, Arizona", "Title": "“The Closet”", "Author": "teentravlr", "ReviewID": "UR8108830", "Content": "The room was the size of a closet and it had a hideous mural of the Wizard of Oz. The shared bathroom in the hall was dirty the whole time we were there. The neighborhood was rough and not very conviently located. We switched hotels and cancelled part of our stay because it was so bad.", "Date": "July 12, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "4", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "los Barriles", "Title": "“The Best”", "Author": "littlebird_7", "ReviewID": "UR8096812", "Content": "Excellent location, lovely and clean rooms, helpful and friendly staff", "Date": "July 10, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Calgary", "Title": "“Can't Wait to Return”", "Author": "JBen", "ReviewID": "UR8091433", "Content": "My daughter (25) and I were off to New York for shopping, Broadway and dining, therefore didn't want to spend our entire budget on accommodation. After much research we stayed at the Chelsea Star and were thrilled. The rooms were clean and the superior we stayed in was adequate size, with a large bathroom. Big enough for two women to get ready for a night on the town. We are walkers and the location couldn't be better. On the occasion that me needed transportation the staff was very helpful in navigating the subways. John (think he's the manager) was also a wealth of information on the sites of New York.; where to grab a beer, get a morning coffee & bagel, galleries to visit, stores to drool in (ABC Carpet). Not only will we stay there again (love to take my husband now), but I have referred the hotel to many friends", "Date": "July 10, 2007"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Check in / front desk": "4", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Cleveland, Ohio", "Title": "“Loved the Chelsea”", "Author": "jsgram", "ReviewID": "UR8035876", "Content": "My sister and I had a \"Superior\" room. It included a queen bed and private bath. The room was very clean and smelled fresh. We were pleasantly surprised. The staff was friendly and helpful. The location was great for the price. We were about 10 blocks from Times Square and two blocks from Penn Station. We found it very easy to get around the city.", "Date": "July 1, 2007"}, {"Ratings": {"Service": "2", "Cleanliness": "4", "Business service (e.g., internet access)": "2", "Check in / front desk": "3", "Overall": "2.0", "Value": "1", "Rooms": "3", "Location": "4"}, "AuthorLocation": "sabah", "Title": "“too expensive for a small room”", "Author": "Deana73", "ReviewID": "UR8028990", "Content": "this should be called a hostel and not hotel.then it should be fine for me. keep on reminding myself that it look very hostel. stayed in a quad room for 2 nights and moved to the dorm for 2 nights. most time spent outside so didn't really stayed very long.location is good. staffs need to be more friendly or find work somewhere else. lady staff- met only one is very unfriendly and racist. spoke very nice to a couple for at least 15 mins telling them all places to go, without bothering that i am waiting in line, then when it was my turn, doesn't even look at my eyes( i look chinese btw). the 2 men are okay although i can't even see any smile from them. working in a hotel you will need all the smiles guys...", "Date": "June 30, 2007"}, {"Ratings": {"Overall": "1.0"}, "AuthorLocation": "Northampton, United Kingdom", "Title": "“Hostel pretending to be a hotel and not even a good one!!!”", "Author": "chrisandsusanne", "ReviewID": "UR7989941", "Content": "Firstly this is not a hotel but a hostel and not a very good one either. Having travelled around Australia and the US for 6 months, mainly staying in hostels I can honestly say that this does not even come close to their standards. We even paid a lot less at the Luxor in Vegas and that was a decent hotel. Well our room, number 110 was so tiny we could barely fit our luggage in it - it reminded me of a prison cell only it was painted bright pink. I was really impressed by their website and how cool the themed rooms looked but it just shows what some good photography can do. The paintwork was shody and unenviting. The bed squeaked loudly and slanted as u moved, it was stuffy and the noise from the road was unbearable. The windows are not double galzed and there are gaps where the airconditioning unit is fitted so it sounds as if the window is open all the time. Also there is just one restroom with toilet and shower combined for around 10 rooms on our floor. On my first visit they were not clean either with hair everywhere on the floor and in the shower. Now we are not usually people to complain and are generally easily pleased. We are used to basic accomodation , and don't tend to expect too much, seeing places often as a place to get a good night sleep. However this place was just unacceptable, especially for what we paid. It cost us $140 a night - our most expensive accomodation yet in 6 months and most certainly the worst. I know NY is expensive but they should not advertise as a hotel and the website is misleading, conjuering up an image of a cute themed hotel. Unless you see are room and hear the noise u just would not beleive it. I was so dissapointed as we were in NY for 4 nights and wanted to enjoy it. I had no sleep and felt really ripped off. I will definately not recommend this place to anyone.", "Date": "June 25, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "4.0", "Value": "5", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Melbourne", "Title": "“More than expected”", "Author": "Melbournechick", "ReviewID": "UR7769811", "Content": "I agree with all of the recent comments, I was a bit unsure about staying here but who can argue with the price. The location was great and it has recently had some renovations done. We were pleasantly surprised by the helpful staff and the cleanliness of everything. Upon arrival we heard a couple complaining about the size of the room but we already knew it was going to be tiny, you can tell by the photos on the website! The staff member apologised that she was not able to upgrade us for the first night but that we would be for the second night and our bags moved for us whilst we were out. The room really was all we needed, a bed! and the bathroom just down the hall. We were never there so we felt we got more than our money's worth in New York. The upgrade was nice especially with our own bathroom, the noise can be difficult but we were sightseeing during the day and out at shows at night so we did not suffer too much. I would stay again and have recommended to plenty of friends and family.", "Date": "June 4, 2007"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Business service (e.g., internet access)": "5", "Check in / front desk": "4", "Overall": "4.0", "Value": "4", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Cloquet, Minnesota", "Title": "“Great place to rest your head”", "Author": "DebFromMN", "ReviewID": "UR7588127", "Content": "Great place. Clean rooms and great service! We had a superior room #403 with its own bathroom. I was pleasantly surprised by how clean it was. The room is small, not much bigger than the queen size bed, 2 night stands, and small desk/dresser. There is a small closet rod to hang some clothing. The television reception was not very good, but who watches tv when you visit New York? The windows were a little hard to open, they stuck a little & had to push pretty hard. The room faced the street and was a little noisy. But it was not enough to keep me awake, I slept just fine. The bathroom was clean and we were given fresh towels daily. The shower lacks water pressure. The entrance was a little hard to figure out since you have to press a button near the door to be buzzed in. It felt like we were using the back door entrance, but it is the only entrance. The lobby is up one flight of stairs from the entrance. Then our room was up 2 more flights. No elevator, so you get a workout. Nice little courtyard. There is internet access in the main hall area, I think you have to pay for it. I was able to access wireless internet in my room on my laptop for free. Good location. 2 blocks from Madison Square Garden and Penn Station. Great little pub, the Molly Wee, across the street. Plenty of delis and restaurants nearby. We were given a couple of maps when we checked in and they came in handy. Overall, it was the perfect place to stay and I would stay again when I return to NYC.", "Date": "May 11, 2007"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Business service (e.g., internet access)": "3", "Check in / front desk": "4", "Overall": "4.0", "Value": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Manchester", "Title": "“Good value, Great Location”", "Author": "MoGreen", "ReviewID": "UR7484960", "Content": "We stayed at the Chelsea Star Hotel for 6 nights for a shopping/sightseeing holiday. As New York is a pretty pricey place to stay, I did loads of research and came across this hotel because of its competitive rates and good location. I would certainly recommend it - its located in the heart of the city. The room was made daily, with a small kitchenette (microwave/fridge/coffee machine) and fresh sheets and towels provided. After reading some reviews on this website I asked for a room facing away from the road - we were put up in room 4R (3 queen sized beds on the 4th floor facing the courtyard). My only reservations would be that it was a bit of a hike up to the 4th floor (especially after a hard days shopping!!) and the nearest subway station is about 2 blocks away. otherwise no complaints - would definitely consider returning on my next trip to the Big Apple...", "Date": "April 30, 2007"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Business service (e.g., internet access)": "3", "Check in / front desk": "4", "Overall": "4.0", "Value": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "montreal", "Title": "“good place for the price”", "Author": "pigeonman", "ReviewID": "UR7407263", "Content": "i stayed at the chelsea star hotel last week, the weather was horrible in nyc, rain and more rain, but it was nice to have a clean hotel with friendly and helpful staff and the hotels location (close to most of the sights, subways ...) to make the few days i stayed in nyc enjoyable. i slept in the cool coney island room, new comfortable bed, wood floor and good design. my next trip i will stay at the chelsea star again, hoping that i will have nice weather to walk around the city", "Date": "April 21, 2007"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Business service (e.g., internet access)": "3", "Check in / front desk": "3", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "oslo", "Title": "“very nice place”", "Author": "pneuma", "ReviewID": "UR7254725", "Content": "We (2 people) stayed in a superior room, and are left wondering why they would lie about such a petty things as tv. We were told we would get basic cable and flatscreen tv; none of which were present in the room. We got a regular TV set + network channels, but what the hell! The room was perfect! Nice aircon, bathtub, hot water, new towels every day.... the location is perfect, VERY close to Madison Sq Garden and A, C, E-subway trains from both 34th and 23rd St stations. As far as I can see, this hotel has it all, so why lie about such a petty thing as television? Cheap internet is available, free coffee in the mornings... i'm a happy camper, no matter what channels are available on the screen. I'm definately coming back!", "Date": "March 30, 2007"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "Chattanooga, TN", "Title": "“Very Nice Hostel”", "Author": "Bundini77", "ReviewID": "UR6788727", "Content": "This review is for a 10 bedded dorm room at Chelsea Star. Although my review is for the hostel room I am sure there are some issues that will apply to the hotel as well. This was my second stay in a hostel. I decided to try Chelsea Star because of the location and price. The price was cheaper than some of the hostels in upper Manhattan (103rd Street) and it has a great location. I flew into Newark and I took a bus to Port Authority at 42nd and 8th. From Port Authority I took the A or C subway train to 34th and 8th. From there I walked to 30th and 8th. The hostel is centrally located and it is only a couple of blocks from Madison Square Gardens. Upon check-in I found the front desk clerks to be very indifferent to the customers. They were very nonchalant and they did not seem friendly at all. The lobby was very nice and the terrace was very well lit and inviting at night. The room was pretty nice as well. I was surprised to have a bathroom in the room and it was very nice and clean as well. The only problem I found with the bathroom was the privacy factor. If you eat gassy food like chili you may be a little embarrassed because the bathroom is right there amongst strangers. Also, if you needed to use the facilities you had to wait for the person ahead of you to finish their duties before you could enter. There was a very simple solution to these bathroom issues though. There are communal bathrooms in the hallway and you can use the restroom there as well as take a shower. Very convenient. Issues with this location: The hallways are very narrow and the floor is metal (see my photos). Although they have a red carpet over the floor you could hear each and every person that walked down the hallway. My bed was close to the door and the floor would shake every time someone walked by. Also, you could clearly hear every conversation that went on in the hallways. The hall is narrow so people did not tend to linger. The other issue was the noise from outside. The hostel is located on 30th Street and 8th Avenue. 8th Avenue is very busy and noisy all day. I could hear horns blowing, sirens blasting, trash trucks beeping, people laughing and talking on the sidewalk, and believe it or not I could hear the subway. I kept hearing a noise every so often and I could not see where it was coming from. The noise comes from the sidewalk vents (do not know the proper term) and you could hear the subway trains each time they passed by. This was a huge issue when I first arrived. After awhile I was able to get used to the noise and move on. I am sure this is an issue at some of the finer hotels in NYC as well. Cabs blowing horns and sirens are a big part of NYC and this cannot be avoided in central locations of NYC. If you have trouble sleeping or if you are sensitive to noise you should request a room that is not facing 8th Avenue. Since this hostel is in the middle of a lot of attractions you must be prepared for noise or bring ear plugs. Otherwise, you may want to book something in upper Manhattan that has less traffic and action. Overall this was a very pleasant experience. I did not like the fact that they did not have lockers in the dorm rooms but I felt safe leaving my things in the room. The roommates were all friendly and everyone spoke and smiled at each other. One thing to remember is that this is a cheaper, lower scale hotel/hostel. You get what you pay for. You can't expect to pay a lower rate and have the accommodations of a five star hotel. Although this is a lower scale facility they have a very nice establishment and it is very worth the price. I definitely plan to stay here again and I give Chelsea Star two thumbs up. The place is very clean and has a clean feel to it. I am not sure how the hotel rooms are so I cannot comment about those. The property exceeded my expectations and I consider this one of the top hostels to stay in NYC.", "Date": "February 14, 2007"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Business service (e.g., internet access)": "3", "Check in / front desk": "4", "Overall": "3.0", "Value": "3", "Rooms": "3", "Location": "5"}, "AuthorLocation": "sao paulo, sp, brasil", "Title": "“not bad for a hostel, but wake-up call service is not reliable.”", "Author": "fe79", "ReviewID": "UR6628549", "Content": "I was staying in an 8-bed mix dorm. The room was okay, bathroom was cleaned everyday. Nearby Penn Station, great location. Not bad for a hostel. But the wake-up call service was not reliable, I almost missed my flight because the night shift did not wake me up...it is better to bring your own alarm if you need a wake-up call service.", "Date": "January 20, 2007"}, {"Ratings": {"Service": "1", "Cleanliness": "2", "Business service (e.g., internet access)": "1", "Check in / front desk": "2", "Overall": "3.0", "Value": "2", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Toronto, Canada", "Title": "“for the price.... not so bad!”", "Author": "travel_girlie77", "ReviewID": "UR6574001", "Content": "Booked this budget property with a friend for a shopping weekend in New York. Knew we wouldn't spend much time in the room so weren't that concerned about getting something fancy. Booked a deluxe room on the website for a 3-nights-for-the-price-of-2 special. Ended up paying $300 for 3 nights. Much of what people comment on is true.... loud 8th avenue all night, lack of visible cleaning, lockouts at the front door..... but, for reasonable price this hotel is in a great location; close to Penn station, subways and Macy's. If you are going to stay here book a deluxe with bathroom room, saw the others and understand why people weren't happy!", "Date": "January 11, 2007"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Check in / front desk": "1", "Overall": "1.0", "Value": "1", "Rooms": "1", "Location": "3"}, "AuthorLocation": "galway", "Title": "“Not what it seems”", "Author": "skybluestratocaster", "ReviewID": "UR6564025", "Content": "When i booked this hotel ,it looked fine on the web site.On arrival it turned out to be a grubby little affair.As we walked up the steps to the reception we knew we were in a dump.I dont think the steps had been mopped that week.We booked a double room but on arrival he stuck us in a ran down apartment(he said we were upgraded)out on the street fcing 8th ave even though on booking i requested a room facing away from 8th ave because of the noise.He said it would not be a problem.The window kept on opening in on us.There was a 2 inch gap underneath the window letting in cold air.it felt as though it was not safe being on the groung floor.The blinds were useless as they are all bent so if you want to change or do anything of a sexual nature the people from the street get a free show.There was no toilet roll holder.The wardrobe door was badly damaged.The place badly needed a lick of paint and tidying up.when we got our room in the main building it was tiny.Very very very cramped.The room was just the width of the bed.The room badly needed refurbishment.The bare dirty floorboards were exposed along the skirting and heating pipes ran along the side of the wall.Im sure they were once covered but i think the repair man waldo must be too busy carrying suitcases to fix it up.The bed was use less.Myself and my wife kept falling into the centre of the mattress as it sunk down when you lay on it.You have to share a bathroom.NOT GOOD.I did not like the manager of the hotel.,you could tell he was not having a good day.He just wanted to be somewhere else..Maybe he could try smiling sometime.. Damien.Ireland", "Date": "January 8, 2007"}, {"Ratings": {"Service": "2", "Cleanliness": "1", "Business service (e.g., internet access)": "4", "Check in / front desk": "1", "Overall": "1.0", "Value": "1", "Rooms": "1", "Location": "4"}, "AuthorLocation": "London", "Title": "“Cold and Noisy”", "Author": "Little_Miss_Holly", "ReviewID": "UR6180806", "Content": "Staying at The Chelsea Star very nearly ruined my first time in NY. The room we were allocated was beyond small. We had to rearrange the room in order to get 2 people and 2 cases in. Apart from the size of the room, it was incredibly cold. When we complained, after one of us became ill, we were issued with a radiator and another blanket. Fine, though not really good enough when the window still let in so much cold air we were reduced to wearing hats in bed. As for the noise, well it forced us to buy earplugs! The staff were unfriendly to boot. Reasons to stay at the Star - the location is pretty good. Apart from that, give it a miss!", "Date": "November 27, 2006"}, {"Ratings": {"Service": "2", "Cleanliness": "2", "Business service (e.g., internet access)": "3", "Check in / front desk": "2", "Overall": "2.0", "Value": "2", "Rooms": "2", "Location": "4"}, "AuthorLocation": "Somerset", "Title": "“Would'nt return”", "Author": "pumperley", "ReviewID": "UR6176787", "Content": "We booked 4 consecutive nights and 1 return night as we spent some time away from NYC. I booked based on the generally good feedback I found on nthe net and the relative cheapness. Our first room was on the top floor and right on the corner. there is a traffic lighted crossroads outside which was, as you would expect, very noisy. The room was extremely hot which meant we had to have the window open leading to mad levels of noise during the night. I spoke with the impersonal female receptionist (I'm not sure she's suited to this kind of work) who was more concerned about making excuses than trying to help. After approaching her for a 2nd time we were moved to a 1st level room that was bigger, cooler and less noisy. Unfortunately it was after staying here that I found what I think are bed bug bites on my arm, although as I was not sure I did'nt alert them to it. For our, final, return night we were fortunate to get an upgrade although this was clearly done as a convenience to the hotel.", "Date": "November 26, 2006"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Check in / front desk": "2", "Overall": "4.0", "Value": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Co. Down", "Title": "“lose the female receptionist!!”", "Author": "kiwishoeshine", "ReviewID": "UR6106309", "Content": "We are five girls from Ireland who thoroughly enjoyed our stay in the Chelsea Star Hotel. Great location, great price, large clean rooms. In general ,we found our stay here a positive experience expcept for the creaky beds and the unhelpful female receptionist who appeared disinterested and was rude at times. We understand the hotel is busy and her job at times may be hectic, however a little courtesy goes a long way and is much appreciated. We hope that if she ever had the chance to visit Ireland that she would not experience the attitude she displays and would appreciate the great Irish hospitality which would be provided. I would definitely recommend this hotel to anyone!!!!", "Date": "November 11, 2006"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "4", "Overall": "4.0", "Value": "5", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Mexico City", "Title": "“Good value”", "Author": "ajv", "ReviewID": "UR6106050", "Content": "This hotel has an excellent location. I stayed in a single and it was tiny, but other than that it exceeded my expectations. Bathrooms were usually clean and dry. Very friendly staff. No bugs, no dust, and air conditioning worked fine.", "Date": "November 11, 2006"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Business service (e.g., internet access)": "1", "Check in / front desk": "2", "Overall": "1.0", "Value": "1", "Rooms": "1", "Location": "4"}, "AuthorLocation": "Amsterdam", "Title": "“Dirty, small”", "Author": "Killio", "ReviewID": "UR6095092", "Content": "I went here for 5 days with my girlfriend, it was horrable. The room was not clean (even the bed was not clean and beneeth the bed... don't look!), it just fits one queen bed, and the room was full. we could not place our suitecases in the room so small. Location was ok.", "Date": "November 10, 2006"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Aylesbury, United Kingdom", "Title": "“Great value for money”", "Author": "angelicface11", "ReviewID": "UR5818827", "Content": "This hotel is a budget hotel but that's OK. All the rooms have a theme and although not en-suite, we were just opposite the bathroom which was always spotless and we never had to queue to use it. The rooms were also clean although the bed was a little lop-sided! Location-wise, this was great. It was just a few blocks from the Empire State Building and Macys (a bit longer to Times Square but not much) and we could see Madison Square Gardens from our window. The area felt safe, even at night. I would definitely recommend this to a friend.", "Date": "September 20, 2006"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Business service (e.g., internet access)": "3", "Check in / front desk": "5", "Overall": "3.0", "Value": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Tampa, FL", "Title": "“Minimal frills in a great location”", "Author": "deeforce", "ReviewID": "UR5490647", "Content": "After being booted from a standby flight and being stranded in NYC one more night, the kids at the Chelsea Star saved me with an available room and a good price (I got a pvt bathroom at the shared bathroom rate because the a/c wasn't working, but there was a big honkin' fan, so I got over it). Friendly front desk kid and cute overall design. AND I walked in off the street at 10pm and yet they still managed to help me out. Right on.", "Date": "July 20, 2006"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Business service (e.g., internet access)": "3", "Check in / front desk": "4", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Waiblingen, Germany", "Title": "“Top Location”", "Author": "Miss_Sophie", "ReviewID": "UR5489033", "Content": "The Chelsea Star Hotel is located in the heart of Manhattan. Only five minutes from The Empire State Building, Madison Square Garden, Penn Station, Fifth Avenue, Broadway. Ten minutes to Times Square and 42nd Street. The Location is unique and perfect! The hotel is rather small, the staff is friendly. When we arrived, the recepionist told us that we will have a superior room on the second floor. He helped us with the luggage and was very friendly. When we entered the room, we were a bit disappointed, because it was really small and we could hear our neighbours as if they were right with us in our room... The bathroom was very new and clean, but we asked for antother one because of the noise from next door! We were upgraded to a deluxe room without any problems. Room \"1N\" was in the building next door. The appartment is on the first floor, has noble parquet and two double beds. There is also a kitchen where you could prepare your meals yourself, a fridge and so on. But as there are so many nice places to go and eat in the neighborhood, we didn't use it! The bathroom is small but clean and nice. The rooms were cleaned every day. We felt like Carrie in Sex and the City as the appartment was really a \"New Yorker Appartment\", not a hotel! The only problem we had was the heating! As the room is situated on the first floor and the heating is right next to the beds and it couldn't be controlled by ourselves but only by the receptionist, we had tropical temperatures although it was winter and really cold outside! We only needed the thin sheet as a blanket and couldn't open the window the whole night because of the noise from the street whicht is a bit annoying but normal for NYC and after a few hours, you will be able to ignore it. The location will make up for the noise! We were upgraded to a deluxe room without having to pay more and they let us stay in the nice appartment \"1N\" for all of our nine nights! We also felt save and comfortable in the Chelsea Star Hotel! It is comparable to a German standard of three stars I guess. Enjoy NY and your stay at The Chelsea Star Hotel!", "Date": "July 20, 2006"}, {"Ratings": {"Cleanliness": "4", "Overall": "4.0", "Value": "4", "Service": "3", "Rooms": "3"}, "AuthorLocation": "Pennsylvania", "Title": "“Great if you need more room”", "Author": "HMCPennsylvania", "ReviewID": "UR5413362", "Content": "We usually stay at 3 star hotels, so I was a bit wary about the Chelsea Star. With my Father visiting from abroad, I needed room for 3 adults and 2 kids. Given the exorbitant rates in the Manhattan area, I booked the 2 room deluxe suite at the Chelsea Star. We requested a room facing the back (based on previous reviews on your site). Once inside, I really couldn't complain, there were 2 rooms, with three double beds, and a kitchenette. All the rooms were very clean, and the bathroom was a good size. The floor was laminate, and the paintwork fresh. The microwave and fridge really came in handy. I should say the furniture was very basic, and no frills in terms of desks etc., but the air conditioning was quiet and worked well. Also there was no street noise, and we all slept well. You are given keys to your apartment and the entrance to the buliding, and I did not have any concerns about our safety. In fact my son said that New York was more pleasant than he expected! The area is very convenient, clearly not upscale, but it's New York, and that comes with the territory. There are several reasonably priced restaurants nearby, so it is easy to pick up coffee, take-out etc. So unless you are extremely fussy about fancy drapes and toiletries, and want to spend 100's more, for a smaller room but with a fancy lobby, give the Chelsea Star a try.", "Date": "June 30, 2006"}, {"Ratings": {"Cleanliness": "4", "Overall": "4.0", "Value": "5", "Service": "4", "Rooms": "4"}, "AuthorLocation": "Houston", "Title": "“I felt like a native New Yorker”", "Author": "A TripAdvisor Member", "ReviewID": "UR5362833", "Content": "I was a little weary about staying at the Chelsea Star after reading some of the reviews, but it was very affordable and I decided to take a chance and go for it. Me and 4 friends rented the apartment suite, and WE LOVED IT. PROS: The room was a lot bigger than we all expected, especially my sister, who has stayed in hotels that were 3 times the price and less than half the size. The location is great...close enough to Times Square but far enough that I actually felt like a native New Yorker when we went \"home\" for the night. We bought groceries and pastries at the deli and bakery across the street (the coffee at the deli tastes better!!) and Subway is right next door...so you don't have to go far to get a late night snack. Our apartment suite was next door to the main building in what appeared to be an old apartment building. We had room 1R, which has a back door that goes out to a private rock garden area (just past the trash cans : ( ), and stairs up to the balcony area. It was only a few blocks from Penn Station, very convenient for us since we took the train from New Jersey. The beds were super comfortable, and the air condition was working very well (important for when you are visiting in the summer!) The sheets were clean and there were plenty of towels to go around. CONS: So it was bigger than expected, but the 3 beds I was promised actually turned out to be 2 beds and a pull out couch. The pull out couch was so uncomfortable for my sister that she had to sleep with my girl friend and I. Late night walks from site-seeing might be a little scary for a single woman traveling alone. Best to go in groups. OVERALL: I would definatley stay there again. Like I said, I felt like a native New Yorker with my very own apartment. : ) Definatley NOT the Marriott, but way better than a Motel 6. Would recommend if you REALLY want to experience New York as a native, not a visitor", "Date": "June 19, 2006"}, {"Ratings": {"Cleanliness": "3", "Overall": "1.0", "Value": "4", "Service": "1", "Rooms": "2"}, "AuthorLocation": "Washington, DC", "Title": "“Be cafeful if traveling alone”", "Author": "wonkybusker", "ReviewID": "UR5350866", "Content": "I have never turned down a hotel or hostel anywhere in the world, but after one night at this place, I checked out early. When I confirmed to the person at the front desk that there would only be one person in the room, me, I was informed that I was upgraded to a suite. This was weird, but maybe a coincidence. The suite was in an apartment building next door, which the hotel also owns and had a broken gate lock and a broken front door lock. It seemed very clean, although one of the pillows smelled awful. I was woken up sometime after midnight to someone buzzing on the doorbell. I don't scare easily, but this whole experience was very sketchy and I didn't feel safe staying there a second night.", "Date": "June 15, 2006"}, {"Ratings": {"Cleanliness": "3", "Overall": "2.0", "Value": "1", "Service": "2", "Rooms": "1"}, "AuthorLocation": "Edinburgh,UK", "Title": "“Beware of the Swirly Carpets!”", "Author": "ATraveller_7", "ReviewID": "UR5323394", "Content": "We have just returned from a five night stay at the Chelsea Star. Yes on the plus side the hotel does have a good location (approximately 10 blocks from Time Square) however we did not enjoy our stay here. The decor of our superior room was definately for those who love swirly multi-coloured carpets and bright yellow walls. There seemed to be a very distinctive smell throughout our stay, which appeared to be a mix of strong airfreshener and the smell of the sandwich shop a few doors down. This became increasingly nauseating as our trip went on. The reception staff blew hot and cold like the weather in the attitude towards us which is the last thing you need when on holiday. The most irritating aspect of our room was the adjoining door between us and next door. I suspect the door was made out of tissue paper, because we could hear every word our next door neighbours were saying!", "Date": "June 7, 2006"}, {"Ratings": {"Cleanliness": "5", "Overall": "5.0", "Value": "5", "Service": "5", "Rooms": "5"}, "AuthorLocation": "Dublin, Ireland", "Title": "“Perfect Location, Perfect Price, 5 Star Service!”", "Author": "A TripAdvisor Member", "ReviewID": "UR4370906", "Content": "We have just returned from a 4 night shopping trip in New York and stayed in the Chelsea Star Hotel. Do not be put off by the entrance of the hotel, it is just one block away from Madison Square Gardens. Inside, it is colourful and friendly and extremely clean. Myself and my friend stayed in a Deluxe room with a very roomy King Size bed with an ensuite bathroom. Room was cleaned on a daily basis with fresh towels and we also got fresh flowers in our room. So central for everything in New York and the staff are extremely helpful with maps, tour operators etc....Also, have a man who will carry down luggage etc....All the major sites are within walking distance from the hotel e.g. Macys, Empire State building. Would definitely recommend this to anybody visiting New York, wanting to spend their money on anything else other than accomodation! Cheap but extremely cheerful! Looking forward to my next trip!", "Date": "January 23, 2006"}, {"Ratings": {"Overall": "3.0"}, "AuthorLocation": "Melbourne, Australia", "Title": "“Not bad ... you get what you pay for”", "Author": "Melbournebelle", "ReviewID": "UR4349443", "Content": "My husband and I stayed at the Chelsea Star Hostel/Hotel in NYC in December 2005. We chose this hotel simply because it was affordable(hotels in NYC are extortionately expensive) and in a good location. We had a room with our own private bathroom, which was nice. Negatives ..... Room was tiny in size, but did the job for the four days we were there. Walls are paper thin - we could hear others snoring and people clomping down the hallway and having conversations in the middle of the night. Hotel security pass didn't work at times, and when we reported it we were told that as long as it worked in the room then it didn't matter if it didn't work to get into the hotel! Our opinion was that if it was the middle of the night and I (a female) was stranded out there in the snow on my own trying to get inside it wouldn't be the safest arrangement. It's fine if the receptionist is at the desk, but not soo good when you are pushing the intercom button a million times and not getting any response (it was just lucky when this happened that others were leaving the hotel and let us in). Also, we booked a room with a queen sized bed and upon checking in we discovered it was actually two single beds pushed together with a plank of wood joining the two beds. When my husband and I laid on it, the whole thing collapsed. Positives ... All in all though, it wasn't a bad hotel, it was in an excellent location, it was clean and it was inexpensive and provided us with a place to sleep and shower whilst staying in New York, which was all we really needed.", "Date": "January 12, 2006"}, {"Ratings": {"Cleanliness": "3", "Overall": "4.0", "Value": "5", "Service": "4", "Rooms": "3"}, "AuthorLocation": "Hampshire, England", "Title": "“Chelsea Star Hotel....True Star of New York”", "Author": "MissyUK", "ReviewID": "UR4333937", "Content": "This review is a long time coming, but anyway, here goes... We spent a week at the Chelsea Star Hotel and cannot praise it highly enough. Our room had clean sheets and towels daily, we had a shared bathroom, but don't let that put you off, there are more bathrooms available on the other floors, so take your pick. I stayed there with my 2 teenagers and they loved it, for the location and the friendly and helpful staff. The receptionist could not have been more helpful if he tried. If you're on a budget give it a go, it doesn't have all the frills that an upmarket hotel would offer, but i would rather spend my money on eating/drinking out and having fun than on a hotel room! We will definately return, trye value for money.", "Date": "January 9, 2006"}, {"Ratings": {"Cleanliness": "5", "Overall": "4.0", "Value": "5", "Service": "5", "Rooms": "4"}, "AuthorLocation": "Ireland", "Title": "“Definite Thumbs Up!”", "Author": "A TripAdvisor Member", "ReviewID": "UR4253933", "Content": "We stayed in the Chelsea Star Hotel for Thanksgiving this year. It was perfect! I had booked a double room with shared bathroom but when we got there they had upgraded us to an ensuite bedroom...never gave a reason why so we didn't ask!:) It was really good value for money and in a perfect location. I would really recommend this hotel for the budget traveller.", "Date": "December 21, 2005"}, {"Ratings": {"Cleanliness": "5", "Overall": "5.0", "Value": "5", "Service": "4", "Rooms": "3"}, "AuthorLocation": "", "Title": "“Fantastic value for money!”", "Author": "A TripAdvisor Member", "ReviewID": "UR4127144", "Content": "The Chelsea Star is in a great location, accessible to all the main sites and is literally across the road from Penn station and Madison Square Garden. True, the rooms are small, but if you're going to New York City, chance are you won't be spending much time there anyway!! There's a subway station two minutes away which will connect you to anywhere in the city, the staff were very helpful, the rooms were cleaned and bed linen changed every other day. We couldn't believe that we could get this standard for this price. Highly recommended if you're on a budget or you've got better things to spend your money on - and in this city there is definitely lots to be buying, those shops are toooooo goooood!!!", "Date": "November 19, 2005"}, {"Ratings": {"Cleanliness": "5", "Overall": "4.0", "Value": "5", "Service": "3", "Rooms": "5"}, "AuthorLocation": "Paris", "Title": "“Great deal”", "Author": "A TripAdvisor Member", "ReviewID": "UR3983729", "Content": "Very good experience in this tiny hotel with a lot of charm. Room very clean and a lot of space. Amazing bathroon for NY. Location is not great and people don't smile easily but We definitively recommand you this hotel", "Date": "October 2, 2005"}, {"Ratings": {"Cleanliness": "4", "Overall": "4.0", "Value": "5", "Service": "5", "Rooms": "4"}, "AuthorLocation": "St. Augustine, Fl", "Title": "“Had a GREAT time!!!”", "Author": "A TripAdvisor Member", "ReviewID": "UR3936337", "Content": "No, the Chelsea Star is not fancy, but it is clean and affordable. I booked a double room with a shared bath and was upgraded to a superior room because it was my birthday. The room was clean, the batroom clean, and my room was serviced the next day while I was out. Ok, so the tv was a little fuzzy on some channels, but so what! I wasn't in New York to watch tv. The hotel has a great location; I walked to most of my destinations. The service was very friendly and helpful. The ac was very, very cold. The water pressure was not too great, but the the water stayed hot the entire time I was in the shower. I really enjoyed my stay at the Chelsea Star and would stay there again.", "Date": "September 24, 2005"}, {"Ratings": {"Cleanliness": "3", "Overall": "2.0", "Value": "1", "Service": "3", "Rooms": "2"}, "AuthorLocation": "Canada", "Title": "“Over priced, funky, dive!”", "Author": "Doxiegal", "ReviewID": "UR3756669", "Content": "My 16 year old daughter and I just got back from our big trip to New York where we chose to stay in three different hotels to enhance our experience. My daughter picked the Chelase Star as it sound \"cool\", I agree'd because of price and I was mixed up with the classic Chelsea Hotel. We arrived by cab in front of a Subway restaurant and flower shop, we looked at the cab driver like he had 3 heads as he pointed to the sign reading the name Chelsea Star. I instantly felt sick, once we got inside my spirits picked up a bit as it was really decorated cute with bright yellow halls, metal doors and stars stenciled through out. We first had the \"King and I \" room and again my heart sank, very, very small, and dark and dingy looking. I went to the front desk to see how muchi t would cost me to get a two bed room and he advised me that really they were intended for 4 people but asked if we would like to see the \"Coney Island\" room. This room was indeed bigger and much brighter so we stayed. I disagree with some of the reviews on the cleanliness as I felt our room was very clean and the bedding was very white and no smell at all to the blankets. The noise was almost unbearable, not from other rooms but from 8th street. I really knew I was in NY City as I listened to horns honking, a fight from the little bar down the street and some loud mouth yelling at his friends all night. I must say that it was quieter from 1-6am. The bathrooms were not spotless and there was no shelving or hooks to put your clothes or towels on while showering and I really did not want to sit them on the toilet. The shower stalls and bathroom were dark stone and gave it a dingy feel, my daughter disagrees she loved the look of the bathroom. The bathrooms were busier than the other hotel we had stayed at and you knew when someone had showered and the garbages were not emptied constantly as the other place we stayed. The location is very handy, with subway 4 blocks down and airport shuttle to Newark as well, only 13.00 a huge savings over a cab! It is a grubbier area so walking late at night kept me on my toes. All in all, this place was an old dive of a hotel fixed up to the best of anyones ability, they kept it relatively clean and the staff were pleasant and helpful. Great for the young perhaps but even my daughter is not sure she will return and it was not cheap for what you got. Don't get caught up in the cute theme room concept, for the same price you could stay at Hotel 17...read that review!", "Date": "August 12, 2005"}, {"Ratings": {"Cleanliness": "1", "Overall": "2.0", "Value": "3", "Service": "3", "Rooms": "2"}, "AuthorLocation": "Montreal, Quebec", "Title": "“Surviving The Chelsea Star”", "Author": "Milnoc", "ReviewID": "UR3659476", "Content": "The Chelsea Star is a tourist class hotel located in a yellow building on the southwest corner of West 30 Street and 8th Avenue, a stone’s throw away from Penn Station and the 34 Street subway stations, with the hotel’s only entrance located on West 30 Street. Look for the stars imprinted in the sidewalk cement. The hotel itself is actually located on the second floor of the building, occupying three full floors, and has no elevator. So people with heavy luggage may want to avoid this hotel unless you don’t mind the workout. All the private rooms with shared baths are painted and decorated in different themes such as the Rudolph Valentino room, the New York Nights room, and the Madonna. The private rooms with private baths have upgraded accommodations for those wanting more privacy. The hotel also includes dormitory rooms that can be reserved for a maximum of two weeks and can’t be reserved again by the same people for six months afterwards, preventing vagrants from taking up “permanent residence” at the hotel. Check-in went reasonably well. Not only did the hotel have my reservation, they were also able to assign me the room that I’ve requested, the “Madame Butterfly” room, located on the fourth floor and decorated with Asian elements. As you can see from the pictures, the room is very small, but that in itself wasn’t much of a deterrent since it was just enough space for my needs, it was cheap, and most importantly the air conditioner worked properly. Noise was a problem with the room, but not necessarily from the adjoining rooms (I lucked out on thick walls). Much of the noise came from 8th avenue itself, consisting mostly of taxis honking their horns whenever someone got in their way. One way to cut down on the noise is to sleep with your head close to the door instead of the window. The room also had a few other irritants. First, I saw the resident mouse try to escape from my room, making me wonder if it was something about me personally that the mouse didn’t like. Second, along with the dirty carpet as seen in the images, many parts of the room were not properly cleaned such as the phone and the space under the Buddha statuette. Third, the electrical extensions powering the TV were originally stapled to the wall, but eventually came loose over time. Unfortunately, the staples were shot right through the electrical conductors, creating a potentially fatal shock hazard. I showed the wiring to the resident handyman and he replaced it right away. The shared washroom was probably as clean as it could ever be considering it’s the middle of summer, it’s hot and humid, and just about everyone needed to take at least two showers per day just to feel slightly clean. The sink and toilet were fine for their respective duties, but the shower faucets were a bit of a challenge. Turn the hot water faucet, wait for hot water to eventually come out from the showerhead, and then turn the cold water faucet to prevent scalding. In this hotel, water pressure and faucet control are the main plumbing problems. I had to use the third floor washroom one morning because the fourth floor washroom was occupied for a long time (the only time this happened). I discovered that the tap water tasted a bit different depending on which floor you resided. While the fourth floor’s water tasted reasonably neutral for a big city water supply, the third floor’s water had the distinct after-taste of a men’s public washroom. After brushing my teeth, all the toothpaste did was add a mint-flavoured coating to the toilet after-taste, similar to what you would probably experience if you tried eating urinal cakes. The terrace was a decent oasis from the outside world as long as you didn’t mind the rumbling of half a dozen air conditioning units and the site of a few plastic garbage cans at one end which are conveniently hidden from the hotel’s official photos. The patio furniture however was of reasonable quality, and the garbage cans emanated no objectionable smells considering the hotel doesn’t distribute or even allow food in the rooms. The guests themselves were reasonably well behaved and for the most part tried to keep the noise level down to a minimum which isn’t easy considering that despite the metal covering on the room doors, noise would easily pass through them as if they were made of paper. Final tidbits: staff members for the most part were reasonably helpful, and the room key never worked on the hotel’s outdoor card reader. All in all, my stay at The Chelsea Star was a New York Experience in itself, and not necessarily an objectionable one. But would I want to go through the same experience twice? Probably not. This doesn’t necessarily mean I would prefer to stay in a more expensive hotel the next time I’m in the city, but it does mean I’ll want to try out a different tourist class hotel in another part of the city.", "Date": "July 12, 2005"}, {"Ratings": {"Cleanliness": "4", "Overall": "4.0", "Value": "4", "Service": "5", "Rooms": "4"}, "AuthorLocation": "London", "Title": "“Friendly, convenient and great value”", "Author": "A TripAdvisor Member", "ReviewID": "UR3535686", "Content": "I had read the reviews on trip advisor before going but after booking so perhaps was expecting the worst of this hotel. I was very surprised and have to disagree with many of the more negative reviews. The Chelsea Star is not hard to find, it is on the corner by the flower stand and whilst it does not have the grand entrance of the Plaza it is well sign posted. The reception was very friendly and they did have our booking but were (not surprisingly for the May Day Holiday) overbooked so asked if we would move from the Superior to the Deluxe room. Initially we said no and they upheld the original reservation, but having seen both rooms we decided to move taking advantage of the discount they offered for our inconvenience. Both rooms we stayed in were clean, sufficiently big for a hotel room in New York which was used essentially for sleeping and showering. The beds were very large and comfortable although I would not recommend the sofa bed in the superior room. The service was at all times very friendly and efficient and what better location could you ask for. I agree it is not a 5 star hotel, but for the money and the sheer convenience of location I thought it was excellent. I will definitely go back especially now that the Plaza has closed! I can also recommend the Cheyenne Diner (featured on the Tropicana advert currently)and the Stage Door both close by for great brunch and the Chelsea Bar and Brasserie for delicious French food with US style service!", "Date": "June 7, 2005"}, {"Ratings": {"Cleanliness": "3", "Overall": "4.0", "Value": "4", "Service": "3", "Rooms": "3"}, "AuthorLocation": "Leeds, UK", "Title": "“Dorm beds are worth the price $35”", "Author": "A TripAdvisor Member", "ReviewID": "UR3352600", "Content": "I stayed here with another female traveller in september for the last three nights of my trip. We booked the dorm beds as we were definately on a budget! At $35 they are the average price for New York in Sept. I rang from Philadelphia to confirm my booking two days before and when we arrived everything was ready for us. Its true that to get in you have to ring the bell and hope someone on reception answers, but i guess we were lucky as they did straight away. We ended up in a two bunk room sharing with two german boys... This was perfect as there was enough space for all our things without us having to get to know each other too intimately!! There was a TV which did have bad reception, but as has been mentioned before...You're in NYC!!! Go out! The locations great....so close to Penn station and the airport bus stop to Newark and JFK. You can walk all the way down town to the Statten Island Ferry very quickly and if you walk a little way down eigth avenue you'll find a loverly Bagel shop on the left hand side ($1 brekkie). There is a subway sandwich below but i deffs couldnt smell them! Plus there $1.99 specials each day make life cheap if u are poor like me! You can hear the traffic in the room but deffs get used to it. The common area to sit outside is ok just to chill between exploring. The Bathrooms. Right. Well, I had no problems with them having stayed in places where they have been twenty times worse! But they arnt the cleanest things you'll ever use. However if you simply take your own soap, and try and guarantee you have some flip flops with you and your own towel you should do just fine! They were cleaned when i was there, dunno bout now! People on reception were really nice! I think i might have met the girl that everyone has been going on about as being horrid, but i guarantee if you go talk to her and make her talk to you by asking for help with directions etc she can be way helpful! Having stayed previously at the Milford Plaza near to Broadway for $135 a night (a loverly hotel and very nice peeps etc, but too expensive for my budget), and Jazz on the town (the most hideous place ever ever) which was about $30, I can certainly suggest this place for people who are travellers and have therefore always seen something worst than the place they are! I suggest spending a night at jazz on the town before transfering here if you don't think you have! I expect i will return here next summer or try out sugar hill in harlem if not....", "Date": "April 12, 2005"}, {"Ratings": {"Cleanliness": "2", "Overall": "4.0", "Value": "5", "Service": "4", "Rooms": "3"}, "AuthorLocation": "manchester uk", "Title": "“great value.. great locatoin”", "Author": "janeybanjo", "ReviewID": "UR3352494", "Content": "we have stayed in many hotels in nyc, this one is no better or worse than more expensive hotels we have stayed in ..in fact we booked in for an extra night , it is in an excellent location.. was a little noisy ,but for gods sake you are in a big city! and it was excellent value.", "Date": "April 12, 2005"}, {"Ratings": {"Overall": "1.0"}, "AuthorLocation": "Boston", "Title": "“You better Re Confirm...”", "Author": "A TripAdvisor Member", "ReviewID": "UR2886371", "Content": "I had booked a room only to show up and be told that it had been given away. At this place, check in time means check in or lose your room time. It should really be called a check in deadline to be more accurate. The guy at the desk was nice, but what kind of ---- is this for a weary traveller to deal with. \"Sorry, but find another hotel in New York at a moment's notice. Thanks for NOTHING!", "Date": "December 16, 2004"}, {"Ratings": {"Overall": "1.0"}, "AuthorLocation": "boston", "Title": "“Do not expect a room if you reserve one”", "Author": "A TripAdvisor Member", "ReviewID": "UR2884713", "Content": "I reserved a room at the Chelsea Star hotel for 12/13/04, using the hotel's website and my valid credit card. I provided all the information that was required. We chose this location for price, it looked interesting and because it was within close walking distance of a venue we were attending during our one day trip. I recieved a confirmation email from them that my credit card had been processed and another one stating: \"Thank you for choosing the Chelsea Star Hotel for your New York City lodging needs. We look forward to your arrival and plan to make your New York experience a very special one!\" My reservation was for a deluxe room and my confirmation number was: 821769 It clearly states on the Chelsea Star website that this confirmation is a GUARANTEE that the room will be available when they say it is. Don't get your hopes up. There is a prompt on the reservation form that asks what time you will be checking in. Make sure you arrive prior to that time and wait for your room, because if you are late, they will release the room. Of course there is no indication that they are going to do this, as it seems like they just ask that question to make sure that the room is ready for you when you arrive. My travel partner chose 3pm, and we arrived at 3:45. Upon our arrival I was notified by the friendly but less than helpful desk clerk that my \"deluxe\" room had been given away and I would be staying in a \"superior\" room. Unfortunately this was the room that my travel partners, who were standing next to me at the time had reserved. The clerk fed us a line about how my friend needed to \"reconfirm because you're late (45 minutes late on a room confirmed with a valid credit card) and we gave the room away\" and that there were no other rooms available to accomodate them. The icing on the cake was that they bumped me down a notch into their room just becasue I registered first. The clerk referred us to another hotel, and since we only had an hour to check in and get ready for the event we were attending, we had no choice but to quickly drive across town to the other hotel, (see the review of that disaster elsewhere). He also said he would call and reserve a room for us there, but we watched as he called their so called \"partner hotel\" and simply asked if there were rooms available. No pricing info, no alternates, nothing. Basically, he offered us directions and gave us a map and said \"you are here, the hotel is over here\". Not very helpful. The new hotel was about thirty blocks away from our desired location, which was within walking distance of the Chelsea Star. The prior arrangements we made to park our car in Chelsea were useless, so we had to pay an arm and a leg for parking. All told, between the cost of cab rides, parking and the new hotel, we lost out on any money we would have saved by staying at the Chelsea Star. I won't even mention the time that we wasted dealing with this fiasco. It seems from other reviews that this is the M.O. for this hotel. I would not recommend this non-experience to anyone looking to drop their bags and relax in the great city of New York. I travel frequently and enjoy staying at out of the way places that may not offer the same homogenized experience as a regular run of the mill hotel. It would have been nice to have a positive experience at this hotel as I have had at many others like it. Unfortunately \"Funky\" not only refers to the decor, but also to the way they run the business. If you still choose to brave these odd reservation policies, I would suggest calling the desk every five minutes until you arrive to make sure your \"reservation\" still exists. Good Luck.", "Date": "December 15, 2004"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Edinburgh, United Kingdom", "Title": "“Star shines bright.”", "Author": "NikEdinburgh", "ReviewID": "UR2878534", "Content": "This \"Star\" shines bright in the heart of NYC. Our party of 5 took 3 rooms for 5 nights in November 2004 and found the Chelsea Star a haven among the craziness of New York. Bear in mind this is a budget hotel, if you expect Plaza style service, go pay Plaza prices. We occupied a Superior double, a double and a single. The Superior was magnificent (considering the price) with a four poster bed that would sleep 5, very spacious, clean tidy and warm. With windows onto to the street it is a bit noisy, but hey it's New York City outside. The double was the Madonna Room, which is the very room Madonna stayed in when she moved to the city. It was covered in photo's, records etc. The single room does what it says on the tin, a small room with a single bed and a T.V. The double and the single have shared shower facilities which aren't a problem as the shower is next to the room and were very clean and tidy. The big plus for this hotel is the location. On the fringe of Chelsea it's located in a vibrant neighbourhood, all your needs are on your doorstep. Go for breakfast in the Tick Tock Diner (200m up 8th Ave), grab a sub from the Gardenia Deli across the street along with an excellent range of brewski's. Don't miss out on a visit to D'Autio's for a slice of the Worlds best cheese cake and a cup of the excellent 75c coffee, it's just around the corner. The patio area of the hotel is tremendous to sit and eat lunch with a lovely afternoon beer, it also gives you the chance to chat to other guests and swap stories and tips. With most attractions in walking distance but with a feeling of being a world away from the Times Square madness this hotel is a must for the budget traveller. And hey don't forget to tip the room staff every day, even if it's only a coupla bucks, you think they work here 'cos they're millionaires.", "Date": "December 13, 2004"}, {"Ratings": {"Cleanliness": "2", "Overall": "1.0", "Value": "1", "Service": "1", "Rooms": "1"}, "AuthorLocation": "california", "Title": "“Awful unless you can sleep through anything”", "Author": "A TripAdvisor Member", "ReviewID": "UR2863536", "Content": "The Chelsea Star on the surface is hip and colorful but once you try to bed down for the night you realise that the beauty is only skin deep and the walls are paper thin. During my stay of one night I could hear the man next door snoring, the brits across the hallway talking and watching TV and the guest upstairs walk around and even turn over in bed. We could feel the springs through our mattress and the since we were in the room with a view of the outdoor patio we had a nice floodlamp aimed at our window which was barely blocked out by the venetian blinds. The shower fixture was broken which I managed to fix with a few matchsticks and the water pressure was pitiful. I'm surprised they were even kind enough to endulge us with soap as there certainly weren't any other amenitites you'd expect for the money spent. We checked out the next morning and went to pennsylvania hotel which is nearby and is indeed quiet and comfortable and provided everything you'd expect from a hotel even if is a bit shabby. If you are staying in one of the Chelsea Star's less than $100 rooms with shared bath or bunk beds then you might tolerate all the noise etc for the relative cheapness but for $40 more you can get better service and comfort elsewhere. Otherwise bring an air mattress, a blindfold and earplugs.", "Date": "December 5, 2004"}, {"Ratings": {"Cleanliness": "4", "Overall": "4.0", "Value": "5", "Service": "5", "Rooms": "3"}, "AuthorLocation": "Dallas, Tx / Washington, D.C.", "Title": "“A Unique Lil' Hotel For a Smaller Budget”", "Author": "A TripAdvisor Member", "ReviewID": "UR2844827", "Content": "I was a little leery about visiting the hotel after reading some of these reviews. I called a day prior to arriving to verify that my reservation was still valid - and when I showed up the next day, they explained that they had upgraded my room from a theme to \"superior\" (we had to wait an extra hour and half though) - It has a private bath After we were able to get to the room - I found it to be quite refreshing. It was a tad small - but very clean and well kept. The only major complaints that I had was that the walls were thin (you could definitely hear your neighbor), the TV (which had a DVD player built in) didn't get some channels really well, and the A/C wasn't very good, Lucky for us - we went in November. Since there was no vending machine's or cups for water and such - the Subway Restaurant right below the hotel came in handy On the other hand, the front desk was very helpful - offered us advise on things to do and ways to get around. The location was fantastic - about 2 blocks away from Madison Sq Garden / Penn Station, lots of nifty diner's and food joint's around. There's a quaint little patio for smoking and socializing and there is pay Internet terminal downstairs. I didn't get a chance to see what the Theme rooms looked like - but I did get a chance to see the shared bathroom. On each floor (there are 3) - about 8 rooms share one bathroom (which always looked spotless when I checked). For the price and location, I don't think that this could be beat. And, if you are going to NYC as a tourist, how much time will you spend in the room anyway?", "Date": "November 24, 2004"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Glasgow", "Title": "“funky and fun”", "Author": "A TripAdvisor Member", "ReviewID": "UR2813688", "Content": "Lovely hotel, with a funky interior, which surprisingly hides the cheap decor. It is ideally located just around the corner from madison square gardens...so you are almost equal distances from greenwich village and times square. It felt very clean and safe, would recommend it to friends and family. The little courtyard would be great for partying in the summer and there are two irish bars just across the street!! Ideal", "Date": "November 9, 2004"}, {"Ratings": {"Overall": "1.0"}, "AuthorLocation": "Scranton, PA", "Title": "“Good location, bad facilities”", "Author": "A TripAdvisor Member", "ReviewID": "UR2781342", "Content": "The Chelsea Star has only one thing going for it and that is its location. Nothing else. The rooms are tiny, there are virtually no facilities provided, no not even toiletries, and the rooms are horribly done up with some kitschy 'art'. Even the blinds are tattered and there is no space to keep your stuff. The TVs don't work well, forget about the remotes. The place is claustrophobic and uncomfortable.", "Date": "October 23, 2004"}], "HotelInfo": {"Name": "Chelsea Star Hotel", "HotelURL": "/ShowUserReviews-g60763-d208888-Reviews-Chelsea_Star_Hotel-New_York_City_New_York.html", "Price": "$53 - $431*", "Address": "<address class=\"addressReset\"> <span rel=\"v:address\"> <span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">300 W 30th St at 8th Ave</span>, <span class=\"locality\"><span property=\"v:locality\">New York City</span>, <span property=\"v:region\">NY</span> <span property=\"v:postal-code\">10001</span></span> </span> </span> </address>", "HotelID": "2514572", "ImgURL": "http://media-cdn.tripadvisor.com/media/ProviderThumbnails/dirs/59/ae/59ae7760a9a8c7fa4298f82c86b725cf8large.jpg"}}