{"Reviews": [{"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Northampton, United Kingdom", "Title": "“Fab Family Friendly Hotel for Visiting London”", "Author": "Michelle415", "ReviewID": "UR127376199", "Content": "We were after a cheap hotel whilst visiting London with our three children, 1yr, 4yr and 6yr. Being our first stay in a premier inn, we didn't know what to expect, but we were pleasantly surprised. The room was plenty big enough, we had a corner family room - 1 mahoosive bed, 2 small doubles, and a cot, was on the 6th floor, so nice and quiet. Food was lovely, we had dinner and breakfast, both meals were good value for money, and really, really nice. Staff were friendly, although they had said about an easter egg hunt to my son, but there was no evidence of it in the morning :( - wasn't expecting anything tbh, but 6 year olds remember (and go on about) easter egg hunts!! Good position in which to explore the city by, tube station a couple of minutes walk away, and the staff were helpful when we needed advise. The thing that I liked the best is that it's no extra for families, than it would be for a couple, and this goes for all ppremier inns so I believe. Also kids breakfast was free (max 2 per 1 paying adult) Feel like we got a bargain, and in london, that's a bonus!! Will definatly stay here again", "Date": "April 6, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Cardiff", "Title": "“Excellent stay”", "Author": "Kerrelor", "ReviewID": "UR127302461", "Content": "This was a lovely hotel. Only 3 or 4 minutes walk from nearest tube station, pleasant views from high floors. Staff very pleasant and helpful on desk and in restaurant. Lovely food, both dinner and breakfast. Meal deal good value for London. A little way out from Centre of London - just under 20 minutes on the tube to London Victoria - but price reflects this. Very happy.", "Date": "April 5, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "5.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Hereford, United Kingdom", "Title": "“Impressive Service”", "Author": "BigAl1989", "ReviewID": "UR127236888", "Content": "Having stayed in the hotel (2/4/12) for a night I was pleased with the service me and my mate received. The staff were helpful in information about meal times and car parking arrangements, not to mention they were friendly and positive, we were happy to leave the staff a tip after we had our meal. Would recommend staying here I know if I go to London again I will be. Very ideal location with the tube station literally around the corner.", "Date": "April 4, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "manchester", "Title": "“Good Accommodation”", "Author": "penelopepitstop66", "ReviewID": "UR127229875", "Content": "Good all round accommodation. Friendly staff. Excellent breakfast.Hammersmith PI is near to tube,shops at Hammersmith. Park, river and pubs nearby. Hammersmith Apollo just up the road. Great for short break.", "Date": "April 4, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "3", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Leicester", "Title": "“Nice Hotel”", "Author": "Harrydavy", "ReviewID": "UR126750616", "Content": "Good location Nice & clean Good service Only negative is it would be better if it had an adjoining pub rather than the little room that comprises bar & resturant ( but I guess there wasn't the room to do so). Overall very good!", "Date": "March 27, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Amlwch, Wales, United Kingdom", "Title": "“Great hotel for gigs to the HMV Hammersmith Apollo, and for commuting into central London.”", "Author": "Irene D", "ReviewID": "UR126515742", "Content": "This was my first time staying at this particular Premier Inn, but the warm welcome I received upon arrival far out-matched that of previous Premier Inns I'd stayed at! The room I had was very, very small in comparison to other PI's, and the single beds had been pushed together, due to the small space...but the room was very clean and well maintained, as usual for PI's.. The hotel is well positioned for walking to the HMV Hammersmith Apollo (approx 15 minutes stroll away), and I didn't feel unsafe doing this walk alone gone midnight... Its also ideal to use as a base to venture into central London, as there are 3 mainline stations nearby - with Ravenscourt Road station being the nearest (about 5 mins away). The only other niggles I had (apart from the small room size), were small things...only one chair in the room (when it was a twin, so one of us had to perch on one of the beds)...noisy students running up and down the corridor...no double glazing (so let road noise etc in)...and was woken up one night by the couple next door having sex! Haha - yeah, the walls are PRETTY thin!!! :D :D And the car park is TINY!!! Apart from these minor gripes, this hotel offers a great location for getting out and about in London, and is brilliant for going to the Hammersmith if you've a gig on (like I had)...and the attitude of the staff makes up for these moans too - they're all really friendly and helpful and were genuinely interested in what I had been doing that day etc. I'd definately use the Hammersmith Premier Inn again - its just a shame the small room etc dulled the shine on what would have been my best Premier Inn stay to date!", "Date": "March 22, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "3", "Rooms": "3", "Location": "5"}, "AuthorLocation": "South Molton, Devon", "Title": "“You get what it says on the tin!”", "Author": "dollydollop", "ReviewID": "UR126492118", "Content": "A standard Premier Inn so you know what to expect when you open the door. The soundproofing could be improved as we could hear next door's TV from 6am and noisy aircon fan in our room. Location perfect for us as we went to the Hammersmith Apollo.", "Date": "March 22, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Bridgwater, United Kingdom", "Title": "“great hotel for families visiting London”", "Author": "tmm01", "ReviewID": "UR126344438", "Content": "Have stayed twice, each time in a family room. Ideal to get into London via tube. Boys enjoyed their stay (6yrs & 8yrs). Family friendly. Clean. Only not much parking, and you have to pay for it - still cheaper than parking in London. A great budget stay for a family. Would recommend. We use it each time we visit the Capital, we come from the SW so ideal motorway links and easy to drive to, if you don't like driving right into London.", "Date": "March 19, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "3", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Chorley, England, United Kingdom", "Title": "“does what it says on the tin”", "Author": "TheNorthernTrainMan", "ReviewID": "UR126056562", "Content": "A couple of minutes walk from Ravenscourt Park tube this hotel is easy to find. If driving there isn't much of a car park. I booked 2 single rooms at the weekend but we both had double beds which was great as I'm 6ft 5in! Room was small with modern decor - this was fine as all I needed was somewhere to wash and sleep. Everything worked, bed was comfortable and clean, bathroom was tiny as was the shower - any larger boys & girls beware! Plenty of hot water. Overall cleanliness was very good (I do have a habit of checking for dust on top of wardrobes etc - v sad!) Shower unit could have done with a few more minutes cleaning attention around the base but I'm being picky. There was some traffic noise but many locations in london you will get this particularly as I had to sleep with the window open as the room was so warm. No aircraft or tube noise and as there are only 10 or so rooms on each floor wasn't disturbed by doors banging or folk passing by on the corridor. Overall a good hotel matching PI's marketing. Hammersmith was a 10 minute walk - handy for bars and shops. I'd recommend it if what you are looking for is a quality budget hotel.", "Date": "March 13, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Dubai", "Title": "“fine place”", "Author": "MohammedJaffar", "ReviewID": "UR125977328", "Content": "good place close to the tube station. most important on the Piccadilly line. On the other side is the heathrow airport connections. can get to central london in minutes thru the tube. good hotel, ambiance too...", "Date": "March 12, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Newcastle upon Tyne, United Kingdom", "Title": "“Great budget hotel”", "Author": "EMR31", "ReviewID": "UR125975864", "Content": "I stayed one night at the Premier Inn in Hammersmith, and I wouldn't hesitate to recommend it. The building, from the outside, is not inspiring (but is easy to spot), a great concrete high rise, but then I was staying in it, not looking at it! There were some security measures in place (you had to use your room key to access the accommodation floors) which helped make me feel safe and secure. The hotel was well maintained and comfortable. The room I had was very small, although I expected nothing else for the price in London. It was fine for me, but a couple would have struggled a bit. The double bed was pushed up against one wall and floor space was minimal - there would have been a lot of edging past one another! The room was clean and well presented, and it had secondary double glazing to help deaden the noise from outside. The bed was what I would class as 'all right' - it certainly could have been a bit firmer but it was by no means was the worst I have ever experienced. The shower room was also clean. Again, it was small, and had no bath, but the water pressure was fantastic. Breakfast was fine, although some Premier Inns give a wider choice of breakfast, space in the dining room was constrained. Above all, the staff were fantastic - all very helpful and courteous. The hotel is roughly 200 yards from a tube station. All for £50 for the night (paid in advance, double if you wanted the flexiility to cancel). What more could you want?", "Date": "March 12, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Sleep Quality": "5", "Rooms": "2", "Location": "4"}, "AuthorLocation": "Worcester, United Kingdom", "Title": "“Rugby fan visiting the Twickenham Stoop for Premier division game Harlequins vs Worcester Warriors”", "Author": "William H", "ReviewID": "UR125860242", "Content": "Very conveniently situated to visit my niece and watch the rugby. stayed 4 nights, staff excellent room a little cramped but overall very enjoyable. Good facilities should they be needed. I have stayed at the Hammersmith on two ocassions recently and would always recommemd it.", "Date": "March 9, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "4", "Sleep Quality": "4", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Scotland", "Title": "“Clean Convienent Hotel”", "Author": "clairedScotland", "ReviewID": "UR125543581", "Content": "I stayed at this Premier Inn for one night. I choose because of the location - I wanted something in Hammersmith. It is very close to the tube station if you did want to travel into central London, and there are several restaurant / bars nearby. From the outside it looks really ugly, however as soon as you are inside you get a lovely welcome from the reception team. I would recommend a room on the top floor (12th floor). I had a corner room and the views were amazing - also it was really quiet. The room was as expected for a Premier Inn, so I was happy with this and the facilities. I did eat in the restaurant (mainly as I didnt have much time), however I probably wouldnt do this again. The soup (smoked tomato) was asty but so boiling hot it had to have been heated up in a microwave. It was unbelievably hot - so took quite a while to eat. This meant (I think ) my main course sat on a hot plate for a long time: I had a special salmon with caper sauce, brocolli and new potatoes. Sounded nice but was all overcooked. In summary - would I stay here again? If I needed to be in Hammersmith yes, but if I was visiting London on holiday I would want to be closer to the centre. I would eat in one of the several restaurants nearby for evening meal and there are a few coffee shops / cafes that I would go to instead for breakfast.", "Date": "March 3, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Lichfield, United Kingdom", "Title": "“Ugly on the outside, beautiful within!”", "Author": "LintonWood", "ReviewID": "UR125471274", "Content": "I visited this hotel with a colleague while on a recent business trip to London. While not the most attractive building in the chain, it offers a clean and friendly base for such an excursion. Be aware that parking is very limited – only about two dozen spaces at a cost of £15 per night. We were also warned not to leave valuables in the car overnight! The reception area is spacious and has seats and tables where guests can hold an informal meeting or gather to chat before going out. The bar and restaurant area is immediately adjacent to reception and fairly small by the standards of Premier Inn, but very clean and well laid out. All staff members that we encountered were very friendly, efficient and well trained. The hotel is thirteen storeys high and there are certain security measures in place that suggest there may have been issues with unwanted guests in the past. That said, my colleague and I wandered up to a local pub and felt safe enough. While my room was unconventionally shaped, everything was exactly as it should be and I enjoyed a comfortable night. The shower was very powerful with lashings of hot water and the air conditioning could be easily adjusted. I didn’t have my evening meal at the hotel but the breakfast was fabulous – Premier Inn at its best with a proper buffet – all a hungry businessman could want to start his day. All-in-all I would be happy to recommend this hotel to fellow travellers and would have no problems staying there again when next in the area.", "Date": "March 1, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Leeds, UK", "Title": "“Lone traveller made to feel at home”", "Author": "Sandandseaforme", "ReviewID": "UR125412452", "Content": "Stayed here between a business meeting in central London one day and a private event in Richmond the following day due to it's location and cost compared to other Premier Inns in the area. It's easy to find and just two minutes from Ravenscourt Park tube. The room was smaller than I've enjoyed at other Premier Inns but had everything I expected & needed. Even a good full-length mirror with excellent lighting and a hair dryer with a long cable. I was shattered after a very long and busy day. All I wanted was a bite to eat and go to bed. I went to eat in the restaurant, I was asked how many the table was for. I replied that it was just me and saw I was the only one in the place. The manager replied that I was not on my own as he & the waiter would look after me. I thought that was a lovely touch. I felt a bit guilty when I saw I could have pizza in my room. But I still ordered one, with a side salad and a bottle of wine. It was all nicely wrapped with a selection of condiments within a short time. The waiter offered to carry it to my room - I declined as a few people had started to arrive. I slept like a log and heard no noise in the corridor even though I was by the doors/lift. Breakfast was a buffet but with poached/boiled eggs/porridge on request. There was no queuing to make toast, pour drinks etc. and I only waited a few minutes for my poached eggs. I don't know what some people expect. But the couple on the table next to me moaned that the buffet was not fresh and food had been hanging about. It was not and had not - the food was not piled high and was being refreshed regularly as it was in small containers and the place was full of people wanting the full English. Mind you, they also complained the coffee cups were too big, the tea cups too small and the toast tasteless! For me it was another enjoyable stay in a Premier Inn where good customer service comes as standard.", "Date": "February 29, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Bedfordshire", "Title": "“Good location”", "Author": "Janey-TRIP", "ReviewID": "UR125291692", "Content": "Great location for exploring London. Found the staff extremely friendly & helpful, stress free check in & out. Our room very clean, fluffy towels & bed very comfortable. No traffic noise, we had a room just by the lift & no noise from that either. Near some good restaurants & bars. Would stay here again", "Date": "February 27, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Manchester, United Kingdom", "Title": "“Excellent on the whole”", "Author": "MrsChrisW", "ReviewID": "UR125279525", "Content": "Lovely clean hotel with pleasant staff. The one downside was that I had book a disabled room and was given a non disabled one, apparantly I should have mentioned this again at check in. As by the time I realised I had been given the wrong room I was dog tired and on the 10th floor I did not make an issue but was told the next day had I raised it I could have been moved. The problem was not significant as I was only there one night but it would have been had I been staying longer. The breakfast was delicious.", "Date": "February 27, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "3", "Location": "4"}, "AuthorLocation": "North Scotland", "Title": "“good stay”", "Author": "catmac25", "ReviewID": "UR125023431", "Content": "Great place to stay, the hotel really nice, staff pleasant and helpful and the restaurant is also great to eat in with a good kid's menu. You can always rely on getting clean rooms in this hotel and Hammersmith is a good place to stay with the hotel only a couple of minutes from the tube.", "Date": "February 22, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Brixham", "Title": "“Perfect”", "Author": "PBS01", "ReviewID": "UR125023114", "Content": "As a group of 4 girls staying away in London for the weekend, we requested our rooms be near each-other and they did just that- next door in fact. Room was spotlessly tidy and a separate bathroom and a television with lots of channels including music and radio channels to have as background noise when getting ready, Lovely comfy beds and lots of mirrors and light. Not bothered once by staff and enjoyed it very much. Would definitely stay again.", "Date": "February 22, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Nottingham, United Kingdom", "Title": "“Family break in London”", "Author": "Helen S", "ReviewID": "UR124984745", "Content": "The staff were friendly, the hotel clean and breakfast decent. Great base for exploring London as tube station few minutes walk up the road and the hotel was half the price of a hotel based in central London. Just a shame there aren't more parking spaces.", "Date": "February 21, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "yorkshire", "Title": "“fantastic!!!!!!”", "Author": "moondiva33", "ReviewID": "UR124950237", "Content": "everything about this hotel was excellent.... from the fantastic service, to the outstanding breakfast!! my family enjoyed a hassle free stay, and would highly recommend anybody looking to stay in london to stay here. we would def stay again, in a heartbeat. nothing was too much trouble, Nathan on the front desk was lovely and went out of his way to help on everything.", "Date": "February 21, 2012"}, {"Ratings": {"Service": "2", "Cleanliness": "4", "Overall": "3.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Burnham-on-Sea, United Kingdom", "Title": "“Comfy Rooms but avoid the restuarant!!!”", "Author": "Helen C", "ReviewID": "UR124752365", "Content": "The rooms were very comfortable although as a family of 5 we had to book 2 rooms (which were booked at the same time). Unfortunately they put us on 2 different floors which meant the kids had to go between the 2!! The kids meals in the restuarant were not good, especially the spag bol!! Service was very slow and the meals came with 15 minutes between the first 2 and the last 3. Not ideal when you want to eat as a family. The reception staff were very rude and the Duty manager was full of excuses about the poor food and the slow service. It was in a great location with the nearest tube station being a 5 minute walk.", "Date": "February 18, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Liverpool, United Kingdom", "Title": "“stronglt reccomend”", "Author": "john w", "ReviewID": "UR124708971", "Content": "hard to fault this as a destination people. Friendly staff, clean and comfortable rooms, decent breakfast. My missus was disappointed she wasn't staying at the Dorchester at first, but even she thought it was good. We were on a family trip to London for a couple of days. One nights stay with breakfast for 4 with parking and wi fi, less than £150? Good value i think. Tube station, district line just across the road", "Date": "February 17, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Plymouth, United Kingdom", "Title": "“Great hotel at reasonable price”", "Author": "burchybabes", "ReviewID": "UR124569930", "Content": "Helpful staff, friendly to kids, centrally located overall great place to stay for a short break.", "Date": "February 14, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Cheltenham, England, United Kingdom", "Title": "“Friendly welcome”", "Author": "Robert L", "ReviewID": "UR124515160", "Content": "Other trip adviser entries are correct. Don't be fooled by the old fashioned outwards appearance of the hotel - it is worth the mooney and the staff are extremely friendly", "Date": "February 13, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Guernsey, United Kingdom", "Title": "“One of the best”", "Author": "Neil F", "ReviewID": "UR124213776", "Content": "Travel to London 3-4 times a year. This is by far the best I have stayed in regardless of the price. Would recommend to anyone.", "Date": "February 6, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Maidstone, United Kingdom", "Title": "“Very friendly, attentive and helpful staff and very quiet and comfortable stay.”", "Author": "LynseyBrown", "ReviewID": "UR123957848", "Content": "I was very pleasently surprised with the high level of customer service, very tasty and well cooked food and quiet comfortable rooms I experienced during my stay at this hotel. Good value for money despite it's London position.", "Date": "February 1, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Location": "4", "Rooms": "5"}, "AuthorLocation": "Yorkshire, UK", "Title": "“Fantastic service”", "Author": "Taffy&Yorkie", "ReviewID": "UR123927041", "Content": "Hello, I'll keep this short as the hotel is a premier inn and yes it ticks all the usual premier inn standards, the hotel looks a bit run down externally but don't let that worry you, the rooms and hotel are fresh. The hotel is out of London so unless your using it like us for the apollo then it's a visit to the nearby tube station and a short journey into the capital. Harrods is only a few stops away. The thing that makes this hotel the best premier inn we have ever stopped in is the staff, there all friendly, professional and give you that bit extra customer care, they can't be faulted. The food, service and general atmosphere in this place is fantastic. I for one will be staying here again even though it's a it out of town it's worth the bit extra journey time, thanks P.I. Onee fault is the car park, basically there's the smallest car park with a dozen or so places, at fifteen quid it's pricey as well but if your like us and you have a young family then a car in the car park is just a bit of added help, get here early!!", "Date": "January 31, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "London", "Title": "“Great stay but sort the car park out”", "Author": "claytoncast", "ReviewID": "UR123591561", "Content": "You really can't beat Premier Inn for simple value and efficiency Although we live in South London, we stayed here for a night as we had work entailing an early start in West London. Big room, clean, good breakfast, and a great location just 2 min walk from the tube. As always the staff were very keen and helpful. Just a couple of points. You do sell yourselves as a business hotel during the week Premier Inn, so get it together and offer free Wi-Fi. It wouldn't cost you anything and if McDonald's can do it, I'm sure you can. Also need to sort out your car park charges at the one in Hammersmith. You have very limited parking and charge £15 for a 24-hour period. This is slightly ridiculous as nobody ever really stays in your hotels for 24 hours. What about charging £10 for up to 12 hours. Incidentally for anyone staying here, although the receptionist didn't know this, there is plenty of parking in the side streets which is free after 6 PM and doesn't start again the following morning until 9 AM so you got an early departure no need to give Premier Inn anything for their overpriced car park. In the main though, great stay. Thank you very much.", "Date": "January 25, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Location": "4", "Rooms": "3"}, "AuthorLocation": "Poland", "Title": "“Simple, clean and - for London - cheap”", "Author": "Scottso", "ReviewID": "UR123502754", "Content": "Good for business traveler, or family looking for no frills accomodation. 2 minutes to underground", "Date": "January 23, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Geneva, Switzerland", "Title": "“Does what it says on the \"packaging\".”", "Author": "DesertQueen07", "ReviewID": "UR123311153", "Content": "I stayed at this hotel for 2 nights in December. I needed a basic hotel in the Hammersmith area and this fit my location requirements and budget. First visit to Premier Inn. Efficient check in, friendly staff who explained that the car parking was first come, first serve even if I had paid for 2 nights parking. So they advised me to leave car in car park unless I needed it as they could not guarantee me a space the second night. No problem for me, so I left the car there. Nice of them to explain this as I was about to leave in the car, I then had the opportunity to change my mind without having lost the space. Rooms are basic but very good beds for a budget hotel. Small but have all you need. Very clean and as I was on 4th floor, no issue with street noise. Close to Hammersmith Broadway which has 4 tube lines. Safe to walk from tube to hotel after dark.", "Date": "January 19, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Dublin, Ireland", "Title": "“Hammersmith Premier Inn”", "Author": "N W", "ReviewID": "UR123196876", "Content": "Very friendly staff always willing to help. Booked a family room and we were given a double bed, a temporary bed and a mattress on the floor, I raised this with the desk and we got a second temporary bed pretty quickly. Would have preferred proper beds however but the room wasn't really big enough to accommodate. Overall however the stay was very good - would recommend", "Date": "January 17, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Edinburgh, United Kingdom", "Title": "“Excellent value for money”", "Author": "will_dick", "ReviewID": "UR122826826", "Content": "We stayed for 3 nights at the Hammersmith Premier Inn and can thoroughly recommend this hotel to others. It is very well situated and provides an excellent room with a very comfortable bed and a clean and functional bathroom. The staff were very kind and went out of their way to make us feel very much at home. We will use this hotel every time we visit London.", "Date": "January 9, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Oslo, Oslo, Norway", "Title": "“Great Hotel for a good price”", "Author": "Maris M", "ReviewID": "UR122803093", "Content": "Given the price level in an otherwise expensive city - London, PI Hammersmith provided excellent service and facilities for a reasonable price. Liked the view from my 10th floor room. The greatest asset of the hotel is perhaps the professionaal and friendly staff - who really 'go the extra mile' for the guests. Thanks a lot for that!", "Date": "January 9, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "3.0", "Value": "4", "Sleep Quality": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Rome, Italy", "Title": "“Expectations met”", "Author": "Alessandro T", "ReviewID": "UR122468513", "Content": "Accomodation, service and lunch were meeting our expectations. The balance between quality and price was right and we had a pleasant experience. The hotel is well located and it is easy to reach the very city centre in about half an hour by tube. It is a valuable solution for family and young travellers.", "Date": "January 3, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "3.0", "Value": "3", "Sleep Quality": "5", "Rooms": "3", "Location": "5"}, "AuthorLocation": "orivesi", "Title": "“graduation party”", "Author": "Kerttu K", "ReviewID": "UR122451059", "Content": "Everyhing OK. Location very good and we had a big room. though very windy on the 11th floor but the view was magnificent.", "Date": "January 3, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "3.0", "Value": "5", "Sleep Quality": "4", "Rooms": "3", "Location": "3"}, "AuthorLocation": "London, United Kingdom", "Title": "“Satisfactory.”", "Author": "CJ H", "ReviewID": "UR122203682", "Content": "Nothing special, but no complaints. Well, almost. I did book a table for dinner and on check-in was told that the restaurant was closed for the day (christmas day). I wasn't very impressed about that as they sent me a text CONFIRMING that my table had been reserved. But apart from that the quality of the accommodation was good, although the room was unusually small. Breakfast was good. Very good for a budget hotel.", "Date": "December 28, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Dublin, Ireland", "Title": "“Good for a short stay”", "Author": "UandB", "ReviewID": "UR121983305", "Content": "Very reasonable price, but probably the smallest hotel room I have ever stayed in. As we were only there for one night it was fine, as the bed was big and comfortable and the room very clean. Very close to a tube station and the High Street.", "Date": "December 22, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Dublin, Ireland", "Title": "“Great hotel, great service”", "Author": "niamhoreardon", "ReviewID": "UR121983132", "Content": "I stayed here with 3 others. We had two twin rooms that were small but very comfortable. We stayed for two nights and had breakfast on 1 morning in the hotel. The breakfast itself was delicious. The overall thing for me was the service. The staff that work at this hotel we excellent. They were very helpful on all notes from helping us out with directions etc, to helping you out in every aspect of our stay. I could not have a asked for any more from them, they are a credit to the hotel. All in all our stay was brilliant and I would highly recommend the hotel to anyone staying in London. It is close to 2 tube stations that will bring you into the centre of London, but the Hammersmith high street has nearly everything you need from shopping to eating. I would definitely stay here again.", "Date": "December 22, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Geneva, Switzerland", "Title": "“Service that will knock your socks off”", "Author": "CazzaJoe", "ReviewID": "UR121886162", "Content": "Whilst the outside doesn't look much the warm welcome inside more than makes up for it. The staff were professional but warm and friendly. The breakfast buffet was plentiful, hot and great quality and dinner was was simple but tasty. We had not stayed at a Premier Inn before and were pleasantly surprised. It was in a great location- a couple of minutes walk to a tube station very clean. The one thing missing...Lenny Henry", "Date": "December 19, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Location": "5", "Rooms": "3"}, "AuthorLocation": "Birmingham, United Kingdom", "Title": "“Great location - easy to get to and convenient to travel to city centre from here”", "Author": "mnd316", "ReviewID": "UR121827162", "Content": "Ok, so we chose this place because we had tickets to see Ed Byrne at the Hammersmith Apollo. We had never stayed here before - choosing to stay more in the city centre when visiting previously. I was really pleased that we drove here quickly, avoiding traffic and congestion charges. There is a small car park that you pay for extra to your room charge - get here early though because it is small. The room we had was clean but very small for a double. The windows were old but had excellent secondary glazing that meant the room was very quiet. We didn't eat here - the restaurant served the standard menu but was very small and the breakfast choice in particular looked limited. The main high street however has excellent range of cafes and pubs and restaurants. In particular we found a Wetherspoon pub where the beer and food were excellent. It is a great location - easy walking distance to the Apollo and only a few minutes to the nearest tube station which we used to access the whole of London. One tip here - get an Oyster card, it's so much easier than buying tickets each journey.", "Date": "December 17, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "1"}, "AuthorLocation": "Cannes, France", "Title": "“overpriced tat”", "Author": "apachenation", "ReviewID": "UR121704511", "Content": "the worst and overpriced hotel we have ever stayed in", "Date": "December 13, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Location": "4", "Rooms": "4"}, "AuthorLocation": "Kilkenny", "Title": "“Short but relaxing and enjoyable stay”", "Author": "KilkennyPiscean", "ReviewID": "UR121700101", "Content": "This hotel is a comfortable and safe budget option. I stayed with 2 teenagers and we were very comfortable. The breakfast is excellent - good selection and value for money. The room was bright and the bed very comfortable. It was quiet too.", "Date": "December 13, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Malta Europe", "Title": "“Joseph Delicata”", "Author": "Joseph D", "ReviewID": "UR121664861", "Content": "This was my second stay at the Premier Inn in Hammersmith, I spent a week last August while I was on a business trip and I enjoyed the stay so much that I chose this Hotel again this time for Christmas shopping with my wife. The hotel is situated in superb area: it is just across the road from Ravenscourt Park Station and situated in King Street in which you can find International Banks, Dry Cleaning Shops, High Class and Budget Restaurants, Car Rentals & Taxis Services Office, Cinema Halls, Bars and everything that you might need (even an ironmongery to by padlocks for my suitcases). The room and bath room were spotless. The room had coffee and tea making facilities, the bed had a comfortable mattress and smooth new bed sheets. Hand washing soap, shower gels and bright white towels are provided daily in the bathroom. However staff are probably the Hotel’s best asset they are remarkable Nice, Helpful and Great to talk to. They even allowed us to stay late at our room (till 6.00 pm instead of 12.00 pm) at a ridiculously minimum charge which we greatly appreciated. I strongly recommend this Hotel.", "Date": "December 12, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "2", "Location": "5"}, "AuthorLocation": "Qawra, Malta", "Title": "“Disaster!!”", "Author": "RFresh_31", "ReviewID": "UR121593485", "Content": "Cool name very bad standards!! In my case the hotel managed to make my yearly trip to UK and first ever trip with the whole family in UK a complete flop! I have pointed out issues concerning the hotel room on my second day of stay and nothing was rectified, also have specifically stressed another issue that have arise after my first complaint with another member of the staff, but again at no avail, on my check out I was asked if I had a pleasant and PREMIER stay, you can imagine my feed back at 3:00 am, the receptionist have excused him self on behalf of the hotel operation for the inconvenience caused and tried to handle the situation that was a disaster for 6 nights by ofering a refund for one night! can you just believe that! whatever!! I am disgusted with the way PREMIER INN have managed my situation and ruined my whole experience in UK! P.S last year have stayed in the same street in the Holiday Inn Express Hotel, I'm not saying that all was flawless but at least cleaning was 99%, food 90% total defenitly better then Premier INN or better OUT. Disappointment, disaster and catastrophe are small words to describe how upset I am.", "Date": "December 10, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Ludlow, England, United Kingdom", "Title": "“Good hotel for the London Marathon...”", "Author": "Jon B", "ReviewID": "UR121552817", "Content": "It's nowhere near the start line but the travel links from almost outside the hotel are very, very good - it's right by Ravenscourt Park tube station, but is also just five minutes walk from Hammersmith tube, and you can get anywhere in London from Hammersmith! Very nice staff, rooms were just what you would expect, only thing is the weekend prices are a bit high.", "Date": "December 9, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Glasgow, United Kingdom", "Title": "“Very satisfied with our stay at Premier Inn, Hammersmith”", "Author": "Orlabaj", "ReviewID": "UR121361773", "Content": "Travelled to London in October -two adults and two older teenagers. We had a budget in mind for a hotel and I spent hours on the internet looking at what was available. I finally chose the Premier Inn above a guest house. I am so glad that we did. Could not believe the size of the room that we had with fantastic huge windows. Hotel is spotlessly clean and the breakfast was fabulous but I would go early if you can as gets a little crowded near the end of breakfast time.The staff were lovely and so helpful particularly the staff who work in the bar/dining areas. The hotel is in a fairly good position also - a straight road to the nearest tube station. Fabulous - I would stay here again.", "Date": "December 3, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Lancashire", "Title": "“Great value for such great service”", "Author": "4evaLFC", "ReviewID": "UR121299026", "Content": "Stayed here the night of a football match with my daughter. I drove down and found the hotel very easy to find being just off the A4. We got the last parking space which we were chuffed about. Parking cost £15 for 24 hrs which is really good value for London and meant we could go shopping the next day without having to move the car. All the staff we encountered smiled in greeting, were smart and professionally dressed and were helpful in explaining anything we wanted to know. Whole place very clean and our room had a very comfy bed and extra pillows with a good view of the TV to watch football highlights on our return. Perfect. Makes a nice change that the mirror and plug socket were next to each other for ease of drying my hair. Location was spot on as only 3 minutes walk to the tube for going to the match and central London for shopping. Cafes and restaurants in immediate area and a Tesco Express 4 minute walk away. All you can eat buffet breakfast was lovely, really good selection, hot food was hot and fresh and continental choices on top looked fresh too. It cost £8.50 but my daughter ate for free being only 15 so represented great value. I would definitely stay here again.", "Date": "December 1, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Round Rock, Texas", "Title": "“Great option for London”", "Author": "MattandAmyG", "ReviewID": "UR121167267", "Content": "This is a great choice if you fly into Heathrow but want to hang out downtown without having to sell a kidney to do it. If you try to stay in or near downtown London, you'll either pay a fortune for a room, or you'll risk staying in a filthy and/or noisy dump. This hotel gives a nice balance. It is conveniently located about halfway between Heathrow and downtown and is about a two minute walk from a Tube station with easy access to the airport and to downtown (District Line). The staff was helpful and friendly. We arrived at about 1 a.m., and the woman at the front desk cheerfully welcomed us, and since we hadn't eaten anything that evening, she helped us order pizza at a reasonable price. The room wasn't fancy, but it was very good for the price. It was average-sized for Europe (meaning small compared with a U.S. hotel room), though the bathroom was somewhat large for Europe and surprisingly had counter space (rare for Europe). It had a comfortable bed (especially the duvet), had heating and air conditioning, had a HDTV, had a great view, and was immaculately clean. The few drawbacks - the cable TV had very limited options (in case you're one of the few people who travels to Europe to watch TV - we aren't), Wi-Fi was a little pricey (though it was faster than what I'm accustomed to in hotels), and the elevator doesn't go to the top floor. Accordingly, if you're on the top floor (which we were), then you have to take the elevator up and then climb a flight of stairs. Overall, these were minor drawbacks, and we would stay here again.", "Date": "November 28, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "1.0", "Value": "1", "Sleep Quality": "2", "Rooms": "1", "Location": "3"}, "AuthorLocation": "Belfast, United Kingdom", "Title": "“Premium price for very small old fashioned room”", "Author": "Eimeark13", "ReviewID": "UR121144600", "Content": "I have stayed at many premier Inns over the past few years and always been satisfied, but this time i paid a much higher rate (because it was London) but was very disappointed. I expected to at least have a decent size room with similar decor standards to that of other premier Inns - because of the price i paid. I did not think it was value for money at all, it felt claustrophobic.", "Date": "November 28, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Brighton, UK", "Title": "“Convenient and affordable comfort”", "Author": "geolon", "ReviewID": "UR121127171", "Content": "This would make an excellently affordable base for a trip to London. It's on the right side of London for Heathrow, has Tube stations in easy reach, a wide range of reasonable and ethnically diverse restaurants nearby and well as pubs, cafes and a large shopping centre several blocks west. It's situated in a very safe area, opposite an attractive park and near enough to the Thames for a pleasant walk along the riverfront. I got a ninth floor room with stunning views (unusual for a budget London hotel), and a spotless, compact but very pleasant room, that felt like a good deal for the money. The receptionist gave me a very nice welcome (I think she was called Mariana) and I felt confident that if I had any problems (I didn't) they would be effectively dealt with. I did not try the in-house catering as I was on my way to hospital and not allowed to eat!", "Date": "November 28, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Brighton, England, United Kingdom", "Title": "“Fabulous place to meet up”", "Author": "Linda A", "ReviewID": "UR120932345", "Content": "Had a great stay at this hotel recently. A few of us met up from all ends of the country and found it to be convenient and welcoming with a wide selection of pubs and restaurants nearby, as well as a nice bar at the Premier Inn itself. If you do stay, it's definitely worth having the breakfast, best one I've had in ages and a lot less than you normally pay.", "Date": "November 22, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Peterborough, United Kingdom", "Title": "“The staff in this Premier Inn were delightful!”", "Author": "Signalfixer123", "ReviewID": "UR120868874", "Content": "I recently had the opportunity of a night out in Hammersmith so I booked a room in the Hammersmith Premier Inn. I wasn't too sure what to expect, because when I got off the bus, the Premier Inn was towering high in the sky in the near distance. As I got closer, I could see that it was a very old building, possibly ex Council offices, so I climbed up the stairs and in to a seating area with trepidation. Down some stairs was the reception desk with what looked like two positions, both of which were manned and busy. To the left of reception was a small bar. Once it was my turn to check in, I was very pleasantly surpirsed at how friendly and professional my welcome was. Power to your elbow R.K, you explained everything to me as I would expect to hear it. You told me about the Good Night Guarantee, what time the breakfast was served and even introduced me to your colleague at reception. I was allocated a room on the 13th floor and here I have a word of caution. The lift only goes up to floor 12, so if you are old or have loads of luggage this is not the floor for you! Before I went out for the evening I decided to give the bar a try and on offer and available were Stella Artois and Carlsberg which equates to a 100% availability of lagers offered. What really surprised me was the price for a pint of Stella, where I was charged £3.20. Now this is 35p cheaper than another Premier Inn that I recently stayed in. I decided to have a couple more pints before I left and again, the barman was great. He was attentive and on top of his job. On my return, I had another couple of pints and again, the barman was good and at the end of his shift, he even took the time out to say goodnight to the three of us that were sat at the bar. Something that is sadly lacking in the majority of hotels. Unfortunately though, all was not well and I had the following issues which I discussed with the manager the next morning.I was allocated a room on the 13th floor and the room was the closest room to the lift machine room and all night long I listened to the drone of lift machinery. Also the room was cold, so I turned the air conditioning on by using the control on the wall that looked like it had come out of the Ark. Having said that, it was fit for purpose but when the air conditioning started its heating cycle it began to make noises like running water-a bit like sitting next to a fountain. So I turned the air conditioning off and resorted to turning on the convector heater that had been provided. This was not, unfortunately, enough to overcome the gale that was blowing under the door. Otherwise, although very dated the room was O.K. In the morning I ventured down to the ground floor for breakfast and was amazed at how small in proportion to the whole establishment the main eating area was. But again, if it was not for the efficient way the breakfast staff buzzed around, the room would have got clogged up. The staff kept on top of clearing the tables and did well at keeping the guests flowing through the small area. I want to point out before I write any more that I am not a freeloader looking for a free room but I felt compelled to speak to the duty manager about my experience in my room and straight away, without any hesitation I was offered a refund. I declined the refund on the basis that all I wanted to do was to point out the areas of my stay that didn't delight me. The guy wrote down my comments in a notebook that he got out of his pocket and I am confident that he will follow through on the assurances he gave me regarding addressing my issues. He did, however, offer to book me a taxi to Kings Cross station at the hotel's cost which I accepted. The guy that dealt with me was Ash and I would like to say thank you for the professional way you dealt with me. So take note, Premier Inn, here you have a hotel where the staff are a credit to you. It's just a pity that this model does not extend to some of your other hotels. I would most certainly stay here again, but not in that room!", "Date": "November 21, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Andover, United Kingdom", "Title": "“Good location”", "Author": "Mark B", "ReviewID": "UR120857247", "Content": "We booked this hotel because it was near Westfield Shopping Centre and the Ideal Home Xmas show at Earls Court. The nearest tube was only 300 metres away for easy access to London for site seeing. Just down the road is a great Vietnamese restaurant.", "Date": "November 21, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "3", "Sleep Quality": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Telford, England, United Kingdom", "Title": "“affordable trip to the capital”", "Author": "Joe M", "ReviewID": "UR120852842", "Content": "I booked the premier inn in hammersmith as part of a weekend in the capital for my girlfriends birthday. The location is great, 5 minute walk from ravencourt park tube station on the Piccadilly and District lines. The room was small, but nicely set up, comfy bed, tv, aircon etc. The Price including their full english breakfast was around £120, which I thought was a bit steep, but factor in the cost of parking in London then maybe its not so bad. Ill use it again most likely. Air con unit was a bit rattly and noisy, didnt effect a reasonable nights sleep though.", "Date": "November 21, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "brussels", "Title": "“Good Value for money given its London with excellent service”", "Author": "David H", "ReviewID": "UR120823896", "Content": "The staff at the Premier Inn seam to go out of there way to make you happy. Every person who works at this place is positive and works very hard to provide a good level of service. The hotel itself is what i would call up market budget, the rooms are fine. small but with king size bed's that are very comfortable indeed All the normal tea making facilities. The shampoo and hand wash is provided in a dispenser which is obviously functional of which i have no criticism as many budget hotels provide this but you should be aware if you like those little items bring them yourself. The rooms have carpeted floors, i don't personally like this however the rooms are clean and sound insulation very good indeed. If you get on high floors the views are great. Bathrooms are rather basic but functional. Location is super, easy to get to central london which is really a short walk to Ravenscourt Park underground on the District Line. Great selection of restaurants around the hotel and shops so in terms of location super. I travel from Brussels and take the Hammersmith and City Line to Hammersmith then i change to the district line. I tell you this because if you are travelling with bags this is a far easier journey than taking the Piccadilly Line which involves a considerable walk at Kings x. Since my first visit at the Premier Inn i have booked to stay several times and each time i have been totally satisfied. Well worth paying the small uplift to allow you to cancel your reservation or change it for those like me who are doing business.", "Date": "November 20, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Dublin, Ireland", "Title": "“My first stay at a Premier Inn”", "Author": "John J C", "ReviewID": "UR120594691", "Content": "Excellent place to stay. Very convenient location. Staff are very polite and helpful from time of arrival to date of departure. Would highly recommend to family and friends and will very likely stay there again.", "Date": "November 14, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "hove", "Title": "“really great”", "Author": "sara c", "ReviewID": "UR120590668", "Content": "We stayed for 2 nights at this hotel and found it very clean and the staff very friendly and helpful. I would definately stay again.", "Date": "November 14, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Norwich, United Kingdom", "Title": "“The best yet !!”", "Author": "nikksie", "ReviewID": "UR120587438", "Content": "Stayed here as it was close to Hammersmith Apollo for a concert. On arrival we were greeted by extremely friendly and helpful staff on reception, realising we where going to an event they offered to order a cab, very thoughtful. We decided to go by tube as the nearest station is nearby. Our room (108) was clean and comfortble and very quiet. We had a meal in the restaurant before we left and this was excellent. We both agreed that we had a great nights sleep. Had the full english option at breakfast and really enjoyed it, again friendly and helpful staff attending to us. We have stayed in Premiers all over the south of England and have to say this one was the best so far. We will definately stay in this hotel again and would have no hesitation recommending others to use it, well done.", "Date": "November 14, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Kfar Vradim", "Title": "“A touch out of the way but great hotel amazing staff”", "Author": "daveur", "ReviewID": "UR120570157", "Content": "While the hotel is not a great location for Excell exhibitions, it is close to a tube station and has great staff working", "Date": "November 14, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Kuwait City, Kuwait", "Title": "“Good budget hotel”", "Author": "23bubu", "ReviewID": "UR120501060", "Content": "Underground station only 5 minutes walking distance. Good clean rooms and bathrooms. Safe location, with multiple cchoices of eateries withn 1 km distance. Good sounproofing in the rooms. Pleasant and courteous staff, always helpful. Takes only 10-15 minutes to London central. Definitely will recommend it to friends.", "Date": "November 12, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Hook, United Kingdom", "Title": "“Excellent option for London access; washbasins for midgets?!?”", "Author": "Claire R", "ReviewID": "UR120237968", "Content": "We chose this Premier Inn so that we could visit London without having to catch the late train home. It's really conveniently located and great for a quick tube ride into town. Clean room, good parking and helpful staff. HOWEVER..... a little 'but', and a very strange one at that... The wash hand basins are teeny, the size you might expect in a caravan. This alone is not a deal-breaker, but there is a glass shelf mounted directly above the sink. This renders it completely useless for anything other than a quick hand wash. Washing your face is absolutely impossible without cracking your eyebrow on the edge of the shelf. Also, I note that some other reviewers rated the view, we missed out on this in room 101, so next time would ask for a higher floor. We will definitely stay here again, but take face wipes with us! These Premier Inns are far better appointed than Travel Lodges. A quick tip, skip the overpriced and very standard breakfast and nip down the road to the Hampshire Hog. Full English at £10 isn't cheap but is extremely good. Papers, a relaxed atmosphere, and fabulous wholesome choices. If we had been staying longer, we would have liked to go back here again for another meal.", "Date": "November 6, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "munich, germany", "Title": "“First stay but definitely not the last!”", "Author": "germanbeachgirl", "ReviewID": "UR120127667", "Content": "I tried this PremierInn for my short trip to London this time. Due to the good reviews, also about other PremierInns I always wanted to try one myself. It was everything I hoped for. An extraordinary friendly staff, you felt welcome the minute you walked in, all very safe (Lift only to operate with key card) and clean. Comfy beds and room size big enough. Another big plus is the perfect location of this property. It may not be the nicest PremierInn from the outside, but the surrounding area is quiet, clean and we felt safe at all times. Hammersmith Station is within walking distance, and if you don't feel like it, just take the bus in front of the hotel. You can even ride directly into Kensington high street without changing buses! There's a little 24/7 market across the street and a nice cafe next to it. The cab ride to LHR was only 28 Pounds so with 4 people in the car it was so worth it. No schlepping around the full suitcases. I recommended the hotel already and for me it was definitely not the last stay here. Thanks and see you soon....", "Date": "November 3, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Nottingham, United Kingdom", "Title": "“Great place to stay for a visit to London”", "Author": "Nottingham_Geyser", "ReviewID": "UR120081885", "Content": "This is not your run of the mill Premier Inn as it is located in a tower block of about 12 floors. Stayed in a family room with two adults and two children on the 9th floor. On arrival the children's beds were already made up (take note, Travelodge!) and the room and bathroom was spotlessly clean. There were great views over London which were even better at night when everything was lit up. The breakfast buffet was excellent and staff were unwaveringly friendly and courteous. The hotel is handy for Earl's Court and is only about 200 yards away from Ravenscourt Park station on the District Line, so access to public transport is very easy. Highly recommended and would have no hesitation in using this hotel again.", "Date": "November 2, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Glasgow, United Kingdom", "Title": "“great location very good staff.”", "Author": "bridget s", "ReviewID": "UR119750982", "Content": "we arrived in from gatwick around 12.15 at ravenscourt tube all in journey from airport to hotel via train/tube took 1hr 20mins.[ this incuded queueing for tickets at victoria ] hotel staff welcomed us and allowed us to leave luggage as it was too early for check in . this hotel is in great location for riverside studios-20 mins walk at your leisure . we met up with family for sat night and managed to book extra room at 4.30.fri. only available room was disabled 4th floor. staff were excellent cheerful and helpful. familyslept in 9th floor. w.e used 4th floor. the rooms were fine beds clean n comfortable used premier often quality budget hotel £82 for twin room £96 for disabled. sun night used 9th floor as family returned home views from 4th floor upwards. we dined in a fantastic italian restraunt -Capri- food was first class (Holcombe st. off king st.) look out for irish trad. musicians on sundays at HAMMERSMITH N RAM PUB on kings st. nice n relaxing. will go again.!", "Date": "October 26, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Worthing, United Kingdom", "Title": "“Excellent hotel, great location, cost effective stay”", "Author": "stuartmarler", "ReviewID": "UR119737824", "Content": "A great location hotel, very clean, comfortable, good facilities, great breakfast and quiet!", "Date": "October 26, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "asseret64", "Title": "“London made easy”", "Author": "asseret64", "ReviewID": "UR119638841", "Content": "Stayed in this hotel for 2 nights going to Hyde Park for concerts. The booking in was easy and luckily we managed to get a parking place. The room we had was on the 9th floor and it was great looked over the Thames could see the London Eye etc. The room was clean and very modern. Breakfast was lovely everything was available and it was all fresh and hot what else could you need. Staff very pleasant. Location for London was great tube or buses available from outside, Tesco down the road if you do forget anything.", "Date": "October 23, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Florence, Italy", "Title": "“Proprio quello che cercavo...Just what I was looking for...:-)”", "Author": "Stefy131267", "ReviewID": "UR119471178", "Content": "I stayed at the Premier Inn Hammersmith from the 13th to the 16th october for a long weekend. The hotel is very nice. We had a double bedroom at the 10th floor which is amazing because you have the whole view of London in front of you and a large window. The bedroom and the toilet were very clean even though there was the carpet as you can expect in every bedroom in London. The bedroom is not very very big, just appropriate to sleep and then leave early in the morning to walk and visit this fantastic city. It' s true that breakfast is not included in the price and that to have a full continental and english breakfast is 8.50 pounds more but it's worth because after that full breakfast you can probably skip your lunch. I didn't pay 29 pounds per nights as someone over there informed me that it can be if you reserve in advance of a few months, but I also know hotels in London are very expensive, unless you want to sleep in a very dirty place. Even though it is not in area 1 it is very close to the subway and in 15 minutes you get to Vicotria Station. The staff is fantastic, nice and kind. I remember Celso, his name on the badge, he was very very nice to prepare for us a \"grab and go \" breakfast the day of our departure since we left very early. I will return here, maybe a little bit cheaper for me it would be better, but I striclty recommend you.", "Date": "October 19, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "3", "Overall": "4.0", "Value": "3", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Dundee, United Kingdom", "Title": "“worth the money for the view alone”", "Author": "STEVEN C", "ReviewID": "UR119199948", "Content": "As premier inns go this was quite nice, i was on the 12th floor so i had an amazing view of the thames and the city, right next to ravenscourt park tube station so was great for access to the city", "Date": "October 11, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Glastonbury, UK", "Title": "“Good value, comfortable, good location”", "Author": "64rg", "ReviewID": "UR119183766", "Content": "We stayed here for one night for a concert at the Hammersmith Apollo (subsequently cancelled due to a burst water main!). From the point of arrival onwards the service was first class, all the staff were friendly and welcoming. Yes, the room was small as others have stated but the beds were extremely comfortable and it was very quiet. It was also scrupulously clean. We were on the eighth floor and had a great view across London which was a bonus! The shower was good, there seemed to be limitless hot water and the all you can eat breakfast was excellent. The hotel is a good 15 minute walk from Hammersmith tube, however it is literally 2 minutes from Ravenscourt Park. This was our first stay at a Premier Inn and I expected it to be similar in quality to a Travelodge. I can safely say it was significantly better in all areas!", "Date": "October 11, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "London, United Kingdom", "Title": "“A good place to stay”", "Author": "aesalem", "ReviewID": "UR118420709", "Content": "I stayed for 5 nights at King's Street, Hammersmith, London's Premier Inn. Although it was a little bit expensive viz £100/night, the WiFi was not free and you needed to buy a voucher, and the breakfast was not free as well, overall the staff was friendly and helpful, the room was well-maintained, and the beds were really comfy. I'd recommend it for a short-stay and for a couple at max. especially since the rooms are really small. On a scale from one to ten, I'd give it a 7-8/10", "Date": "September 21, 2011"}, {"Ratings": {"Location": "5", "Overall": "4.0", "Value": "4", "Service": "4", "Rooms": "4"}, "AuthorLocation": "Helsinki, Finland", "Title": "“Good location, breakfast, super comfortable beds”", "Author": "homiediel", "ReviewID": "UR118139206", "Content": "Room was pretty small, but clean. Breakfast was ok, but if you wanted bacon and eggs ect. you had to pay extra, which was pretty stupid I think. In our bathroom there was no shower drain, so you can imagine how the bathroom floor was filled with water everytime we showered. The location was better than I thought. Two subway stations are pretty near. There are shops and good restaurants and pubs also near by. Super comfortable bed. This hotel is better than avarege hotels in London.", "Date": "September 15, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "1", "Overall": "3.0", "Value": "2", "Service": "3"}, "AuthorLocation": "cardiff", "Title": "“Just Ok”", "Author": "CardiffBluebird77", "ReviewID": "UR117963352", "Content": "This hotel is in a really good location and & quick tube ride to the heart of London. There are great bars & restaurants nearby, plus you have the river just a 5 minutes walk away. The actual hotel is good inside, however the room are really small. I have stayed in about 8 premier inns & all had spacious rooms. However, our room was tiny & very humid. We finally discovered how to open the window & let some air in. The bathroom was also compact. There did give you a fan to have on, but this didn't help much. I would say this building was an old office block & I doubt that i would stay again, a shame really.", "Date": "September 12, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Malvern, United Kingdom", "Title": "“Good hotel in a good location - a bargain at £39/night for our family.”", "Author": "benb3342", "ReviewID": "UR117735838", "Content": "We stayed over the bank holiday weekend, and the room was nice and clean and the hotel very well run. We used the car park (£15 for 24hrs), and had breakfast each day. We also had dinner one night. Family room was great, a good size and clean and comfy. Hotel is a couple of minutes walk from the Ravenscourt Tube station, on the District Line, which took about 15 mins to get to Westminster. Ravenscourt Park is opposite, and good for the kids.", "Date": "September 6, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Oxford, United Kingdom", "Title": "“Highly recommended”", "Author": "Andy G", "ReviewID": "UR117632934", "Content": "Just spent 2 nights here with my family and really enjoyed the experience. The Inn is situated in a nice, quiet part of London and only a short walk from Ravenscourt tube station. The Hotel is very clean and modern and the room we had (508) was lovely. The room was plenty big enough, the kids had their own single beds, the main bed was large (2 singles together) and there was a TV, hairdryer, kettle etc. The staff were really friendly and helpful, optional breakfast was plentiful and very tasty and the bar functional. There is a Tesco express a few minutes walk away and a 24/7 convenience store across the road. I would recommend this Inn and very impressed with my first stay in a Premier Inn.", "Date": "September 3, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Grimsby, United Kingdom", "Title": "“Fantastic location for tube into London - quiet area.”", "Author": "MELISSA N", "ReviewID": "UR117489197", "Content": "Stayed for 2 nights at the Hammersmith Premier Inn with 4 adults & 1 child. Excellent location for tube station as 2 mins away. & only 20 mins into central London. Travelling by car from the North (Grimsby) & very easy to find. Lovely area with lots of restaurants etc but fairly quiet near the Hotel. Top floors have spectacular view across London, so worth asking for at reception. Very clean, polite staff & we were lucky to obtain a car parking space. Definately would come back here when visiting London.", "Date": "August 31, 2011"}, {"Ratings": {"Cleanliness": "2", "Sleep Quality": "2", "Overall": "3.0", "Value": "3", "Service": "2"}, "AuthorLocation": "Wellington", "Title": "“a stressful stay”", "Author": "Lynne030", "ReviewID": "UR117152368", "Content": "We have stayed in Premier Inns before and were disappointed with this experience. The room we were given , on the tenth floor, was not big and did not have a king size bed. The toilet had been used and not flushed or cleaned. Furthermore the air conditioning was not working properly. There was a fan provided by the hotel which was clunky when we tried to use it. We were staying there at the end of June when the weather was very hot. After a very hot night the reply from reception was that they would look into it. When we arrived back in the afternoon from with an evening engagement ahead of us nothing had been done. We were even told that the problem was because we should be leaving curtains closed at all times so that no sun should get in. After three visits to reception they admitted that our air conditioning was not functioning and they changed us to another room. By this time we were late for our next engagement and arrived there stressed. The second room was clean, a good size and everything functioned perfectly and we would have been very happy there at the start, which is why I have rated the hotel with three stars. I had difficulty complaining to Premier Inn as the website only worked if you provided a British postal code. In the end I just put in a British postal code instead of a NZ code. The hotel chain have now honoured their good night's sleep guarantee.", "Date": "August 23, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "4", "Overall": "4.0", "Value": "4", "Service": "4"}, "AuthorLocation": "Cardiff, United Kingdom", "Title": "“1st timers”", "Author": "Patricia1572", "ReviewID": "UR117149504", "Content": "The hotel was ideal for visiting the sites of london. The family room was adequate for 2 adults and a child and was very clean with good air con. Would definately stay again.", "Date": "August 23, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Leigh-on Sea, United Kingdom", "Title": "“Fabulous - first class service”", "Author": "joc_copy", "ReviewID": "UR117043358", "Content": "We booked a family room for two nights. Room was large, big bathroom and was spotless. Staff lovely and the place is immaculate. We ate in both nights - food was good and the breakfasts excellent value. Not bad at all for getting about London and it's in a lovely tranquil area. Thoroughly enjoyed out stay there - had a fab time seeing the sights and then collapsing in the comfort of this excellent hotel.", "Date": "August 21, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "4.0", "Value": "4", "Service": "5"}, "AuthorLocation": "Southampton, United Kingdom", "Title": "“Just what we needed”", "Author": "jaggles", "ReviewID": "UR117018911", "Content": "This hotel suited our needs perfectly. Very close to Ravenscourt tube station and access to all the sights. Close to heathrow. Secure parking with CCTV coverage at a reasonable cost. Room as you'd expect, clean with everything you need. Breakfast great with excellent service, good service from reception staff. Overall a happy stay.", "Date": "August 21, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "4.0", "Value": "4", "Service": "4"}, "AuthorLocation": "Glasgow, United Kingdom", "Title": "“Good location, excellent facilities, family friendly & good value for money.”", "Author": "Irene D", "ReviewID": "UR116813994", "Content": "I stayed at the Premier Inn in Hammersmith with my 2 children and was satisfied with the hotel. The accommodation was very good, clean and tidy room and large enough for a family of 4 with good bathroom facilities. The food was excellent and reasonably priced - the steak was to die for and cooked to perfection! Ideal location for getting around London with good selection of shops nearby and tube station a short walk away and regular bus services. Staff were very professional and friendly and in general the hotel is good value for money.", "Date": "August 16, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "4.0", "Value": "4", "Service": "5"}, "AuthorLocation": "Poole", "Title": "“Very happy with overall standard”", "Author": "PooleBesty", "ReviewID": "UR116767985", "Content": "We did get this room at a sale rate and so only paid £39 for it. But the family room was plenty large enough, very clean and comfortable. A good location for central London, and also Ravenscort tube station. We drove and they wanted to charge £15 for a very small car park, but if you arrive after 6pm parking restrictions in the nearby streets are suspended. We found a space quite easily. Nice park opposite the hotel to have a walk in. Staff were very friendly, and professional. Check in and out both quick and easy. Breakfast excellent, and good value if you have children as they eat free. Staff at breakfast deserve extra mention for being fast, friendly and keeping the breakfast items continually toppped up, which was not easy as it was busy. This hotel is also on the Heathrow flight path, but you could not hear anything.", "Date": "August 15, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "yeovil", "Title": "“Perfect for a short London break.”", "Author": "YeovilWuppy", "ReviewID": "UR116486345", "Content": "Brought the grandchildren here with my husband for a weekend break. The hotel was spotlessly clean, and our room was enormous, with a super king sized bed and two singles. The bathroom was bigger than anywhere we have stayed before. The breakfast was great value for money, especially as both of the children ate free! I would recommend this hotel to anyone seeking a value weekend. Although not in the centre of London the hotel was only a few minutes from Ravenscourt Park Station, on the District Line and buses passed by the hotel too. The children thought it was great and especially enjoyed Ravenscourt Park just across the road. The staff were both courteous and helpful and were fantastic with the children. The only critisism I have is that perhaps a bell could be installed in the reception area when it is unmanned as we had to wait some minutes for someone to deal with us when it was time to check out. In all aspects a thoroughly enjoyable stay. Congratulations to all of the staff!!", "Date": "August 9, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "1.0", "Value": "2", "Service": "1"}, "AuthorLocation": "Hartlepool, United Kingdom", "Title": "“Disappointment”", "Author": "PaulFincken1972", "ReviewID": "UR116397231", "Content": "I have stayed in many premier inns around the country and have always had excellent service and experiences. Therefore when I was visiting Twickenham I immediately booked a premier inn near the ground. The hotel appeared in good shape and actually thought from appearance in reception and the room it was probably the best we had stayed in. However, I found the service quite disappointing. We booked a meal for 8pm. We arrived early after coming back from Twickenham and got to the restaurant at 7.45pm. We ordered about 5 minutes later. From where we were sat we could see the meals at the serving hatch. The first meal was placed on the tray, but did not arrive at the table for approx 5 minutes along with two of the other meals. The fourth meal came 5 minutes after this. Whilst we were eating, the waitress started taking plates away while others were still eating - poor etiquette. Next morning, housekeeping tried to clean the rooms at 8.30am while we were still preparing to go for breakfast. Considering check out time is 12, very annoying. Again at breakfast, plates were taken from our table while people were still eating. Overall a disappointing experience after a good weekend of visiting Twickenham to see England v Wales. We use the hotels regular. I am rugby referee and travel around the country and book a premier in the city nearest to where I am. I have also used Beckton in London for visits to the West End. I now expect a high standard from the Premier Inn when I stay based on the experiences so far......however this has changed my perception and hope this is not experienced again.", "Date": "August 7, 2011"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Madrid, Spain", "Title": "“It was lucky to find this nice hotel.”", "Author": "antomol", "ReviewID": "UR115963000", "Content": "This was my first contact with Premier Inn hotels. Very positive experience. :-)", "Date": "July 29, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "3", "Overall": "3.0", "Value": "3", "Service": "3"}, "AuthorLocation": "Coventry", "Title": "“Standard for a Premier inn - but loud kids”", "Author": "alwyn1", "ReviewID": "UR115870269", "Content": "I have stayed at this hotel a number of times. The rooms are clean and what you would expect from a budget hotel. They have recently been upgrading and decorating rooms and have not yet finished. The double rooms are quite spacious with king sized bed and bath with shower over it. If you are looking for a single room, expect a very small room with a three quarter sized bed and shower cubicle that is so tiny that you can hardly turn around in it, and I'm not a large person . This hotel caters for large groups of young foreign students visiting London. They can be very loud in the restaurant in the morning and in the evening with very little supervision from their teachers or the Premier Inn staff who seem oblivious to the noise or the comfort of other hotel guests. They can also be a problem running up and down corridors late at night and shouting at the top of their voice. The sevice in the restaurant is normally OK with friendly staff, but I along with a few others did walk out on one occasion in the evening after waiting 45 minutes without even being asked if I required a drink! Some others had been in there an hour and had only had their starters. There is a small car park at the rear with a few spaces at the front for disabled parking. There is a charge for parking, so check the price before you book. It's about a 10-15 minute walk to Hammersmith underground station.", "Date": "July 27, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "", "Title": "“Convenient to Ravenscourt station and very friendly service.”", "Author": "tishusa", "ReviewID": "UR115756998", "Content": "very nice,excellent breakfast and helpful staff.moved me to a larger room because ofa problem with the toilet. Was glad to be in a double because the single would have been very cramped.", "Date": "July 25, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "3", "Overall": "4.0", "Value": "4", "Service": "5"}, "AuthorLocation": "Bath, United Kingdom", "Title": "“Good for central London and Earls Court”", "Author": "Tom_G_47", "ReviewID": "UR115718208", "Content": "Overall a good stay, especially enjoyed the breakfasts. Room very clean and recently refurbished. Do bare in mind though that it is an old building and as such the standard rooms are tiny in comparison with newer Premier inns. The rooms did get very hot and the air conditioning needs upgrading - quite noisy and less effective than an asthmatic ant with some heavy shopping. It seems a shame to have to keep the curtains closed all day to stop the room turning into a green house (we were on the 10th floor and had a super view). Thanks for a great stay!", "Date": "July 24, 2011"}, {"Ratings": {"Cleanliness": "3", "Sleep Quality": "4", "Overall": "3.0", "Value": "2", "Service": "5"}, "AuthorLocation": "Erlangen, Germany", "Title": "“Ok, but just for a weekend”", "Author": "rabumbl", "ReviewID": "UR115413281", "Content": "Stayed at the Premier Inn with friends the first time. Price, stars and location persuaded us to pick this hotel. In general, we have not been disappointed. Ok, but just for a weekend. Location is fantastic, right next to the River Thames, lots of original pubs and breweries. And even the Hammersmith tube station is not far away (10 - 15 minutes on foot ). Room cleanness overall was acceptable for a 3 star hotel. Room was very tight, too tight, but for two days still ok. The bathroom looked newly tiled. Standard bath furniture, everything unbroken and clean. However, being 6.1 ft tall, it took some time to get a shower, anything but enjoyable: shower head not adjustable in height, so that I had to uncomfortably bend over while hair washing. Ceiling height was much too low, made me feel a bit under pressure. Bed was too short for regular European people caused mainly by an overhanging part of the wall at the head of the bed leaving just a few inches of head room. Fortunately, the bed could be easily pulled forward. Matressee was rather comfortable compared with all the other hotel matressees I can remember of. Carpet has already lived its live. Since a nice carpet deals as a sort of highlight of a room, in terms of customers' satisfaction I think a new one would really pay off. TV was fantastic. Big flat screen with a perfectly clear picture. Plus point. Windows' quality was a bit disappointing. Old glas, broken and ugly looking window frames. Durty little chamber in front of the window. The view, however, towards the London skyline (from the 11 th floor or so) is breathtaking. Never seen anything comparable. This view has risen my overall rating. The 12th floor too kept most noise to a minimum yet there is lots of traffic all around the hotel and clock. Receptionists and all the other staff were very kind and forthcoming. Breakfast was ok, the usual. The price, well, compared with similar hotels and locations in London, I must say, it is slightly unappropriate. 15 pounds cheaper and breakfast included would fit the bill.", "Date": "July 16, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "4", "Service": "5"}, "AuthorLocation": "Derby, UK", "Title": "“Excellent”", "Author": "runray2000", "ReviewID": "UR115246235", "Content": "Just returned from a 2 night stay at the Premier Inn at Hammersmith, and felt that it was only fair to give a review. In terms of location for Central London, it was easily accessible by the tube despite engineering works over the weekend. We had an easy check in, and on the day we decided to have breakfast we received an excellent personal service which is so rare at a hotel which is part of a chain, as well as the food being of a good standard. Our room was quite small, but that is only to expected in London, and the view from the 12th floor over the city was great. The room was also clean, and I slept well on both nights. There are also many amenities nearby in the local area, such as a supermarket, pubs and restaurants!! Thank you for your excellent service, and I will certainly consider staying here again when in London!!", "Date": "July 11, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "4.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Pottstown, Pennsylvania", "Title": "“Great Location for London”", "Author": "R-RYD", "ReviewID": "UR115171846", "Content": "My wife and I stayed here for 6 nights, arrived a couple hours before check in and was given a room right away. The staff was always very helpful and friendly. We had an 11th floor room with a great view of the surrounding area. Breakfast was very good as were the couple dinners we ate here. There are plenty of restaurants within a short walking distance, a 24 HR market right across the street and Ravenscourt Tube (zone2) was less than a 5 minute walk. The location and reasonable price really makes it a great base for exploring London and we wouldn't hesitate to stay here again.", "Date": "July 8, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "4", "Service": "5"}, "AuthorLocation": "Riyadh, Saudi Arabia", "Title": "“Enjoyed our stay and will definitely recommend it and stay again there”", "Author": "shz333", "ReviewID": "UR114997707", "Content": "Very quiet, peaceful area. Near to tube station (2 min walk), bus stop just outside hotel. Lies in Zone 2. A lot of Indian & Halal meat serving restaurants nearby. Breathtaking city views, specially river Thames, if you are staying at higher floors. Excellent breakfast. Value for money. Book well in advance to get a good rate.", "Date": "July 3, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Falkirk", "Title": "“Excellent stay - will definitely use again”", "Author": "IainFlemingFalkirk", "ReviewID": "UR114866889", "Content": "I stayed here as part of an overnight Theatre trip. I initially tried to book the Premier Inn Victoria, which is just around the corner from the theatre, but it was fully booked. This was a very good alternative, although it did involve travel on the Tube. The hgotel is just a couple of minutes walk from Ravenscourt Park(District line) and the room was excellent. Air Conditioning and an extra fan - this was the hottest and muggiest day of the year - were much appreciated and ensured we had a comfortable night. The views from the 12th floor were excellent and the bed was exceptionally comfortable. Service and food in the restaurant were also very good indeed and good value for money.", "Date": "June 29, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Location": "4", "Rooms": "4"}, "AuthorLocation": "UK", "Title": "“Nice clean rooms”", "Author": "cparkyuk", "ReviewID": "UR114653642", "Content": "Just stayed two nights, room was nice and clean, good double glazing couldn't hear any traffic. Ravenspark tube station is just 2 minutes away. Didn't eat in the hotel went to a little Italian next door which filled us up. Nice comfy bed and fluffy pillows, looks like some of the rooms are being refurbished, we didn't hear any noise though. Overall a good stay.", "Date": "June 22, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Wales", "Title": "“Much improved Hotel”", "Author": "myopinionWales", "ReviewID": "UR114154377", "Content": "We stayed at this hotel just after Christmas 2010 and I wrote in my review at the time that we had been disappointed at various problems with the room and service. We stayed again on Whitsun Bank Holiday as we were in London for Swansea's football play off final at Wembley, and it was a much improved experience. We had two nicely refurbished rooms for the family with good views across London. The staff were friendly and helpful, for instance when we asked for more teabags and milk in the room. We didn't eat at the hotel in the evening, but again enjoyed the Indian Zing restaurant almost opposite. It's the best Indian restaurant I have tried, and several of our fellow guests felt the same. We had the full breakfast in the morning and our young daughter could eat free. It was good and plentiful and set us up well for the day. We could leave our car in the hotel car park all day and picked it up after the match. Hammersmith is a pleasant area to stay, and the hotel was handy for the M4 and underground links. We reached Wembley easily and quickly even though it is the other side of the city. It was a good stay, and even more importantly Swansea won the final!", "Date": "June 18, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "4.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Leicester, UK", "Title": "“Perfect base to stay”", "Author": "TheDoctorG", "ReviewID": "UR112936493", "Content": "This hotel was a very good base to see friends around Chiswick, Hammersmith & Richmond. Easy access via tube & bus and it proved a good option for the low price. Rooms were clean but small, however the views from ours were rather impressive across a good chunk of London. Staff were all friendly, especially and surprisingly at breakfast and were helpful, especially when I needed guidance for bus, etc. Breakfast was very nice, proper english (sadly no black pudding!) but filled me up nicely until lunch. Would recommend this hotel.", "Date": "June 12, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "4", "Service": "5"}, "AuthorLocation": "Keighley, United Kingdom", "Title": "“The perfect hotel for a weekend in London!”", "Author": "Timmy1986", "ReviewID": "UR111755202", "Content": "Having never stayed at a Premier Inn before, I was a little nervous as I booked the hotel as part of a West End Theatre break. I needn't have been nervous. It was a wonderful place to stay. Greeted by a giant Purple tower block, me and my girlfriend walked into the reception and were instantly greeted by a smile by the friendly reception staff. There was a slight delay with checking us in as we had booked via a thrid party group but it was quickly resolved and were given a room on the 11th floor which had stunning views over London. Highly recommend getting a room on a higher floor for this reason. The room was a great size for a London hotel, it was clean, very comfortable with a lovely bath/shower room also very clean and well kept. Also had a small LCD freeview TV and a lovely letter from the general manager offering extra sheets instead of duvets because of the hot weather (as well as air con and available fans). There was no noise from other rooms and if you have the window open you will get some noise, but with it being on the outskirts of London its far, far less than normal. It was a perfect room for us, we couldnt have been happier. We had continental breakfast on the first day which was a great selection of cereals, pastries, yoghurts, fruits and toast, with plenty of hot and cold drinks all constantly topped up. The staff were very friendly and explained where everything was. We paid for an upgrade to a full English breakfast plus continental if we wanted and that was also lovely. Freshly cooked breakfast which was very tasty. We didnt have dinner or lunch there so cant comment on that, but the small but inviting dinner area was nice and the food set us both up for our sightseeing days. Ravenscourt Park tube station is just a couple of minutes walk away and is ideal for getting to the sights of London without being stuck in the middle of busy central London. The Hammersmith/Ravenscourt Park area is perfect to escape too after the noise and hustle and bustle of London. Overall there is nothing to fault about this hotel and we will most certainly stay there again!", "Date": "June 6, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "5", "Overall": "4.0", "Value": "4", "Service": "4"}, "AuthorLocation": "Victoria BC", "Title": "“Fit the bill”", "Author": "polarbearcub", "ReviewID": "UR111083085", "Content": "I booked this hotel because of location and because they have a ramp to enter. Also the reviews seemed promising and the price was okay. It was all of those things. I did miss free wi-fi, but also did get online from my room, mostly in the night; otherwise the signals were too poor. The room was small, but that was a fair trade off. I tried to use the TV, but there was some extra arrangement with a switch that I didn't find out about until late in my visit. I never did turn it on. It's not a fancy hotel, but it seems to check all the right boxes for me. Never did eat there. There's a lot of restaurants and shopping nearby. When I needed help, reception was friendly and helpful.", "Date": "June 2, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Cardiff, United Kingdom", "Title": "“We love this hotel and we'll definitely be back”", "Author": "kipper48", "ReviewID": "UR110887057", "Content": "The staff here are very helpful and nothing seems to be too much trouble. Breakfast was exceptionally good value with an excellent choice to suit everyone, including vegetarians - and children eat free!! It's near a tube station so a great base for whatever you want to do in London.", "Date": "June 1, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Lancaster", "Title": "“Friendliest hotel I have ever stayed in London!”", "Author": "CathDids", "ReviewID": "UR110772579", "Content": "I have been used to impersonal and unfriendly service in London hotels, even in 4* ones, so I was pleasantly surprised to arrive to such lovely, friendly and helpful staff. I was visiting London with my 3 daughters, aged 7 to 11, having left my husband and son to do their own thing at home. They made our stay as easy and comfortable as possible, were lovely when my 9 year old dropped her orange juice over the breakfast table and chair and really, nothing was too much trouble for them. I was delighted to be able to leave our bags with them on the last day after check out instead of lugging it all to left luggage at Euston station. I will definitely use this hotel again: it was clean, comfortable and the rooms were spacious. The breakfast was lovely too, and really set us up for the day. 11/10!", "Date": "May 31, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "3.0", "Value": "1", "Sleep Quality": "4", "Rooms": "5", "Location": "2"}, "AuthorLocation": "Midlands", "Title": "“Enjoyable stay overall”", "Author": "PreacherKane", "ReviewID": "UR110704369", "Content": "Check-in was very good; all information was provided for me and the ladies on the front desk demonstrated good local knowledge of bus and train routes, furnishing me with maps and directions accordingly - professional and efficient service. The nearest tube is Ravenscourt Park (a minute over the road then next left) but the walk down to Hammersmith tube (for Hammersmith/City plus Circle lines) was only 10 mins straight down the main road. The lift and stairs both use the room keycard for entry, although the doorlock on the stairs wasn't mounted correctly and handle obstruction meant I never got my card to work in it. There are a small number of car parking spaces at the front and a larger car park around the back; whilst it's not free (I think I was quoted £15/night) the barrier does offer some level of protection. Room was clean and functional and tidied every day without fail. One of the secondary-glazed windows had come off its runner and was difficult to slide but the windows kept most noise to a minimum and the aircon/heating kept the room at a suitable temperature. Most noise I encountered was from neighbouring rooms; nonetheless I had a good kip for all nights. As with most Premier Inns, internet access isn't free. There are a number of pubs along the road offering free wireless so dropping into one of those enroute back to the hotel was enough to touch base with work. The closest is actually the pub next door - just be warned they don't do meals else I'd have spent the whole evening in there. Meals most nights weren't bad; very attentative service on first few nights but when it got busy on the forth night there was quite a wait for my meal (30 mins) and on several occasions I spotted the waiting staff almost searching around for the right table to deliver a held meal - I suspect table numbers weren't captured as part of the order somehow (the waitress had to revisit my table to enquire what I'd ordered). The numbers of staff were insufficient for the number of patrons that night; on several occasions I saw meals left waiting on the counter as though bar/resturant staff were unaware of their presence. On that particular night, I declined a pudding (wasn't prepared to wait another half-hour for its delivery) - this was the only sour note during my week-long stay there (costing me over £600 for 5 nights)", "Date": "May 31, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Location": "4", "Rooms": "4"}, "AuthorLocation": "Nottingham, United Kingdom", "Title": "“great base for Chelsea flower show”", "Author": "Skybeck", "ReviewID": "UR110405573", "Content": "great base for Chelsea Flower show. Cleanroom, very helpful and friendly staff. great shower cant knock it!", "Date": "May 29, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "2", "Sleep Quality": "4", "Rooms": "2", "Location": "4"}, "AuthorLocation": "Redditch, United Kingdom", "Title": "“Friendly staff”", "Author": "MrTR4", "ReviewID": "UR110055413", "Content": "Typical Premier Inn quality, but not the usual good value (about £130 per night). Staff were very friendly and appeared to be genuinely so, quite unusual for modern hotels. The room was small for a double, and the bath was the smallest I have ever seen; about 4 feet long. However, room was clean and appropriately furnished and fitted. I arrived about 9 pm, and there were only a couple of places in the car park - I get the feeling that parking may be a problem if you arrive late. Food at breakfast was good quality, but i ended up sitting next to a guy who was coughing and sniffing - reminded me why I usually avoid breakfast on business trips. Overall I was pleased and surprised at how comfortable a stay i had at what is a budget, busy, city hotel.", "Date": "May 27, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Ilminster, United Kingdom", "Title": "“Excellent hotel, great location great staff”", "Author": "morgan45", "ReviewID": "UR109600376", "Content": "This hotel is brilliant for Central London. It is easy to get around, good parking. Staff were first class and room was at back, quiet and well ventilated", "Date": "May 24, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Chichester, United Kingdom", "Title": "“Great, would definately stay again.”", "Author": "posh_rob59", "ReviewID": "UR107425881", "Content": "Chose this hotel primarily for its location for business, which was perfect, also 5minute walk from tube station. Staff were extremely friendly and helpful, room was clean, very comfortable and quiet, only slight noise from nearby lift but not intrusive at all. Would stay here again without hesitation.", "Date": "May 8, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Swansea, United Kingdom", "Title": "“Great Location, great weekend.”", "Author": "Clairebear68", "ReviewID": "UR105721400", "Content": "Booked a weekend break via the internet, and hadn't stayed at a Premier inn before or in the Hammersmith area. Were lucky to get a parking space behind the hotel which was £15 per 24 hours. Staff were friendly and helpful, room was clean and had air conditioning which was needed as temp. was 27 degrees outside! Location was ideal, tube station was just around the corner and King St. had plenty of shops and restaurants nearby and the lovely Ravenscourt park was opposite. Overall a nice hotel in a good location, would definatly stay there again.", "Date": "April 27, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Huddersfield, United Kingdom", "Title": "“Would use again for London visits”", "Author": "CalliopeFrabane", "ReviewID": "UR105676282", "Content": "visited for 1 night with my company to see a concert at Apollo. The hotel was only 15 minute walk from the venue, and very accessible from the Overground network. Rooms were neat and clean, with everything I expect from Premier Inns. Fantastic views of City of London from my 9th floor room. Breakfast was good, quality and range. The Ice-cream vending machine in the lobby was a source of much amusement at midnight when we fancied a feast after the concert (to be recommended) My only criticism would be, the delivery truck that arrived at 5;30 in the morning should switch its engine off, the sound carries up the build at that time in the morning, to the extent I was woken and had to get up to close the window.", "Date": "April 26, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "3", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Cardiff, United Kingdom", "Title": "“Fabulous staff, great position for Central London”", "Author": "Cardiffdreamer", "ReviewID": "UR105574257", "Content": "We chose this hotel because of it's proximity to Central London but it was also outside the congestion zone and offered car parking facilities. Great access from the M4 Eastbound. The family room was perfect for our needs with two daughters aged 13 and 9. There was enough space to move around. The bathroom was clean and spacious. The shower curtain could have been slightly wider! Breakfasts were superb although Easter Saturday was the busiest so a few things were running low. Staff however were replenishing stocks as fast as they could. My 9 year-old's highlights of the whole four days were the Premier Inn breakfasts. The staff were friendly and welcoming and nothing was too much trouble. Our room was on the ninth floor and the views were amazing. The area we stayed in had some wonderful restaurants including an Italian next door and the most amazing Indian five minutes walk away. There was a couple of minutes walk to the closest tube station (Ravenscourt Park) which was on the District line and took you through most of the tourist spots of London. Hammersmith was the next stop where you could change to different tube lines.", "Date": "April 26, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "lichfield", "Title": "“A very welcoming place to stay !”", "Author": "davidcassidy19", "ReviewID": "UR104817449", "Content": "My husband and I recently stayed at this Premier Inn as we came to an event at the Hammersmith Apollo. We were made to feel very welcome by the staff and the room that we had was very clean,modern and comfortable. The evening meal and Premier breakfast that we had was a very good deal - £22 per person and for that you got a 3 course meal and a drink and as much breakfast as you could eat ! Food was lovely,staff were lovely and a very nice experience was had by both !", "Date": "April 20, 2011"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Overall": "2.0", "Value": "2", "Location": "3", "Rooms": "3"}, "AuthorLocation": "york", "Title": "“Don't eat here at all!!”", "Author": "lksimpson2008", "ReviewID": "UR103412427", "Content": "Came with my family for my birthday checked in staff on reception were friendly and helpful so no complaints about them Came back from sightseeing and wanted to eat so headed to tje restaurant at 1910 reception did say there was a party of 18 due in 1930 so come before which we duly did Size of the restaurant was tiny in comparison to the size of the hotel. Anyway we ordered food at 1920 and this party came in. About 1945 we still had no food and a manager started bringing out burgers for this group. We still had no food. At 2000 we still had no food and only my little boys spag Bol came out which wasn't warm. At this point I was starting to get rather annoyed. I did bet my husband £10 that his steak would come out wrong. I was right so I lost it and told them that we were going next door and that they had ruined my birthday evening!! The two useless chefs in the kitchen were laughing in the kitchen and I nearly went and said something but raised blood pressure is not good when you are pregnant! Saving grace was a fabulous small Italian right next door to the hotel. Lovely people running it and food was delicious. The amount of people that had the same experience as was conveyed by the owner So in short for god sake don't eat here eat elsewhere", "Date": "April 9, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Truro, United Kingdom", "Title": "“This is the hotel I will return to for our next visit to London”", "Author": "JudyBanks", "ReviewID": "UR102404848", "Content": "The staff were extremely helpful and friendly and nothing was too much trouble for them. They even helped us to find our way to the nearest tube station to the centre of London when we got lost! The rooms were clean and comfortable and excellent value for the price. The location is excellent for getting to and from the city centre either by tube or taxi.", "Date": "April 1, 2011"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Bedford, United Kingdom", "Title": "“Friendly clean hotel”", "Author": "lemondropr", "ReviewID": "UR102147372", "Content": "We found this hotel to be clean spacious and very friendly. The staff made us feel like V.I.P's even ordering our Take away for us when we got back to the hotel very late. The rooms are spotless and the beds were comfortable and warm. We would recommend this hotel to any one", "Date": "March 30, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "London", "Title": "“Friendly whilst busy...”", "Author": "mortadela", "ReviewID": "UR100600536", "Content": "Nice staff... a smile really does make a difference", "Date": "March 18, 2011"}, {"Ratings": {"Service": "2", "Cleanliness": "4", "Overall": "3.0", "Value": "2", "Sleep Quality": "2", "Rooms": "2", "Location": "4"}, "AuthorLocation": "Wales", "Title": "“Disappointing for a Premier Inn”", "Author": "myopinionWales", "ReviewID": "UR99746721", "Content": "I generally find Premier Inns to be good value with very competent service. This hotel was a disappointment. It had fairly recently been taken over by Premier Inn and needs a lot of investment. We took two rooms. One on the second floor was nicely refurbished, but the second room on one of the higher floors was draughty, some of the bathroom fittings were damaged, and it was cramped. The view however was great, We reported several issues to staff who seemed indiferrent, which is unusual for a Premier Inn. Breakfast was chaotic. Not enough staff or food laid out or space. Again, this is unusual for a Prmeier Inn. By the way, I have noticed in my last few stays at a Premier Inn that the buffet breakfast (one of their pluses) doesnt represent such good value - price has gone up, selection has gone down. On the plus side, the hotel was very well placed for the M4 and west London (we were in London for a football match at QPR, museum visit, and a theatre show) and had good parking. The trip was part of a Christmas present , and we went for a family meal at an Indian Restaurant opposite the hotel, called Indian Zing. This must be the best Indian meal I have ever had and would definitely recommend it. I would stay again, but in the hope that the hotel had improved to meet my usual expectations of a Premier Inn - and for a return visit to Indian Zing!", "Date": "March 11, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Paignton", "Title": "“Great location at reasonable price”", "Author": "clairenadine", "ReviewID": "UR97581647", "Content": "Stayed for one night for a London sightseeing tour with our 8 year old son and my partner. Parking our car for £15 for 24 hrs was a great price in a secure location, although I would like to have booked my parking space prior to our arrival as there are only 20 spaces but as it happens we got a space no problem. We spent our day in London and arrived back at the hotel at approx 7 pm. Our room was very fresh and clean as was the bathroom, no noise from the traffic or other guests, our room was out the back so this may have helped (room 206). We had our evening meal in the small but cosy restaurant which was not a great success as the chef was new and not really up to speed. On our departure the reception team did ask if there were any problems which we did say with regards to the evening meal and the problems we encountered, they immediately rectified the problem with sincere apologies and a refund on the food. Ash and Maryan were on the reception on day of departure and were brilliant as were the two ladies the previous evening who were running reception, bar, restaurant and the cooking and all with great big smiles. Thoroughly enjoyed our stay and would definitely recommend this Premier Inn. Thank you.", "Date": "February 22, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Ipswich, United Kingdom", "Title": "“Great hotel - ideal for a city break! Highly recommended”", "Author": "camuk33", "ReviewID": "UR95926118", "Content": "We stayed at this excellent hotel last weekend which proved to be a fantastic spot for a short break in London. There was a minor, initial problem at check in (the room card wouldn't work - but that was quickly rectified by the helpful staff on Reception). The hotel is located close to Hammersmith Station (about a 10 min walk - you can't miss the imposing hotel - which has about 12 floors!) and Ravenscourt Station (around a 3 min walk), so it was very easy to get to. The room was spotlessly clean, well maintained and the bed was very comfortable and provided us with two nights' good sleep! The hotel staff were faultless - all of them were cheerful and made the point of saying \"good morning\" at breakfast, which added to the general friendliness of this hotel. Breakfast was well organised, and we opted for the continental option - and food was plentiful, with loads of fresh fruit, yogurts, croissants, cereal etc on offer. It as handy being able to go from breakfast anytime from 7.30am to 11.00am. Check out time was generous too, being at 12pm. I'd highly recommend this hotel for a short break in the city - Hammersmith is a great base, if you want somewhere a bit quieter to go in the evening after the hustle and bustle of Central London! Plus this hotel was far cheaper than any other equivalent, when we booked - so provided excellent value for money.", "Date": "February 8, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "3", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Cirencester, United Kingdom", "Title": "“warm welcome but cold everywhere else!”", "Author": "horseymum", "ReviewID": "UR90164014", "Content": "We stayed at this Premier Inn to attend Olympia Horse Show. The location was good, because it proved to be only a 25 minute walk to Olympia, so no need to rely on public transport or a taxi. Parked the car on site which was good (£15) had an evening meal which was fine, although the dining room was on the chilly side (we heard other diners complaining also.) Stairwells were cold and our room was too - should have complained but CBA -we were only staying the one night, jumpers and socks in bed did the trick. Our room was immediately above the AC unit which was rather noisy and there was some minor noise later in the night from the car park, but nothing that caused us to lose sleep. Breakfast was decent, although no condiments (and no veggie sausages, presume these had to be ordered) very busy in the dining room (and overheard, again, complaints about cold rooms, so not just our problem then!) Temperatures -3 or so outside, in fairness. Would use this hotel again.", "Date": "December 18, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Newcastle upon Tyne", "Title": "“Friendly, reasonably priced, clean, close to the Tube - ideal”", "Author": "Triggerhart", "ReviewID": "UR86675284", "Content": "Although an area I know well, Hammersmith was not my first choice of area to stay in for my business trip to London. However, many of the hotels closer to town were either fully booked or quoting laughable rates and so I ended up here by default. I'm so glad I did because I felt like a genuinely valued and welcome guest here From check in quite late last night to leaving this morning I couldn't fault this hotel. My room was immaculately clean and very comfortable. After a lovely night's sleep I enjoyed a hot shower with decent water pressure before heading down for breakfast. Hotel dining rooms first thing in the morning can be soulless and depressing but my spirits lifted immediately upon being greeted with a big smile and welcomed to a table. Every single member of staff acknowledged me and wished me a good morning. The continental breakfast option was good with fresh fruit, yogurt, pastries, toast, juice and hot drinks. I was more than ready to face the day ahead by the time I had finished. While check out was efficient and quick the member of staff who dealt with me took the time to check I had enjoyed my stay and was anxious to find out if there was anything I needed before I was on my way into town. And it didn't smack of that going through the motions tone I encounter in so many other hotels. This was a refreshing change. Ravenscourt Park Tube station is a couple of minutes walk away and I was in the office, relaxed, refreshed and raring to go by 8.30am. How different from my usual business stay-overs where I am frequently tired, frazzled and ready for home before the day has even begun. I will definitely stay here again.", "Date": "November 10, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Liverpool, United Kingdom", "Title": "“Great stay!”", "Author": "baba49", "ReviewID": "UR85641287", "Content": "Ive stayed at this hotel numerous of times and I enjoyed every stay. Perfect location,central,but out of the rush. Clean rooms and friendly,helpful staff. Highly recommended.", "Date": "November 1, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Maleny", "Title": "“a good choice”", "Author": "carolpaul14", "ReviewID": "UR81884680", "Content": "Staff great,close to the underground.25 to 30 minutes from the shows etc in Leicester square. I asked for a room on the 2nd floor and it was very good.(following a tip). Good price and no problems.", "Date": "October 3, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Halle, Belgium", "Title": "“Very good hotel for two adolescents”", "Author": "Tamara011", "ReviewID": "UR80811470", "Content": "My sister and me ( 18 years and 20 years old) stayed in the hotel for 3 nights in september. We came to visit London and haven't a lot of buget. This hotel was fantastic for us. The rooms were clean, the beds were comfortable. We had room 602 on the sixth floor. We had a great view. The staff was also very friendly and if we had a question they were very helpfull. We valued the sleep quality a little bit less because you can hear some noise from the other rooms. But we were both tired and good sleepers so it didn't disturbed us. The breakfast was also very good. There was enough choice: croisantes, toast, bread, Kellogg's, yoghurt, muelsi, ... In the area around the hotel there are shops with food and clothes and restaurants, ... Across the hotel there is a park and the underground is about 5 minutes walk. Very handy with a big suitcase. There is also a bus stop in front of the hotel. It was the first time that we traveled alone without our parents and this hotel was a part of our great experience. I had a good time and would definitly come back at this hotel. There is still a part of London that a I haven't seen yet. We would like to thank the staff and say: keep going on like this!!! Greets Two girls form Belgium", "Date": "September 24, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "3"}, "AuthorLocation": "Watton, Norfolk, England", "Title": "“Customer service second to none”", "Author": "weezworld", "ReviewID": "UR79270263", "Content": "We stayed at the Premier Inn for 1 night. We travel a lot and have stayed in some high end hotels around the world. This hotel was ideally placed for us to get to the Hammersmith Apollo (1 tube stop away). The hotel was exceptionally clean and the rooms, whilst basic but perfectly adequate. The check in process was quick and efficient. Breakfast was incredibly good value for money and one of the best we have had in a hotel in this country. The views from our room (1201) were fantastic but what stood out most of all was the amazing customer service. I have never been so impressed-all staff were very friendly, attentive and genuinely concerned that guests had everything they needed. I would like to compliment the staff team on this. For value for money and great service this was a great choice of hotel.", "Date": "September 12, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "2", "Overall": "2.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "3"}, "AuthorLocation": "Staines", "Title": "“Their Hypnose bed didn't g'tee me a good night sleep just bites from bedbugs”", "Author": "Wudgieboon", "ReviewID": "UR78098982", "Content": "I was attending a course over a 4 week period requiring me to stay at the Premier Inn for between 2-3 nights per week. I did not have a say in where I got to stay and having travelled the world and stayed primarily in genuine premier hotel groups, I was not looking forward to my stay at a budget hotel. However, having been checked in to a 2nd floor room all of which are refurbished I was pleasantly surprised at the standard of the room. However, the claim of a good night sleep on the hypnose mattress is not so as I found the beds in each of the rooms I stayed in to be extremely uncomfortable and awoke each morning with a stiff back and aching ribs!!! Having arrived at the hotel in week 3 and been greeted by Jane who I will say is an extremely professional and pleasant member of the team, was allocated room 211 which I had stayed in during the previous week and was very happy to be staying there again. Regretabley, during the two nights of my stay I was horribley bitten over 35 times on my arms and legs and it was only on the morning of my departure that the Operations Manager admitted there was a current infestation problem in the hotel which was being treated by a company called Ecolab. So if you are about to check in and see their vans parked outside, carry on walking and find another hotel elsewhere!!! A colleague had overheard a conversation that several rooms were being treated on another floor at the time!!! I had to return to the hotal the following Tuesday for another 2 night stay and was extremely worried as having spoken to Environmental Health, I was advised bedbugs are extremely difficult to get rid of once they are established as they can hibernate anywhere in a room for months at a time, and are easily transferred between rooms through air conditioning ducts, by the cleaners as the move from room to room and so on!!! I was assured by the Operations Manager that I would be well looked after with a good room (I was not, as I was allocated a standard room after being in a family sized room for the previous 2 weeks and had to complain before being moved!) Other issues with the Operations Manager made me realise that the management didn't care for their customers despite stating they did have a bedbug infestation problem and I had been a victim! So my advice to anyone thinking about going to a Premier Inn and this one in particular is, you will be paying them a lot of money (no where near the so called £29!!!) for a night's sleep in a bed that will at least be pretty uncomfortable but could also include some nasty critters leaving you with bites that will itch for at least 5 days which antihistamines do not relieve, AND also LOOK extremely unsightly. THAT IS A RISK I WONT BE TAKING AGAIN!", "Date": "September 3, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Scotland", "Title": "“Service Good - Hotel Fine”", "Author": "Inverclyde", "ReviewID": "UR72280049", "Content": "Staff were very friendly and helpful. Hotel was fine; Room was fine; Breakfast was fine. Not as good as other Premier Inns I have stayed in but I as I said the hotel was fine. A bit far out from the city but hotel is just across from Ravenscourt Tube Station.", "Date": "July 25, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "3", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Surbiton, United Kingdom", "Title": "“A very decent hotel for London, I'd recommend it!”", "Author": "sidesix", "ReviewID": "UR63488794", "Content": "The Hotel is in a nice location in West London. Its right by Ravenscourt Park Station and its walking distance to Hammersmith. There are lots of restaurants and shops nearby the hotel to eat or get the usual snacks/etc. The room was quite small, that is the first negative point and the bed was a normal double rather than the really large airy room and massive bed which we had in another Premier Inn near Gatwick. The room was clean though, and comfortable. One negative was some noisy students who were staying in a large group and made a lot of noise one of the nights we were there. Another negative was that the windows don't open due to 'safety' and that was annoying. The view was quite nice from some parts of the Hotel. The bed was comfortable, and there is TV with Freeview to use. Wi-Fi is expensive as you come to expect from many hotels these days. The bathroom was clean and fresh. Air conditioning was really good and there is an additional heater to use if you're really cold! Overall a nice decent stay and I'd use the hotel again!", "Date": "May 7, 2010"}, {"Ratings": {"Overall": "3.0"}, "AuthorLocation": "Bristol, UK", "Title": "“Decent budget accommodation”", "Author": "prof_crunch", "ReviewID": "UR63251617", "Content": "There was a bit of a scrum at check-in when we arrived but, to be fair, we secured our room with a minimum of fuss. We were given a well-proportioned corner room on the first floor, which had room enough for a desk along with hanging space, flatscreen telly and the usual tea-making facilities. The bathroom was also far less poky than you might expect from such budget accommodation (we paid £59 for one night, not including breakfast). Certainly everything felt basic and the maintenance was slightly lacklustre - the shaving light didn't work, for instance, and the shelf in the bathroom felt as if it might detach itself from the wall at any moment. And curiously, the shower - which you couldn't adjust - had been plumbed in so that it couldn't comfortably be used by anyone over the height of around 5ft 2in. But, for the price, these are minor grievances and for what we wanted - somewhere inexpensive that was walking distance to the Hammersmith Apollo - it was perfectly acceptable. For a one-night stopover, I'd be happy to go back.", "Date": "May 4, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Edmonds, WA", "Title": "“Comfortable Stay During Trying Time”", "Author": "errabunda", "ReviewID": "UR62331278", "Content": "We stayed at the Premier Inn London Hammersmith because it is close to our son and his family. Our room was small, and our son said it was smaller than other rooms other family members have stayed in, BUT I mentioned in my reservation request that my husband has limited ability to use stairs, and this room was on the first floor next to a staircase. Having had to help him out of a seventh-floor room in a burning Canadian hotel at a time when he had a bit more mobility, I really appreciated the concern for our safety. The room was very clean, the bed was very comfortable, and the staff was wonderful. We had to extend our stay a bit because of the Icelandic volcano and the resulting closure of UK airspace, and the staff worked hard to make sure all the stranded passengers we well cared-for. This hotel is located in a real residential neighborhood, across from a park, and there are many child-friendly restaurants and cafes nearby. This is the usual hotel for international guests visiting my son and his wife and child, and so far everyone has felt they got good value for their money.", "Date": "April 24, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "2.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "3"}, "AuthorLocation": "lymm cheshire", "Title": "“be careful how you book”", "Author": "tilly321", "ReviewID": "UR58811929", "Content": "I haven't stayed in this hotel yet (booked for 13.04.10) and probably won't be able to now. I booked one overnight stay on the net and later realised I'd got my son's school holidays wrong. The call centre simply said no refunds, no ammendments. I completely accept I'm at fault I would just like a little human good will. I understand why they have this policy- late cancellations must be problematic and the offer price reflects the risk you take- but I'm trying to ammend the booking by one week to a date the same price as what i've paid and with a month's notice. I'm not even one of the thousands of business customers premier inn must get per week, I'm a single working mother who saved to treat her son to a one night short break. Now my money's gone and we've no chance of going. anyone want to buy room from me?! natalie.neill@btinternet.com.", "Date": "March 17, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "2", "Sleep Quality": "2", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Beograd", "Title": "“Average at best”", "Author": "CGorac", "ReviewID": "UR57462363", "Content": "I've spent a night in Hammersmith Premier Inn. Checked in rather late, past 9pm, and was really only interested in quick shower and quiet sleep. But I had several smaller issues that really hurt my experience. First, seems like quartz heater was provided only for heating. There was an instructions leaflet on the table on how to activate \"real\" heating, and I've spent good 10 minutes in trying to do so, but without any success. So I decided to give the quartz heater a go; I was a bit uncomfortable in keeping it turned off throughout the whole night (quartz heaters are oftentimes causes of a fire), but this one was protected well, and it worked fine after all. But it would good, if indeed heating is broken in this room, that an info on using alternative heater is provided. Further, I found this shutter, that is closing the outtake of the water from the sink in the bathroom, is broken - so the sink would fill up with the water, and then the water would go out through that emergency aperture near the top of the sink. Also, the desk lamp was not working either. But I was really not into the mood of calling the desk to fix all these things, so I just went to sleep. I slept well, as I was pretty tired, but still I noticed the level of noise is rather high: the noise from the city traffic was significant, but even worse was the noise of some kind of very large fan, seemingly operating somewhere in the hotel building (as the noise seemed clearly distinct from the outside noise). I found the noise biggest issue in my stay, and in that regard, it was especially strange that this hotel is claiming \"good-sleep guarantee\". In the morning, I've enjoyed nice view to the neighborhood (piece of Thames was visible from my room), but again some kind of curtains are put between two level of windows, and it's really hard to move them to the side to enjoy the view. Final issue I had was about the breakfast: again, there was a leaflet in the room, and I understood there exist two options, quick fixed meal for approx. 3 pounds, and eat-as-much-as-you-can from both cooked and continental menu for 8 pounds; girls at the dining room offered continental menu only to me though, and only near the completion of the breakfast I saw other people having stuff from cooked menu delivered. Finally, I was charged 5 pounds something, which obviously means continental and cooked menu are priced differently; the food I ate was good, but I was really in the mood for something cooked, and I think all the options should be clearly stated both in the leaflet, and by staff in the dining room. So, my overall impression on the hotel is really average. But at least it was very close to the office I was visiting, so I hope I may have another opportunity to check it out, and maybe my impression is going to improve.", "Date": "March 1, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Location": "4", "Rooms": "5"}, "AuthorLocation": "Trnava", "Title": "“very satisfied”", "Author": "silwya99", "ReviewID": "UR54648579", "Content": "we stayed here 2 nights, during weekend 23-25.1.2010, 8persons, staff perfect, very helpful, good breakfast we tried also cooked break. but continental b. is very good. I booked hotel and make all anout it, 3 rooms were big, clean and with perfect view, unfortunatelly our room was very very small :-(( but generally very good . hotel very close to underground. we have perfect price trought Dertour. so I would stay here again :-)", "Date": "January 29, 2010"}, {"Ratings": {"Cleanliness": "5", "Overall": "4.0", "Rooms": "4", "Location": "5"}, "AuthorLocation": "wrexham,north wales", "Title": "“great budget hotel,great location,great service!”", "Author": "kellybw", "ReviewID": "UR54330389", "Content": "We were in London for a concert at the Hammersmith Odean and did some research on hotels near the location. They were all similar in price,especially on sat, even the budget hotels matched the so called better hotels so we booked the Premier. They kept us up to date by text even asking on the day if we wanted to book the evening meal. The hotel was right by Ravenscourt Underground station. The receptionist was very friendly and asked us is we had a preference for which floor we would like to stay on. We chose the 13!!! which in fact was the roof!! what a view. The rooms are on the smaller size but clean,tidy and even had a kettle/tea/coffee facility. We slept soundly, beds very comfy and no noise,even traffic. The breakfast was £7.75 for as much as you like,continental,cooked,pastries etc. Service was great. Really can't fault the hotel. Would Stay here again.", "Date": "January 25, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "4", "Rooms": "5"}, "AuthorLocation": "norfolk", "Title": "“Perfect place to stay for Hammersmith events”", "Author": "norfolknin", "ReviewID": "UR52820085", "Content": "Stayed here for one night as travelled to London to see Billy Connolly at Hammersmith Apollo. We got off tube at Hammersmith station (then realised there was a nearer one!!) but it was a straight walk down to the hotel so no probs. On arrival the receptionist was very polite, asked us about our journey and checked us in promptly. We had a twin room on the 11th floor and although it was a bit cold, understandably at the moment, there was a fan heater supplied as well as wall heating. We had a small problem with the towels but after a call to reception the housekeeper came straightaway with more and she too was extremely polite. Really good nights sleep then down to a delicious cooked breakfast. Once again staff very polite and friendly. Check out prompt and once again, receptionist asked about our journey home and wished us a safe journey. All in all an enjoyable stay, will definitely stay here again, not only for Hammersmith events but when in London as the tube gets you wherever you want to be. On our last visit to London in November we stayed at the Kensington Hilton, paid nearly 3 times as much and got a much poorer service so I would wholeheartedly recommenmd this hotel to others.", "Date": "January 7, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Location": "5", "Rooms": "4"}, "AuthorLocation": "buckinghamshire", "Title": "“ideal for the hammersmith apollo and visit to London”", "Author": "pat103", "ReviewID": "UR51011920", "Content": "Just got back from staying at this premier inn. Stayed there for 3 nights. I work in the tourist industry and visit many hotels and lots have been premier inns so here is a honest opinion on this hotel. On arrival i was offered a room on the 3rd floor which was like a box room, ok for one night, but with me staying 3 nights i wanted better then this room. There was no problem in changing my room. The staff at the reception were more then helpful, and within 30 mins of my issue i was offered a room on the 11th floor. Best thing i could of done, the room was so much larger then my previous room, though i was informed it was a family room. Being up so high the views from the window was great, i was able to see quite a distance, and was able to look out and see the thames. Decided to have my evening meal at the premises on first night . Booked the table for 6.30 and order was taken straight away. However, the bad news was that my dinner did not arrive at my table till 7.15 between this time the waiter was full of apologies for the delay, and to be fair the staff were running around so not sure if this was a usual thing, but when the dinner finally arrived it was not the best meal i have ever had, but by this time i was tired and hungry and was past making a comment about it. But one couple with two restless children had arrived before me and when i had left the table i noticed though the children had had their meal the two adults were still waiting for theirs. My heart went out to them. But the next morning I found the breakfasts very good and excellent service and the staff were really friendly and made you feel that nothing was to much for them in trying to make your stay worth while. I was a bit disapointed though to find that each evening i returned to my room the room attendent had not topped up the tea bags, coffee ect. But as i had brought my own i never bothered to mention it. But i think these should of been replaced without the need of asking for more. The hotel was in a ideal area, The tube station is just across the road, and i was there to go to a show at the Hammersmith Apollo, it took no more then 15 minutes for me to walk it, but even if you did not want to walk its only one station away and you could be there in minutes. Because the hotel is on the main street there are lots of shops for you to visit. A large supermarket is only a few minutes away. I found this hotel to be an ideal place to visit London. I have stayed at other premier inns which i found to be more modern i guess you could say this is a bit dated, but certainly not old fashioned, and i would most certainly stay there again when visiting this area. It was just a shame about the evening meal and i did not have another meal there so i cannot say if that night it was a one off but felt it should be mentioned.!!", "Date": "December 10, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Location": "4", "Rooms": "4"}, "AuthorLocation": "Bellingham, Washington", "Title": "“Pleasant Stay”", "Author": "BebeZed", "ReviewID": "UR49586645", "Content": "My stay at the Premier Inn Hammersmith was very pleasant. From the moment I checked in, the staff was very attentive. I was greeted warmly every time I entered the lobby, and if I needed anything, all I had to do was ask. The room was on the small side but very clean and comfortable. A table and chair was set up right in front of the window so I could work and gaze out the window. The bed was very comfortable and plenty of pillows were available. An electric kettle was provided, as were teabags, coffee, creamer, and sugar; the front desk will gladly supply more tea (etc) upon request but because I drink so much of it, I purchased my own tea and sugar. Wifi internet access is available but is not free; internet access is provided by a third party. I ended up spending £30 for the 9 days I was there. I did not see an option to be emailed a receipt, which I needed for tracking business expenses. The connection usually showed as 20% signal strength but was generally acceptable; I had very few drop-outs. I did dine in the hotel restaurant. I dined there for supper and had a very nice chicken curry; the wait staff was attentive and the food top-notch. I also had the \"Premier breakfast\" which was also very good. Location is very good - the Ravenscourt Park tube station is but a short walk and from there it's easy to get to anywhere you want to go. There is a small 24 hour grocer across the street -- they have the most wonderful falafel meal in the cold case that is a wonderful alternative to dining out. There is a pub next door, and two or three doors down there is a very nice Thai market with all sorts of wonderful fresh herbs, packaged seasonings, and noodle cups. There are many restaurants nearby, offering a variety of cuisines; there are also a few fast food places within walking distance. There is plenty of shopping nearby. Also, it's a short walk to the Thames, where you can take a stroll. Very nice! In short, the Premier Inn Hammersmith helped make my stay quite pleasant. I plan to return to London, and when I do I will once again stay at this hotel. I recommend it as a nice, comfortable, and reasonably priced hotel.", "Date": "November 19, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Location": "3", "Rooms": "4"}, "AuthorLocation": "TO", "Title": "“Very good!”", "Author": "PaolaC_TO", "ReviewID": "UR49389046", "Content": "We had a nice room, at he 8th flloor, with an L shape. Very good also for my child. Teh room was quiet, and with a great view on London. Staff was very kind and gently. A lot of restaurants and pub otuside, also a small supermarket open 24 hours/7 days. Tube station (Ravenscourt park) quite close.", "Date": "November 17, 2009"}, {"Ratings": {"Cleanliness": "5", "Overall": "5.0", "Value": "4", "Service": "5", "Rooms": "4"}, "AuthorLocation": "norfolk", "Title": "“Would recommend to anyone - especially if visiting the Apollo!”", "Author": "skippyNorfolk", "ReviewID": "UR49165605", "Content": "My sister and I stayed here for two nights while on a trip to a concert at Hammersmith Apollo. We didnt really know the exact location when booking online, just that it was nearby. Fortunately it turned out that the Underground station at Ravenscourt was a short walk from the Hotel and the Apollo was a ten minute walk down the road, so it was ideally located for us! The Staff were very friendly and helpful, the rooms were spotless and the beds comfy, there were two plump pillows each, a flat screen tv, hairdryer, tea, coffee, shampoo, handsoap, towels etc.. We didnt have the evening meal, though by the time we had finished shopping and dragged ourselves back to the hotel we wished we had! We did have breakfast, which was faultless, cooked breakfast was perfect, porridge was great - not like the dish of wallpaper paste I have been presented with on previous holidays! There was a smell in the bathroom, though the actual room was spotlessly clean, (there was a shower over a small bath, which I used and being 5'10\" it was a bit of a squeeze, but I prefer a bath to a shower so I was happy with that!) must have been the drains, but I have mentioned this on my review to the Hotel so hopefully they will sort that out, but it wouldnt stop me from staying there again!", "Date": "November 14, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "3.0", "Value": "3", "Location": "3", "Rooms": "3"}, "AuthorLocation": "Bristol", "Title": "“Watch the parking”", "Author": "Dimeander", "ReviewID": "UR37868649", "Content": "Hotel is an updated old seventies tower block hotel which does have smallish rooms with half-sized baths, (in my room on the top floor at least). I didn't eat at the hotel, but I did see some of the food being served as I checked in, and I have to say it did look very nice. Parking could be an issue if you arrive after 20.30. The hotel's website says there are a small number of parking spaces at the hotel and a 24 hour park car nearby. I arrived at 21.30 to find the hotel car park full, (fair enough), but the nearby Kings Mall car park is locked for entry at 20.30, which leaves you the choice of paying to park at an unsupervised car park in the centre of Hammersmith, or parking on the road outside the hotel for free, (as long as you remember to move the car before 07.00 when the parking restrictions start). Overall the stay was fine, but I won't turn up at the hotel late with a car again.", "Date": "August 16, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Location": "4", "Rooms": "4"}, "AuthorLocation": "Penzance Cornwall", "Title": "“Back again.....................”", "Author": "EugeneMorice", "ReviewID": "UR37070347", "Content": "Once again we are back at the Travel Inn in Hammersmith with our 2 children for what is rapidly becoming an annual sightseeing and shopping trip. This year the weather was a bit less hot and humid ( we hit the only 3 hot days of the year last year ) and so the temperature in the rooms was fine ( the aircon struggled a bit last year!!). The service in this Travel Inn was excellent. All the staff worked with a smile and the stay was excellent value ( lessons that need to be learned by other hotels in the Premier chain as we were to learn during our encounter with staff at one of Premier's Oxford lodges !!). The room was clean and a good size again and once again Christine ( and her colleague whose name I did not quite catch due to not being able to read the name on his badge due to my age and failing eyesight !!) really looked after us well in the restaurant. We have a son with special needs and all the staff were attentive to his needs no matter how demanding he became at times. Thanks everyone !! I have to say however that all the guests as far as we could see were treated with courtesy and consideration, so well done y'all !!!! Eugene Morice, Penzance Cornwall", "Date": "August 8, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "3.0", "Value": "4", "Location": "4", "Rooms": "3"}, "AuthorLocation": "Dublin", "Title": "“Not Bad, Could be better”", "Author": "CJ_Dub", "ReviewID": "UR35533941", "Content": "The staff, location and the prices are the positive points for staying in this hotel. The negative points are the rooms with the paper thin walls and the tiny lifts.", "Date": "July 23, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Mumbai", "Title": "“Great stay for budget traveler!”", "Author": "Sc0rpi0n65", "ReviewID": "UR31466297", "Content": "The Premier Inn hotel at Hammersmith is a good budget hotel for any international traveler. Ideal location and well connected to the London city zones, it is one of the best hotel to spend the business trip stay or even if you are on vacation with family. The hotel has a small reception area with smiling & helpful staff. The rooms are very clean and well appointed. The rooms are secured and have all the necessary amenities a traveler would want. The house-keeping service ensures the rooms are kept clean & in order. The beds are large and very comfortable. The flooring has carpets, but it’s not smelly. There is a coffee machine in each room and the entire property is no smoking. The washroom is well designed and has a tub and powerful shower. Overall the room has everything one needs to make their stay comfortable and one cannot ask for more! The restaurant is small, but serves a great and wholesome breakfast. They feed & pamper you with hot and cold serves. One nice breakfast and it sets & starts your day perfectly with lots of energy and freshness!! The staff is very cordial and helpful and they ensure that your stay is full of comfort. I would recommend this hotel to all travelling to London and if you are on a budget.", "Date": "June 3, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Mumbai", "Title": "“Small, efficient business hotel”", "Author": "shahmm", "ReviewID": "UR29676611", "Content": "The Premier Travel Inn is a great place to stay in if you are looking for value for money and are likely to be out of your hotel room most of the day - generally the case when one is on business or touring London. Its on Hammersmith not too far from the tube stations and though the property is just a building it is well maintained and has all the facilities one would need while on business or touring a large city. The rooms are thoughtfully furnished and of a decent size, though the bathrooms can be a little cramped though not uncomfortable. The single restaurant at the lobby level can be crowded but service is efficient and the food is good. All in all a convenient comfortable place to stay in London.", "Date": "May 10, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "4"}, "AuthorLocation": "rooney", "Title": "“fantastic”", "Author": "RooneyRooney", "ReviewID": "UR29488689", "Content": "every staff of the hotel was fantastic ..the provided was better then any 5 star hotel...the service of the guys at the restaurant was mind blowing ....hats off to the indian guy whose name i dont remember but starts with letter 'ob' ....he was on his own with out any help ....but was cheerful enough to provide every guest with excellent standard of service and the breakfast chef who came out was very sweet", "Date": "May 6, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "3", "Location": "4", "Rooms": "3"}, "AuthorLocation": "Leicestershire", "Title": "“Would stay again when in London”", "Author": "smonkey5b", "ReviewID": "UR29008920", "Content": "Rooms really clean although on the small side. Staff all very accommodating and with a smile too! One of our rooms lost all power and this was attended to within 5 minutes. There was one guest who was complaining that on returning to his room he had found a strange man asleep on the floor???", "Date": "April 29, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Vale of Glamorgan", "Title": "“Reasonable stay at Premier Travel Inn in Hammersmith”", "Author": "Cowbridgelady", "ReviewID": "UR21504310", "Content": "Stayed at the Hammersmith Premier Travel Inn for 2 nights as the location suited for a function we were attending. Usual travel inn experience - clean, comfortable and compact rooms with great views as we were on the 11th floor. Staff were all very helpful, Ravenscourt Park Tube Station (on the District Line) is about a 5 mins walk away and the area itself , predominantly Polish, felt safe with enough cafes, pubs and restaurants within walking distance. Dined out on our first night at a cheap and cheerful Italian about 5 mins walk down King Street to the right - Casa Mia (had seen a few good reviews for it on the net from locals so thought we'd give it a try). They did a £7.95 menu for a 2 course evening meal - had a huge prawn cocktail and a pasta course - good value by usual London prices. Breakfast in the Travel Inn (also £7.95) for the full English was ok. It is cooked to order, but disappointing that the baked beans were congealed on the plate as though they had been standing for ages and the tea was cold. So, on our 2nd day, decided to try somewhere else - crossed the road and walked down King Street to the right for 5/10 mins max and we found a Weatherspoons pub on a corner that do a cooked breakfast for £2.69 (or a gut buster cholesterol special - 2 of everything for £3.69). We had the £2.69 version and it was excellent - recommend it as long as you can stomach seeing people having a pint at 10.30 in the morning!!. Unfortunately, this stay, we had the car with us - the Travel Inn do have some spaces which are available on a first come, first served basis at £12 a day, but they were all taken by the time we arrived at 6pm so had to park in the NCP car park 5 mins walk away which charges £22.50 per day. Pleasant stay at the Travel Inn though and would stay there again if we needed to be in that part of London. My favourite PTI in London is County Hall - can't beat that one for location in my opinion.", "Date": "November 3, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "2", "Check in / front desk": "4", "Overall": "2.0", "Value": "2", "Rooms": "1", "Location": "4"}, "AuthorLocation": "Midlands", "Title": "“Not great”", "Author": "AWredarmy", "ReviewID": "UR19872690", "Content": "I stayed for one night and upon arrival was greeted by helpful reception. The room was small and to be honest rather claustrophobic. The adjoining rooms either side of mine were noisy and you could hear the hot water taps and shower noises from both rooms. This hotel by far lacks the quality of other Premier Inn hotels I have stayed at. The best thing had to be the helpful staff.", "Date": "September 8, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "3", "Check in / front desk": "5", "Overall": "4.0", "Value": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "saudi arabia", "Title": "“Convenient location”", "Author": "enones", "ReviewID": "UR19513043", "Content": "We stayed here after an excellent experience with another Premier Inn at Earls Court. Less than 5 minutes walk from Ravenscourt Tube Station. The usual expectations from Premier Inn of clean bedroom and washroom prevail. Polite staffs. My photos attached are more of the surrounding areas of the hotel as the room conditions are pretty the same as with other Premier Inns. Located in an area where you can find various continental and Asian restaurants. Polish theatre, cafe, and Polish delicatessen just opposite the hotel. Nice neighbourhood and amenities. You can go to Ravenscourt Park and Thames Riverside Walk nearby for jogging. If you have the stamina, you can walk along the Thames River or King Street to Hammersmith.", "Date": "August 29, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Check in / front desk": "4", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "hyge", "Title": "“Really enjoyed our stay”", "Author": "hyge", "ReviewID": "UR19249093", "Content": "My wife, my 2 sons and myself really enjoyed our stay here and would use this Premier Travel Inn again. The staff were both polite and helpful and the rooms were clean and comfortable. We hit London on the hottest day of the year so the rooms were pretty hot and stuffy. The aircon did the best it could but by virtue of the fact that this Travel Inn is situated in a tall building the windows would only open so far, so sleeping was a bit difficult. The food in the small restaurant was traditional predictable Travel Inn fare ( lots of things are \"off the menu on a Sunday evening sadly !), but this was actually an advantage to us since with 2 young sons a bit of predicatbility in terms of available food over a 3 night stay is quite useful ! In terms of location this Travel Inn is close enough to Central London so as not have to spend too long on the Tube (District Line from Ravenscourt Park) and far enough out to avoid the congestion charge ! Special mention must go to a young lady on the staff called Christine who works in the restaurant who was incredibly kind and patient with our youngest son Peter who has Prader Willi Synderome and can be a bit of a handful at times. Nice one !!! Eugene Morice Penzance Cornwall", "Date": "August 22, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Business service (e.g., internet access)": "4", "Check in / front desk": "4", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Darlington", "Title": "“Cheap and Chearful”", "Author": "sb0b", "ReviewID": "UR18372063", "Content": "chose this hotel as we were going to see High School Musical at the Apollo, lots of places to eat in the area and felt safe walking back to the hotel after the show. Stayed for 2 nights and the staff were very helpful and friendly any problems you had they would do their best to help. close to the tube station so handy for the rest of the sight seeing. Good views from the windows too.", "Date": "July 29, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "4.0", "Value": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Swansea", "Title": "“Great hotel, Good value for money!”", "Author": "Caz8steve", "ReviewID": "UR16494604", "Content": "Stayed at this hotel for 2 nights over half term holiday. Hotel is located about a 2 minute walk from Ravenscourt Park tube station. You can't miss it... It is the tallest building in the area! While we were staying, a major referbishment was taking place of the whole hotel. I was a bit worried about noise, etc... But it was fine, the only problem was that only one lift was running and when you're on the 12th floor, this can be a bit annoying!! We stayed in room 1207 which was really big. It had 2 large windows which showed an amazing view. The room was in an \"L\" shape, with our bed completely out of site of the kids beds which was great for a bit of privacy! The room had been recently decorated and was spotless, only gripe was the lack of heated towel rail. I'm all for using towels a 2nd day, but with nowhere to dry them I had no choice but to request fresh towels for 2nd night! Breakfast was lovely and the staff were all very nice. Area is great if you want a base to explore London, it's only a few minutes on the tube. Word of warning: There is a bit of noise from the tube trains but it is bearable, although it goes on quite late into the night! All in all, this is a great and good value for money hotel and I would stay there again!", "Date": "May 29, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Check in / front desk": "4", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Dumfries, Scotland", "Title": "“Ideal”", "Author": "MrsControlFreak", "ReviewID": "UR15011754", "Content": "We stayed for 4 nights for a long weekend trip to London, 2 adults and 12 year old child. We would definitely go back. Tube staion very close (Ravenscourt park, less than 2 min walk). Clean modern rooms, excellent breakfast (free for 12 year old) with as much as you can eat. I liked the fact that the cooked breakfast was freshly prepared and not on the buffet. Staff very friendly. If I was trying to be picky I could find a few flaws, but as long as you're not expecting the Ritz it was great.", "Date": "April 13, 2008"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Business service (e.g., internet access)": "3", "Check in / front desk": "3", "Overall": "3.0", "Value": "3", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Reading, United Kingdom", "Title": "“OK”", "Author": "eattravelandbe", "ReviewID": "UR14520789", "Content": "On Arriving my initial thought was good location in the mid of Hammersmith near the Train station. The room were small but clean and had everything you needed I wouldnt like to stay in here for a week but 4 a couple of nights it was big enough. Had Breakfast in the morning which took over half an hour to come and when it did, it was good but I would recommend asking for double everything as the Beans and Mushrooms portions were very small. Overall it was an average hotel! nothing special", "Date": "March 25, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Business service (e.g., internet access)": "3", "Check in / front desk": "5", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Washington DC", "Title": "“Nice Hotel - Good Value”", "Author": "REC703", "ReviewID": "UR13538700", "Content": "We arrived at the hotel on 1 January at 11:30 AM after an overnight fight. It was obvious that they had been full for New Year's even and quests were sleeping in. However, the very nice young lady at reception got housekeeping on the phone and had a room cleaned for us before we could finish our coffee. Location is great for exploring this part of London. Short walk to to Black Lion Lane and its three great London Pubs: The Black Lion on the Thames and the Cross Keys and Carpenters Arms. Each a good example of a 'locals' London pub. Also a short hike down Chiswich High Road to numerous good restaurants, shopping and watering holes. Room though not large was comfortable and a good value, especially for the location.", "Date": "February 13, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "2"}, "AuthorLocation": "england", "Title": "“does what it says on the tin”", "Author": "dundeetripper", "ReviewID": "UR7802592", "Content": "This hotel is not in central london and it can take a while to travel to see the sites. Its about midway between london and heathrow so would be handy if you needed to be close for a flight. Its a multi storey affair which doesn't look all that nice from the outside, however the room and the reception looked nice. We stayed in a corner room on the 9th floor with our 15 month old son. The room was clean as was the bathroom. The cot for our son looked very new and the sheets were spotless. Check in was quick and efficient. Breakfast is offered at £7.50 for a buffet as much as you can eat, but its only a short hop on a bus to chiswick highstreet for all the trendy bars and restaurants. My only complaint would be the shower pressure which was abysmal. But we had a quiet 2 nights there with a good nights sleep.", "Date": "June 7, 2007"}, {"Ratings": {"Overall": "3.0"}, "AuthorLocation": "liverpool", "Title": "“Great location and GREAT air-conditioning, but the price?”", "Author": "HacketteMcHack", "ReviewID": "UR7148264", "Content": "My partner and I stayed at this hotel for a family party. It was a Saturday in July, and we paid £90 for a double en-suite, which we thought a little steep, especially seeing as my partner's parents were staying at the 4* Novotel down the road for the same price. However, the location (about 1 minute from the tube, close to bars, restaurants, shops and on a major, but quiet, road) made up for it as it's ideal for those driving (in London!?) or on public transport. The hotel itself was fine, pretty average really, apart from the beds, which truly were VERY comfortable (as the company promise). Check-in was a hassle-free affair, and the staff were very friendly indeed. They were happy to answer questions, and offer directions to the event we were heading to. Our room was a good size with an equally good sized bathroom, with pretty boring, but not unpleasant, views across the car park. Most importantly, the room had air-conditioning, which was much appreciated after a 1hour trip on the underground on a 30 degree centigrade day...Moreover this was GOOD air-con (and anyone who stays in hotels regularly will apreciate this I'm sure!). The bathroom was a bit basic, and took an AGE to get any hot water through the taps, despite turning my hand to all the tricks in the book to get them to run warm. But it had everything I needed; bath, shower, etc. Functional I believe is the word... The room and bathroom were both immaculately clean, but there was a slightly odd, almost damp smell in the room, which I see another reviewer has mentioned. It was innocuous, but not being able to open the window didn't help. It didn't bother me in the slightest but it was noticable when I walked in the door The room was quiet, as I say we stayed on a Saturday night in the school summer holidays and we didn't hear a thing, either from other rooms or from outside. Such a relief and a change from some other, more expensive hotels! Breakfasts were good, but quite expensive for what is on offer (as I often find). Guests would probably do better to head out to one fo the local delis or cafes (5-10 mins away) to pick up a bite, but what was on offer in the hotel was perfectly passable and the staff serving were very kind and helpful. All in all a very good, middle of the road London hotel. It's nothing special, but great if you need to head to West London for whatever reason, it's a safe bet. Would I stay here again? Sure, so long as the 4* wasn't cheaper again!", "Date": "March 12, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "solihull", "Title": "“Excellent”", "Author": "Smokey02", "ReviewID": "UR6610849", "Content": "Myself and my mother had a family room with a king size bed, a single bed and a mattress on the floor. Both beds were extremely comfortable. The room was spotless when we arrived and was maintained that way each day. Reception staff were friendly and helpful. 10 min slow walk to Hammersmith tube station. Downsides: Only had a small bath and the shower over the bath wasn't the best, the water tended to spray all over the place.", "Date": "January 17, 2007"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Check in / front desk": "3", "Overall": "2.0", "Value": "2", "Rooms": "1", "Location": "4"}, "AuthorLocation": "London, United Kingdom", "Title": "“Like a hall of residence”", "Author": "steakandalepie", "ReviewID": "UR5930260", "Content": "This no-frills, functional hotel resembles a university hall of residence, with endless corridors and swing doors to drag your bags through. Our room was basic and smelled a little odd but it just about sufficed for the few hours that we needed it before an early morning flight from Heathrow. We arrived at 1pm but were unable to access our room, so had to pile our bags into a storage cupboard and come back later. The location is good for Ravenscourt Park tube, but if you are considering this hotel because it is near to Heathrow, be warned that you will have to change trains to get on the Piccadilly line.", "Date": "October 9, 2006"}], "HotelInfo": {"Name": "Premier Inn London Hammersmith", "HotelURL": "/ShowUserReviews-g186338-d193027-Reviews-Premier_Inn_London_Hammersmith-London_England.html", "Price": "$119 - $198*", "Address": "<address> <span rel=\"v:address\"> <span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">255 King Street</span> | <span class=\"extended-address\">Hammersmith</span>, <span class=\"locality\"><span property=\"v:locality\">London</span> <span property=\"v:postal-code\">W6 9LU</span></span>, <span class=\"country-name\" property=\"v:country-name\">England</span> </span> </span> </address>", "HotelID": "2514431", "ImgURL": "http://media-cdn.tripadvisor.com/media/ProviderThumbnails/dirs/f5/60/f5606efa5ec40db99bbc05353d658b9d2large.jpg"}}