{"Reviews": [{"Ratings": {"Service": "2", "Cleanliness": "3", "Overall": "2.0", "Value": "2", "Sleep Quality": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Cannon Beach, Oregon", "Title": "“Hotel Ibis London Excel-Docklands”", "Author": "ss d", "ReviewID": "UR126936121", "Content": "Stay here 24 March 2012 to 28 March 2012 2 hours to hotel from Hethrow airport by subway Not a pretty hotel, no spa, or place to get a facial No room service, Can't call out of hotel room with a credit card or phone card Directly beside Excel Center, A couple places to eat near by, food terrible in this area. Hotel it self appeared clean Staff friendly but overworked and overwhelmed Bed comfortable, clean sheets. 2 pillows, large window no view, not designed to open. Hotel room nothing in it except a small TV with local cable Internet service for $15 Canadian per day. Other hotels nearby offer 1/2 hr per day free Bathroom, Shower and sink, toilet clean no soap, shampoo, nothing else, 2 towels Would not stay here again, because other hotels nearby were cheaper and had free internet and restaurants, London city airport close by, can see British Airways planes flying over all day and night. Couldn't hear them inside hotel.", "Date": "March 29, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Norfolk UK", "Title": "“Amazing value”", "Author": "rjhall", "ReviewID": "UR126636642", "Content": "We have stayed here twice and each time have had an enjoyable stay. Functional clean room - comfy bed. Staff very friendly and helpful - the cleaning staff always smiled and spoke. Close to Royal Victoria Station (leisurely 5 minute walk)", "Date": "March 25, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "2.0", "Value": "2", "Sleep Quality": "5", "Rooms": "2", "Location": "3"}, "AuthorLocation": "Colorado", "Title": "“Try another nearby hotel”", "Author": "blumberg", "ReviewID": "UR126302776", "Content": "From a USA perspective....yes it's clean and perfectly convenient to the Excel Exhibition centre and to the tube. Compared to budget hotels in the USA such as Hampton Inn, Holiday Inn Express, Fairfield Inn, it comes in waaay behind. Don't expect ANY of the little things that you get at one of those hotels, e.g. shampoo!, facial tissues, hand or face towels, two trashcans, free tv (yes, 10 GBP per day to watch regular TV; I didn't do it). Don't bother to ask the front desk for a razor or toothpaste or plug adapter because they will be happy to point you to their vending machine or the store across the street. I was there 4 nights/5 days. I actually enjoyed the breakfast buffet (it is normally 7 GBP per day, $10+ but mine was part of the package). The \"bar\" beer selection was pathetic with no real english beers on tap (Carling?!) but this was not unusual around Excel Centre. People attending Excel are probably on a fixed per diem and can probably find a' better hotel nearby or a short tube ride away for the same price. If you are a tourist to London, expect at least 2 trains to get to the city center. FWIW: I travel about 70-80 days per year and have for the last 8 years on trips of usually 3-7 days length.", "Date": "March 18, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "4", "Sleep Quality": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Walsall", "Title": "“Almost like a youth hostel”", "Author": "CheekyKush", "ReviewID": "UR126045939", "Content": "I was a little disappointed with this hotel. It's not much different than the custom house hotel nearby. The room was small and the bathroom tiny. However it was clean and not too expensive. If you need to be at the excel centre then the location is ideal. It has a bar which is reasonably priced. Nothing much else to say.", "Date": "March 13, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "3.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Bristol", "Title": "“Convenient for Excel Centre”", "Author": "Harriet E", "ReviewID": "UR125739001", "Content": "Basic but clean as you would expect from an Ibis. Its a stone's throw from excel and the nearest DLR so very well located. breakfast is all you can eat for £7.50 so its good value if you have a good appetite! the two things i would complain about are that i booked in advance (which usually means you get the room cheaper) but on arrival at the hotel their rack rate written on the board at reception was £69 - some £30 cheaper than what i paid. My other complaint is that housekeeping opened my door before 9am and woke me up (i was leaving that day anyway so think there should be better communication between reception and housekeeping to ensure people arent woken unnecessarily.)", "Date": "March 7, 2012"}, {"Ratings": {"Service": "1", "Cleanliness": "3", "Overall": "2.0", "Value": "3", "Location": "5", "Rooms": "3"}, "AuthorLocation": "", "Title": "“Rooms as expected for the price, basic but clean but the food is rubbish”", "Author": "Sandalwoods", "ReviewID": "UR125614724", "Content": "We ate in the restaurant for the first 2 nights. On the first night the fish and chips were greasy and cold and the waitress removed my starter plate before my husband had finished his, then she served the mains while he was still eating his starter and just removed the plate. We decided to try again the next night and it was worse. Soup was like water, my starter differed considerably from the same one the night before, my husband asked for a fried egg with his gammon steak to be told there were no eggs in the hotel!!!! We waited ages for our mains (which were unedible) and we were told by the waiter it was because they were so busy, there was 5 other tables!!!! Also every wine I ordered there was none left. I would not recommend the food and the hotel needs to employ people who understand english. A very poor show for a London hotel, it felt like it was being run on a shoe string.", "Date": "March 4, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Iisalmi, Finland", "Title": "“Excellent hotel and cheap”", "Author": "tomilo", "ReviewID": "UR125487301", "Content": "Good hotel, we went a bit early to checkin but they managed to get us a room (another room was available later). Good restaurant, friendly staff, quite okayish breakfast (7,5 pounds). Cheap and good hotel, definitely will come again in Ibis. Nearby shops and restaurant are good also.", "Date": "March 2, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Cambridge, United Kingdom", "Title": "“good clean room”", "Author": "peter1958_11", "ReviewID": "UR125475945", "Content": "Stayed for 1 night,great for exel We had our evening meal in the hotel restaurant which was good for the price The room was clean and had all we needed for our stay,Breakfast was very good plenty of choice and good coffee. We would also like to say thank you to jurgita for her good,friendly service making us feel welcome.", "Date": "March 1, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Location": "4", "Rooms": "4"}, "AuthorLocation": "Glasgow, United Kingdom", "Title": "“Nice hotel”", "Author": "laurr92", "ReviewID": "UR125455421", "Content": "Stayed in this hotel last february to go see neyo at 02 was nice hotel quiet and dlr just 2 second walk away staff were nice and friendly would reccomend", "Date": "March 1, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Newcastle upon Tyne, United Kingdom", "Title": "“Great for the 02”", "Author": "JOANNE028", "ReviewID": "UR125135560", "Content": "I stayed here recently with my partner as we were going to the Brit awards at the 02.. The DLR is an three min walk away from hotel through the excel bridge... The local nisa is opposite which sells everything and does not close till 12 midnight.. The hotel itself has a 24 hour reception and also a 24 hour bar and food(restricted though) which is always manned... The buffet breakfast is only £7.50 each and well worth it .. The hotel rooms were compact but it had a kettle,televison and an hairdyer... Great...plenty of space in the showerarea and also the bed was very comfortable.. The hotel was a great budget 3 star and i only paid £50.00 a night for two midweek.. If you are needing a base down near the 02 this is a great hotel for you all", "Date": "February 24, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Manchester", "Title": "“Great value”", "Author": "Jones_s14 Posted by an Easytobook.com traveler", "ReviewID": "UR124559821", "Content": "Clean, easy to get to, thick walls for a peaceful sleep, helpful staff and everything you could want for a stay at excel / docklands / the capital. The breakfast buffet could be a lot better and the bar area isn't very inviting but otherwise I would recommend it.", "Date": "February 14, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "3.0", "Value": "5", "Sleep Quality": "4", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Cambridge, United Kingdom", "Title": "“The Basic Budget Hotel Ibis Excel Docklands”", "Author": "EmilyAnna1990", "ReviewID": "UR124546832", "Content": "The hotel is located a 5 minute walk from the DLR stop and good value for money . It was an ideal hotel for a concert we were attending at the 02 arena. However please check your travel arrangements prior to going (on a weekend) as on the Sunday the DLR was closed all day so we had to use replacements buses which was a bit of a hassle especially when you have no idea where the buses stop and where you have to go. The lady at reception however did inform us of how we should get to the 02 that evening so they were aware of the situation which was reassuring! We had a room on the 3rd floor over looking the docks which was lovely, the hotel was quiet inside (best to request a room away from the elevators) however you can hear the planes quite clearly as the hotel is situated below its flight path. But by paying next to nothing for the room we weren't entirely bothered! You can also hear everything in the corridor and in the rooms next door - so good luck if you have noisy neighbours! The area itself was really really quiet though.... Rooms are standard - really comfortable bed, tea and coffee facilities, Flat screen TV and a fantastic high pressure shower! Everything was clean and tidy and I couldn't fault it at all. The staff were friendly enough and efficient however we only spoke to them during checking in and checking out - both occasions were speedy. All in all good value for money, if needs be I would stay again (would double check travel arrangements prior to travelling!) however it ticks all the boxes and was a total bargain!", "Date": "February 13, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "southampton", "Title": "“as you would expect”", "Author": "mberry77", "ReviewID": "UR124107921", "Content": "I like this Ibis and stay here often when I work in London. Its near the DLR and is in a quiet area in Docklands by the Excel centre. The rooms are EXACTLY the same as any other Ibis nad sometimes the bathroom is a bit creeky as its all plastic. But the rooms are quiet.", "Date": "February 4, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "3", "Rooms": "3", "Location": "3"}, "AuthorLocation": "London, United Kingdom", "Title": "“Value for money”", "Author": "gorpalm", "ReviewID": "UR124086725", "Content": "Over-nighted here recently on a weekend, paid under £40 for the night and thought it was pretty excellent value. For that money you get a basic room, comfortable bed, aircon/heating, small tv (no freeview!), small but perfectly formed pre-fab bathroom with great water pressure. Not so pleased with the very poor sound insulation between rooms, at one point in the early evening certainly sounded like one of my near neighbours was having very vigorous and angry personal interactions with the furniture in his room. Ate in the restaurant for dinner - pretty authentic tasting curry and reasonable prices means it doesn't feel such a compromise, also London isn't exactly on your doorstep here. Overall (apart from the mercifully short period of excessive noise from the neighbour) it was a pretty decent experience, made even better of course by the low low rate.", "Date": "February 3, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Ipswich, United Kingdom", "Title": "“Good Basic Hotel”", "Author": "RyHol Posted by an Accorhotels.com traveler", "ReviewID": "UR124052935", "Content": "Good Basic Hotel, no luxury, but no complaints. Slightly noisy room (701) next to lift. Not a water view as we had hoped. These are small things however - the stay was pleasant and functional so no real complaints.", "Date": "February 3, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "4"}, "AuthorLocation": "", "Title": "“Good for the 02”", "Author": "Hambrook", "ReviewID": "UR123792431", "Content": "Stayed a night due to going to the o2.Room was very clean and good value and the staff very good. Easy to get to the o2 from the hotel.Would stay again", "Date": "January 29, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "5", "Location": "4", "Rooms": "3"}, "AuthorLocation": "Newcastle upon Tyne, United Kingdom", "Title": "“Basic”", "Author": "MrWorldtravellerJ", "ReviewID": "UR123532183", "Content": "I've stayed 3 times now purely because of the price. It hasn't changed. Still not enough electric sockets in the room, overpriced breakfast and car park is too too expensive.", "Date": "January 24, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "NORWICH NORFOLK ENGLAND", "Title": "“AN EXCELLENT RESULT”", "Author": "Posted by an Accorhotels.com traveler", "ReviewID": "UR123292926", "Content": "A lovely experience was had by both myself and wife. We found the location ideal. The service at reception A1. The cleanliness of the room and that the room was on 7 floor - faltless. We would like to return at some time in the future.", "Date": "January 19, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "3", "Rooms": "4", "Location": "5"}, "AuthorLocation": "NorfolkClare", "Title": "“Just what we needed”", "Author": "NorfolkClare", "ReviewID": "UR123173114", "Content": "We went to the London Boat Show at Excel and stayed at the Ibis. We wanted somewhere clean, nearby and cheap just to lay our heads at the end of a busy day. We were able to park our car in the Novotel/Ibis car park when we arrived and left it there until we left next day for just £15. The hotel was a short walk across the pedestrian area in front of the Excel building and just perfect after a day of walking around the exhibition. We paid £65 for a double en-suite room which was very clean and comfortable. My husband is a light sleeper and had a rough night's sleep as he heard every noise (every time the neighbours flushed their toilets!) but I slept like a log!! Bed was comfortable and room was warm. We didn't stay for breakfast as we had eaten well the night before and didn't want it but it looked good value for money. We ate in the Ibis restaurant in the evening which was not expensive and food was fine - but we did have to wait too long for our meal. People around us were complaining. Staff were very friendly and helpful. We would definitely stay there again for convenience.", "Date": "January 16, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Douglas, United Kingdom", "Title": "“Gymnastics Olympic Test Event London”", "Author": "Posted by an Accorhotels.com traveler", "ReviewID": "UR123146841", "Content": "The hotel was very convenient for the O2 and London City Airport. The hotel was clean and the staff very friendly. We travelled by DLR and the signs from the station were very poor, Luckily I had been to the Excel centre and we walked in that general direction as we knew the the hotel was close to Excel. The hotel was very busy and on our first night 2 of the white wines on offer were out of stock and on the second night the gin ran out. Apart from this our stay was very pleasant and the hotel was clean and friendly.", "Date": "January 16, 2012"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Mumbai", "Title": "“Great hotel, inconvenient location”", "Author": "samirkhare", "ReviewID": "UR123048824", "Content": "The hotel offers fantastic value for money stays. The hotel being a recent construction has very new unused feel to it currently. The rooms are small, as is to be expected from a budget hotel. The wireless connectivity is a challenge in some rooms, so please check that out before accepting the room keys - else you will end up sitting in the lobby with your laptop / ipad. The front desk staff is young, but very enthusiastic and helpful. The hotel location is a bit of an inconvenience as the nearest tube station is about a 3 minute walk (Royal Victoria) and trains from here will involve at least a couple of changes if you want to get to any of the London city major stops. Specially as an international traveller with early morning flights, you may end up shelling something like 70 to 80 pounds for a cab to Heathrow. There is a fair bit of construction going around the hotel on account of the proximity to the 2012 Olympics areas. Not a great choice of eateries around the hotel, so plan a tube trip of at least 1 station (Canning town) to get to good eateries. Though, the walkway next to the hotel on the banks of the river is very serene and is next to the cleaner parts of the Thames.", "Date": "January 14, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Northampton, United Kingdom", "Title": "“Good value hotel”", "Author": "Topcat1980", "ReviewID": "UR122566095", "Content": "I stayed here twice in 2011 with friends when we travelled to London for concerts/events, and would definately go back again. The rooms are clean, and have everything you need for a nights stay. I find the bathrooms a little weird - a bit like staying on a space ship or something, but they are also clean and well appointed. This hotel also seems to have some great rooms for people with special requirements (eg sight/hearing impaired) The downstairs restaurant/bar is reasonably priced for a London hotel, and the food and breakfast is good. The hotel is located in a clean and quiet area of the Docklands, right on the riverbank and a stones throw from the O2 (which is only 2 stops on the DLR/tube) and Canary Wharf. The nearest DLR is approx 2 min walk, and there is a convenience store across the road. If you are after a luxurious, elegant hotel, then don't stay here. If you are after excellent value, a clean room and a good nights sleep then this is the place for you. It's easy to find and now a firm favourite among my group of friends. We will stay here again when we book our next concert", "Date": "January 5, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Location": "3", "Rooms": "3"}, "AuthorLocation": "South Yorkshire", "Title": "“Bargain hotel!”", "Author": "shazkowalski", "ReviewID": "UR122394453", "Content": "Nice hotel with spacious rooms and good location. Five minute walk to the dlr and a lovely bar within the hotel. The breakfast was lovely and very reasonable, all in all we were impressed!", "Date": "January 2, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Northumberland", "Title": "“Lovely clean hotel”", "Author": "Vixen2278", "ReviewID": "UR122362645", "Content": "Stayed here for 2 nights in November 2011 for a Christmas shopping trip. Hotel is close to the DLR and the O2 arena can be seen nearby. The hotel reception is very clean however none of the reception staff spoke good English so a little disappointing. The rooms were very basic with an \"airline\" style bathroom but again very clean. Breakfast was very good and plenty of choice each morning but the food in the restaurant and the bar was poor. The first night I had roast chicken and it was cold in the middle. On the second night we ate in the bar, I had a tuna sarnie and it was so runny I couldnt even taste the tuna!!! Overall I would recommend this as a base for touring London and would probably return but it is not a holiday hotel!", "Date": "January 1, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Belfast, United Kingdom", "Title": "“Value for money”", "Author": "clairebear16", "ReviewID": "UR122174888", "Content": "Myself and my boyfriend stayed at this hotel a few weeks back as we were attending an event at the O2 Arena. We were a few hours early for check-in but didn't want to carry our bags around London all day so thought we would leave them at the hotel. There was actually a room available and we were allowed to check-in early. This was fantastic as we had been travelling for a few hours to get there. It meant we didn't have to go the whole way to the hotel before the concert - we could go straight there from the pub we were in in the city! Staff were extremely helpful and friendly in the hotel. We did not eat there so cannot comment on the food. There were 2 downsides - first, there was a terrible smell coming up through the toilet in the room. We didn't complain as we didn't notice until we were in the room after the concert (too late to do anything about it). We just kept the toilet lid closed and it was ok but it was pretty horrid! Also, a lot of people staying at the hotel that night were at the same concert. We got a taxi back after it so were there early. After about half an hour people started coming in that had taken the train back. There were about 30 /40 very thirsty people at the bar and only one girl to serve them! People were getting very irritated! The girl was fantastic but the hotel should have had more staff available to help out. A manager stood for about 10mins watching her before trying to help serve. Overall this is a great hotel right next to the Excel Centre, a short journey to the O2 and Central London. Rooms were clean and spacious and good value for money.", "Date": "December 28, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "france", "Title": "“excellent rapoprt qualité prix pour londres...”", "Author": "Posted by an Accorhotels.com traveler", "ReviewID": "UR121982467", "Content": "Accueil parfait en français, chambre au top, services et renseignements adequat. Un peu à l'écart du centre vile mais ce n'est pas plus mal. La ligne DLR (RER parisien sans l'odeur mais avec la sécurité, on l'a pris jusqu'à 23h sans pbs!) est à 3 min à pied et 30 min de l'hyper centre avec liaison metro... parfait pour se balader la journée et etre tranquille le soir!", "Date": "December 22, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "3"}, "AuthorLocation": "Northwich", "Title": "“Excellent value, but a little crowded”", "Author": "Posted by an Accorhotels.com traveler", "ReviewID": "UR121925377", "Content": "Although this hotel is some way from central London, the centre is easily reached from the nearby Docklands Light Railway station. Being right neext to the Excel exhibition centre, it has an obvious attraction for people visiting exhibitions. It is a very modern hotel, with free wifi and very comfortable rooms, but the restaurant is far too small to cope with what seemed like hundreds of people all coming down for breakfast at the same time. On the night I stayed, there were several coach parties also staying, and of course they all need to be leaving at the same time, which results in a very crowded restaurant at breakfast time. That apart, the value for money is excellent. It is impossible to find a hotel of this standard anywhere in London for a similar price ( I paid only £49 for my room, which is an absolute bargain). Admittedly that was on a Friday night in mid-December, and it might be a very different price in the middle of a major exhibition, but it is very definitely worth more than £49. 9 out of 10 - only the breakfast crowds cost it the extra point.", "Date": "December 20, 2011"}, {"Ratings": {"Service": "2", "Cleanliness": "1", "Overall": "2.0", "Value": "4", "Sleep Quality": "2", "Rooms": "4", "Location": "2"}, "AuthorLocation": "Manchester", "Title": "“You get what you pay for.”", "Author": "toddy0011 Posted by an Accorhotels.com traveler", "ReviewID": "UR121850148", "Content": "Positives: i) Room only cost me £35. ii) 24 hr bar iii) Room furnishings adequate iv) Nice view over river Negatives: i) Couldn't find my booking in the system, even upon receipt of my booking confirmation email. ii) No soap in bathroom. iii) 2 HUGE hairs in the shower. Horrid. iv) Rock hard bed. v) As it's in the docklands, I would only recommend staying at this hotel if you were visiting the Excel Centre (100m away). Quite a trek into central London.", "Date": "December 18, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Munich", "Title": "“Beats other standard hotels !!”", "Author": "MunichLozz-e", "ReviewID": "UR121731056", "Content": "...by that I mean, it was the first time I stayed at an Ibis and compared to places like Travelodge, Premier Inn, etc it is worth paying the extra pennies for the little extras in this class of hotel. For example, when I stayed here at the beginning of December 2011 I had a room directly opposite the lifts on the second floor. As I soon as I closed my room door, I heard nothing ..no noise at all from the comings/goings in and out of them. Whilst the room carpets are rough and practical, I was impressed with the bathroom/toilet set-up and how it was encased in it's own pod. Was kept clean and felt clean. Additionally, I found the beds to be big enough for a big chap like me and very comfortable indeed. The compact wardrobe/shelf unit in the corner was also very useful. On the downside, I would avoid the breakfasts and also the wifi provider 'orange' whose service whilst I was there was very very poor. There is the option to use the Ibis cabled internet which comes with TV/Film extras but that is more pricey. I didn't use it so I cannot comment on this service. The staff at the bar and reception were friendly and helpful. Both areas can get pretty busy so patience is required. During my stay the whole world seemed to be staying there !!! All in all, I would try Ibis again if I come back to London for business or pleasure.", "Date": "December 14, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Location": "4", "Rooms": "4"}, "AuthorLocation": "", "Title": "“Oh two”", "Author": "martinr56", "ReviewID": "UR121673970", "Content": "Great for O 2 , good advance rate , breakfast best avoided .Friendly, good vfm", "Date": "December 12, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Leuven, Belgium", "Title": "“very good good pric/quality”", "Author": "Posted by an Accorhotels.com traveler", "ReviewID": "UR121649564", "Content": "Next to DLR station, clean room and hotel, fast check-in, good value for money, very quite at night which is a pluspoint. Breakfast in weekends from 0630 till 1200 ! The bar was MUCH to noisy and felt like a local town pub...", "Date": "December 12, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Bradford, United Kingdom", "Title": "“london trip”", "Author": "buster311960 Posted by an Accorhotels.com traveler", "ReviewID": "UR121525855", "Content": "Ideal location right next to EXCEL and train station. Very easy to travel into city centre. The rooms were clean and spacious and the memory matress ensured a good night sleep. Would recommend the buffet breakfast. We had drinks at the bar and and a meal and the price was very reasonable. The only downside was paying £15 to park at the Novotel next door. All in all though very good value for money. Would stay again.", "Date": "December 8, 2011"}, {"Ratings": {"Overall": "1.0"}, "AuthorLocation": "Norwich", "Title": "“Not a pleasant experiance”", "Author": "Woody023", "ReviewID": "UR121510959", "Content": "I had booked this hotel in August for a on night stay on th 22nd of November 2011.We arrived at the hotel at 1230hrs but was informed that our room would not be ready until 1330hrs.We asked if we could leave our case and check in about midnight after attending a concert at the Royal Albert Hall.This was agreed and the receptionist reassured us that our room would be waiting for us.We arrived back at the hotel just gone midnight.The receptionist fetched our case.I gave our booking details and was informed that we were not booked in to stay at the hotel even though I had a copy of the booking confirmation which I gave to the receptionist.He then looked at the reservation system tand informed me that the booking had been cancelled at 1530hrs that day.We were very angry at this and was also informed that the hotel was full.They did manage to get us another room in another hotel but that was not the point.Whilst we were waiting at the desk for this to be sorted another customer came in to be informed that the same thing has happened to him.I have written a complaint but to date (8th December 2011)no responce.I have written again twodays ago and still no responce.Needless to say I will not be using Ibis Hotels again which I have used many times in the past both in this country and abroad.", "Date": "December 8, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "4", "Rooms": "5"}, "AuthorLocation": "Grande Riviere Sud Est", "Title": "“Bargain for 02 stay”", "Author": "IcecoldPinacolada", "ReviewID": "UR121399383", "Content": "Second time we have used this hotel for a trip to the 02 arena. Just £59 for the room. Clean, friendly staff and good brekky. One stop up the jubilee line then one stop along the dlr and your back from the 02. Brilliant!!!", "Date": "December 4, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "cotswolds", "Title": "“perfect for the Excel”", "Author": "lmg1358 Posted by an Accorhotels.com traveler", "ReviewID": "UR121244161", "Content": "This hotel is an ideal budget hotel for the excel, also good for the 02.The staff were very helpful and courteous, at the reception, bar and restaurant. The drinks were well proiced for London not to steep. Tea and coffee and hairdryers in the rooms, but only a shower towel each, no hand towel, only a little thing but one that you get used to. You only have to turn right out of the hotel and you are just a few minutes walk from the Excel centre, also the tube is only a short walk away in the other direction. There are two convenience shops just up the road, very handy if you've forgotten anything.", "Date": "November 30, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "", "Title": "“Excellence on a budget”", "Author": "CMacLaw", "ReviewID": "UR121215342", "Content": "The Ibis ExCeL is as it says, budget, but I have stayed in a range of hotels from budget to 5*, and this is by far the best budget hotel I have stayed in, it is on par with the Premier Inn hotels which are of course, an above budget brand. The location is great, with the DLR a couple of minutes walk and convenience stores across the road. The service is always friendly and available 24/7. The rooms are basic but quite spacious and have a kettle and TV, enough to suit your room needs. Having given the thumbs up for service and location, I'm afraid the same can't be said for the dinning experience, the food is below par, even if it is budget it should be of higher quality than it it is, it's also over priced for a budget hotel, but don't let this put you off the hotel itself, there are a few good places to eat and drink locally, and a short journey on the DLR will open up more possibilities, for a good local restaurant/bar try the Fox@ExCeL. So to sum up, great hotel, great location, great service, just chose your dinning experience carefully.", "Date": "November 29, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Stoke on Trent", "Title": "“Excellent for the ExCeL”", "Author": "JK_LoveTravelling", "ReviewID": "UR121211791", "Content": "We chose this hotel as we were going to the Top Gear Live event at the ExCeL. So glad we did. It is literally less than a 2 minute walk to the exhibition centre. Right by the Thames and we had a view over the river and the O2 arena - looks brilliant at night when lit up. Talking of the room, it was not the biggest of hotel rooms but it was clean and warm, the bathroom had quite a big shower for a hotel and the bed was really comfortable. Buffet breakfats was reasonably priced and plenty of choice. The DLR station is a 5 min stroll away and you are in the centre of the city in 20-30 mins. If you are going to the ExCeL, no better hotel for the price.", "Date": "November 29, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "3", "Overall": "3.0", "Value": "4", "Location": "5", "Rooms": "3"}, "AuthorLocation": "Cape Town Central, South Africa", "Title": "“Good value combined with excellent Excel location”", "Author": "JanaWilliams", "ReviewID": "UR121115563", "Content": "Absolute excellent location for visitors of Excel. typical Ibis rooms. No frills but clean and practical.", "Date": "November 28, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Elgin, United Kingdom", "Title": "“Value for London”", "Author": "forest04", "ReviewID": "UR121047197", "Content": "This is a budget hotel, so the rooms were small but adequate as a sleeping place as we were out all day. Reception very helpful about transport links and taxi service. The room was very quiet and beds comfortable. Storage space limited but adequate for a few nights. Everything compact like a caravan. Shower was great, the easiest power shower to operate that I have experienced. Transport to 02 was easy, 1 stop on DLR (station nearby) and then 1 stop on tube.", "Date": "November 26, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "2.0", "Value": "4", "Sleep Quality": "4", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Leeds, United Kingdom", "Title": "“Food poisoning so beware!”", "Author": "186411Hubbyandme", "ReviewID": "UR120951082", "Content": "First of all will start with the positives - good location, clean (but small) room, good for what we paid (£59.00 for 2 people), friendly (but hard to communicate with due to the language barrier) staff as they were all foreign which I am not slating but they only seemed to say a scripted language to us and when asked for further info they did not seem to understand! Now onto the negatives: warm room - turned down the temperature on the thermastat to no avail. We decided to eat in the restaurant that evening as it seemed reasonably priced. My fish platter was OK although the tuna was hard and rubbery. The potato rosti most definitely from a packet. I had to opt for the fish platter after they said they had no lasagna left. My hubby had chicken. After eating some of it he realised that something was wrong with it, it was very dry and looked to have been simply reheated, so he refrained from eating it. The waitress collected our plates & never asked what was wrong. Lo and behold he came down with food poisoning! Awful way to end our trip! They did recompensate us by letting us off the food bill, but still...! Shocking!", "Date": "November 23, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "3.0", "Value": "4", "Sleep Quality": "3", "Rooms": "4", "Location": "4"}, "AuthorLocation": "London, United Kingdom", "Title": "“not bad”", "Author": "Me137", "ReviewID": "UR120929901", "Content": "Great view on the river was the best attidute of this hotel. Room was clean and of reasonable size with everything what I needed, but old. I did not like the bathroom which, although was clean, looked like bathroom on the ship, which is not pretty. If you like to sleep longer, it is not possible here, as the city airport is very close. In general it is a good value for money chain hotel in convenient localization for canary wharf or O2 but nothing special, just one of the ibis hotels.", "Date": "November 22, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "3", "Rooms": "2", "Location": "1"}, "AuthorLocation": "Portsmouth, United Kingdom", "Title": "“not recommended when DLR has engineering works!!”", "Author": "Posted by an Accorhotels.com traveler", "ReviewID": "UR120771948", "Content": "Hotel itself is fine, a bit tatty and showing age, but its good enough and reasonably priced. The food in the restaurant was ok. Staff very helpful and friendly. Noisy corridors at night slightly hindered a peaceful night but thats expected in such a huge hotel. Check in was slow.", "Date": "November 19, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "3.0", "Value": "3", "Location": "3", "Rooms": "3"}, "AuthorLocation": "UK", "Title": "“Ok budget hotel for the ExCel or O2”", "Author": "Chris H", "ReviewID": "UR120757785", "Content": "New and clean, but basic and a bit sterile. Great location for the ExCel and ok for the O2 but don't stay here otherwise; the surrounding area is like a ghost town. Below average breakfast especially the quality of the sausages, but acceptable for a short stay. Nothing amazing but fine if you pay a cheap rate by booking in advance. However, £295 for 2 nights was ridiculous for this standard of hotel even when there is an event on the ExCel; luckily work were paying because I would never consider an ibis at these prices in a million years. Overall, the definition of 'average'.", "Date": "November 18, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "HINCKLEY", "Title": "“ON THE WAY TO WEMBLEY”", "Author": "ortontrain Posted by an Accorhotels.com traveler", "ReviewID": "UR120745895", "Content": "Just back from a 3 night break at the Ibis in the Docklands, ideal location away from the hussle and bussle of Central London, great transport links to and from the hotel, hotel near to Royal Victoria and Custom House stations on the DLR and close to Canning Town for the Jubilee Line. A clean hotel with a good stocked Bar and surprisingly good prices for a London Hotel. Breakfast was a breeze no hold ups give you plenty of time to have your Meal and for the cost good value for money. A good standard Hotel that gives value for all tastes and budgets.", "Date": "November 18, 2011"}, {"Ratings": {"Service": "2", "Cleanliness": "5", "Overall": "3.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Geneva, Switzerland", "Title": "“Service went down”", "Author": "Posted by an Accorhotels.com traveler", "ReviewID": "UR120665348", "Content": "I saty in Ibis a lot but this time the food and drinks service were awful, my food was served completely burnt. when I showed this there was no response to change or address the situation. Again the breakfast food tasted worse, perhaps the cook was on holiday or something went bad in the kitchen. other aspects were fine.", "Date": "November 16, 2011"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "2"}, "AuthorLocation": "Pushkar, India", "Title": "“A Total Mismatch.....”", "Author": "Anshul-Bhargava", "ReviewID": "UR120621883", "Content": "I stayed during the World Travel mart at the resort and found that the resort is not only over priced but also hiding a lot of truth from the guest. 1. the rate give to us was over 180 Pounds per night where as the board right at the back reads 69 pounds per room for 2 people. When asked they said its the starting price and there rate was 180 pounds. Accepted and well taken. 2. The rate did not have breakfast in it. Surprised to the core. 3. There was one Still water bottle and one Bottle water provided for 2 people for a stay of 3 nights, and when we extended the stay for 2 more night there was still no water provided. Even after asking they said its there policy of 2 bottle per stay. 4. Keys never worked, even after keeping them absolutely separately from the mobile. Always had to go down to ask for the key. 5. The TV Channel were a bare minimum of 15-16 and all news channels, we were told that if we want satellite tv we have to pay 10 pounds which was a rip off as we did not find any new channels added to the score and only the movies were free after paying 10 pounds. 6. Rooms are extremely small, it think like 180 sq ft so there is no place to keep luggage. 7. The AC was not working and we were told that its winter and the heater is working now, the blankets were thick which are perfect for good winter but then we had to keep the windows open all the time to have fresh air. 8. Only Location is good right next to Excel this is it.", "Date": "November 15, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Farnham, United Kingdom", "Title": "“What a view!”", "Author": "kesfarnham", "ReviewID": "UR120522272", "Content": "Managed to get a room for under £100 and I was so impressed. Outside my window just a few meters away was the river - it really made you feel like you were on holiday overlooking the flowing waters (even though I was only on a business trip). The restaurant food was nice - the menu not very extensive but tasty all the same, and the staff were very friendly. The room itself was one of the best I'd stayed in for the price. The bed had a memory foam mattress which I've never experienced before, and I will now go and buy one, it was wonderful. The bathroom was an enclosed large cubicle, and the shower inside was huge, and all very nice and clean. Would highly recommend this hotel.", "Date": "November 13, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "poole, UK", "Title": "“not luxury but clean and tidy”", "Author": "pooleamigos", "ReviewID": "UR120376529", "Content": "Went recently to this hotel recently (as a family of 3) and found the place to be very clean and furnished to a good standard throughout. The rooms were fairly basic but comfortable. The hotel is easy to get to via the DLR (Customs House). The staff were very friendly and extremely helpful at all times and if we had an issue with anything it would be dealt with immediately. One word of advice - it is worth calling the hotel the week before you stay and try to get a room with a view of the dock. The only drawback with this is that the hotel is on the direct flight path for London City Airport, so beware of some noise from aircraft!! My daughter was delighted as she enjoyed watching the planes go past!! The local area is pleasant and is ideal for the Excell centre. Travelling time to central London was about 30 minutes. We did not use the restaurant at the hotel but it seemed to be busy at breakfast times. There is a convenience store over the road which we found useful. All in all a very nice stay and we would have no hesitation in returning.", "Date": "November 9, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Jersey, United Kingdom", "Title": "“Exam Trip”", "Author": "Posted by an Accorhotels.com traveler", "ReviewID": "UR120317123", "Content": "Really good hotel; Easy access from London City Airport, and so handy for the Docklands Light Railway. Took us 15minutes to Central London. Very busy, but staff still had time to deal with us in a calm and courteous manner. So all round thumbs up.", "Date": "November 8, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "3.0", "Value": "4", "Sleep Quality": "3", "Rooms": "3", "Location": "2"}, "AuthorLocation": "London, United Kingdom", "Title": "“Simple and friendly”", "Author": "Posted by an Accorhotels.com traveler", "ReviewID": "UR120273782", "Content": "Friendly staff. Clean basic room. Bit far out of central London. But 30 mins on the DLR is better than some dirty little non chain 'hotels' in west London that charge more for a box room. Good price. Would stay again and recommend for friends. Be aware if something is on at the Excel the prices increase considerably, only value for money if you stay when an exhibition is not on.", "Date": "November 7, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Location": "5", "Rooms": "4"}, "AuthorLocation": "London, United Kingdom", "Title": "“Great for excel”", "Author": "arch_82", "ReviewID": "UR119981323", "Content": "This is a perfect hotel for a business trip if you are at the excel centre. Rooms are clean, breakfast is big (basic but pleasant), and staff are friendly. Good storage for bags and other bits for after checkout. This is only really good if you are working/visiting at the Excel centre. Not good if you are visiting London- just too far to get back at night. Best to stop somewhere more central.", "Date": "October 31, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Bournemouth, United Kingdom", "Title": "“Affordable for a trip to the O2 arena...”", "Author": "Alice T", "ReviewID": "UR119962896", "Content": "Stayed here after going to a concert at the O2 not the nearest but cheaper than all the hotels that I looked at and only two underground stops away from the arena with one change so very easy to get to and from . Staff were very polite and the room was very clean with a lovely view. Only advice bring your own biscuits haha!! Me and my friend were most disappointed that there were none available to buy at the hotel to go with our late night tea and all the shops were shut by this time :D . We didn't have the breakfast so can't really comment .", "Date": "October 31, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Vienna", "Title": "“Nice hotel but bad on overbooking”", "Author": "Posted by an Accorhotels.com traveler", "ReviewID": "UR119892790", "Content": "Hotel was ovebooked, so I was moved to Novotel for one night. They thought that they would to me a favor, but I had to move twice - which cost me a few hours and my wife was wailing all the time. If you want to be close to EXCEL convention center, THIS is the place to be...rooms are nice, standard IBIS as I always say.", "Date": "October 30, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Location": "4", "Rooms": "4"}, "AuthorLocation": "Weymouth", "Title": "“Clean, functional and cost effective!”", "Author": "georgedubi", "ReviewID": "UR119834277", "Content": "Ideally placed for the excel and O2 arena, great travel connections via DLR. Reception was busy with a moderate wait to book in. The room was compact but clean with an excellently equipped ensuit. Breakfast was £7.50 and buffet style. Kept us fed for the day. To sum up, economical and functional. Car parking also available although small and on a first come basis.", "Date": "October 28, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Ghent", "Title": "“With a good offer, good value”", "Author": "Mark_Daemen", "ReviewID": "UR119766589", "Content": "We had a very good offer on laterooms.com when booking 2 weeks beforehand. We came to London for a little site-seeing (enjoyed Brick Lane and Gehrard Richter in Tate Modern) and the NFL-game at Wembley. It's a half an hour trip away from the center in peak-time as DLR station is nearby. We parked the car in next door Novotelparking (15£/day). It's a typical chain hotel with Ibis standards. We had a clean room with convenient bed. Breakfast was also very good for what we paid when booking on laterooms. Would not go there for full price but with a good offer very ok.", "Date": "October 26, 2011"}, {"Ratings": {"Service": "2", "Cleanliness": "2", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "1"}, "AuthorLocation": "Telford, United Kingdom", "Title": "“Basic”", "Author": "Andrea P", "ReviewID": "UR119563576", "Content": "I recently attended a conference in Docklands and was booked into the Ibis Excel. At £163 per night this was highly over priced. The receptionist spoke very little English and had difficulty reading English too, and at one point I was concerned that I would not be able to book in. My room was basic beyond belief, with a nylon carpet which was grubby, a bed more like a slab of concrete and brick like pillows. A plastic chair, not a single draw anywhere and the totally basic bathroom forming a plastic pod in the corner of the room. The toilet didn't always flush properly, the sink took ages to drain and the shower consisted of a shower head hooked on the wall. No products. Towels were old and slightly grey, no large bath towel, just two hand towels. No litter bin in the bedroom. TV was okay and there was tea and coffee in the room. Breakfast was okay, but not fabulous. Not good value for money, and did not provide any sense of comfort. Lots of people saying the same thing. At the conference the hotel was nicknamed Stalag 13!! A rip off. Came away with quite a few GED bug bites!!", "Date": "October 21, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "3", "Overall": "1.0", "Value": "1", "Sleep Quality": "3", "Rooms": "3", "Location": "5"}, "AuthorLocation": "", "Title": "“The worst hotel we've ever stayed in!”", "Author": "AnneW4", "ReviewID": "UR119552793", "Content": "Having stayed in hotels the world over this is the worst we have ever had the misfortune to be booked into. The reception staff were very slow and some did not speak English at all well. We constantly had to have our room keys recoded and because of the staff this took ages which was very annoying. The bar was sometimes staffed by one person who was also the receptionist and running both at the same time. They had no bar experience and therefore no idea what they were doing. One of the staff didn't speak English at all. The hot breakfast was utterly tasteless and inedible and served on tiny plates. How you can make sausages and scrambled egg taste so bland is a mystery. Have the cold buffet which is better. The room we stayed in was very small and only functional for a very short stay. The shower was nice but there was no bath. A dangerous and annoying point is that at the doorway to the room there is a lip of about 2 inches which you will trip over each time you enter. It is well placed for the Excel Centre but I wouldn't stay there again when there are so many other better run hotels nearby. Avoid!!", "Date": "October 21, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "2", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "3"}, "AuthorLocation": "Omagh", "Title": "“Disgracefull hotel”", "Author": "Posted by an Accorhotels.com traveler", "ReviewID": "UR119511645", "Content": "For a hotel based beside a large exhabition center they should be used to high volumes of people. The Bar ran out of glasses on both nights they advertise a 24 hour food service but don't ask for anything after 12. staff we ploding about like the did not want to be there. The bed mattressess were thin and unconfirtable, we booked a double room but were given a twin and told there were no doubles available.", "Date": "October 20, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Berne", "Title": "“Convenient and comfortable”", "Author": "HectorFromBerne", "ReviewID": "UR118543203", "Content": "A good value hotel in a very pleasant environment - the Docklands are attractive, and the DLR gives good access to the city and to the Stratford/Leyton area, and onwards to the main underground network. Location good, facilities standard Ibis: clean and functional. Recommended.", "Date": "September 24, 2011"}, {"Ratings": {"Location": "5", "Overall": "5.0", "Value": "5", "Service": "5", "Rooms": "5"}, "AuthorLocation": "Ireland", "Title": "“Excellent value for money, nice location close to city and airport”", "Author": "paulhaych", "ReviewID": "UR118201898", "Content": "Stayed here for one night with a friend as we had a flight from London City Airport early the next morning. We paid €41 for a twin room for one night. The hotel was modern and clean and the location was excellent and the staff were all very friendly. The room was spacious, modern and clean and came with LCD TV, Kettle with tea/coffee and wifi was available to purchase. The hotel was very close to the airport which was perfect for us and only a short DLR and tube ride from the city. Check In wasn't until 2pm but we arrived at 11am and we were able to check in early. There is also a 24 hour bar which serves hot food/ snacks and was reasonably priced. The lounge area was also very modern and comfortable. There are also 3 lifts in the hotel. Overall I had a pleasant experience at this hotel and will stay here again the next time i visit London.", "Date": "September 16, 2011"}, {"Ratings": {"Service": "2", "Cleanliness": "2", "Overall": "1.0", "Value": "3", "Sleep Quality": "2", "Rooms": "2", "Location": "4"}, "AuthorLocation": "Manchester", "Title": "“IBIS Excel, London Docklands”", "Author": "Posted by an Accorhotels.com traveler", "ReviewID": "UR118102397", "Content": "Whilst this is a well located hotel next to The Excel Centre in London, in the IBIS group, it is very busy and therefore service is less than I have come to expect with IBIS. My room was the usual IBIS size and had the usual facilities, but the cleanliness was below par with a distinct lack of supervision of room staff (carpet was not cleaned in the entire 5 day stay). The breakfast buffet was clearly understaffed, with food items continually running out and several being unavailable for several days at all. The reception area was small and noisy, and the check in was very slow. And the keys failed on 2 days, necessitating a return to reception from the 7th floor to rectify the problem. I feel the hotel needs to increase the staff at peak times, to bring this hotel up to the standard one expects of IBIS.", "Date": "September 14, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "3"}, "AuthorLocation": "Cheltenham, United Kingdom", "Title": "“A good place to stay”", "Author": "Posted by an Accorhotels.com traveler", "ReviewID": "UR117863487", "Content": "Although there were not toiletries in the bathroom, everything was perfect. The staff were very friendly and the hotel is just a short walk from Royal Victoria DLR Station. There are two shops close to the hotel and so I am sure that you could buy anything that you needed in one of them.", "Date": "September 9, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Wigan, United Kingdom", "Title": "“Clean & Modern in a quiet location”", "Author": "cgandps", "ReviewID": "UR117737580", "Content": "Suberb location, conveniently located a couple of minutes walk from the DLR line. Very easy to access central London. Our room had a great view overlooking the river. Parking is shared with the hotel next door and costs £15 a night. We left the car parked up, as it wasn't clear how we could get it out without paying twice. Overall service in the hotel was good. We needed extra pillows, as 1 thin one each wasn't sufficient. They were quick to help, and bring us more. Breakfast buffet available until 10am both hot and continental. I recommend going early, as the negative point I have is the staff wouldn't replenish hot items after 9:30. I think they could have been more accommodating with this. We would definately go back though, as the location is great.", "Date": "September 6, 2011"}, {"Ratings": {"Cleanliness": "1", "Sleep Quality": "2", "Overall": "2.0", "Value": "1", "Service": "1"}, "AuthorLocation": "Bucharest", "Title": "“2* experience”", "Author": "NicoletaG", "ReviewID": "UR117608677", "Content": "One of the poor choices for visiting London. Far from the center (it takes about 1 hour and switching from DLR to the tube or bus) the Ibis does not live up to the International standards of a 3* hotel. The bathrooms are built in (oddly I might add) with the shower cabin, otherwise pretty good size showers, but since this is a close by the Thames river hotel you can smell it though the drains. Of course the fact that the housekeeping is not doing their job helps a lot too. And not that I didn't announce the front desk about it, because I did, twice, and that's how many times in a week the room got cleaned. Except that, I did get the bed folded. And that's that. For those travelling from outside of UK no matter what you are told, watch out for the payments done. The pre-authorisation in UK will block the money in the account and the seller is allowed to take those at any point within the 30 days. So unless you want to get double charged I strongly suggest you pay when you get there. Our luck was that one of the managers did know that had happened in other cases with visitors from outside of UK and did not charge us twice (Selene thank you - I have to say she was the only one trained for the job, the other front desk attenders knew only the speech to be told). The closet is small and oddly shaped as well, barely room to put clothes for a couple of people staying in for a few days. The noise level is ok, excepting the planes - watch out the London City Airport is too close and has quite a bit of traffic. The positioning of the room may help some but not too much. Overall it was an overpriced hotel for the services rendered. The Breakfast is expensive good thing it's not included, you can manage to eat somewhere else or grab a sandwich on the way. Two supermarkets are close by, Nisa and Spar, strongly suggest the Spar which is further but cheaper plus they do have better offers. Don't forget to get a plug adaptor, UK's are different then the rest of the European's.", "Date": "September 3, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Location": "4", "Rooms": "3"}, "AuthorLocation": "WEST YORKSHIRE", "Title": "“Ibis does good again!”", "Author": "PCEFLECFLN", "ReviewID": "UR117297669", "Content": "I have stayed here 4 times now. This time I stayed with my two 14yr olds. As always the reception we received upon arriving was friendly and warm. The reception area was clean, brightly lit and the check in was quick with only a brief wait. My room was very clean as was the bathroom. The restaurant provided a very good breakfast each morning and we ate in the restaurant on the third evening and found the service quick and good value for money. This is not a luxury hotel but if you are looking for somewhere with good transport links to the city, friendly service, clean and welcoming this would be a great place to try.", "Date": "August 26, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "3.0", "Value": "3", "Service": "4"}, "AuthorLocation": "Copenhagen, Denmark", "Title": "“Nice budget accomodation in the Docklands”", "Author": "NiclasAa", "ReviewID": "UR117018631", "Content": "The hotel shares a rather huge building just of the river Thames, next to ExCel, with the Novotel Hotel. Probably not that weird considering they are both Accor Hotels and are aimed at different kinds og guests, with Ibis offering no frills, budget accomodation. The hotel is very easy to find from the nearby DLR station. When I entered the lobby I was met by quite a lot of noice from the bar which is located in the same area and was very crowded this evening. The line to the reception desk wasn't very long and in no time I was greeted by a smiling, friendly staff member who quickly had every sorted and handed me my keycard for my 3rd floor room. The room was very clean and had a clean, well sized bathroom with quite a big shower. The bed was comfortable and was big enough for two adults as well. The room also had a desk which was ideal for your laptop and doing a bit of work or planning your next day in the metropol. WiFi is available and there was a 24 hours package on offer, which included some extras as well, that will set you back 9.99 GBP. You can also get a 24 hour access directly on your laptop from Orange for 9.90 EUR without the extras. WiFi worked well in my room and the speed was very good andc even worked well for streaming movies. The TV in the room was quite small and had very few channels on it, so if you need lots of in room entertainment you should either bring a USB receiver for your laptop, buy the Wifi + extras package or choose a different hotel. The room had one window, which can be opened a fair bit. The room also had air condition which worked very well. The hotel i situated close to London City Airport and during the day there can be some noice from planes flying low above the hotel. I never heard any noice during night or early morning and with the window closed the noise level was indeed very acceptable. All in I had a very nice stay. Staff was friendly throughout my stay and facilities were what you'd expect of a reasonable budget hotel. It is the perfect spot for going to ExCel, only 200-300 meters from the hotels entrance. The locations is also good if you want some good but not too expensive and too crammed accomodation for a visit to London. DLR will take you to central London and to Underground stations in 10-15 minutes. I wouldn't mind staying here again if I need accomodation in east London or just need some low cost accomodation for my next London stay.", "Date": "August 21, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "London", "Title": "“Impressed”", "Author": "GeorgeIII", "ReviewID": "UR117017951", "Content": "This was the first time I've ever stayed at a so-called 'budget' hotel and I have to say I was very impressed. The public areas were very clean and kept tidy, the rooms were small but adequate and again very clean. I would certainly have no hesitation in staying here again - if necessary! I have to say there is nothing to do near-by but I suppose it is convienient for those wishing to travel into central London. We were staying as a friend was having their birthday celebration in the Fox@excel a minutes walk away - so the location was perfect for us. All in all a good experience staying here and I would certainly recommend it.", "Date": "August 21, 2011"}, {"Ratings": {"Service": "2", "Cleanliness": "4", "Overall": "3.0", "Value": "2", "Sleep Quality": "2", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Remich, Luxembourg", "Title": "“Trip to London Excel”", "Author": "MarcusMis Posted by an Accorhotels.com traveler", "ReviewID": "UR116455941", "Content": "An unusual Hotel, with a pleasant location, albeit in the docklands area of London. This hotel is based at the core of another of the Accor chain hotels, the other higher level one has the exterior views over the Excel dock waters, hence the additional cost of rooms. The DLR is only a short walk away, so is good for public transport access to the UK Capital. Reception in the Ibis Excel was a little unreliable, we stayed there for a total of 4 days, on two bookings, but getting the staff to understand the fact that these were consecutive, and that I had actually booked breakfast too was almost impossible, needing daily maintenance with them. The rooms are large, but with a small version of the modern style of bathroom/toilet combo - this could have been larger, as there was some wasted space in the room. The breakfast was a lowish level, the scrambled egg had virtually no taste. Given the location, they probably have a captive audience for this, I'd certainly not pay full price for their breakfast, as with most IBIS, they want just too much. Overall we found it not a bad hotel and will stay there again, but I still have no invoice for my stay, as when booking out I was told I had a two day booking nothing more, and had had enough of explanations to the young staff.", "Date": "August 9, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "4.0", "Value": "5", "Service": "5"}, "AuthorLocation": "UK", "Title": "“Great value”", "Author": "manujames", "ReviewID": "UR116353222", "Content": "Hotel was clean and fairly modern. Rooms were great, plenty of space. Bathrooms especially clean and modern. Reception staff helpful and friendly. Amazing value for money. Location just 5mins walk from the DLR so tubes into London simple. Hotel overlooks the water so nice views. Only one small gripe was the breakfast was not up to the same standard as the rest of the hotel. More choices and healthy options required please. Other than that it was fine. Will definitely use again.", "Date": "August 6, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "4"}, "AuthorLocation": "Norfolk", "Title": "“Excellent stay, easy to reach”", "Author": "iloveswitzerland0", "ReviewID": "UR116327864", "Content": "Pot luck late booking for myself, daughter and grandson. Very easy to find via Docklands Light Railway, Bank, change at Canning Town, off at Excel. 5 minute walk across lovely concourse to hotel. Good reception, room was excellent, sofa bed that was a real sofa bed, comfortable. Nice bathroom. Excellent buffet breakfast the next morning. One of our better London stays. Would not hesitate to recommend.", "Date": "August 6, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Newcastle under Lyme", "Title": "“Ibis docklands”", "Author": "Posted by an Accorhotels.com traveler", "ReviewID": "UR116053300", "Content": "No fuss, non intrusive, friendly and in the main efficient staff. Rooms are clean and cater for most requirements. Easy access to local bus and rail services. A number of local restaurants. Pleasant and interesting views over the docklands and to some of Londons' landmarks. Even enjoyed the aircraft flying into London City Airport.", "Date": "July 31, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "2", "Overall": "2.0", "Value": "3", "Service": "1"}, "AuthorLocation": "surrey", "Title": "“What you would expect for the money”", "Author": "ArnoldSurrey", "ReviewID": "UR115949600", "Content": "We stayed in this hotel for one night when attending a Neil Diamond concert at the O2. It's \"ok\". Pluses= fast efficient check in, Clean room. TV plus remote that worked! Very near to transport links. Area quiet (at the time we stayed) Minuses= no one running the bar (gave up and went elsewhere hence rating) Bed rather hard. Very few flat hard pillows. A bit of a wait to check out. Having said all that - it was a reasonable rate for London but be aware it's a bit of a trek if you want the London highlights.", "Date": "July 29, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "3", "Overall": "3.0", "Value": "3", "Service": "5"}, "AuthorLocation": "Cambridgeshire", "Title": "“Basic hotel”", "Author": "Maginot26", "ReviewID": "UR115490892", "Content": "Ease to get to Very good accessibility by car, no need to go on M25 if travelling from M11! Check-in Quick and efficient Room On 6th floor, room facing court yard. Was very basic, towels no bigger than hand towels. If staying in Ibis again will have to bring own towels. No bath in room, although shower was a good size and strong water flow. Single bar of soap and liquid soap in shower for the extent of toiletries. Bed comfortable and good size. Nice sized flat screen tv above bed. Walls thin and noise easily audible. Breakfast Very poor breakfast, sausage, scrambled egg, sausages and beans the extent of cooked breakfast. Toaster broken, but the only one in the hotel, so no toast. Very disappointing! Only saving grace was free newspapers, mail, times, independent etc and nice coffee machine. Amenities Parking is available at the Novotel next door. Remember to get ticket validated at reception and then take to Novotel to pay £15 instead of £30 for non guests having an overnight stay. Tube DLR is across the road from the hotel, however works were going on and so an expensive taxi ride to and from centre of London. We paid £25 for one way journey to Covent Garden. Bar and restaurant is also available at the hotel. Internet is available for a fee. Hotel Generally an okay 3* hotel if you can get a good price and tube is working. Staff are friendly and efficient and rooms were clean. However one bugbear, was the fact someone ordered food in their room the night before, they left their food out in the corridor and this was still not removed until 11am the following day and this made the corridor smell.", "Date": "July 18, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "3", "Overall": "3.0", "Value": "3", "Service": "3"}, "AuthorLocation": "Aberdeen, United Kingdom", "Title": "“Very cheap but too far away”", "Author": "flyingscot1982", "ReviewID": "UR115376488", "Content": "Got a good deal on this hotel. Normailly try and stay fairly central but thought we'd give this a try. Extremely basic hotel and very little in the way of amenities in the room. Had to ask for a hairdrier but would have been better getting an asthmatic to blow on year it was so rubbish. Also, realised there was no iron in room so asked for one but told we had to go to small room on one of the other floor. Really inconvenient and iron was rubbish - for being a business hotel it doesn't really cater for business people who i'd assume would want to iron shirts etc. Last - as we were on london on holiday Docklands was just too far away from the centre. It took best part of an hour to get into london every day and the same home which curtailed our enjoyment a little. Also, no DLR service at weekends so had to get bus to nearest tube station. This hotel is fine if you just want somewhere clean and very basic to stay if you're in the area on business but i definately wouldn't recommend for holidays.", "Date": "July 15, 2011"}, {"Ratings": {"Overall": "2.0"}, "AuthorLocation": "London", "Title": "“Ibis London Excel-Docklands”", "Author": "Posted by an Accorhotels.com traveler", "ReviewID": "UR115352499", "Content": "Don't expect much from a hotel like this, quick stop over for an early Monday morning flight. However, there are two things which are important - comfortable bed and decent shower. Bed had a plastic undersheet and was really uncomfortable Shower was running hot and cold", "Date": "July 14, 2011"}, {"Ratings": {"Service": "2", "Cleanliness": "5", "Overall": "3.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "2"}, "AuthorLocation": "newcastle", "Title": "“stay in london”", "Author": "DouganNewcastle Posted by an Accorhotels.com traveler", "ReviewID": "UR114891861", "Content": "The hotel was clean and welcoming. Although I waited twenty five minutes at the reception on arrival before someone came to assist me and despite two workers passing by , both choose to ask me if they could be of any assistance. The DLR was cancelled the weekend that I arrived so my journey from central London was a nightmare ( taking two hours in total) The hotel states it is near to O2 but actually a cab cost me £18 to get there, and £22 to return after the event.", "Date": "June 30, 2011"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Billingham, Stockton on Tees", "Title": "“Ideal For O2”", "Author": "LadyJayneG", "ReviewID": "UR114828367", "Content": "Booked the hotel as a last minute choice for a trip to the o2. Although not ideal if you're thinking of doing the typical tourism stuff in central London, its absolutely great if your itinary revolves around something happening at the o2. Yes its a budget hotel but its clean, the bed was really comfortable and the shower was great. I wouldnt hesitate to recommend it to anyone looking to book something in that part of London. One downside was that on the weekend we visited, several DLR stations were closed for engineering work which meant replacement buses. Not great on the hottest weekend of the year! My guess would be that as the Olympics approach, that engineering work will become more and more frequent so if buses arent your thing, it might be worth investigation before you book this location.", "Date": "June 28, 2011"}, {"Ratings": {"Cleanliness": "2", "Sleep Quality": "3", "Overall": "2.0", "Value": "3", "Service": "2"}, "AuthorLocation": "Brighton, United Kingdom", "Title": "“I wouldn't recommend it”", "Author": "1elou", "ReviewID": "UR114483357", "Content": "I stayed only one night for a weekend leisure trip at London and wanted something good but not overpriced. Maybe the service was fair for the price but honestly it was the worst hotel choice I have ever made and I wouldn't suggest it. First of all the location is not convenient if you want to do some sightseeing, especially due to maintenance works to DLR at weekends (the underground line that serves this hotel) that means a lot of discomfort regarding transportation. Second, a really bad behavior was about an offer that they refused to provide. In the hotel website there is the statement 'AS AN ISIC CARDHOLDER YOU WILL RECEIVE A FREE BREAKFAST AT ibis' but when I asked they refused. About the room, the view was a wall. Regarding the bathroom amenities, there was only one bath towel and no hand towel. When I called the reception to provide me one towel, they asked me to go downstairs to the reception and collect them myself! In the room there is no hairdryer, not even a cheap basic one, and the situation was the same, go and collect from the reception if you want to use! The design was really really basic, not to say bad. And finally no slippers provided and the carpet didn't look clean at all! That was completely bad! To conclude even if you are on a budget try a hotel that at least would be closer to the city centre.", "Date": "June 20, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Palmerston North, New Zealand", "Title": "“Convenient comfort”", "Author": "Posted by an Accorhotels.com traveler", "ReviewID": "UR113258119", "Content": "For a hotel in this class the Ibis London Excel-Docklands was just what we required. Located near London City airport, the hotel provided comfortable accommodation, excellent service, and is close to the Docklands Light Railway, providing easy access to other parts of London. Car parking is available next door. If you are flying out of London City airport, this hotel is very convenient.", "Date": "June 13, 2011"}, {"Ratings": {"Cleanliness": "2", "Sleep Quality": "2", "Overall": "2.0", "Value": "1", "Service": "3"}, "AuthorLocation": "United Kingdom", "Title": "“BIG MONEY FOR NOTHING!”", "Author": "PearlC", "ReviewID": "UR110794200", "Content": "I recently attended a business meeting and stayed at IBIS docklands.The hotel was a big disappointment. I paid £153 for one night, there was no hairdryer, no shower cap and no breakfast. I did not like the area and felt very uneasy walking from DLR back to the hotel, therefore I would not reccommnend this hotel to females travelling alone!", "Date": "May 31, 2011"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Overall": "3.0", "Value": "1", "Sleep Quality": "2", "Rooms": "2", "Location": "3"}, "AuthorLocation": "hereford", "Title": "“good and bad”", "Author": "sparkly1968", "ReviewID": "UR110570799", "Content": "hotel is nice and fairly easy to find.reception staff nice and friendly.rooms ok,basic not very big wouldnt want to stay here longer than a few nights,beds not that comfy.breakfast is buffet with a variety of different foods bacon,egg etc and cereals and toast was fair to good.ate evening meal twice first night good service good food good took about 15mins to arrive great second night awful,after being told on arrival that there was a 45min wait thought long but ok had little choice to go anywhere else,over 1hr 30mins later an with no explanation as to why,i had to go and ask myself to which i was told it will be another 15mins and that they would comp the meal,i should think so as well.last day decided to eat at the bar was short changed,they said they would look at the cameras and check till but was then told couldnt check cameras till tues,i was leaving soon so left them my details,will wait and see if they get back.got the feeling i wasnt believed and after paying £500+ for 2 rooms for 2nights i think trying to get a free sandwich is a joke. one more thing hotel has room service wasnt any when i was there!!", "Date": "May 30, 2011"}, {"Ratings": {"Service": "2", "Cleanliness": "2", "Overall": "2.0", "Value": "4", "Sleep Quality": "2", "Rooms": "3", "Location": "1"}, "AuthorLocation": "Sydney, Australia", "Title": "“Don't stay here - bad hotel and location. Only the price was acceptable”", "Author": "JosephKnock", "ReviewID": "UR109261425", "Content": "Don't stay here unless you really need to. It is a good 30-40 minute trip (you need to take the tube and the light rail) into London. For a few $$$ more pay to stay somewhere close to the action. The area also had that \"unfriendly\" vibe about it when we travelled back on the tube in the evenings. Rooms were ok, but had a dormitory feel for what was advertised as a 3 star hotel.", "Date": "May 22, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Atlanta", "Title": "“Affordable, great location, and great customer service”", "Author": "djohnba", "ReviewID": "UR107939030", "Content": "The Ibis London Excel at Docklands is a clean and very reliable hotel. It is affordable and comfortable although basic. Please do not expect a fancy 4 or 5 star accommodation, but what you will get is a good place to rest in a clean, quiet, and reliable accommodation. We stayed in a triple for a week (April 27- May 5, 2011) and had NO REGRETS. The front desk staff is very accommodating and tentative. We did have one concern with a smell from the bathroom shower drain, but they were attentive to my concerns and took care of the problem. I stayed with two teenagers (my son and niece) and they were comfortable. I paid for the movie and internet package for a few nights and we were satisfied with that. We did not have the breakfast so I cannot comment on that. At night the bar area is lively so there is a social area for adults downstairs. The location of this hotel is close to the DLR station (less than 6 minutes walk from the hotel). To get to central London you can take the DLR straight to the Tower Hill stop which is near some of the attractions or you can take the DLR and then switch to another line to get anywhere in central London. It is less than 20 minutes into central London. I highly recommend this hotel if you do not want to spend all of your holiday money on a fancy hotel, but still want a clean, comfortable and very decent place to stay. You really cannot expect more from a budget hotel. Later on in our trip (May 9-11) we stayed at another hotel in central London (in the Earls Court area) and it was awful. I hate to say this but there are some very tired hotels in central London that are very overpriced.", "Date": "May 12, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Oswestry, United Kingdom", "Title": "“Cheap, Cheerful and well worth the trip”", "Author": "ChezzaLeach", "ReviewID": "UR107246978", "Content": "This hotel is fantastic value for money. The rooms are basic but extremely clean and quiet. The staff were exceptionally polite and courteous and the bar is open until late. Breakfast was fantastic with lots of choice and hot! This hotel is well worth stayin at it is 5 mins away from the DLR and one stop away from the jubilee line.", "Date": "May 7, 2011"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Overall": "3.0", "Value": "2", "Sleep Quality": "2", "Rooms": "2", "Location": "4"}, "AuthorLocation": "London, United Kingdom", "Title": "“Poor Customer Service - NEVER AGAIN”", "Author": "Lee267", "ReviewID": "UR104465824", "Content": "Myself and my partner stayed at this hotel for a one night stay simply because it was close to the 02 arena, the room was very BASIC but was clean. On arrival as we were checking in we were asked if we wanted to have breakfast and if we would like to pay now which we did it was £15 pounds and we paid in cash. We later changed our minds about having the breakfast as we had to leave earlier then expected and therefore we were no longer going to stay for the breakfast and asked for the £15 to be refunded. We were told by reception there was no record on there system that we had paid the £15 and we were asked who checked us in. We told them it was the young girl with long brown hair and she had even given us change, they still said there was no record of the payment in which case she may have pocketed our cash. We then asked to speak to a manager to which we were told there was no manager on site in the hotel and they are unable to refund us as they cannot get in contact with the member of staff that had checked us in. We were given an email address for he manager and we checked out £15 pounds lighter. Food - Ordered a pizza from the bar which was awful and a drink which tasted as if it had past its date. There is one local shop opposite the hotel which is extremely over priced. Parking - This hotel shares its car park with the hotel next door the Novel, on arrival there was an issue with the gate and we had to wait while it operated a one in one out service. Once you check out of the Ibis you have to go to the 1st floor of the hotel next door to pay the £15 pounds overnight fee. Overall the room being clean is the only plus , room is pretty tiny and there is no room service. The front desk take a long time to grasp anything you say and to take money and have no record of it seems ridiculous.", "Date": "April 18, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Sleep Quality": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Drama, Greece", "Title": "“great location”", "Author": "clairedelune78", "ReviewID": "UR103993786", "Content": "great location since it is 100 metres from the london excel.we arrived early around ten a.m and there was no room available so we had to wait untill 14p.m. Great view What you would expect from the room of a budget hotel. The great thing is that when you are in the room you have the feelling of floating...... AMAZING. Close to tower hill only 7 minutes by the DLR.", "Date": "April 14, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Birmingham,", "Title": "“Great Value Hotel but rooms looking a little tired”", "Author": "Wookie32 Posted by an Accorhotels.com traveler", "ReviewID": "UR103917498", "Content": "Great location and value however the rooms are starting to look a little tired but for short stays this is ok. Staff were friendly and helpful but a little slow on check in. Bar prices were very good for London would recommend for short stays", "Date": "April 13, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Ramsgate, United Kingdom", "Title": "“Good Value for money, for a budget hotel.”", "Author": "Kelseyrose", "ReviewID": "UR103875121", "Content": "We chose the Ibis for its closeness to Excel as we were visiting the Dive Show. The parking was onsite and secure, great value at £15. The room was the size you would expect for a budget hotel, but clean, and more pillows and towels were provided promptly on request. There was a slight delay checking in as the receptionist couldn't find our booking due to a typing error in the name, however the receptionist was very polite, and helpful. The late breakfast was a good idea (it was a Sunday), due to previous reviews we didn't expect much, however the breakfast was very good, branded mini boxes of cereals, breads,pastries,juice, branded bio yogurts and drinks,cheese, ham also scrambled eggs/beans etc, which was very good value for the advertised continental breakfast, it was all self service. We would happily use this hotel again.", "Date": "April 13, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "4", "Overall": "2.0", "Value": "1", "Location": "4", "Rooms": "4"}, "AuthorLocation": "", "Title": "“Nice rooms shame about the awful customer service”", "Author": "UKandbeyond", "ReviewID": "UR103752023", "Content": "I've stayed in a good few hotels and have never experienced such awful customer service. The first room we were given was in the middle of their 'light refurbishment' which meant there would be banging in the room next door to us until 9pm and strong paint smells. We went to change rooms and discovered we had been given a twin room, rather than a double. With a unhelpful attitude throughout and trying to tell us we'd booked a twin we eventually got a decent room on the third time. They made a big deal about me asking to not be in a room where there was hammering against the wall. We also overheard them struggling to find us a room as the hotel had been \"overbooked\". I am sure this isn't a reflection of the Ibis chain but I would be very reluctant to stay in one again.", "Date": "April 12, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Location": "2", "Rooms": "2"}, "AuthorLocation": "Rawtenstall, United Kingdom", "Title": "“stay ruined by noise at night and disappointing evening meal”", "Author": "isabel37", "ReviewID": "UR103062209", "Content": "Stayed for two nights 2nd to 4th April 2011 in room 721. The room was clean and functional for a budget hotel, although I half expected the bathroom to go into orbit due to the noise each time the toilet was flushed. Would have liked hand towels as well as the rather thin towel supplied per person. But overall the room was ok and had a very pleasant view. Breakfast was fine, but the one evening meal we had was very disappointing. For example, my husband ordered a 'beer battered fish' dish, and a rather sad looking 'breaded fish' (which reminded us of fish bought in bulk in a supermarket) was presented to him. He explained this was not as ordered and a very willing waitress replaced it - with another albeit more presentable 'breaded fish'. He gave up. The staff were overall obviously anxious to please, but there was some difficulty with communication - none of the staff appearing to have english as a first language. However, any disappointment with the evening meal was nothing compared to the noise experienced at night. Noise starting in the early hours of sunday (2-3am) included loud laughter, running along corridors, doors banging and toilets flushing and appeared to come, not only from our floor, but from above. We put up with the disturbance putting it down to saturday night festivities. However, the following night the noises started again and this time at about midnight . The noise definately being in the main directly above us. We endured until about 1.30 am when I rang reception in desperation - the gentleman on duty was extremely polite and said he would investigate - and the noise, although not ceasing completely, became bearable after about 20 mins. Two disturbed nights for two pensioners did spoil our stay at the hotel, and therefore our long awaited trip to London to see Peter Kay at the 02 on the saturday night. I look forward to the Manager's comments.", "Date": "April 6, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "wales", "Title": "“Great as a base for exploring and the o2”", "Author": "olibill1982", "ReviewID": "UR102804846", "Content": "Stayed here for two nights in march. Had tickets to see peter kay at the o2. On arrival we were told that we couldnt check in until 2pm. They offered to store our baggage free of charge. We sat in the bar as it was 13.00pm. Service was friendly and efficent. whilst waiting we glanced at the food menu, it appeared reasonably priced and the selection was varied. The main areas were clean and well maintained. The alcohol prices were reasonable aswell. Our room was on the 4th floor and right at the end 449. It was clean and comfortable. The bathroom is more of a wetroom. The rooms are budget, but like i say they were clean and comfy. Things like hairdryers are available on request. But tea and coffee are supplied and rooms made up daily. The towels are small and only one pillow is provided. However i am sure if we had asked they would have offered us some more, but we didnt see the need. They are refurbing between the hours of 9 and 5, but we werent there and there was no evidence to show anything was happening, apart from banging on the first morning at 1030am. The hotel had a lot of business people from the excel centre and school children from abroad. Niether caused us any bother at all. The hotel itself was located about 2mins from the royal victoria stop on the DLR. We bought a day travel card at 8 pounds each and changed at canning town for the tube. Canning town is one stop from Royal Victoria and One stop from the o2. We went into london on both days and it took s about 20 to 30 mins depending on were we were heading. We ate at the o2 on both nights as it has a good selection of bars and resturants. We had no trouble getting about and saw lots of sights. The tube is being upgraded at the weekends so be mindful of this. The bus replacements are frequent but not as quick as the tube. Your travel card will be valid on these. London as usual is pricey but a good getaway. AS for the ibis its a great hotel. Breakfast was buffet style and varied in its selection. The bottom line is i travel frequently and know you go were you can afford. Ibis isnt glitzy or glamourous but it serves its purpose well as a base. If you want comfort and some where to rest your weary feet go here. If you want the added extras go elsewhere. I will use this hotel again and would recommend it.", "Date": "April 4, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "4", "Sleep Quality": "4", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Ludlow", "Title": "“Docklands”", "Author": "Alison1801 Posted by an Accorhotels.com traveler", "ReviewID": "UR101671385", "Content": "Perfectly adequate for budget accommodaiton at ExCeL. Predictably Ibis but this has a bar and does food. Nothing else to add, but the system is requiring 200 characters which is quite hard to do when nothing else to say!", "Date": "March 26, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "2", "Sleep Quality": "5", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Kampala", "Title": "“Value for money review”", "Author": "Posted by an Accorhotels.com traveler", "ReviewID": "UR101330677", "Content": "the !00 pound per night was not good value, this should have cost about 60 pound sterling otherwise good facility, public transport is a challenge from the location but other wise a good quiet place to stay and away from the hussle and bussle of down town hotels. there is evan a wonderful place to walk around.its not advertised. even the exhibition groumds are not indiacted in the advert for the hotel", "Date": "March 24, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Seoul, South Korea", "Title": "“Decent value/experience for the money”", "Author": "GMK1954", "ReviewID": "UR98999726", "Content": "The Hotel Ibis was a decent value for the money. We stayed 5 nights. It's a bit far from central London, so access to nightlife was a little limited. The DLR was a 5 min walk and easy to find. Our room was clean, size was about what we expected (not overly large), and the bathroom was not too small. The shower design was one where water tended to collect on the bathroom floor, unfortunately (standing, no bathtub). No major problems with hearing noises from upstairs/other rooms. Small TV had a few UK channels and 1/2 channels from other European nations. The front desk could have been a little more helpful - they did not seem very interested when we showed up to check in, and initially tried to tell us that our stay did not include breakfast (which in fact we did pay for when we booked the room - they later caught their mistake). No such problems at check out. There was a medium-sized supermarket out front which was very convenient and open till fairly late. Other than a few other hotels and the Excel center, there didn't seem to be much else out here. The breakfast was good and had a lot of different foodstuffs... unfortunately it was the same food everyday! With the variety though, it wasn't that bad. One busy day though the coffee seemed to run out, we couldn't find any ketchup, and the staff seemed slightly overwhelmed. We did eat dinner once and although it wasn't cheap, it was quite tasty. The signs for breakfast said 6am to whenever, but this was misleading. On our last day we had to catch an early AM flight and when we went down at 6... the restaurant area was not setup. The staff did quickly bring us a few small items, but obviously it was not what I expected. Overall nothing exceptional, but a slightly better than average experience.", "Date": "March 5, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "2"}, "AuthorLocation": "barcelona", "Title": "“Good option”", "Author": "Posted by an Accorhotels.com traveler", "ReviewID": "UR97690505", "Content": "I attended a meeting at the UEL and this was a convenient option. Good quality for the price. The room is clean and wide enough, bathroom well enough. Breakfast quite good for the price. A bit too much flow of people, but still ok. It takes time to reach from downtown, and there are not much options once you are there for dinner or drinks (Canary Wharf is the best one). Easy to make some jogging (by the riverside and some path here and there).", "Date": "February 23, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Baldock, United Kingdom", "Title": "“Surprisingly Good”", "Author": "CelticPathfinder", "ReviewID": "UR97177366", "Content": "Booked IBIS just for one night as I wanted to be near the Excel centre. Got a great deal of around £60 B & B. Room was large , clean and comfortable and the bathroom large with a good walk in shower. Hotel looks pretty new. Short walk to the DLR Royal Victoria station. Had dinner in a good chinese restaurant just 3 mins walk from the hotel. It is a shame that IBIS hotels in the UK do not provide free wifi to guests. Breakfast was a bit chaotic with one coffee machine out of action and every time I got up from my table to get something from the buffet someone else had sat down at my place or the staff had cleared my plates away before I had finished. Overall good value for money and location in Victoria Dock", "Date": "February 19, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "uk", "Title": "“overall Nice. Good location and views. reasonable price too.”", "Author": "t2t_time2travel", "ReviewID": "UR96868320", "Content": "Nice simple hotel. -Staff were average though and did lack knowledge of local surroundings. great restaurants within 5mins walk and small stores for food. Hotel restaurant has limited options, not very vegetarian friendly. room was simple, stylish and clean :) two minutes walk from royal victoria station, DRL line. shame tubes were expensive as its in zone 5 though. Would still recommend this hotel. enjoyed our 2nights there but is somewhere for a good weekend or nights sleep, not enough facilities for a long stay.", "Date": "February 16, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Bristol", "Title": "“Value for money”", "Author": "Posted by an Accorhotels.com traveler", "ReviewID": "UR96816079", "Content": "We were exhibiting at the MCN Excel motorcycle show and the Ibis is 2 minutes walk, good value for money but they could do with a couple more members of staff however, more staff means more overheads and the price would go up! Overall very good value for money.", "Date": "February 16, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "3.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "3"}, "AuthorLocation": "Warrington, United Kingdom", "Title": "“good weekend”", "Author": "crusocheshire", "ReviewID": "UR95925637", "Content": "went to this hotel with ogdens travel on bed breakfast dinner plus two hour free bar rooms very clean and good shower our driver graham was nice and friendly .food was good two trips out the only down side this hotel was a little far out but all in all a good weekend", "Date": "February 8, 2011"}, {"Ratings": {"Service": "2", "Cleanliness": "2", "Overall": "2.0", "Value": "2", "Sleep Quality": "2", "Rooms": "2", "Location": "5"}, "AuthorLocation": "Buffalo, New York", "Title": "“Awful room, but very close to ExCel Center”", "Author": "Gabacorn", "ReviewID": "UR95828389", "Content": "Awful food, matchbox size rooms and a capsule bathroom. Try to spend more time outside of the hotel then inside. It is very close to the convention center. Utilize the store across the street for food, water and beverages. Very far from LHR. Close to City Airport.", "Date": "February 7, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "", "Title": "“communication Problems=poor Service”", "Author": "Posted by an Accorhotels.com traveler", "ReviewID": "UR95808616", "Content": "I have stayed at this hotel many times. On every ocassion i have found that the staff probably mean well but their attitude and along with their so called approach to customer service is intolerable at times.Proper training is much needed.The way most of the staff communicate with the customers or not as is the case here, make you feel very frustrated especially when the request is a relatively simple one. A good example of this is product knowledge at the bar when ordering a drink. The excuse is either i am new here, i have never worked the bar before or i dont understand.this needs to change.", "Date": "February 7, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Falmouth. Cornwall", "Title": "“Good value, mid range accommodation in fantastic location”", "Author": "CornishWebDesigner", "ReviewID": "UR95789333", "Content": "I stayed here for 1 night in Jan 2011 for a business trip and paid £50/night through Laterooms. It was a very clean hotel with no frills in an amazing location. The bed was firm .. which would be my only thing I'd change .. the room was clean and modern, TV was OK .. restaurant served good food and breakfast was fine. Staff were friendly and helpful - there's a 24-hour bar for food and drinks. There was some noise from City Airport before 10pm .. which was fine with me. It's 3 mins walk from the DLR and about 250m from ExCeL. At the price I paid in London it was Phenomenal value .. and I'd def. stay here again.", "Date": "February 7, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "3.0", "Value": "4", "Sleep Quality": "4", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Newark", "Title": "“Ibis Docklands”", "Author": "Posted by an Accorhotels.com traveler", "ReviewID": "UR94216455", "Content": "No frills but clean and comfortable, although restaurant food not of the highest quality.", "Date": "January 24, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "london", "Title": "“Nice location, beware the car park charge.”", "Author": "Posted by an Accorhotels.com traveler", "ReviewID": "UR93146286", "Content": "Beware the high car park charge if you use the Novotel car park next to the Ibis. £14 for the night!! This is not advertised on any web site.", "Date": "January 16, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Lincoln", "Title": "“good value”", "Author": "Posted by an Accorhotels.com traveler", "ReviewID": "UR92145111", "Content": "The hotel was as expected for the price. The room we had was looking tired and in need of a spruce up. The staff were all very friendly and helpful. I notice some people have said about not enough towels or pillows. We had the same problem but rang reception and within 5 minutes they had brought us some more. Good location for the Excel centre and wonderful views of the Thames. Secure car parking was good and only £14 for 24 hours.", "Date": "January 8, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Slovakia", "Title": "“feedback”", "Author": "Posted by an Accorhotels.com traveler", "ReviewID": "UR91132288", "Content": "In general I was satisfied with my stay in this hotel. I would recommend this hotel for a leisure travelling. I get a quality service for a resonable price.", "Date": "December 30, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "3", "Sleep Quality": "1", "Rooms": "1", "Location": "4"}, "AuthorLocation": "Oxford, United Kingdom", "Title": "“Dirty, tired room”", "Author": "rpaters", "ReviewID": "UR90494729", "Content": "There were only 2 small towels in the bathroom, when we asked for more we were told to collect as we returned as there was no room service or maids available. The bathroom smelled of raw sewage. There was a cigarette burn in the shower tray. The room furnishings were old and chipped. The bed appears to have no base, only a plinth that is part of the floor, matress is thin and uncomfortable. There was what appeared to be dried mud on the bed linen.", "Date": "December 22, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "London, United Kingdom", "Title": "“Great stay!”", "Author": "juzclique Posted by an Accorhotels.com traveler", "ReviewID": "UR89857882", "Content": "Good if you have an event in Excel. Quite a distance if you are here for shopping.", "Date": "December 14, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "London", "Title": "“Amazing!!”", "Author": "Posted by an Accorhotels.com traveler", "ReviewID": "UR88370395", "Content": "The accommodation was perfectly fine. I will go there again and again.", "Date": "November 27, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "3"}, "AuthorLocation": "york", "Title": "“Good Value”", "Author": "skimblejones", "ReviewID": "UR88357863", "Content": "Another good example of the Ibis (brand) - they vary - this one is just fine in every way and very good value. Though a bit out of London the DLR provides excellent and easy public transport. We did not eat in the hotel, but had dinner in the Novotel next door (a la carte MUCH better and no more expensive than the rather stewed looking buffe) - and in the morning walked across the docks to the London Barrier Park for a very reasonable breakfast in the cafe there - with great views through trees of the Thames Barrier itself. Then back on the DLR via the London Docklands Museum (free) by West India Quay.", "Date": "November 27, 2010"}, {"Ratings": {"Service": "2", "Cleanliness": "1", "Overall": "3.0", "Value": "3", "Sleep Quality": "2", "Rooms": "2", "Location": "4"}, "AuthorLocation": "Ibiza", "Title": "“Good hotel, bad cleaner!!!”", "Author": "Posted by an Accorhotels.com traveler", "ReviewID": "UR88350979", "Content": "The room was really really clean the day we arrived but we stayed there for 7 days and the cleaner just make the bed the days after, so imagine the mountain of dust in our night tables, tv, desks, etc, after one week...", "Date": "November 27, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "5", "Overall": "3.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Reading", "Title": "“Lovely Hotel, but rude staff”", "Author": "Posted by an Accorhotels.com traveler", "ReviewID": "UR87930218", "Content": "I stayed at this hotel with my partner for 2 days, it was a great location, the room was very clean and comfortable. It was located in a beautiful, peaceful, and convenient area and was well worth the price. The cleaning staff were particularly helpful and nice, however, the majority of the staff at reception were extremely rude, unwelcoming and unwillling to help with any queries (however I was prepared for the rudeness of the staff as so many other reviews stated this as the major downside to the hotel). If you do not have to talk to or deal with the reception staff, it is a perfect hotel, but if you do have the misfortune of needing to deal with the staff it really ruins your stay.", "Date": "November 22, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "5", "Location": "4"}, "AuthorLocation": "warwickshire", "Title": "“excellent value for money,clean,quiet, pleasant location.”", "Author": "stamandas", "ReviewID": "UR87054513", "Content": "stayed 1 night here,whilst visiting the02 arena.Very pleasant stay. clean rooms. Staff were quiet,they just got on with their job and were not unfriendly. Breakfast was excellent value for money.You could have paid far more money to stay in a hotel in london. So why dont all those people that complain go and do that and stop writing unfair reviews about budget hotels. Would definatley stay here again. Thanks Ibis hotels.!!", "Date": "November 14, 2010"}, {"Ratings": {"Overall": "1.0"}, "AuthorLocation": "Skegness, United Kingdom", "Title": "“Dont book here unless you want to risk losing your money!”", "Author": "hcw777", "ReviewID": "UR85540683", "Content": "I booked a room at the Ibis Hotel,London Docklands on 10th July 2010. When my husband arrived to check in there were no rooms available even though I had prepaid for one for him. I am still waiting for my money back now over 3 months on. I have been offered compensation by means of vouchers in euros even though I paid in pounds on my mastercard. These supposedly were sent sometime in September - I have yet to receive them. I have made numerous phonecalls and sent numerous emails to no avail. I would appreciate a comment back from the management as to why I have not been refunded the money I paid in good faith.", "Date": "November 1, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Northampton, United Kingdom", "Title": "“good value and better than expected”", "Author": "howesmandy", "ReviewID": "UR82178319", "Content": "after reading other trip advisor reviews we arrived a t this hotel with some concerns.however there wasnt any wait at reception our rooms were excellent value for money and clean with tea and coffee making facilities. the shower was huge and bathroom very clean and well presented. we had breakfast which was fine but you need to be there before 8.15 to avoid a very busy time overall excellent and handy for o2 arena", "Date": "October 5, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "3.0", "Value": "3", "Sleep Quality": "5", "Rooms": "5", "Location": "1"}, "AuthorLocation": "San Diego,CA.", "Title": "“Don't stay this hotel if you just want to visit center of London”", "Author": "7traveler77", "ReviewID": "UR81885084", "Content": "This hotel is good for the business people,not for travelers.It's take about one hour to the center of London each way.", "Date": "October 3, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Edinburgh, United Kingdom", "Title": "“Unbeatable value - Better than several 4* hotel rooms”", "Author": "scotty1875 Posted by an Accorhotels.com traveler", "ReviewID": "UR80166645", "Content": "As good as Premier Inn but almost half the price. Our internet room rate was £54 - a bargain. Premier Inn rate would have been £89 for the same room standard. If you're on a smaller budget and need a hotel close to the O2 Arena / Excel Exhibition Centre / London City airport then this Ibis is ideal. Located on a very quiet street. Hotel is clean and rooms are modern, comfortable with excellent Grohe showers. There can be a little plane noise occasionally but not to the volume that it disturbed my sleep. Excel and Victoria DLR stations are both about a 2 min and 5 min walk from the hotel, respectively. There is a Spar and a reasonably priced mini-supermarket with a good selection of wine & beers almost directly across the road and also another Spar type shop near to the rear of the hotel at the dockside. There are a few nice looking bars and restaurants and a club within 2 mins walk although I didn't go to them. Rear rooms have nice views over the docks - there is a watersports centre at the dock so you can watch people waterski. There is a large grass covered area with benches right next to the hotel outside the Excel Centre which is quiet and is a great sun trap for relaxation and is a suitable space to let your kids run about without any traffic unlike a lot of London hotels. I have stayed at Ibis Docklands twice. I had no concerns about letting my 17 yr old son and his friend stay there on their own when on a concert trip recently as the area is quiet and feels safe. I always look to stay in Ibis hotels now unless I want to stay in a boutique style hotel on a special occasion.", "Date": "September 19, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "3", "Location": "4"}, "AuthorLocation": "UK", "Title": "“London on a budget”", "Author": "gazuk95 Posted by an Accorhotels.com traveler", "ReviewID": "UR79337719", "Content": "This hotel is great if you want to visit London on a tight budget, The hotel is basic, but comfortable and only a 5 minute walk away from the nearest tube station. The staff were polite, and check in was quick and hastle free. We've eaten at the hotel bar during a previous stay and the food was acceptable and good value for money. Breakfast is basic, so if you prefer it with all the trimmings I'd recommend going into the city centre. Remember to check that the DLR is running (especially if you're visiting at weekend) as scheduled closures for maintenance can really slow down your journey to and from the hotel.", "Date": "September 13, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Portsmouth, United Kingdom", "Title": "“Good Overnight Stay- Close to transport links.”", "Author": "austin_mini69", "ReviewID": "UR79032392", "Content": "My fiancée and I stayed at the Ibis Docklands Hotel for one night, for a flight from London City Airport at 9am the next day. It was easy to get to, and in a really good location to get anywhere, but particularly for the airport. The staff were friendly and the staff at the reception desk were particularly good, being able to tell us about local transport links etc. The staff behind the bar had a bit of an argument whilst we were paying for our food, which wasn't a particularly comfortable experience...but it soon settled down. The food from the bar in the evening was pretty good. Worth the £5.50 each we paid to fill a gap. They had dressed iceberg lettuce and cucumber with olive oil though, and while this was fine(ish) for us, it may not have been to everyone's taste...but a very small quibble. Most importantly, the room. Fine for one night, clean, comfortable and functional. The pictures on here are very representative of what we saw. The room didn't have a net curtain, which meant that when I threw back the curtain in the morning, I was met by the neighbours in a next door flat! But curtain was swiftly closed. The mattress was memory foam, which we are used to, but might be difficult to get used to for some! All in all, a pleasant stay...would use again!", "Date": "September 10, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Frankfurt", "Title": "“Nice price and nice location (close to DLR)”", "Author": "mauriciocasal Posted by an Accorhotels.com traveler", "ReviewID": "UR78616907", "Content": "I enjoyed this hotel, fair price for a clean room, reasonable breakfast and in a really location (it was close to the DLR transport line). I do recommend this hotel!", "Date": "September 7, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "3", "Rooms": "4", "Location": "3"}, "AuthorLocation": "whitchurch hants", "Title": "“Great value Hotel”", "Author": "fulham1987", "ReviewID": "UR77970563", "Content": "Me and my Fiancee stayed in this hotel over the august bank holiday weekend, The hotel is easy to find being two minutes from customs house DLR Station it's also visible from the excel conference centre and only twenty minutes from central london by train. The Reception Area was manned by Freindly staff 24 Hours a day it was always clean, we were checked in and out very quickly and effciently, the bar runs off the Reception which you have to walk through to get to the resturant/breakfast room both the bar and resturant were run extremely well and were never really busy that we could see except at breakfast where it was very busy and sometimes difficult to find somewhere to sit, the food served was good during resturant hours and ok during the buffet breakfast, during breakfast there was plenty of choice from fruit to toast and cooked (bacon, Scrambled Eggs) to cereal which was all constantly being re-stocked every time it got low. The room was a good size with a fair sized bathroom/toilet, the room was furnished with all you'd expect TV, bed, phone, shower etc, TV Picked up 6 or 7 english channels as well as several foreign ones, the room was decorated well but had only a view of the rest of the building our only complaint was the bed being a tad on the hard side, Each day the room was well cleaned and bed re-made. The staff at the hotel were always freindly and even though english probably wasn't there 1st language we never had any trouble understanding them or them understanding us, all in all i would recommend this hotel and will plan to use it again", "Date": "September 2, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "5", "Sleep Quality": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Birmingham, United Kingdom", "Title": "“Good Loocation”", "Author": "HSB25", "ReviewID": "UR77649550", "Content": "Being next to the Excel centre this was a well located hotel within 20 mins walk of o2 centre. The room was clean and not too small. My internet cable was broken going from my tv so it kept falling out of my laptop. This was replaced by a member of staff but only after a number of calls to reception. The deal however that they offered on internet and unlimited movies was great. 9.99 for all movies and 24 hour internet access. The rooms were a little dusty so you do feel bunged up in the morning. It was a very popular place for tourists as I found out in the morning at breakfast as i stayed 2 nights and both mornings had different coachfulls of japanese tourists. Breakfast was good and there was plenty of it in a buffet style that had staff constantly replacing any empty items. All in all this was a decent hotel at 49 pounds for bed and breakfast in London!!!", "Date": "August 31, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "2.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "4"}, "AuthorLocation": "", "Title": "“Never again”", "Author": "sunshine505", "ReviewID": "UR77392054", "Content": "My husband and I stayed one night at the Ibis Docklands in August however it is not an experience I would wish to repeat. The rooms are tiny, the bed rock hard, and no hairdryer. The breakfast was very poor, the bacon tough and the scrambled eggs were white and totally tasteless. All in all a very disappointing stay.", "Date": "August 29, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Ayrshire", "Title": "“Loved the location”", "Author": "ironlady2", "ReviewID": "UR76508514", "Content": "Just returned from a long weekend at the Hotel Ibis London Docklands. Although the hotel was very busy the staff were very helpful and accommodating, the room was extremely clean, breakfast was a bit chaotic but the choice on offer was substantial. Transport to and from the hotel was very easy via DLR. Only downside was the flight path for City Airport however the hotels double glazing compensated for that. Would definately return here.", "Date": "August 23, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Newcastle upon Tyne, United Kingdom", "Title": "“Good Value for City of London stays”", "Author": "drsox24", "ReviewID": "UR75416043", "Content": "This was our second stay at the Hotel this year and both times we have enjoyed our stays. The rooms are basic but clean and tidy. Excellent shower. We had too ask for extra pillows, but no problem. Room can get warm, even with A/C on, but better than being freezing cold. Breakfast Buffet, provides good choice. Choice of Restaurant food very limited. Nisa and Spar close by if snacks and drinks needed for in the room. Excellent DLR links to 02 Arena and City of London via tube make this a great choice.", "Date": "August 16, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "4", "Sleep Quality": "3", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Suffolk", "Title": "“Mixed opinion, budget but room for improvement.”", "Author": "artgeko", "ReviewID": "UR75324107", "Content": "We arrived early evening on Saturday after a day in the city. Check-in was smooth, staff friendly and polite. Room was adequate for a bed for the night. Had to go down to reception because only 1 pillow each and no spares in the room but they got 2 more straightaway, no bother. A/C was not very efficient and the room felt hot all night, window only opened a little and kept closing. Also seemed that mattress protector was plasticky, which added to the heat problem. We did not call reception about this because we were so tired. We had bought some food basics at the local Spar so that we did not have to leave our room until the morning. The Spar has everything you could need, very handy. Apart from the heat, the room was sufficient. Breakfast this morning was rather chaotic, too many people in at once, despite following the traffic light system for how busy it can be at certain times. Sunday breakfast is served until midday which would appeal to some. Some tables did not have chairs at them. Hotel very easy to find. We got the DLR from Tower Gateway to Royal Victoria, didn't take long and going back into central London was the same, and easy to pick up the bus to central London. For a budget hotel, I would consider staying here again but would research alternatives first. Not a patch on the Sydney Ibis we stayed in a year ago though.", "Date": "August 15, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "5", "Location": "3"}, "AuthorLocation": "Copenhagen, Denmark", "Title": "“Nice hotel, close to the the train to London!”", "Author": "Geo_Denmark", "ReviewID": "UR73853981", "Content": "Nice little hotel, with okey rooms, very clean and very good value for money! It looks like it is very long from London center, but it took us only 20 minutes to get by train to the center. The parking, was very dire!", "Date": "August 5, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Nottingham, United Kingdom", "Title": "“very good value for money”", "Author": "doyleyboy86", "ReviewID": "UR73290219", "Content": "I read some terrible reviews on this hotel so decided to write this give our view. Firstly, this is a budget hotel..if you expect to be treated like a king and have all the amenities they have at say the ritz or royal garden then dont be so mean and go and pay ritz prices!! Why do some of these moaning minnies bother going anywhere?? The rooms were very adequate and clean, the beds comfortable and the staff very curtious.....and they served a very good breakfast...what else do you need for a london getaway. getting into central london was very easy, took about 20 mins and cost six quid each for a dlr/tube full day pass. my only critisism was that because we arrived mid evening on the first night we ate in the restaurant...this was a mistake as the service was unbelievebly slow and food very mediocre...after that we ate in town so no problem. you are quite close to the city of london airport so after 7am planes take off over the hotel but again, if your'e spending the day in london you should be thinking about getting up by then anyway. through superbreaks this hotel cost 56 quid per night for a three night stay (incl breakfast) and was very good value for money. We have stopped in the aforementioned hotels and you definately come away with a distinct feeling of bad value for money. The money saved by going for a budget hotel probably paid for all of our meals during our 3 day stay! We will definately go back", "Date": "August 1, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "4", "Overall": "2.0", "Value": "2", "Sleep Quality": "1", "Rooms": "2", "Location": "4"}, "AuthorLocation": "Glasgow, Scotland", "Title": "“Worst Ibis Iv stayed in”", "Author": "SarahandChris", "ReviewID": "UR72608573", "Content": "Normally think Ibis Hotels are great however this one was poor. Arrived to be told our booking had been cancelled??? Apparantly they phone all people with a potential booking when they are busy to make sure they are coming..... No one called us, no voicemail was left, so they take it upon themselves to cancel your booking? Finally got checked in after one of the receptionists had burped pretty much in my face and didnt even say 'excuse me'. Room was worst looking Ibis we have stayed in, shabby and tired. Bed was extremely uncomfortable and room overly warm. Would not recommend and would definetly not stay at this Ibis again though have had no problem with any previous stay at other Ibis hotels.", "Date": "July 27, 2010"}, {"Ratings": {"Service": "2", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "3"}, "AuthorLocation": "redlands", "Title": "“beautiful location, nice hotel, staff needs work”", "Author": "mmegreen", "ReviewID": "UR70165744", "Content": "I stayed at this hotel with a student tour in july 2010 (this review is for the Ibis london Docklands Excel-- right next to the excel center). The hotel is nice, new, and the location is beautiful, right on the canal. There are some restaurants nearby, the hotel bar/restaurant is open 24 hours, which is very handy and the prices are good. there are two small markets nearby, with long hours. the hotel itself, the rooms are sparse (this is an Ibis), the windows don't open all the way, but the AC is good, the bathroom reminded me of a cruise ship bathroom (no tub, only shower, step up, etc...). if i were staying here are a regular tourist though, I would have been disappointed because there were sooooo many groups here! we were just 1 of about about 4 student travel groups (each group being about 50 teens), and there were two adult japanese tour groups there during our stay as well. In general the kids were well behaved, but it made it very difficult to get on the hotel computers, breakfast was absolutely packed from about 8-9 every day, and the elevators took forever! As for the staff, well, since any member of the EU can move jobs between countries, it means that you have a lot of non-English staff-- they all speak English, but their comprehension levels vary. We had to explain 3 times about the light in our bathroom (it was blinking on and off-- thank goodness we were not epileptics, or else there could have been real problems). i tried, in vain, to solicit information abot cinemas and timetables (the staff referred me to the pamphlets about trips to stonehenge and the cotswolds)-- then told me that i would just have to get on the tube and travel to the movie theatre to find out if any movies were playing now, that i wanted to see. they did it with a smile, but i did not find it helpful to be told to take the tube down to canary wharf at 930pm to find out if there were still movies playing that night. they had nicely priced in room internet and movie plans, but the actual working order of these programs were spotty, at best-- in our group, atleast 5 rooms had difficulty connecting to the internet and watching the pay movies on tv (and they had to return to reception 3-6 times-- not a fun thing especially when they had to wait in line behind 3+ people every time). Overall, I think this hotel is a crapshoot-- their rates are good, it's off the DLR (which is fabulous), but if you're there with a group, or stuck there while several groups are there, then your experience is going to be different. It was beautiful though, with lots of benches out on the promenade.", "Date": "July 8, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "2", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "1"}, "AuthorLocation": "Santa Barbara, California", "Title": "“Avoid at all costs”", "Author": "cbprater", "ReviewID": "UR69826188", "Content": "This was my worst hotel experience in at least the last 500,000 miles of travel. I stayed at this hotel as it was selected as the conference hotel for a recent conference. I brought my family so that they could have a holiday abroad. The hotel was a disaster. First, the hotel is *extremely remote*. It takes an hour or more to get into central London by light rail and the tube. Next, the rooms are very small, barely sufficient for a solo business traveler and terrible for a family. The hotel is extremely crowded--the lobby, bar and restaurant were packed to overcrowding. The hotel is very loud--it seems to cater to children's tour groups, so we had pre-teens running and yelling down the halls at night. The restaurant's food is poor and the restaurant staff were rude and inattentive. The bathroom doors are so stiff that my 7 year old daughter couldn't get out of the bathroom by herself. We also had problems with the hotel laundry--the first day our laundry wasn't even sent out to be cleaned and the next day one of the garments returned damaged. Despite an advertisement of \"fixed in 15 minutes or the room is free,\" none of these issues were addressed and the hotel refused to issue a refund of an unused night when we decided to depart early in disgust. If you must stay in this area, check out the other hotels nearby (including a Novotel and a Crowne Plaza). Better yet, stay somewhere more central to London and commute to your meeting. (There are limited restaurant choices, few tourist attractions and limited nightlife near the ExCel/Docklands area. Many more fun places closer to London proper.)", "Date": "July 5, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "3", "Location": "3"}, "AuthorLocation": "The WIRRAL UK", "Title": "“well priced hotel in quiet location”", "Author": "HotelValueHunter", "ReviewID": "UR67877286", "Content": "I stay in the London ExCel exhibition and conference centre area at least 2 times a year. I write about all the hotels I stay in on the ExCel complex so I direct you to my user name to get my reviews on the other adjoining hotels I have stayed at. If you are travelling to this hotel on the DLR alight at Royal Victoria (RV) as there are fewer steps to carry luggage up and down. Out of the station across the zebra crossing and at 10 O' Clock is a wide path between the apartment blocks. Walk along this path and you come onto Western Gateway. Turn left and the IBIS comes up on your right hand side after about 250yds. This hotel is fantastic; I find no problem with the room size and the staff friendly. My room was cleaned everyday to my satisfaction and on checking in I asked for a room with a view of the dock and my request was granted. From reading other reports I think people are expecting too much for the room rate you pay. I have now stayed here 8 times in 5 years with nothing to really complain about (except small bath towels, and small ironing boards in the ironing rooms). The restaurant food is basic fayre but good value. I calculated the cheapest 3 course meal with a 0.5L bottle of still mineral water would cost about £15 per person. Bar service does get people very frustrated in this IBIS but the secret is to stay at this hotel and use the bar in the sister hotel Novotel right next door. The Novotel has a far superior bar but the prices are only about 20p dearer per pint. The Novotel has floor walkers, so once you have your seat the floor walker will take your order at your table and bring you your drinks. You just then settle up one bill at the end of your visit. You cannot charge the Novotel bar bill to your IBIS hotel room, which is the only real drawback. As they are part of the same hotel chain I do not see this as a big problem to sort out. This would benefit A-Club members to ensure they maximise their points earned from these two ACCOR hotels. If staying for a while, there are two convenience stores (SPAR, NISA) to get your hotel room supplies along Western Gateway. There are lots of eateries around the IBIS hotel and I found the quickest way to know where they all are is to pop into the ExCel centre next to the IBIS and get the free local restaurant guide from the information desk. The ExCel venue is open even if no events are happening and contains Coffee Bars and Newspaper/sweet shops and free cash machines. If you are staying at one of the on-site hotels this is a great bonus to be able to use these facilities. If you want a cheap light breakfast rather than pay hotel prices a bacon sandwich costs around £3 and there are plenty of tables and chairs down the main wide central isle to sit at and relax. I have also come across a WEB site which will be useful if you are staying at this hotel and visiting central London to see the sights. It is walkit.co.uk this site shows you the quickest walking route between two locations. If you are visiting London for the sights start your walking journey at Westminster Tube on the Jubilee line (change at Canning Town on the DLR). All the sites can be walked from here. walkit is a great site for seeing London on foot.", "Date": "June 18, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "3.0", "Value": "5", "Sleep Quality": "3", "Rooms": "3", "Location": "3"}, "AuthorLocation": "", "Title": "“Clean and Functional”", "Author": "HKSmithers", "ReviewID": "UR66801716", "Content": "The hotel is clean and functional and for the price, it does the job very well. I stayed there as it was cheap and it has clean and fairly comfortable rooms. Service is average and facilities poor (eg.no room service) but you get what you pay for. If you are looking for a cheap but safe and clean place to stay then this is just fine. Location is only good if you are going to Exel as it it just steps away, for anywhere else the location is pretty poor.", "Date": "June 7, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "2", "Sleep Quality": "4", "Rooms": "2", "Location": "4"}, "AuthorLocation": "West Yorkshire", "Title": "“Location great for Excel”", "Author": "bootsieWestYorkshire", "ReviewID": "UR64110635", "Content": "This is a basic hotel - and expense for what you get but this is London. 2 minutes walk from Excel. Staff friendly and helpful. Restaurant not inspiring. Breakfast very average. Bar OK. Don't bring your car -£30 per night to park", "Date": "May 14, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Sleep Quality": "2", "Rooms": "2", "Location": "1"}, "AuthorLocation": "Suffolk", "Title": "“Will NEVER go again!!!”", "Author": "Kates1Suffolk", "ReviewID": "UR63917831", "Content": "I stayed at the Ibis when I was in London doing an exhibition, I arrived and wasn't even greeted at all! The woman who was at reception was rude - it was like she couldn't even understand me. I work in the travel industry and customer service is very important to me. We ate at the hotel to try and 'save some money' but we ended up paying a ridiculous amount for about 8 chips and a tiny piece of chicken. The waitress we had was also rude! The room was OK, nothing special. Overall the staff were terrible and I would never return to this hotel, and I will be telling my clients to avoid it also!", "Date": "May 12, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Torino", "Title": "“Very nice stay”", "Author": "AlexaTorino", "ReviewID": "UR62696421", "Content": "Close to DLR stop Custom House. Basic rooms, but clean. Breakfast is also complete and the lobby staff is very kind. Close to the hotel a supermarket and some restaurants and bars. Very close to Excel. Free wifi connection would be great.", "Date": "April 28, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "2"}, "AuthorLocation": "Ireland", "Title": "“Clean, comfortable hotel”", "Author": "SLMC2010", "ReviewID": "UR61239085", "Content": "I stayed in the Ibis ExCel for four nights. I had been travelling for several hours and arrived before check-in, but they kindly found a free room for me which was lovely and clean. The bathroom was small, but perfectly functional and the shower was very big. The staff were courteous and I would definitely stay there again.", "Date": "April 13, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "2", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Yorkshire, UK", "Title": "“excellent value”", "Author": "N0rtherner", "ReviewID": "UR60623847", "Content": "I booked this hotel online through the ACCOR website about 6 days before the stay. I got a really good deal of £45 room only. On arrival check in was swift and the reception area was spacious and busy. There is an internet section, cafe and bar. Parking is underneath both the IBIS and NOVOTELL next door. £14 per night and you have to get the reception to stamp the card before paying at the NOVOTELL. I bought a glass of small rose wine which cost me £4.15 which is quite pricey, I could have bought a bottle for this price and taken it to my room! Later on in the evening I ordered a dessert about 1130pm which was nice and cheap - I think they do 24/7 food. The room was spacious with a huge comfy kingsize bed, linen was soft and nice and pillows OK. Bathroom has a huge shower with shower cream dispenser on wall, the only thing I wasnt happy about was only getting a small towel to dry with and the shower head falling off the holder and cracking me on the head. I got an email to complain about it but I have not yet had any response 3 days later!! The room has TV with pay per view options, an internet connection (at a charge) and tea, coffee making facilities. I didnt sleep very well because although I turned the heating down it turned itself back on constantly but other than this is was a good room for the price I paid.", "Date": "April 7, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "London, United Kingdom", "Title": "“Excel-lent for the 02 Arena”", "Author": "LadyWard1", "ReviewID": "UR57539627", "Content": "Stayed here before, simply great hotel, value, cleanliness, location for the 02 Arena, speedy check-in and out, great breakfast.", "Date": "March 2, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Location": "3", "Rooms": "3"}, "AuthorLocation": "Carlisle", "Title": "“OK hotel but a few issues”", "Author": "sweeney05", "ReviewID": "UR53185916", "Content": "Hotel is based pretty near DLR via underpass but still can take an hour to get into the city! Booking process easy online, hotel not especially cheap though for a budget hotel. Reasonable for London however. Room was OK - clean but with cheap fixtures and fittings. Poor insulation from noise outside - hotel right next to busy road. Not impressed with door adjoining room next door: didn't have any problems with guests next door but suspect I would have done if they had been noisy! Bathroom is basic, horrible plastic walk-in effort. No bath for youngsters, shower is in fact \"wet room\" where entire floor ends up being covered in water and effectively becomes open sewer! Horrible \"special needs\" chair and seat attached to wall made it feel like a hospital! Cooked buffet breakfast poor – scrambled egg dry and rubbery. Sausages dubious - poor quality. Continental breakfast offerings OK but Dualit toaster wasn’t working properly. On last morning before check out, went for early and quick breakfast, but there was no milk for cereal! The kitchen had run out! We were told a member of staff had popped to shops to buy some more! This is not what I expected from a modern, international hotel in London! We had to wait 20 minutes for milk – we had a train to catch! I complained at reception and received a refund for breakfast – problem resolved to my satisfaction, although it was still a waste of time and made us late. To be fair the woman on reception was professional, polite and efficient when dealing with this matter. Other staff were polite and friendly too – they made me and my four year old son us feel welcome. In general, the staff are the best thing about this hotel. Would go again assuming price is relatively competitive.", "Date": "January 11, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "3.0", "Value": "3", "Location": "2", "Rooms": "2"}, "AuthorLocation": "Peterborough", "Title": "“Cheap and Cheerful”", "Author": "xlii_iilx", "ReviewID": "UR43911693", "Content": "I stayed at this hotel as I was visiting an exhibition at the nearby Excel venue. I had not stayed at an Ibis previously, and if a choice was available, would probably choose Premier Inn over Ibis. I must stress that you can't fault the place for cleanliness and helpfullness of the staff. I am not really a budget hotel person, and I've stayed in places that are better value for money overall. Rooms: These are very basic. The walls appeared to be rough painted concrete or cement, there was no carpet, more like something you would find in a kitchen. The bed was not particualrly comfortable, as the matress was about 4in thick and put straight down on wood. The bathroom was like a modular unit, that was presumably dropped in when the hotel was constructed. The bathroom was very clean and the shower was roomy. Location: This was ideal for Excel, but not really for anything else. You could see the O2 (Dome), but this would be a fair distance if you were walking. The hotel is based near the DLR network, Custom House station. But the DLR does not run particularly late, so if you went out further afield, you may end up getting taxi. Noise: The problem with a budget hotel is the type of people who stay there. There was a lot of noise outside of the hotel at about 2am, this was even clear from the 7th floor. Colleagues who stayed the night previous, said it was noisy then also. General: The bar areas were clean and tidy, plus the drinks and service were OK. I did not eat at the hotel, other than breakfast. But this was continental, and for the price I would have expected a fry up.", "Date": "September 23, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Madison, West Virginia", "Title": "“Very Modern Excellent Hotel”", "Author": "ConniesAdventures", "ReviewID": "UR37561903", "Content": "I stayed here several nights with a large EF Tour Group. This was an excellent hotel with plenty of amenities. It was large, spacious, and modern. Check in was great. Staff was friendly and helpful. Expect lots of tour groups staying at this hotel. The rooms were comfortable and clean. The hotel was quiet. There is a large marina out back of the hotel and we had nice walks around the water as we watched the swans and boats. There was a small grocery store across the street. It was a great place to stay. Even though the hotel was located far from the center of Longon, the hotel was a short walk from the Tube (subway). The buffet breakfast was the best we had for 16 days in Ireland and the U.K. There was a pay Internet service in the lobby - 20 minutes for 1 pound and a pay telephone. Expect to wait if you want to use the Internet. There was a bar on the first floor. There was plenty of seating in the lobby for just lounging around. The elevators were modern and quick. I would definitely stay here again on a trip to London.", "Date": "August 13, 2009"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "liverpool", "Title": "“good price and location for london”", "Author": "buttercup78", "ReviewID": "UR36025464", "Content": "i originally booked this hotel for the michael jackson tour at the o2 and decided to still spend the weekend in london after his death. ive got to say im suprised by the other comments on here. i had no problems whatsoever. nice smooth check in - yes we paid on arrival - whats the problem with that? car parking is next door the ibis shares this with novotel and is £12 per night. the hotel rooms yet basic provide a very clean bed and shower for a weekend in london. we were on the 7th floor and had a nice view over the river. i cant comment on breakfast as i didnt have it but opposite the hotel is a nisa shop that has fresh coffee and croissants. the hotel is right next to excel on a new development mainly of apartments and two other hotels. there is the nisa shop a spar and a few bars/bistros i got the impression there was more to come. the DLR station royal victoria is a 3 min walk from the hotel and is around 15-20 mins to central london. the offpeak (weekend) day pass is £6.30 (not an outragous amount to pay for all day hopping on and off the tube) overall this is very good, clean, value for money, if you want plush pillows, hairdryers toiletries, etc go pay the £240 per night next door.", "Date": "July 28, 2009"}, {"Ratings": {"Service": "2", "Cleanliness": "4", "Overall": "2.0", "Value": "1", "Location": "1", "Rooms": "1"}, "AuthorLocation": "Yorkshire", "Title": "“Clean rooms, shame about the staff and the location”", "Author": "Denise86", "ReviewID": "UR34323886", "Content": "Stayed at the Ibis Excel for 1 night. We weren't expecting anything fantastic but were still disappointed in general. On the plus side the room was spotless and we had a good view of the river and the O2. On the downside, the reception staff were rude and uncommunicative and it took absolutely ages to check-in. Before we arrived we were told we would be able to check-in early yet when we got there were told it wasn't possible as no rooms were available just 1 hour early - find this hard to believe. If we'd not been told otherwise, we wouldn't have bothered trecking across London just to drop our bags off. The door to our room didn't lock properly. The hotel location isn't very handy for anything really. In general, I don't think it is even worth £65 a night. The quality of the hotel was what I'd expect if paying more like £40. Breakfast was ok - although choice was limited even for a continental breakfast. I wouldn't stay here again, its worth paying the few quid extra to stay in town so you don't waste half you're time on the tube.", "Date": "July 9, 2009"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Location": "3", "Rooms": "1"}, "AuthorLocation": "Hampshire", "Title": "“Go somewhere else”", "Author": "TravelGirlTravels", "ReviewID": "UR26153016", "Content": "I think this is probably the worst hotel I've ever stayed in........and I've stayed in a lot of hotels as I travel extensively for my job....... Everything was dirty; the staff or management were not interested in listening, the room was small & cramped and poorly equiped. There is only 1 pillow per person in the rooms...you want another one? Go to Reception Want a hairdryer? Go to reception Want some towels? Go to reception (please note these were not extra towels; there were not any towels at all) Need an extra blanket? Go to reception Want to settle your account on departure? Unlucky; you pay on arrival despite all Ibis literature saying you settle your account on departure and being assured when you book that this was the case and you are obviously wrong because the hotel staff would never say that to a guest....yes, that was what I was told on arrival. If you are buying drinks from the small & considerably overpriced bar, please make sure you have near enough the right money.....£17 change in 50p was not fun trying to get into my purse. No attempt to get any change from anywhere else let alone an apology; I had a smirk and shrug from the barman. Breakfast was not worth the £5.50 for a few croissant & coffee I had as I was 'too late and everyone else has eaten everything; you'll have to have what's left' (breakfast runs until 10am; I was there at 9.30am) I'm actually surprised this hotel is still trading; perhaps it's closeness to the Excel is the only thing that keeps it open....... I talked through my experience with some friends before posting this; I thought that I was expecting too much but as one friend commented that this was all simple & basic stuff that any decent hotel would provide as a matter of course; from a hairdryer in a room, to a few towels to a curteous service.", "Date": "March 14, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "3", "Location": "5", "Rooms": "3"}, "AuthorLocation": "Portsmouth", "Title": "“Great for o2”", "Author": "dollery8", "ReviewID": "UR25800712", "Content": "Stayed here for a Tina Turner Concert at the O2. Very good for access to o2 and excel. It's a very short walk from Custom house Docklands Light railway and is next to the Excel centre, takes about 30 mins from central london but again very easy. For the o2 it was 2 stops to canning town then 1 stop down to North Greenwich and the o2, very easy. And coming back from the concert was no problem as the crowds seemed to go the opposite way to us. The hotel is right on the docks and if you ask for a room on the waterside you can see the o2 from your window. First impressions very good, staff very attentive,hotel and rooms were very clean. Rooms are very basic but clean with a low bed with foam matress and bathroom pod with very good shower. Breakfast is Continental only from a buffet but very good choice rolls, cereal etc. Only problem was kids in the hotel, seemed like school kids staying while they go to school in city. When we arrived back at midnight a group of them in pyjamas were at reception and they were running up and down corridors.They continued to make a noise until about 4:30 am no one seemed to be supervising them and i was kept awake all night.When i poked my head out of the door one of them did apologise. I should of complained but was too tired. Overall a great hotel but if you do stay see if you can request a room away from the kids.", "Date": "March 8, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "England", "Title": "“Affordable, Comfortable and Polite Staff.”", "Author": "DisabledTraveler", "ReviewID": "UR24691383", "Content": "Myself and friends have stayed in this hotel a couple of times. It is really close to the Excel Centre as that was where we were going. The staff are friendly here and try and help you out with any problems that you may have. There is a carpark which is underneath the Novotel Hotel but the Ibis customers can use this, it is great value compared to the Excel Carpark. When i went it was about £12 for 24 hours. The rooms are quite spacious, was always clean and tidy when i went. The Bar is good value, you can get food from the bar once the restaurant is closed.", "Date": "February 17, 2009"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Business service (e.g., internet access)": "3", "Check in / front desk": "3", "Overall": "2.0", "Value": "2", "Rooms": "2", "Location": "3"}, "AuthorLocation": "London", "Title": "“Like Camping”", "Author": "EmmaPLondon", "ReviewID": "UR23485198", "Content": "We were attending a party in the docklands for NYE and decided to stay at the Ibis Excel rather than getting taxis home. It cost £88 for the room. I was aware that it was only a 2 star hotel, however the fact that the hotel was only built a few years ago and the positive reviews on this site perhaps led me into a false sense of security. The best way to describe the rooms is 'Caravan Like' the decor, bed and minimal furnature were exactly like the interior of a caravan! The bathroom was a single white plastic moulded unit (shower moulds into wall, then into sink) which appears to have been plonked into the room, its also tiny! Ours smelt terribly of drains/sewage too, lovely. There is no Iron or Hairdryers in the rooms. Hairdryers can be borrowed form reception and there are 'Ironing rooms' located on two of the floors! Not fun wile getting ready for NYE and having to get the lift to another floor then queue for 10 mins to Iron your frock in front of other hotel guests!! This seemed even stranger for a hotel which is predominatly for business users! Pehaps if this was more clearly advertised it wouldnt have been such an issue. The staff were not nessacarliy rude, but would just clearly rather be somewhere else. There was only one barman, and each time we ordered drinks we had to request our change!! Im all for tipping but a least let me have the option!! Check in/Check out was quick and hassle free though. Overall I would say that this is purely somewhere to rest your head for the night, If you are planning to make a weekend out of a trip to the o2 then perhaps another hotel might be better!", "Date": "January 12, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "3.0", "Value": "3", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Mechanicsburg, PA", "Title": "“Your Basic Hotel”", "Author": "Traveler0714", "ReviewID": "UR18207057", "Content": "I got back from staying at the London Ibis Excel a few weeks ago. I went with a large group and at 1 pm we checked in and got our rooms. The rooms were average in size. My room had a king bed and a twin bed. The bathroom was not that great. It was so tiny only one person could fit in at a time. The shower reminded me of a cruise ship shower (if you can picture one), very small. Sometimes the bathroom door would stick and you would have trouble getting out. The room was clean and I was happy about that. The breakfast was ok. There are long lines in the early morning, like 7, 8 am. It had meat, bread, pastries, cereal, and juice. The hotel is also very close to the DLR. It took about 5 minutes walking. Take the DLR and then you can board the Tube. This London Ibis Excel is just a very basic and average hotel. If you are looking for something small and clean, try this place.", "Date": "July 24, 2008"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Check in / front desk": "3", "Overall": "3.0", "Value": "3", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Rancho Cucamonga, California", "Title": "“Good Enough”", "Author": "Mrs_Kenobi", "ReviewID": "UR17857030", "Content": "It's an Ibis hotel, so be prepared for loads of teenage tour groups! I was in one of them. This isn't really a problem since the walls are thick enough, and the teens seem to contain their frivolity to the lobby. Unfortunately, there's only one telephone in the lobby and if you happen to need that phone, be prepared to have to yell to hear yourself over the billions of Columbian adolescent girls squealing in your ear. Well, that's what happened to us. The bar is nice though. They have a decent selection of beer and a large television showing random bar type programing. The rooms are clean, and big enough for my roommate, me, and our suitcases. The location would have been terrific since there is a train station just steps away from the hotel, but there happened to be some Christian revival going on at the Expo, which the station empties into, and we couldn't get back to our hotel either nights! We had to walk blocks and blocks around and over the river to eventually get back. This isn't anything against the hotel, but the British cops can be a bit wacky when it comes to events. The service seemed okay. The bartender was a bit slow, but it was busy, so I understand. I'm not sure about other services as I didn't require anything special. Although, when my tour group was going to stay out late, my parents returned to the hotel early by taxi, and they were able to get their key, and luggage from the storage room (we had to check in early). So they were accomodating in that regard. So, busy, but decent. I'd stay there again. I'd just make sure nothing is happening at the expo next door before I book a room.", "Date": "July 14, 2008"}, {"Ratings": {"Cleanliness": "4", "Business service (e.g., internet access)": "3", "Check in / front desk": "3", "Overall": "3.0", "Value": "4", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Beccles, UK", "Title": "“It's an Ibis!”", "Author": "BlueSquareThing", "ReviewID": "UR17622531", "Content": "This is an Ibis hotel. That means you pay a reasonable amount and get the standard Ibis service - fine but no great frills. If you want great luxury then go someplace else. If you want a fair price for an OK bed in London with reasonable services then this is fine. For me, three major plus points: fairly easy to get to and from the centre; air con; quiet (didn't hear a plane at all inside the hotel). A desk to work at, a bar to get a beer at and a reasonable shower were good bonuses. The food's not great, but it's an Ibis so it's what I expected. I obviously didn't get caught up in huge tour parties which could be a problem I guess, but I'll stay here again when I need to be in London working.", "Date": "July 7, 2008"}, {"Ratings": {"Overall": "1.0"}, "AuthorLocation": "Northampton", "Title": "“Avoid!!! Avoid!!”", "Author": "SnowyP", "ReviewID": "UR16752514", "Content": "Arrived at hotel just past midnight, having booked it four months in advance, to be told that they had no room for us!!! They taxied us to their Barking hotel, which was no where near any underground station and gave us a mere £10 reduction for our trouble!! So if you book this hotel, I recommend, you telephone on the day to check they have not given your room away to someone else. I thought this sort of thing only happened in Spain!!!", "Date": "June 7, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Business service (e.g., internet access)": "3", "Check in / front desk": "4", "Overall": "4.0", "Value": "5", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Essex", "Title": "“Great va;ue for money”", "Author": "Clifftours_7", "ReviewID": "UR15638466", "Content": "Just used this hotel for 1 night stay to save either of us driving or travelling late. Brilliant value for money considerig location and people should bear this in mind when reading the negative reviews. Room is small but very functional and spotlessly clean, as is the whole hotel. Also breakfast is again great VFM, with ample choice of breads, baguettes, 'real' ham, fruit, cereals and cakes. Service was always friendly and if you're looking for a place to stay for £65 then you can't go wrong.", "Date": "May 4, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "4.0", "Value": "4", "Rooms": "3", "Location": "4"}, "AuthorLocation": "WEST YORKSHIRE", "Title": "“Great Break Away”", "Author": "PCEFLECFLN", "ReviewID": "UR13579784", "Content": "Initially I was going to stay at another hotel, but then read reviews on this page that made me think twice. A couple of posters gave me the heads up on the Ibis Excel and after checking its reviews on here I decided to go ahead and book it. I just got back today! I visited London with my 11 year old son for a respite break from fostering, we were looking for a hotel to use as a base after busy days sightseeing. The hotel is situated at the Docklands which initially seems a bit of a way out from Central London, but once you get on the jubilee line its a straight ride through to Canning Town and then just one stop on the DLR to Royal Victoria. you need a travel card to cover zones 1 to 3. The hotel is a 5 minute walk from th DLR, exit the station take a right and then follow the road as it bears around to the left its right next to the Excel centre (i put the directions down because we couldnt find it when we got off the DLR and wandered around nervously for a bit and there were loads of workmen around as the area near the DLR is under development) The hotel was just £55.00 a night and so for 4 nights we only paid £220.00. It was half term as well and so we expected it to cost more. (Breakfast not included £5.50 for adults and half for children under 11) The first impression was good, the hotel was clean, the carpets/floor, the tables, the bar was well stocked and the waiting area was bustling with life as many guests sat around comfortably having a drink and having a laugh. The hotel reception staff were very friendly and helpful which put me at immediate ease as this was the first time I had travelled to London for fun rather than on business or training. We were served quickly and efficiently and given directions to our room, which was a bit small but was situated on the 3rd floor and had an amazing view of the waterfront. (the morning views were amazing) The bathroom was spacious and the shower was huge and very powerful. The bathroom was very clean also. Tea and coffe faciilities in the room as standard.. The double bed was comfortable and there was a single bed in the room too. There was sufficient wardrobe space but not enough storage space for our cases which ended up on either side of the bed which was a bit inconvenient, but not major at all! The rooms were cleaned well each day and re stocked with all facilities. We ordered food from the bar on one night only because the restaurant said it would be 40 minutes as they were so busy, but the service at the bar was good, if a touch pricey. £7.50 for a v small margherita pizza. Drinks were overpriced too £1.80 for a tiny glass of coke, seemed less than a regular 330ml cans worth! overall we were very pleased with the Ibis Excel and decided that it was a good value stay and the next time we went to London we would definately book there. (top tip, make sure you leave over an hour travelling time to get back to Kings Cross, we only just made our train this morning as there's such a long journey back to central London.", "Date": "February 15, 2008"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Business service (e.g., internet access)": "3", "Check in / front desk": "4", "Overall": "5.0", "Value": "4", "Rooms": "4", "Location": "3"}, "AuthorLocation": "East Kilbride", "Title": "“Great Hotel!”", "Author": "kylieclyde", "ReviewID": "UR12429403", "Content": "Me and my sister stayed here for one night as we were down to see the Spice Girls :) It was a great hotel to stay in but we only stayed for one night, i might feel a bit different if it was 4 or 5 days as the rooms are quite small. They were clean and the view from our room was amazing, right on the water. The staff were ok, we were asking how to get to Madame Tussauds and they didnt have a clue what i was on about so ended up having to look up the net ourselves but managed to get the directions to the tube from them, which was only 5 minutes away! We got an all day ticket for the tube for £5 which got us to madame tussuds and the o2 arena. We tried to phone a taxi company but they were going to charge £30 to get there and back to and from the o2 arena. The area around the hotel seemed like a ghost town there was nobody about anywhere. The bars that were near the hotel where empty. I think this may be the time of year that we went as everybody would have left after the new year. We got 2 diet cokes from the bar before we went to bed and it cost £3.50 so god knows what the alcoholic drinks cost! The breakfast was great you can take as much as you want from a large choice of fruit, yoghurts, bread, meat, baguettes, croissants, muffins, tea & coffee. The only thing that really worried me was when we were leaving we asked the receptionist to call us a taxi. When the taxi arrived it was unmarked and there was no meter in the car so i think it was an unlicensed cabbie.... not a good move as we are two young girls travelling alone! He charged us £8 to the airport which is what we paid there anyway!", "Date": "January 8, 2008"}, {"Ratings": {"Service": "1", "Cleanliness": "4", "Business service (e.g., internet access)": "1", "Check in / front desk": "1", "Overall": "2.0", "Value": "2", "Rooms": "3", "Location": "4"}, "AuthorLocation": "UK", "Title": "“Poor Service”", "Author": "Mona216", "ReviewID": "UR12191072", "Content": "The only reason to stay here is if you have business at the Excel Centre- even so it might be worth it to travel in from central London. On the positive side- the facilities are clean, even if the rooms are small. The location across from the Excel Centre is excellent for the business traveller. Downside, staff were unhelpful and in some cases frankly rude. There is one public computer in the 'business centre' and as I experienced at another Ibis hotel in London, Internet access is easy only if you're affiliated with the Orange telecommunications group. Not ideal! Surrounding restaurants tend to be pricey, but if you must stay in this area, I'd recommend the Caribbean restaurant on the waterfront ( 3 minutes walk from the hotel).", "Date": "January 1, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Business service (e.g., internet access)": "4", "Check in / front desk": "4", "Overall": "4.0", "Value": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Attendorn", "Title": "“Ibis London Excel - a great place to stay at”", "Author": "GambateRossifumi", "ReviewID": "UR11457969", "Content": "The Ibis London Excel is one of the finest hotels I've ever seen. The outwardappereance is really clean and modern and it's like this inside. The bright entrance-hall and the bar beside are very welcoming and create a nice atmosphere. The hotel is directed at the exhibitioncentre Excel and it takes about 2 minutes to the station. And after max. 15 minutes you arrive at the city centre. The hotel's got a nice dinning-room, where you can enjoy your breakfast, lunch or dinner. The food is very good and theres a lot to chose from. Theres marmalade, cheese, pork, and yoghurt, 3 different kinds of cereals, different types of bred and baps. The staff is very nice and unproblematic. If you have something to complain about or to ask, you are always welcome. The rooms were comfortable and nice decorated. The bath was clean and the TV is a great enrichment, because you can watch naitonal TV-Shows and Eurosport, which I liked very much. In the hotel, theres said to be a sauna or something, but we weren't able to find (and we didn't search ambitiounesly). Concluding the Excel is a great hotel, which makes your stay in London even better.", "Date": "December 10, 2007"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Business service (e.g., internet access)": "1", "Check in / front desk": "1", "Overall": "1.0", "Value": "1", "Rooms": "1", "Location": "5"}, "AuthorLocation": "Vietri sul Mare, Italy", "Title": "“Worst Experience And I have travelled the world!”", "Author": "Lex59", "ReviewID": "UR11137468", "Content": "I am in Tourism and as such attended World Travel Market. A friend of mine works that exhibition and booked an extra room and offered it to me, even at no cost it was disgusting. I am shocked to read some of these reviews as it was the most appalling experience I ever had in my life. In fact as guests walked down this was consistently the talk on the lifts (elevators) and all public areas, namely how appalling the place was. The hotel staff were rude, not just unfriendly or unhlepful but outright rude. The rooms were so basic it was frightening. As you enter it smells musty or something, then you realise that your bed is two small beds on a wood frame that is half the size of a normal single. the mattress is thin, almost like they would issue in a jail or at a summer camp. The sheets dirty (place a dot with a pen on your pillow and sheets the first day and you will see them until you leave. The shower is clean but the entire bathroom is a cubicle built into the room. Water fluctuates so you may have it on hot and get a burst of cold and adjust it hotter then get burnt, I complained but this went unanswered. They give you two towels that are somewhere between hand and body towels, very odd. Almost none of their staff has a true fluid prooficiency of English, most being imported from France, and the service is reminiscent of being in the worst sections of Paris. They claim to offer wifi yet when I paid and did not get and used it and it went out, FOUR times, they not only would not call the company on a free phone number for me, but they did and put through to my room later to charge me a pound for each of the four calls, I was astounded. If you are the camping/trailer type then this may be acceptable for you, but if you need to stay in accomodations more than what you would expect a jail to offer, by all means go spend the extra 30 pounds a night and stay at the stellar hotels nearby like the sister Novotel and the Crowne Plaza both of which are fabulous and offer great service and nice rooms. The Ibis was built mainly to bilk people out of money during peak exhibitions when the other hotels fill up, sorry I would rather pay for the cab ride and stay off site next time.", "Date": "November 29, 2007"}, {"Ratings": {"Cleanliness": "4", "Check in / front desk": "4", "Overall": "4.0", "Value": "3", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Washington", "Title": "“Great Hotel”", "Author": "MS09090909", "ReviewID": "UR10859418", "Content": "Absolutely wonderful hotel. Very clean, has a great continental breakfast. It is not in the city but easily accessible by light rail. Only a short walk to the DLR station. Definitly bring a hairdryer though they were out during my entire stay and they don't have them in the rooms.", "Date": "November 16, 2007"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Business service (e.g., internet access)": "2", "Check in / front desk": "3", "Overall": "3.0", "Value": "5", "Rooms": "4", "Location": "3"}, "AuthorLocation": "fife", "Title": "“Good...”", "Author": "MrsPScot", "ReviewID": "UR10063226", "Content": "Hotel was nice and clean, slightly overcrowed due to amount of guest staying, the food was lovely. One thing that did concern me was that a couple of items went missing from our room, i did say say to the receptionsit and i did say say that it wasnt a big deal as that it only amounted to about £1 worth of stuff but the receptionist laughed when i walked away which i wasnt too pleased about and felt that it should of been taken seriously respective of wether i want to make an issue of it or not. due to this fact it be unlikey that i will stay there again and due to ongoing development in the area i may stay in neighbouring hotels.", "Date": "October 10, 2007"}, {"Ratings": {"Cleanliness": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Tipperary Ireland", "Title": "“Very Good Hotel”", "Author": "Sunflower09", "ReviewID": "UR8418975", "Content": "I stayed in the Ibis Excel and found it to be very good value for money our room was clean and tidy and we found it very easy to get into the city centre from here. The receptionist staff were very friendly and helpful even though we had got to the hotel very early they still let us check in, we were delighted about this as we were tired from a very early morning flight and we didn't have to carry our bag around London all day. The nearest station to the Hotel is Royal Victoria and then the Hotel is only a two minute walk away. We were going ot the O2 Arena to see Prince and this was an Ideal location it was just one stop from Royal Victoria to Canning Town where you change for the Jubliee line and one stop on the Jubilee line to North Greenwich this only took 10 mins at most. The concert itself was fantastic and we had no trouble returning to our hotel that night. I will be staying here again without a doubt I just wish we had another Prince Ticket.", "Date": "August 14, 2007"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Check in / front desk": "3", "Overall": "4.0", "Value": "4", "Rooms": "5", "Location": "3"}, "AuthorLocation": "east sussex", "Title": "“Great Value”", "Author": "mrspink3", "ReviewID": "UR8242002", "Content": "Stayed just 2 nights but a great value hotel in an expensive city. Loved the water by side it and the few bars close by. Would go again. The hotel is 2 mins walk to the Docklands Light Railway and for £5.20 a day you can hop on and off of the tube, DLR and the buses. Had a great time.", "Date": "July 27, 2007"}], "HotelInfo": {"Name": "Hotel Ibis London Excel-Docklands", "HotelURL": "/ShowUserReviews-g186338-d289185-Reviews-Hotel_Ibis_London_Excel_Docklands-London_England.html", "Price": "$87 - $214*", "Address": "<address> <span rel=\"v:address\"> <span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">9 Western Gateway</span> | <span class=\"extended-address\">Royal Victoria Dock</span>, <span class=\"locality\"><span property=\"v:locality\">London</span> <span property=\"v:postal-code\">E16 1AB</span></span>, <span class=\"country-name\" property=\"v:country-name\">England</span> </span> </span> </address>", "HotelID": "2514231", "ImgURL": "http://media-cdn.tripadvisor.com/media/photo-s/01/b6/55/01/hotel-river-view.jpg"}}