{"Reviews": [{"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "1.0", "Value": "3", "Sleep Quality": "1", "Rooms": "2", "Location": "4"}, "AuthorLocation": "Dublin, Ireland", "Title": "“Glorified hostel”", "Author": "Suzanne908", "ReviewID": "UR127186401", "Content": "We had booked into stay at the Oxford Hotel in Earl's Court but were told upon arrival that the hotel was fully booked (despite the fact that we had booked 2 months previously). We were sent to their \"sister\" hotel the Westbury which was about a 5-minute walk away. Apparently this is one of 8 \"sister\" hotels in the area which explains other people's posts about being moved from one hotel to another. I would describe this hotel as a glorified hostel. It was clean but very basic, a tiny bedroom with thin walls and even tinier beds. I have no problem sleeping in a single bed but these beds were child-sized and I was at risk of falling out each time I turned! The worst thing was the temperature of the bedroom; it was absolutely freezing. When we arrived in the room the 2 windows were wide open. We closed the windows and went out for dinner. When we arrived back at about 11pm the room was still very cold and neither of the radiators were working. I called down to reception at about 11.45pm and was told that the heating would be coming on in ten minutes. It didn't. It was a long, chilly, uncomfortable night made worse by the noises coming from next door through paper-thin walls and the fear of falling out of the cot-sized bed. The room was still cold the next morning so we had a quick shower and got out of there. We didn't even bother with breakfast. All I wanted was was a comfortable night's sleep...", "Date": "April 3, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Cork, Ireland", "Title": "“Clean, Quiet and Comfortable hotel - excellent location and value”", "Author": "7063b", "ReviewID": "UR126781785", "Content": "Booked a triple room Basic accommodation Room and bathroom were very clean Very cost effective - 55 pounds for the night Excellent location in Earls Court within walking distance of Kensington High Street Very helpful and friendly Receptionist Basic breakfast offerings Would recommend for cost conscious travellers", "Date": "March 27, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Saltash, United Kingdom", "Title": "“A well positioned hotel for all the sights of London”", "Author": "wrighton53", "ReviewID": "UR125136370", "Content": "After looking at some the reviews on Trip advisor and getting a good deal off the internet, I book a room at this hotel. I was greeted by a very friendly receptionist who gave me all the information on the hotel, and of the surrounding areas of the hotel. There is a lift in the hotel so getting the bag to the room was no problem, the room its self was sufficient with a on suite bathroom (no bath only an open shower), a tea/coffee making area, flat screen TV (which the reception ask a five pound deposit for the use of the remote control, during your stay. I said no to that option, when I looked at the TV I found the manual controls on the side of the TV as well as the on/off switch), I had a single room (but it had two single beds in it), a telephone and one chair. The room was very clean, and a maintenance man came round and fixed some lights. Which I take the previous occupant had reported, there was the bar of small soap and shampoo in the bathroom. I managed to get the room for thirty five pounds including continental breakfast which consisted of tea or coffee, toast or bread, with spreads or cheese and three different cereals and hot or cold milk. The full price of the room was 90 pound plus, at that price I would have hoped for a better breakfast as the other hotels I have stayed at over the years in London have done better breakfasts. But for the price I got the room for, and being central (Earls court underground station at the end of the road) I think overall it was a valve for money and I got a good night’s sleep with no noise.", "Date": "February 24, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Hunter,Ohio", "Title": "“All that's needed and value too”", "Author": "stillmrscalabash", "ReviewID": "UR123262590", "Content": "Exactly what we needed, no more, and certainly no less. We were tourists and all we needed was a place to sleep. We got that and more for a reasonable price. The staff is probably the best of their amenities (Hi Catherine:). The free WiFi was important to us. CLEAN was also important and it was. The contenintal breakfast was simple but adequate to start the day. We were within short walking distance of the Tube, from which you can access all of London and beyond.", "Date": "January 18, 2012"}, {"Ratings": {"Service": "2", "Cleanliness": "2", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "4"}, "AuthorLocation": "?gios Athanásios, Thessaloniki, Greece", "Title": "“i don t recommended it”", "Author": "dimitra P", "ReviewID": "UR120759462", "Content": "it was the worst hotel room i ever slept...the room was depressive and tiny enough..there was a lot of noise..the bed's mattress was uncomfortable and 30 years old at least...the breackfast was not good..it was like you were sleeping in a hell....if i have the chance to choose a hotel,i will never choose this one...", "Date": "November 18, 2011"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Newbury, United Kingdom", "Title": "“A nice surprise !”", "Author": "332Claire", "ReviewID": "UR117668660", "Content": "After reading previous reviews I was close to tears about booking this hotel. But we had a great stay, 7 of us went for a weekend in London we dropped our bags off in the morning and returned late at night and checked in. They staff were lovely and helpful the rooms were all clean I didn't need to use my anti bac wipes that I always take with me ! Breakfast was simple but perfectly nice and we didn't find the breakfast staff rude. We left our bags there the following day while we went shopping. On our return the girl behind the desk was lovely and helpful. I am really picky and a bit bathroom OCD but we had no complaints (only about other guests) I had no reason to worry, in fact we all said we would go back ! Its a great location, great price, clean, with friendly staff.", "Date": "September 4, 2011"}, {"Ratings": {"Cleanliness": "2", "Sleep Quality": "2", "Overall": "1.0", "Value": "2", "Service": "1"}, "AuthorLocation": "Birmingham, United Kingdom", "Title": "“AWFUL HOTEL, THIEVING STAFF, PLEASE STAY AWAY FROM THIS HOTEL”", "Author": "manibainz", "ReviewID": "UR117035511", "Content": "Booked two nights at this \"hotel\", booked last minute via Booking.com. Hotel is very easy to find and close to Earls Court tube. Was told had to pay £5 for remote control, which I might add WASNT refunded back to me at the end of stay! Staff walk in without even knocking, I found this really rude as I could of been getting changed or been with my partner! Room was tiny, smelt and the shower wasnt working and only gave hot water, breakfast was poor. On my 2nd night, I popped out for abit of a stroll and on my return I noticed someone had been in my room, as window was open, and my stuff was all over the place, and my debit card was missing! Issued a complaint to the non English speaking manager and still awaiting for a response from them! Terrible hotel, 1 of the worst I have ever had the misfortune of staying at and never again! PLEASE AVOID YOU CAN GET BETTER HOTELS IN THE AREA!", "Date": "August 21, 2011"}, {"Ratings": {"Cleanliness": "1", "Sleep Quality": "2", "Overall": "3.0", "Value": "2", "Service": "3"}, "AuthorLocation": "Vantaa, Finland", "Title": "“Airconditioning would do a lot!”", "Author": "Nopsa", "ReviewID": "UR116460100", "Content": "There was a heat wave in London during our trip but the hotel didn't have any kind of airconditoning. The only way to get fresh air (in general) was to keep windows open, even if it didn't help much. There was a kind of small ventilation system in toilet but you had to keep lights on in order to make it work and as it was very noisy, sao you couln't leave it on for a night. The room had a wall to wall carpeting which is really something terrible from the 70´s but luckily we had medication with us due to allergies. The room was not vacuumed even once during our 5 day long stay. The room was very dusty. The closet didn't have any shelves. Breakfast was ok, except the instant coffee..Location is the best asset of this hotel. This is a budget hotel in quality, not in price.", "Date": "August 9, 2011"}, {"Ratings": {"Cleanliness": "2", "Sleep Quality": "3", "Overall": "3.0", "Value": "3", "Service": "4"}, "AuthorLocation": "Helsinki", "Title": "“Simple and a bit worn out but service was brilliant”", "Author": "aalyela", "ReviewID": "UR115385196", "Content": "I stayed there with two friends of mine for three nights in july 2011. We didn't have high expectations because we had so good deal. We only needed a clean place to sleep and shower in. But the welcome was very nice, the women in the reception was very kind and helpful. We had a double room with a extra bed. The room was small and there wasn't a lot of extra space after three persons suitcases. But the room did its job. We had a peaceful sleep there and the hotel's location was ok for exploring London. The breakfast was very very simple but we knew that already in advance so it wasn't a surprise. + very nice and helpful staff good location clean bedsheets coffee and tea making facilities - small rooms mould in the shower curtain overall a bit worn out", "Date": "July 15, 2011"}, {"Ratings": {"Overall": "1.0", "Value": "1"}, "AuthorLocation": "Devon, Uk", "Title": "“Rip Of London at its best.”", "Author": "Spokes_123", "ReviewID": "UR114957590", "Content": "Let me start off by saying I have not stayed at this hotel. However I came across it on the internet looked ok and was in the right area for out trip to see friends. The on the net price of £80 for a double seemed ok and the hotel had a good customer review on its web site. I rang up to confirm the booking however was told there was a very small double available, not at £80 but £168. I queried this and was advised that was the price as her boss had put up the price because its the finals week at Wimbledon. As incredible as it may seem and not being a City Slicker I thought the extra price hike was a rip off and one I was not prepared to pay on principle let alone financially. I then had a look at trip adviser and am now so glad the price was hyped up for the weekend. Thanks", "Date": "July 2, 2011"}, {"Ratings": {"Cleanliness": "1", "Sleep Quality": "1", "Overall": "1.0", "Value": "1", "Service": "1"}, "AuthorLocation": "Minneapolis, Minnesota", "Title": "“You couldn't pay me to stay here again!”", "Author": "KidRanger", "ReviewID": "UR114837257", "Content": "Tiny. Dirty. Old. Uncomfortable. Shabby. Spotty service (no maid service on Day 2 of our stay.) The bed was a small metal frame with squeaky springs and a thin mattress. Had to leave a 5-pound note at the front desk to get a remote for the wall-mounted TV, which had all of 4 channels. The sink in the bathroom was loose and ready to fall off the wall. And expect to smack your knees on the sink drain pipe when sitting on the comode. Simply awful.", "Date": "June 28, 2011"}, {"Ratings": {"Cleanliness": "1", "Sleep Quality": "1", "Overall": "1.0", "Value": "1", "Service": "1"}, "AuthorLocation": "Athens, Greece", "Title": "“The worst hotel ever stayed”", "Author": "FakeHoetelSurvivor", "ReviewID": "UR114596459", "Content": "I could not believe that there are hotels registered with the star system, or proposed by internet booking companies offering such conditions of staying. In brief: Very small space in rooms, just a part of the corridor Dirty enough to appreciate other experiences in undeveloped regions of this planet Bed wide enough to fit to the \"corridor\" room and not to sleep two adults We investigated that finally there was a convenience to reach everyting in the room without moving a step; so there was need for TV control, swithes, etc. This hotel costed the same as other real hotels! I wonder whether I might consult your satisfactiion marks again; this experience indicated to me that they are far from real conditions.", "Date": "June 21, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "2.0", "Value": "2", "Sleep Quality": "2", "Rooms": "2", "Location": "5"}, "AuthorLocation": "Lille", "Title": "“disappointed...”", "Author": "jygugenheim", "ReviewID": "UR88538134", "Content": "Our double room was very tiny as the bed. The most annoying was the noise coming from heating ducts probably rotten to me at night ...The hotel is well located and clean but I do not feel comfortable in this hotel.", "Date": "November 29, 2010"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Overall": "3.0", "Value": "4", "Sleep Quality": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "blatna", "Title": "“Good hotel for a good value”", "Author": "jaru024", "ReviewID": "UR86398360", "Content": "It was a good hotel, rooms was smaller, but it was OK. There was a very small bathroom, but clean. What annoyed me, the rooms was a really cold - freezing. The staff didn´t wanted to warm up. May be the room had about 15.0C. I loved the breakfast.", "Date": "November 8, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "3", "Overall": "2.0", "Value": "3", "Sleep Quality": "2", "Rooms": "1", "Location": "5"}, "AuthorLocation": "Chicago", "Title": "“Most sincere apologies”", "Author": "LP_Dave", "ReviewID": "UR86245506", "Content": "This hotel has some of the nicest staff I've encountered, especially in the UK. I could tell they truly felt bad about the WiFi that, occasionally, managed 1995-era modem speeds. They honestly wished the bed wasn't part of the original Edwardian construction. And they completely empathized with me about the shower curtain getting frisky with me because the shower was only 40 cm across. (By the way, Americans might take note that UK plumbing is random; you have a 50-50 chance of the hot water tap being on the right.) That said, the location is perfect—which explains the 50 other hotels within a short walk of the place. Kensington makes an ideal base for exploring London. The hotel is just 150m from the Earls Court tube stop, which has lifts from the Piccadilly (Heathrow) line and also access to the District line, either of which gets you to SoHo in about ten minutes. And Kensington itself is beautiful, all Victorian through Georgian row houses and walk-ups. Ignore the pubs right near the tube, too: go to the King's Head, nestled on a side street about 5 minutes walk from the hotel.", "Date": "November 7, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "3.0", "Value": "2", "Sleep Quality": "2", "Rooms": "1", "Location": "5"}, "AuthorLocation": "Singapore", "Title": "“Rooms can't get any smaller”", "Author": "Chung1234", "ReviewID": "UR82089836", "Content": "Stay there from late Sep to early Oct 10. The service of the staff was very good. The receptionist, Miss Cattherine was very helpful. THe location was great, very close to Earl's Court Stn. The breakfast was nothing to shout about but with the price of the room, one just cannot expect too much. There was a an issue with the free wifi signals and some rooms could not get signals. The room and bath room are clean. The only problem is the size of the room. Both the single and double rooms are also very small. I have not stayed in a hotel room smaller than this. Not even those in HK and Tokyo. Overall, ut was a good experience if space is not a concern.", "Date": "October 4, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "3"}, "AuthorLocation": "Fort Mitchell, Kentucky", "Title": "“This was the worst hotel I've ever stayed in!”", "Author": "milford1984", "ReviewID": "UR72886413", "Content": "My colleague and I arrived at the Westbury Hotel late on the evening of July 3, 2010. The lobby was small and uninviting and the clerk was less than friendly. When we opened the door to our room there was a musty smell. Things got worse from there. There was no air conditioning so we opened our window which was a big mistake. Someone was smoking in one of the nearby rooms and the smell wafted in through our window throughout the night. There were noisy people in the rooms around ours who were coming and going late into the night (morning). The bed consisted of a thin mattress on a cheap metal frame and the bedding was atrocious. I was afraid to touch anything in the room. The bathroom was not much better, so small that you literally couldn't shower properly in it. I went to the front desk in the morning only to find another guest and her family complaining about the same issues I had encountered. The desk clerk was unsympathetic and would not take any steps to make things right. I immediately booked a room at a nearby hotel which was a huge improvement over the Westbury. Do not book a room here!", "Date": "July 29, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Felixstowe, United Kingdom", "Title": "“Good value if you're on a budget”", "Author": "SophieW90", "ReviewID": "UR68101214", "Content": "If you want to visit London but have a tight budget this hotel is ideal. It has flaws of course, but for the price and the location what can you expect? It is in zone 1 of the Underground network, making it cheap and easy to get around... as a matter of fact my boyfriend and I walked into central London one day! The rooms are very small, which didn't bother us but might bother some people. I will echo other reviews that I've read advising you to avoid a basement room. We had a basement room and could not get a wifi signal, and there was mould in the bathroom. It was okay but if possible try and book a room not in the basement, definitely do so if you are allergic or have asthma. Mixed opinions on the staff, of the women on reception one was very polite and helpful, whereas the other was immensely rude and unapproachable. The definition of the word \"continental\" is stretched somewhat by the breakfast, it's just toast and cereal really. Also the breakfast room is tiny and the counter is poorly organised. However, the bed was comfortable, the location fantastic, and we thoroughly enjoyed our city break. I would recommend this hotel as long as you're under no illusions about it!", "Date": "June 20, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "2.0", "Value": "4", "Sleep Quality": "3", "Rooms": "2", "Location": "5"}, "AuthorLocation": "Lakewood, Colorado", "Title": "“Harry Potter's Broom Closet”", "Author": "LisaWP", "ReviewID": "UR62024284", "Content": "I had read many reviews on this place (after I booked of course) and must say, you never believe it until you're there. The best thing about this place is that it is only two blocks away from Earl's Court tube. The room we had was really small and it was quite noisy in the morning when you're trying to sleep. If you don't mind an exceptionally tiny room to stay in - stay here. If you want a little more elbow room - go somewhere else.", "Date": "April 20, 2010"}, {"Ratings": {"Service": "2", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "3", "Location": "4"}, "AuthorLocation": "ireland", "Title": "“Nice but basic Hotel, Good Location”", "Author": "jay101", "ReviewID": "UR59655496", "Content": "I needed to find a cheap hotel for our stay in London, and we were very happy with this one. The Good: Its near the tube and on the main line from heathrow which is really easy to get to. It was really good value compared to alot of other hotels. We found it really quiet most of the time. the lift was nice, so no stairs needed room had tea coffee etc The Bad : Ok the room was very small, but we didnt mind, we didnt go to london to sit in a hotel room. The TV - i think you need a deposit for a remote contol (fair enough) but we tried to watch it without it - but had no control over any channel or volume :( When we arrived the reception girl, wasnt really friendly - monotone in fact. A simple welcome to our hotel and a smile can make all the difference! and cost nothing.,.. But we were up in our room in minutes. Breakfast is served in the basement, there was plenty to eat like cereal and toast and eggs and yougurt etc. enough to keep you going until lunch time. All in all worth the money, good location - although the road can be noisey in the morning.", "Date": "March 27, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Location": "5", "Rooms": "2"}, "AuthorLocation": "Manchester", "Title": "“Basic but clean”", "Author": "kimlou_27", "ReviewID": "UR50509605", "Content": "I stayed here for 3 nights. We wanted a budget city break so we expected not to have a top class hotel. On arrival the receptionist was very pleasant but forgot to inform us that the hotel does have a lift, so we had to carried our cases up 2 flights of stairs. our room was tiny, the saying 'not enough room to swing a cat' comes to mind. The bathroom is like a wet room. The room with the beds in was freezing cold, the radiators were on but i doubt that they were working properly. Also you need to pay a £5 refundable deposit for the remote control in the room. The breakfast is very basic, toast and cereal. The hotel seemed very busy so we had to queue for breakfast. The hotel is basic, could do with a little updating and possibly needs some more thought to the breakfast menu. But it is in an ideal location for sightseeing and jumping on to the underground, as the station is 10 minute walk away.", "Date": "December 2, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Location": "3", "Rooms": "3"}, "AuthorLocation": "UK", "Title": "“Good value budget hotel near Earls Court”", "Author": "Loves_Good_FoodUk", "ReviewID": "UR50413781", "Content": "I stayed here with my friend for one night in November. I paid £67 for a twin room with breakfast included on a Saturday night in November. I was pleasantly surprised by the clean looking hotel, friendly staff and adequate sized room with a spakling clean shower room. Free wifi was available in our room. There was also a large flatscreen tv (remote was avaialble for a £5 refundable deposit, from reception). Breakfast was served between 7-10am and included tea/coffee/juice/milk with 3 choices of cereal, toast, hard boiled eggs and jams. Be aware that breakfast ends promptly at 10am when all food is removed and tables cleared - we were a little caught out by this. Otherwise, it was all good - the hotel was just 5 mins walk from Earls Court tube and after checkout we were able to leave our luggage securely until the end of the day.", "Date": "December 1, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Location": "4", "Rooms": "1"}, "AuthorLocation": "hull", "Title": "“If you suffer from claustraphobia... AVOID!!”", "Author": "HullSmarties", "ReviewID": "UR49843525", "Content": "Staff were very helpful, however, rooms were extremely tiny and beds were NOT doubles!! If you like rooms where you can touch all four walls at the same time... then this is for you!! Rooms were clean and staff worked hard...however, I would not recommend this hotel on the grounds that the beds were too small and uncomfortable, the breakfast was very basic and the rooms noisy. bags of linen piled in corridoor outside our room for all of 3 day stay!! fire hazard and accident waiting to happen.", "Date": "November 22, 2009"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Location": "1", "Rooms": "1"}, "AuthorLocation": "Sydney, Australia", "Title": "“This is a con hotel! Avoid!”", "Author": "FrankieHongKong", "ReviewID": "UR49041159", "Content": "What's worse than smell room, dirty linen, blocked toilet, etc...... To me that is when you book the room and deposit taken and when arrive and was told that room is not available. Booked the Westbury Hotel Kensington through HotelClub. I arrived at hotel early afternoon, the reception told me that there was no room available! I could not believe this. The receptionist told me that they had some problems with the rooms. They said that they had arranged another hotel for me and they would drive me there. The other hotel was in Queensway which I am not familiar with. I was not happy with the situation but after 14 hours flight, I did not want to look for hotel with 2 big suit cases and so I had no other option but to accept. What I found very annoying was that the reception took it for granted that they did not have room for me, there was no apology at all! Not even a simple 'Sorry'. She said I was not the only one and the hotel had sent 3 other people away. I wondered did this help me to feel any better at all? The Wedgewood hotel they put me was terrible. The bed was a rollaway and the mattress was so soft that you felt like sleeping on marshmallow. The bed was very small and I tended to fell off the bed when I rolled my body. Had sore back each morning. I wondered why they put me to a hotel 10 minutes away rather than in the Earls Court area. The answer was clear. That hotel is obviously their sister hotel as they share the same reservation system. To me, that is a con! It just seems to me that the Westbury keep taking hotel and then send customers to doggy hotel. I wrote review to hotelclub.com about my expeirence but it was not published! To me that is collusion! They only publish review in favour of their hotels and this mislead customers. The reviews there is not neutral at all! Avoid booking through hotelclub.com as well. I returned to the hotel for another booking and the experience was terrible as well.", "Date": "November 12, 2009"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "3", "Location": "3", "Rooms": "1"}, "AuthorLocation": "joeybella", "Title": "“A big dissapoinment!”", "Author": "joeybella", "ReviewID": "UR47296708", "Content": "I booked this hotel for my friend and I thinking that it was close to alot of the attractions. When we got there the front desk lady tells us that our room is not readt and continues to say how there is a leak in the cealing and how we were supposed to stay in the basement room and that they have to move us to their sister hotel the \"Wedgewood Hotel\" she continues on to tell us how the wedgewood is more expensive hotel and they they will cover the diffrence and will get us a ride there. So she calls the driver and he comes inside the hotel and tell her the front desk lady that he will be waiting outside for us. Once we are finished talking to the front desk lady we head outside to the driver. Out of no where the front desk lady comes running out stating that she wants to make sure we get into the right car because she doesn't want us to get kidnapped! My friend and I were shocked, because she was actually serious. After that our stay in london went completely down hill. Their sister hotel the \"wedgewood\" was the most horrific hotel I have ever stayed in. I am just so very dissapointed with this hotel. My friend and I left london very next day. I would never ever consider staying at this hotel because of how poorly we were treated or their sister hotel which is utterly disgusting.", "Date": "October 20, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "3.0", "Value": "3", "Location": "5", "Rooms": "3"}, "AuthorLocation": "New Jersey", "Title": "“No Frills and Well Located”", "Author": "MTVNJ", "ReviewID": "UR46267774", "Content": "We did not expect a no-frills hotel so we were taken aback by it. The room and shower were small. Catherine, the front desk attendant, made the stay tolerable. The hotel is perfect for on-the-go travelers and students. It is well situated and breakfast was included, which are a plus. We were able to walk to several restaurants and stores. The Underground is also a hop-skip & jump away. Depending on the traveling situation, I would recommend this hotel. If all you want is a good bed and shower, this is for you. If you need amenities, then choose something else.", "Date": "October 8, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Location": "5", "Rooms": "3"}, "AuthorLocation": "Navan, Ireland", "Title": "“Pleasantly Surprised”", "Author": "maestroniamh", "ReviewID": "UR36053496", "Content": "This hotel had a fantastic location - it was 2 minutes from Earl's Court Tube station and about 20 minutes away from Kensington High Street. The staff were very friendly and helpful.", "Date": "July 28, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "2", "Location": "4", "Rooms": "2"}, "AuthorLocation": "Canberra, Australia", "Title": "“helpful staff, quaint and clean, but very small”", "Author": "aussieboy85", "ReviewID": "UR35859546", "Content": "hotel was basic but adequate. reception staff always willing to help out, but some things, such as the wi-fi only works in limited areas. mixed up booking double/twin", "Date": "July 26, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Business service (e.g., internet access)": "3", "Check in / front desk": "3", "Overall": "3.0", "Value": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Chennai (Madras), India", "Title": "“Pretty good”", "Author": "sillytraveller", "ReviewID": "UR29009009", "Content": "We booked this hotel on hotels.com. We basically were looking for a hotel in central london.This seemed perfect and a good value for money.I feel if one is visiting the place as a tourist this is a good hotel to be in.The staff is friendly, breakfast is decent and the location is convenient to go around places.Overall a good hotel for a good price.", "Date": "April 29, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Lund, Sweden", "Title": "“Very good in the Earls Court area”", "Author": "PGOhlsson", "ReviewID": "UR28497250", "Content": "Easy to access – just one block from Earls Court underground Breakfast above average for this type of hotel Clean and fresh Rooms ok – we had three beds in our room and it was Ok. Very good price.", "Date": "April 21, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Belfast", "Title": "“EXCELLENT HOTEL”", "Author": "ma3aytah", "ReviewID": "UR28134865", "Content": "I stayed here for 3 nights, the hotel is very godd for its price, the staff are very friendly, just loved it....", "Date": "April 16, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Oslo", "Title": "“Gem in London”", "Author": "taanes", "ReviewID": "UR27663356", "Content": "Nice tourist class hotel not fancy, but basic and vey clean. Staff out of this world. They do everything. Stayed two times and have booked again. Katarzyiva Szareic in the reception is wonderfull together with the wholw staff. Close to the tube. Close to stores.", "Date": "April 8, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Location": "5", "Rooms": "3"}, "AuthorLocation": "New York City, New York", "Title": "“Not bad: a budget option for a short stay”", "Author": "didobas", "ReviewID": "UR27240885", "Content": "We stayed at Westbury Hotel for a week. Among its pros: excellent location; clean and renovated room; friendly staff. The included breakfast was OK, but there was no variety whatsoever from day to day, and sometimes we would just skip it and buy stuff at the M&S store. The room was smallish, and toiletries unexciting, but it didn't really bother us that much... what did, though, was that the walls were paper thin - no feeling of privacy. If I had to stay there again, it would be for one or two nights only. Kensington has more attractive options, I am sure!", "Date": "April 1, 2009"}, {"Ratings": {"Service": "1", "Cleanliness": "2", "Overall": "1.0", "Value": "1", "Location": "5", "Rooms": "1"}, "AuthorLocation": "Scotland", "Title": "“Dredfull”", "Author": "dancer002", "ReviewID": "UR27083372", "Content": "Room very small but was fine for our use. Within the first 5 min it became clear that we had something wrong with out door as it kept beeping. This beeping went off everytime the door was closed, it did go off after about 10 min but it drove us bananas. On the Sat we went out and came back to find an item missing from our room, the hotel staff just said they would look for it!! a month later they tell me they are still looking for it and now hang up on me when I phone.................. I will continue this if there is ever a conclusion!! Would not stay here again, there are ladders, buckets, bags, boxes lying arround on the way to the rooms and the dinning room is so small we had to split up to sit down and eat. Not appropriate for families more for back packers as the gangs of young people out side smoking, which you had to walk through to get into the hotel were very imtimidating.", "Date": "March 30, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Business service (e.g., internet access)": "3", "Check in / front desk": "4", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "cnic", "Title": "“Much better than expected.”", "Author": "cniclnic", "ReviewID": "UR24312909", "Content": "My family and I have just returned from staying at this hotel. The hotel is quite small but has a friendly reception. I booked a family room, and due to previous reviews we were expecting it to be tiny. Our room was located on the first floor and could be reached by either a lift or stairs. Room entry is by key card. To our suprise it was quite roomy, with 2 double beds and 1 single and plenty of wardrobe space. The bathroom is of adaquate size, maybe the shower will be a tight squeeze for some. Breakfast was fine, with a range of cereals, toast, cheese, fruit juice, tea and coffee. The breakfast room was quite small and could be problamatic if the hotel is busy. Location was ideal for us, with Earls Court tube within 5 mins and Gloucester Road less than 10 mins walk. Overall pleased with this hotel and would stay again.", "Date": "February 6, 2009"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "Lincoln, UK", "Title": "“Excellent Budget Hotel”", "Author": "pink_pirlie", "ReviewID": "UR23909802", "Content": "The room clean and comfortable - while only small I wasn't expecting any more for the £45 per room per night price. The room looked recently decorated and recarpeted. We were given a family room despite booking a twin. The shower room was excellent with powerful, warm spray - I often find in cheaper hotels their heating system and water pressure is often lacking! Room was warm, with the heating on. We were able to turn this down on the radiator. As the hotel was away from the main road it was exceptionally quiet - & I don't think I heard one other guest although I did see many coming and going. Reception staff friendly and helpful. We didn't get up in time for breakfast so I can't comment on that. The hotel was well located -close to both Gloucester Road and Earl's Court tube stations and on many bus routes, including a number of night bus services. All in all a pleasant stay. Would definitely come back again for a budget break!", "Date": "January 26, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "4", "Check in / front desk": "4", "Overall": "3.0", "Value": "4", "Rooms": "4", "Location": "2"}, "AuthorLocation": "London", "Title": "“The one in Mayfair is better”", "Author": "Peterontravel-UK", "ReviewID": "UR22078353", "Content": "When I go to big cities I always chose the hotel mainly by the location. The Westbury in Kensington is a bit of a disappoinment as it is close to the High Street Kensington but not much more. When you stay in the one in Mayfair you have the whole of London at you doorstep. The service is good but not exceptional. Again I think better in Mayfair. The decoration a bit dated, expecially in the bedrooms. I would stay again in the Mayfair one but not in the Kensington.", "Date": "November 22, 2008"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Check in / front desk": "5", "Overall": "3.0", "Value": "3", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Bologna", "Title": "“Good for me”", "Author": "Erischaos", "ReviewID": "UR22001637", "Content": "I've stayed three days in London together with my cousin and I think that this hotel was perfectly fitting with our program: wandering London and return to hotel just for sleeping. Both our room and bathroom were small indeed, but clean and tidy. Actually I was scared because of all the reviews we read before leaving for London but I really have nothing to complain about sheets... The only complaint is for the breakfast service: it said \"continental\" in the brochure, truth is choice is poor... Anyway this hotel can be recommended for singles or small families ( i.e. parents and one kid ) that need accomodation for a few days. The position at five minutes from Earls'court station is excellent!", "Date": "November 19, 2008"}, {"Ratings": {"Service": "2", "Cleanliness": "1", "Check in / front desk": "2", "Overall": "1.0", "Value": "1", "Rooms": "1", "Location": "3"}, "AuthorLocation": "Denver, Colorado", "Title": "“You Can Do Much Better!”", "Author": "dfeehan", "ReviewID": "UR20810165", "Content": "I booked this hotel for one night, partly based on the available Trip Advisor reviews. Allow me to beg you to find another place to stay. I checked in around 11pm at night, the room I paid for and was given had one double bed and two twins. The door to the room had some sort of alarm that kept beeping at me and when I when down to the front desk, the clerk insisted that I was not operating the door correctly and once I locked the deadbolt, the alarm would go off. After a few minutes of nearly arguing, I managed to get the clerk to accompany me to the room (you could hear the alarm beeping all the way in the lobby). He tried to reprogram the lock to no avail. He then put me into another room with just a double bed, not the room I had paid for but by then I was so tired I didn't care. The door opened directly into the bed and I had to turn sideways to get in with my small suitcase. The occupants of the room next door were smoking like chimneys and I had to place a towel against my door to keep the smoke from coming into my room (not very effective). The bed was absolutely COVERED in hair. It was on the comforter, the pillows, and the sheets. I am not entirely sure that the sheets were clean, they did not smell like it. The bathroom was small even by European standards and had been updated. For the price, you can do much better in London. I know because I have. The exterior of the hotel is very nice and also very deceiving.", "Date": "October 11, 2008"}, {"Ratings": {"Service": "2", "Cleanliness": "2", "Business service (e.g., internet access)": "1", "Check in / front desk": "3", "Overall": "2.0", "Value": "3", "Rooms": "2", "Location": "4"}, "AuthorLocation": "stockholm", "Title": "“Reasonable for the price”", "Author": "StockholmSwedebear", "ReviewID": "UR20715811", "Content": "Having read all the reviews here, I was fully aware that this hotel was just a place to sleep and nothing more. When we arrived late saturday evening, we were greeted by a very nice receptionist. But when she handed us the key and said \"your room is in the basement\" I almost left again. The steps down are indeed steep and the lift (worked fine) was on the wrong side of the building, so we would have had to go through the breakfast-room, which was closed... So down the steep stairs it was. When we opened the door to the room, we almost hit the wall on the other side, it was that small! There was a bed (rather short) a closet (very big) and a small desk, but no chairs whatsoever. The bathroom was so small you had to step over the actuall toilet to close the door. The shower was OK, but being so small the bathroom wasn´t much to write home about, however, it was in pretty good shape with tiles and such. The breakfastroom is pretty small, and when many people came at once, it was a minor chaos. Really good service though, I think there was atleast 3 women constantly bringin new bread, juice etc. The actual breakfast consisted of toast, cereals, eggs, cheese, jam, milk, two kinds of juices and tea/coffee. Being included in the price, it was absolutely fine, but nothing special. The housekeeping was a different matter, sometimes they didn´t leave new towels (ran out), and they came in despite I´d told them not to. We only got one small soap, that is the extent of toiletries they include. Total impression: okay for the price and location, but if you want good service and a bigger room (impossible to get a smaller) dont stay here. The one positive was the redhaired woman in the reception, she was very nice. Also the telly worked fine, and there is s safe in the room. The big negative: it was very damp air in the basement. The housekeeping insisted on hanging all the laundry to dry in the breakfastroom, which didn´t excactly help. Also it was very noisy in the morning with sounds of plates and cups banging from the breakfast.", "Date": "October 8, 2008"}, {"Ratings": {"Cleanliness": "3", "Check in / front desk": "3", "Overall": "3.0", "Value": "3", "Rooms": "2", "Location": "4"}, "AuthorLocation": "Bristol", "Title": "“Small but adequate”", "Author": "19691972", "ReviewID": "UR19949662", "Content": "Stayed one night at this hotel and for the money it was very good value. The room was very small and hot but we were able to have the window open all night and it was very quiet. It is situated in a good location, near the Natural History and V.A. museums, also near the tube and bus stops. You can get the number 74 bus at the top of the road (Cromwall Road) and that takes you to the top of Oxford Street (Marble Arch end) if its shopping you want. The bedding and towels were clean, the breakfast and breakfast room were basic, but for the money and time you spend in the room it was O.K. The polish receptionist was very helpful and friendly, she also let us check in early at midday which was an advantage to us.", "Date": "September 10, 2008"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Check in / front desk": "5", "Overall": "3.0", "Value": "3", "Rooms": "2", "Location": "5"}, "AuthorLocation": "Belgrade", "Title": "“Refurbished, clean hotel”", "Author": "Drakce", "ReviewID": "UR17221401", "Content": "Read all the reviews before booking the room, and was a bit affraid of what it would be like. But there was no reason for fear. Rooms are indeed of british size, very very small, you can hardly move around if there are two of you in the room. The double bed is not a king bed, and the view from the window was the wall. But room and the bathroom are clean, bathroom is absolutely refurbished, and for the price we got from the hotel.club (33 pounds per double room per night including breakfast) it was really fine and ok. Staff working at the reception are very helpfull and polite). Location of the hotel is great, just one block from the Earl's court. It is also near the Gloucester tube station, Tesco is just accross the station. The breakfast room is big enough and is also refurbished.", "Date": "June 25, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Westport, Ireland", "Title": "“Definitely worth it.”", "Author": "louisburgh", "ReviewID": "UR16920878", "Content": "The rooms are small but since its London you don't spend much time in them, Breakfast was toast, cereal, egg or cheese, again it was fine, kept me going until lunch. The place was spotlessly clean. Location was fantastic, across the road from a 24h Sainburys, and only about a seven minute walk from Gloucester Rd. tube station. Price was probably the best bit. To be honest I wasn't expecting much from this hotel considering the price but i was pleasantly surprised. Im definitely coming back.", "Date": "June 14, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Business service (e.g., internet access)": "3", "Check in / front desk": "4", "Overall": "4.0", "Value": "4", "Rooms": "3", "Location": "4"}, "AuthorLocation": "ghana", "Title": "“Great value for money”", "Author": "maceisenstein", "ReviewID": "UR16840678", "Content": "This is easily the best value budget hotels I've stayed in in London. Refurbished rooms, clean and pleasantly decorated, pretty quiet. Breakfast very basic, staff very helpful. Its an excellent location about 400 metres from Earls Court Road. Free Wi-fi available, works all the time in public areas and most of the time in rooms. Bathrooms are the \"wet room\" concept - i.e. the shower wets the whole room, but they're properly tiled and better than some of the plastic cubby holes that other London budget hotels have installed.", "Date": "June 11, 2008"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Check in / front desk": "4", "Overall": "4.0", "Value": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Exeter, United Kingdom", "Title": "“Very good value hotel - Clean, Friendly, and excellent location”", "Author": "orientfan16", "ReviewID": "UR16098807", "Content": "I booked this hotel a few days before travelling, only £40 a night for a single en suite. I arrived at the hotel from Gloucester Road tube (10 mins walk) - first impressions were ok - there was bloke throwing a bag of bed linen out the door. But the render etc looked clean. I walked into the Reception area, it looked modern and clean. Check in was quick, and I used the lift to get to my room on the Fourth floor. The hotel has electronic key cards although you have to leave it at reception when you leave the hotel. My room, 406, had a double bed (although I booked a single), the room was average size for London, but the bathroom was small yet clean. The walls had been freshly painted, and in general was very clean, although the carpet could have done with a hoover. The bed sheets looked and smelt new, there was a safe in the wardrobe and overall, considering the price I paid, i was happy. One of the receptionists, a Polish lady on morning shift, was lovely. She always said have a nice day as I left the hotel to explore London. Earls Court tube is 5 mins walk, Sainsburys on Cromwell Road is 4 mins walk, restaurants, internet cafes, banks, and post office is all opp Earls Court tube. There are a few minor negatives, for instance the shower curtain dont reach the floor so it gets a bit wet, floor needed a hoover, and the people in the room opposite mine were very loud on the first morning - but these are all forgivable in this good hotel. I will defintely stay here again - for the right price.", "Date": "May 16, 2008"}, {"Ratings": {"Service": "3", "Cleanliness": "2", "Check in / front desk": "3", "Overall": "2.0", "Value": "4", "Rooms": "1", "Location": "4"}, "AuthorLocation": "Brighton, United Kingdom", "Title": "“Great location”", "Author": "panda02", "ReviewID": "UR16086173", "Content": "The hotel is a 5 minute stroll to Earls Court tube, and walking distance to the museums. It has 4 floors and a basement, all served by a lift. Our room (404) was small, we're talking teeny!!!! The bathroom was essentially a cupboard, the shower was tiny and had a fixed head which spurted everywhere (so no good for trying to keep your hair dry!) but plenty of hot water. The 2 bath towels supplied were adequate. I think we were unlucky with the room, it was at the back and overlooked by another terrace of houses, no balcony or breeze!The room consisted of a bed, a skinny wardrobe, maybe 18 inches wide, a (non LCD) TV (so high up the wall it hurt my neck to watch it) and a shelf with a kettle etc and a phone on it. There was literally no room for anything else!! The 'double' bed was somewhere between a single and double. The mattress was way too soft and bouncy but the pillows were fine, although only 2 on the bed and just 1 extra in the wardrobe. The digital room safe wasn't working neither was the phone. It was a hot couple of days that we were there, and the room was roasting, and as mentioned, there was no breeze. We did ask for a fan but they don't provide them. Provision of fans would have been a very cheap yet extremely appreciated gesture. If we had been staying longer than 2 nights I would have (had to have) bought one and left it there. Breakfast (self service) consisted of cereals, white sliced bread (you can toast yourself) cheese, boiled eggs and spreads - jams, honey and chocolate. Drinks available were tea, coffee, orange and apple juice. WARNING: be prompt for breakfast, they turn everything off and clear it all away bang on 9.30am!!! If you want shops, restaurants etc, out of the hotel and turn left (to the end of the road) and you'll find everything you need. (The first night we went right and found an italian resaurant, Belladonna I think.......avoid avoid avoid, but that's a different story) If all you need is somewhere cheap to sleep in a great location, go for it!! If you're planning on spending time in your hotel room, look elsewhere. I would stay at The Westbury again.............. just not during hot weather!", "Date": "May 16, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "3", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Bucharest", "Title": "“Very good hotel,book it!”", "Author": "one-romanian_artist", "ReviewID": "UR15724352", "Content": "What's wrong with some tourists? the hotel is quite ok,clean,I had a nice double,nice view,refurbished,the bathroom was spacious enough for me,even pretty i might say,if you need a very large bathroom for walking with the bycicle around well,that's not the place;personaly i found it very clean,nice,I had a great time there,and yes,the room has been refurbished,the tv ok,flat screen,everything was nice,a bargain,only 32/night,the price was incredible in april and i wish to say thanks to the nice polish woman from the reception,she is really friendly and efficient there.! When I will return to London I will book it again,no doubt about!", "Date": "May 6, 2008"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Business service (e.g., internet access)": "1", "Check in / front desk": "3", "Overall": "1.0", "Value": "1", "Rooms": "1", "Location": "3"}, "AuthorLocation": "hants", "Title": "“this was not a pleasant supprise. will never ever stay here again”", "Author": "dangerbunny", "ReviewID": "UR15317447", "Content": "i was nervous when i booked this as i had seen some bad reviews. i phoned the hotel to confirm a few things and was told all rooms had been refurbished. when i got there all looked ok, nice new lift but work clearly going on, then we saw the room!! the bed was clearly not a full sized double, it was about 3\" wide. it was walled in on 3 sides so only access to one side. the bed was very very old with springs poking through and dirty sheet. the so called on suite was so small you had to stand in the shower to close the door and use the toilet, it also looked like it needed cleaning urgently. there was a tv, but it was so high that from the bed all you see was the bottom, it did not adjust or swivel and you would have to stand on the bed to see it, there was nowhere else in the room to stand let alone sit, two people could not stand up at the same time as the room was so small. when we complained we were told that lots of the rooms were this size now and people dont complain. the walls had brown dirty finger smears on them and i would not like to guess what they were we did not even stay one night even though they refused a refund i would never stay here, even free. smaller then easy hotel and dirty", "Date": "April 24, 2008"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Check in / front desk": "3", "Overall": "4.0", "Value": "4", "Rooms": "3", "Location": "4"}, "AuthorLocation": "St. Louis, MO", "Title": "“Much better than expected”", "Author": "QueenMi", "ReviewID": "UR14241937", "Content": "We booked this hotel through Expedia because it was cheap and had four single beds in the quads. We were very worried after reading the reviews, but were pleasantly surprised. There were no bedbugs like a previous review said. The rooms were small. The 4 beds were lined up in a row. The room was clean, maybe even recently painted. There is a very small elevator that is sufficient for getting luggage up and down. Our quad was in the basement, but it had a window. There was a tea pot and tea bags, milk, and sugar in the room. There is a cupboard to put luggage in. The bathroom was small but adequate with no problems with the shower. The free breakfast was only toast, jam, and cereal. The V&A, History, and Science museums are less than a 10 minute walk away. There is a grocery store and restaurants only a couple of blocks away. The area seems nice. The hotel has a luggage room to store your bags for the day after you check out. The hotel personnel were friendly. The hotel was cleaner and cheaper than the other hotel we stayed in London.", "Date": "March 12, 2008"}, {"Ratings": {"Service": "2", "Cleanliness": "1", "Check in / front desk": "2", "Overall": "1.0", "Value": "4", "Rooms": "1", "Location": "5"}, "AuthorLocation": "san diego california", "Title": "“Please consider staying elsewhere”", "Author": "londinius", "ReviewID": "UR10360722", "Content": "My friend and I woke up on our first morning at the Westbury to find both beds crawling with bugs. They apologized and, five hours later, gave us a new room. Unfortunately, I found out upon arriving home (the incubation period is just over a week) that the room was infested with scabies mites. I was in extreme discomfort for two weeks, and when I asked the hotel for a partial refund and the cost of the required medicine, they refused. My doctor tells me scabies are quite common in unclean hotels. Consider yourselves warned.", "Date": "October 26, 2007"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Business service (e.g., internet access)": "1", "Check in / front desk": "2", "Overall": "1.0", "Value": "1", "Rooms": "1", "Location": "1"}, "AuthorLocation": "coraliemontreal", "Title": "“name of this hotel should be : NIGHTMARE HOTEL”", "Author": "coraliemontreal", "ReviewID": "UR8589772", "Content": "DONT GO AT THIS HOTEL. It's discusting, dirtly. I travel a lot and this is the worst hotel I ever go. You are better to book a youth hostel it will be nicer and room will be clean. When I was there the room wasnt done except for the bed (NOT SURE FOR THE SHEETS), glass and bathroom wasnt clean. When I mention this to the hotel they said it was because I use the bathroom and glass...Can you believe this??? I ask for another room and they refuse. If you look for an hotel in london not too expensive I suggest THE ROYAL NATIONAL. 100% BETTER.", "Date": "August 31, 2007"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Check in / front desk": "1", "Overall": "1.0", "Value": "1", "Location": "3"}, "AuthorLocation": "Los Angeles, CA", "Title": "“bad memory...”", "Author": "Kenlosangeles", "ReviewID": "UR5877158", "Content": "I don't recommend this hotel because they will send you to another hotel. I booked this hotel for 2 nights by contacting the hotel directly. The stuff was friendly through emails, so I was excited to stay at this hotel and I and my mother went to the hotel on the date we booked. The stuff then said there are NO ROOM available, and told us to go to another hotel nearby. We walked kind a far with my mother with pain on her thigh, and found that the other hotel is very very tiny and dirty...... We called back to Westbury and said that I want to cancel this reservation since this is wrong, and the stuff said \"then come back here, we have room\" !!. I didn't think my mother could walk back to Westbury, so we said so and canceled the booking. After I come back from the trip, I found out they charged for one night since I canceled after check in time. I booked another hotel and that was awsome, but it put bad impression on my whole trip to London. I don't think everyone would go through this, however this hotel is doing bad business and I don't recommend this hotel.", "Date": "September 26, 2006"}], "HotelInfo": {"Name": "Westbury Kensington", "HotelURL": "/ShowUserReviews-g186338-d243002-Reviews-Westbury_Kensington-London_England.html", "Price": "$127 - $221*", "Address": "<address class=\"addressReset\"> <span rel=\"v:address\"> <span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">22-24 Collingham Place</span> | <span class=\"extended-address\">Kensington</span>, <span class=\"locality\"><span property=\"v:locality\">London</span> <span property=\"v:postal-code\">SW5 0PZ</span></span>, <span class=\"country-name\" property=\"v:country-name\">England</span> </span> </span> </address>", "HotelID": "2514552", "ImgURL": "http://media-cdn.tripadvisor.com/media/ProviderThumbnails/dirs/bd/a7/bda73f8a8b28b44352ec933edcf194975large.jpg"}}