{"Reviews": [{"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Singapore", "Title": "“Great place, staff and modern facilities .. in town.”", "Author": "raymansg", "ReviewID": "UR126737885", "Content": "Stayed in a deluxe room (upgraded to 3 persons) with my wife and 9 year old son for 7 nights. Location was convenient, staff were very friendly, room was just so cute and breakfast was really nice. Was a little apprehensive when I saw the hotel when I first arrived but after I got into the room, I wouldn't have stayed anywhere else. In all my previous trips, I have always stayed at the hotels in La Defense but as this was a holiday for my family, I dedided on downtown. Located near a metro that links to the major lines without needing to switch at the metros too much. Short walk to boulevard des Italiens and Galleries Lafayette, etc. .. Cool place, bathroom is exceptionally cool, rooms were very quiet (despite being next to the street). Would have loved to have more tv channels in English ... But would definitely stay here again.", "Date": "March 27, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "2", "Overall": "3.0", "Value": "3", "Location": "4", "Rooms": "4"}, "AuthorLocation": "Tonbridge, UK", "Title": "“Just a few details need improving”", "Author": "beetleboy", "ReviewID": "UR125769601", "Content": "I stayed at this hotel for one night on business. I arrived very late due to severe Eurostar delays. The welcome at the hotel was good given it was 3am. I was checked in quite quickly. When I got to my room the window was wide open. Given it was below freezing outside I thought this a bit odd and meant the room was cold. I was too tired to make a fuss or ask for another room. On closing the window I noticed a lot of mold on the paint work above the window. This was slightly off putting. The rest of my stay was fine, the bed was comfortable and I liked the style of the bathroom. I enjoyed the buffet breakfast in the somewhat stuffy breakfast room. Location wise the hotel was convenient for my meetings and thankfully within walking distance of the Gare du Nord, given the taxi queue at the station had several hundred people in it.", "Date": "March 7, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Sleep Quality": "3", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Guildford, United Kingdom", "Title": "“Convenient Location but a bit cramped”", "Author": "railenthusiast", "ReviewID": "UR125706087", "Content": "Stayed 2 nights on a business trip and had a room at the front. Friendly hotel with a good breakfast in a convenient location a few minutes from Gare du Nord by bus. Room was a bit cramped and had a shortage of electrical points convenient for the desk, but the shower was good. Decor rather dark in a lot of the hotel although one end seems to have been refurbished and looks much nicer.", "Date": "March 6, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Cambridge", "Title": "“Great hotel in a great location!”", "Author": "Writetomab", "ReviewID": "UR125069454", "Content": "Very nice hotel... Very shabby chic in terms of style. The rooms are a decent size for Paris and furnished to a good standard. Bathrooms very nice and clean with great shower. The staff were very friendly and helpful. Great location a well so easy access to all of Paris great sights. Only 15 walk to Gare du Nord. Overall a nice hotel in a great location so would recommend.", "Date": "February 23, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Washington DC, District of Columbia", "Title": "“excellent location, great hotel”", "Author": "AI25", "ReviewID": "UR124581412", "Content": "Hotel Jules is a beautiful hotel. It is small, but most places in europe are small in comparison to the United States. I stayed at the Hotel Jules April 2011 - it was close to all the tourist spots (via train) the closest metro station is Le Peletier, which is only two short blocks away. The staff were friendly and willing to give assistance when needed. I enjoyed my stay, and will consider visiting again in the near future.", "Date": "February 14, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Riga, Latvia", "Title": "“value for money.”", "Author": "vlad b", "ReviewID": "UR124219261", "Content": "we stayed at Jules for a week in May. it has a nice design, it has a good location, not far off all the main attractions, but the room wasn't completely quiet-but this is what you would expect from a centrally located hotel. rooms were a bit small, but comfy, clean. hotel staff helpful, but there was a feeling they spoke about us in french and laughed, so that was not very pleasant.", "Date": "February 6, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Sleep Quality": "4", "Rooms": "3", "Location": "4"}, "AuthorLocation": "London, United Kingdom", "Title": "“great location”", "Author": "blond-traveller99", "ReviewID": "UR123164579", "Content": "Great location 15 mins walk from Gard du Nord and 10 mins to Galaries Layfette. room small but adequate, shower and no bath. Room clean and bed very comfortable. I dont think we had one of their best rooms. Hotel reception very smart. Staff very friendly, The bike hire is very close either side of the hotel. There is a Starbucks 5 mins to the left, and a McDonalds, handy for breakfast. Requested a extra pillow, needed to do this another 2 times before we received one. The room does not have tea and coffee facilities requested these also. They were very good and gave us a kettle, coffee sachets, but no milk/creamer or tea, so a bit pointless really.", "Date": "January 16, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Dublin, Ireland", "Title": "“\" A truly Memorable New Years experience \"”", "Author": "Holidaydoc_11", "ReviewID": "UR122564635", "Content": "Having travelled to Paris on a few trips I was certainly looking forward to spending New Years with some close friends there, I did a lot of shopping around for location, price & quality & came across this Hotel & was impressed by the reviews , On my last trip to Paris I stayed in an overpriced 4* Hotel that was well below standard and cost me over €350.00 per night so I wasn't going to get caught again This Hotel is really well located close to fantastic shopping ,great reasonable priced Restaurants & all the tourist attractions, my friends were staying at an apartment in Montmartre & it was only a 15-20 minute walk to the area which is really worth a visit The staff in the Hotel were on hand at all times to ensure your stay was 100% satisfactory, Been a travel Journalist in Ireland I am very particular & sometimes feel like \" The Hotel inspector \" but this Hotel really impressed me in all aspects including the room size , full size bath & the breakfast was the best I have had in Paris ( Not that the french hotels are traditionally good for breakfast selection ) Anything that you needed for your room, extra coffee capsules, Wine Glasses, Extra Towels etc... was delivered within minutes ! All in all I would highly recommend this Hotel on your next trip to Paris & I will certainly be returning & is truly a credit to the management & staff at the Hotel", "Date": "January 5, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "3", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "ferney", "Title": "“Excellent location, service....and bed !!!”", "Author": "valbert01", "ReviewID": "UR121161607", "Content": "One week end there that was a real pleasure. The staff was really welcoming and nice. You can almost feel at home here. The romm was nice as well, well decorated, and the bed was really perfect ! Breakfast was very complete, good and nice. It really made our week end a special one ! Location was very parctical, a few minutes to the Galeries Lafayette for example...", "Date": "November 28, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "3.0", "Value": "4", "Sleep Quality": "4", "Rooms": "3", "Location": "4"}, "AuthorLocation": "New York City, New York", "Title": "“Good location and service”", "Author": "mr610", "ReviewID": "UR121131601", "Content": "Very small hotel that is centrally located with easy access to the metro. The rooms were clean, but very small (not surprising). Nothing overwhelming or remarkable in the design or public spaces. The staff is very friendly. Everyone spoke English very well. Free wifi, which is helpful. Overall a good experience, but nothing to set it apart from many other hotels.", "Date": "November 28, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "3", "Rooms": "4", "Location": "4"}, "AuthorLocation": "London, United Kingdom", "Title": "“It's great for a Parisien boutique hotel”", "Author": "bermondsey_traveller", "ReviewID": "UR120544903", "Content": "I've travelled to Paris many times on business and tired of the same hotel so took this opportunity to try somewhere new that was priced within the corporate budget. Jules didn't disappoint - a central location and well-maintained. The only disappointment was that the fitness room was out of action. SERVICE - friendly and understated. Check out was slow so try and do it in advance VALUE - about right based on comparable experiences SLEEP QUALITY - quite noisy outside since all rooms face on to Rue Lafayette. I wanted to leave the window open for some fresh air but was quite disruptive to do so at certain points of the night. Air conditioning in room however CLEANLINESS - Spot on LOCATION - Great for shopping, sightseeing and business if you're based in the area. Le Peletier, the adjacent metro station is small and manageable ROOMS - Just big enough and good sized, newly refurbished bathroom. Roomy by Paris standards RESTAURANT - Breakfast was fine - a good selection and service was great. Bar is good but limited seating area, mostly confined to reception. Recommended local restaurant opposite", "Date": "November 13, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "salisbury,", "Title": "“Good characterful city centre hotel”", "Author": "Salisbury_John", "ReviewID": "UR119558652", "Content": "Unashamedly urban - this is not \"tucked away\" in some quiet back street but right on a busy main road - exhilarating views from the balcony of street life as the city waking up or in the evening. Good for transport, and you can walk to several of the big sites. Nice young staff. Decor and rooms not amazing but smart enough. In summary, a good base to \"do Paris\". And if you can get a deal on price a very good place!", "Date": "October 21, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Espoo", "Title": "“Nice place to stay - great location”", "Author": "curiousEspoo", "ReviewID": "UR119519479", "Content": "Very nice hotel with friendly and professional staff. Enjoyed their buffet breakfast. Location perfect near the department stores and metrostations. Room ok for one, somewhat small two persons. Some street noice. Recommend very much", "Date": "October 20, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Birmingham, United Kingdom", "Title": "“Excellent Hotel, loved it”", "Author": "60Anon", "ReviewID": "UR119350948", "Content": "My partner and I stayed here for a couple of nights on a city break. The staff were warm , kind, efficient and so helpful. Their English was excellent which was great as we couldn't speak much French. On the occasions when we tried to talk francais they were very complimentary about our efforts! Everywhere was clean and tidy. The room was well organised and had lovely decoration. Had a lovely view of the street from our room and surprisingly this wasn't noisy at all. Great location as is fairly close to the main Paris attractions.Thought the price was fair for the service we received. Admittedly the room was quite small but this didn't feel uncomfortable and for me simply added to it's charm. I would definitely stay again.", "Date": "October 16, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "3.0", "Value": "3", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Canberra, Australia", "Title": "“Quaint, awesome location”", "Author": "Steve8010", "ReviewID": "UR119162022", "Content": "The hotel itself is on one of the main streets in Paris and is close to numerous underground stations that are on different lines. The reception staff were very attentive and had good english speaking skills. The room itself was on the small side with a narrow balcony that ran along the length of the building. This overlooked the street. The room and bathroom used to get quite warm as the sun was shining straight in on that side. The cooling in the room was fine but the bathroom used to warm up quite considerably. The location was great - being close to Opera as well as the shopping precinct. Further down towards the Ritz and beyond to the Eiffel Tower and the Louvres and the river. Overall, a pleasant stay and would recommend if the price was right.", "Date": "October 10, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "3"}, "AuthorLocation": "New York City, New York", "Title": "“Surprising and wonderfully accommodating”", "Author": "Dasher_84", "ReviewID": "UR118386179", "Content": "Our stat started great when we got upgraded to a Junior Suite on arrival and got a quaint room on our own floor. The room was interestingly designed but was spacious enough for all our needs and beyond (including laying out our luggage on the floor to unpack). Bathroom was unique and spacious and even had a heating rack for the luggage! The staff was very kind and accommodating - they brought us our luggage and gave us useful instructions for getting around. They helped us arrange cabs when we needed it and free wifi passes for each day (each pass expires every 24 hours but we just asked for a new one) They were fully booked so we couldn't get a late checkout but they gladly stored our luggage and even kept some cheese we bought in their fridge so it would stay fresh. The location was nice enough - a little rough with public transportation as there is only one metro line that's kind of disconnected from everything but there are a few buses that run through and other metros (at Trinite and Opera) are really just 5-10 minutes walk away. AND there are also 2 markets right near by (one around the corner) open late so we could always get food and drinks. Overall was just a wonderful stay. We greatly enjoyed it and would definitely come back.", "Date": "September 20, 2011"}, {"Ratings": {"Location": "4", "Overall": "4.0", "Value": "5", "Service": "4", "Rooms": "4"}, "AuthorLocation": "Pretoria", "Title": "“Centralised and generally awesome!”", "Author": "AnushkaSB", "ReviewID": "UR118106259", "Content": "My husband stayed at Hotel Jules for 3 weeks and I for 1. We really had a great stay with them. The room was not the most spacious, but it adequately met all our needs. It is situated very close to a Metro and the restaurants around the hotel are really a treat! The staff were very helpful and assisted us with booking tours and were always quick to assist if there was a problem. I would definitely recommend this hotel to anyone looking for a place to stay in the Opera Quarter.", "Date": "September 14, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "4.0", "Value": "4", "Service": "4"}, "AuthorLocation": "Arlington, Virginia", "Title": "“Lovely hotel worthy of a try”", "Author": "PinaColada02", "ReviewID": "UR117959341", "Content": "I travel to Paris at least once a year for work and overall have found most hotels I've stayed at to be lacking in something. Overall I enjoyed my stay here and any complaints I have are typical for Paris/French customer service. First, location wise, this hotel is great at least for me and where my meetings were. Like any place in Paris, it's near several Metro stops and you can get around fairly easily via Metro which is very easy to navigate. The front desk staff were friendly and helpful. I arrived late in the morning fresh off a red-eye and was able to check in early, which I was thankful for. My room was on the 4th floor facing the street which had nice views and it wasn't too loud to sleep, although I am a heavy sleeper (and was overall exhausted from the time change and working round the clock). The room was typical of Parisian hotels - small but relative to some other Paris hotels I've stayed in, it was laid out well and didn't feel cramped. As a solo traveler, it was comfortable and enough room. If I were traveling with another person, I can see how it can easily feel cramped, especially in terms of the bathroom. It's small and it's proximity to the bedroom means no privacy for the person in the bathroom if the other person is in the room. There was a desk where I could easily work although it would have been nice if it were a bit larger to accommodate my laptop and files, etc. The bathroom was typically small but at least it was modern and updated. The shower was also typical - you run the shower and the water spills onto the floor. I have seen this style shower in every Paris hotel I've been in and have resigned myself to the fact that either as an American I am doing something wrong or it's normal for the water to splash onto the floor. The bed was comfortable although the detergent they used for the sheets had a weird smell but it was not overwhelming or unbearable. I paid for the expedited/business wi-fi which was expensive but necessary to do my work. I ordered the late night room service one night which was a nightmare. It was supposed to arrive within 20 minutes but didn't come for an hour. The selection was already limited and then when I called several items were unavailable. When my food arrived, it wasn't even what I ordered but by that time I was so hungry I just took it. I stayed at this hotel for 4 nights and overall it was comfortable and convenient for my needs. I'd definitely stay here again and would recommend it to others.", "Date": "September 11, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "3", "Overall": "4.0", "Value": "3", "Service": "4"}, "AuthorLocation": "Oslo, Norway", "Title": "“Nice hotel in convenient location.”", "Author": "Ahlohaa", "ReviewID": "UR117903943", "Content": "Paris was lovely in September and we liked this hotel mostly for its location and staff. It is walking distance both to Montmartre and the Louvre. If you don't mind a 20 minutes stroll with your luggage, you can also walk down the street from Gare du Nord train station. We were lucky and got room 319. It was some noice from the street outside, but the great thing is that it was a ok sized corner room. It had a small balcony where it was possibel to sit outside and get some sun watching the street life below. The staff was very nice and helpful both during check in and check out. They recommended some good places to eat. But the recommendation of Cafe de la Paix near the opera building was not the best. The food there was not as good as expected for the price.", "Date": "September 10, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Location": "5", "Rooms": "4"}, "AuthorLocation": "", "Title": "“Location, location, location”", "Author": "MauFdz", "ReviewID": "UR117293671", "Content": "Hotel Jules has an excellent location in Paris, very close to Metro Station, great restaurants and shopping areas. We got an excellent rate through Jetsetter that included breakfast. Would definitely recommend staying here if you can get a good rate, sometimes rates are high taking into account it's location in Paris. Great service from staff, all the amenities were up to standard, wifi worked good.", "Date": "August 26, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Scotland. UK", "Title": "“A perfect birthday celebration”", "Author": "Lauren1971", "ReviewID": "UR117262331", "Content": "Arrived at hotel Jules around 8:30pm, and received a very warm and friendly welcome. The hotel is in an ideal location, situated on Rue Lafayette, approximately 4 minutes walk from the Opera House - perfect. The hotel has quite an ultra modern reception area, with internet access that's housed in what looked like a pod from Space Odyssey! The staff were just so friendly, and thankfully their English was a lot better than my French! Our room had a balcony overlooking Rue Lafayette which was just brilliant - I could stand out there watching the world go by. The rooms aren't the biggest, but they have everything you need, and if you want tea or coffee, a complimentary tray was available simply by calling reception. Television, good sized wardrobe and storage space, tastefully designed (including a set of the trademark Hotel Jules lips attached to the wall - a souvenir set can be purchased at reception). Bathroom was a good size, with a brilliant shower, great for waking up in the morning, after an evening drinking too much French wine! I have to admit that we never had breakfast at the hotel (it was included but we were never hungry first thing, and preferred to head out and do some sigh-seeing, and grab something when we did start feeling hungry), so I can't comment on the breakfast or dining room facilities. There was a funky little bar just off the reception area - monochrome colours with cool armchairs to relax in. There were also some tables and chairs set outside the bar, ideal for having a drink and watching the world go by. There's a metro stop about 50yards from the hotel door, which was ideal as well. The hotel offers a booking service for some of the tourist attractions, and they have a good knowledge for recommending where to go for a nice meal. They stored out luggage for the whole day when we checked out, which allowed us to have a last wander around the City of Lights. I was sad to leave and look forward to returning to my room with a balcony and a view. A very memorable trip indeed, and the hotel played a part in making the week so special.", "Date": "August 26, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "3", "Overall": "3.0", "Value": "3", "Service": "3"}, "AuthorLocation": "Minneapolis, Minnesota", "Title": "“Retro Cool”", "Author": "Mercedes1976", "ReviewID": "UR116032826", "Content": "Jules, located in the 9th arrondissement, has a definite retro, cool vibe going on. The staff were friendly and speak decent English, which was very much appreciated since neither my husband nor I speak any French. The rooms were small, but not as small as one would think being in Europe. I didn't feel cramped, by any means. As stated in my previous reviews, we don't tend to spend too much time in our rooms, so small rooms don't bother us. The room was clean and the bathroom was nice-sized, but no tub. I prefer showers, so not a big deal. However, the shower is not fully enclosed, so the floor tends to get fairly wet. The bed was not as comfy as I had hoped for, but not terrible. The buffet breakfast was ok, but maybe a bit overpriced. Overall, we had a good stay at Jules, but would probably try somewhere different next time we're in Paris to see what else is out there.", "Date": "July 30, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Melbourne Australia", "Title": "“Ideal hotel for Paris holidays”", "Author": "boadle", "ReviewID": "UR115927609", "Content": "This hotel is ideally placed on Rue Lafayette for Montmarte, and with metro stations within easy reach is also well placed for the main sightseeing sites. The desk staff are courteous and good humoured and prepared to go that little bit further to help than many other hotels we have stayed in. We experienced a nosy AC on our first day, and the staff moved us to a better room. The room itself was kept clean and had a great view on to the street. Double glazed windows gave us protection from the traffic noises. We plan to use this hotel again! Vive Hotel Jules!", "Date": "July 28, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "4.0", "Value": "5", "Service": "4"}, "AuthorLocation": "Montreal, Canada", "Title": "“Charming, stylish boutique hotel”", "Author": "itsy_bunny", "ReviewID": "UR115859792", "Content": "After much deliberating, we chose Hotel Jules for a week in Paris. The decor was fabulous, we wished we could have brought a pair of their signature lips home. Location is right in the middle of two metro stops, both about a 2 minute walk away from the hotel. Check out the supermarket right around the corner, it's perfect for picking up food for a picnic, and a few blocks away is a lovely patisserie for breakfast. The staff was very helpful and friendly. Our two (minor) complaints were that the housekeeping staff took away our complimentary tea kettle and tray mid-way into our stay and never brought it back, and we weren't expecting the inset wall plugs, so our power converters didn't work. The staff did try and help with the situation, but sadly couldn't find a power converter that would work for the room. Would definitely stay here again.", "Date": "July 27, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "4.0", "Value": "4", "Service": "4"}, "AuthorLocation": "Cape Town Central, South Africa", "Title": "“cute hotel, amazing location”", "Author": "Gerlinde108", "ReviewID": "UR115609113", "Content": "We really enjoyed our stay at Hotel Jules, and loved Paris ! Loved the unique style of the hotel and the room was really spacious (compared to other hotels in paris apparently). We had the cutest balcony overlooking typical paris streets, amazing view to wake up to. Staff is friendly and helpful. We never ate in the restaurant, rather opted to explore the cafe's and bistros around. The location is fantastic - so central and easy to get around. We got very familiar with the area very quickly and ended up using the metro all the time. Thank you to all at Hotel Jules.", "Date": "July 21, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "4.0", "Value": "4", "Service": "4"}, "AuthorLocation": "London", "Title": "“Stylish and Great location”", "Author": "yvrldn", "ReviewID": "UR110980228", "Content": "This hotel was walking distance from Gare du Nord and well situated to the big department stores. It's an interesting area of Paris not traditionally touristic but had many unique shops and quality restaurants nearby. Very close to the metro too. check was a breeze, the staff friendly and the lobby and bar very modern. our room was a superior double which was spacious as was the bathroom. Check out A La Mere de Famille for sweets and for dining au Petit Riche, Chartier and au General La Fayette right across the street!", "Date": "June 1, 2011"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Sleep Quality": "5", "Rooms": "3", "Location": "5"}, "AuthorLocation": "London, United Kingdom", "Title": "“Great Location. Decent Hotel”", "Author": "TimesTraveller", "ReviewID": "UR109390751", "Content": "I stayed here last August (2010) with a friend as part of a two part trip to Paris. I found the hotel excellently located (cannot stress this point enough!) It is right around the corner from Les Grands Magasins and the worlds best icecream stall, a supermarche and a lot of cafe's and we found walking to places like the Champs Elysees, Concorde,The Louvre and even Monmarte to be a breeze. I started the review with the location because to me it was the best thing about the hotel. The impressions started off stunningly, with the central location, the quintessentially busy parisian street and the decadent lobby area, but then generally tailed off. The staff are genial; the room was decent, not too badly sized (but the wall paint was peeling on one side) and the bathroom was fairly maintained. I think since I had come from a 3* hotel where the service was better, the rooms were nicer and the staff had actual smiles I may have expected too much from this little hotel. It feels very much like its trying to be boutique but hasnt quite mastered the formula. It was very...OK. All in all a decent hotel for the location and price. I would recommend it if you are on a budget but want to stay somewhere well located with a nice feel and arent to fussy about great service, you could DEFINITELY do worse.", "Date": "May 22, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Toronto, Ontario", "Title": "“Very Satisfied”", "Author": "snowbal", "ReviewID": "UR104301102", "Content": "It is better than i expected. Very convenient location. 100 ft from supermarket,( Water is very expensive in Paris) and 2 mins away from subway station. the room is very clean, Staffs are very helpful, You can practically spend a whole day around the neighborhood if you like shopping.", "Date": "April 16, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "2", "Sleep Quality": "2", "Rooms": "2", "Location": "5"}, "AuthorLocation": "Halmstad, Sweden", "Title": "“Well located with some \"ifs and buts\"...”", "Author": "DonTheo", "ReviewID": "UR103875484", "Content": "The hotel is very well situated. With nice quarters, two Metro stations just around the corner and Sacre Coeur a 500m stroll away it can't be much better. It was also very clean. On the positive side also, the staff was friendly and helpful, as they of course should on every hotel. So far it corresponded very well to my expectations. Due to a union meeting at the airport we checked in very late and had to sleep a little longer than most of the guests the following day. And when we woke up we did it with a BANG.. and shortly after that another BANG and another BANG. The sound of the other guests doors closing was just like if it was our own door closed with full power. Quite hard to sleep then... There was no free Internet connection worth the name wich of course should be standard for a 4 star hotel of 2011. We never tried the breakfast since it was served in the basement area but there was several good breakfast options close to the hotel (and in the sun). We stayed in a superior room so we didn't see the suites but I'm not sure I should call this a boutique hotel. The concept of being a design/boutique hotel requiers more ambition than this. But of course, that's my subjective opinion. Not a poor hotel at all, but not very good value for the money either...", "Date": "April 13, 2011"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "East Molesey, United Kingdom", "Title": "“Boutique hotel, personal service, perfectly located”", "Author": "Judith086", "ReviewID": "UR103279528", "Content": "Delighted with our choice of hotel. Perfectly positioned a short walk from the Opera and Boulevard Haussmann as well as the chacthterful streets of rue des Martyrs and rue du Faubourg Montmartre. Hotel room was smaller than I expected but had clearly been refurbished very recently with new carpet and bathroom. Excellent air conditioning and double glazing - we were on the front of the hotel facing the street and weren't disturbed by noise. The breakfast was included in our package (e:bookers) and was really good with home cooked cakes, baked apples as well as the usual pastries The hotel provides a lovely map with ideas on what to do and where to eat. A really personal touch.", "Date": "April 8, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Espoo, Finland", "Title": "“Good location, otherwise mediocre”", "Author": "Helsinkiglobus", "ReviewID": "UR101280874", "Content": "Hotel is located on La Fayette street and close to the metro station and Galleries Lafayette department store. Lobby stylish but small. Rooms are also rather small (as is the usual case in Paris) and have standard amenities but the \"design hotel\" concept is rather visual than practical in the rooms. Not much extra space. Nice balcony though. Staff was friendly and efficient. Breakfast in the windowless basement area of the hotel was rather cramped and gloomy. Average quality of breakfast. The free internet connection was slow. Paying for the connection gives you a faster version. Only actual problem was getting hot water from the shower in the morning. Had only cold water for the first two mornings and after a few complaints they managed to do something with the shower after which it was possible to shower with warm water.", "Date": "March 23, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "London, United Kingdom", "Title": "“Wonderful- 100% recommend”", "Author": "volen", "ReviewID": "UR100382338", "Content": "we just got back from a long weekend trip to Paris and I can say- we had a wonderful stay at this hotel. The location couldnt be any better. And we were upgraded to the Junior Suite at the arrival as it was a part of our honeymoon- which made it even better! We couldnt get up early for breakfast so i dont know what its like, but the bed is very very comfy, the room is very clean, bathroom is big and the staff is very friendly. We will come back definitely. Thank you David :)", "Date": "March 16, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "3"}, "AuthorLocation": "Chicago, Illinois", "Title": "“Excellent hotel; wonderful, helpful staff”", "Author": "akp_home", "ReviewID": "UR100317756", "Content": "I stayed with 2 friends for 3 nights. We had a wonderful corner room that comfortably slept 3. The room was very clean, spacious, and quiet. I slept better there than in my own home. Also, we received great dinner recommendations from the front desk staff who were very friendly (we highly recommend J'Go only ~3 blocks away). It's not the best location, but very convenient to the Metro and we still walked everywhere (but we're big walkers).", "Date": "March 15, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "london", "Title": "“excellent quality”", "Author": "ok11London", "ReviewID": "UR99292586", "Content": "bit expensive but it is really good, clean, modern, good service, friendly atmposhere. internet access is a bit expensive if you want to use the business connection (free connection is too slow)", "Date": "March 7, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "auckland", "Title": "“Amazing breakfast”", "Author": "specialk23", "ReviewID": "UR98997620", "Content": "I am a regular visitor to Paris. Have stayed in many hotels in the 8eme and 9eme districts. I have to say this is one of the better choices. Rooms are not huge but OK by Paris standard. Room fitout is reasonably madern and OK quality. Location is very good. Very close to metro and 5min walk to Galeries Lafayette. Staff were truely outstanding in every interaction with them. Lots of boulangeries and restaurants of all leveles very close. All in all I had an excellent stay and will definitely return. Might try to get a bigger room though.", "Date": "March 5, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Melbourne, Australia", "Title": "“Great Little Hotel I am Looking Forward to Visiting Again”", "Author": "ScubaSally77", "ReviewID": "UR94534022", "Content": "I really enjoyed staying at this cute, clean and modern hotel. It is in a great location, the staff were excellent and we really enjoyed ourselves. The breakfast room may have been a little small but it is Paris! Would definitely stay here again in the future.", "Date": "January 26, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Sleep Quality": "4", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Geelong, Australia", "Title": "“Central hotel with two balconies!”", "Author": "helen_kost", "ReviewID": "UR92727885", "Content": "Hotel Jules is a trendy little jewel in Paris where we stayed for three nights including New Year's Eve. The decor is very 'cool' and the staff extremely helpful. Our room, on the 5th floor, had not one but two balconies, one off the bedroom and one off the bathroom. Mind you the balconies were quite narrow but big enough to stand and share a couple of glasses of French wine as the Parisian traffic whizzed by. Only real negative was the free, but very slow, internet connection. To get anything faster one had to pay.", "Date": "January 12, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "London", "Title": "“Great little hotel...”", "Author": "chomperchops", "ReviewID": "UR89721593", "Content": "Stayed here one night with my friend, we booked it last minute as we'd had a mix up with our original hotel booking. The superior room was not that big but fine by Paris standards and it had a lovely little balcony. Bathroom was small but the spotlessly clean and the shower had a great jet of water. My only quibble with the room is the lighting - it was quite darkish as there are only two sidelights and another spotlight pointing at a painting on the wall, therefore I would have liked a bit more light to read my kindle properly (it reminded me of a terrible stay at the Hudson in New York a few years' ago). We slept well and the room was just the right temperature. The hotel is also right next to the metro so we got about very easily. The cafe over the road is lovely and we went there for both breakfast and evening drinks. Overall, a brilliant stay in Paris and I will be going back to this hotel.", "Date": "December 13, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Location": "5", "Rooms": "4"}, "AuthorLocation": "EUROPE", "Title": "“Good choice”", "Author": "tmy9", "ReviewID": "UR87424020", "Content": "Nice smell everytime you enter the hall,nice staff very professional and young.rooms are with conforyable beds and very soft towels,insonorization is good.forget breakfast in the 'cave',but anyway it doesn't change overal impression.go there!", "Date": "November 17, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "London, UK", "Title": "“Good boutique hotel that gets the important points right”", "Author": "dskeeles", "ReviewID": "UR86655416", "Content": "I'm currently staying in the Hotel Jules for 4 nights in November. The hotel had a nice stylish interior - seeing the bar first, before the reception, isn't a bad thing either. The staff were reasonably friendly and very efficient. The tiny lift (3 or 4 with luggage max) seemed old and I did think would be overwhelmed, but I never had to wait long for it. My room (516) seems only a year or so old. The room is comfortable enough for the rate in central Paris: the bed was large and very, very comfortable, with crisp sheets and firm mattress. The bathroom was also very new, shiny, with very good quality toiletries - things like the shower cubicle not leaking at all, and having plentiful, instant hot water, were welcome details that you would expect but don't always find in some hotels. Another hitn of the boutique nature of the hotel comes in the form of ceiling-mounted projector light whose sole purpose is to illuminate a 'lips' statue on the wall. As for food - you wouldn't expect to eat in in a boutique hotel, but I was late back one night and tried the room service, ordering Chicken Teriyaki with Rice, and Fruit Salad. Since they have no restaurant, I didn't expect much - perhaps that they would use an order-out service, and I'd get a moped-delivered plastic container, as I have elsewhere. Au contraire... 25 minutes later, I had a full tray with stylish crockery delivered by a hotel staff member. The portions were small - as I've come to expect from France - but very, very good quality, which I would be happy to receive in a good restaurant, and filling enough. Hoping for a bread roll on the side, I received a full bread basket and butter. Probably the best room service i\"ve had in a non-5* hotel, and it wasn't hideously expensive either (Eu24 including a coke). It's not an achingly stylish or absolutely luxurious boutique hotel - the desk is just barely large enough for my laptop if I move the TV, the decor is a little understated - but any cut corners are only cut very very slightly, and all the important things (clean, very good bed, very good shower) are there. I can also confirm as other reviews, that the rooms are slient - walls must be thick, and despite the main road outside, closing the balcony doors completely silences the traffic noise. One strongly negative comment is the 'gym'. I thought this was a little much to hope for in a central Paris boutique hotel, but held out hope.. which was then crushed. The 'fitness centre' is actually their smallest hotel room (it even has a number - 109) - with the single bed removed, and a second-hand Lifefitness treadmill and cycle in its place. And that's it. No weights, mat - or even space for them. Being a hotel room, it does have a bathroom and TV - and the WiFi/mobile phone signals reach there, if you want to use your PDA while you exercise. However... to be fair, the machines do also work perfectly, which is a lot more than can be said for some similar hotels that claim to have a gym, and then turn out to have a few '70s relics verging on the dangeous. If they could have the room opposite as a weights room, with a couple of decent machines and some dumbells, that would help a lot. They should also post the gym photos on their website so that travellers at least don't book on what is otherwise a false promise. The 'free internet' is not the same kind as, say, Radisson Free internet. What you get is a 24-hour login on their Swisscom hotspot, which is limited to 128kbps/200MB total use. It's fine for email/web browsing, but painful for YouTube/Video, or downloads. For that, you have to pay Swisscom directly - Eu22 for 24 hours!! That gets you a steady 1Mbps connection for the period. Swisscom are the most expensive out there, but again, I would have to admit it's an intelligent choice by Hotel Jules: you're not really going to hit the max daily limit (not at those speeds!), and it'll do for email/Facebook and your iphone. If you really need high speeds then you have to pay extra - which is fair enough, at least it's an option. Overall - I would recommend the Jules. It's not hugely outstanding, but it is a quite stylish hotel that, while it doesn't have any specific outstanding points or advantages, has been intelligently put together, and gets all the important points right.", "Date": "November 10, 2010"}, {"Ratings": {"Overall": "1.0", "Value": "1", "Service": "1"}, "AuthorLocation": "bsbruce", "Title": "“I had to cancel - had a Paris pass delivered to the hotel - and it has disappeared”", "Author": "bsbruce", "ReviewID": "UR85891928", "Content": "I had to cancel my reservation a few days prior to my scheduled arrival due to a family emergency. I arranged to have a Paris Pass (Metro Pass and Museum Pass) delivered to the hotel. The tour company had the passes delivered to the hotel and I requested that they mail them to my home for use at a later date. They never responded to my request. I then again called and e-mailed and they told me that they were never received. I contacted the tour company who sent me the the proof of delivery. I then sent this back to the Hotel Jules and again they have been non-responsive. So, I have now re-scheduled my trip and have to re-purchase about $100 in tours.", "Date": "November 3, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "London, United Kingdom", "Title": "“Stylish hotel, great location”", "Author": "RM78", "ReviewID": "UR84887890", "Content": "My partner and I spent two nights in this hotel and we loved it. We choose a deluxe bedroom which was huge by Parisian standards - most hotel rooms I have stayed in are barely bigger than the bed but this had two floor to ceiling windows, a balcony, a huge bed, desk, sofa and en suite (walk-in shower rather than bath). It's a boutique hotel with some great design touches. I am 7 months pregnant but slept unbelievably well in the incredibly comfy bed. The staff were lovely. We got the Eurostar to Paris and just walked to the hotel - it's about 15 minutes away. However it is located between two metro stations so you could get the train - or a taxi. Famous department stores Printemps and Galeries Lafayette are just down the road, about 10 minutes' walk. We had breakfast one morning - again good by Parisian standards as most hotels only offer juice, coffee and croissants (in my experience). This had scrambled and boiled eggs, hot sausages and tomatoes as well as cereals, breads, yoghurts, fruit, cold meats and cheeses and so on. It's 14 euros a head - the same as what we paid for brunch in a nearby cafe the first morning. Would definitely stay here again.", "Date": "October 26, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Boston, Massachusetts", "Title": "“excellent staff”", "Author": "LnT2005", "ReviewID": "UR84833102", "Content": "The staff at this hotel answered every single question we had with a smile. There is a computer in the lobby for use, you can charge it to your room. There is a small bar for a drink in the lobby. There is a metro stop about 1 minute walk away from the hotel. The rooms are clean and the decor of the whole hotel is trendy. There is not much going on in this neighborhood, but hey, you don't go to Paris to stick around your hotel, now do you?", "Date": "October 25, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "3"}, "AuthorLocation": "virginia", "Title": "“A chocolate box cool boutique hotel”", "Author": "mah116", "ReviewID": "UR82657777", "Content": "Hote Jules, located on Rue Lafayette, is a wonderful, affordable boutique hotel nicely situated on the right bank. The rooms are either blue or chocolate in decor and nicely appointed in a simple trendy manner. Small yet stylish and very comfortable, the rooms on the top floor evote a sense of old Paris. Excellent amenities, including free wifi and a good breakfast, continental style. Staff are helpful, friendly and generally relaxed. I would recommend this as a welcomed break from chain hotels.", "Date": "October 8, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Cardiff, United Kingdom", "Title": "“home away from home”", "Author": "telaviv69", "ReviewID": "UR82163855", "Content": "i came to paris to stay with my cousin . first night i stayed in the hotel on my own. there is no problem for a woman on her own there. the main doors are locked at night and you can only go in with your key. the lift can only be used with a key either. the people in reception are exeptional. thank you especially to david and benjamin. (but those are just the names i know). anything i needed was accomodated with speed and amazing courtesy. the rooms are abit small but thats paris for you. my room was increadibly comfortable thought and what are those mattresses they use?? i have never slept on better!! will definitly come back", "Date": "October 5, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "New York City, New York", "Title": "“Trendy little hotel in a great location”", "Author": "read-travel", "ReviewID": "UR81603812", "Content": "We stayed at Jules for 4 nights during our Paris trip in April 2010. The hotel was recommended by a Paris friend. It was a pleasant experience. The room was great - stylish, clean, neat, a nice comfortable king size bed, and an extra single bed for our 8 years old son. We first stayed at a room facing the street which was noisy in the evening, so we asked to change to a room facing the courtyard, which was perfect. The buffet breakfast was also delicious, however the breakfast area was small, if the hotel is full, you might have to wait a little to be seated, so try to get there earlier or later. Jules was recently upgraded to a 4 star hotel, the rate has gone up as well. We would definitely stay there again if we can get a discounted rate.", "Date": "September 30, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "1", "Sleep Quality": "3", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Greece", "Title": "“Good!”", "Author": "Debie13", "ReviewID": "UR81353297", "Content": "Very small rooms but very nice location!The breakfast was poor and boring!", "Date": "September 28, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Sleep Quality": "4", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Norway", "Title": "“Great hotel, good service - not the best location”", "Author": "Maje", "ReviewID": "UR76141608", "Content": "My sister and I went on a weekend trip to Paris this summer. We choose Hotel Jules because of good reviews on Tripadvisor. We landed on CDG airport and took the RER in to the city center (as I always do) before changing to the metro. We used Le Peletrier metro station and it was very close to the hotel - great! However, the metro line for this station has \"Chatelet/Les Halles\" as a junction, and it is (in my opinion) the worst junction in Paris. It`s huge, and this means you have to go up and down stairs and through endless corridors before you reach the plattform you want. We were sweating when we arrived at the hotel. The hotel has late check-in (3 pm) and there was no chance of getting our room early, but I knew this beforehand. We used the bathroom belonging to the hotel restaurant to get cleaned up and it worked out OK. The woman at the desk was very friendly (wish I had caught her name so I could have given her extra credit here) and took care of our luggage in a locked room while we were out. The room itself was quite small, but I`ve stayed in smaller rooms in Paris. No problem. Good, clean bathroom with a good shower (but no tub). The toileteries were not very good, but we had brought our own, so no big deal. Very good beds! Good breakfast buffet, BUT not worth the cost. We got the definate impression from one of the reseptionists that it was included in our rate, and so we ate breakfast at the hotel. Had I known how expensive it was, I would just have chosen one of the many great cafés in the area. My key card stopped working, and the reception was not the most efficient. It delayed us for 30 minutes the morning we were leaving. All in all: The hotel is very good, clean. I`d say it it a very safe choice. The location isn`t perfect if you like to wander the streets in more central parts of the city. It`s quite good if you like the shopping malls, though. Galerie Lafayette is near by. Tip: Get off the RER from the airport at Gare du Nord and just take a taxi to the hotel. Not to expensive and much easier than the junction downtown. Allow some extra time at check-out in case there is a line at the front desk. Eat your breakfast somewhere else. Got a pretty good deal at Expedia. Will probably not stay here again, as I prefer to stay a little closer to St.Germain and the Latin Quarter, but I have no scruples in recommending it to others. The friendly staff makes up for much.", "Date": "August 21, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "London, United Kingdom", "Title": "“Great hotel, location and helpful staff”", "Author": "bigd63", "ReviewID": "UR75081084", "Content": "Very helpful staff, great location. Highly recommend.", "Date": "August 13, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "3", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "3", "Location": "5"}, "AuthorLocation": "los angeles", "Title": "“Convenient, good value”", "Author": "dianita18losangeles", "ReviewID": "UR74829428", "Content": "Convenient place to stay, close to great shopping and best of all, close to the metro. Good enough breakfast. Very helpful staff. We stayed in 2 different rooms. Some rooms are better than others - it's the luck of the draw. Rooms are decently sized. They need to stop spaying what seems to be men's cheap perfume in the lobby bar - You smell it every time you walk into the hotel - it gets old.", "Date": "August 11, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Oulu, Finland", "Title": "“Good and clean hotel”", "Author": "hvaarala", "ReviewID": "UR73688825", "Content": "Room was small but definitely clean. Staff was friendly and location was good. Price was reasonable, considering location and time (July). The street nearby was lively during the daytime and quiet enough during the night. Would recommend to anyone.", "Date": "August 4, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Aberystwyth, United Kingdom", "Title": "“The BEST so far!”", "Author": "Cymraes18", "ReviewID": "UR72111185", "Content": "Having trawled through pages and pages of Paris hotels in or near the 8th arr - I plumped for this one, simply because it was half way between Gare du Nord and La Madeleine. The fact that the hotel website has great photos and looks quite quirky was a bonus with a twelve year old daughter who's keen on design. The reviews on Tripadvisor also helped - as did a special internet 3-night deal direct with the hotel. We went straight from the Eurostar to the hotel to drop off our luggage (check in is at 3pm) and then had time to find our bearings. Remember to buy a Carnet of 10 bus / Metro tickets in the newspaper kiosk at the station when you arrive (avoiding the huge queues downstairs at the Metro machines / counters) - by the way, the buses are brilliant and the drivers really helpful - an unexpected bonus when you're not sure what number to catch! Our room (300) was a 2 room suite - the sofa bed was made up ready for our daughter, who was really pleased to have her own plasma TV, and the clever travel trunk which contained the mini fridge and coffee making machine. The bedroom had a proper king sized bed and great pillows (no need to ask for more to stack 3 together then!) and the bathroom was a treat: his and hers sinks, deep bath with hand held shower, and shower cubicle with large rainshower fixed head & hand held fitting (+ bathrobes and slippers). I could go on and on... the windows actually open, the air con worked really well, thick curtains to block out the light. If you are looking for any negatives - no view (apart from another quirky idea - one wall of the interior courtyard was tiled with a 'vine design' to add a bit of greenery!), teeny-weeny lift (but then again it only services the few rooms situated in this odd triangular section of the building). Top this all off with Benjamin the barman (who showed us to our room, brought our cases up, opened the front door to guests, mixes a mean cocktail etc!) and David on reception who was so friendly you felt perfectly able to ask any questions (not from the school of snobbish, standoffish desk staff at all). You may have guessed - we loved this hotel!!! Cross the road for a great evening meal, slightly further for the best old-fashioned sweet shop in Paris and round the corner to the right and up Rue des Martyrs all the way up to Sacre Coeur and you'll be in heaven (if you can resist the amazing bakeries on your way!!). Enjoy.", "Date": "July 24, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "3"}, "AuthorLocation": "San Juan, Puerto Rico", "Title": "“Great Hotel”", "Author": "KeniSama", "ReviewID": "UR71017038", "Content": "Train stations near this cozy hotel makes it very convenient to see the sites, but ensure you know how to use the Metro before arriving if taking the train from the airport. Many sites are in walking distance if you are ok with walking over a few miles. There are many places to eat and convent stores nearby. If looking for night life or fine Parisian Dinning, there are few around but do your research or ask some of the locals. The hotel staff was very friendly and speaks very good English, they were very helpful when I was looking for a flower shop which was closing for the day. The hotel staff called the shop and asked them to stay open for a few minutes so I could get some flowers for my girlfriend. Check in is at 3 and there's no early check in. The staff was very helpful and safeguarded our luggage as we had lunch at one of the nearby restaurants. Ask to have a room on the 5th floor as you will have a balcony. You will be on the street side, and the street noise is not bad at night. Hotel security is good. At night, you must use your key card to get into the hotel and you always have to use the key card for the elevator, also there's a safe in the room which is a plus. The room was very clean but everything about this hotel is small, but large enough for two people having a romantic trip. I recommend this place for a couple looking for a relatively cheap romantic long weekend and I'll definitely stay here again. I used TripAdvisor to pick this hotel. I used bookings.com to book this room. For additional information, I’d recommend getting a Frommer’s Travel Guide and a laminated City Center Street Map of Paris, both purchased off of Amazon.com for about $25. Good luck and enjoy!", "Date": "July 15, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Perth, Australia", "Title": "“Great location, modern decor, great breakfast”", "Author": "Nat79_2010", "ReviewID": "UR69060298", "Content": "Hotel Jules is in a great spot in Paris. Walking distance to anywhere, even the Left Bank. Close to Montmatre. The rooms are small, but not uncomfortably so. The bathroom did have an odd smell. Overall, it was a very comfortable stay and I'd stay there again. The breakfast was really nice, and staff were very helpful and friendly.", "Date": "June 29, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "3", "Sleep Quality": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Cambs, England", "Title": "“small but comfy rooms and good location”", "Author": "Anne51", "ReviewID": "UR67688477", "Content": "We stayed here for 4 nights in June. Our room was on the small side but the bed was very comfortable, the shower was good and the location near shops, restaurants is very good. There are a number of direct buses to Gare du Nord which is more pleasant than the metro we think. Our room was on the street side which was interesting, having a direct view of the bar opposite which we sometimes sat outside for a last drink, but a bit noisy - however having the aircon on did drown this out! Aircon is very efficient. Breakfast was the usual but nice with some different additions - baked apples one day; croissants perdus another day - very moreish (a flatter pancakey type version of a croissant). Very near to restaurants and bars including the famous Bouillon Chartier on rue du faubourg Montmartre - very good priced Parisian institution.", "Date": "June 16, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Dundee", "Title": "“good quality hotel”", "Author": "pixcell", "ReviewID": "UR65422859", "Content": "We have just come back from a 5 night stay at this hotel. Room was small but you can't expect any more from a moderately priced central hotel. Great bed, quiet room and good air con which we needed as we had very hot weather. Breakfast was a chaotic affair but the staff were very efficient and pleasant. Good location as well - near lots of nice restaurants and bars. I will happily use this hotel again if I have the chance of visiting Paris in the future - big thanks to all the staff who made our trip very enjoyable!!", "Date": "May 26, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "3.0", "Value": "2", "Sleep Quality": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "West Sussex", "Title": "“Great location, shame the hotel doesn't quite live up to the hype”", "Author": "Dousey", "ReviewID": "UR65311104", "Content": "My partner & I stayed at Hotel Jules for a long weekend; after searching on the internet for a hotel we plucked for this one as we liked the quirkiness & look of it from the website. We got a deal for a half price standard room (normally 320 Euros; we paid 150) as we booked quite far in advance. On first impression we were really happy - the front desk staff were really helpful, we were able to check in early, and the lobby / cocktail bar as you walk in are great. However, our room was TINY! Even at the discounted rate we felt it was really overpriced, and the standard of decor was quite poor given the cost. I would have been really annoyed and definitely complained had we paid any more (to be honest we were a little tempted to complain anyway). Having said that, the location is really good - 10 minute walk to the big department stores (Galleries Lafayette, Printemps etc), and some good restaurants / bars in the area. Also close to Gare Du Nord (20 minute walk if you can cope with it with cases), and 5 minutes to the Metro station. The hotel provide you with a little guide to the area which has suggestions for food / shopping / drinks, some of which we tried & we were happy we did! After long days on our feet, we did sleep well in the room - good air con (we needed it, it was really hot!) and the bed was comfortable, if a little small - we were told it was a queen, but it was a double (which would be fine if you are used to it, but we weren't!). We did try breakfast at the hotel on our first morning, but didn't again. Hours are good (6.30am - 10.30am every day), but it was a pretty poor selection for a 4 star hotel - tinned fruits, yoghurt, breads, and a very small selection of hot stuff. Better to go to a local cafe! Overall, we would recommend Hotel Jules, if only for the location. It really wasn't bad, and we would stay again - but be cautious before booking - it's all rosy from the pavement to the lift, but the rooms do not live up to expectations.", "Date": "May 25, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "London", "Title": "“great hotel look no further”", "Author": "kokeshi187", "ReviewID": "UR65172417", "Content": "We stayed here for 3 nights and had a great stay. It was very clean with comfortable beds and very nice breakfast. The location was very good everything was walking distance. The stuff was nice and we had free wifi. We well recommend this hotel.", "Date": "May 24, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Mumbai (Bombay), India", "Title": "“Cozy boutique hotel with a little charachter”", "Author": "Kris69Mumbai", "ReviewID": "UR62563399", "Content": "We stayed at the Jules for a 3 nights in Sept 09 and really enjoyed ourselves. The staff was quite nice and gave good restaurant suggestions and travel directions. It is a short distance from the Effiel tower etc typical tourist spots but yet close to the Opera houe, the big shopping malls (Galleries lafayette) and has several bars, restaurants around. Even taking the hop-on-hop off was easy (at the Opera) so was the Metro. reccommed for a not too expensive option with a comfy bed. try to get a room with a view of the street below. Breakfast room is small but the service good and selection decent for a good start to the day.", "Date": "April 27, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "3", "Location": "5", "Rooms": "4"}, "AuthorLocation": "buenos aires", "Title": "“excellent”", "Author": "sonia98", "ReviewID": "UR61860193", "Content": "booked this hotel through the internet with a special offer, and was more than happy with our five day stay. although did nearly have an heart attack when i phoned for room service and it was 14 euro for a chicken sandwich....ouch.......", "Date": "April 18, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "4", "Overall": "1.0", "Value": "2", "Sleep Quality": "1", "Rooms": "2", "Location": "4"}, "AuthorLocation": "Lucerne, Switzerland", "Title": "“Disaster”", "Author": "Stefan B", "ReviewID": "UR61110501", "Content": "The staff does not seem to have any education in customer care, very snobby. The breakfast at Jules is a catastrophe, it contains almost nothing and is not clean at all. Missing plates, no dark bread, and just not cleaned; everything is just in a big mess. There are doors slamming all night so you cant sleep proper. The design and size of the room is decent. The bathrooms are way too small.", "Date": "April 12, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Sleep Quality": "5", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Moscow, Russia", "Title": "“Really very good choice for Paris!”", "Author": "Ivetta40", "ReviewID": "UR58350459", "Content": "I visited Paris with my friend to celebrate my 55th birthday, to do some shopping and of course sightseeing (this is not my first time in Paris). All I have read at Tripadvisor was true - best choice if you are lucky to book at decent price - I booked through Booking.com - 2 months prior double room breackfast included (and very good breackfast indeed) 5 nights for Euro 690, but I kept checking same hotel at Booking.com and noticed that next offer was Euro 1200, then Euro 1250. What I mean is the hotel is impeccable if you catch it for the adequate price.", "Date": "March 12, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Leeds", "Title": "“Lovely hotel - great location - recommended”", "Author": "eabtwj", "ReviewID": "UR56603982", "Content": "We stayed here for 4 days in Feb of this year. Although admittedly it is not the cheapest hotel you could stay in, I really liked this hotel. We booked into a deluxe room which was extremely spacious in comparison to other hotel rooms I have stayed in in Paris, and it was lovely. The decor of the hotel is great, the service is fantastic and the location is good. You can easily get to all the main attractions within 20-30mins and the metro stop ( Le Peletier on Line 7) is a 2 min walk away. Our bed was really comfy, there was no noise on the corridors at all and we got fantastic sleep. I would recommend the hotel and would definitely return.", "Date": "February 20, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "4", "Overall": "2.0", "Value": "1", "Location": "2", "Rooms": "2"}, "AuthorLocation": "New York, NY", "Title": "“Junior Suite is Awful”", "Author": "Bebe38", "ReviewID": "UR54472362", "Content": "We spent one night in the Junior Suite Room 600 at 520 Euros (listed price 650). We have a home in France, but often spend a night in Paris, so we are very familiar with the hotel scene there. The Junior Suite at the Jules was tiny, cramped, low ceilinged, claustrophobia-inducing. The bathroom had no heat except the towel warmer! There is no view. The closet had exactly 2 hangers. Next to no amenities - no bottled water, no minibar, just a shower cap and cheap shampoo in the bath. PPV movies are 15 euros ($23) to see flicks like The Shining, circa 1975. No valet parking. I could hardly sleep thinking we were paying $750 USD for such an experience. For another 40 Euros, i could have been in a Deluxe King room at the 5 star Park Hyatt Vendome. The Jules is, at best, an average 3 star hotel, possibly a decent place to stay if you book the cheapest room, but don't even think about the Junior Suite.", "Date": "January 27, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "3.0", "Value": "1", "Location": "4", "Rooms": "2"}, "AuthorLocation": "Miami Beach", "Title": "“Fundamentally expensive”", "Author": "Serpeagle", "ReviewID": "UR53580569", "Content": "This hotel is fundamentally expensive for the about 300 euros I spent every night and definitelly expensive for the 500 euros it advertises for the Junior Suite I reserved.", "Date": "January 16, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Location": "4", "Rooms": "4"}, "AuthorLocation": "Singapore, Singapore", "Title": "“Lovely Boutique Hotel with Great Accessibility”", "Author": "Chanelyn", "ReviewID": "UR53271834", "Content": "My husband and I wanted to stay in a nice, quint boutique hotel while in Paris and finally we decided on Hotel Jules after searching through the web. I'm writing this review to help many others like us who really wanted to have a nice experience in Paris, and not spend too much on accomodation. We arrived at Gard du Nord on Eurostar from London and the hotel was close to the station. We tried walking there but I suggest that you take a short bus ride to the Hotel, along Rue La Fayette. As we enter the lobby, I was delighted at the small but lovely decor at the lobby area (very retro). The service staff were very helpful, spoke good english and checking-in was a breeze. We found out that there was a metro station and a 24-hr MacDonald's nearby, so it was great for a quick night supper if you're hungry. The lift was slow and small but since it is a small hotel, we usually get the lift all to ourselves. We were given a corner room at the top level and it was very lovely, clean with very modern decor. If you're looking for a nice, cozy and clean room, this is definitely the place. The hotel doesn't have much facilities like swimming pool, gym or spa. It has a nice little lounge area at the lobby and breakfast is served in a room at the basement. There's also an internet station but they charge quite a lot for the usage. Breakfast was great, they serve American breakfast (sausages, ham, eggs) with warm croissant and choice of Hot Chocolate, Cappucino or Tea. The hotel is also near to the Galleries Lafayette and Printemps shopping malls. Will definitely choose Hotel Jules again if I visit Paris.", "Date": "January 12, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Location": "4", "Rooms": "3"}, "AuthorLocation": "ireland", "Title": "“Great value for money, Location, Staff and room were excellent”", "Author": "spwonder", "ReviewID": "UR52362378", "Content": "Stayed over the new year. Great location no more than 50 feet from a metro, staff were friendly and very helpful, room was small but had everything needed, breakfast buffet which set you up nicely for the day..", "Date": "January 2, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Location": "4", "Rooms": "4"}, "AuthorLocation": "Beaconsfield, United Kingdom", "Title": "“Jules loved Jules, so did I!”", "Author": "skemmo", "ReviewID": "UR50471987", "Content": "We stayed here for a long weekend to celebrate my girlfriend's birthday. The fact that her name is Jules played a big part in the booking of this place! alongside the excellent reviews. We were not dissapointed. It's a very well located hotel: 2 mins to two Metro stations and 15 min walk to Gar de Nord. The double room we had was small but perfectly formed. Excellent shower and spotlessly clean. We had a small balcony looking out onto Rue de Layfayette which was nice too. Buffet breakfast was included in the price and unless you were that 5 minutes before they closed, there was plenty of choice. Staff were very friendly and helpful and that coupled with the excellent location for many of the mian sights and the Metro made a great choice.", "Date": "December 2, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "4", "Rooms": "5"}, "AuthorLocation": "Chicago", "Title": "“Jules is a Jewel”", "Author": "PlayaChicago", "ReviewID": "UR49360071", "Content": "Hotel Jules is situated in a slightly less touristy area of Paris but still in walking distance to the main tourist areas you may want to visit. I was a solo business traveler and felt very comfortable and safe at this hotel. The hotel overall has a feeling of a nice contemporary boutique hotel that is a bit whimsical or quirky in nature. In my room, the lip artwork on the wall and a leather mirror in the bathroom gives you a feeling of this quirky design which I absolutely loved. There are restaurants right across the street and directly around the corner from the hotel is Ed, a small grocery store where you can stock up on snacks and inexpensive but wonderful French wine. In the morning, a small buffet breakfast is set up in the basement of the hotel where you can fill up on delicious pastries, eggs, sausage, yogurt, fruit, cereals, juices, coffee and tea. The buffet was always stocked well and the food always fresh. It was a great way to start each day! There is a small and welcoming bar right in the lobby of the hotel that I did not get any drinks at, however, the bartender was friendly and gladly opened my bottles of wine that I purchased around the corner at Ed. The front desk staff and the bartender spoke perfect English and were very helpful with answering questions on the city. If you are arriving from Charles de Gaulle Airport as I did, you can take the RER B train to Gare du Nord and walk to the hotel. When exploring the city, if you would prefer not to walk, the property is situated on the pink Metro line that goes directly to the Louvre or you can easily transfer to other lines to go to places like the Eiffel Tower. I am already planning a leisure trip back to Paris with my husband for next year and we will definitely be staying at Hotel Jules! This hotel gets an excellent from me with consideration to a wonderful value compared to many other hotels in the city, the overall service being exactly what I needed plus a little extra, thoughtful design, and finally for the overall comfort of the property.", "Date": "November 16, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Location": "3", "Rooms": "4"}, "AuthorLocation": "Nuevo Leon, Mexico", "Title": "“Worth staying here: great service, breakfast included, steps from metro and very safe neighborhood at night.”", "Author": "MtyMom", "ReviewID": "UR48771899", "Content": "Service was the best! Only complaint is that the bathroom shower was rediculously small. If you tried to bend over...impossible! With no shelf in the shower it made it quite an acrobatic act to finish bathing. Don´t know what happened because we reserved a superior room and our friends reserved the cheapest one and theirs had a full size shower twice the size of ours. We explained this to the people at the front desk and they were very accomodating and gave us a discount.", "Date": "November 8, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Location": "4", "Rooms": "2"}, "AuthorLocation": "London", "Title": "“Good Location and staff, far too hot though”", "Author": "irish418", "ReviewID": "UR48625041", "Content": "Good points, great location,very close to Metro and shopping, nice decoration and excellent helpful staff. Upgraded our room without hesitation and were really professional. Low points: Room was really hot (it was quite mild out) and due to time of year they'd switched the air con off which was fine but made our first night's sleep very uncomfortable as the room was so hot , plus there was a faint beeping noise coming from somewhere. There was no mirror in the bedroom (stayed in standard room) only in bathroom which makes getting ready to go out not easy. Noisy - even when moved/upgraded to Delux room - which was very nice - generator came on at 2:00 in the morning and didn't go off until 8:00 the next day. Overall - if you get ther right room you'll be ok, but it was too hot and noisy for us to have a good nights sleep", "Date": "November 6, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Ireland", "Title": "“Fabulous location, room and price!!!”", "Author": "AileenDublin", "ReviewID": "UR46849755", "Content": "Just returned from a long weekend in Paris. Booked Jules hotel based on the Tripadvisor reviews and wasn't let down...the reviews are accurate! We got to the hotel early and they accomodated us without any hesitation with an early check in. I had requesteda double room and they ensured it was -so I was thrilled. Absolutely EVERYTHING about the hotel is fabulous. Rooms are a bit on the small side but are really well laid out and have everything you'd need like safe, fridge for your own drinks, air conditioning (our room got really hot and stuffy and we couldnt leave the windows open with the noise outside). Hotel has really quirky design features like lips on the wall and the mirror in the bathroom is leather with removable items etc- see my pictures! i would definitely recommend this hotel to anyone! If I go back I will definitely be staying there again- the hotel is brilliant and considering the price its an easy choice for me. the only negative comment I have about the hotel is the breakfast room which I was anticipating having read others reviews- it is small. Every morning we went down there was no glasses for juices. The staff seem run of their feet but if you ask them for anything they were so accommodating. -the hotel is great- you shouldnt have any problems, its like 20 second walk from the metro station but I'd recommend renting out one of the bikes.Such a nice way to see Paris! Dying to go again!", "Date": "October 14, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "London, United Kingdom", "Title": "“Excellent value for design hotel in good central area”", "Author": "JDublin", "ReviewID": "UR46761536", "Content": "My husband and I have just returned from a 3 night stay in Hotel Jules. We had read excellent reviews on TripAdvisor, felt that the location was good for us - 10 min bus/taxi journey from Gare du Nord (Eurostar), and the price was reasonable. First impressions of the hotel were very good, modern, funky design with a relatively large lobby and a small, cosy bar. The service at check in was great, really friendly and quick. Our room was behind the lift shaft so we were initially worried that it would be noisy but it was fine. Judging by the hotel layout I'd say our room was one of the smaller ones but by Paris standards it was certainly large enough, with a king sized bed, flat screen TV, ample storage space, minibar, air con and a large window overlooking an inner courtyard. The decor was lovely, bathroom was spotless and shower was great. Continental breakfast was included and the quality of the food was excellent, however they are a little slow in replenishing the stocks, but I found that when I asked for anything that hadn't yet been replaced on the buffet table, the staff were more than happy to get it for me. If there are any others out there who don't read signs properly, (like us!) for security reasons you must insert your room card into the lift in reception before it will take you to your floor - took us a while to realise this even though to be fair there is a sign in the lift to tell you this! The hotel is about a 2 min walk to two Metro stations (Le Peletier & Cadet) so it's really easy to get around. It's pretty central anyway and we walked to all the major tourist sights. We found all the staff at the hotel Jules really helpful and friendly at all times. We wouldn't hesitate in recommending this hotel and hope to make a return visit in the near future!", "Date": "October 13, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Location": "5", "Rooms": "4"}, "AuthorLocation": "weston super mare", "Title": "“Friendly staff,very clean,ideal location for exploring Paris”", "Author": "jeanWestonSuperMare", "ReviewID": "UR46125873", "Content": "Stayed here for three nights with husband and son at the end of August. Short walk to the metro station and on bus route Also not far to the airport bus stop. Staff were very welcoming and obliging. Although three of us shared the room there was ample space and the facilities were good. Good choice for breakfast in the smallish breakfast room. Are a number of restaurants in the locality if you don't want to venture very far in the evening. . Has a small pleasant looking bar but didn't see it frequented -prices weren't cheap Security arrangements to prevent unauthorised persons entering the residential part of the Hotel excellent. Nice to see plenty of quality English newspapers available. for guests. Would definetly stay here again.", "Date": "October 7, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Location": "4", "Rooms": "5"}, "AuthorLocation": "Sunnyvale, CA", "Title": "“Great Little Modern Hotel in Paris”", "Author": "mhung41", "ReviewID": "UR45944573", "Content": "We stayed here recently for 4 days during our honeymoon after trying 2 different hotels in Paris. (Hotel Boileau 2 star and Hotel Beausejour - 3 Stars.) We changed because we weren't happy with the other two for various reasons. This hotel was far and away the best one we stayed in out of the 3. The hotel has been recently renovated (not sure when) and has a very modern feel to it. This was a very nice hotel for a 3 star in Europe. Our room was a bit small, which we booked it through lastminute.com. However, the bed was very nice, carpet was new and not worn out, the towels very soft and the bathroom was very clean and modern if a bit small as well. The breakfast was included with our room and was quite nice as it saved us about 10 euro a day. There were croissants, coffee, plenty of bread, some fruit and yogurt available. It was a little stuffy since it was in the basement and there were a lot of guests eating. Customer service is great. We left for the weekend to go to Beaune in Burgundy and the hotel kept one of our bags no questions asked. The front desk was extremely polite and helpful in helping us make dinner reservations at various restaurants in the city. The only bad thing about this hotel is that internet wasn't free (like 10 euro a day or something like that) and the area it's located in is more of a business area so don't expect a lot of cafe's or brasseries nearby that we could see. (Not a big deal since we ate breakfast at the hotel and It was like 1/2 - 1 block from the Peletier Metro stop on Line 7, so very convenient to all of the tourist destinations and other places in the city with more places to eat. Hotel seemed very popular with people from the UK and it was a mix of people there for business and vacation.", "Date": "October 5, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Location": "4", "Rooms": "5"}, "AuthorLocation": "Ireland", "Title": "“Should be more than a 3 star!”", "Author": "IrelandERM", "ReviewID": "UR45060623", "Content": "We stayed at Hotel Jules for 3 nights in September and it was only ideal. As it was my first time in Paris I was anxious about being able to get around the city etc as my french is only ok. The hotel is right next to a metro station which is what i highly recommend for transport in Paris. I advise tourists to buy a 3 day metro ticket for 4 depending on how many days your going to need it. This allows you to get on and off anyway as they are quite strict on security in the train station and airport in France. The hotel staff were fantastic in talking me through the metro map to know which stops to use for the sightseeing! They all speak great english too. The room was clean with a little balcony and the room was cleaned everyday with fresh fluffy white towels! My only complaint was the breakfast as I know it is a continental breakfast but when we arrived down the first morning at 9 all the cereals were practically gone and not topped up. The same applied to the teabags, hot water for tea & milk! However breakfast starts at 6.30 am and our final morning our flight was early so there was plenty. Overall a lovely hotel and not as expensive as a more central part of the city which was great for eating and drinking out at night. Brillant for our first time in Paris I would strongly recommend it and I would stay again with no hesitation at all!!", "Date": "September 27, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Sydney", "Title": "“Great Hotel, Great Stay!!”", "Author": "n87", "ReviewID": "UR44806988", "Content": "It was a very pleasant stay at Hotel Jules. Its a modern, comfortable and clean hotel with a lovely reception area and nice and helpful staff. The room was a little small but very comfortable. The bathroom was very clean, modern and new with a fantastic shower. The bed and pillows were quite comfortable and having a nice little size balcony was a bonus. Maintenance was great, we got our bedside lamps upgraded during our stay. The position of the hotel was good, very close to restaurants and nightlife. This is a hotel i would definately recommend.", "Date": "September 26, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Location": "5", "Rooms": "3"}, "AuthorLocation": "France", "Title": "“Good find but beware of the rooms by the lifts”", "Author": "Kouzya", "ReviewID": "UR41626344", "Content": "Overall this is a great little hotel and we got a good price on lastminute.com but I feel the 'good deal' was due to our room being just by the lift. I recognise that I am a light sleeper but I could hear the lift mechanics through my ear plugs! We asked to change rooms but the only one on offer was on the other side of the lift so we stayed put. Plus points include having a great location, in between montmartre and the louvre. Other than lift noise the room (409) was quiet. The deco is young, modern and fun and the rooms were spotless every day. Breakfast was tasty but frustrating. Our first experience on Sunday morning was chaotic. All free tables had piles of leftover breakfast that we ended up clearing one ourselves. Over the next few days it got much better and by Tuesday morning it was a pleasant experience (there were 3 people working this day in place of 2 on the other days). I would definitely stay there again but I'd probably pay a bit more to be far away from the lift.", "Date": "September 14, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Location": "3", "Rooms": "3"}, "AuthorLocation": "cheshire", "Title": "“we would love to stay here again”", "Author": "CheshireNeilandange", "ReviewID": "UR40141787", "Content": "We came to Paris for a significant birthday and were upgraded by the hotel. The room was spotless. If we had to look for a critiscm (and we would be looking hard) it would be the lighting in the room. It wasnt good for reading. We were especially impressed with the breakfast, it was lovely.", "Date": "September 8, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Location": "4", "Rooms": "5"}, "AuthorLocation": "London, England", "Title": "“Very happy with this hotel...”", "Author": "Londonbase", "ReviewID": "UR37895344", "Content": "I've stayed in a lot of hotels in Paris and this is by far the nicest 3-star I've stayed in. It's actually nicer than a lot of the 4-star hotels. Bear in mind I stayed in a deluxe room, which was very spacious and a nice balcony. Probably the one drawback was the bathroom, which was quite small and had no bathtub. However, everything was very modern, clean and the staff we're quite helpful yet unobtrusive. As far as the hotel goes, the breakfast is nothing special and the place could use two eleveators instead of the one. Location is also pretty good, being reasonably central and close to a number of metros.", "Date": "August 17, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Galway", "Title": "“Great find”", "Author": "IandLPalmer", "ReviewID": "UR37891631", "Content": "We booked the hotel directly over the net after looking around the area on Google Maps and Street View. Compared to a lot of other hotels in the Opera area this one was cheap and looked rather nice. I have to say we were very happy with the place and the staff. Clean and comfortable room with all the modcons you need. The staff were excellent and always seemed happy to help with any questions we had. The breakfast was excellent, lots of delicious food to choose from all morning. The location of the hotel is perfect. A few minute walk to the Metro and the area is full of bars, cafes and restaurants. A perfect first visit to Paris. Will certainly be returning.", "Date": "August 17, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Scotland", "Title": "“Excellent base for a Paris trip”", "Author": "OldMansTravels", "ReviewID": "UR37277832", "Content": "This is the best 3 star hotel that I have stayed in. The decor is stunning and the rooms superbly clean and comfortable. There were three of us using a junior suite. The third bed was made up from the bed settee in the sitting room but this still left room for the table and chairs.", "Date": "August 10, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Location": "4", "Rooms": "3"}, "AuthorLocation": "izmir turkey", "Title": "“Nice hotel”", "Author": "quinn35", "ReviewID": "UR35747114", "Content": "The hotel is so close to Opera and central located,The rooms are in small size but newly renovated and very clean.The staff are friendly and helpful.Le Peletier subway station is nearly 50 meters to the hotel,there are lots of restaurants,cafes around and there is a market on the corner .You can rent bikes from Velib system just in the next street and go everywhere in Paris.", "Date": "July 25, 2009"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "Pennsylvania", "Title": "“Terrific Hotel and a good value”", "Author": "FinckyTraveler", "ReviewID": "UR34419691", "Content": "We were pleasantly surprised by the Hotel Jules. The Hotel has just been updated so it is very clean and fresh. I highly recommend upgrading to the Jr suite. We paid $245.00 per night and the rate included breakfasts and one drink each evening. The suite had fresh flowers, and the decor was stunning. The suites are in the back of the Hotel, and you have private elevator access. The breakfast is a great deal, especially when you consider how expensive food is in Paris. The staff was extremely helpful, and they speak English. I recommend this Hotel 100%.", "Date": "July 10, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Toronto", "Title": "“Second visit as good as the first!”", "Author": "al_kennedy", "ReviewID": "UR33869471", "Content": "My first stay at Hotel Jules in June 2008 was such a positive experience I didn't even bother looking for another hotel for my return visit in May 2009. I've been to Paris 11 or 12 times and if you want to stay in a central area at a reasonable cost Hotel Jules is a good candidate. Its not cheap at all, but if you search for Paris you'll find that its not out of line with other hotels of its class. Most hotel rooms in central Paris are small and Jules is no exception. The room on this visit was smaller than the first but was still fine. It does get tight with two people and three weeks worth of luggage, but thats the way it is and you need to prepare yourself for that or stay are a more grand hotel (for more money of course). The rooms are extremely clean and the bathroom was spotless. Plenty of thick, clean towels are provided and changed daily. The room we stayed in had only a shower but many rooms also have a bathtub. The picture that I've included of the bathroom was taken from the balcony. Yes, the bathroom has a balcony although I'm not sure anyone would actually use it. The room is well appointed with a small refigerator/mini-bar that had enough free room to put your own drinks in. The room had a large closet with plenty of storage as well as a safe. A small flat screen TV had a couple of English channels (CNN and Eurosport I think). The rooms are modern but are showing a sight bit of wear. There are scuff marks here and there as well as small wallpaper rips. Nothing horrible or unexpected. The beds are great. Two single beds beside each other which works for couples or singles. Rooms either face the street or a courtyard. On both occasions I've chosen a street view and wasn't disappointed. I've read reviews of people complaining about noise and I would have to disagree. If the windows are closed it is very acceptable. Its not silent, but then again you are in a major city. Unlike my last vist, breakfast was included in the room rate. This is my only real disapointment with the hotel. The breakfast room is small and VERY busy (its in the basement). The food is just fine (bread, eggs, fruit etc) but its such a crowded space it was difficult to get anything. We went down earlier the second day but it was just as crowded so we left. Another HUGE warning that was my own fault is the telephone. I had to call my partner from the room one day and used the automated credit card option on the phone. I followed the instructions but nothing was mention about charges or rates. A 45 second call to a North American cell phone was charged to my AMEX - $48. I called the phone company when I got my bill and they said there was a 5 minute minimum, overseas charge, etc. They did credit me $17, but still a very expensive lesson. Another annoyance that you will find in most French hotels - Internet usage. You'll see signs that say \"Free WiFi\". Most people will assume that means free Internet. Nope. It means you can connect to the hotels WiFi service for free and then pay for Internet usage. The hotel staff is very friendly and helpful. Everyone that I encountered spoke perfect English. The area is great if you are driving or walking. The hotel does not have parking but there are places to park within a few minutes walk (very expensive) and you are right between two Metro stations. Just north of the hotel is a great shopping area where you can find all sorts of food shops and restaurants. You are also a ten minute walk from the Opera and the major department stores. As long as their rates stay reasonable, Hotel Jules will get my business.", "Date": "July 4, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Location": "5", "Rooms": "4"}, "AuthorLocation": "London, United Kingdom", "Title": "“Very pleasant stay”", "Author": "SethC", "ReviewID": "UR33785108", "Content": "Stayed here for one night on a quick trip to Paris. The room was well appointed and the bed was very comfortable. The room was small by American standards but reasonable by European standards and larger than many rooms in which I have stayed in Paris. Hotel staff were friendly, efficient and accommodating. English was spoken fluently. Hotel is walking distance to everywhere and located very near Gare du Nord. I would absolutely recommend and would stay here again.", "Date": "July 3, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Location": "4", "Rooms": "4"}, "AuthorLocation": "Boston, MA", "Title": "“Great hotel value and great location in Paris - no question.”", "Author": "BostonTravel321", "ReviewID": "UR32868077", "Content": "My fiance and I recently stayed in paris for 3 nights. We searched for hotels on tripadvisor and felt like the vast majority of the places we read about had extremely negative reviews (room is tiny, dirty, staff rude, won't provide towels, etc), so we were a bit anxious about booking a place. We found hotel jules and the reviews seemed fairly favorable, and the price was right ( ~165 a night). We definitely made the right decision. The hotel is very modern, clean and tourist friendly. The staff went out of their way to help us, even though we barely speak any french ( we did make an effort though). The room was small by american standards, but it provided all that we needed. Any it truly was smoke free. The bathroom was modern and clean and we had a nice view out the front of the building towards the city. They have a computer available for internet access, which we found very helpful as we were traveling with out cell phones. They also have a small room with a treadmill and exercise bike. I wouldn't call it a gym, but it was nice to be able to do something aerobic for a few minutes each day. The computer/internet did charge by the minute (a fair price) and the gym was free. The hotel also served a free breakfast each day. I'm not sure if it was free for everyone or just part of the deal we signed up for when we booked. The breakfast was more than adequate. Plenty of choices, hot and cold. We're not extremely picky when it comes to free food. I figured if we didn't like it, we'd just go somwhere else. The location is great too. We walked almost everywhere once we figured out there were a few different routes we could take. The louvre was about a 15-20 minute walk. The opera area was about a 10 minute walk. I think we even walked to notre dame, although that was a bit further. There are plenty of bars and restaurants in the area, so there was always something to do, and it felt very safe. So, all in all, I would definitely stay here again if we were heading back to paris, especially knowing there are a lot of places which may not live up to expectations. One other tip, non-hotel related. While the metro/subway is a very good way to get around, we had some problems with it. First, the machine for purchasing tickets does not take paper cash, only the euro coins. Which, when we exchanged money or went to the ATM, we basically only received cash. So, you'll have to ask for the coins specifically. Also, while the ticket machine did take credit card, it only works with the cards that have a chip built into it. I think its a new european standard that hasn't quite caught on in the states yet. None of my cards, nor my fiance's have a chip in them, thus they didn't work. It was extremely frustrating for a while trying to figure out why our cards wouldn't work at the metro stations. At first we just thought it was a bad machine, but after it kept happening everywhere, we knew it was us. Luckily a very helpful passer-by stopped to ask if we needed help and filled us in on the whole chip thing. So, good luck!", "Date": "June 22, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "London", "Title": "“Hotel Jules is a real jewel in Paris”", "Author": "jolyncar", "ReviewID": "UR32094885", "Content": "Hotel Jules is in a great location just 15 min walk from Eurostar terminal and 15 min walk from the Louvre. The hotel is very modern with great design and the rooms are lovely. They are a good size, although not huge, but a comfortable size and again decorated really well, they are scrupulously clean and in great condition. They have some really nice design features. The staff are lovely and speak English and I can't recommend them enough. Breakfast is ok at the hotel but don't expect too much. On the whole a really great hotel to stay in the centre of Paris. From my parents room on the 5th floor they had a view of the top of the Eiffel Tower which they were very pleased about. My partner and I are quite fussy about where we choose to stay and this hotel met all of our expectations. My boyfriend said it was the one of the best hotels he has stayed and he's an interior designer. So high praise indeed.", "Date": "June 11, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Location": "5", "Rooms": "3"}, "AuthorLocation": "Oxfordshire, England", "Title": "“Great Hotel”", "Author": "phil_bridge", "ReviewID": "UR30958786", "Content": "This was our first stay in Paris and again TripAdvisor helped in our choice of hotel, we were not disappointed with “Jules” for our 3 night stay from the 18th May, it’s in a great location, very clean room and bathroom, good breakfast and helpful staff, 2 minutes from the metro, what more do you need when you are sightseeing in Paris, we spend as little time as possible in the hotel (you can’t see Paris from a hotel room), we booked through Expedia and got 3 nights for the price of 2 with breakfast, total price £325 not bad for Paris. Also if you ask at reception they will supply you with a kettle and cups for making your own tea and coffee at no cost. Would recommend to all.", "Date": "May 27, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Location": "5", "Rooms": "1"}, "AuthorLocation": "San Francisco, California", "Title": "“Nothing Special”", "Author": "GracieAmsterdam", "ReviewID": "UR30733811", "Content": "I wish I could write great words about our stay at Hotel Jules, but unfortunately it was nothing special. We had read great reviews on Tripadvisor, but were a little disappointed. After going back and forth through various websites we found a Superior Room with breakfast for 432euros for 3 nights. (this was a great deal compared to the first quote I found for over 700euros). We were given a tiny room in the roof, with just enough room at the bottom of the bed to walk by, a small bathroom – although sans bath and a tiny window that was tucked around the corner of the headboard so no full light in the room and we were unable to open fully for air. On our first day we asked for a change of room, but none were available. My sleep was interrupted by the whirring of the air-con. I tried to sleep with it off, but the heat was unbearable. I had to use my ear-plugs. As for the hotel bar, I don’t think it was open over our weekend, and we never made breakfast as it was downstairs in a cramped room. We decided we could get better food outside in the sunshine. The only positive being that the bed was really comfortable, fantastic location and the staff are really friendly. I’m sure there are other alternatives. I was quite happy to pay more, but got the fantastic deal and expected if I had of paid over 700euros we would have a better room and a hotel with a little personality. I had been recommended Hotel Amour just 5 mins walk away, but unfortunately it was full. Sorry Hotel Jules, but we won't be returning.", "Date": "May 25, 2009"}, {"Ratings": {"Service": "2", "Cleanliness": "4", "Overall": "2.0", "Value": "4", "Location": "3", "Rooms": "3"}, "AuthorLocation": "Wellesley, Massachusetts", "Title": "“My thoughts changed after initially liking it.”", "Author": "hans p", "ReviewID": "UR30582470", "Content": "I was attracted to Hotel Jules with their special ,stay 2 nights the 3rd night is free as noted in the Wall Street Journal .I had been warned that to expect tiny rooms with tiny bathrooms .This was not the case ,the room was average size and the bathroom too .It was clean ,no complaint here .The breakfast was so so ,I couldn,t stand the looks of the scrambled eggs ,so I didn,t eat them .There are bagettes were you cut a piece for yourself ,I was struck that there was no napkin to hold the bread as you cut a piece off (I had a cold at the time )with everyone handling the bread that was not good .Hotel Jules is located in a so so neighborhood but with easy access to the Metro with through access to the Louvre .The thing that shook me up though was ,we had a power cut in our block around 4pm .The emergency lights came on in the hallways and stairways .We were on the second floor as I went down the emergency stairs I was stumbling all over the place ,the lights were too dim ,I completely missed the last step and almost went down.I insisted on a flash light from the front desk ,which they gave me .I asked ,is anyone on the elevators ,they answered they didn't know .Here is the problem ,unlike the USA ,when you have a power cut, in Paris ,you lose the phone service too (at least we did here)I went to our room to get my wife ,and then I noticed the shortcomings of this hotel and maybe Paris hotels too.No smoke detectors in the room ,no emergency lights in the room ,I could not see any sprinklers anywhere .The elevator sits in the middle of a long corridor with a stairway next to it .I don,t know if there was another emergency exit since everything was in French .I concluded that if there was a fire in this hotel at night ,I would be very lucky to get out ,and I was on the second floor ,there were at least 6 floors ,god knows what would happen to them .The power cut lasted 4 hours ,and I started to think how we take things for granted in the USA ,sprinklers and all the safety items that go with a US hotel .I don,t know if there is a fire code in France ,but this stay at Hotel Jules has me worried and I will pay attention to these fears next time I travel to Europe by checking safety items before I book .I do want to stress that many hotels are 100 years or more old and might be exempt from todays fire codes ,but that does not preclude you worrying and checking if the hotel is up to US code .I would also want to say that the Hotel Jules may be 1 of many hundreds of hotels in Europe that are not up to todays code ,and I'm not critisizing them ,just the Paris requirments for fire safety.", "Date": "May 23, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Location": "5", "Rooms": "4"}, "AuthorLocation": "toronto", "Title": "“good hotel but bad breakfast service and bad air conditioner”", "Author": "mack555", "ReviewID": "UR27896738", "Content": "we stayed in this hotel for 6 nights from 4th Apr to 10th Apr. It is located on Rue Lafayette which is not far away from EURO star station and which we can walk to the hotel in less than 10 mins (with our lauggages). Everything is great since we have booked our hotel during their promotion (107EUR/day with breakfast). Room is in average size in european standard and it is Clean. However i don't like the design in bathroom especially the shower area. Breakfast is FREE from our package but just don't refill the portion even we asked. Anyways, what can u expect for a FREE breakfast? At least they have enough coffee and juice which i'm already ok with that. Recommand to reserve the a room NOT facing Rue Lafayette cos' it is quite noisy @ night. With the bad air conditioner, u may need to open window to sleep in order to have a better air circulation.", "Date": "April 13, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Scotland", "Title": "“Good value at Hotel Jules”", "Author": "SunseekerScotland", "ReviewID": "UR27739900", "Content": "We stayed here for 3 nights in April as a long weekend for my husband's birthday. Our room was clean but small. The bed was comfy and we were on the 5th floor with a balcony you could walk out on. The air con didn't seem to work very well and it was quite warm outside so we left the french doors open before going to sleep and early in the morning. Breakfast was tasty, but chaotic. There was a good choice of food, but it was very busy and items seemed to run out in an instant. The waiting staff, who were very good humoured were constantly being asked to replenish glasses, juice, cutlery etc but did it all with a smile and a bien sur. The croissants and pain au chocolats were declious. The hotel is in a good location wit a metro very close by and overall we had an extremely enjoyable stay and felt that the hotel was good value.", "Date": "April 10, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Tampere", "Title": "“Very good experience”", "Author": "JuanHi", "ReviewID": "UR27494414", "Content": "My wife and I booked a room at Jules hotel for two nigths just a week before eastern. Our expectation about a hotel in Paris was not particularly high (previous experience). Hotel Jules turned out to be very modern, staff was really friendly and helpful and everyone speaks english. Breakfast buffet was great. We had a really nice and quiet room towards the backyard. This hotel is located just next to Metro Le Peletier. It's close to all major attractions yet a quiet neighborhood. I can't think of anything we missed here. This small hotel gave us everything we needed.", "Date": "April 6, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Location": "4", "Rooms": "4"}, "AuthorLocation": "Hoersholm, Denmark", "Title": "“Great hotel. Great location.”", "Author": "Stikling", "ReviewID": "UR27446951", "Content": "Hotel Jules is a fantastic hotel at a reasonable price. Great value for money. Clean, recently refurbished rooms. Not big - but big enough. This hotel is highly recommended!", "Date": "April 5, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Cork Ireland", "Title": "“Hotel Jules, Paris What a Jewel”", "Author": "HollyCorkIreland", "ReviewID": "UR26668763", "Content": "Just back after 5 nights in Hotel Jules. Rue Layfaette. What a find.From check in from start to finish it was a lovely hotel. The rooms are quite spacious by Paris standards. Mini bar, tv. kettle, hairdryer it had it all. We got a terrific deal which included free breakfast, which was lovely. Scrambled egg, sausage, tomatoes and the usual cereals, juice, fruit, yogurt and lovely fresh crossiants. They are offering free breakfast up until May, which is a great deal. The only advice I would offer is, ask for a room at the back of the hotel. When window is opened at night, there is a bit of noise from the traffic. We requested a change, and there was no problem. I must say the hotel staff are most accommodating, and go out of their way to make your stay as stress free as possible. For that alone I would give Hotel Jules 10 out of 10. I would definately, stay there again. It is central, and has 2 metro stations, 3 mins away. Lovely restaurant accross the road. Au General is the name of that, and the food is excellent. Enjoy.", "Date": "March 23, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Orlando, Florida", "Title": "“Wonderful Little Hotel”", "Author": "April9X", "ReviewID": "UR22182869", "Content": "Two weeks ago, my best friend and I stayed at Hotel Jules for 6 nights. This was our first trip to Europe and to Paris, and neither of us spoke fluent French. I booked the hotel through Travelocity in a hotel+flight package. For a 3-star hotel, this place gave us everything we needed. Our room was a simple twin contemporary (non-smoking) on the 5th floor with a balcony, facing Rue Lafayette. This afforded us a great view of the top of the Eiffel Tower from a distance, especially when the tower was lit up at night. Anyways, below is a list (positives and negatives) about this hotel. I'll begin with the negatives because it's shorter. \"Minor\" Negatives: - Small room and small bathroom = The room is a standard European size, so it is smaller than an American hotel room. Fortunately for us, we were already prepared for the small size, so it wasn't a shocker. - Heater making noise = The heater in our room was loud; it sounded like a shower was turned on next door. After the first few nights, we stopped using it because the room remained warm as long as the balcony doors were shut. - Reception/lobby area undergoing renovations = Work occurred during the day, but we were rarely around to see it; by the time we got back from our Paris explorations, it would be night time. - Small elevator = Compared to an American-sized elevator, Hotel Jules' single elevator was small. However, it did have enough room to comfortably fit 4 people, or 2 people with luggage. Positives: - Location = The hotel is in a nicer area of Rue Lafayette. The street is not overly crowded/congested, and neither is it a truly quiet area. There is a small restaurant across the hotel with a green canopy (unfortunately we did not have a chance to eat there). There is also a small grocery store at the first left intersection from the hotel. Best of all, the hotel is located between 2 metro stops, Le Peletier and Cadet, both about a 1 minute walk away. Also the 2 big department stores, Galeries Lafayette and Au Printemps, are close by (just 5-10 minutes walk away). - \"New\" look = The hotel seems to be undergoing the last phases of its renovations to give it a more modern/contemporary look. - Very friendly and helpful staff = The front desk employees were very friendly throughout our stay. They wore business professional attire, spoke English, and were available 24 hours. They also accomodated our needs: a) David checked us in promptly when we arrived, and also helped us in translating some French phrases. b) One time we called down for some soap, and they delivered it to our room shortly after. c) When we needed a taxi to pick us up at the hotel and take us to the airport early the next morning, a front desk employee offered to call the taxi and make arrangements for us. Next day, check-out was a quick process, and the taxi showed up on time (6:00 in the early morning). - Guest room was always clean. The housekeeper came everyday. - The beds were simply AMAZING! = The sheets were so comfortable and soft we wanted to take them home with us. The beds were totally at fault for our lateness in getting up every morning. - Room amenities = There is an in-room safe, and a tea/coffee tray. The bathroom also had a strong hairdryer, which I desperately needed. The TV mostly had French channels, but there were also 2 English channels (CNN and BBC) and a channel for Spanish, German and Italian. - Balcony doors = These doors acted as a noise buffer to the street noise below us. Also, when shut, they kept the room warm. - Efficient check-out = Took less than 5 minutes. Since we didn't incur any extra charges during our stay, all I had to pay at check-out was the city tax (1 Euro per person per night). Overall, our stay at Hotel Jules was wonderful. We received the basic necessities, and the hotel atmosphere was friendly and welcoming. I wouldn't mind coming back again!", "Date": "November 25, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Business service (e.g., internet access)": "3", "Check in / front desk": "4", "Overall": "3.0", "Value": "4", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Kent", "Title": "“More style than substance”", "Author": "JohnJB", "ReviewID": "UR21821465", "Content": "Hotel Jules is nicely positioned north of the city centre within a 5 minute walk of the two main department stores on Boulevard Haussman and fairly close to Gare du Nord. It's closest metro station will get you to the Louvre/Palais Royal within 5 minutes also. The hotel itself has been completely refurbished and is very tastefully decorated in a contemporary style throughout. Works are still going on in the reception area and there was a faint odour of fresh paint everywhere. As we visited the hotel with a view to organising a function in Paris we were able to inspect a standard room, a superior room, a deluxe room and a suite. The suite and the deluxe room were significantly larger than the other rooms and nicely finished - smart, spotless and stylish. The standard and superior rooms are similarly decorated but very small - no more than 4-5 paces square. Just enough room for a double bed and a dressing table. The bathrooms are brand new but also small. I would recommend insisting on a room overlooking the Rue Lafayette (the front of the hotel) and the internal view from the corridors is horrible. The only real problems with the hotel are easily solved by the management and astonishing that they still exist. They are that the shower room we occupied in our superior room was devoid of a working extractor fan and so fogged up instantly. The newly fitted shower enclosure was fine but there was no internal shelf upon which to place soap/shampoo etc. which meant having to repeatedly exit the enclosure to retrieve the essentials. The shower itself was unable to dispense more than a drizzle and the temperature of the water was totally uncontrollable, instantly changing from arctic to nuclear without warning. My wife's main gripe, however, was that the room's designer had completely neglected to install a mirror of any shape or size leaving her desperate and needing even longer to beautify herself. All in all this is a good choice of hotel for a flying visit to Paris and it's good value - we paid just over £100 per night. The best aspect is the fact that is is new and shiny as opposed to many other Parisien budget hotels. The undoubted style and design however is offset by the room size and absence of some basic facilities. Hopefully the hotel management will read this and attend to the niggles. If they do then this hotel would be very high on my list of places to stay in Paris.", "Date": "November 13, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Business service (e.g., internet access)": "3", "Check in / front desk": "4", "Overall": "4.0", "Value": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "demondmoy", "Title": "“Charming yet small hotel”", "Author": "demondmoy", "ReviewID": "UR20357295", "Content": "I stayed at the Hotel Jules for only two days. I extended my trip for two extra days beyond my other hotel booking (Marriot rive gauche hotel). The Jules is very charming and has the whole \"modern/minimalist decor thing\" going. Its in a very nice yet touristy area. The rates are reasonable and the staff is accommodating. The staff changed my room and even combined my 2 twin beds into a large king bed. The hotel has a nice view as the windows open up entirely and some rooms have a walk out balcony. there are many cafes and pharmacies within 2 block walking distance. Overall it was good, but I was only there for two nights.", "Date": "September 25, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "3", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Melbourne, Australia", "Title": "“Loved the Jules”", "Author": "charmm", "ReviewID": "UR16360038", "Content": "Loved everything about the Jules. We stayed in room 412, it was a bit small but had everthing we needed. The room has been renovated. We had a view onto Rue La Fayette which was great each morning to remind you that you were in Paris. The staff were always helpful and spoke very good English. I had phoned ahead that day to arrange a transfer and nothing was a problem for Claude and his team. Definitely would recommend this hotel to family and friends.", "Date": "May 24, 2008"}], "HotelInfo": {"Name": "Hotel Jules", "HotelURL": "/ShowUserReviews-g187147-d228697-Reviews-Hotel_Jules-Paris_Ile_de_France.html", "Price": "$217 - $501*", "Address": "<address> <span rel=\"v:address\"> <span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">49-51 rue Lafayette</span> | <span class=\"extended-address\">09 Arr.</span>, <span class=\"locality\"><span property=\"v:postal-code\">75009</span> <span property=\"v:locality\">Paris</span></span>, <span class=\"country-name\" property=\"v:country-name\">France</span> </span> </span> </address>", "HotelID": "2514750", "ImgURL": "http://media-cdn.tripadvisor.com/media/photo-s/01/78/bb/a2/lobby.jpg"}}