{"Reviews": [{"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "3"}, "AuthorLocation": "Malmo, Sweden", "Title": "“discusting, awful, old, dirty, cold and expensive”", "Author": "ElizabethJTL", "ReviewID": "UR89013166", "Content": "I got at room so small that if you walked in ju had to go backwards to get out. Mt company had booked a doubble room for me. Water from the toilet ran out in the room, the telefon didn't work and the heating didn't work. The hotel brought a electric fan but the cleaning lady turned it of. When you walked in the corridor there was a big hole under the carpet. And its an axpensive hotel as well. DONT SELECT THIS HOTEL", "Date": "December 4, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "4", "Sleep Quality": "4", "Rooms": "2", "Location": "4"}, "AuthorLocation": "beijing", "Title": "“convenient.”", "Author": "palustrian", "ReviewID": "UR61094104", "Content": "I've actually stayed here twice (some recommendation?), once with my girlfriend (who hated it and was depressed by it, but she has higher standards than I do) and once alone before catching an early flight from Gatwick airport. The hotel is cheap for the location (near Victoria Station) and I found the breakfast quite good for the price of the hotel. The rooms are small and rather 'worn' and the bathroom was shared and very small. But it is convenient for one or two nights and I would stay there again if needed (altho my girlfriend would not).", "Date": "April 12, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "3", "Overall": "2.0", "Value": "2", "Sleep Quality": "2", "Rooms": "1", "Location": "4"}, "AuthorLocation": "Portland OR", "Title": "“Good Location, seen better days”", "Author": "abbsdads", "ReviewID": "UR59701763", "Content": "The hotel was OK in terms of location, the rooms have seen better days and the staff was surly and unhelpful. Changed room 3 times before we were given an executive room (which we booked) that was big enough to swing my attache case.", "Date": "March 28, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "2", "Overall": "3.0", "Value": "4", "Sleep Quality": "2", "Rooms": "2", "Location": "5"}, "AuthorLocation": "Newport Beach", "Title": "“Rooms small and slightly dirty, but great location”", "Author": "agoodley", "ReviewID": "UR57309201", "Content": "My partner and I locked ourselves out of our flat on a Sunday, so had to track down a hotel in our area during a very busy period. Despite checking with 10-12 hotels, this one was the only one with availability. So... now that you have the background...here are the pros and cons: PROS 1. Cheap - we paid 40 pounds for our room. 2. Location- next door to Victoria station, as the name suggests. 3. Free breakfast with the room - nothing fancy, eggs and cereal 4. Receptionist/owner- we found him very helpful CONS 1. Rooms - ours was tiny, and there were two double bed instead of one king. 2. No en suite bathroom. 3. General dilapidation of the place. Overall, this place is run down, small, rickety and true, on its last leg. However it should be said -- there were not bed bugs in our bed.For 40 pounds in London, we got a decent night's sleep but wouldn't want to stay here for more than 1-2 nights.", "Date": "February 28, 2010"}, {"Ratings": {"Service": "2", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Location": "5", "Rooms": "1"}, "AuthorLocation": "Australia", "Title": "“DISGUSTING !!!”", "Author": "mema61", "ReviewID": "UR39119036", "Content": "They should be made to take their listing off the internet - when looking it seams OK But when you get there - the place should be pulled down or have a total re-vamp. I have to say the sheets and towels and bathroom were clean - toilet needed some work and time to clear,the shower head needed fixing to the wall, but the rest of the room was \"DISTGUSTING' The hotel is split in two and both sections are very bad, with looks and smell. The room had been serviced before we arrived(well) no tea/coffee in room. Got plenty when we asked for it. The curtains are half hanging on the rails,no handle on the robe, its also lost a leg - this really does not mater because you'd not want to use it......... We would have moved out if we could have found other accommodation at the time, but for us it was better somewhere than nowhere.... We booked this hotel beleiving it was 'middle of the road', (I don't think 70 pounds per night is a price you pay for 'slumming it') for its location, so close to the things we wanted to see on our short stay in London. Mind you they did give us a gift to take home, infact many gifts, which we are still admiring today, 2 weeks after leaving -BEDBUGS. We also thought we'd paid for our accommodation over the net, but on arriving was asked to pay with cash, But my husband said noway - card or nothing, at least this way we are covered if they do try and charge us twice. PLEASE WHO EVER YOU ARE AND FOR WHAT EVER REASON YOU ARE STAYING IN LONDON DO YOURSELF A FAVOUR AND GIVE THIS HOTEL A VERY BIG MISS..............", "Date": "August 29, 2009"}, {"Ratings": {"Overall": "1.0", "Service": "1"}, "AuthorLocation": "juditalguero", "Title": "“taking the money even after cancellation”", "Author": "juditalguero", "ReviewID": "UR38881297", "Content": "I booked a room in this hotel before seeing the reviews in this site. After seeing them I cancelled, receiving a proper cancellation confirmation e-mail from the HBN booking service. That was more than 2 weeks before the day of arrival. Today, checking my bank details I realised that they still charged me the 70 pounds of the hotel room, without even staying there. I called them and they even said that it's my fault! Absolutely, the most unprofessional hotel ever. They are thieves! Do not make any reservation with them!", "Date": "August 26, 2009"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Location": "3", "Rooms": "1"}, "AuthorLocation": "London", "Title": "“Absolutely disgusting - INFESTED!!”", "Author": "Preston___B0y__", "ReviewID": "UR38728352", "Content": "My Aunt and Uncle stayed in this place a few weeks ago when they were visiting from Australia. They had booked this place mainly as they were struggling with their last minute visit. I had arranged to call them on the morning of their first stay at the hotel, I located the hotel’s website and the number that was offered as their contact line was an discontinued number. Being a little surprised by this I tried to get the number from Yell but given the generic name of the hotel they drew a blank. I then turned to your site hoping you may have contact details, I have never seen such bad reviews for a place. I was quite concerned and worried at this point about my elderly relatives, so set off to get there as soon as I could. I did manage to get in touch with the hotel reception via directory services so I felt slightly better, although the receptionist told me they had no phone in the room they would pass on a message. When I got to the hotel it looked like the entrance to a mini cab office. I even walked past not believing that this could be the correct place. I went in and spoke to the receptionist, to his credit he was very helpful. The place stank of damp and mould and general horribleness, he called across to the other building where my relatives had been put. I had to wait outside as the smell was making me feel so nauseous. They managed to get a message to my Uncle and I went across the road to meet him. I was slightly relived for them when I entered the place they were staying as they had seemingly escaped the smell. The place was totally run down with undecorated plasterboard and looked like a squat, their room was no different and very damp smelling. I have signed up and resisted to trip advisor as I have just had an email from my Aunt telling me that they were assaulted by bedbugs that night and are totally covered in bites and have only just stopped itching after a week. They have had to travel all the way back to Australia with bites on their faces and all over them. I am unbelievably disgusted that my retired relatives had to face this ordeal for coming to visit me in London for two nights.", "Date": "August 25, 2009"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Location": "2", "Rooms": "1"}, "AuthorLocation": "MONTERREY", "Title": "“not even couldn't stay one night, one minute...”", "Author": "ANELEANA", "ReviewID": "UR38544899", "Content": "awful hotel, bad service, a lot of stairs and elevators, a \"beautiful view\" to the victoria station...... small unconfortable rooms, dirty and we found a big ashtray full of cigaretes... not even a minute in our rooms!!! and they didnt want to give us our money back! dont waste your time or money!!!", "Date": "August 23, 2009"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Check in / front desk": "1", "Overall": "1.0", "Value": "1", "Rooms": "1", "Location": "1"}, "AuthorLocation": "england", "Title": "“cesspit hotel”", "Author": "EnglandBigbod", "ReviewID": "UR24320276", "Content": "arrived after a 6 hour bus ride with my wife and daughter and was told we would be in the eaton hotel across the road . then having booked online by cc i was told by the guy on the desk we don't take cards only cash but i refused and am keeping an eye on my card statements. the room was at the end of a corridor with the stickiest carpet you could have imagined like walking through glue,the wall had dirty marks allover and the duvet cover had what looked like [-] stains on it . we didn't stay for breakfast", "Date": "February 6, 2009"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Business service (e.g., internet access)": "1", "Check in / front desk": "1", "Overall": "1.0", "Value": "1", "Rooms": "1", "Location": "1"}, "AuthorLocation": "Zürich", "Title": "“don't even think of going there”", "Author": "chitz09", "ReviewID": "UR21896701", "Content": "I had a reservation and arrived right on time. I was told that there was no room left and I had to pay much more for - as I was told - a bigger room. What looked cheap became much more expensive. After complaining nobody was responsible, the boss had just left and the man at the reception got very aggressive. The room was dirty and noisy. Only breakfast was OK.", "Date": "November 16, 2008"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Business service (e.g., internet access)": "3", "Check in / front desk": "1", "Overall": "1.0", "Value": "1", "Rooms": "1", "Location": "3"}, "AuthorLocation": "Berkshire", "Title": "“Would not recommend to anyone!”", "Author": "smashingbirduk", "ReviewID": "UR14463037", "Content": "We stayed there last night and we're disgusted. we paid £75 for a triple room which was a case of cramming a double and single bed into a tiny room. Upon arrival we were starred at by a foreign sounding man at reception who clearly did nt want to be there. he shoved a piece of paper at me to fill in to check in. He then said we were in the other building so taken outside and pointed in the direction of a wooden door next to some sort of kebab house. we were warned to be careful as they accept no responsibility for any loss which set alarm bells ringing. we got inside where it was just 3 floors of corridors and went down to the basement where our room was. once inside, we found the smoke detector was stuffed with toilet roll, the last guests rubbish was left on the dressing table, the beds didnt match and the window didnt lock. the plug was clogged in the shower so kept having to turn it off to avoid completely flooding the bathroom. the tv had 1 channel which played across numbers 1-4 and 5 didnt work. outside the window was masses of rubbish, disgusting. amazingly when we came back from our night out we still had all our belongings which we really did not expect. the room was freezing though and the only bed covers were a sheet and a felt blanket so no good nights sleep. i would not recommend staying here...", "Date": "March 23, 2008"}], "HotelInfo": {"Name": "Victoria Station Hotel", "HotelURL": "/ShowUserReviews-g186338-d1023603-Reviews-Victoria_Station_Hotel-London_England.html", "Price": "0", "Address": "<address class=\"addressReset\"> <span rel=\"v:address\"> <span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">278 - 280 Vauxhall Bridge Road</span>, <span class=\"locality\"><span property=\"v:locality\">London</span></span>, <span class=\"country-name\" property=\"v:country-name\">England</span> </span> </span> </address>", "HotelID": "2514309", "ImgURL": "http://media-cdn.tripadvisor.com/media/photo-o/01/c0/1d/8b/victoria-station-hotel.jpg"}}