{"Reviews": [{"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "4.0", "Value": "3", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Belgrade, Serbia", "Title": "“great location but a little pricey”", "Author": "Ivan L", "ReviewID": "UR127155817", "Content": "I stayed at this place by a friends recommendation and liked the location best. It was clean and quiet so great sleep quality. Design was not for me (too much pink and floral patterns) but this maybe a plus for someone else. In general I recommend this place and the only reason I gave 4/5 is that I think their rates are a bit higher than what it should be.", "Date": "April 2, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "London", "Title": "“Good choice for family visit”", "Author": "LondonCinders", "ReviewID": "UR126316763", "Content": "We stayed at myhotel chelsea for 2 nights with our (almost) 2 year old son, we had a superior double room - which you need in order to have the cot (provided free) for the toddler. The stay could not have been better or easier. Very friendly staff, the room was clean and comfortable (I ddint' take a picture but it was one of the pink ones with a large double bed and there are lots of other pics from other people). We had a babysitter who was able to sit in the conservatory area when we were out and our toddler was sleeping with a babyphone which worked perfectly. When I asked for a glass of milk every night for my son it was brought up and we werne't charged for this. Very well placed but not noisy (our window faced onto Ixworth Place on the 2nd floor) for walking to South Ken/Sloane Square. The MAIN BENEFIT for a parent though, bar the friendly, accomodating staff was that 3 minutes down the road is a brilliant playground!!!!! We were there about 2-3 times a day so our son could let some steam off. Definitely a \"find\" if you want to visit London with a small child in tow.", "Date": "March 19, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "San Francisco, California", "Title": "“A Lucky Find”", "Author": "bpollock2", "ReviewID": "UR125962385", "Content": "After our apartment rental for a family of five, including 3 teenagers, fell through at the last minute right before the holidays, we needed a new place quickly. Fortunately, we found myhotel Chelsea. I'm compelled to write this review--my first for trip advisor--because the hotel was absolutely terrific.I should tell you I am a very picky guest. I need a quiet room because I am a light sleeper. As I have a super-sensitive sniffer, I require a room without any musty or perfumy odors. Also, I can't tolerate stained carpeting, showers that don't regulate, and mattresses that have been around the block a few times too many, You get the picture? I'm very fussy. So here's why I liked this hotel so much: 1. Superb location near Sloane Square, Harrods, V & A Musuem, Brompton Road, Kings Road etc. but on a quiet street 2. Clean, modern f,f&e (furnishings etc) 3. Thick walls 4. Great bedding including suitably thick comforters and firm but not too firm mattresses 5. Ample water pressure and large enough shower head to provide nice flow; it was hand-held but with a mounting for hands-free use; shower curtains included so need to worry about flooding the floor; no wandering temperature syndrome 6. Ample lighting for reading and dimmable for other activities 7. Helpful staff 8. Safe easy to use with your own credit card; no pin to input or remember If there were any nits to pick they would be: 1. Bathroom doors had glass panels so light streams through; if there are insomniacs in your crew who repair to the john in the middle of the night for some reading time....not going to happen 2. Not intuitively obvious but turning on the TV requires pressing and holding down the power button for 5 seconds 3. We only got our Walker's shortbreads the first night....was this an oversight? Overall an excellent value, especially considering how expensive London is.", "Date": "March 11, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "midlands/eng", "Title": "“Refreshingly different! Pretty boutique hotel in a good location”", "Author": "lilchic7", "ReviewID": "UR124955315", "Content": "We usually stay in a larger hotel always a min 4 star. This was a really pretty small hotel. It had a classy feel quite quirky and a little romantic decorated in pastels. We had a suite which was a reasonable size (good for london) The room had everything that you would expect - a seperate seating area with a sofa and two chairs, a mini bar, 2 televisions a dvd player ( films available) the bathroom was modern and robes were available. The bed , however was i think a standard double and i would usually expect a slightly larger bed in a suite, it was comfortable though.The room was very warm but the windows could open so we didnt use the air con just turned down the radiators and opened the windows and as the position of the hotel is so good the noise levels from outside were not a problem. The staff were very helpful and friendly and it felt very personal. There is a lovely small library which is available to use to sit and relax in. We didnt actaully eat in the hotel as we were so near to other restaurants etc but their restaurant was gorgeous looking the decor very feminine and pretty. We loved that we were tucked away in a chelsea suburb but walking distance from the kings road and sloane square etc so perfect. We would stay here again if we stayed in this area. I would recommend Toms Kitchen just around the corner for brunch and or dinner.", "Date": "February 21, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Sleep Quality": "4", "Rooms": "3", "Location": "3"}, "AuthorLocation": "UK", "Title": "“Excellent value”", "Author": "Annie25th", "ReviewID": "UR124099885", "Content": "We stayed here for a \"birthday\" weekend in London. The hotel is small and tidy and on a fairly quiet (in London terms) street with helpful and polite staff. Our room was a standard double and the rate £130/night inc. breakfast. This was good value for a small boutique-style hotel in this location. The room was compact but clean and tidy (only minus was a cold bathroom) with nice furnishings and clean, fresh linens. The communal areas include a lovely conservatory and a very comfortable bar. Breakfast was a good spread of fruits, yoghurts, pastries, meats, breads, coffee, juice etc and there was lots of it too. Drinks in the bar were reasonable. The Tapas menu was also good - we ate here very late on the Friday night, but was still treated well and not rushed. Food was fresh and tasty. And finally, this is the first hotel I have ever stayed in that I haven't been woken during the night by slamming doors, bin lorries, noisy guests, room service trolleys, plumbing, air-con...........well done MyHotel! We'll be back!", "Date": "February 4, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "hong kong", "Title": "“Still keeping up well”", "Author": "littlebc", "ReviewID": "UR123768267", "Content": "This is the second time we stayed in Myhotel Chelsea. After 4 or 5 years, it still maintains its good standards and remains our favourite in London. The location is convenient, 10 minutes from South Kensington tube station yet quiet enough, a little bit like living in a local London residential area. This is a boutique hotel, with pretty contemporary but not too fancy deco. The rooms are clean, comfortable and not too small. The staff are very helpful though not particularly friendly. We like this location also because it is close to Sloane Street and Harrods, where shopping is easy. There are a host of good restaurants within 5 to 10 minutes walk. Thus, don't bother about the room service which was not impressive at all.", "Date": "January 29, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Copenhagen, Denmark", "Title": "“Our favourite in London”", "Author": "Ryttergaard", "ReviewID": "UR122780712", "Content": "I guess we have staid at this place more than 10 times. Rooms are very nice and comfy. Breakfast has been reduced a bit in quality but is still very nice. In the evening the bar is a great place for a pre dinner drink. Always very polite staff and of course nice restaurants around the corner and short walking distance for great shopping. Tube stations South Kensington is a 10m walk away. I will be back - as somebody once said :-))", "Date": "January 8, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Sleep Quality": "3", "Rooms": "2", "Location": "5"}, "AuthorLocation": "London, United Kingdom", "Title": "“Well located, small and pricey”", "Author": "patricio s", "ReviewID": "UR122059998", "Content": "The location is really great. People are nice and polite but the rooms are extremely small!", "Date": "December 24, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Sleep Quality": "4", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Sevenoaks", "Title": "“Nice but pricey”", "Author": "SunshineSevenoaks", "ReviewID": "UR120900574", "Content": "Good location - situated not far from Kings Road. All staff were very friendly and we were made to feel very welcome. Hotel had a lovely homely feel, complete with complimentary muffins in reception. Breakfast was good - continental style. However, the room was very small and for this reason, I do feel it was over priced at £250 a night. Would we stay here again? Probably not as I am sure we would be able to find something that offers better value for money.", "Date": "November 22, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Cheshire,UK", "Title": "“Perfect base for London , great rooms, i can only nit-pick !”", "Author": "Zoom6562", "ReviewID": "UR120817639", "Content": "This seems a perfect hotel for exploring London or business trips. It's location is great, only a 5-10 minute walk to South Kensington tube and 30 seconds to Sloane Avenue where there are taxis, buses and plenty of shopping e.g. The Conran Shop and Bibendum within 2 mins walk. My stay was a quick overnighter and i didn't get to try any food, but the bar was excellent and cosy, a very boutiquey feel to the entire place. My room was comfortable but not too spacious, the bathroom was again quite bijou but had all the necessary quality fittings....only niggle here was my own personal dislike of over-softened water that means you feel like the soap never rinses off ! There was a large wardrobe and a large electronic safe operated with your room card, plenty of space for laptop, phone, etc etc.. The double bed was comfortable with nice pillows of different sizes. The in-room refreshments were a bit on the expensive side (normal for this type of hotel), there is a Sainsburys a 2 min walk around the corner, stock up there for any essentials. The Reception staf were friendly (didn't see any fairy cakes available....rumour), and checkin and out were easy. WOuld i come back ? definitely, its comfortable, quiet and an ideal location.", "Date": "November 20, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Melbourne, Australia", "Title": "“A little gem in Chelsea”", "Author": "Heather T", "ReviewID": "UR120724390", "Content": "We like to stay in boutique hotels in this area, and since discovering MyHotel Chelsea we keep returning to this one. The hotel is ideally situated in a quiet street ensuring a good nights sleep, close to public transport, and walking distance to some fabulous shops and restaurants. We stayed in a superior room on the second floor with a super comfortable bed. The hotel staff are very helpful and there are nice things like filtered water and cupcakes complimentary in the reception area. There is also a lovely lounge area with computers and printer free to use during your stay which proved to be very handy for us. We would like to thank the Hotel Manager, Victoria, who helped us through our dilemma when the hotel we had booked to stay in Paris sent us a note that that had bumped us to another hotel the night before we were due to arrive. Victoria phoned the hotel and spoke to them (she is fluent in French) to make sure we had suitable alternative accommodation and everything would be alright for our visit. She also made another recommendation for accommodation in the south of France that turned out to the simply amazing. Thank you Victoria.", "Date": "November 17, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "pauljansen", "Title": "“Fantastic little hotel”", "Author": "pauljansen", "ReviewID": "UR119961686", "Content": "Having just moved out of London I was eager to get back for a little shopping and seeing friends. I had previously stayed in other hotels in London, but having spent the last year living in Knightsbridge and shortly after in Chelsea, I was looking to stay in a hotel near to these areas. myhotel Chelsea is truly in the heart of Chelsea, I enjoyed very much walking from the hotel to Harrods (7 minutes walk). The hotel room was large, very comfortable and well appointed. The prices were also extremely enticing, not the usual 300 pounds a night, but were closer to the 130 pounds if I recall correctly.", "Date": "October 31, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Location": "5", "Rooms": "4"}, "AuthorLocation": "", "Title": "“A gem of a place off the Kings Rd.”", "Author": "dandsedwards", "ReviewID": "UR119614625", "Content": "An ideal place to stay, quiet, clean, value for money and in walking distance to the metropolis. Ideal if wanting a base near to Royal Brompton.", "Date": "October 23, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Copenhagen, Denmark", "Title": "“Just like home”", "Author": "Martin Dahl C", "ReviewID": "UR119243092", "Content": "I stayed at Myhotel in Chelsea and it's just like being at home. The whole atmosphere is very relaxed without any lack of service from the staff. A clean, modern hotel with all the necessities when you are away on a business trip.", "Date": "October 13, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "London, UK", "Title": "“Nice, pleasant and well located hotel”", "Author": "kenc", "ReviewID": "UR118784042", "Content": "On arrival on a Friday night, we were given a pleasant room on the second floor. It was well furnished, if a little on the small side. Our lights stopped functioning in the bathroom so I complained. After failing to resolve the matter, we were given room 44 which we were told was the best room in the hotel (the website soon showed us that it wasn't - there were two better ones). Room 44 is a large suite at the top of the hotel with big room, seating area with second TV and a large bathroom with bay windows. It was very nice. However, the bathroom lights soon stopped functioning. Staff heroically managed to get them working again but they went off again soon afterwards. Imagine our embarrassment when we came in on Sunday to find a postcard on the floor behind our door. It turned out that the faulty lights that were following us around the hotel were caused by our faulty electric toothbrush. Having identified what the problem was, I was very impressed by the way that the staff went out of their way to, first of all, give us another and better room, and then to let us stay in the better room once the source of the problem had been identified. Not only that, but they also gave us vouchers for Champagne cocktails on the house for our trouble. That was first class service and I was most impressed! Continental breakfast is included in the price and was generally very good. On the last day I had an English breakfast which cost me £4 extra. I thougt that was good value as the food was very well cooked by the kitchen staff. The only downside; on the last day, my partner had to leave for work before breakfast started. We asked the night before if there was any other option available for her. They said \"No!\" and \"Please do not set foot in the breakfast room before 7.00am as it will upset the girl who prepares breakfast\". So, spotting a porridge-type meal in the hotel room, she took this with her to eat on arrival at work. When I went to pay the bill I was aksed for £2.50 for the porridge. I enquired whether this could be offset by the fact that my partner was unable to eat breakfast that day. I also pointed out that I, too, had been unable to eat breakfast on Saturday due to having to leave early in the morning. \"Absolutely not. Two different departments!\", I was told. So, I had to pay £2.50 for the porridge despite saving the hotel two breakfasts. That was a bit mean but it wouldn't put me off staying here again.", "Date": "September 30, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "4.0", "Value": "3", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "London", "Title": "“Top staff and top location”", "Author": "DeltaDeltaGolf", "ReviewID": "UR118384030", "Content": "Best thing about MyHotel are the staff - give them all a pay rise! The location is great for South Ken tube which is served by three lines. The rooms probably could do w a bit of a paint and a really deep clean but the staff are so good if you have any problems they will fix it up for you.", "Date": "September 20, 2011"}, {"Ratings": {"Location": "5", "Overall": "5.0", "Value": "5", "Service": "5", "Rooms": "5"}, "AuthorLocation": "Missoula, MT", "Title": "“Charming and comfy”", "Author": "AnnabelleMissoula_MT", "ReviewID": "UR118211251", "Content": "I stayed here for 4 days while visiting my niece in London in April 2010. I was greeted at the front desk by a basket of fresh fruit and pastry tray. The staff was friendly and helpful. The room was feminine and the bathroom looked fresh and immaculately white. Nothing fancy, but it had all the comforts I needed. The hotel had a library where guests could use one of 2 computers; there was always coffee/tea service and fresh fruit available there. I wouldn't hesitate to stay there again.", "Date": "September 16, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Dubai, United Arab Emirates", "Title": "“Delightful nook just off the main drag of the city”", "Author": "sarahjane1912", "ReviewID": "UR117730104", "Content": "I was here for one night only but I do wish I'd stayed longer! En route to Ireland, I chose myhotel Chelsea because of its central location but in fact, it's really more of a boutique hotel on the 'edge of the action'. Everything I needed was -- pretty much -- within walking distance and I did feel I was in exactly the right place in London to achieve my ends. First off: I stayed in the Geisha studio which was charmingly decked with everything to supplement a mock-Japanese setting. DVDs of Japanese-themed films, music to set the mood, Saki cups and green tea pots ... this room really set the mood. But it wasn't just a 'room'; despite being described as a 'studio' room, the room was very large with a HUGE bed [choice of pillows supplied] and there was a good-sized bathroom PLUS a dressing room [complete with mirror/make-up lights]. I wasn't mad about the puce/magenta colour scheme but that was a personal thing, because the whole set-up was utterly 'geisha' and designed to relax and restore. I did really appreciate the the communication from the hotel marketing staff: check-in time was 2pm but I informed the hotel I would be early and would like to leave my bags at reception [no problem, they said!] and joy of joys, my room was ready at 11am at no extra charge. That's always something one remembers. The only 'extra' hotel service I enjoyed was the bar area. It DID look like a breakfast bar [despite the nice number of tables available] but I felt it was too 'light' in colour/lighting for a real bar, despite the great service and nice selection of drinks and bar snacks. Nice staff too; I even found a lovely server behind the bar who has spent time in 'my part of the world' -- UAE -- and she was very sweet and warm to talk to to. Check-out -- a breeze [as was check-in] and my sleep was fantastic [just what I needed before starting the next leg of my holiday]. Would not hesitate to recommend myhotel Chelsea for a fantastic central point upon which to base one's trip to London, and I will certainly be staying again on my next trip. Thanks again, everyone! :-) PS. Particularly LOVED the fact that there was a computer in my room AND free wifi access. I do loathe that so many hotels don't consider wifi connection as part of the deal, so myhotel Chelsea comes up trumps in that regard.", "Date": "September 6, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Bucharest, Romania", "Title": "“It was lovely. We really enjoy it”", "Author": "Doina C", "ReviewID": "UR116539778", "Content": "Nice room in delicate colours, cozy bed, stylish bathroom, friendly ambience in the hotel. Graceful staff and a very appetizing breakfast. It is a place I recommend with sincerity.", "Date": "August 10, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "4", "Overall": "5.0", "Service": "5"}, "AuthorLocation": "Toronto, Canada", "Title": "“An oasis in the trendy west-end”", "Author": "Marco_Polo_20155019", "ReviewID": "UR116520801", "Content": "I stayed at Myhotel Chelsea last week during a quick but leisurely visit to London. This boutique hotel is excellently-located: a quick walk away from Kings road and the South Kensington tube station. The hotel is completely new and clean, with a trendy decor and comfortable surroundings. What impressed me most though were the staff. They were all so very nice, friendly and would go out of their way to help you... I will definitely go back and recommend this hotel.", "Date": "August 10, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "4", "Service": "5"}, "AuthorLocation": "Bristol, United Kingdom", "Title": "“Great hotel, lovely staff, light and airy rooms!”", "Author": "SarahPez", "ReviewID": "UR116118591", "Content": "We stayed here for a couple of nights recently and had a great experience. The staff were amongst the friendliest we have encountered in a hotel. Really helpful and genuinely interested in us. We had breakfast included in the very reasonable price for a 4 star in London. It was a continental breakfast which suited us just fine, but if you want a fry-up, this isn't the place for you! Great choice of juices, cereals, pastries, bread and fruit. The room was light, airy and bigger than most you get in London. It was quiet as it's not on a main road, but only few minutes walk from South Kensington tube station. There are even free muffins in reception!", "Date": "August 1, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "4"}, "AuthorLocation": "", "Title": "“Perfect hotel for a girls weekend”", "Author": "Rawnic", "ReviewID": "UR115427884", "Content": "Having lived in London for a number of years it was a treat to come back and stay in a hotel for a girls weekend of shopping, drinking and eating. This was a perfect hotel for that; rooms were compact but comfortable, staff very helpful, great breakfast and fantastic location. We loved being able to wander down to Kings Road in 5 minutes though the location of the hotel wad incredibly peaceful for central London and South Kensington is tube is only 6 or 7 minutes walk in the opposite direction. Myhotel was far nicer than the large chains I often stay in, I'll definitely be back.", "Date": "July 16, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "3", "Overall": "3.0", "Value": "2", "Service": "3"}, "AuthorLocation": "Bath England", "Title": "“No more than adequate”", "Author": "DominicBathEngland", "ReviewID": "UR115166133", "Content": "The best feature of this hotel is proximity to the superb Bibendum restaurant 2 minutes walk away .My room was quiet and the bed was decent .The bathroom was small and thin and daylight penetrated the thin blind and then the glass door so light penetrated the bedroom ( at 4am when I stayed). The bedroom was functional but did not feel luxurious. At breakfast there was no weetabix or yakult and the eating area was inadequate . I had to sit on a high stool on a small table sharing with 3 other people . The staff were lovely but the arrangement of the space was ludicrous.", "Date": "July 8, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Hong Kong, China", "Title": "“We loved it and we'll be back!”", "Author": "Kracht8", "ReviewID": "UR115089394", "Content": "This was my second solo trip, the first was in June 2011 and we had a family of three members in March 2011, The service is always friendly (I feel as if I'm coming home); every request is quickly and efficiently carried out; service is with a smile (even a late-night snack is beautifully and speedily delivered to my room); nothing is too difficult to arrange (even a late Sunday breakfast for children); the rooms are spick and span and cleaned as soon as I leave the room; the bed linen/bedding is very fine and comfortable; and, the location is just great - within walking distance to shops and restaurants on King's Road/Fulham Road and Knightsbridge! I have already recommended myhotel Chelsea to many friends!", "Date": "July 6, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "4", "Service": "5"}, "AuthorLocation": "Melbourne, Australia", "Title": "“I hope to visit London again, and certainly this hotel”", "Author": "Faye47_11", "ReviewID": "UR111829195", "Content": "I would certainly recommend this hotel. The staff, food, service and location were great. My room was a superior one, whereas my friend stayed in a single room [this was very small]. Mine was really great. The conservatorium was terrific. You could sit in there all day, using the free computers, watching TV or DVDs, reading, dozing off, having coffee. The staff were extremely helpful, ready with maps to help you get around and to recommend methods of transport or somewhere to eat. I also stayed for one night in the Red room, which was OK, smaller and a bit dark. Also light and a little noise form outside during the night. The other one one level 3 had a great view, was quiet and was just wonderful. The restaurant was open all the time, and the food was good. The service there was helpful, friendly and the best I experienced in Europe.", "Date": "June 6, 2011"}, {"Ratings": {"Cleanliness": "2", "Sleep Quality": "1", "Overall": "2.0", "Value": "2", "Service": "1"}, "AuthorLocation": "new york", "Title": "“Hard beds, thin walls, no ammenities. Not recommended.”", "Author": "abbygailnyc", "ReviewID": "UR111563949", "Content": "myHotel Chelsea was convenience to where I wanted to be and was the only hotel I could find with availability during the flower show. But I quickly saw why - the beds were hard, the sheets were scratchy and they had \"closed\" their gym even tho it was still listed on their website.", "Date": "June 5, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "2", "Sleep Quality": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "uk", "Title": "“good hotel near the flower show”", "Author": "jools2058 Posted by an OctopusTravel traveler", "ReviewID": "UR110574834", "Content": "First room we were shown had a very small bed and was tiny, having requested a twin we were eventually moved to a much nicer room with large bed more space and good views. Continental breakfast was very good", "Date": "May 30, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "United Kingdom", "Title": "“Very good hotel in central London”", "Author": "J10", "ReviewID": "UR110359649", "Content": "My wife and I just spent a long weekend in Myhotel Chelsea and we both really liked it. The place is a bit girlish in the decor, but the staff was nice and the location excellent. The rooms are smallish but clean. Breakfast was good. There was a large selection of savoury and sweet stuff. All in all, we liked the place and we are definitely going back some day.", "Date": "May 29, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Boston, Massachusetts", "Title": "“A gem in a very desirable location”", "Author": "KevinMahony46", "ReviewID": "UR99495385", "Content": "When traveling to London, we used to stay in Mayfair but decided to try another locale as Mayfair is too congested. We discovered My Hotel Chelsea and found it to be nearly perfect. It is in a very convenient location near Fulham Rd. and Kings Rd. and yet very quiet because of the residential neighborhood. The room was spacious, comfortable and very clean. Oh, and did I mention, reasonable. Perhaps the best asset of this hotel is the staff. Everyone we encountered was so friendly and so accommodating. We will definitely make this our new home for our frequent London visits.", "Date": "March 9, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Leeds, United Kingdom", "Title": "“one of the best”", "Author": "minky4", "ReviewID": "UR92640398", "Content": "Myself and my partner stayed over the festive period and I have to say that this is one of the best Hotels I have ever stayed at. Having reading numerous positive reviews, I decided to take my partner away for a special treat before Christmas. As soon as we walked through the doors, we knew this was something speacial. We were greeted by 2 friendly reception staff who took time out to ask us about our journey and if they could help with any reccomendations. We decided that the 'mybar' area where they serve food and A-Mazing cocktails would be where we settled in for the evening. We had a delicious 3 course meal, served by the lovely Sofia and we stayed there for most of the evening. Once it was time to retire, it didn't take us long to fall asleep on the big comfortable bed. The room itself was very clean and spacious and I have to say that the level of cleanliness throughout the Hotel was top notch. We opted for the continental breakfast, which had an array of choice and sadly when it was time to leave, we were made to feel that the staff were just as sad to see us leave as we were. We will definitely be back!", "Date": "January 12, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "2", "Overall": "1.0", "Value": "3", "Sleep Quality": "2", "Rooms": "1", "Location": "3"}, "AuthorLocation": "Nottingham, United Kingdom", "Title": "“Worst place ever”", "Author": "bestperson_10", "ReviewID": "UR90787925", "Content": "My Stay at myhotel chelsea is one I would never do again, the staff were accomodating and freindly however the breakfast was very small and not alot of choice and it took forever just to get toast!! I was staying on the 2nd floor and the noise level was terrible the house cleaning service kept waking me up even though I had put the \"do not disturb\" sign up and the cleanliness of the hotel in general was appauling whoever the operations manger is should pay more attention to detail. I would not refer anyone to this hotel not even my worst enemy the reception staff were ok but were very rude and they never explained the rates system and the cost was £120.00 more I paid but it wasnt worth it and the food was terrible the bar was cold and uninviting the staff made no effort to make conversation with me at all so this hotel is terrible I wouldnt reccomend this hotel to anyone try somewhere anywhere different", "Date": "December 27, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "4", "Overall": "1.0", "Value": "1", "Sleep Quality": "3", "Rooms": "3", "Location": "3"}, "AuthorLocation": "London, United Kingdom", "Title": "“just amazing.”", "Author": "ventus__10", "ReviewID": "UR90203508", "Content": "I just booked it an hour before going to hotel as i missed my flight due to extreme snow in london. When i got there the booking wasn't gone through for a while and the lady chraged me 80 pounds more than what i booked for through the web. I would understand that if she told me when i was booking the room, but i only realized that they charged 80 pounds more when i received my recipt when i was checking out. Also the breakfast was tiny and had virtually nothing to eat not to mention that they didnt know that i booked the room with breakfast included. the worst hotel i've been in.", "Date": "December 19, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Boston, Massachusetts", "Title": "“Loved the service and non-touristy location”", "Author": "BostonFlamingo", "ReviewID": "UR86969395", "Content": "This hotel surpassed all of my expectations for service. They helpfully signed for concert tickets delivered on my behalf, opened the hotel bar up just for me late one evening, and cheerfully kept my reusable ice packs in the chef's freezer downstairs. The rooms are larger and more pleasant than many traditional London hotels at a more reasonable price. What's more, the hotel has its own spa. And even though it's within walking distance of the South Kensington underground station and museum row, it lacks the frenetic pace of the overcrowded and touristy Knightsbridge area. Many good restaurants, such as P.J.'s Pub and Grille, are within walking distance. The only downside is that the wi-fi password changed every day; apparently they were having some unusual network problems. But overall, five stars for value, comfort, location and service. I'll be back!", "Date": "November 13, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "London", "Title": "“Beautiful and Pleasant”", "Author": "AFA86", "ReviewID": "UR86185707", "Content": "I had a fantastic experience, the hotel is located in a quiet residential area. A lot of wonderful restaurants and cafes can be found close by. The hotel is truly in the heart of Chelsea. I highly recommend this hotel for both business and leisure travelers. I stayed in their \"Single\" room, which I must say was very spacious! I will definately stay there again and I am planning to sometime in February next year.", "Date": "November 6, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "dublin", "Title": "“Small, stylish hotel in Chelsea.”", "Author": "Rog1Dublin", "ReviewID": "UR86028901", "Content": "Spent 3 enjoyable days here recently. Decided to try a smaller hotel rather than the larger and less personable hotels in central london. Myhotel Chelsea is about a 10 minute walk from South Kensington tube station. The area is very pleasant and has a nice trendy feel about it. The rooms are a reasonable size by London standards while they have some larger suites available at an extra cost. Overall we enjoyed our stay and would certainly recommend it. The staff were very friendly and helpful. Continental breakfast was excellent with a wide range of food. English breakfast is available at a small extra cost. The breakfast area which also serves as the bar is small enought so you may have to wait a bit for a table if its busy. The rooms are spotless and very stylish, while there is a lovely guest room with free internet access and complimentary bottles of chilled mineral water. A free and easy to use safe is standard in all rooms. We look foward to returning soon to this very pleasant hotel and rate it highly.", "Date": "November 5, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "NYC", "Title": "“Comfortable and charming hotel”", "Author": "Sarkybird", "ReviewID": "UR82529245", "Content": "the staff were very friendly and the room was surprisingly large. It was clean, comfortable, updated and cozy. As with most rooms I've stayed in in London, the walls were thin and you could hear the other guests. Thankfully they were pretty considerate! I arrived in a downpour and went the wrong way out of the tube station so it took me longer to find than it should have but when I arrived the staff were lovely and I was able to check in 3 hours early. Everything was pristine. Highly recommend!", "Date": "October 7, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Porto, Portugal", "Title": "“Excellent location, good service and client focused”", "Author": "Miguel14600", "ReviewID": "UR76437669", "Content": "I spent the last weekend at Myhotel Chelsea and I left with a very good impression of it all: the Hotel is located near the heart of Chelsea and South Kensington; the staff is very attentive and is there to solve all the clients problems and the quality of the beds should be pointed out. I will return to Myhotel Chelsea everytime i will have to stay on this side of London.", "Date": "August 23, 2010"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "London, United Kingdom", "Title": "“Friendly, lovely little hotel”", "Author": "duckathome", "ReviewID": "UR72550941", "Content": "The staff can't do enough. Rooms good for this side of London, very comfy beds, with really good duvets and pillows. Eco-aware, with wireless available. Nice, quiet spot. Great value. Lovely.", "Date": "July 27, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "3", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Sao Paulo, SP", "Title": "“Best localization in Chelsea area. Cozy and friendly.”", "Author": "VERA1961", "ReviewID": "UR71701886", "Content": "I have just stayed for 10 days in MY HOTEL CHELSEA with my 17 years old daughter. We were looking for something well localized in Chelsea area , near subway station, charming, small , friendly. The hotel fullfilled all our expectations . The staff is kind and helpful. We felt at home since the first minute . We arrived at 9 a.m. in the morning, after a 13 hours flight from Brazil . The room was not ready and they offered the SPA area to have a shower and feel more fresh to go around the city until 3 p.m. , when we could enter the room. The Superior Room had enough space for the two of us getting around, the 2 queen size beds were just OK. The bathroom was nice also. The room ´s window was towards the main entrance Street , which was a little bit noisy. We recomend and would come back to this hotel next time in town. Vera and Stephanie from Brazil.", "Date": "July 20, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "5", "Overall": "1.0", "Value": "1", "Location": "3", "Rooms": "1"}, "AuthorLocation": "", "Title": "“Epitome of form over function”", "Author": "Guido42", "ReviewID": "UR70946927", "Content": "Booked a Superior Room, and until I came here and read the reviews, was certain I hadn't received one. The \"King\" bed was wide enough for two people, but not much more. The room itself (room 1) was awful. The decor is a take on Chinese red and black lacquer, which was fine, but the bed was not more than a low-pallet with a thin, hard mattress. The end tables had decorative light boxes, so you couldn't read in bed without the overhead light on. As mentioned in other reviews, there are few TV channels and a majority are sports. The closet had 3 cubby-holes and a half-width rod for hanging things. We left the bulk of our items in suitcases for the week. The toilet took 3 or more flushes to actually work. The free internet was good, but you receive a password that is good for a single device. My partner used it for his iPhone, leaving me unable to connect my iPhone or laptop. When I contacted the front desk, the process for getting an additional password seemed to hassle them. In addition, the new password was only good for 24 hours, so every night, I would have to call again and go through the same routine to get it back. On the final afternoon, I asked for it to be reset then so it wouldn’t go out that night. Also, I wanted 3 passwords, so we could get everything connected and up-to-date before leaving for the airport. The desk clerks response was “Three? That’s a lot.” Then she asked if it had to be right then or if I could come back later. I said later was fine, and they were, in fact, available upon our return, also she did still seem really put out and somewhat confused as to why I needed that many connections. The shade in the bathroom was thin, and at night people on the street could you out in the shower. The shower was an odd affair, a tub that was tear-drop shaped with a glass shower door that only ran half the length of the tub. Even being careful and huddling underneath the sprayer, you still got water on the floor, wall, and the window shade. The staff in general seemed confused about everything. When I asked if there was a launderette in the neighborhood, they had to call me back. They called back to tell me that Google maps didn't show any. On my own investigation, I found one within a few minutes walk. Also mentioned in previous reviews, this hotel is located near little. The South Kensington tube station is a 1/2-mile walk. Taxis are easily caught at the hotel, however, which was good. Being an American, I asked for some ice for the room. The desk clerk led me into the closed-for-the-night bar and asked \"Do you want it in a glass?\" I had been thinking a small bucket, but just said \"yes, please\" to move things along. We went to the bar during the afternoon one day and I ordered a drink off what looked to be the \"smoothie\" portion of the drink menu, only to be told that they didn't have any of the ingredients for any of the fruit / berry drinks. I then ordered a Side Car of the cocktail portion of the menu. A while later, someone came to our table with a snifter of cognac. I said, no, I had ordered a Side Car. She was confused by this, so I pointed to the actual item on the menu. Eventually it arrived, and was tasty, but not worth the wait and effort. Our \"Superior\" room, backed on the kitchen, and was just outside the bin storage. So each morning we enjoyed the smells of breakfast being prepared, along with the associated banging and clanging of the preparation, and on one day we got to enjoy the early-morning trash collection noise. Overall, it was a miserable hotel, with a woefully under-skilled staff. At checkout, I was asked if I'd had anything from the mini-bar. I said, yes, I'd had a diet Coke. The woman told me that it showed that I'd had a bottle of water. I said it had been a diet Coke, but if she wanted to charge me the 1 pound less for the water, that was fine with me. The bill settled, she asked, \"When will you be coming back?\" To which I replied, \"It won't be for a long time.\" I thought it too rude to tell her \"never\" outright.", "Date": "July 14, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Zurich, Switzerland", "Title": "“A rare bird in London - a hotel that doesn't disappoint”", "Author": "Cosmo_Felani", "ReviewID": "UR67330363", "Content": "Hotels are so expensive in London, and few deliver the quality that the same money would get in a different city or country. So it's hard not to feel let down. MyHotel Chelsea is a welcome exception. It's not cheap but I've stayed there twice without disappointments. The reception staff is friendly and efficient. The rooms are clean and well maintained. It's a quiet location and close to many attractions. The continental breakfast is excellent (not included in the room price). I would recommend it, especially to the jaded who may have given up on London hotels.", "Date": "June 13, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "4"}, "AuthorLocation": "brighton", "Title": "“perfect location,very friendly staff, great hotel.”", "Author": "BrightonTapdancer Posted by an OctopusTravel traveler", "ReviewID": "UR52348797", "Content": "We stayed here for 2 nights after our visit to Chelsea football club. Great location for getting around 5 mins walk to South Kensington tube on the district, circle and picadilly line. The hotel has very friendly genuine staff, is beautifully decorated and very quiet - a real find.", "Date": "January 2, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "1", "Location": "3", "Rooms": "2"}, "AuthorLocation": "Illinois", "Title": "“Overpriced and needs upgrades but nice staff and decent location”", "Author": "samroads", "ReviewID": "UR52104470", "Content": "I will start with the positive. The staff are very friendly and try to be as helpful as they can. If you want to stay in South Kensington ( a Posh area where there are good museums and shopping..) then its a good location and close by the South Kensington Tube station. The hotel has a common area where you can use the internet and make yourself tea and there is a very limited selection of DVD's you can rent during your stay. But overall this area is nice with comfortable couches and books and magazines to browse. And the small dining area is cute with a fireplace and nice size patio for when its warmer. The Classic Rooms are very small and only acceptable for 1 person comfortably but the Superior rooms are a good size with a decent size bathroom, closet and a desk area. I don't know if this is vital to my review, but the hotel smells very nice with candles burning and free cookies or mince pies available in the lobby, which is a nice touch. The negative- This is my third stay at MyHotel Chelsea and I used to stay here b/c it was close to where I used to live but on this last time I was very disappointed. First of all for the price per night (which can be $300 plus USD) it is not that nice. The rooms need to be renovated and the lobby is showing signs of wear (that red carpet on the floor is gross and needs to be replaced). The sheets on the bed were rough and not soft at all. The desperately need to upgrade to higher thread count sheets. Overall the bed was very uncomfortable. The t.v. is fine, size wise, but there is no cable, which I think is ridiculous. For what you pay the hotel should have cable. And most of our channels were unclear and we constantly had to fiddle with the cords or call for assistance. Since there are no movie channels or a channel to buy movies we were forced to use the hotels DVD collection (which has about 20 DVD's to choose from) including a Mary Kate and Ashley Olson movie, 'Glitter' with Mariah Carey (yes that movie) and other horribly bad movies. If you don't offer cable or a Movie Channel, the hotel should really improve their DVD collection. I had pretty bad jet lag so I couldn't sleep that well at night and after reading some it would have been nice to watch a good movie. I think I would prefer to stay in the East End next time b/c everything in the South Kensington area is so expensive and closes early. And although I appreciate the hotels attempts at a 'Green' environment, the shower gel/shampoo products were a mess. They are in these black paper-like packages and when you used them in the shower black wet paper got all over you. I am all about saving Bee's (that what their products 'cause' was) but I don't want wet black paper all over me when I shower. And the towels need to be replaced badly. They had ripped strings of cloth hanging from them and were not soft. Although the robe in the bathroom was nice and much appreciated. The common area was closed for two days during our stay (b/c of a conference, which I thought was strange b/c the hotel seems like the opposite of corporate) which was a bit annoying b/c we couldn't use the hotels computers or get in the common area during these times. Overall this hotel is in a good location (if you want to stay near the Chelsea area and be near to a Tube station) but the hotel needs an upgrade most notably in their linens, towels, and mattress. The hotel is overpriced, in my opinion, for what you get. If you do stay here ask for a higher level room away from the road, which can be quite noisy.", "Date": "December 29, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "3", "Location": "4", "Rooms": "3"}, "AuthorLocation": "Belgium", "Title": "“Nice hotel in a quiet yet central area”", "Author": "AntwerpTraveller", "ReviewID": "UR50268722", "Content": "At 199 including breakfast, a good rate for that area, for a large room. Great beds. Bathroom had only a shower, with not very good water pressure. Breakfast is nice, service is friendly. The area is quiet and residential, yet only a few minutes from South Kensington tube. The area has a bit of a village feel, with local shops on Chelsea Green.", "Date": "November 29, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "4.0", "Value": "3", "Location": "2", "Rooms": "4"}, "AuthorLocation": "US of A", "Title": "“Quiet part of this city - but not such a bad thing”", "Author": "djjuniorUSofA", "ReviewID": "UR49848947", "Content": "Expensive - but London is. Not a bad location as is very quite and you feel like you can really chill after a days sightsieng", "Date": "November 22, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Location": "4", "Rooms": "4"}, "AuthorLocation": "Berne", "Title": "“One of the best boutique hotels I stayed in for a long time!”", "Author": "bscyb", "ReviewID": "UR45999555", "Content": "The myhotel at Chelsea was a great experience. The room was very neat and clean and had all the necessary equipment. The staff was very polite and helpful and there is a nice bar or reading room as well as meeting facilities. The breakfast buffet was very nice and the food good.", "Date": "October 6, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "2", "Location": "4", "Rooms": "3"}, "AuthorLocation": "Surrey", "Title": "“Tired”", "Author": "SurreyMac", "ReviewID": "UR45186012", "Content": "I have stayed at this hotel for the past 10 years, when being a boutique hotel was sexy and unusual. If you have stayed over a long period you can see the signs of tiredness. Carpet is becoming threadbare, shower doors are loose or jamming. The bar doubles as the breakfast room and therefore is neither one thing or the other. I used to love this hotel, but now there are many better boutique hotels, fresher and cheaper, £144 room only, for a really small room with no view and a hefty charge for breakfast is no bargain. Badly needs a facelift, location alone won't do it.", "Date": "September 28, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Glasgow", "Title": "“Perfect boutique hotel”", "Author": "GlasgowDoc", "ReviewID": "UR38834754", "Content": "We stayed here for two nights and were extremely pleased we chose this hotel to stay. The room was huge, with an enormous double bed. The hotel is very modestly decorated and relaxing. Breakfast was nice, with lovely sofas to relax with a coffee or glass or wine. The staff were extremely helpful and very pleasant. The location is in a beautiful part of London, easily accessible by tube. I would go back here in an instant.", "Date": "August 26, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "3", "Location": "4", "Rooms": "4"}, "AuthorLocation": "midlands", "Title": "“Very apologetic for minor failings!”", "Author": "karenlf", "ReviewID": "UR37840319", "Content": "This is a lovely location, though it's quite a walk from the nearest tube if you have luggage so would recommend you take a taxi. It's lovely and peaceful, even in the height of summer, yet it's walking distance to Harrods and Westminster. The V and A and Natural History Museum are even nearer. On arrival the staff couldn't find our booking, so we were sent to have a glass of wone in the bar. When they did find the booking, we were upgraded, which was a wonderful surprise. As a consequence, our room was spacious, with a bath, and shower over. My only TEENSY quibble is that you would expect more milk and some biscuits on the hospitality tray. Otherwise everything is as you would expect for a boutique hotel, though I think the attitude of the staff here is wonderful - unobtrusive, yet they really try to take care of you. The bar is, as someone else has mentioned, very 'Sex and the City'. We had to wait quite a while for our food, and when it arrived it was cold! However, they dealt with this really quickly when we pointed it out, and didn't charge us for our coffee and dessert as recompense. It was explained that the chef was 'confused'. We were more than happy with this, so it was a surprise to get a letter from the catering manager when we got home, offering us a complimentary main course and glass of wine on our next visit! The next morning the chef was still confused, and so our mixed toast was just white. Again, this was sorted almost immediately - but it did put me in mind of the soused chef in 'Fawlty Towers'! That morning was the only time we made it down in time for breakfast, but it was a wonderful selection - no need to have the full English because the continental is more than sufficient. On the whole I loved this hotel - we had a really lovely stay, and it was a beautiful oasis from the tourist hustle and bustle.", "Date": "August 16, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "2", "Location": "3", "Rooms": "4"}, "AuthorLocation": "Paris", "Title": "“Nice, cosy boutique Hotel in a (too?) quiet neighbourhood”", "Author": "euclyde", "ReviewID": "UR36164920", "Content": "We stayed a week-end at MyHotel Chelsea, a nice, cosy, and romantic hotel located in the quiet, upper-class, neighbourhood of Chelsea, a bit far away from the main attractions of the city. The hotel looks quiet and clean. Design is modern and a bit girly (\"sex and the city\" style). We had lunch in the pink restaurant room, where breakfast is served as well, and it was not first rate, just normal, but breakfast was abundant and tasty. We stayed in a junior suite with a very comfortable bed (and great pillows!!) and a small \"living room\" equipped with a leather sofa and a LCD flat screen TV and DVD player. The bathroom was not very large, but was wery well maintained and very clean. Service was helpful and polite. We spent a nice and romantic WE there, but normal rates may be a bit over-priced given the standing of the hotel. I would recommend to chase special week-end rates for those who want value for money.", "Date": "July 29, 2009"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Overall": "3.0", "Value": "2", "Location": "4", "Rooms": "3"}, "AuthorLocation": "Brighton, United Kingdom", "Title": "“Great location, but poor service and hotel too small”", "Author": "Deedidds", "ReviewID": "UR34003982", "Content": "Stayed over the first weekend in July 2009 to celebrate mine and some friends birthdays. Location wise the hotel is spot on. Very close to the Kings Road and Fulham Road for shopping, plus a splatter of decent pubs/bars in the local areas. Also walking distance to the main museums located near Hyde Park. On first impressesions the hotel comes across well. Its well presented and a nice chilled atmosphere when you walk in. The room we had was nice (room one on the ground floor), well decorated/clean and quite funky. Bathroom was clean and the shower was awesome. But a few things: 1 - the noise! as the room is so close to the street and back of the hotel. there was alot of noise in the morning with deliveries/people chatting etc. so couldnt lay in. 2 - the smell, after brekkie noticed a really bacony smell in the room.not nice 3 - too much light - the blinds/curtains worked well and blocked the light out. but light came streaming in under the main door and through the bathroom door (see below) 4 - bathroom privacy. Firsty the door between the bathroom and main room only has a flimsy net curtain on it. so its possible to see thru. Plus the blind to the outside wasnt too think either! not impressed So thats the room... Now the bar/restuarant! After getting back to the hotel around 1am, it was alot of hassle to get a drink. The night manager let us in and we was told we had to wait 10 mins to get a drink. After careful discussion the night manager did it himself (was a nice chap actually - so thanks), but seemed alot of hassle. The bar is also the main restuarant! so when going down for breakfast it was full up and we had to stand around for 15 mins to wait for a table. Dont expect this in such an expensive hotel. The breakfast was pretty average and alot of hassle getting served. The waitresses where lovely and very friendly, but there wasnt enough of them so the service was overally poor. 2-3 of them had to service breakfast inc making coffees etc and this wasnt enough. Felt sorry for them as they tried hard, but the management team need to address this. The breakfast wasnt anything special and they didnt give me the tommy sauce I asked for! So overall - the hotel was ok, we had an industry discount so only cost around 130 for the night, if I was paying fully I wouldnt have been very happy. It was too small and you wouldnt want to spend much time within the hotel (not outside area apart from a tiny balcony with 4 tables!). So look elsewhere", "Date": "July 6, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Norfolk", "Title": "“perfect stay for a romantic get away!”", "Author": "Lil_Lady81", "ReviewID": "UR33793366", "Content": "My boyfriend and I just wanted somewhere a bit more luxurious to stay for our mini break to London and what can i say, Myhotel was the perfect place! We arrived earlier than the 2pm check in time, just wanting to leave our bags but our room was ready so we were able to check in which was a bonus. The staff were very professional but friendly and chatty, letting us know if there was anything they could do to make our stay more special or comfortable we only had to ask. The room was immacuate & very spacious. We booked the superior double and it was perfect. I was in heaven as a bit of a girly girl (think Sex and the City...you could imagine Carrie Bradshaw staying there!!!). The housekeeping standards are clearly very high and I am a bit of a stickler for cleanliness, so i was also very happy there! The air conditioning was also a god send as it was the hottest couple of days London had seen this year! I would definately got back and stay there, hopefully sooner rather than later as i feel i need to try out some of the Spa treatments!!! Yes it was expensive but i feel it was well worth every penny!", "Date": "July 3, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "4", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "FRANCES", "Title": "“Best Kept Secret In Town”", "Author": "TRENDTRAVELLER", "ReviewID": "UR23542602", "Content": "As I have been living in London during few years and since I am travelling every Six Months to the city, I think I knew merely all the good hotels where to stay. What a Surprise, Secretly Hidden in the Middle of South Kensington & Chelsea, in the best area of London with all the best bar such as eclipse and fine dining such as the bibendum, My Hotel Chelsea is really a Hit. A good mix with quiet rooms where to relax and a cosy and trendy bar with the perfect fireplace for a romantic moment. I deeply recommand it since I loved it ! Can wait to go back, i did even try the Spa !!!", "Date": "January 14, 2009"}, {"Ratings": {"Service": "2", "Cleanliness": "2", "Check in / front desk": "3", "Overall": "3.0", "Value": "2", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Chester, United Kingdom", "Title": "“Beautiful Hotel shame about the leftovers”", "Author": "hurricaneSam", "ReviewID": "UR23532590", "Content": "Beautiful hotel in Chelsea, very nice but small room.. very comfortable bed.. We stayed at the hotel on New Years Eve...unfortunately after undoing the soap to wash my hands on arriving to the room .. no 13.. unlucky for some ?? I attempted to put the wrapper in the bin & was met by the contents of the bin... clearly labelled Durex ... whilst i am an adult & know that sex happens everywhere.. it was rather 'in your face' ... I mentioned it at reception on our way out.... came back in a couple of hours later, the bin was empty. my partner opened the door beliving there was somebody knocking on it , to find a masseusse calling at the next room ??. went out again.. came back in admittedly rather late... We were then woken in the early hours by rather noisy sex in the room above... On checking out the duty manager came to see me & apologised for the bin contents & said that next time we stay, we would get a complimentary upgrade.. dont think we will be going back too soon.. the hotel would have got an above average score but for this...", "Date": "January 13, 2009"}, {"Ratings": {"Service": "1", "Cleanliness": "4", "Business service (e.g., internet access)": "3", "Check in / front desk": "3", "Overall": "1.0", "Value": "1", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Cardiff", "Title": "“Very disappointing”", "Author": "selby602", "ReviewID": "UR21604392", "Content": "Stayed for one night, 25th October 2008. Lovely hotel, terrible service. In particular:- Was provided with an iron with power cord so worn the metal was showing through at the handle. Room (no.8) was very hot - despite air conditioning on full blast, had to sleep with the window fully open (in October!). Ordered room service sandwiches - took 55 minutes, sandwiches arrived open (suppossed to be toasted), bagel arrived without cream cheese. At private function, requested drinks three times - each time order was delivered incorrectly and the staff did not write down the orders. The bill was then charged to a random member of the party, with a service charge! It felt like the hotel had opened with good intentions, but corners were being cut, particularly with training - although the majority were very friendly and willing to help, they appeared underskilled for the roles they were performing. Also, I was not the only one in my party who experienced these problems. Very, very disappointed.", "Date": "November 6, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "4", "Overall": "4.0", "Value": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Sydney", "Title": "“Thumbs up!”", "Author": "The_Sydney_Wanderer", "ReviewID": "UR17613398", "Content": "Absolutely fantastic hotel in all regard! The rooms were superb, the service attentive and hospitable, location perfect ... all round excellent stay and would most definately recommend to anyone who is travelling to London. Would I return? Yes, yes, yes!!!", "Date": "July 7, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Dublin, Ireland", "Title": "“Little Gem in the heart of Chelsea”", "Author": "Lau83Ireland", "ReviewID": "UR13094140", "Content": "I stayed at myhotel chelsea for the weekend with my boyfriend and we both adored the hotel. Everything from the rooms to the bar to the staff were lovely. Its a really relaxed hotel and only a 5 min walk from South Kensington Tube Station or 15 min walk from Harrods. Our room was spacious and the bed was so comfy. Breakfast was delish and so were the cocktails!!!! I will definitely be going back and am recommending it to all my friends. Massages are meant to be legendary so I will have to have one on my next trip!!", "Date": "January 29, 2008"}, {"Ratings": {"Service": "1", "Cleanliness": "4", "Business service (e.g., internet access)": "3", "Check in / front desk": "2", "Overall": "2.0", "Value": "2", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Spain", "Title": "“Way over promises, So under delivers.”", "Author": "sengir", "ReviewID": "UR11503341", "Content": "I stayed here from Sunday 9th December for 2 nights. The hotel is ideally situated in a quiet area off Sloane Ave, near to some of Londons best shops and restuarants in the more genteel borough of Chelsea. This is great if you dont want the bustle of the west end. However, the hotel lacks a great deal when it comes to service. Firstly, checking in was a process that involved a 20 minute wait in reception for no apparent reason being greeted by every member of staff which is of course nice but no one actually getting around to giving me the key to the room, not so nice. Secondly, I had been in touch with the 'concierge' via email to arrange a car and driver for the evening which I had been assured in writing was booked but suprise suprise the Hotel had no record of this. I ordered some food from room service also which by my standards (and I have stayed in lots of hotels) was well below average, I have had better tasting Pret a Manger sandwiches. I mistakenly asked the concierge to book me a table at Toms Kitchen for Lunch and when we arrived the they had no record of my booking. Thank god for the very accomadating Maitre d who took pity on us and found us a table in a fully booked restuarant. (Toms Kitchen btw is Marvelous, the food and the service are immaculate and resonable too!) On the morning of check out, well before the 12pm checkout time housekeeping knocked on the door a record 4 times and then an over enthusiastic member of staff wandered in, letting herself in and without knocking. Needless to say, I was NOT amused. The final indignation occured as my Boyfriend struggled with our very heavy bags down the front steps to a taxi without an offer of help from the assembled staff. In conclusion MyHotel Chelsea is OK, it has a great SW3 location, Aveda toiletries and Sky TV and as long you need treat it as you would a travel lodge and pretend the hotel offers nothing more than a bed and a few extra scatter cushions you'll enjoy it just fine, but as far as service is concerned, the Four Seasons it aint!!!", "Date": "December 12, 2007"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Business service (e.g., internet access)": "2", "Check in / front desk": "4", "Overall": "3.0", "Value": "3", "Rooms": "5", "Location": "5"}, "AuthorLocation": "NY", "Title": "“Good - could be better”", "Author": "mooshai", "ReviewID": "UR10053634", "Content": "Stayed here the first week of October for 2 nights since I had meetings at an office only a few blocks away. Can't beat the location - 5-10 min. walk from two tube stations, great neighborhood, good sized rooms, and nice looking place overall. Now the down side: - Seems like the entire staff is in training - no feeling of confidence in the quality of service. - the hotel is too small to support a \"bar\" or any sort of night life after your evening meetings and dinner. Case in point: I returned around 10;30 pm hoping for a cocktail before bed. Asked the bar tender for 3 relatively simply drinks (whiskey sour, martini, or scotch american) - he couldn't make any of them. At the end of the day, the hotel is too British to be truly modern international, and trying too hard to be like the \"W\" or City Inn chains to be considered British. I might go back, only if the location works out well, but if my meetings are in the West End or the City, I will definitely stay elsewhere.", "Date": "October 8, 2007"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Business service (e.g., internet access)": "4", "Check in / front desk": "3", "Overall": "3.0", "Value": "3", "Rooms": "3", "Location": "5"}, "AuthorLocation": "London", "Title": "“Nothing special”", "Author": "ramo", "ReviewID": "UR8503769", "Content": "In my quest to find my favorite Chelsea hotel,I booked into myhotel after viewing a room on a previous visit to London. For nearly £300 a night for a large room/suite, the size was very good. However the decor is dated and the colours depressing. The furniture is also dated and the lights barely work. Service was barely adequate and bordering on the unfriendly. Breakfast was very good although nothing is served prior to 7am (difficult for those early City meetings). Needless to say the location is ideal for all local Knightsbridge/Chelsea attractions with many restaurants nearby (check out Tom's Kitchen on Cale Street). Overall nothing special so the quest continues for the perfect Chelsea hotel (I try and avoid the usual 5 star hotels such as Sheraton, Hilton, etc.). Will only stay there again if on company expense and lack of other accomodation.", "Date": "August 25, 2007"}, {"Ratings": {"Service": "2", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "2", "Overall": "4.0", "Value": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Dublin, Ireland", "Title": "“Generally great, but its the little things that make the difference...”", "Author": "prada123", "ReviewID": "UR7740451", "Content": "I stayed in this hotel on a sunny May weekend and loved my trip. Generally, the staff seemed eager to impress. However, on arrival the reception desk was deserted, and I had to alert the staff to my presence by sticking my head around the back office door. Bad start. The gentleman who checked me in was helpful enough but seemed unable to smile and wasn't particularly friendly, nor did he apologise even once for his initial absence. The hotel itself is virtually perfect, in size (this is London), decor and facilities. It is just small enough to be boutique, yet not so small it is pokey- a happy medium. Location is brilliant- Chelsea is a lovely area, and the hotel is convenient for South Kensington tube; which is the main thing for both tourists and business travellers to London. The atmosphere in the hotel makes it a wonderful haven in busy London and a brilliant base for one’s travels- perfectly relaxing. On arrival I found some complimentary fruit in my room, which was a nice touch. A disappointment came that evening when I requested an ironing board, and was told \"we have none left\", even after a debate about this, one took a while to come. When it did it was the traditional overused and flimsy rubbish- looked quite out of place in such a nice hotel. Using the (ancient) iron fused the electricity in the room. When I went out for dinner I left the ironing board in the room, with the empty and dirty fruit bowl atop it. When I returned the ironing board had been removed, yet the fruit bowl was carefully placed on the coffee table. It seems a small thing but returning to a dirty fruit bowl on the coffee table was a bit of a disappointment! The beautiful widescreen LCD television unfortunately didn't work throughout my stay, not that I missed it. The turndown service came around at 6pm while we were dressing for dinner, which seemed a bit wrong- we never did get this service in the end. On the whole however, the atmosphere of the hotel was wonderful and provided you don’t expect too much from the staff they were generally polite and helpful enough. The bar and communal areas have an excellent atmosphere and are truly welcoming, modern yet classic. Despite the one or two staff slip-ups, I would definitely stay at this hotel again.", "Date": "June 2, 2007"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Business service (e.g., internet access)": "5", "Check in / front desk": "4", "Overall": "2.0", "Value": "2", "Rooms": "4", "Location": "4"}, "AuthorLocation": "UK", "Title": "“Visit marred (yet again) by hotel not finding our internet booking.........”", "Author": "Weekend", "ReviewID": "UR6901675", "Content": "Arrived to find the hotel did not have our internet booking. Although it had been confirmed when booked the night before, an email was sent to say it was not confirmed to our hotmail the morning we were travelling, which we did not see as we had no access to it while on the move. The website people said they had phoned the hotel to book, which the hotel denied. However the hotel said that if they had had the call, they would have honoured the booking........who was telling the truth? All we know is we paid way more than the original booked price of £380 for 3 nights. Seems like the only winner was the hotel. Frankly, wasting an hour and a half trying to sort it out marred the whole visit, and left a bad taste. The hotel ? It's cosy and friendly and we liked the atmosphere, decor and vibe. Rooms are not that large but are a million miles away from the corporate and impersonal ones you often get. Despite the booking problem I'd stay there again if the price was right.", "Date": "March 2, 2007"}, {"Ratings": {"Overall": "2.0"}, "AuthorLocation": "Amsterdam, Netherlands", "Title": "“okay”", "Author": "Pincut", "ReviewID": "UR6856592", "Content": "I've stayed here about 15 times in the past year for work. Each time I check in, there are always different staff; most of whom appear to be reasonably clueless about London and the amenities in the vicinity of the hotel. Twice I've been downgraded to a single room, which is smaller than the room I grew up in as a child (ie - very small), with no explanation. The rooms themselves are ok; a bit 'business-instituion-ey' if you know what I mean. It's an ok hotel, but despite having stayed there so often, I don't feel any affinity for it and wouldn't choose to stay there unless it was on my company's dime.", "Date": "February 28, 2007"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Business service (e.g., internet access)": "4", "Check in / front desk": "4", "Overall": "5.0", "Value": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Hong Kong", "Title": "“myhotel a great choice, really enjoyed it”", "Author": "CCandAlbert", "ReviewID": "UR6536456", "Content": "We stayed in myhotel for 6 nights in December. The hotel was tastefully decorated. Staff were friendly and helpful. Breakfast was excellent, with fresh juice, smoothie, extremely tasty pastry, etc. We had our Xmas dinner in the hotel restaurant. We sat on a very comfy sofa, beside the fireplace. The steak was good. Atmosphere cosy and price reasonable. All in all, enjoyed it a lot. Plus, location was very convenient and neighbourhood posh and safe. You are basically 3 minutes away from Channel, Paul Smith and Ralph Lauren. All in all, a great stay for us. Tips: don't book it from hotel website. We did it via the \"Visit London\" official website. For GBP 119 per night, we got a double room with continental breakfast and VAT included. if you book it on the hotel website, same price but tax and breakfast excluded.", "Date": "January 2, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Cheshire", "Title": "“Home from Home”", "Author": "MrsSW", "ReviewID": "UR6446891", "Content": "Being a regular business traveller to London and a woman travelling on my own, at last I have found a Hotel that is a great location and has a great atmosphere in this boutique Hotel. As soon as I first found this Hotel via a Hotel website I knew that my searching around for somewhere decent to stay when I am away on business was over and believe me I`ve stayed at some awful Hotels for alot more money in London. I now stay regularly at this Hotel and can`t rate it enough. The rooms are everything you could ask for, breakfast is delightful and the library offers complimentary internet access which is great if you are away on business like I am. There is a Spa and a small gym with just a few pieces of equipment in if one needs. The colour scheme around the Hotel is great too. The staff can`t do enough for you, The beds are sooooo comfortable and at night they even leave a little muffin by the side of your bed along with your crockery. (nice touch) The bathrobes are soft and fluffy as are all the towels. The only down side is that most of the rooms only have a shower but there are a few rooms with baths if they are available. I have stayed at this Hotel now about seven or eight times and will continue to do so. A great find.", "Date": "December 15, 2006"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "4", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Surrey, England", "Title": "“Great hotel, great location.”", "Author": "MiriamG", "ReviewID": "UR6316932", "Content": "We recently spent a night at Myhotel Chelsea. The location is fantastic - right between the Fulham Road and Kings Road. Our room was great (much bigger than we expected) and had the most comfortable bed and pillows. It has a bar area and a separate library with free internet access and a collection of DVD's and CD's. The staff were very helpful. We opted for the cooked breakfast (and happily paid a £4 supplement) - but the continental breakfast looked fantastic. Would highly recommend.", "Date": "December 2, 2006"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Prague", "Title": "“A Home Away From Home”", "Author": "farandaway22", "ReviewID": "UR6313916", "Content": "This hotel is a gem. Tucked away in Chelsea, about a 10 minute walk from the S. Ken Tube station, myHotel Chelsea is great little boutique hotel in London. If you can stay here for business, good luck: it's typically booked solid during the week. We stayed there over the weekend and experienced great service, reasonably (for London)-sized rooms, great amenities and a yummy breakfast to boot. The staff, notably Cesar, was very polished and personable. They made it easy & that's what counts. Just a note though. If you have an American credit card, they did try to charge me in U.S. currency without asking first. I've noticed a number of hotels doing this now in London. Ask to be charged in GBP, otherwise the exchange rate they give you is (you guessed it) entirely in the hotel's favor.", "Date": "December 1, 2006"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Business service (e.g., internet access)": "3", "Check in / front desk": "2", "Overall": "4.0", "Value": "4", "Rooms": "5", "Location": "4"}, "AuthorLocation": "New York City", "Title": "“Quite Nice a Hotel Despite a Mix-Up”", "Author": "Fernleigh1", "ReviewID": "UR6167982", "Content": "We stayed here in July when our regular hotel was fully booked. Despite high rates in London for the period, I found a fair price on their website. We know the area well, having stayed nearby previously. Arrived late after day flight from NYC to find that no double room was available. Reception was apologetic, but said they could do nothing to correct the problem. Offered choice between 2 small singles for the evening or transfer to another hotel. We chose the former on promise of \"remedy\" in the morning. And that they did provide in the form of a junior suite. Very comfortable and quite spacious. Rooms are modern and soothingly decorated. Up-to-date with amenities, etc. We found a nearby wireless connection and avoided the usual London usury for internet access. Breakfast in the dining room had a French flair, but was actually quite good. Staff were a little spacey overall, but generally willing to accommodate. Location is ok, not far from the South Ken tube, but bus lines in this area are limited. It's a nice place, and we would return again.", "Date": "November 23, 2006"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "3", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Totnes, United Kingdom", "Title": "“This place is a haven....!!”", "Author": "Quinonostante", "ReviewID": "UR6110947", "Content": "This Hotel has something special...! An amazing attention to detail is what you will notice. My fourth floor room was a haven from a busy London. The cool jazz was I had ordered was waiting for me upon arrival into my room. The lighting was ambient, the decor was soft and I was enveloped in warmth. I sipped green tea, supplied without a request and had the most delicious fruit salad at breakfast. You cannot fail to be impressed when warm muffins are delivered to your room and the people who work there actually seem to love their job, which refelcts in every aspect of the service you receive as a guest. If you visit, try out the cocktail bar and restaurant....great! Can't recommend this place enough!!", "Date": "November 12, 2006"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "4", "Check in / front desk": "5", "Overall": "5.0", "Value": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "New York City, New York", "Title": "“Great Personal Hotel”", "Author": "Zeldon", "ReviewID": "UR5899186", "Content": "Absolutely Fantastic. Friendly & Efficient Service. They do all the little things. A great place to stay if you can find a good deal (for London). Expect the room to be small but cozy and comfortable. Great library, small gym and good continental breakfast. About 10 minutes from underground. If you're ok with the small rooms and the fact that you are not next to underground this is the type of comfortable hotel that is ideal.", "Date": "October 2, 2006"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "UK, London", "Title": "“Trendy Hotel get Full marks”", "Author": "LaGrange", "ReviewID": "UR5812844", "Content": "Trendy, up-to-the-minute, aspirational, small, cozy. Element of surprise to find this in what looks like a traditional Chelsea building on the outside. This hotel has a “wow factor”. Lasting impression: As above, particularly aspirational, plus personal. Sort of home-from-home feeling due to small size, one-off designer pieces of furniture, great décor, Great music. Interesting pictures on walls, fresh flowers, magazines/papers etc. Mix of guests seen: single business people, (male and female), young trendy couples on a date and local Chelsea chics, mix of ages, from 20s to 40s.", "Date": "September 18, 2006"}, {"Ratings": {"Cleanliness": "4", "Overall": "3.0", "Value": "3", "Service": "2", "Rooms": "4"}, "AuthorLocation": "Seattle", "Title": "“Still lovely, and still devious at checkout!”", "Author": "Seattle98101", "ReviewID": "UR5442253", "Content": "I returned to Myhotel Chelsea on another business trip and found the same positives and negatives as I experienced last year (see previous review). The hotel itself is lovely, very comfortable and well-appointed, in a great location near the South Kensington tube stop. It's not cheap, but if you can find a good deal (or your company has negotiated rates, as mine has) I would recommend it. The free Internet access is very handy. The caveat remains, as the New York traveler recently noted, they will take advantage of unwary foreign travelers at checkout. ASK TO BE CHARGED IN POUNDS! If you let them get away with converting the bill to your own currency, you will pay a very high rate, and they will not alert you to this practice. Fortunately I had warned my traveling companion about this, so when she was handed a USD charge slip at checkout she gave it back and asked them to redo in GBP. It is unfortunate that they continue to engage in such a sleazy, deceptive practice at an otherwise charming hotel.", "Date": "July 9, 2006"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "New York, NY", "Title": "“Very restful hotel”", "Author": "tereads", "ReviewID": "UR5231342", "Content": "We just got back from a week's stay at myhotel chelsea. Not having had much experience with London hotels (having always stayed at a cousin's very posh house) we weren't prepared for such a nice experience. Unlike others on this board, we found the staff to be extremely helpful and considerate when asked and unobtrusive the rest of the time, which is definitely my preference. The room was spacious compared to previous experiences (limited, admittedly) with UK hotels. At least there was room for two to move about. Very stylish, the BEST towels of any hotel Ive stayed at -- finally proper sized bath sheets at a hotel! The bed was comfortable and the amenities were good: teas, coffee, fluffy robes, nice soaps and shampoos. The meals we had from the bar were tasty and inexpensive and the lounge with free internet, comfy couches, tea, coffee, fruit and bottled water was delightful. There is a small fitness room. Celebrity bonus: Charlie Dimmock of Garden Force was staying there. The only negative was the sharp practice of having me sign my credit card slip in pounds and then (without notifying me) converting that sum to dollars at a higher rate than what my credit card company does. This was an extremely unpleasant discovery. In fact, I checked the bill thoroughly, handed over my card, signed the receipt and then the girl at reception took the customer copy (printed separately), stapled that second receipt to the bill and folded it up and put it in an envelope and sealed the envelope. So, it wasn't until I opened the envelope that I discovered the switch. I consider this a very distasteful end to an otherwise nice stay and will complain to my credit card company about it. One other warning, we tipped everyone as we were told service was not included in the food bills, but when the statement was printed out at the end of the stay, infact there were service charges added subsequently to all food charges.", "Date": "May 29, 2006"}, {"Ratings": {"Cleanliness": "1", "Overall": "2.0", "Value": "2", "Service": "1", "Rooms": "3"}, "AuthorLocation": "UK", "Title": "“Disappointing”", "Author": "Sooky", "ReviewID": "UR4975671", "Content": "We stayed at this hotel for two nights and it was fine for location, room size and decor but badly let down by indifferent service. For the rating of the hotel, the staff just weren't up to the job: they watched us struggle with bags into the hotel, appeared bored by the effort of explaining where to find our room and never seemed to care how things were. Details were neglected - there were no glasses, nor a corkscrew in the room and it took several calls to secure a ropey corkscrew and tumblers. We ordered a simple room service lunch that was slow and incorrect - over £5 for a horrid, luke warm hunk of bread with fatty ham and semi-melted cheese. The minibar wasn't refurbished and the cleaning left a lot to be desired. As we checked out, the bill was inaccurate and the staff once again unhelpful. Not at all deserving of its rating and needs a lot of work to warrant a recommendation from us. What a shame when a fantastic location and building is ruined by careless staff.", "Date": "April 15, 2006"}, {"Ratings": {"Cleanliness": "4", "Overall": "4.0", "Value": "3", "Service": "5", "Rooms": "4"}, "AuthorLocation": "Peterborough UK", "Title": "“Feng Shui in Chelsea”", "Author": "Slitsy", "ReviewID": "UR4896698", "Content": "Booked at last minute for myself and my adult daughter so opted for a twin room. Did a deal on the phone the night before arrival. Hotel reception asked what our budget was so there was room for negotiation over price at last minute and we got breakfast thrown in as well. No twin rooms on arrival so we were upgraded to a double suite with a portable divan which was a but small but my daughter said she could sleep anywhere due to tiredness from work so we stuck with it (I wouldn't have been happy on it). Hotel was a delight with a Feng Shui theme - different scents e.g. new mown grass in reception. Decor modern and attractive. Suite had a smallish bedroom and a small lounge but combination was good. Bathroom was decent with robe and slippers available. We opted for continental breakfast with plentiful range of cereals, breads, fruit cold meat, smoked salmon etc. Cooked for those who requested it. The library, accessible with room key has free internet facilities and a small fitness centre attached. 5 minute walk to underground station(sorry those who say 10, you are plainly unfit!)and the same to restaurants. Kings Rd not far away with excellent shopping. Overall quite expensive, despite the deal but lovely for a treat. We would return.", "Date": "April 4, 2006"}, {"Ratings": {"Cleanliness": "4", "Overall": "2.0", "Value": "1", "Service": "1", "Rooms": "2"}, "AuthorLocation": "Cambridge", "Title": "“too hot to sleep!!!!”", "Author": "pennyb", "ReviewID": "UR4823658", "Content": "I stay in London a great deal on business, and am always on the look out for new and interesting hotels. I had visited Myhotel Chelsea for a Christmas drinks party, and was impressed with the decor and ambience of the hotel. It is really quite pricey, but I thought I'd give it a go! Our room was so small you could bearly swing a cat - the decoration was lovely - beds nice and comfy, but I would have preferred enough room to get into the room without having to move bags around each time - than the designer accessories! There seemed to be a problem with the heating - on our first night hot air was constantly being pumped into the room - we didn't sleep! The next morning we asked if they could look at the problem, and was told on our return that it had been fixed - it hadn't!! We went to see reception again, to be told there was nothing they could do, and the hotel was fully booked so they couldn't move us to another room. Another sleepless night in a sauna! (that is honestly no joke - that is how hot it was!) When we came to check out there was no apology - no offer of any kind of compensation. It is an extremely expensive hotel - and in my opionion far too over priced - if your looking for real luxury with a first rate service I would highly recommend the Parkes Hotel in Knightsbridge - they can not do enough to make sure that your stay is as comfortable and as enjoyable as possible", "Date": "March 31, 2006"}, {"Ratings": {"Cleanliness": "5", "Overall": "4.0", "Value": "4", "Service": "3", "Rooms": "4"}, "AuthorLocation": "London", "Title": "“Lovely hotel”", "Author": "A TripAdvisor Member", "ReviewID": "UR4328425", "Content": "My boyfriend and I spent a weekend at Myhotel Chelsea. It is a very cute hotel, we loved our room (we looked around the internet and got a good deal of £99 per night, including breakfast). The bed was slightly small but very comfortable! Huge cusions, great matress and a gorgeous duvet. Very close to the shops and a walk away from Harrods. The staff were nice and the drinks in the bar were overpriced but very tasty!", "Date": "January 6, 2006"}], "HotelInfo": {"Name": "myhotel Chelsea", "HotelURL": "/ShowUserReviews-g186338-d265988-Reviews-Myhotel_Chelsea-London_England.html", "Price": "$217 - $524*", "Address": "<address class=\"addressReset\"> <span rel=\"v:address\"> <span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">35 Ixworth Place</span> | <span class=\"extended-address\">Chelsea</span>, <span class=\"locality\"><span property=\"v:locality\">London</span> <span property=\"v:postal-code\">SW3 3QX</span></span>, <span class=\"country-name\" property=\"v:country-name\">England</span> </span> </span> </address>", "HotelID": "2514430", "ImgURL": "http://media-cdn.tripadvisor.com/media/ProviderThumbnails/dirs/77/bd/77bd65cef4aca5ea94d73a19b6e005cc1large.jpg"}}