{"Reviews": [{"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Vienna, Austria", "Title": "“Great location, cute hotel”", "Author": "SandET", "ReviewID": "UR127276298", "Content": "We stayed here in March for 3 nights and enjoyed our stay. The receptionist is very friendly & helpful, WIFI is for free and works very well, the room is typicall french and nice but the bathroom is AWESOME for a three star hotel! Location is great, couldn't be better - a short and nce walk to Notre Dame, Seine and a 20 min walk to the Louvre, 45 min walk to Champs Elyssees. The area is great with plenty of bars, places to just \"hang out\" and eat! I would defin. go back there!", "Date": "April 5, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Cork, Ireland", "Title": "“Great little hotel near the Marais”", "Author": "chatelaine76", "ReviewID": "UR127148101", "Content": "I stayed at the Hotel Beaubourg recently, as part of a weekend getaway. The personnel on the front desk were lovely, as were the chambermaids. We didn't have breakfast at the hotel - it seemed a shame to do so when we were able to explore the Marais and have breakfast on the terraces of nearby cafes and watch the world go by. The room was compact - not small, as such but certainly not spacious. The bed was comfortable and it all felt quite cozy. Lots of storage space between the chest of drawers and the wardrobe. The mirror in our wardrobe had a slight crack in it. The bathroom was immaculately clean but had a low ceiling. I'm 5' 10\" so I can imagine showering being uncomfortable for anyone over 6' in height! The toiletries were a citrus-scented hair and body wash - bring your own is my advice. All in all, good value for money and a great place to base yourself if you are hanging out in the Marais.", "Date": "April 2, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "3.0", "Value": "4", "Sleep Quality": "4", "Rooms": "2", "Location": "5"}, "AuthorLocation": "Seattle", "Title": "“Hotel Beauborg Delivered”", "Author": "rarSeattle", "ReviewID": "UR126013061", "Content": "I've stayed at Hotle Beauborg numerous times over several years. i have always found the hotel met my needs i.e. clean and quiet rooms with an efficient check in and check out. This stay my room was on the 5th floor. The elevator only goes to the 4th floor so I had to carry my bags up one flight. The elevator shaft was right outside my room and everytime the elevator was in use I could hear an annoying thump as the elevator engaged. This was not a problem at night but early in the morning it was heard continually as people checked out. I would stay here again but not the room on the 5th floor. The ceiling was slanted so I could not stand up straight in the majority of the room. And I am not tall.", "Date": "March 12, 2012"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "London", "Title": "“Great little hotel”", "Author": "Footloose01", "ReviewID": "UR125308356", "Content": "Cosy traditional Paris hotel, fantastic location in the heart of the Marais, comfortable room with a recently-refurbished bathroom, quiet, friendly staff.", "Date": "February 27, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Jasper, GA", "Title": "“Good Experience”", "Author": "Randy L", "ReviewID": "UR125189697", "Content": "My wife and I spent five days in this hotel in February 2012. We were very pleased with the experience. The room was very clean. The bathroom in the room we occupied looked as if it had been recently renovated, it was very modern with a bath tub with a shower head. The hotel is very convenient to either the Hotel de Ville (1 line) Metro or a closer metro on the eleven (11) line. The hotel is extremely close to the Pompidou center so there are lots of restaurants in the area. It is very close to a couple of small grocery stores and some pastry shops. We ate breakfast in the hotel a couple of days, but found it be much less expensive to eat at the local pastry shops and I liked the pastry shop food better. Breakfast was essentially three kinds of bread. There was some cereal that looked like it had never been touched and for extra money you could get protein of some sort. We paid 130 Euros per night. There are a few homeless in the area, they were alcoholics and never appeared threatening. Later in the week we transferred to another \"modern\" hotel near the convention center for a meeting, I like the Beauborg much better because you feel like you have experienced France.", "Date": "February 25, 2012"}, {"Ratings": {"Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Cascais, Portugal", "Title": "“Nice little hotel in the Marais”", "Author": "Mica1966", "ReviewID": "UR125013934", "Content": "Very nice little hotel in the best area of Paris, rooms are very nice and toilet very nice and clean. The only remark is that the hotel has wiifi free but signal is to weak so sometimes it takes time and TV only in french!! location is great 1 minute from metro station in fornt of Pompidou center.", "Date": "February 22, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Tel Aviv, Tel Aviv, Israel", "Title": "“Clean, Fresh, Charming, QUIET plus great location!”", "Author": "Daina R", "ReviewID": "UR124715049", "Content": "As a designer, I have a discerning eye for aesthetics and this place was charming thru and thru. From the hours I spent searching there are a lot of duds out there and I'm glad I finally found and booked this one and wasn't disappointed with my choice! Friendly staff, speaks English, and great with helping you plan- I emailed back and forth several times with them on arranging the details of the stay. I had the twin double room. Room was clean, charming, and renovated bathroom with a shower and tub with great water pressure. There was plenty of space and a storage closet and we were quite comfortable and had a place for our stuff. The neighborhood is cute with lots of cafes, shops, and restaurants and very close to tourist attractions, but w/o feeling like your in a tourist only zone. We stayed in Feb and it was very cold but our room was always toasty and quiet! Comfortable beds and bedding / sheets. At breakfast they give you your personal pot of cafe ole! The breakfast is a typical light French style with french bread, croissants, butter, jam, orange juice, and coffee. There is also cereal and for a little extra you can add a egg or sausage. The wifi is a little slow at times and you have to login each time you use the wifi, but once I got the hang of the process I was able to get it working faster. Only one day it barely worked at all. You have to first make sure you are connected to the right network, then open a new browser window and wait for the right user / pass field to put in and make sure to hit the start browsing button, and not to close that window. If you close your computer, you have to do the process all over again. It was good enough to send the family photos everyday via picasa.", "Date": "February 17, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Oakland, California", "Title": "“great place, nice people”", "Author": "mandy m", "ReviewID": "UR123702341", "Content": "After searching the internet about many places to stay in Paris, I finally found Hotel Beaubourg and the reviews all seemed to be pleasant. At first I only made a reservation for the 1st half of our trip and we ended up extending the room for the entire 13 days. Rooms were cozy with more than enough space for our two suitcases. Everything was kept very clean and each staff member was super friendly and very helpful. This hotel is in an awesome neighborhood with shops, food, metro stop, and sights right there yet the room was still very quiet. I would return and I would recommend it to anyone wanting to enjoy a mellow or exciting trip.", "Date": "January 27, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Le Mans, France", "Title": "“A very pleasant stay”", "Author": "patricia m", "ReviewID": "UR123546514", "Content": "The hotel is very well situated in the heart of Paris, with public transport close by. Once you enter the hotel it is very quiet, in sharp contrast with the bustle outside. The room was very pleasant, the atmosphere refined and the bathroom comfortable. There was no noise at night. Breakfast was plentiful and was served in unusual surroundings, a really ancient stone vaulted room. The staff is pleasant and helpful. We would recommend this hotel to our friends.", "Date": "January 24, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Cleveland", "Title": "“Great stay in Paris”", "Author": "luv2travelCleveland", "ReviewID": "UR123366970", "Content": "This hotel is in a great location within walking distance to many tourist attractions including Notre Dame, the Seine River, Centre Pompidou and is close to the subway. It is also in the middle of a gay district so there are many gay bars and restaraunts within a short walking distance as well. We did get some misleading advise from the front desk. We were told the Eiffel Tower was a short walk away. It took us almost an hour to walk there by foot. Ultimately, we should have taken a river boat on the Seine River to the Eiffel Tower. We also were given wrong directions by the front desk to get to a museum and found it to be very frustrating. Fortunately, everyone we met in Paris was very friendly and helpful so we were able to find our way. Other than those two situations our stay at this hotel was great. The front desk staff were always friendly and tried to give us useful information. Our room was very quiet and surprisingly very spacious. The room was decorated with a French flair and it was kept very clean. The rooms have upholstered walls which were kind of cool. I would stay at this hotel again.", "Date": "January 20, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "3.0", "Value": "4", "Sleep Quality": "3", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Hampshire", "Title": "“fab location .. if your heading out alot.”", "Author": "pelican23", "ReviewID": "UR122832242", "Content": "My daughhter was the one who stayed and she wrote :-- I went to this hotel for my 21st birthday. I wanted it to be really special and wanted to be somewhere that was very central. I found the hotel very reasonable in price and the staff spoke very good english and were very helpful. I felt like they really looked after us. It was very clean. There were a few issues though, a few of the plugs in our room didn't work and The room was also very dark, so it didn't help that we then couldnt use all the lamps. I am used to a very hard bed but their's were extremely hard. If you are heading to Paris to see the sights and take in the lifestyle and are planning to be out a quite a bit then this hotel is a great place to crash. With metro stations and train stations with in 5 minutes walk.", "Date": "January 9, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Frankfurt, Germany", "Title": "“Great value for the location”", "Author": "wmnej", "ReviewID": "UR122239415", "Content": "Recently stayed at the Hotel Beaubourg for 4 nights in a room overlooking the back courtyard. Simple, clean room with surprisingly larger than expected bathroom. Friendly and helpful lobby staff. Number one plus was the location -- it was so central to get to everywhere we wanted to go, whether it be walking or taking Metro. I cannot comment on the breakfast as we did not partake. Wifi worked fine too, not always perfect but more than adequate. Great value for the price.", "Date": "December 29, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "London", "Title": "“Great location, helpful staff”", "Author": "DaisyandDex", "ReviewID": "UR121917823", "Content": "We stayed at the Hotel Beaubourg for two nights with another the couple. The staff was always helpful and the rooms are clean and neat. Location is really convenient, though not a picturesque street, it's right on the doorstep of the more stylish streets in the Marais and an easy walk to the Louvre and other areas of interest. The free Wifi, was an added bonus and easy to get onto.", "Date": "December 20, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "hamburg", "Title": "“For Paris Price/Value balance is good”", "Author": "markoroman", "ReviewID": "UR121885524", "Content": "The Hotel is easy to find, centrally located, close to metro station and in the beautiful marais area with lots of shops, restaurants, bars, ... . The room size is ok for Paris (small hotel rooms are very common). The bathroom was rather large for Paris and quite new. I did not book breakfast so I cant say. My room was to the backyeard so rather quiet. As usual in Paris u can hear ur room neighbours a bit. Room looked okay but not stylish or anything. Bed was good as was matress and everything was cleasn. Staff had been changing quite often but always friendly at the reservation desk. By handing out the keys when one returns to the hotel I think they should ask for the name as well and check, cause some of the staff i saw the first time. Last remark: Cleaning / Room Service came in twice in my room without knocking or checking whether I was in my room. I think that shouldnt happen and it is no big effort to knock on the door before you be invized to enter.", "Date": "December 19, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Sleep Quality": "4", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Ipswich UK", "Title": "“Good hotel, excellent location”", "Author": "big-bill3", "ReviewID": "UR121857168", "Content": "We chose the hotel for its star rating and its location, which is very good for the Marais and for the Islands. The room was not large but clean and well appointed. The Shower was good and large enough for the two of us. At €9.50 each the breakfast was rather expensive for a simple continental fare (coffee, Croissant, Pain au Chocolat, Cornflakes, Yoghurt)", "Date": "December 18, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Miami, Florida", "Title": "“Excellent Location and Great Staff”", "Author": "John311", "ReviewID": "UR121698971", "Content": "This is a nice, clean, with courteous staff and I can’t say enough about its location. It’s a 3 star in central Paris so it’s not cheap and don’t expect space or too many amenities. The room is really small but when in Paris you really don’t stay in too much. Good French breakfast in a cozy underground room (you have to pay) and free Wi-Fi. The location is excellent, a couple blocks from Notre Dame and close to cafes and shops plus if you like to walk, the Louvre and Champs-Elysees aren’t that far away. Next time in Paris, will certainly stay there again.", "Date": "December 13, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "3.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "travelling", "Title": "“This is an acceptable 3 star hotel in a great location”", "Author": "schnoodleontheroad", "ReviewID": "UR121584900", "Content": "Only stayed one night, but the Beaubourg was quite acceptable. It is in a great location on the edge of the Marais, just across the street from the Pompidou Centre. It is about a 4 minute walk to Chatelet - Les Halles, which is a good metro hub, but also has an RER stop for the trains to and from both Orly Airport and Charles de Gaulle Airport ( It took about 55 minutes to get to the hotel from Orly and about 35 minutes to get from the hotel to CDG when I left). TIP: If taking the RER to CDG airport, choose the right train for the terminal that you need to go to. The trains leave from the same track and are well marked as to which terminals they go to, but there are some that go only to Terminals 1 and 3 and others (TGV) that go only to Terminal 2. If you choose the right train at Chatelets, you won't have to locate and take the shuttle between terminals - which will add time to your trip. The hotel is small, the room was European small, but clean and the bed was comfortable. The window overlooked a small courtyard so it was very quiet. The staff was helpful and friendly. About 1 minute after I checked in the power went out for about a minute. When I asked they said that someone was doing some work on the facilities and they had to switch the electricity off for brief periods. And in the morning, at about 8 am, there was some noise from the room next door as they were tearing up the carpet. Other than these little issues, the hotel was quite acceptable, although on a return trip, I might consider the Petit Moulin Hotel which is closeby and a bit more upscale (with a bit higher price of course), but the Beaubourg was quite acceptable.", "Date": "December 10, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Sleep Quality": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Dublin, Ireland", "Title": "“Hotel Beauborg”", "Author": "Clive131", "ReviewID": "UR121548230", "Content": "My wife and I stayed at the Beauborg for four nights. Having read previous reviews we asked for and got a room overlooking the courtyard and it was lovely and quiet. The rooms are small but adequate and the one we were in was nicely decorated. We had a twin bed room and for me the bed was very comfortable. A larger room would be nice but overall a positive experience. However, a few small points. The free much appreciated wifi needs to be improved as the signal drops constantly and this is very annoying. What is really below par however is the quality of the toiletries. At a rate of an average €150 a night we would expect something a bit better than the thin sachets. Surely a decent bar of soap etc would not be too much to ask. I think this really lets down the quality of the hotel and gives the appearance of meaness.", "Date": "December 9, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Sleep Quality": "4", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Finland, Europe", "Title": "“Nice hotel with good location, rooms VERY small”", "Author": "TravellingFinns", "ReviewID": "UR121454018", "Content": "Good choice, but rooms are extremely small compared to price what you pay, also breakfast was extra", "Date": "December 6, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Ariège", "Title": "“Excellent hotel”", "Author": "kiricol", "ReviewID": "UR121231206", "Content": "We keep going back, year after year. The staff is friendly, the room is lovely, the location right next door to the Pompidou center and close to restaurants and jazz clubs ... what more could we want?!", "Date": "November 30, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Houston, Texas", "Title": "“Consistently good and an excellent price.”", "Author": "ChrisTocino", "ReviewID": "UR121212911", "Content": "We have probably stayed at the Beaubourg ten times and we continue to sing its praises. For the price you can't do much better. The rooms are charming, comfortable, and clean. The staff (most have been there for the last decade) is helpful and friendly. The wi-fi service is free and reliable. The rooms are kept up to date.", "Date": "November 29, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "New York, NY", "Title": "“Comfortable stay in Paris”", "Author": "KaitD", "ReviewID": "UR121212575", "Content": "Just returned from a wonderful trip to Paris and the Hotel Beaubourg made our trip comfortable and pleasurable. At first I was a little skeptical because of the location, down the little Rue Simon Le-Franc side street, across from the Pompidou Center, but I quickly realized the neighborhood had a lot to offer. There were tons of Bars and Restaurants close by in any direction and it was perfect for taking public transit just about anywhere because it is a 5 min walk to the Les Halle metro station. The hotel was inviting and our room was cozy and perfectly decorated. From the exposed beams on the ceiling to the fabric on the walls it was the cute French hotel you would picture in a movie. Coming from NYC I had no problem with the size of the room, and actually the bathroom was very large. Beware of the shower though, you tend to splash out a lot and make a soggy mess of your foot towel, but just adjust the pressure when soaping up and you should be fine. The bed was very comfortable (it was one of those memory foam mattresses which I now understand are amazing and will be purchasing for my home). The room also had a mini bar a large closet, medium flat screen TV, desk and sitting chair. Bathroom amenities (shampoo, body wash, etc) left something to be desired but I bring my own anyway so it didn't matter. Our room faced Rue Simon Le-Franc and was very quiet. We did not try the breakfast menu in the hotel restaurant because we loved our morning trips to the bakery. All in all we had a great stay and look forward to returning soon!", "Date": "November 29, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "3", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "New York City, New York", "Title": "“Always a favorite”", "Author": "Ed P", "ReviewID": "UR121100707", "Content": "Been coming to this hotel for the last ten years. Consistently good.", "Date": "November 27, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Yorktown Heights, New York", "Title": "“Wouldn't hesitate to stay at the Hotel Beaubourg again!”", "Author": "stdive", "ReviewID": "UR121066384", "Content": "Great location right across from the Center Pompidou. Easy access to sites & the metro. Plenty of restaurants, bars & shopping within a 2 minute walk. Staff was very friendly & helpful with restaurant recommendations, directions, and making arrangements for transport to the airport. Our room had a king size bed and very little additional room, but it was very clean, the bed was comfortable & the bathroom was nice. Breakfast was very good and reasonably priced based on everything else in the area. Wi-fi was free and easy to connect!!!", "Date": "November 26, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Glasgow, United Kingdom", "Title": "“Excellent location”", "Author": "JMBKMB", "ReviewID": "UR121016260", "Content": "This hotel was located in an ideal place for transport routes and sightseeing. There are a large number it bars and restaurants all within a 5 minute walk. It felt safe to walk about after dark. The hotel had freindly and welcoming staff and the room was the quietest hotel room we've ever stayed in. Breakfast was simple continental but was very tasty and had a few extras that could be purchased. If i ever have to stay in Paris again i will definately stay here again.", "Date": "November 25, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "3", "Sleep Quality": "5", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Dublin, Ireland", "Title": "“Great location, very clean.”", "Author": "ktmuck", "ReviewID": "UR120994431", "Content": "Had a lovely stay here recently. It's in a fantastic location right opposite the Pompidou centre. Only complaint would be that we got room 51 which is the top floor, so the ceiling slants over half of the room. I hit my head a few times, which was due to my own clumsiness really. I would suggest asking for another room if you are tall like me. Besides that, I would definitely recommend Hotel Beaubourg.", "Date": "November 24, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Sleep Quality": "5", "Rooms": "3", "Location": "5"}, "AuthorLocation": "leicestershire", "Title": "“weekend away”", "Author": "pollyr r", "ReviewID": "UR120875801", "Content": "lovely little hote, have stayed 4 times, the rooms are small and the hotel itself is small, but I come back because although small they are nicely decorated and it fantastic location, the street it is on though has gone down hill and was not very nice.", "Date": "November 21, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "3", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Oslo, Norway", "Title": "“Great service.”", "Author": "HanneFjell", "ReviewID": "UR120701699", "Content": "Friendly and very helpfull staff. Service 24/7. Perfet located close to the Notre-Dame church. Close to a lot of restaurants. Located near the metro, which makes it easy to travel around in Paris. Cozy rooms in old Paris (french) style.", "Date": "November 17, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "3", "Rooms": "4", "Location": "4"}, "AuthorLocation": "London", "Title": "“I recommend it”", "Author": "ubin1234", "ReviewID": "UR120681328", "Content": "Very nice, nice location, good ratio price/quality, nice hotel, nice staff, clean, internet... I am traveling every week in Europe. I stayed at Hotel Beaubourg as my usual hotels were fully booked, and I have been nicely surprised. I recommend it.", "Date": "November 16, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "2", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "cambridge", "Title": "“Recent stay”", "Author": "bettyb25", "ReviewID": "UR120679833", "Content": "I have just spent a night at this hotel, very quaint, very clean, a lovely boutique hotel, excellent location and good service. My only query was that I travelled with a colleague, we both booked online directly but for same grade of room and I paid 20 euros more, I cant understand why this would be. Before booking I would suggest that you call the hotel to understand best rates.", "Date": "November 16, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "4.0", "Value": "3", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "london", "Title": "“great location, very clean, friendly staff”", "Author": "sophiebambam", "ReviewID": "UR120519135", "Content": "Paris is expensive! I was shocked that anything half decent (ie 3 stars) in the Marais was this much money, but their prices were in line with other similar hotels in the area. The Hotel Beaubourg is perfectly situated, and very clean. It is a standard 3 star hotel, just 28 rooms, so small and intimate. No extra luxuries, but felt cosy and comfortable. The front of house staff were all friendly, especially if I made an effort to speak french! One criticism is there were no english tv channels in the room. CNN or BBC World News would have been nice. Also, you sometimes hear a bit of noise from the hall or the room next door. Bathroom was great, with a full bath and spotlessly clean. No frills, but comfortable and convenient. I'd stay here again.", "Date": "November 13, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "1.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Gastonia", "Title": "“Beware! There is a Thief among them!”", "Author": "R S", "ReviewID": "UR120166488", "Content": "Think twice before booking this hotel! We celebrated our 2nd anniversary with a trip to Europe, four nights in London then four nights in Paris. We booked this hotel because of their rating on Tripadvisor and the central location to sites we wanted to take in. The Hotel staff were very friendly and the room was decent. We paid 150 Euro per night for a King bed. A little too much noise late at night but not too bad. After we checked out and were on our way back to London for the flight home, I tried to use the Oyster card that was in a card sleeve that I had purchased earlier in London and it did not work. Upon opening the sleeve to look at the card, it had been replaced with a used international calling card. I used this card at the last station at Tower Hill to get to St, Pancreas station to take the Euro Train to Paris. It was in a zippered pocket the entire time. I had two jackets with me so I left this one in the room in Paris because I would not need it again until our return trip to London to get to Victoria station for the express back to Gatwick Airport. The oyster card can be turned back in to get the 5 British Pound deposit plus any amount up to 7 British pound unused on the oyster card. The Oyster card was definitely removed from its sleeve and replaced with the used Calling card in the room at Hotel Beaubourg. It is a minor theft but still a theft. We checked all of our valuables on a daily basis there. The cars sleeve is closed with the card on the inside and you cannot physically see it from the outside but can only feel that it is there.My wife contacted them, gave them this same information. We only asked to be reimbursed for the value of the Oyster card and the amount that was left on it. A total of 9.90 British pounds. They are asking us to fill out a police report to give to their insurance. We inquire how do we go about doing that. Their reply is to \"Fill out a Police report\". We feel that this is getting us nowhere so We just wanted to let potential victims to be vary careful with this Hotel Beaubourg. Do not leave anything valuable in the room as minor as An Oyster card or Metro cards. It is the principal of the matter not the amount. All they needed to do to make it right with use is to credit my account the 9.90 British Pounds, but I have to spend major time and effort because someone on their staff is a THIEF!", "Date": "November 4, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Bremen, Germany", "Title": "“To recomment, perfect location, quit”", "Author": "R M", "ReviewID": "UR120071102", "Content": "Perfect location for Pompidou, Louvre, Marais and easy access to numerous metro stations. Rooms to the backyard are very quit. Can recomment this hotel in anyway.", "Date": "November 2, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Atlanta, Georgia", "Title": "“Location, location, location”", "Author": "skipnatl", "ReviewID": "UR120044680", "Content": "Stayed at Hotel Beaubourg for 4 nights with my partner. Arrived very early, but front desk offered to store our bags for a few hours until room was ready. Room itself was small (but good size for Paris) and cute in a French sort of way. Bed was quite comfortable, and there were extra pillows available. I requested a courtyard view so I could leave the window open, and it was very quiet. I loved the fabric wall paper. The bathroom was, well, very small and probably the only blemish for the stay. I could not stand up in the shower (I'm 5'11\") and at the conclusion of each shower I would need to spend 5 minutes cleaning up water that splashed about the room. There was a small door stop right where you step out of the shower, perfectly located to injure your foot. The breakfast was fine to get you going each morning... nothing special, but the lady working the room was so very nice. You can not beat the location of this hotel. Minutes to the river, minutes to the Ile d'Cite, minutes to the Metro, minutes to anything really. I love the Marais and you are in the center of it. Will I stay here again? Absolutely! Would I recommend it? Absolutely!", "Date": "November 1, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "United Kingdom", "Title": "“Always our choice in Paris”", "Author": "dbgatlanta", "ReviewID": "UR119808524", "Content": "Perfect location for Pompidou, Louvre, Marais and easy access to numerous metro stations. Staff always professional and helpful. Great restaurants and shopping in Marais. Rooms are always very clean and well decorated, beds comfortable. Also has an elevator if you have any mobility issues. We love this hotel and it's great location!", "Date": "October 27, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "3", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Chicago, Illinois", "Title": "“Nice Hotel - Great Location”", "Author": "rventi1", "ReviewID": "UR119567641", "Content": "Friends stayed before and this time, my first time - room was clean, good size, excellent shower and up to date. Front Desk staff courteous and checkin/out effortless. Train stop one block up at the entrance to Pompideau. So many good restaurants and cafes seconds away.", "Date": "October 21, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Atlanta, Georgia", "Title": "“Love this hotel!”", "Author": "schwaja", "ReviewID": "UR119391123", "Content": "We have stayed here several times and will continue to stay here every year when we come to Paris. The location is fantastic, the staff is friendly and helpful and the rooms are clean.", "Date": "October 17, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Zurich, Switzerland", "Title": "“A Handy Place to Stay”", "Author": "Ellen D", "ReviewID": "UR119389594", "Content": "I needed better instructions to find the hotel but once there it was excellent. I loved my 'penthouse' attic room but it wouldn't have been much fun for someone who is tall, however, I am sure the staff would use their discretion and not put a very tall person in the room. The cafe for breakfast was most interesting with its old well shaft in one corner and the food very good. The decor throughout the hotel is intriguing and quite beautiful. The staff were most helpful in every way. My one criticism would be that there was a need for a more defined laundry service for traveller's like me. The staff were willing to help out here but needed more time than is usually available for short stop tourists.", "Date": "October 17, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Newmarket, Ontario, Canada", "Title": "“Great Location”", "Author": "Tina K", "ReviewID": "UR119375391", "Content": "We were in Paris for a week and were so happy to have stayed at the Beaubourg. The location was very central to many of the sites we wanted to visit, with easy access to the subway and buses. Our hotel room was quiet and clean with comfortable beds and pillows and we found the staff to be very nice, and helpful when we asked for assistance. One morning we were a little late getting down to breakfast and there were no more croissants. The young man in charge offered to go and get us some from the local bakery. He returned in no time with two warm croissants! The area also has a variety of shops, cafes, bakeries and pastry shops. We will certainly return to the Beaubourg on our next visit to Paris.", "Date": "October 16, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Frankfurt, Hessen, Germany", "Title": "“Magnifique!”", "Author": "Valerie2424", "ReviewID": "UR119108857", "Content": "Location, service, staff is great. A very neat hotel very close to where it´s happening. Members of staff were sweet, helpful und friendly. We can recommend it wholeheartedly and will certainly come back. Merci beaucoup!", "Date": "October 9, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Portland, Oregon", "Title": "“Nice Place to Stay in Paris”", "Author": "MoandKer", "ReviewID": "UR119082930", "Content": "This was my first visit to Paris in 30 years and the first for my husband. When we arrived at the hotel at 9:30 am, we were jet-lagged and tired and as expected, our room wasn't ready for us yet. We offered to leave our bags and check back later, but the staff were very kind and insisted they could move us to another room. Within 5 minutes, we were checked in and in a room. Our room was small, but comfortable and quiet and the bathroom and shower were nice. We stayed here for four nights and throughout our stay, the staff was very helpful with all of our questions and advice on nearby restaurants. The hotel location was great, within walking distance of the Pompidou center, Notre Dame Cathedra, Hotel de Ville and many other sites and with 2 subway stations close by for access to all of Paris and surrounding area. Breakfasts were pretty typical of what we found in most of the French hotels that we stayed in, with fresh rolls & croissants, cereals, yogurt, a little cheese, and coffee & tea. All in all, we were very happy with our stay here and feel it provided good value for the price.", "Date": "October 8, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Victoria, Canada", "Title": "“Very good location and, for Paris, a reasonable price”", "Author": "HowardFreeland", "ReviewID": "UR118864185", "Content": "We enjoyed our stay at the Hotel Beaubourg. We have been to Paris several times before and wanted this time to stay in the Le Marais area. The Pompidou Centre is steps away, Hotel de Ville and Notre Dame very close. The staff were very pleasant and helpful. The room was very quiet and comfortable, the breakfast is in an interesting cave-like area underground, but the breakfast was only adequate. One does pay more for hotels in Paris, but this one was good value for money.", "Date": "October 2, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "3", "Location": "5"}, "AuthorLocation": "atlanta", "Title": "“This was the perfect place to stay”", "Author": "buttondeb", "ReviewID": "UR118828588", "Content": "A very satisfying location in the Marais, you could almost reach out and touch the Pompidou, and so close to so many sights, stores and interesting streets. A block away from the metro, 5 min walk to Hotel de Ville or Les Halles, and many good restaurants within a 10 min walk, hard to beat the price and location. Do suggest reserving a room well in advance to secure a room in the back away from the street, for example room 17, 27, 37,47 are all surprisingly quiet. The bathrooms have been nicely remodeled and some have a bathtub. Monsieur Kise (sp?), front desk manager, went out of his way to be helpful making suggestions, dinner reservations etc. trying to keep the clientel happy. Some of the evening staff were lacking people skills however. The maids were pleasant and hard working. The air condition was welcomed with the current heat wave in Paris. Only suggestion would be to provide a larger trash can in the room, I've never seen one as small as they have. And agree with others that more light is needed in the bedroom.", "Date": "October 1, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "3", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Washington DC, District of Columbia", "Title": "“We had a great stay.”", "Author": "CAlexandra06", "ReviewID": "UR118674597", "Content": "We had a great stay at Hotel Beaubourg. The hotel is very unique and perfect for a young couple like us visiting Paris for the first time. We booked the very last room in the hotel for the nights we stayed, and it was quite fine. Some of the other rooms looked more handsome, and I expected that the last hotel room to be booked might not be the most special. But really, it was just fine. Small, but clean and with character. We are from Philadelphia, and it was helpful that the staff spoke English well. They kept wine for sale (11euro) at the front desk, which came in handy one night. The hallways are quite narrow, but for me this just adds to the charm. There is a beautiful breakfast room. The location is unbeatable, right next to the Pompidou Center in the Marais.", "Date": "September 27, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "3.0", "Value": "4", "Sleep Quality": "4", "Rooms": "2", "Location": "5"}, "AuthorLocation": "Pompano Beach, Florida", "Title": "“Watch for the slippery shower floor”", "Author": "John828", "ReviewID": "UR118609499", "Content": "I have stayed at this hotel previously and rebooked it because of its excellent location and good value. The hotel is clean and the personnel are pleasant and helpful. The building is old and the elevator is small and slow. In their efforts to be eco-conscious the management has diminished the lighting in bedrooms and hallways. They have also provided liquid body wash in the shower in a container that is clumsy to use and miserly. The ceramic bathtub has a high side, no anti-skid material on the floor, and no grab bars.. This makes it difficult to enter and exit and treacherous when wet and soapy. One must be very cautious to avoid a fall. I wasn't cautious enough and did fall in the shower.", "Date": "September 26, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Santa Fe, New Mexico", "Title": "“Hotel Beaubourg”", "Author": "mizbani", "ReviewID": "UR118372222", "Content": "I chose to stay at Hotel Beaubourg because the reviews on Trip Advisor were so positive - it was a good choice. The hotel is lovely and in a perfect location in Paris, near the Marais, Notre Dame, a great central location to walk from and on a quiet street. The hotel upgraded us to room #4, a double room with a private terrace, a delightful room at a very reasonable price.", "Date": "September 20, 2011"}, {"Ratings": {"Location": "5", "Overall": "5.0", "Value": "5", "Service": "5", "Rooms": "5"}, "AuthorLocation": "Los Angeles", "Title": "“Third Time at Hotel Beaubourg”", "Author": "LA-CATraveller", "ReviewID": "UR118311637", "Content": "I've been to Paris four times now and I've stayed at hotel Beaubourg a total of 3 times. During my first visit, I stayed at another hotel which was much more expensive and probably about 75% less space. Hotel Beaubourg is terrific for many reasons, including: 1. Fantastic staff 2. Amazing location 3. Spacious rooms for the Marias and Paris 4. Very clean rooms i love Paris and when I return there is no doubt that I'll be staying at the Hotel Beaubourg again.", "Date": "September 19, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "3", "Overall": "4.0", "Value": "5", "Service": "4"}, "AuthorLocation": "California", "Title": "“Great value, helpful staff”", "Author": "AustraFrench", "ReviewID": "UR117940220", "Content": "I stayed here for one night during a very busy period in Paris when there was a serious lack of room availability. I got the downstairs basement room, which did have an odour (not unpleasant exactly, but still noticable) but it was spotlessly clean. Also, given the hotel was full it was extremely quiet which is important to me. Free Wi-Fi much appreciated as was help with baggage storage and taxis.", "Date": "September 11, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "4", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Fallbrook, California", "Title": "“Wonderful Stay”", "Author": "Randy C", "ReviewID": "UR117745816", "Content": "My wife and I stayed four nights and completely enjoyed the hotel. The accomodations are good value for money and the location is unbeatable. The staff was very pleasant and helpful as well. We stayed in room 41, which faces the street, but the double paned windows sealed out what little street noise there was and we had a very restful stay. I highly recommend this hotel and we'll certainly be back.", "Date": "September 6, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "3", "Overall": "4.0", "Value": "5", "Service": "3"}, "AuthorLocation": "Kuala Lumpur, Malaysia", "Title": "“You get what you pay for.”", "Author": "Azmi M", "ReviewID": "UR117732835", "Content": "Small boutique sized hotel. You get what you pay for. Nicely renovated bathrooms. The room could be a bit more comfortable. I would stay here again. The location is great.: the Pompidou Center is just a metres away. On reaching Rue Beaubourg and looking leftwards and you can see Notre Dame.", "Date": "September 6, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "4.0", "Value": "3", "Service": "5"}, "AuthorLocation": "wimbledon", "Title": "“Sparklingly clean and comfortable”", "Author": "suethack", "ReviewID": "UR117348283", "Content": "We really liked this nice hotel. It is so near to Pompidou Centre and a short walk to Notre Dame. The check out time is MIDDAY! Hooray! The rooms are lovely with en suite baths and showers (we stayed twice). Hotel Beaubourg had a tranquillity about it and it was very quiet even though we were in a central place. There is a fridge but no tea / coffee making facilities. The hotelier was very helpful and friendly. We would definitely stay here for a third time!", "Date": "August 28, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Cambridge, United Kingdom", "Title": "“We loved this charming hotel in such a fantastic area of Paris\"”", "Author": "LDAHL6", "ReviewID": "UR117329499", "Content": "This hotel couldn't be better situated in the heart of Rambeatu in the Marais area, right be the Pompedou and lots of amazing streets around it with restaurants, cafe's, shops and parks. The staff were very friendly and the room was great. We had the attic room which has beams in it and if you're tall probably not great for you. Breakfast (not included in price) was fresh and in the restored cellar and went on until 11am which was great. We'll definitely be back!", "Date": "August 27, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "", "Title": "“A classy little hotel”", "Author": "Brune8", "ReviewID": "UR117289392", "Content": "We discovered this hotel about 6 years ago and have stayed there since every year when we go to Paris. It's spotless, it's very central to everything, it's reasonable price wise, and the staff have always been courteous and helpful. More than anything, this is ia comfortable and reliable hotel, and has always been perfect for our needs as tourists. Over the last 12 years we have stayed in 7 hotels in Paris, and since we found this, it is the one we return to. The hotel is 3 stars, so it's not huge and things in it are on a 3 star scale, but this is a very good 3 star hotel.", "Date": "August 26, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "4", "Overall": "4.0", "Value": "4", "Service": "4"}, "AuthorLocation": "Saint Paul, Minnesota", "Title": "“Nice place in the Marais”", "Author": "Brad G", "ReviewID": "UR117077352", "Content": "Very efficient place, in the shadow of George Pompidou's museum, we had a nice room, with AC and nice bathroom. Felt safe and had great access to the city. We would stay there again.", "Date": "August 22, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "4.0", "Value": "4", "Service": "5"}, "AuthorLocation": "Tasmania Australia", "Title": "“Our second stay at beauborg”", "Author": "RobTasmania", "ReviewID": "UR116834770", "Content": "We like this hotel even though the rooms are small but so is the hotel. It is the quaintness that is appealing Good service at the desk and free wi fi during your stay We love the Marias distict so this hotel is very convenient Also we are able to walk to Notre Dame and the Louvre very short walk to the metro and right across the road from George Pompidou Centre It is a three star hotel with good staff and friendly service We will stay here again", "Date": "August 17, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "4", "Overall": "4.0", "Value": "4", "Service": "5"}, "AuthorLocation": "New York City, New York", "Title": "“great location, clean, helpful staff”", "Author": "AJM1227", "ReviewID": "UR116763811", "Content": "lovely spot! big bathroom, helpful staff, a little noisy on the street side. people next door to us were chain smoking and we could smell it through the room even though there were signs stating no smoking everywhere. That was the only issue, and overall it was a lovely stay.", "Date": "August 15, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "4.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Melbourne, Australia", "Title": "“This is the second time we have stayed at Hotel Beaubourg. This time we bought our family with us!”", "Author": "michelle b", "ReviewID": "UR116700690", "Content": "Great location. Great price. Friendly service. Clean and spacious rooms. What more could you ask for in the heart of Paris!", "Date": "August 14, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "4.0", "Value": "3", "Service": "4"}, "AuthorLocation": "Silicon Valley", "Title": "“Quiet hotel in great location”", "Author": "Explorer100", "ReviewID": "UR116455460", "Content": "Comfortable bed, quiet room, healthy breakfast. Within 5 minutes walking to laundromat (bring own soap), ATM, grocery store, Travelex, Leroy Merlin (AA batteries and 1-to-3 plug converter), Metro station and Pompidou Center (no line to purchase Paris Museum Pass).", "Date": "August 9, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "3.0", "Value": "3", "Service": "3"}, "AuthorLocation": "Toronto, Canada/Palm Springs", "Title": "“would come back”", "Author": "scuba1bear", "ReviewID": "UR116441032", "Content": "Good location for La Marais--had an \"interior room\" over looking a \"courtyard\" but appreciated the quiet. Room was a decent size, clean and comfortable enough. If you want turn down service and chocolates on your pillow, go elsewhere. Breakfast was ok, but there are many cafes nearby for that --and killer croissant if you know where to look.", "Date": "August 8, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "2", "Overall": "3.0", "Value": "3", "Service": "1"}, "AuthorLocation": "London, United Kingdom", "Title": "“Great hotel, awful customer service.”", "Author": "Bronchan", "ReviewID": "UR116295825", "Content": "Having stayed here several times over the last few years, I booked this hotel for the first 2 nights of my honeymoon last week. The hotel itself is lovely, in a great location and the room still did not disappoint, (though having no tea/ coffee making facilities/ free water as well as no bathroom products lets it down slightly). On our first morning however, we were woken up very early by loud banging and scraping from the room upstairs which made it impossible to sleep. After a couple of hours, I went upstairs to have a look and saw the room was being redecorated. I asked at the front desk about this and was truly shocked by the rudeness of the lady on reception. In my broken French and her broken English I came to understand that the guests had flooded the room upstairs. However, there was no apology and was instead told \"donq!\" I completely understand that a situation like that is out of their control, but having paid 125 euro for a room, I would expect to be able to sleep in after 6.30am or at the very least get an apology when I couldn't. We stay here every year, but may look elsewhere for our next visit.", "Date": "August 5, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "4.0", "Value": "4", "Service": "4"}, "AuthorLocation": "Melbourne, Australia", "Title": "“Great hotel in great location”", "Author": "SarahBen41", "ReviewID": "UR116178165", "Content": "We very much enjoyed our stay at Hotel Beauborg in Paris and would stay again in future. The room was lovely and the hotel was in a great location, just a short walk to the banks of the Seine and the Ile de La Cite.", "Date": "August 2, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "4", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Denver, Colorado", "Title": "“Fabulous Place and a GREAT Value”", "Author": "lmsclimbs", "ReviewID": "UR115900323", "Content": "Clean room with modern plumbing, newly redecorated. Lovely breakfast downstairs. Fantastic location by the Pompidou Centre, minutes to everything. Will never stay any where else in Paris. Great value when you book online.", "Date": "July 28, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "3", "Service": "5"}, "AuthorLocation": "Maitland, Florida", "Title": "“The two of us enjoyed the room and hospitality.”", "Author": "Lightkl11", "ReviewID": "UR115723183", "Content": "Clean hotel and friendly staff. Better than most small hotels in europe. Easy to get to metro and short walking distance to Notre Dame. Cute breakfast area, but chose to eat at other cafe's while walking around.", "Date": "July 24, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "4.0", "Value": "4", "Service": "4"}, "AuthorLocation": "Orlando, Florida", "Title": "“Wonderful hotel and staff”", "Author": "lbaker6495", "ReviewID": "UR115543857", "Content": "We had a charming room at Hotel Beaubourg. Very clean with comfortable furnishings. The neighborhood was peaceful and quiet , which was great after a long day of sightseeing. The staff were always helpful and professional. It is conveniently located near Notre Dame, with several cafes nearby serving delicious pastries and quiche. City Metro trains (and city buses) are within easy reach as well, which made traveling between museums and other attractions much more pleasant. I would definitely stay here again!", "Date": "July 19, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Basel, Switzerland", "Title": "“Great location”", "Author": "thcobs", "ReviewID": "UR115458268", "Content": "Great location in a quiet small street next to centre Pompidou, next metro station is in 3 minutes walking distance; good, clean rooms", "Date": "July 17, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "4", "Service": "5"}, "AuthorLocation": "Rocky Mountains, USA", "Title": "“Would stay here again”", "Author": "JaneQSmith", "ReviewID": "UR115256732", "Content": "Quite nice. Very clean, and our room was very quiet (we were facing the courtyard). Staff all spoke English, although not completely fluently. I would stay here again; convenient to Metro, Pompidou, Notre Dame and quite a long way from the Eiffel. Lots of restaurants nearby, but we didn't find anything spectacular. There's a small market on the next street east (parallel to the street the Pompidou is on). Seemed like a decent value for what we got, considering how pricey the Paris hotels are. No views from our room, but I think we would have had to pay double for that somewhere else. No in-room safe, so make sure you know the hours you have access to your valuables (something like 7 a.m. to 7 p.m.).", "Date": "July 11, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "San Francisco", "Title": "“The only hotel I stay at when in Paris”", "Author": "mykonosteve", "ReviewID": "UR115252536", "Content": "Great location with extremely friendly and helpful staff.", "Date": "July 11, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Annapolis, Maryland", "Title": "“Beautiful rooms in terrific location-definitely will be staying here again!”", "Author": "APKinney", "ReviewID": "UR113941580", "Content": "This hotel has a great location - close to many restaurants, shopping, sights, and the metro. The rooms are beautifully decorated, bathrooms are pristine, very clean and comfy beds. Most of the rooms are a good size for Europe (I peeked at a few when the maids were cleaning) but they do have a few of the tiny rooms. I called 2 days before our trip and was told we would have a tiny room so I knew what to expect. But, Klas was very nice to us and was able to offer us the 5th floor room which is spacious but the roof is slanted on part of the room. We liked the privacy of it, only room up there. Then, we had a more spacious room on our trip back from Brussels. The staff is very nice and helpful. We felt very safe there even to leave our computer in the room. The Free wifi is great and we could use it for our computer and iPad. Every morning we went to one of the 4 pastry shops on the block. There are 2 grocery stores for buying cold drinks and snacks. They have a refrigerator in the room. They can even arrange an airport shuttle for you, and have a storage room for your bags until you leave. My only criticism would be to provide some ice but that's hard to find in Europe. It was our first time in Paris and we love this hotel.", "Date": "June 16, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "London, United Kingdom", "Title": "“Simple but charming with an amazing location!”", "Author": "Moi_Lyon", "ReviewID": "UR113925088", "Content": "I initially chose this location because, having lived in the area before, I know you won't find a much better quartier in Paris than Le Marais. The hotel, right in the centre of Paris, is perfectly situated for sightseeing, but isn't noisy as it's on a tiny side street. The hotel is small and quite basic but I found it very lovely all the same. It wasn't the most modern interior, with heavy flower patterned walls, but it was very romantic and perfect for a couple on a weekend getaway. It is not the kind of hotel you spend a lot of time in as there wasn't any room service or amenities, but it's a lovely place to come home to and have some time alone together after a long day of sightseeing and fine dining. It is also great value, and we paid little given the brilliant location for a busy time of year (a predictable day in February..)", "Date": "June 16, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "4", "Sleep Quality": "3", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Paris, France", "Title": "“Could have been worse”", "Author": "MIKED88", "ReviewID": "UR113607665", "Content": "Good location, price is kinda reasonable for the area. Very nice bathroom, eventhough the room it self was a little old fashioned. The drinks in mini bar were surprisingly not expensive too. I think it's worth trying. Room and bathroom were very clean and nice, not noisy. The major issue for me was the people at the front desk : Grumpy, unfriendly, cold, even agressive... I saw three different people on that desk, they were all very unfriendly. If i was the manager I'd change the staff! Beside that a free bottle of water would have been a plus.", "Date": "June 15, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "4", "Overall": "4.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Washington, DC", "Title": "“nice little place in an awesome location”", "Author": "gridley", "ReviewID": "UR113474326", "Content": "This hotel is a perfect little place in le Marais on a very quiet side street. It's a short street and our cabbie had a little trouble finding it, but they all have gps now so we got there. We had chambre #2 and our friends had chambre #4. Chambre #4 has its own secluded patio with table and chairs. We all sat out there several mornings for coffee and breakfast obtained from a nearby shop. The rooms are a little bland and could use some sprucing up, but they were very clean, had their own bathrooms with showers, spacious for Paris, and comfortable. If you're in the mood for some wine late in the evening (or any time), they sell inexpensive bottles at the front desk and will provide a wine opener. We did not try the breakfast there so no comments on that. The location is unbeatable if you want to be in the marais. The hotel is gay-friendly - we were 2 gay couples - and close to the marais bars and cafes. The front desk people were courteous and helpful. All spoke English and didn't seem to mind our attempts to speak a few French phrases. There's a closet to store your bags if you need to check out before you're ready to leave. They will call cabs for you and also are willing to make recommendations for restaurants and things to do. Would definitely stay there again.", "Date": "June 14, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "4.0", "Value": "4", "Service": "4"}, "AuthorLocation": "Little Rock, Arkansas", "Title": "“Good location and staff”", "Author": "leslieh33", "ReviewID": "UR111453108", "Content": "My husband and I stayed here for 4 nights in May 2011. The room was very pleasant with a refrigerator That was very convienient. We liked the location across from the Pompadeaux Center. We also liked that it was an easy walk to the Marias area of Paris.", "Date": "June 4, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "4.0", "Value": "4", "Service": "4"}, "AuthorLocation": "San Jose", "Title": "“Nice, cute and lovely rooms”", "Author": "Orijit", "ReviewID": "UR110979270", "Content": "Great location. Bus 38 runs through the heart of the city and drops you right in front of the hotels. LOTS of not-too-expensive restaurants and bars everywhere. Walking distance to loads of sights. Amazing location. The rooms were thematically done. Very nice. Friedly staff. Would love to go back.", "Date": "June 1, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Miami Beach, FL", "Title": "“Small boutique hotel convenient to all of Paris”", "Author": "DB305", "ReviewID": "UR110615817", "Content": "This is my second time staying at Hotel Beaubourg. I chose to return primarily for the hotel's location, service and price. I reserved the room on their website. For 150 euros per night, it was among the most reasonable in the Marais during May (a normally prime tourism period in Paris). Upon arriving, there were no issues at checkin. My reservation was on file, the first night was pre-paid and within 5 minutes we were in the room and unpacking. We had room 46, located in the back of the hotel with a view facing the courtyard. The room was very quiet as there was only one other room that shared our floor. With a view of the courtyard, there was no noise from the street either. Never had to wait long for the elevator, which is small. Only room for two or three people. The room was small, but this does not come as a surprise. Most of the hotels in older Parisian buildings have small rooms. Sometimes it required the two of us to reshuffle luggage to move about, but nothing we could not handle. Definitely not a room for those who might require handicap accessible features though. Bathroom with shower (no bathtub) and hair dryer. Hot water worked flawlessly for the four nights we were there. Cable/Satellite TV with NO ENGLISH CHANNELS. If you want your daily fix of CNN, etc. you need to speak French to understand anything on TV. TV wasn't a problem since we were never in the room to watch it. Free wireless internet in the room worked perfectly. Air conditioning also worked when we used it. Metro access at Rambuteau and/or Hotel de Ville takes less than 5 minutes walk and will take you anywhere you want to go to Paris. Upon leaving for the airport, a quick 5 minute walk to Les Halles/Chatelet got us on the RER/B train and to the airport in 30 minutes, no traffic delays. In summary, a quality hotel in a great location.", "Date": "May 30, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Jacksonville, Florida", "Title": "“\"Cute,Nice Hotel in a great location\"”", "Author": "benearme8", "ReviewID": "UR110180997", "Content": "We enjoyed staying at this hotel. Our room is cute on the third floor,with 2 windows overlooking our street.Bathroom is very clean but small which we knew before we get there. One of our favorite about the hotel is location. Lots of coffee shops,pastry shops,and very close to Marais which is a lively neighborhood. Also, acrosss the Pompidou museum. All front desk person are nice and helpful, like Kais and the lady.10 to 15 min walk to the train station. We definitely recommend this hotel to our friends and will stay here again if they give us the same room. :) Mr. Del Rosario", "Date": "May 28, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Vancouver, Canada", "Title": "“Paris at its finest”", "Author": "LarryJHYVR", "ReviewID": "UR109415041", "Content": "We have stayed three times at Hotel Beaubourg. It's location, service, and charm make our visits to Paris feel like we are at home. The staff is friendly and attentive. We have recommended the hotel to many of our friends.", "Date": "May 23, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Seattle, Washington", "Title": "“I will highly recommend this hotel to friends -- lovely decor, clean, friendly.\"”", "Author": "JaneHelene", "ReviewID": "UR109409178", "Content": "My husband and I enjoyed everything about this delightful, reasonably priced, small, meticulously restored hotel. The decor is tasteful, fresh and charming, the breakfasts and breakfast room were wonderful, our room consistently spotless, and the staff couldn't have been more friendly and helpful. As is typical in the older, private European hotels, our room was small , but it was very attractive with whitewashed walls, multiple weathered beams supporting the ceiling, as well as beautiful fabric covering the walls and coordinated linens. The staff was tolerant and appreciative of my poor French but when needed, just helped me out in English. Loved the location in the Marais -- across the street from the Centre Pompidou and all kinds of small, excellent restaurants nearby. Walked to the Louvre, Notre Dame, Orangerie, Musee D'Orsay, Opera, etc., etc. A great choice!", "Date": "May 23, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Columbia, South Carolina", "Title": "“Great location and good value in the heart of the Marais”", "Author": "wetravellight11", "ReviewID": "UR108671340", "Content": "This small hotel is conveniently located in the heart of the Marais down a very small alleyway across from the Pompidiou Center. Although moderately priced, the rooms are tastefully done in traditional French toiles and both the room and bathroom were spotlessly clean. Although our king-sized bed was comfortable it was very firm. Our ground floor room overlooked a courtyard that was in full bloom in early May and smelled great. If you prefer more security, ask for a room on an upper floor. The air conditioning was great as it was unusually warm for May. Front desk staff was very helpful and spoke enough English for us to communicate effectively. Room includes a mini-fridge and flat screen TV. Only 1 English channel but when in Paris who needs to watch TV? Their continental breakfast for 9 euros was massive and delicious, but most mornings we just chose a quick coffee and croissant at a local cafe. Very close to tons of eateries, grocery stores, and boutiques.", "Date": "May 17, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Houston, Texas", "Title": "“Great deal in the Marais”", "Author": "ChrisTocino", "ReviewID": "UR108567958", "Content": "This is my sixth visit to the Hotel Beaubourg, and it continues to be reliably good. The rooms are well-appointed (small, but with all necessary ameneties) and the public areas are nice The staff is very helpful. My only past complaint about the Beaubourg was the lack of wi-fi in the rooms. YOu used to have to use your lap top in the library. That has now changed and there is consistent wi-fi service throughout.", "Date": "May 16, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "San Diego, California", "Title": "“Fantastic”", "Author": "RFoster_11", "ReviewID": "UR107926455", "Content": "There's no better place to stay in Paris than the Marais. Centrally located just a couple of blocks from the metro (11, Rambuteau), a short walk from Notre Dame, and just a stroll to countless cafés, boulangeries and boutiques, the Hotel Beaubourg was the perfect home-base for our jaunts through the city. The accommodations were more than comfortable. Room 32 had 2 comfy twins pushed together (no complaints about length from someone who is 6ft tall) with night tables, a little fridge, a bath with a shower, a closet with shelves, a desk and a television. The maintenance staff kept everything impeccably clean each day. The concierges were so very warm and helpful that I hope to see them again soon! Merci beaucoup! À bientôt!", "Date": "May 12, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "", "Title": "“Homelike”", "Author": "ars2011", "ReviewID": "UR106309167", "Content": "Very nice place to stay. Clean, good location. Very friendly personnel. The Boss is Madam. She is very kind and helpful .", "Date": "May 1, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Sydney, Australia", "Title": "“Beautiful room with view of the Pompidou”", "Author": "hellcat_101", "ReviewID": "UR106061747", "Content": "Service was really friendly and staff were really helpful. The room (42) was beautiful with cute little windows that you could see the Pompidou centre from when you leaned out!!! There was no room safe which was a bit inconvenient, but the hotel is close to Metro and RER stations.", "Date": "April 29, 2011"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Middletown, Connecticut", "Title": "“Lovely, quiet, comfortable and in a great location!”", "Author": "kathysong", "ReviewID": "UR105693675", "Content": "We stayed here for one night in April...it is practically across the street from the Pompideau Center and on the edge of the Marais area. The concierge was quite pleasant and the bed was ridiculously comfortable. The bathroom was large and rather modern for a Paris hotel. Its off-the-main-street location makes it a quiet place to stay.", "Date": "April 26, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Sydney, Australia", "Title": "“Comfortable and a Good Location”", "Author": "Sandra16", "ReviewID": "UR103689140", "Content": "I stayed in this hotel for 6 nights, having spent much time looking over reviews on Tripadvisor. I finally picked this hotel for its location - literally across the road from Centre Pompidou - I was arriving in Paris at Gare Du Nord and it wasn't far from the station and it also appeared to be in close (walking) proximity to major sights and must-dos. This was a good choice given the traffic chaos in central Paris on the afternoon of my arrival. I managed to get a slighter better room rate through Expedia than via the hotel itself. I was surprised at the size of my room, larger than what I had expected and it was very comfortable. It was away from the street , overlooking a central courtyard and was very quiet. A fairly average breakfast was available in a refurbished basement area, although on my first morning hotel staff were running late and nothing was available at the advertised breaklfast time. My only concern would be the manner of the front desk staff. Despite my attempts at basic French (and English was spoken here), I felt on several occasions that I was imposing upon their time. One evening the person on reception was on the phone and continued with her conversation while I waited and waited. I am not sure if I would stay here again as it turned out that most of the major sights I was interested in were located on the Left Bank. However the hotel was a comfortable base from which to explore Paris. There are plenty of restaurants around Centre Pompidou for evening meal choices. It is also close to the Marais area which was great for shopping and general 'people watching'.", "Date": "April 11, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "3.0", "Value": "2", "Sleep Quality": "2", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Kettering, United Kingdom", "Title": "“Nothing special”", "Author": "panda65", "ReviewID": "UR102998034", "Content": "Centrally located, about 5 minutes from the river and Notre Damme. A bit tired and not good value at 145 euros a night. Room was clean and away from traffic but lift and other guests created some noise. Good breakfast in the cellar for extra 9.50 euros. Overall, OK bearing in mind the cost of hotels in Paris, but we found the hotel a bit claustrophobic and staff were generally indifferent and we didn't come away with any sense of enjoyment from our stay here.", "Date": "April 6, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "2", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "3"}, "AuthorLocation": "London, United Kingdom", "Title": "“Never stay in this hotel - assaulted by hotel manager!”", "Author": "Jackson123_11", "ReviewID": "UR102799186", "Content": "My husband and I recently stayed at this hotel. The location was good, but that was the extent of it. The rooms are nothing like they are shown on the website. Despite booking a kingsize room, it was so small that there was not even room to put our suitcase down. When I complained to the hotel manager, he proceeded to shout in my face. He became so agressive that I almost called the police. When I stayed there, I saw a number of other guests complaining about their accommodation and all of them received the same response - shouting - completely unprofessional and unwelcoming. I would not recommend this hotel. There are so many lovely hotels in that area that are more reasonably priced and that are run by people who want to welcome their visitors.", "Date": "April 4, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Villepot", "Title": "“Great Location - Good Value”", "Author": "le-pecheur-Villepot", "ReviewID": "UR101554380", "Content": "Paris does not come cheap, but this hotel does provide affordable accommodation in an convenient part of the city. Within 100 metres of the Pompidou Centre, a ten minute walk from Notre Dame, a fifteen minute stroll to the Louvre, Metro stations close by and a reasonable selection of eating places just a few minutes walk. The hotel does not provide a restaurant - apart from breakfast. We did not have a car with us and there is no parking at the hotel, but there are car parks nearby, although I have no idea of cost. the Metro is so good and cheap that I would always avoid taking a car into the city if at all possible. Tucked away in a narrow side street, initial concerns about traffic noise proved unfounded. Our room (No 4) was very quiet and offered a king-size bed, a good size bathroom - a bath with over-shower - ample storage for clothes, satellite TV, but sadly no tea/coffee facilities. The towel rail situated VERY close to the lavatory got extremely hot - a possible risk of burning while seated upon the throne! Breakfast, which was a slightly above average 'continental', is taken in interestingly refurbished cellar. Some cooked breakfast items are available as well if required. At busy times there may be a wait for a table. Breakfast service is from 7 to 11am. Wifi is operating throughout the hotel and a computer is available for the use of guests without charge -a nice touch that. The staff were very friendly and helpful with directions and information and at least two spoke good English. The reception desk is manned 24 hours. Checkout is at 12 noon but there is a baggage room to leave cases if departure from the city is later in the day. We will certainly return to Hotel Beaubourg on our next visit to Paris.", "Date": "March 25, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "3", "Sleep Quality": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "New York City, New York", "Title": "“Better than expected; excellent location in the Marais close to RER transit!”", "Author": "NYCtraveljunkie", "ReviewID": "UR100763979", "Content": "Just know before I continue that I'm pretty picky about my hotels, I live in NYC/Manhattan, and have traveled the world on business and for pleasure and typically stay in 4 star / 5 star hotels. I know a dump from a palace and this hotel was certainly way better in person than any of the photos I've seen, and while certainly not a palace this lovely small boutique hotel was comfortable, QUIET, CLEAN, and everything I needed for a quick 24 hours in Paris. I've stayed all over Paris, and while this wasn't the Ritz it certainly lived up to its appeal as a charming, small boutique with larger than average rooms, great front desk customer service, and amazing central location in the Marais. I was in Paris for 24 hours and spent a night here as I wanted good access to the Marais AND Les Halles Metro so I could get back and forth to Charles de Gaulle Airport easily. Hotel is right next to the Pompidou Center (known as locals as Beaubourg), and about 5-7 minute easy straight-shot walk from hotel to Les Halles metro stop for the RER and other transpo options. I paid $210 for the night for a standard room. Hotel lobby is small, cute, but nothing fancy. I'm more used to chain hotels (think Sheraton, Westin, etc) and didn't come here for business so didn't need all those amenities. I've stayed at the Westin Paris at Place Vendome which was amazing - didn't want to spend on all the glitz this time. Just a quick 24 hour trip to Paris en route to Italy. Reception was always very nice - had to return the key each time upon entering and leaving hotel which I really hate. But it's common in Europe. More a safety concern which is why I think they ask you to leave your key when you leave the hotel. Teeny tiny elevator but enough for me and my bags. Room itself was on the top floor and was really cute. Bigger than I expected, and had a large bathroom, King bed (two twins pushed together which is typical in Europe) a writing desk, fridge, closet, and a little sofa. Cute view over the rooftops/courtyard. Bathroom was CLEAN. Room was CLEAN. While this hotel could certainly use an upgrade, and it would be a lovely boutique, the furnishings were somewhat simple/plain/dated. Though I cannot stress again how clean everything was. No gross spots, marks, stains, dust, cobwebs. So you don't have high end luxury furnishings but you have a good clean comfortable and rather spacious (for Paris) place to lay your head. My biggest grip (and always is in Paris/Europe) was the shower. This shower had the half-size glass shower 'curtain' that only covered half the length of the tub, so of course I got water everywhere. BUT at least there were plenty of good (and shockingly comfortable) towels to wipe up the water. :-) If you're here with your partner, husband, wife whatever this is an excellent cheaper option for a pleasant stay in a cute boutique hotel in the middle of the Marais. Again not the Ritz, but there was nothing lacking in my stay. Highly recommend this hotel!", "Date": "March 19, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Melbourne, Australia", "Title": "“Excellent, friendly hotel in the centre of Paris!”", "Author": "Rampantlad", "ReviewID": "UR98265907", "Content": "You really can't beat this location, at the end of the street from the Pompidou Centre, in the heart of the Marais, only a short walk to the Louvre, Notre Dame and Eiffel Tower. Friendly staff, excellent prices, cute roooms which are reasonably spacious for central Paris and ours had stable-like wooden beams.", "Date": "February 27, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Piacenza, Italy", "Title": "“The perfect location in Paris”", "Author": "stfn100", "ReviewID": "UR98128927", "Content": "The best location in Paris for sightseeing, shopping, clubbing and close to the fashionable district of Marais. You can almost walk anywhere but this charming hotel is also well served by public transport (metro and buses). Our room was spacious (but not enormous), clean, well appointed and very quiet even if it was facing the street side. Only drawbacks: a small cupboard and no safe in the room. I will definetely stay there again next time I'm in Paris.", "Date": "February 26, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Location": "5", "Rooms": "3"}, "AuthorLocation": "Sydney", "Title": "“A great value stay in Paris”", "Author": "SHANDREW", "ReviewID": "UR92147309", "Content": "Cute, ideally located boutique style hotel - literally 5 mins walk from Chatelet les halles metro stop. Rooms are a little small however spotlessly clean and very quiet. An added bonus was the ability to open the window for some fresh air and relief from central heating. Reasoonably priced and perfect for a short stay in Paris", "Date": "January 8, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Sleep Quality": "3", "Rooms": "2", "Location": "4"}, "AuthorLocation": "London", "Title": "“Another average hotel”", "Author": "AHolidayGuy", "ReviewID": "UR91560996", "Content": "This hotel is located 5 minutes walk from chatelet les halles - a major hub from where you can get trains to all parts of Paris. The precise location is a side road next to the Centre Georges Pompidou, which is a large museum and cultural centre which one should visit when in Paris. My room was very small, and the thing I found most frustrating was that there was only one socket in the whole room! This was frustrating as I was a business traveller with two laptops and two mobile phones that all needed charging. There was no bath in the bathroom, just a power shower. The hotel had a cosy feel, but if you're claustrophobic, then you might not want to stay here. The internet connection was of a decent quality. To sum up, I found this hotel to be an average hotel for the price I paid - nothing too special.", "Date": "January 3, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Denver, Colorado", "Title": "“Good location, nice rooms”", "Author": "PCsGirl", "ReviewID": "UR87252489", "Content": "My husband and I spent three nights at this hotel. It was a little difficult to locate - it sits on a small sidestreet and the entrance is not very clearly marked. However, we found it to be quiet and comfortable. It is conveniently located near a Metro stop and not far from the Seine. Overall, a pleasant little place to stay.", "Date": "November 16, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Providence, RI", "Title": "“What a Delight”", "Author": "myra327", "ReviewID": "UR86126015", "Content": "Sweet boutique Hotel a stone's throw from the Centre Pompidou. This hotel is quiet, clean, has lovely rooms with tile bathrooms, free wi-fi and use of computer in lobby. The help are unbelievably helpful from making reservations to giving suggestions and directions. The location is close to everything in the Maris and has the advantage of being close to the Pomidou as a reference point. Close to a few Metro stops, Notre Dame and the Seine. I can't say enough about this Hotel. It's really a gem.", "Date": "November 5, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "3", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Melbourne, Australia", "Title": "“Good value for top location”", "Author": "Camealongway", "ReviewID": "UR84582084", "Content": "Husband and I visited Paris for total of five days to enjoy the food, shopping and some sights. If you're looking for a 'foodie' area, boutique shopping and easy access to great sights, you cannot beat the Marais area. Proximity to Rambuteau and Hotel De Ville metros means journeys to other areas are quick and convenient. Hotel is located in relatively quiet side street directly behind Centre Pompidou so we enjoyed reasonable level of peace and quiet. Our double room faced inner courtyard which I would recommend. However room size is tiny (typical in Paris) and bed was only of average comfort. Shower pressure and temperature were good though. Importantly for us - the room and hotel were consistently clean. We were appreciative of the front desk staff who we found to be very helpful, accommodating and spoke good English. True they may not be the most smiley or chatty people, but we took this to be 'cultural' so we didn't take it personally. We would definitely stay here again given value for money and location. Warning: we used the airport transfer service from hotel to CDG. We were advised trip would take 1 hour. However, the car was 1/2 hour late to arrive plus the trip took 1.5 hours - a 2 hour trip in total. Lucky we did not miss our flight but we felt they should either have advised us of the delay so we could make alternative arrangements or they should have skipped the second guest pick-up which resulted in about a 30 minute detour.", "Date": "October 23, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Sleep Quality": "3", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Toronto, Canada", "Title": "“Excellent location, Lovely rooms”", "Author": "YYZer", "ReviewID": "UR82670855", "Content": "I stayed at the Hotel Beaubourg for 2 nights in late August with my husband and two daughters (in their 20s). We had two beautiful rooms that were spacious, comfortable and very clean. The location is excellent, walking distance from many attractions like Centre Pompidou, the Louvre, Notre Dame, etc. The only difficulty we had was finding street parking in the evening (parking is free in August).", "Date": "October 8, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Sleep Quality": "3", "Rooms": "2", "Location": "5"}, "AuthorLocation": "London", "Title": "“Amazing location but the decor is overwhelming”", "Author": "8lettersuk", "ReviewID": "UR81581873", "Content": "We've stayed in this hotel a couple of times now when in Paris. It's close le Marais and great tourist spots like le pompidou. It's relatively inexpensive although our big takeaway from this hotel is the rooms all seem very floral and way too co-ordinated for our tastes with bedspreads and wallpaper and curtains that match. Overall I'd recommend this hotel for it's location and price range.", "Date": "September 30, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "4.0", "Value": "3", "Sleep Quality": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Goteed1", "Title": "“Charming and comfortable”", "Author": "Goteed1", "ReviewID": "UR79711205", "Content": "Stayed here for 5 nights for my first visit to Paris and I was very happy with the choice. This was an easy walk from the Chatelet metro station even with a large rolling bag. Check in took all of about 60 seconds. I stayed in a large King Room on the 3rd floor that faced a courtyard. The room is dark, because of the low beamed ceilings and the dark fabric on the walls. Also the lighting seems to be low wattage as well. The King room had plenty of room plus the big bed which was a true king and not just two smaller beds pushed together. Because of the fabric on the walls, the room was very quiet. You could hear a pin drop at night. Bathroom was modern and well equipped. Also free wifi, which worked pretty well most of the time. A really nice perk. Maid service was very efficient (and friendly!) They all respected my Do not disturb sign (I usually slept really late!) AC worked fine, but most of the time just opening the window was fine. Front desk staff were friendly but did not offer a lot of suggestions for local bars and eateries etc. I tried the hotel breakfast one morning and it was fine. Also you need to leave the key at the desk when you leave every day which I loved because it was one less thing to lose. Even when I stumbled back to the hotel at the odd hour in the middle of the night there was no problem with the staff letting me in and getting the key. The location is very busy on weekends and even though there is ALOT going on in this area, did not notice any of it once I was tucked into my room. I was able to walk to the Louvre, Notre Dame, Luxembourg Gardens and even the Eiffel Tower from here. Highly recommend this hotel for any traveler coming to see Paris.", "Date": "September 15, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Perth, Australia", "Title": "“Hotel Beaubourg is a quiet, hidden treasure in a huge and bustling city.”", "Author": "emwarren", "ReviewID": "UR77762730", "Content": "Hotel Beaubourg in a quiet side street near the Pompidou Centre and just a short walk to the river and Notre Dame. There are many cafes and restaurants nearby and the bus (which also goes to Nord train station) is just around the corner. The hotel staff are very helpful and the hotel itself is charming. I took the advice of a previous tripadvisor review and asked for Room 4. It is very spacious with queen sized bed, great ensuite,lots of cupboards, a small table and two chairs. It is on the ground floor and has french doors leading to its own courtyard with outdoor table and chairs and nice little garden. Couldn't want for more. I think that the price is not too bad either for what we got compared to other Paris accommodation.", "Date": "September 1, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Ashford, Kent Uk", "Title": "“Great location, excellent value for money”", "Author": "dogbracket", "ReviewID": "UR76703837", "Content": "Loved the location of this hotel. You're bang in the middle of everything with 3 metro stations a few minutes away. Lots of excellent restaurants close by but sadly some were closed for holidays when we visited. Staff are friendly and accommodating and the rooms are spotless and as it's a very old and charming building, the rooms are quite dark. The only down side was the lack of garden. The hotel's web site promoted the garden as a feature and we were looking forward to a little green oasis. Sadly the builders were in, the garden was out of bounds, and we were disturbed by their early start on Monday morning. I would certainly go back there and hope to make use of the new garden on my next visit.", "Date": "August 24, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Oxford", "Title": "“This hotel is a great value, good location, clean and air conditioned.”", "Author": "HattieOxford", "ReviewID": "UR73919674", "Content": "This is a lovely little hotel with all of the essentials but no frills. It has free internet, air conditioning, average sized rooms with nice decor, very modern bathrooms and good service. They will provide transportation to the airport for a small fee. It is an easy walk from the train station and in a safe neighborhood.", "Date": "August 5, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "3", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Washington DC, District of Columbia", "Title": "“Great Service, nice Hotel”", "Author": "TravelSmile_10", "ReviewID": "UR71676008", "Content": "We really appreciate the older gentleman that welcomed us the evening that we arrived. He was very helpful, kind and took great care of all guests who arrived. We liked the room (a little dark on the bottom floor but still spacious, clean and nice). The location was great and we would stay here again. All in all, a wonderful welcome to Paris. Thank you!", "Date": "July 20, 2010"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "michigan", "Title": "“Lovely experience”", "Author": "cashmerequeen", "ReviewID": "UR71617494", "Content": "We had the pleasure of staying at the Hotel Beaubourg for 10 nights in July 2010. We were traveling with another couple, and they recommended this hotel as it was mentioned in a Rick Steves guide. It did not disappoint. The room was extremely clean and comfortable. The bathroom was very modern. It had a small fridge. It was very quiet, and the front desk staff was quite helpful. The breakfast each morning is kind of expensive--I would recommend eating elsewhere. We departed very early in the morning....and the gentleman at the front desk opened the breakfast room and made our coffee so we wouldn't have to go without. That was above and beyond. Overall a great experience. And....very close to the Rambateau metro stop (about 1/2 a block). Convenient to many attractions.", "Date": "July 20, 2010"}, {"Ratings": {"Cleanliness": "5", "Overall": "5.0", "Rooms": "4", "Service": "5"}, "AuthorLocation": "Brecksville,Oh", "Title": "“Our second stay and it lived up to prior...”", "Author": "KieranR", "ReviewID": "UR64793348", "Content": "Our second stay and it lived up to prior experience. Room 12 was a bit noiser. Breakfast in the room is such a treat. We hope to return.", "Date": "May 20, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "3.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "5"}, "AuthorLocation": "London", "Title": "“Fantastic location, cosy hotel”", "Author": "OnMyToes79", "ReviewID": "UR60623211", "Content": "This hotel was in a great location, nearby Metro & funky shops! Supermarket around the corner & fantastic shopping nearby. All major attractions are within walking distance too. The hotel facilities were great (includes free wi-fi access). The rooms were very small however and did not reflect what the website says. The website says the rooms are renovated yet the room we got looked nothing like any of the room shot images on there! It was a little disappointing. If you want a basic room, small shower/bathroom then this is fine. We were only disappointed because we were expecting a room like the website portrayed. The staff were friendly and helpful too.", "Date": "April 7, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Reserve, New Mexico", "Title": "“Comfortable and close to the action”", "Author": "jclaire_98", "ReviewID": "UR60252482", "Content": "We thoroughly enjoyed our stay at the Hotel Beaubourg. It is very clean, modern, and comfortable. The location is fabulous. It is across the street from the Pompideau Center (which is open until 9 PM). It is also close to wonderful shopping, great restaurants, and two jazz clubs. If you are looking for a large hotel with spacious rooms, look elsewhere. This is a small and charming hotel. The room we stayed in was not huge- but fine for us. The furnishings were beautiful. For the money we spent, we could not have been happier. The front desk staff is very helpful and responsive. They assisted us with locating tickets for an upcoming soccer (football) game.", "Date": "April 3, 2010"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Scandia, Minnesota", "Title": "“Lodging in Paris”", "Author": "katyafox", "ReviewID": "UR56322475", "Content": "Excellent small hotel within easy walking distance to Lourve, Notre Dame, and the Bobo.", "Date": "February 17, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Location": "4", "Rooms": "4"}, "AuthorLocation": "Australia", "Title": "“Good but not great”", "Author": "AusAdvisor123", "ReviewID": "UR50939143", "Content": "Located right near the modern art musem it is very close to the metro and we found the room to be clean and comfortable. Nothing comes cheap in Paris but we felt this was just a little bit too expensive. Make a move to the Marais district and get lost in the streets... lovely part of town.", "Date": "December 9, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Australia", "Title": "“A great hotel to end our trip!”", "Author": "Wen11", "ReviewID": "UR48387504", "Content": "Hotel Beauborg is in a great location in the Marais district. Minutes away from shops and great eateries, and so easy to get to via the Paris metro system. We loved Paris, this included staying at Hotel Beauborg. The staff were polite and courteous. They were kind enough to remind us of daylight saving when we returned to our hotel late at night. We had a room in the attic with our own private entrance. It was absolutely lovely. Very clean, and the bathroom was a good size. The only issue would be the shower height would be awkward for a tall person because of the slanted roof as we were up in the loft. Breakfast isn't included, but that wasn't a problem as there are numerous bakeries and cafes nearby. We really enjoyed our stay and I would definitely stay here again, if ever we are in Paris.", "Date": "November 3, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Location": "5", "Rooms": "3"}, "AuthorLocation": "Palm Springs, CA", "Title": "“Great location. Basic tourist hotel.”", "Author": "sxeight", "ReviewID": "UR48359781", "Content": "Super location tucked away on a relatively quiet lane very close to the Pompidou Centre. Metro 1.5 blocks away. Easy access to the Marais, Les Halles, Notre Dame and the Louvre. Basic European hotel. Typically stuffy (not much ventilation) European room. AC turned off during our stay because the weather got cooler; but the room still was stuffy. Nice beds. Decent breakfast; but they charge extra for it.", "Date": "November 2, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Chromo, Colorado", "Title": "“A great find and a wonderful value for Paris.”", "Author": "Pagosa", "ReviewID": "UR47647294", "Content": "We stayed for 6 nights in charming, spotlessly clean, wonderful room #4 with french doors on to a private terrace with plants, table & chairs. Fresh linens and towels every day. Our room was quiet and quite large with a brightly tiled modern bathroom, though be forewarned it has the typical glass European bathtub enclosure which only partially protects the floor from water when you use the shower. Helpful and polite staff. Great location. You can walk everywhere, and the Marais district is lively, has wonderful shops and cafes and even a terrific department store in the Hotel de Ville. Eat at Camile's restaurant in the area. We cannot say enough good things about this hotel and will definitely stay here again on our next trip to Paris.", "Date": "October 24, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Location": "4", "Rooms": "3"}, "AuthorLocation": "New York City, New York", "Title": "“Hotel near Pompidou Center”", "Author": "zachgam", "ReviewID": "UR47153266", "Content": "Location: On a quiet street neat the Pompidou Center. A short stroll to the heart of the Marais. Hotel: Decent size room. Large bathroom but water gets all over floor. Room decor dated and dark. It was 70 degree but when we asked about the air conditioning they said air is off because it was winter on September 29!! Staff: Front desk staff courteous but aloof, chamber maids helpful and friendly. Breakfast: We did not eat breakfast in the cellar but chose to get breakfast from the many bakeries in the area. Marais: Great location to be in in Paris. We particularly liked the restaurant in St Catherine's Square and neighborhood. All in all hotel was just okay but we were in PARIS.", "Date": "October 18, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Location": "5", "Rooms": "4"}, "AuthorLocation": "simonuineill", "Title": "“Great little find in the Marais”", "Author": "simonuineill", "ReviewID": "UR37603811", "Content": "We booked to stay here as our usual hotel was fully booked - but now I think we might stay here instead. From the first the staff were very friendly and helpful. Breakfast was lovely - and though we were very late down to breakfast, the staff couldn't have been more helpful. We chose a kingsize room and had the unexpected bonus of a nice outside terrace space (if you want the same ask for Chambre 4).", "Date": "August 13, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Montreal, Canada", "Title": "“gem in Paris”", "Author": "ECKM", "ReviewID": "UR36187237", "Content": "Hotel Beaubourg is a gem of a hotel situated very close to the Centre Pompidou. Our room (35) was fantastic: spacious, clean, very large bathroom and air conditioned. Dated a bit, but in superb condition. No complaints at all. Fantastic ! We have been to Paris many times, and will definately make this our hotel of choice for future trips back to Paris. The staff at the front desk were very nice and accomodating. Location was perfect. Walk to the Marais, Les Halles, Ile Saint Louis, basically anywhere. Metro stops are close by. Overall, very positive experience. We highly recommend this hotel. Note: We booked online as other people had suggested and payed a reduced rate.", "Date": "July 29, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Location": "4", "Rooms": "4"}, "AuthorLocation": "Oregon", "Title": "“Hotel Beaubourg”", "Author": "icetsarina52", "ReviewID": "UR34443184", "Content": "Lovely little hotel in good area. Close to Pompidou Centre, Notre Dame and the Latin Quarter. Metro access also very close and convenient. Rooms were clean and nicely appointed, we had a room that overlooked a little courtyard area which was very quiet.", "Date": "July 11, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Location": "5", "Rooms": "4"}, "AuthorLocation": "st. louis, missouri", "Title": "“Great Hotel. Quiet. Very clean”", "Author": "aebly", "ReviewID": "UR32923632", "Content": "Loved this hotel. Would definitely go back. Very clean room. Huge bathroom. Very quiet. Awesome location. Half block from Pompidou. We thought staff was friendly and helpful. He arrived early and we got into our room before the normal check in.", "Date": "June 22, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Location": "4", "Rooms": "5"}, "AuthorLocation": "London, Ontario", "Title": "“A Hidden Little Gem!”", "Author": "Percivas", "ReviewID": "UR32601544", "Content": "A small, friendly hotel in the heart of Paris. For the location, the price was very good. The rooms are small by North American standards, but by European standards they were very average-sized. Our room (11) was quaint, cute and impeccably clean. We had heard the French can be rude, but the staff here were very friendly and helpful even with our broken French. The service was great, and we loved our continental breakfast of fresh breads, juices and yogurts.", "Date": "June 18, 2009"}, {"Ratings": {"Service": "1", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Location": "4", "Rooms": "3"}, "AuthorLocation": "Scotland", "Title": "“Great location if you can put up with some of the extremely rude staff”", "Author": "bluepokadots", "ReviewID": "UR30544170", "Content": "The hotel was in a great location in a quiet street, while being really close to loads of places to eat and drink, and several metro lines. Our room was clean although we didn't seem to be able to control the air conditioning, resulting the room bring a bit stuffy. I wouldn't go back to this hotel however, as some of the staff were extremely rude. The cleaner on her morning round completely dis-regarded the 'do not disturb' sign on our door and barged in without even knocking!! Added to this is woman on reception was just downright rude, we did try and communicate in French during our stay, but the day we left and settled our bill she didn't as much as give us a 'thankyou or good-bye' (in French or English) infact she couldn't even raise a smile. I've never walked out of a hotel without the person on reception saying goodbye especially when you've just handed over a few hundred pounds! If there was a change of staff it would be a lovely place to stay, but I wouldn't go back until that happened.", "Date": "May 22, 2009"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "Cupertino, CA", "Title": "“WONDERFUL BOUTIQUE HOTEL-GREAT LOCATION TOO”", "Author": "RussellsCupertino_CA", "ReviewID": "UR29568225", "Content": "If you are looking for a charming, quiet, and quality yet value priced inn which has one of the best locations in Paris - this is it! It's on a quiet side street so no traffic noise. The building is virtually soundproof as it's original structure is 500 yrs old. There are many cafes and markets within one block, as well as Metro stations. Every staff member was friendly and very helpful. We were able to check in early which was a great relief to us after the overnight flight. We loved the easy access to the Left Bank, 10 minute maximum walk. It may take longer because you'll enjoy all of the people watching and views, including the plaza at the Hotel de Ville. My husband and I stayed here for 3 nights on the way to the Seychelles and would definitely stay here again.", "Date": "May 7, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Manchester, NJ", "Title": "“Super Location, Clean and Great Value!”", "Author": "lbischof", "ReviewID": "UR28211006", "Content": "My husband and I just spent 3 nights at this hotel- April 2009. Thanks to Trip Advisor participants, we were not disappointed. We stayed in room 22, which overlooks a small side street at the front of the hotel. The room itself was a good size considering most hotel rooms in Paris can be quite small. The private bathroom was newly finished and immaculate! The only downside to rm. 22 is that it can be rather noisy from the street. If you are a light sleeper, request a room in the back of the hotel. Breakfast is offered at 9 euros per person. This included fresh breads, yogurt, butter/jam and coffee. We added cheese for an extra 3 euros per person. We had breakfast the first morning at the hotel and although it was very nice, we went by the suggestion of other reviewers and ate at the local cafes within walking distance for the remainder of our stay. This proved to be more cost affective and fun! The location of this hotel is AMAZING! It's in the Marais section of Paris, which, is basically the heart of where everything is and walking distance to the major sites. There are 3 metro stops in close proximity. Chatalet, Rambuteau, Hotel De Ville. Also, we found ourselves going back to our hotel area to eat dinner because there are so many great Brasseries, which offer great food, casual dress, and very fair prices for super quality. Everything is open late and we found a nice mixture of tourists and locals. People in general are very nice and helpful. TRANSPORTATION TO AND FROM CDG USING PUBLIC TRANSPORTATION: We arrived using the RER Rail line from the airport. Follow signs in the airport reading \"GARE\" and/or \"RER.\" Depending on where you are in the airport, you may have to take a mini bus to the other terminal where the GARE is located. Have 9 Euros in change ready so you can purchase a train ticket from the machine, rather than stand in long lines to purchase. You will want to take the B3 RER line to Chatelet Les Halles. Get off on Chatelet Les Halles and the hotel is a 4 min. walk through some wonderful little streets. I mapped out walking directions using www.mappy.fr. This is a great website similar to our mapquest.com. Please note: If you use public transportation back to the aiport, ONLY TAKE THE B3 line. If you take the other line, you will end up in the suburbs of Paris and not at the airport. TRANSPORTATION USING AIRPORT SHUTTLE: On our way back to the airport, we asked concierge to hook us up with a shuttle bus. The cost is about 20 Euros per person and we found this to be worth the extra money as the shuttle drops you off directly to your terminal. Plan to leave a few hours earlier since the bus does pick up other folks from other hotels and Paris traffic is comparable to some of the heaviest traffic spots in the US. Pay in cash. I'm not sure if the shuttles take credit cards. Overall, the hotel is very clean and we found the service to be very good. Everyone speaks english, but it is well received when you attempt some basic french phrases out of respect. We will stay here again should we be so lucky to visit Paris in the future.", "Date": "April 17, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "4"}, "AuthorLocation": "New Orleans", "Title": "“Lots of charm for a good price”", "Author": "S_and_Bs_Mom", "ReviewID": "UR26881056", "Content": "Stayed at the Hotel Beaubourg in June 2006 and was very happy there. The staff were really pleasant and helpful; its location was really convenient; and the hotel itself is really charming. It was a great value in a fun arrondissement. I'd definitely stay there again.", "Date": "March 26, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "3.0", "Value": "3", "Location": "5", "Rooms": "3"}, "AuthorLocation": "Bristol, United Kingdom", "Title": "“Convenient Location”", "Author": "bernardharte", "ReviewID": "UR26799268", "Content": "As other reviewers have noted, the best thing about this hotel is its proximity - in a quiet side street - to both the Marais and Pompidou Centre. It's a few minutes walk to Rambuteau Métro station. We had the very dark Room 1 on the ground floor behind reception. The supposedly King bed was more like a Queen made from two singles joined together. The décor was typically French - matching print fabric on walls and curtains - but nothing to write home about. The bathroom was pretty large with good water pressure, although the shower overwhelmed the inadequate screen over the bath. I didn't sleep well. I don't think this was to do with the bed - which was comfortable enough and on the firm side - but with noise outside and above which was never constant, but sufficient to wake me. Next time I would ask for a room on a higher floor. Breakfast which was served in the cellar from 8am - 11am was at €9/person reasonable value for the usual continental selection of coffee/juice/bread/croissant/yoghourt. It was also available at no extra charge in the room.", "Date": "March 25, 2009"}, {"Ratings": {"Service": "2", "Cleanliness": "5", "Overall": "3.0", "Value": "3", "Location": "4", "Rooms": "2"}, "AuthorLocation": "Australia", "Title": "“Cosy hotel”", "Author": "sea2skyaus", "ReviewID": "UR26583005", "Content": "The hotel is located in Marais in Paris. It's close to several metro stations (Hotel De Ville is an interchange). It's located on a quiet street, but only 30 seconds walk to the main road and 3 minutes walk to the supermarket. It's next to the Pompidou Centre, and 10 minutes walk from Notre Dame. It's also close to many nice restaurants. The hotel room is very nicely decorated, clean, but incredibly small. The bed took up 50% of the space of the entire room. There is not much facility at this hotel other than nicely decorated rooms. There is wifi in the lobby. Overall it's a good hotel in its price range.", "Date": "March 21, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Business service (e.g., internet access)": "3", "Check in / front desk": "2", "Overall": "4.0", "Value": "3", "Rooms": "4", "Location": "4"}, "AuthorLocation": "New York City, New York", "Title": "“Would Definitely Stay Again (Despite a few things)”", "Author": "Roddy_Rod", "ReviewID": "UR23138923", "Content": "GREAT: I loved the location of this hotel, it was centrally located right in the center of Paris and it is very close to 3 different metro stations (Chatalet, Hotel de Ville and Rambateu). You can virtually get on almost any line from those stops which is great for sightseeing. Additionally, you can take the RER B train from Paris CDG and ORLY right into Chatalet Les Halles and walk to the hotel - its only about 5 minutes and is a straight shot. The hotel is small, but the rooms are decent size for Paris and the bathroom was very large for Paris standards. In addition there are tons of things open and going on around the hotel at all times, but it remains quiet inside. GOOD: Our rooms were clean and comfortable and really that is all the maters. They were also quiet and we really couldn't hear our neighbors. There are only 4 floors and 4 rooms per floor, keeps things simple. The room also had a mini fridge - which was nice to put water and other things in there. DISLIKED: The hotel advertised free wi-fi internet access and while it was free, it was only in the lobby which was a pain to always have to go down tot he lobby to use the internet, but it also gives a social outlet by meeting others in the lobby doing the same thing and since this hotel is in the Marais, the majority of the clientele when I was there, were of the same mind-set. Lastly, they also provide a safe, but it is with the front desk and not your room. COULD HAVE DONE WITHOUT: Honestly, everything was good, the one thing I could have done without was the attitude of a specific front desk person. I was told he was the son of the owners - otherwise the rest of the staff were great and helpful. The son just has a chip on his shoulder, so ignore it and don't take it personally.", "Date": "December 31, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "3", "Check in / front desk": "4", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "chicago", "Title": "“We Loved This Location And The Hotel!!!!!”", "Author": "jacknoc", "ReviewID": "UR23003782", "Content": "Clean room. Excellent location. Friendly staff. Great price. Would stay here again in a heartbeat. So many dining options in the area. Proximity to Pompidou Centre etc so great!!", "Date": "December 25, 2008"}, {"Ratings": {"Cleanliness": "4", "Business service (e.g., internet access)": "4", "Check in / front desk": "4", "Overall": "5.0", "Value": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "capistrano beach CA", "Title": "“Perfect Place in Paris for Us!”", "Author": "bioprof", "ReviewID": "UR20235720", "Content": "This hotel was just 1/4 block from the Pompidou. Makes it easy when you’re staying by such a visible landmark, as you just head that direction. 1 block from a minor Metro station, about 5 blocks from Hotel de Ville Metro stop. Our room is nice; #4, like we had seen discussed on TA. This is the room down a few stairs, and has a little patio/garden. The patio made the room just perfect; it was airy, bright, and cheery, surrounded by a patio with green plants, a table and chairs. The room is actually pretty roomy, and the bathroom was newly tiled, new fixtures etc. 2 closets, no drawers, but bed seemed firm. As usual, too few plugs, glad I brought my power strip + extension cord! There’s wireless internet available in a little lounge by the lobby, it’s slow, but works. They have a computer available, or use your own. We didn’t eat breakfast at the hotel; but there are bakeries within a block.", "Date": "September 20, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "3", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Australia", "Title": "“Great Stay”", "Author": "joannetAustralia", "ReviewID": "UR18561169", "Content": "Having spent tireless hours searching on the internet for accommodation in Paris that was value for money, in a good location, clean and had nice decor, Hotel Beaubourg was it! Some may say that the rooms were a bit small but we found them suitable. We were very close to public transport and easy walking distance from many sights. I thought the room we stayed in was charming and had a very parisian feel with the decorated wall paper, wooden beams on the ceiling and lovely flower pots on the window sills. The bathroom was modern and a decent size. We would definitely recommend this hotel to our friends!", "Date": "August 3, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "3", "Check in / front desk": "5", "Overall": "4.0", "Value": "4", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Dublin, Ireland", "Title": "“A bit disappointed with the room”", "Author": "Lordy", "ReviewID": "UR18460480", "Content": "On the plus side, this is a nice hotel which is very reasonably priced, has lovely staff and has a very convenient location (across from George Pompidou Centre - brilliant art gallery on the top floors). I didn’t use the breakfast room but did have breakfast delivered to my room and it was lovely (tea coffee juice, croissants and chocolat du pain). The one problem I would have is my room! We had no 2 which is accessed via a corridor running past the lift and a lovely courtyard garden. When we arrived, the back of the hotel where our room was appeared to be undergoing some renovations, and the carpet was covered in plastic which was a bit off putting. The room itself was small, as expected, with lovely beams and a decent size bed. I would also say the bathroom was very big by Parisian standards. However, while in the shower one morning I noticed I could see through the cracks in the ceiling to what I assume was the space between our floor and the next. This made me think of spiders falling on my head – a personal gripe, but there you go. The room was slightly below street level and as such was very dark. It had two good sized windows but even when open I still needed the lights on just to see into my suitcase which I had left beside the windows. Also, if people were sitting at the free internet computer in the hallway they could see in, and anyone wandering in the courtyard had could look right in, which was a bit off-putting as I was getting changed after a long day’s walking and sightseeing! So the curtains remained closed most of the time making the room even darker. All in all I got a very good rate on the hotel’s website in high season, and the location – walk to the Louvre, Notre Dame and many great restaurants and bars – is second to none. I think my expectations were higher based on previous reviews and travellers photos and I was a little disappointed. Note the plastic sheeting in the hall was removed and the plumber who came to measure our bathroom did so quietly and quickly, so I wouldn’t let this put me off staying there again, although I would request a different room next time!", "Date": "July 31, 2008"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Manchester uk", "Title": "“Excellent location in the 4th arrondissement!”", "Author": "Caroline2006", "ReviewID": "UR18078178", "Content": "This hotel is great value for money. It is centrally located with most of the main attractions within walking distance... e.g. Centre Pompideu, Notre Dame, The Louvre and the River Seine. Staff are very helpful when approached but generally left us alone which was refreshing. There were plenty of crepe venders in close proximity which my boyfriend loved... he had 6 in 5 days! During the winter months there is an ice skating rink outside the town hall which is also close by. Highly recommended hotel!", "Date": "July 20, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Check in / front desk": "4", "Overall": "4.0", "Value": "4", "Rooms": "5", "Location": "2"}, "AuthorLocation": "West Palm Beach, Florida", "Title": "“Loved the hotel, but not the neighborhood”", "Author": "keylimejet", "ReviewID": "UR17804694", "Content": "This is a great little hotel. Our room had wood beam ceilings and blue and yellow toile on the walls - very French and quaint. The bed was comfortable, and the bathroom was modern and clean. There was free internet access in the lobby, and the front desk people were pleasant and helpful. There is a lift, and A/C, both of which were quite welcome by this point of our trip! Really, we liked everything about the hotel except the neighborhood. The streets and sidewalks were literally covered with trash - a lot of it. We walked all over central Paris, and didn't find this anywhere else, including in the more easterly part of the Marais. It was kind of odd - maybe there was something unusual going on while we were there? We'll probably try a different neighborhood next time.", "Date": "July 12, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "San Francisco", "Title": "“Small and Perfect”", "Author": "WilliamCSanFran", "ReviewID": "UR16780320", "Content": "What a perfect and perfectly inexpensive place to stay in Paris. The hotel is small, but attractive and well-maintained on a very quiet alley-like street across from the Pompidu Center. The place has character and lies on the border between the Marais (old, beautiful buildings, artsy shops, gay bars, great resaurants, Jewish quarter) and the Beaubourg (hip, young, trendy, amazing food from all over the world). It's about a ten minute stroll from the Notre Dame and the wonderful neighborhood that surrounds it. The staff were helpful, kind, professional and very patient with our stuttering French. When we couldn't locate a street on our sad excuse for a map, the desk clerk drew us one, including landmarks, directing us to precisely where we wanted to go. The bed was a \"real\" queen size (not two twins pushed together) and very comfortable. The room had a window looking out onto a pretty courtyard. We don't bring a computer or watch television while travelling, so it not being tech-evolved (as some have mentioned in other reviews) was no bother at all to us. We most certainly plan to return to this quiet, quaint and perfectly located little hotel.", "Date": "June 8, 2008"}, {"Ratings": {"Cleanliness": "4", "Business service (e.g., internet access)": "4", "Check in / front desk": "4", "Overall": "4.0", "Value": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Riga, Latvia", "Title": "“Great king size rooms”", "Author": "Kasparainens", "ReviewID": "UR16457847", "Content": "Were booking the king-size room, so can comment on it only: ir was room 02, located somehow in basement, but well worth it: the small windows were on the garden, room freshly renovated and large for Parisian standards. Reception small but pleasant, presonell friendly and English speaking. The location is very central, next to Centre Goeorges Pompidou, plenty of options also for the breakfast around (did not try the hotels continental offer for EUR 9,-). Good choce in Paris (if you can get one of few king-size rooms :) )", "Date": "May 28, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "2", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "London, United Kingdom", "Title": "“Great little hotel”", "Author": "garrad", "ReviewID": "UR15697130", "Content": "Hotel Beaubourg is a great little hotel in a great location. The rooms are quiet and we had a slightly larger double room. We noticed from looking in another room that there are two sizes of double rooms. The bathrooms have a great amount of space. We were actually surprised by the good amount of space in the rooms, given that Paris isn't known for large rooms. Breakfast was substantial and it is possible to have additional items for breakfast such as eggs. I was a bit surprised that orange juice is charged separately. My only disappointment was that wifi was not available throughout the hotel, but there is free internet on a computer near the lobby. I would definitely recommend this hotel in this price range.", "Date": "May 6, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "4", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Houston, Texas", "Title": "“Great value, and excellant location!”", "Author": "Grnwayrob", "ReviewID": "UR15284697", "Content": "We stayed 5 nights at the Hotel Beaubourg this April. After seeing reviews of this hotel on Eurocheapo, I booked a superior room thought the hotel website several months in advance at what I felt was an excellent price. Upon arrival, we were given the key to room #4. It is on the ground floor. Having been in some really shoebox rooms in Europe, we were delighted to open the door and see we had been given a room that was quite large by Paris standards, around 12'x16', had a large batroom, and best of all, it's own private courtyard accessable by French doors. The patio is truly private, as no windows overlook it. It was very nice to come home from a long day of sightseeing and have a drink and snacks (that we purchased at the nearby convience store) on our patio! The room itself was nicely decorated, and had a minibar, flat panel television, individually controlled thermostat, and a queen bed. It does not however have an in-room safe. The hotel itself is spotlessly clean, has a nice small lobby with French and English language newspapers, a computer terminal for guests, and most of the front desk staff was nice and helpful. Be aware though, that a local call brings you a charge of 2.20 Euros! As others have said, the location is very convienent for sightseeing, about a 10 minute walk to Notre Dame, maybe 15 minutes to the Louvre, and the Rambateau metro station is literally 3 minutes from the front door. We loved staying in the Marais, with it's nice variety of cafes, bistros, boutiques, and small museums. Try Patisserie LeGay Choc for wonderful croissants on Rue St. Croix de Brettonaire in the morning! Also, Cafe Trois Chinon was a great place to have a glass of beer or wine after a long day out. Would gladly stay at this hotel again!", "Date": "April 23, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Business service (e.g., internet access)": "3", "Check in / front desk": "4", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "London", "Title": "“A cut-price gem of a hotel”", "Author": "dancemonkey", "ReviewID": "UR15237390", "Content": "Budget Paris hotels can really be hit and miss. I found Hotel Beaubourg on travelintelligence.com and thought it was worth a try. The booking was made through booking.com and we had no problems at all. Check in was easy and they actually allowed us to check in early at 10.30am on a Sunday morning, which was great considering it is a small hotel. As for the room, it was clean, recently (and tastefully) renovated and very large (another bonus in Paris). It had cable TV, a mini bar and a decent sized bathroom with a good shower (again, another bonus for Paris). The one downside of the room was the bed, while comfortable it was a bit soft for my liking. The hotel has a fantastic Marais location and is within three minutes walking distance to the Metro. All for 130 Euros per night, very good value. Breakfast was an additional cost, but with so many great places located within an easy walk of the hotel, we didn't try it.", "Date": "April 22, 2008"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Check in / front desk": "3", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Lake in the Hills, IL", "Title": "“Fine place to stay”", "Author": "wineglobelovers", "ReviewID": "UR14817099", "Content": "We arrived anticipating pretty much the same experience as we had read in the reviews - decent rooms, good location, stern woman at the front desk - we got all of those. All was good - room was clean, located in a quiet little side street, easy access to metro, quick shot to both North and East rail stations. All in all, would recommend based on price, location, and rooms. The woman at the front desk grows on you too.", "Date": "April 5, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "4", "Check in / front desk": "5", "Overall": "5.0", "Rooms": "5", "Location": "5"}, "AuthorLocation": "bruxelles", "Title": "“Fabuleux like Paris”", "Author": "chana12", "ReviewID": "UR14406031", "Content": "İt' s not my first time at Hotel Beaubourg and more i know Paris more i grow to like this place.İt's comfortable,easy going stuff,large rooms considering the average size in paris and most importantly its a 10 meters away from centre beaubourg and all the nice coffees there. The prices are more than convenient, it is definitly a good place to start falling in love with Paris.", "Date": "March 20, 2008"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Business service (e.g., internet access)": "4", "Check in / front desk": "4", "Overall": "4.0", "Value": "4", "Rooms": "5", "Location": "3"}, "AuthorLocation": "Buffalo, New York", "Title": "“Pleasant and Comfortable”", "Author": "ciska56", "ReviewID": "UR12986630", "Content": "We had a lovely stay at Hotel Beaubourg. We stayed in a king size room, that had a plush double bed. Very high ceilings made the room feel big. Nice sized bath, but strange set-up for the shower causes water to go everywhere in the bathroom. Put towels on the floor before you hop in. Also the lights in the hallways and stairs turn off after a few minutes so you end up groping around in the dark for the light switch so you can find your way to your room. Room had mini-fridge and huge windows that opened into a little courtyard. There was a cafeteria downstairs but we never used it. The free internet access and computer in the lobby was a real perk. Location was great, we walked everywhere we needed to go but metro stop just across street too. Front desk staff was friendly and helpful. I was very satisfied with my stay.", "Date": "January 25, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Business service (e.g., internet access)": "4", "Check in / front desk": "4", "Overall": "5.0", "Value": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Brisbane", "Title": "“Great Hotel, Perfect Location”", "Author": "Jetboy787", "ReviewID": "UR12630890", "Content": "This is a great hotel. Fantastic location 5 min walk to Notre Dame, on the edge of the Marais. It is only a 5 min walk from the RER at Les Halles so connecting from CDG is no problem. It is just near the Georges Pomidiou Centre and very handy for great shops bars and restaurants in the Marais. Rooms were reasonable size for Paris, nicley decorated and the bathrooms were recently removated and very clean. Staff were plesant and helpful. We will stay again at Hotel Beaubourg!", "Date": "January 15, 2008"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Business service (e.g., internet access)": "4", "Check in / front desk": "4", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Llandysul, United Kingdom", "Title": "“Nice little hotel.”", "Author": "ST", "ReviewID": "UR12267849", "Content": "Stayed for 4 nights over new year, and overall I was impressed by this hotel. As I had not booked the hotel myself I was a bit wary, but my fears proved unfounded. It is in a superb location very close to the centre of the city. The rooms are on the small side, but tolerable. Some of the bathrooms seem to have been renovated and are very nice - ours hadn't and had only a shower and was a bit dated. My only complaint is the sweaty beds - not sure that waterproof mattress covers are really acceptable in hotels! In spite of this the hotel offers good value and I would consider staying here again.", "Date": "January 2, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Business service (e.g., internet access)": "4", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Halifax, Nova Scotia", "Title": "“Great Location at a Reasonable Price”", "Author": "CdnTravellerNS", "ReviewID": "UR10918160", "Content": "We stayed at the Hotel Beaubourg for 7 nights and found it lovely. Yes, the room was small, but by no means tiny. The bathroom was large and modern and the hotel was very clean. The staff was friendly and courteous and were quick to grant any request. The property is centrally located and was a great \"home base\" for our first trip to Paris. We would definately stay again.", "Date": "November 19, 2007"}, {"Ratings": {"Cleanliness": "2", "Business service (e.g., internet access)": "2", "Check in / front desk": "2", "Overall": "2.0", "Value": "2", "Rooms": "1", "Location": "4"}, "AuthorLocation": "London", "Title": "“Paris must have better than this!”", "Author": "ngman", "ReviewID": "UR10845464", "Content": "Do not believe this hotel's website - the pictures of nicely furnished rooms with interesting and quirky furniture don't seem to exist - instead, you get a room not much bigger than the length and width of a double bed and little else. And the bed was super uncomfortable - if there was enough space on the floor, it would have been more comfortable! Paris may not be blessed with many decent hotels in this price range, but I'm sure there are others that are better. Incidentally, booking via the web incurs a minimum €5 commission charge - you're better off calling the hotel direct.", "Date": "November 15, 2007"}, {"Ratings": {"Service": "3", "Cleanliness": "2", "Check in / front desk": "3", "Overall": "2.0", "Rooms": "1", "Location": "4"}, "AuthorLocation": "london", "Title": "“sweaty beds - eek!”", "Author": "banana98", "ReviewID": "UR10637707", "Content": "This hotel was below average - was disappointed with the size of the room (the phrase \"swing a cat\" springs to mind) and the bed was tiny compared to the photos on the website. It was also a very uncomfortable bed and my boyfriend came back with a bad back. They seemed to have some sort of plastic sheeting on the bed which made me wake up in the night in a cold sweat - it was just a bit of an unpleasant experience, and given that I was on holiday, not ideal from the point of view of relaxing. On the plus side, it was a quiet room behind the courtyard (spoiled slightly by other guests shouting and screaming in the middle of the night which the hotel staff either didn't know or care about) but I think that generally, the hotel does not live up to expectations. Would not go back.", "Date": "November 6, 2007"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Business service (e.g., internet access)": "3", "Check in / front desk": "5", "Overall": "4.0", "Value": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Normal, Illinois", "Title": "“Great stay at the Hotel Beaubourg”", "Author": "NancyJE", "ReviewID": "UR10294183", "Content": "The staff were very friendly and helpful. The location could not have been better. We will definitely stay here on our next visit to Paris.", "Date": "October 24, 2007"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Check in / front desk": "4", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Saint Albans, Vermont", "Title": "“6th time in Paris was a HIT !”", "Author": "SnakeCityGirl", "ReviewID": "UR10066035", "Content": "Stayed 9/29-10/2/07: All staff were outgoing, friendly & helpful (except 1 weekday counter lady who had the normal Parisian reserve). Being on the edge of the Marais was different and we found it to be a great location, very handy to all the main sights of Paris. We got to more places on foot with less Metro than when staying on the Right Bank. The room was nice but we did have a hard time figuring out the AC remote control so we opened the windows at night to cool off and that was fine if a tiny bit noisy in the AM (we should have asked the staff for help w/ the AC but we didn't; if we'd stayed longer we would have). HINTS: After 6 visits spread over 25 years we heartily recommend you get an RER/Metro/Bus pass for the duration of your stay as soon as you arrive at CDG or Orly and it will save you lots of money & stress getting around. Also we traditionally take the Bateau Mouches each visti but this time we got a 2 day pass for the BatoBus and we found it to be almost as useful as the Metro pass and lots more fun going up & down the Sienne to shop & visit the sights.", "Date": "October 11, 2007"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Check in / front desk": "3", "Overall": "4.0", "Value": "4", "Rooms": "3", "Location": "4"}, "AuthorLocation": "UK", "Title": "“good value for money”", "Author": "UkCarver", "ReviewID": "UR8820745", "Content": "Nothing fancy but this hotel is well-located on the Marais side of the Pompidou Centre. Rooms are a reasonable size for the price and bathrooms look like they have been recently refurbished. Although not our style, some people might go for the beamed ceilings. With comfortable rooms, the prices are good for the location, size and standard (especially if you want AC). Recommended. Try Pain de Sucre on nearby Rue Rambuteau for exquisite and cutting-edge patisserie.", "Date": "September 19, 2007"}, {"Ratings": {"Check in / front desk": "1", "Overall": "1.0"}, "AuthorLocation": "Cologne", "Title": "“Overbooked and impertinent staff”", "Author": "Urmel66", "ReviewID": "UR8612856", "Content": "Having booked well in advance, we were informed upon arrival that they had an IT problem and lost a few reservations - including ours. Funny enough, we have seen our confirmation eMail in the receptionist's documents, so we are absolutely sure that this was just a daft attempt to distract from the fact that the hotel was simply overbooked. They offered accomodation in another hotel, \"very nice and just around the corner\". As we had never heard or read anything about this other hotel (\"Hotel Vieux Marais\"), we insisted on inspecting it and its rooms, at first. The receptionist told us that we would have to pay the first night at Hotel Beaubourg by signing the credit card receipt issued as security deposit (Hotel Beaubourg will clear with the other hotel) and that we will only have to pay the second night in the alternative hotel. When we refused to sign the credit card receipt before having seen the hotel, the receptionist was extremely impertinant, using swearwords and tried to intimidate us. After a rough discussion, we left our luggage in Hotel Beaubourg and went off to see \"Hotel Vieux Marais\". What the receptionist described as \"nice and clean\" was a 2-star-hotel (Hotel Beaubourg has 3 stars!) with an ugly reception, run-down lift and awful rooms - all in all not worth half of the money we were asked to pay! After having returned to Hotel Beaubourg, we told the receptionist that we are not going to change from 2- to 3-star and he suddenly began calling other hotels in the area. We agreed on changing to another 3-star hotel (Hotel Bretonnerie) which we knew from our other trips to Paris and which is comparable to Hotel Beaubourg. All in all, we had a great stay at a nice hotel with friendly staff, but we will never book at Hotel Beaubourg, again! Overbooking, rude staff and an attempt to shift us off to a much cheaper hotel at the same price (and probably keeping the difference) is not a good way to attract future guests!", "Date": "September 3, 2007"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "4", "Overall": "5.0", "Value": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Wokingham, United Kingdom", "Title": "“Excellent Location”", "Author": "Sapphire22", "ReviewID": "UR8470731", "Content": "We wanted to stay at a clean and reasonably priced hotel in the Marais district and this hotel met all our expectations. The Beaubourg is well located behind the Centre Georges Pompidou on a short one way side street (a bit challenging to get to if driving) near a Metro station. We had requested a quiet room with a bath and shower and our room overlooked the courtyard and the (very narrow) bathroom had a small shower stall and full sized bath tub. The room was small by North American standards, but very typical of Parisian hotels in this price category. The air conditioning was quiet and efficient and very welcome in Paris in August. The room and the entire hotel were spotlessly clean and the lobby offered an English language paper on the weekend. The hotel breakfast was adequate, but we enjoyed going out to a cafe to sit outside with our coffee and pain au chocolat. The front desk staff seemed to change on a daily basis, but our check in and out and any requests were handled in an efficient manner. We would be happy to stay here again.", "Date": "August 22, 2007"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "mrsjlo", "Title": "“LOVE IT, Fabulous hotel, just great!!”", "Author": "mrsjlo", "ReviewID": "UR8392985", "Content": "This was a great hotel, and a great way to end our trip in Europe. the location was awesome and I am so glad we stayed here. Will definitely return. Room number 7 was great, clean, cute and at a good price. LOVED IT!!", "Date": "August 11, 2007"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Check in / front desk": "2", "Overall": "3.0", "Value": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "london", "Title": "“Safe bet”", "Author": "holiday_lover79", "ReviewID": "UR8252632", "Content": "The hotel is in a great location, very central to everything. Rooms are nice and spacious and tastefully done. All in, just what you need for not too high a price. Little disorganised when checking in and out and someone decided to cut some tiles outside our hotel room at 9am but overall, good for a traveller on a budget who wants decent standards", "Date": "July 29, 2007"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Business service (e.g., internet access)": "3", "Check in / front desk": "4", "Overall": "4.0", "Value": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Washington DC", "Title": "“Ideal place, I will go back”", "Author": "OnurWashingtonDC", "ReviewID": "UR8238585", "Content": "As someone who has had his fare share of small Paris hotels, I wasn't expecting this hotel to be as clean, well situated and comfortable as it was. My bathroom was very spacious and clean, the room had flat screen tv, a full length mirror and A/C that actually worked. All these are things most Paris hotels at this rate lack. The street is also very quiet, so I could open my windows at night and sleep. The location is great, its a simple walk to Notre Dame, The Louvre, and Le Marais. There are cute breakfast places around and you can take bus # 38 right across the street to go to St Michel or St Germain des Pres. Le Marais is gay central of Paris, so this is particularly advantageous for gay travellers, though not exclusively for them (majority of guests at the hotel when I was there were straight couples). I will go back to this hotel, and would recommend it for others.", "Date": "July 26, 2007"}, {"Ratings": {"Cleanliness": "5", "Check in / front desk": "5", "Overall": "4.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "The Netherlands", "Title": "“No complaints”", "Author": "shortlette", "ReviewID": "UR6165224", "Content": "We had a lovely stay - the location is excellent, and the centre pompidou certainly makes a great landmark for finding one's way. Booked our room early, so got a king double for the price of a double. It was nice to have some extra space. We were facing the street, but had no problems with noise. We found the staff helpful and happy to give recommendations for dinner. Unfortunately we had to eat early, because we were going to the Rugby, so neither restaurant was open. The menu's looked fantastic though! I'd be happy to stay here again!", "Date": "November 22, 2006"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Business service (e.g., internet access)": "4", "Check in / front desk": "4", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Chesterfield", "Title": "“Great location”", "Author": "Maryios", "ReviewID": "UR6089940", "Content": "The hotel is in a great spot next to Pompidou Centre, which means it is easy to find and within 1 min of a Metro stop. We stayed in room 25 which faced onto a courtyard and was extremely quiet. The room was big, by Paris standards, and the bathroom was great-modern shower over the bath and all very clean. The down sides of the hotel- the bed was a bit soft for my liking and there was no safe in the room. Didn't have breakfast as loads of cafes and bakeries nearby. The location is ideal as you can walk to the Louvre within 10 mins or so and, if you feel fit, all the way to the Eiffel Tower (took us around 1 hour, walking slowly). The staff are helpful and let us leave our luggage after we checked out and the hotel is easy to get to from CDG airport-just use RER Line B to Chalet and then hop on Line 14 to Rambateau (1 min from hotel). Room was 120 euro through venere and was ideal for a sightseeing holiday.", "Date": "November 9, 2006"}], "HotelInfo": {"Name": "Hotel Beaubourg", "HotelURL": "/ShowUserReviews-g187147-d242971-Reviews-Hotel_Beaubourg-Paris_Ile_de_France.html", "Price": "$172 - $185*", "Address": "<address class=\"addressReset\"> <span rel=\"v:address\"> <span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">11, rue Simon-Le-Franc</span> | <span class=\"extended-address\">04 Arr.</span>, <span class=\"locality\"><span property=\"v:postal-code\">75004</span> <span property=\"v:locality\">Paris</span></span>, <span class=\"country-name\" property=\"v:country-name\">France</span> </span> </span> </address>", "HotelID": "2514749", "ImgURL": "http://media-cdn.tripadvisor.com/media/photo-s/02/1f/3d/36/suite-junior-deluxe-terasse.jpg"}}