{"Reviews": [{"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "1"}, "AuthorLocation": "London, United Kingdom", "Title": "“dont bother go there”", "Author": "leoniesilva", "ReviewID": "UR125993965", "Content": "the place was filthy 1. Dirty towels 2. Dirty bed sheets 3. Broken telephone 4. Several other visitors always complaining 5. Run down dirty apartment 6. Broken AC which was also not fixed 7.construction work in next door apartment which we were not informed about. This started from 8am, meaning we did not get much rest. This work will continue until may 2012. Staff indicated that these are ongoing problems and therefore there will be several unsatisfied customers.", "Date": "March 12, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "2", "Overall": "4.0", "Value": "4", "Sleep Quality": "3", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Playa del Carmen, Mexico", "Title": "“Woogo Central Park : go for the location, fight for a good unit.”", "Author": "Barrio-Management", "ReviewID": "UR124832919", "Content": "It is my first option in New York for location, first of all, and rates. I love the area and I take use the red line (1,2,3) and get everywhere in minutes from the 72nd stop. Units come with a furnished kitchen, tv, and private bathroom, so you can shop at Trader Joe's, Faraway or even Zabars' and keep hundreds of dlls in your pocket if you want to cook and relax at home, or even have a great deal at Gray's Papaya ¨(check the recession special...): but if you shop and don't look at prices, you could even spend more than ina restaurant when going for cheese, import food, etc. Close to Central Park and Broadway, what else do you need? A good room : this is when you have to start a decent fight with the person in charge and try to give a look at as many units as possible till you won't recognize the unit as shown in the pictures. They will also ask a 100 Usd deposit , charged at your credit card upon arrival but canceled when you alredy left (I dind't like it) , and will take a copy of your credit card and your Id (I didn't like!). But charges have been as agreed. All together, I would recommend it when booking via their website.", "Date": "February 19, 2012"}, {"Ratings": {"Overall": "1.0", "Rooms": "1", "Location": "5"}, "AuthorLocation": "Anaheim, California", "Title": "“Stay away from Woogo”", "Author": "Xeniaarce", "ReviewID": "UR123893234", "Content": "Let me start by saying this was an amazing trip especially being from Orange County CA, it's a great city, very different from our hometown. My boyfriend and I decided to spend 4 nights and 5 days at Woogo and for the price why not? The only thing I found great about Woogo was the location. It was very close to central park and times square not to mention in a safe area. now where do I begin with my bad review.. First of all the people in the front desk on the first floor are very unfriendly when u go in to the check in the office is a dump. The elevators are pretty old then just when u think the worst is over you walk into your room and find the windows don't close, there is a very bad smell in the sheets the restroom is small and dirty, no cable, the towels are so rough and tiny as if they were meant for children, u never see an employee so good luck getting new towels or room service. And if you are not convinced yet we had bites all over most likely bed bug bites we were itchy through out the day and night. Stay away", "Date": "January 31, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Provincetown, Massachusetts", "Title": "“Fantastic location, bare bones amenities in this upper West side apt.”", "Author": "Ptowngirl1616", "ReviewID": "UR123465714", "Content": "If you have low expectations in the dorm apt. furniture, iron, but no ironing board, flat screen TV but no remote, heater, but 'it don't work', toilet paper, but only a half roll, a 2 burner stove and only 1 of the 2 burners works....if this doesn't bother you, you'll be fine! The location can't be beat-lots of great restaurants and shops around, Metro a block away.....and it's cheap! Try it once, then treat yourself to a nicer place the next time.", "Date": "January 22, 2012"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Toronto, Canada", "Title": "“Bad service but this has the basic essentials”", "Author": "dinh-traveler", "ReviewID": "UR121602888", "Content": "where do i start? I'll start with the pros first, the list is shorter but honest: This an apartment suite with basic essentials. Two girlfriends and I shared a bedroom bachelor room with a pull-out sofa. It has a simple kitchen with all the Ikea dishware and utensils. Simple hot stove with microwave and working mini-fridge. I was impressed with how clean the bathroom was. There is decent closet as well for your coats and shoes. Plenty of clean sheets/materials and drawers for yoru clothes. Everything is clean enough and it's perfect when you're on a budget vacation. It is right by one of the subway stations on the upper west side. Location is perfect to get to anywhere you need. I love this location because it is right by central park and this area is clean, convenient and quiet. We personally wanted to stay around from the busiest parts of nyc and we didnt mind a bit of travel. Taxis are always available around this area including plenty of places to eat. Anything you need or want you must ask for yourself or go to the main office directly on the second floor. The front door/foyer is wonderful and it's a nice small place to hang out if needed. Now, for some reason, our room had a difficult heater/ac. Perhaps the previous tenants messed it up or it has not be looked at in a while. A repair man did come up to our room to try & fix it but he said it would not be an easy fix. Other rooms were filled so we just HAD to deal with it for the rest of our trip. Luckily, we were outside throughout our entire trip and the ac still worked. the only problem was that it was noisy and the earplugs didnt help with the sleep. They usually have enough essentials and they are usually quite polite and respectful. It's only their services that need work. Any little thing you need, whether it's toilet paper or towels, you must go to them directly. anything we asked for we had to ask twice, especially if it was over the phone. would i come back? Not to this particular place. I would look somewhere else a bit cheaper or with better services. This is not a hotel so i had no big expectations. The location is truly fantastic in my opinion and that completely made my trip comfortable.", "Date": "December 10, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "2", "Overall": "2.0", "Value": "2", "Sleep Quality": "2", "Rooms": "1", "Location": "3"}, "AuthorLocation": "Kitchener, Ontario, Canada", "Title": "“awful But we had fun anyway”", "Author": "Jim B", "ReviewID": "UR120624535", "Content": "A friend from work and I went to NYC for a get away. The booked the Woogo Tempo because it was close to the park and I like the Upper West Side. I paid extra for a bigger room, and when we got there they were sold out of the bigger rooms, even though I paid in advance, we were stuck two guys having to share a double bed. Our view was great of the Ansoma building a huge Gothic amazing upper scale condo stucture next door, which hosted Continetal Baths years ago in the cellar ) ok the Better Midler/ Barry Mandilow thing sorry.) So with our tiny room with a dirty microwave and tiny sink pending to be the \"kitchenette\" we managed. The computer access box did not work even though we also were charged for it.The bathroom was small, needed an upgrade, and there was no room to even walk around the bed, it was really bad. IT was a neck stain to watch the tv which loomed ontop of a shabby high top dresser a foot from the side of the bed. You litterary had to exit the bed out of the end not the side!Our luggage was stored until check in , thrown in a closet with everyone elses bags, no tags or tickets, just which one is Yours! wow. very nervous. An elevator that was in need of repair, and all of the customers were complaining about everything. We laughed it off, but I really should have booked something else. I was embarrassed I was hosting my friend's first trip to NYC! my gosh. The subway was right outside our door feel the shake, and Central Park we could walk to, but it was a very dark lit street at night, and the staff changed shifts so much, no one knew that we were actually guests. No security to speak of, anyone could have just walked in. It was not that cheap either, I have since found other hotels that are much better. They have gone through a bit of a reno, when we were there there was drilling and scaffolding all up the front of the building and stairs. They could have given us something for inconvienace, but they Really did not seem to care or even speak English. Not even a smile, and it seemed if you had a question at the desk, they were eating something and ignored you. Not impressed. The lobby decor was also hiddeous, even my unwordly friend laughed at it. WE did see a couple shows and rented bycyles in the park, and enjoyed spring. I did not like this Hotel.", "Date": "November 15, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Sleep Quality": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Chicago", "Title": "“Hard to find a bargain in Manhattan”", "Author": "caratstone", "ReviewID": "UR120529643", "Content": "This is an older property, but served my purpose. Needed this area, and the location at Broadway and 73rd can't be beat. Close to shops, food, and subway. I was with another couple so room became reasonably priced when we split the cost. We were able to get a 1 bedroom rate on a two bedroom apartment. They only have a few of these (with no sitting area) which is better than taking a normal 1 bedroom with pullout couch in living area. The two bedrooms each had TV. Kitchenette was helpful. Couldn't check in till 3 which was annoying, but we could leave our bags. On check out told them we need to leave our bags for about 2 hours, and they wanted $5 each...I complained and they let us just leave them. Not luxury, but would likely stay there again. Note that the name of the \"hotel\" is not listed outside, so when you pull up to the address it can be very confusing. You go in, find the elevator and take it to the 2nd floor room that serves as check-in/office.", "Date": "November 13, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Lucerne, Switzerland", "Title": "“Good place”", "Author": "Johann M", "ReviewID": "UR120379344", "Content": "The place is very good situated. You have direct connection to the subway, where all the main lines stop. The room was clean and quite. The staff was friendly and the sourrounding area was safe. The price was too high, but to this time was the New York Marathon, where all other prices were high as well. Close to the appartement is a store called \"Trader Joe\" where you can find your food for a good price. Dont expect, that the stuff is cleaning your room every day, but our room was clean and everything worked well.", "Date": "November 9, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Sleep Quality": "3", "Rooms": "2", "Location": "5"}, "AuthorLocation": "budapest", "Title": "“Do not go there”", "Author": "marianna g", "ReviewID": "UR118686586", "Content": "We spent a week at Woogo. When we arrived late at night, we had to wait at the reception for about 30 minutes just to get our key. We were up on the 16th floor. We had a fully equipped kitchen, two chairs but no table! How were we expected to eat our breakfast i do not know. Are tables so expensive in America? Otherwise they were quite helpful and nice except for our pre-booked taxi by them to JFK which cost us much more than we thought. I would not go there again.", "Date": "September 28, 2011"}, {"Ratings": {"Cleanliness": "1", "Sleep Quality": "1", "Overall": "1.0", "Value": "1", "Service": "1"}, "AuthorLocation": "New York City, New York", "Title": "“Stay away from Woogo!”", "Author": "Nicolas G", "ReviewID": "UR116864787", "Content": "Woogo is probably the worst Apartment Rental agency ever. My friends booked an apartment with them in August 2011. I had to call twice to get a written confirmation from the agency, and when they finally decided to send it, neither the number of nights nor the way to get the keys was mentioned on it. During their stay, we were informed that Woogo had only paid 5 nights to the owner (although my friends had paid 9 nights in advance) and that they were illegal occupants. And I don't even mention the dirty bathroom, the windows that do not close, etc. A real dump! Beware of Woogo!", "Date": "August 17, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Auburn, Alabama", "Title": "“Love this place!!!!”", "Author": "Kyle T", "ReviewID": "UR116504038", "Content": "This was the second time that i've stayed at this property. For the vaule it is great. I have not ever had the problems with the staff/tenants of the building that others have had. On both ocassions my room has been upgraded at no exta cost to me and the staff have been extremely helpful. The location is great with quick access to subway, a short walk from central park and minimal walk to the museums. The only downside I have is that I don't live in NYC in these apartments!!!!! Going back in August!!!", "Date": "August 10, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "4.0", "Value": "4", "Service": "3"}, "AuthorLocation": "LA", "Title": "“Great location, good value.”", "Author": "pkoslyn", "ReviewID": "UR115056766", "Content": "Room and kitchen are serviceable, basic, nothing fancy, some very minor defects like knobs missing from drawers and tiny bathroom. A/c is fine, cannot beat the location! Nice lobby, as long as it's not filled with Gymboree kids and their nannies.", "Date": "July 5, 2011"}, {"Ratings": {"Cleanliness": "3", "Sleep Quality": "5", "Overall": "4.0", "Value": "5", "Service": "3"}, "AuthorLocation": "Toronto, Canada", "Title": "“Surprised!”", "Author": "smfische", "ReviewID": "UR115055593", "Content": "After reading these reviews, my partner and I called Priceline, and demanded another hotel (afraid of it being illegal/in poor repair/getting locked out). Priceline told us that we should try the hotel anyways, and to call them if we had any problems. Well, maybe they just made an extra effort to make us comfortable because we called, but the hotel was an AWESOME value for the money. It was clean, the room was great (the kitchenette was actually a mini-kitchen), the location was safe, and there is free street parking. It sucks you had to pay more for the internet, and to leave your bags, but we only paid $100 for what we thought was worth at least $160/night. Either the other people who stayed here were snobs, or they gave us amazing treatment after the call in. Either way, check this out for yourself. Great value for the money. Only two bad things happened: we found an apple seed on the floor, and the towel bar in the bathroom fell down. If you're the type of person to be bothered by these things, don't stay here. But, if you're not, we had an amazing stay!", "Date": "July 5, 2011"}, {"Ratings": {"Cleanliness": "3", "Sleep Quality": "5", "Overall": "4.0", "Value": "5", "Service": "3"}, "AuthorLocation": "Galway, Ireland", "Title": "“Stayed here twice and loved it, cheap, good location and apt not too bad”", "Author": "deadlydan", "ReviewID": "UR112857503", "Content": "Myself, my girlfriend and five of our friends stayed here in march. you get what you pay for in life.Our apt was warm, clean and its in a great location. We stayed in a three bed apt and we had plenty of room, I agree that service was only average but who cares its NYC, all you need is a place to put your head at night. I WILL BE BACK!!!!", "Date": "June 12, 2011"}, {"Ratings": {"Cleanliness": "1", "Sleep Quality": "1", "Overall": "1.0", "Value": "1", "Service": "1"}, "AuthorLocation": "Oakland, California", "Title": "“What a dump - operated by crooks!!”", "Author": "JordieB", "ReviewID": "UR112277471", "Content": "Below is a list of problems (all documented with photos!) with the Woogo apartment we rented in Chelsea in Manhattan. It shows blatant disregard of the apartment's functionality, upkeep, and even potentially, resident safety: * The tub filled up with putrid water and did not drain after use. In addition, there appeared to be no overflow cap at the rear of the tub, instead an unfinished and unattractive and vacant hole was present. * The towel bar in the full bath appeared to have been broken off - the cleats were present, but no bar. * The door to the bedroom nearest the front door was held on by only one of three sets of hinges. The other two sets of hinges were hanging loose and no longer attached to the door jam. * The toilet seat in the half bath was cracked completely through. One person in our party received a painful pinch and was actually bruised when she sat on it, because her weight caused the gap in the wood to open, which then closed on her skin when she shifted her weight! * Exposed electrical wires were dangling beneath the cabinetry at three different locations in the kitchen where under-counter lighting should have been or perhaps was intended for future installation. In two out of three instances the wires were capped, but the third had none. I am hopeful that these were not \"live\" wires, but I was not about to touch them to find out! * Instead of an overhead light in the bedroom closest to the front door, there was a hole and more exposed and capped wires where a ceiling light should have been or perhaps once was. * The apartment had areas of significant wear and tear beyond that which would be considered acceptable for an accommodation of this price. Paint was flaking off in large areas around pull areas of closet doors. Numerous scuff marks were present in every room and the place appeared to be in great need of fresh paint. * The closet that contained the heating/cooling machinery was in a closet in a bedroom and not only was unlocked/accessible, but had the remnants of where a latch/lock formerly had been but had fallen or been broken off. The accommodations were so unacceptable that we had to leave after 1 night because they did not even satisfy our very basic needs (i.e., functional shower), and furthermore the entire process usurped at least 4 hours of our first morning in NYC as we negotiated with staff and looked for last-minute accommodation elsewhere. Disastrous! Insult to injury - they still charged us the full rate for our 1 nite stay AND are adding an additional cancellation fee equivalent to a 2nd nite stay (over $1200 total!). We are in the process of refuting this but have not had any success yet!! These guys are crooks!", "Date": "June 8, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "1", "Overall": "2.0", "Value": "2", "Sleep Quality": "3", "Rooms": "2", "Location": "4"}, "AuthorLocation": "Bucharest", "Title": "“Poor value for the money”", "Author": "Razvan007", "ReviewID": "UR110121550", "Content": "I stayed here for 2 nights. The location was perfect for what i needed, very close to the subway as well (also the express line). The service was ok, but the room was not so good. The small bathroom smelled like mold (and there was some on the walls indeed). The room door looked unsafe, anybody could have opened that by just nudging a little bit. I know that hotels in NY are generally bad, but this one can do better for sure.", "Date": "May 27, 2011"}, {"Ratings": {"Overall": "1.0", "Service": "1"}, "AuthorLocation": "Boston, Massachusetts", "Title": "“Do NOT stay here!!! Beware of Woogo”", "Author": "agtemp2", "ReviewID": "UR109851141", "Content": "Beware of Woogo! My wife and I were recently on vacation in New York City. Our accommodations were handled by ‘woogo’ (www.woogo.com) through Priceline. I hope no one else has to experience what we did at the hands of Woogo. Please, stay away from this company! Here is the timeline and experience: It will tell our side of the story, which woogo.com Carlos and their account manager already know. I can’t believe this has taken so long to correct. April 9th, Priceline.com reserves us an apartment in New York City; the booking states: “The apartment will have a key for the front door for independent access to the building for the rest of the stay”. We book it. When we arrive and buzz, the young lady at the buzzer says “you won’t need a key; we’ll buzz you in remotely.” She assured us that this service was available 24/7, so although we didn’t like it, we didn’t have a choice. Trouble began the second night. Sometime after midnight we returned after having seen “Memphis” on Broadway (by the way: great show). Unfortunately, we had no idea what was in store for us upon our return. We pressed the now familiar buzzer… but nobody was there. Maybe the person was napping, we thought. And we buzzed again... and again... and again… Next we called the contact number my wife had stored in her phone: 212-616-8497. Verizon told us the number was not in service. Uh oh... On the wall of the foyer was “in emergency call …the building super.” Of course, he did not pick up. But his phone had a recording which said, leave your number. So I did. Eventually he called back, but said that he was in Brooklyn and wasn’t going to come up to the upper west side to let in a couple of tourists. His responsibility was to the building, not the renting agent. But he did give us good advice: buzz every apartment in the place, and somebody might let you in. Sure enough, after buzzing the people who live there, and pleading with one woman who actually answered the intercom, someone let us into the building. The apartment itself had a keypad entry, so we were in. The next morning, we tried both the buzzer and the 212-616-8497 number, just to see what had happened the night before. Was their 24/7 pledge really a “get home by midnight or else” rule? No answer on the buzzer, and the phone was still disconnected. Apparently it just didn’t work. Call to Priceline: we need a place to stay! They tried reaching woogo.com also, but the phone was just as disconnected for Priceline as it was for us. They found us a new place, but because we were at the mercy of the market on a big vacation week, we paid about double for a replacement hotel room. Priceline said they’d work out the details with woogo.com. We’re still waiting for this to happen. So here we are a month later, and woogo.com has charged us for three nights, when they only let us in for one night. When I call I get left on hold. When I spoke to the reservations manager, he promised a call back but never did; my return call the next day to the account manager resulted in a 15 minute on hold, before I finally understood the hint and bailed out. They all give the same tired line “I don’t know about this, let me put you on hold to discuss with the next guy in line”. For Priceline: if you can’t screen out shady operators like woogo.com, why should we ever place our trust in you again? Anyone else, if you see a reservation handled by woogo.com, run -don’t walk- away. They’re scammers; incompetent at managing hospitality, and dishonest once they have your money. Don’t let this happen to you!", "Date": "May 25, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "2"}, "AuthorLocation": "Newark, New Jersey", "Title": "“Dont ever go here!!”", "Author": "jameslover", "ReviewID": "UR101751869", "Content": "Im a 26yr old male that has been to nyc many times. As soon i arrived there were problems. The front desk was extremely rude. It took 2 HOURS for my room to be ready (i arrived at 5pm). Then we got our room and they literally stuck a bed and a bathroom in a closet and called it a studio. The place was filthy, all the furniture was messed up and old. Seriously messed up my little getaway with my fiance. Thi splace is a total dump and anything you want including the smallest things like a simple room cleaning will cost you a min of 50.00usd. Trust me just go to a hotel with a more creditable name. Dont even both trying to call there main office , there even more rude and place you on hold for atleast a half hour before you speak to the manager. Hell in nyc should be the name.", "Date": "March 27, 2011"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Overall": "4.0", "Value": "4", "Sleep Quality": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "London, United Kingdom", "Title": "“ok - good value for money”", "Author": "FBIT", "ReviewID": "UR101050567", "Content": "I stayed in this hotel with two friends. The double bed was fine, but the sofa bed was horrendous - imagine the worst sofa bed you can with a metal frame, the odd spring a whole heap of creakiness! Given that the location is quite good it was good value for money. We did not use the kitchen, mostly because the sink smelt quite bad and we were not there long enough. This hotel suited our trip and we got what we paid for with no nasty surprises.", "Date": "March 21, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "4", "Location": "4", "Rooms": "3"}, "AuthorLocation": "Brisbane", "Title": "“If your not a snob, you'll like it.”", "Author": "davidleigh85", "ReviewID": "UR100585380", "Content": "Overall it's a good place - good value for money. But, it's a little on the dodgy side: the bed was uncomfortable, the turntable in the microwave didn't work, the 2 bar stools were broken and couldn't be sat on, and there was no hot water for most of 1 of the days. But, in saying that, for what we paid, I was willing to put up with that. On the plus side, the room was big, it cable TV, and a kitchenette.", "Date": "March 18, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "4"}, "AuthorLocation": "Baltimore, Maryland", "Title": "“NEVER AGAIN”", "Author": "Cheflace08", "ReviewID": "UR96770455", "Content": "Poorly advertise doesn't have a kitchenette it's a hot plate! No Sofa bed...and the staff isn't great at all...We will never look at this place again when in NY", "Date": "February 15, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "3.0", "Value": "5", "Location": "5", "Rooms": "3"}, "AuthorLocation": "", "Title": "“You get what u paid for!”", "Author": "Alexmayson", "ReviewID": "UR92599463", "Content": "Overall nice apartments for the money we paid! This is not a hotel so there is no room service wake up calls and etc. it has a small kitchenette with microwave, stow and the fridge. Some plates, pans and other tableware available. There is a huge very inexpensive grocery store just next block from the apartment building. We saved bunch of money on food cooking at the room instead of dining out. However there is minimum furniture in the room and bed linen is not really clean good enough. So it might scare u a bit at the beginning. But nothing cost that cheap in this area! It is one block away from the subway, three blocks from Central Park and 15 minutes walking distance from Natural History museum! There are also plenty stores around and places to eat. I would stay here again next time.", "Date": "January 11, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "3"}, "AuthorLocation": "Oakdale, California", "Title": "“AKA \"central park apartment\"”", "Author": "ltoakdale", "ReviewID": "UR90433186", "Content": "Please not the above title, this place also calls themselves by it on booking.com... We traveled to NYC with another couple, and we under the impression we scored a great location/ price for a 2 bedroom apartment for our time in NYC. Upon check in we discovered that we had 2 separate 1 bedroom apartments, and they blame this error/ miscommunication on booking.com... Now everyong know your kinda at their mercey, so we reluctantly accept the individual rooms on seperate floors. The bed was garbage, bathroom toilet seat looked like it was from when JFK was still in office \"paint chipped off\" For half of the following day the hot water in the shower didn't work. It does have a very nice location to get around the area, but we would've been happier to spend more $ to get exactly what we wanted and not have had to deal with a dishonest establishment on our vacation.", "Date": "December 21, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Dallas, Texas", "Title": "“Great deal”", "Author": "Dennis017", "ReviewID": "UR90038616", "Content": "I've stayed at this place several times and was never disappointed. The rooms are huge by New York standards. They are extremely clean. And my rooms are usually very quiet. (I usually request upper floors in New York to distance myself from the street noise.) The kitchen facilities are a plus so you can have a light breakfast and coffee in the room. A grocery store is convenient, as is a major subway station. Easy walk to Lincoln Center. Don't expect maid service or room service. It is an apartment house. Safe neighborhood. I'll be back there soon.", "Date": "December 16, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "2", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "3"}, "AuthorLocation": "Perth, Australia", "Title": "“STAY AWAY: DON&amp;amp;#39;T EVEN THINK ABOUT IT!!!!”", "Author": "Australian57", "ReviewID": "UR89541367", "Content": "We stayed here on Tuesday 21st September 2010. Never look at photos on the deceptive website and think that they bear any resmblance to reality! It is a total lie! Go anywhere else. The beds are so uncomfortable; bathroom tiny but thankfully it was clean. This was a small saving grace. Air conditioning did not work. God forbid being in that tiny airless room in the height of summer! The TV did not work at all. The so called kitchen had no space where you could even slice an apple. The so called baggage area leaves your bags just scattered beside the disinterested staff who sit crammed into a side spot in the foyer. The one good thing: it is located close to L&amp;#39;Este restaurant where we had a superb meal. Otherwise, we loathed, hated, despised this place.", "Date": "December 10, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "4"}, "AuthorLocation": "Great Barrington", "Title": "“Dreadful”", "Author": "BekrshireTraveller", "ReviewID": "UR86061729", "Content": "This is the worse review I will have given to a place in a long while. The first requirement of any hotel is a good night's sleep. Impossible here. The rooms are steaming hot with no way to lower the heat other than opening the windows and letting all the Broadway traffic in, which made it impossible to sleep well. The room furniture is worse than a college dorm rooms, the bed sinks in the middle and is very uncomfortable, the bathroom is as large as a hall closet, the lobby is ratty. Just a bad, bad experience. And I usually give places the benefit of the doubt. One nice thing: it is near the subway so you can make a quick escape!", "Date": "November 5, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "5", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "3"}, "AuthorLocation": "Washington DC, District of Columbia", "Title": "“Scam or Woodo Carma? Our vacation was totally ruined!”", "Author": "niceperson060", "ReviewID": "UR84846189", "Content": "The following most horrible experience left me speechless and I still cannot believe that this Woogo scam continues almost 2 days after we’ve checked out and decided to never come back. We not only lost the reserved place upon arrival at the property, but also lost time and money risking to be left on the street in NY late at night. In addition, the credit card statement confirmed more than one unauthorized charges from Woogo. I reserved a One Bedroom apartment at their Central Park property at 240 West 73rd St, New York, NY and arrived there at 2 p.m. The front desk lady pulled up the reservation and told us that we could not check in till 3 pm. The reservation confirmation email stated that the check-in times are between 2 and 3 p.m. She allowed our group to keep the luggage at the front desk and come back any time before 10 p.m. to get the room key. We came back before 9 p.m. and were told us that there was a “Situation” with our room and handed us $10 cash for a cab and directed us to Central Park House property, room X, located about 10 blocks away. I confirmed if that was a joke and was told they were serious. Ok, if that was the case and the room was not available even though it was reserved and the credit card balance was confirmed, I was so naïve to believe that going to the new location due to their “Situation” could end the nightmare that was just starting. They even confirmed that there would be someone to let us in at the new location. Upon arrival at the Central Park House (not to be confused with Central Park, which we were initially at) there was not only no one there to let us in (the intercom system was not working properly), but the apartment X was locked and we had no key. I’ve contacted Central Park person and the reservation office. They both were assuring that they are trying to get things resolved. It was already after 10 p.m. Our group was sitting on the steps in front of the locked apartment door thinking that the dirty steps cannot be the place we have to spend our NY vacation night after we paid for the One Bedroom reservation. The late-night Woogo “Phone Resolution Team” kept giving us the non-working access codes to Room X. Finally, one of the codes worked and the door opened….there was someone else in the room. Who knew what could have happened next, but gladly, no one noticed what happened. We were now horrified to death. The night Woogo “Phone Resolution Team” then told us that Room X was not the right room, we were suppose to be entering Room XX, same building. The access codes did not work again, as usual. Following about 40 minutes of such fun, we were told to come back to Central Park property and pick up the key for a room that was ready. I was also told that I will get 15% off for the entire bill. We have to drag ourselves and the luggage back to Central Park and discover that the room/apartment that so magically appeared in the middle of the night was as twice as smaller as the original room that was reserved. Plus, “what 15% discount are you talking about”? Forget the discount that was promised, we were glad to have a place to sleep that night. The next day I’ve discovered more than one charge on my credit card, one greater than the other. Still getting things resolved… Please do not ruin your NY experience by getting involved with this shady Woodo or Woogo business. You may recommend it to only anyone you wanted to play the cruelest joke in revenge for some bad deeds. Other than that, the level of service is horrifying. Scam as it is.", "Date": "October 26, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "4", "Overall": "2.0", "Value": "1", "Sleep Quality": "5", "Rooms": "1", "Location": "5"}, "AuthorLocation": "Australia", "Title": "“Dodgy establishment, room with multiple defects, careless service, you can do better!”", "Author": "SteveNLaura", "ReviewID": "UR79324393", "Content": "Location - excellent, short walk to the supermarket, close to subway station, restaurants close. Service - atrocious!!!!!! careless staff who lie to you about fixing room issues, staff have a dodgy feel about them and their motto is close enough is good enough, Room - tiny, many defects: TV broken, air conditioner ineffective, blinds damaged, stove top broken, microwave broken! AND... i think we had a \"good\" room!! Amenities - nothing for free!! walk down to the Lincoln Centre or McDonalds for free wifi. Value - terrible, very expensive for the poor service, lack of amenities and defective room.. Overall - would not stay here again, avoid like the plague, you can do much better!", "Date": "September 13, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "4", "Overall": "2.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Washington DC, District of Columbia", "Title": "“BEWARE:'MINI-BAR' DEPOSIT $50 PER NIGHT TAKES A WEEK TO GET BACK”", "Author": "AbundantCreature", "ReviewID": "UR78417972", "Content": "Listen, no one's going to complain about being on the upper west side of NYC, right next to the 72nd station and close to everything Gotham has to offer. When I checked in i was surprised to learn there was a $50 PER NIGHT \"deposit\" for the mini-bar. Per night, in my case, was $100 for my two night stay. I was just up on a quick meeting from Washington DC and had decided to spend a little time in the city to catch up with old friends. The real clincher was the \"mini-bar\" itself: a price list tacked on the outside advertised $3.00 per bottle and there were 9 bottles inside (no booze, which was fine for me as I don't have to drink). I spent the first night apologetic because my friend had to foot the bill at dinner and the next morning roaming around searching for a Moneygram (to which the front desk help said \"A lot of guests ask about that\" when I told him my dilemma). I would have gladly paid for all of the drinks up front (a total of approximately $27). instead i have to wait for \"eight to ten business days for the hold to be released on your card\". The plumbing in the room was terrible, clogged toilet and bathtub. The light in the bathroom went out and it took them hours to come and repair it even after I had called. The television had a weird buzz that made it impossible to enjoy. The bed was comfortable and the room was very clean. I did not appreciate that I had to leave my room key with the front desk for them to fix the bathroom light and toilet (which still ran all night after they came to 'fix'). As good as the location was, I will never stay there again (and meanwhile I am still waiting for my \"mini bar deposit\" hold to lift from my credit card).", "Date": "September 6, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "4", "Overall": "3.0", "Value": "4", "Sleep Quality": "3", "Rooms": "4", "Location": "5"}, "AuthorLocation": "San Francisco, CA", "Title": "“Beware of \"service fees\" at booking and check-in.”", "Author": "EngineroSonido", "ReviewID": "UR73284560", "Content": "Summary: beware of service fees when booking, check-in and during your stay. Great location. Not a hotel. Comfortable small apartments in NYC. This is not a hotel, it is a group of (sparsely) furnished apartments that rent like a hotel, daily, weekly, etc. The building also has permanent residential apartments, so you ride the elevator with tourists and locals together. As long as you go in with these limitations in mind, it's a great value. I grew up in the neighborhood, and this place is in a great location, as advertised. I liked having my own little Upper West Side apartment in a pre-war building (pre-WW2, that is, highly coveted in NYC). I have a 2-year old, and there is a great playground nearby on 76th in Riverside Park. Fairway is around the corner on Broadway, one of NYC's best supermarkets, and Trader Joe's is coming soon to 72nd & B'way. The price is great for the space you get and for the location. However, you do get what you pay for, and there are some shady practices when dealing with this company. Be sure to read all of the fine print before booking, don't overlook the detalls like I did. the bill kept going up and up with each new \"service fee\". What started as $660 turned into $820 after all the so-called fees. 1. I booked the room through booking.com. Woogo then charged $120 service fee for this! Maybe I missed the fine print, but this is outrageous! 2. When I checked in, they charged a 2.5% fee for paying with a credit card. Say what? It came to be more than $20. \"oh, but you're welcome to avoid the fee by paying in cash.\" right, like I'm going to be travelling with a huge wad of bills, come on now. 3. Who exactly are you renting from? Not Woogo. Not Tempo New York (the actual property). Your credit card is actually charged to Caribbean Sunset Resort, based in Jamaica (the island nation, not the neighborhood in Queens). Nowhere in the booking process is this made apparent. AND, my creidt card company just charged me an international service charge because they are based overseas, even though the card was swiped in NYC! Who are these people? The lady at the hotel's front desk explained it to me this way: Woogo is like Expedia or Travelocity, they are just a booking agency. She would not tell me who Caribbean Sunset is. 4. I called 3 times during the week before to confirm a crib for my baby. When we arrived on a Sat. night after a long day of travel, no crib! They had given it to someone else. Big Problem. After a few frantic phone calls, a friend bailed us out with a crib. I complained, and the next day they went out and bought another crib for us. A nice gesture, but too late. 5. I include a #5 just because I'm mad at them. Just a petty little jab. 6. See #5.", "Date": "August 1, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "uxbridge, ontario", "Title": "“Great - get what you pay for”", "Author": "danamiddleton", "ReviewID": "UR72724544", "Content": "If you're looking for a place to store your bags and lay your head while you spend the days and evenings out doing stuff in NYC, then you can't beat the price of this place. We were 3 girls travelling together for 4 nights. We had a 1 bedroom and got a great price. We always felt safe in the hotel. I shared a bed with one friend and the other slept on the couch. The rooms were clean - yes, they could have used an update, but they were clean, which is all that we cared about. They were hot, as other reviewers have mentioned - but we were there in March and so just opened up the windows. The location was GREAT - just off a subway line at 72nd, literally half a block. And, right at the same place a Grey's Papaya hotdog restaurant (remember Fool's Rush In?). Great hotdogs! We also ate at the pub just down the street on 72nd about 4 storefronts down from the corner which was fantastic. You have to buy wifi, but its worth it and not crazy expensive. I looked online and found cheap parking a couple of blocks over.", "Date": "July 28, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "2.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "2"}, "AuthorLocation": "New York City, New York", "Title": "“Horrible”", "Author": "Jamie1853", "ReviewID": "UR70827644", "Content": "The room was very small, nothing like they described in the pictures. The bathroom was like a closet, not to mention the closet space was not good either. You have to pay for everything; cable, Internet, even housekeeping. I would not recommend this hotel to anyone, especially when you want to see the sights of New York. The service was just as bad, if not worse, they failed to mention a cover charge of 100$ when you check in (claims it will be returned in a few days) and the lady did not keep track of what she was doing, like she failed to give us the key and didn't remember if we signed a reciept. The air conditioning is horrible in the rooms and throughout the hotel. I would indeed say this was the worst hotel stay I or my boyfriend have ever endeared.", "Date": "July 13, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "3", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Dublin", "Title": "“would return visit...”", "Author": "DublinN_p", "ReviewID": "UR70232185", "Content": "The apartment’s location was great: nice neighbourhood a walk to central park, lots of nice places to eat , a grocery store round corner and express sub way on the door step. I was happy with the apartment, it was decently sized with good wardrobe space, the bathroom is on the compact size but the whole place was very clean and the kitchenette was adequately equipped for our needs. Things I didn’t like; paint work was a bit scuffed bringing down first impression, you also have to pay for internet service, the linen and towels were little worn (but clean and fresh and spares provided) and the a\\c was a little noisy but you get used to in and in July you forgive a little noise for a cool retreat. I requested my room cleaning on the day before I wanted it (at half way thru my stay, be aware you only get one service) as instructed by front desk and it was done as requested. I would make a return visit and would I would recommend it, for the price it was everything we were looking for!", "Date": "July 9, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Indianapolis, Indiana", "Title": "“Great serviced apartments”", "Author": "Azndude51", "ReviewID": "UR69953077", "Content": "As long as you know that this place is a serviced apartment and not a regular hotel, you should have a satisfactory stay like I did. The price was very inexpensive for such a large apartment (since you're not paying for all the extra hotel services) and the Upper West Side area is great. There are very few tourists around so you really get a feel for what it's like to be a New Yorker. The location is very convenient, the red 1,2,3 line subway station is less than a block away. That subway line will take you to Midtown/Times Square in about 10 minutes so the major attractions are easy to get to. A cab ride from Penn station cost us less than $20. There is a very large grocery store about 2 blocks away and there are nice shops all over, such as a North Face store that is down the street. The numerous nearby restaurants will suit almost any taste. Also, Central Park is just two blocks over. I stayed here in May with three adult family members while we were on vacation in NY for four nights. We liked the idea of having a two bedroom apartment as opposed to 2 separate hotel rooms. The sofa bed allowed us to split up and so that two of us could essentially have our own room. The two bedroom apartment was spacious considering it was New York and had two baths and a kitchen. There was an air condioner/heater unit in the master bedroom and one in the kitchen/living room area, but the second bedroom didn't have one. The kitchen had modern appliances with a full size fridge, microwave, stove, and oven along with silverware, pots and pans, utensils, cups, etc. Any food for cooking could be purchased at the nearby grocery store. There was a TV with cable but the remote didn't seem to work. The apartment had Ikea furniture but everything was only a couple of years old and it was comfortable enough but not luxurious. Since I am not picky when it comes to beds, I found the sofa bed tolerable and got a decent night's sleep, others may hate it. The sofa had a bunch of nasty looking stains on it but everything else was clean. They had enough towels, sheets, and pillows for 6 people since that is the capacity of the 2 bedroom. As a previous reviewer mentioned, the soap and shampoo are from a large hotel chain but I don't think that's a big deal. The only things that I would've liked in the apartment was a hairdryer and iron and ironing board. Since it was a fairly short stay and my family and I clean up after ourselves well, we had no issues with not having a maid clean our room every night. I didn't use the wireless internet since cost extra, there was no problem finding free wifi elsewhere in the city. Since this is just a serviced apartment building, the customer service is lacking so don't expect much. For example, if you need to print something, they'll just tell you to go to FedEx/Kinkos which is around the block. Also, the reception desk has no one there after around 10 pm but there is an attendant at the front door 24/7. We had to check out at 5am so we just turned our key in to the front door attendant since the reception desk wasn't open yet. The only major issue we had with the apartment was that the top pane of one of the bedroom windows wouldn't stay shut. We didn't feel secure with the window open all the time and it let all the hot summer air in. The maintenance man fixed it within a couple of hours but kept it shut using a couple of screws which seemed kind of dangerous since it was heavy pane of glass. He came back the next day with the manager to see what else could be done about it so they'll probably get it replaced or something. Overall, we had a satisfactory stay. We enjoyed having such a relatively large apartment to stay in and the location was amazing. Since the price was so affordable, we didn't mind that the place didn't have many common hotel services and were willing to look past its issues. It was comfortable enough and we wouldn't mind staying there again if returning to New York.", "Date": "July 6, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "1", "Overall": "3.0", "Value": "2", "Sleep Quality": "1", "Rooms": "1", "Location": "5"}, "AuthorLocation": "Indianapolis, Indiana", "Title": "“Not fit for Three but good for Two”", "Author": "indy_family_traveler", "ReviewID": "UR69774696", "Content": "Central Park West--73rd and Broadway, NYC: I read the reviews that mentioned the terrible sleeper sofa (not possible to sleep on), but since the review was published a while ago, we assumed the owners would have repaired or replaced it by the time we stayed here in late June. Not so! My spouse and I, plus a teenaged son, stayed in this apartment for 4 nights and days, in the \"Executive Suite\" which indicates it accommodates 3 people. NOTE: IT DOES NOT. The sofa is a two-seater, so you can't sleep on it without using the pull-out sleeper function. The mattress was torn (not to mention stained) with rusty springs sticking out of the fabric that would likely cut you on the legs and thighs. Although he'd had a tetanus shot recently, our son still could not sleep on it without getting pricked or poked by errant wires whenever he moved. Fortunately our son had brought his small sleeping bag--the hardwood floor was preferable to sleeping on that dangerous not to mention disgusting mattress. As everyone pointed out, this is not a hotel so no one should expect concierge service or cleaning for a short stay unless you pay extra. You are renting this due to the location. That said, while the linens smelled clean, they had blood and other unidentifiable stains on them. It can't cost that much to refresh them at Goodwill, right? They already bought the cheapest Ikea furniture available so why not some non-scary linens and pillows? We were only in the apartment for breakfast and sleeping, so the location is the best reason to rent this place. It is so convenient and you just cannot beat the price for the neighborhood. Thus, I am giving this a thumbs up but be forewarned--it only works for two adults who sleep in one bed, unless you have a small child who could sleep on the love-seat sized couch cushion. The mattress is unsafe! So, location, location, location and cheap. We rent apartments all over the world--most recently in Evergreen, Colorado, plus abroad in Tokyo and Banff, and this NYC apartment is the only time we ever had any problems.", "Date": "July 5, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Pune, India", "Title": "“A comfortable and satisfying stay. Excellent location.”", "Author": "roadsr", "ReviewID": "UR67761046", "Content": "The hotel's location was the biggest eye catcher. It was at walking distance from the shops, the metro (which is a boon) and the Central park. Since it is an apartment hotel, please do not expect it like a typical hotel. The lobby has a front desk where the employee will assist you with any queries etc. Other than that it's a huge apartment with doors on floors leading to different apartments. There is a laundry service at basement with usual coin system. I was a little disappointed with the apartment I was alloted as it was smaller than the one I saw in Expedia. com's visual tour, but I was told since all vary in size, I was given the best available one. Other than that the room was clean and cosy. The small kitchenette was equipped with all the utensils and cutlery that one may need for a short stay and quick cooking. There was a small fridge too. The bathroom was also nice and of good size. But one thing one should know before going there is that there is NO HOUSKEEPING provided. The room is not cleaned, apparently you need to pay extra for the same. We had a little trouble with operating the Kitchenette stove and AC temperature adjustment initially but we were promptly assisted by the hotel staff. Since we were travelling with an infant, the it was very important that we do not have disturbance around the room, which gives 100 points to Woogo as there was completely no disturbance or any noise around. We would not mind repeating Woogo, NY again!", "Date": "June 17, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "2", "Overall": "2.0", "Value": "2", "Sleep Quality": "2", "Rooms": "2", "Location": "5"}, "AuthorLocation": "Orlando, Florida", "Title": "“Good location not so great service/room”", "Author": "officerincalopez", "ReviewID": "UR63855502", "Content": "We stayed in a 1 bedroom and it did not at all look like the pictures of the website. They had scratches on the walls, the second television did not work, and the room was depressing. The location is great but the service was not. When I asked for a box for cable for the television that had nothing they said only one of the televisions were for cable and the other was for dvds. They never sent the dvd box after I requested it. Also a fire alarm went off at 2am. When I called the front desk to ask about it they just hung up the phone. When I tried to call back they wouldn't pick up. I never asked for anything extreme just at least the minimum of what a person would expect when they arrive to stay at a place that is paid for (i.e. cleanliness, working televisions, basic customer service). You also have to pay for internet service which in other locations it is free. It is located in a good location but I will never stay at that place again.", "Date": "May 11, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "2", "Sleep Quality": "4", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Bangalore", "Title": "“Good hotel at a great location. Slightly expensive.”", "Author": "Gautzhere", "ReviewID": "UR61067246", "Content": "This hotel is about 20 minutes of brisk walk from 46th street (Times Square) and the Subway station is just around the corner for you to take a train to any place in Manhattan. Slightly expensive. The room had a good air conditioner, Music system, TV, Microwave and minibar (empty though). Did not see a restaurant though . i.e., no breakfast . Helpful, polite and friendly staff.", "Date": "April 12, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "3", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Budapest, Hungary", "Title": "“It is okay for NYC”", "Author": "gyik", "ReviewID": "UR60949414", "Content": "It is not really a studio, as there are many furniture items missing. There is no desk/table so if you want to eat you have to do it on the bed or the floor :( There is nowhere to place washed dishes to dry. No reading lights, only one chair. Is is still okay regarding NYC. We stayed on the 16th floor, which was so hot, I couldn't sleep. You have to pay $5/item for luggage store... Ther is no cleaning involved.", "Date": "April 10, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "3.0", "Value": "4", "Sleep Quality": "3", "Rooms": "3", "Location": "5"}, "AuthorLocation": "notts", "Title": "“Great location, great price and we had an ironing board!”", "Author": "coalblade", "ReviewID": "UR60560480", "Content": "We read all the reviews and were quite apprehensive but any worry was quickly dispelled. The apartment was basic but what do you expect for the price. Plus we didn't spend all day in it, we were there to see the sights. One thing that has been mentioned in previous reviews which we think would be an improvement is free internet and access to a printer to enable booking online for the flight home. The apartment block was about 200 yards from 72nd Street/Broadway tube station (Red line) and a 5/10 minute walk to Central Park and the Museum of Natural History. The area has a wide variety of restaurants to choose from with a range of prices. We would thoroughly recommend Josie's and Lansky's. It must be reported that cooking would have been a problem as the apartment had only two electric cooker rings (enough to boil a kettle) plus a micowave but we ate out anyway. Additionally, there are loads of shops including Northface, Zara, Urban Outfitters, Apple Store, Loft. The Fairway supermarket is a 2 minutes walk away and an experience in itself for fresh bagels and fruit. We went to the Imax at Lincoln Centre to see Clash of the Titans in 3D but arrived late and ended up pushed to one side so still not sure about 3D.", "Date": "April 6, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Ontario", "Title": "“1 adult and 4 teens, 2 rooms.”", "Author": "talkingtoast", "ReviewID": "UR59142234", "Content": "We really enjoyed staying at this apartment, we felt like New Yorkers ! Fairway market is a block away. Coffee from the street vendor in the morning was exceptional. The room didn't have cable TV but numerous street vendors sell dvd's and vhs videos for the kids 2-3 bucks each. you have to pay for internet access. I didn't like how the check in person scanned my CC. I thought it was only my driver license and would have left had he told me he was going to do my cc too. the #3 express train stops at the 72nd street subway station. so one stop from Time Square ! lots of places to eat near.", "Date": "March 21, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "2", "Overall": "1.0", "Value": "1", "Sleep Quality": "2", "Rooms": "1", "Location": "4"}, "AuthorLocation": "New York", "Title": "“Do not recommend”", "Author": "EDIEBr", "ReviewID": "UR58091511", "Content": "No ironing board, no remote for either TV, dim lighting, poor phone sound quality, apathetic staff, extra charge for internet, extra charge for storing luggage - totally not worth the price. All the disadvantages of a hotel or apartment with none of the advantages of either.", "Date": "March 8, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "3", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Istanbul, Turkey", "Title": "“Wanna feel like a local, stay here. Great accommodation & location for the price”", "Author": "eLoLife", "ReviewID": "UR57830057", "Content": "If you want to feel like a real new yorker, this is the perfect place to stay. First of all this is not a hotel. Imagine living in a building with a doorman, that's how it is. (there are actually long term residents) It's a great location. I stayed at a studio apartment with a separate kitchen & bathroom. The bed is pretty big & comfortable. The sheets, the pillows, the comforter were clean and smelled nice. There was enough towels for two & extra sheets. There is a couch, huge tv, stereo, alarm clock, good size closet. The kitchen is pretty comfy with a table and 2 chairs. Everything was CLEAN, the kitchen, the tub, the toilet. The fridge is small. (the supermarket is 1 block away on 74th street, you can just go & buy fresh food everyday, you don't have to stock.) Yes just like someone said in one of his/her reviews they have some other hotel chain's daily care products (I think it was holiday inn), but I figured they bought leftovers from the manufacturer for less price. I don't think it's such a big deal, I never use any of the hotel daily care products anyways. They put $100 hold on your credit card in case you damage something. The day you check out, If you would like to leave your bags at the reception, you have to pay $5 per bag. (I kinda negotiated gave 2 luggages & one carry-on for $10) There was no hairdryer. (I bought one from Duane Reade on 72nd street for $19) didn't really ask them for a hairdryer, so ı do not know if they have it. (if they have, I bet they'd charge you for that as well.) There was a vacuum cleaner & iron. The heater made this horrible sound every nite at certain times, it was as if someone was knocking on the window. Kinda scary but because it wasn't ongoing all nite and I was very tired, I slept through it. (but it's a major issue in the old ny apartments I guess, I remember when I was living in Soho, my heater did make same kinda noise) BUT IT WAS A QUIET ROOM. (there was no outside noise, no cars honking, alarms or sirens) Perfect for people who is not going to spend time in their room, there was no view in my room, the 2 windows both faced a wall, and the kitchen window faced other apartments. (but don't take me wrong it's not claustrophobic. There is no business center; they can't even print out one page but there is a kinkos on 72nd street. There is no free internet, you have to buy it online by using your credit card, it was $10 for 24hrs. Its right on the corner of 73rd and Broadway. By the main subway 72nd street subway station (1-2-3 Lines) There is a huge supermarket (Fairway) on 73rd & Broadway, Duane Reade & Kinkos on 72nd & Broadway. Couple blocks from central park (if you are visiting in the spring, summer or fall, perfect place to walk & run to the park.) There is a Barnes & Noble on 69th & Broadway and a huge movie theatre with Imax. There is shopping as well, you can go to colombus circle or take the train directly to Macy's (34th) or Century 21 (Chambers Street) without transferring to any other line. It's a very safe, beautiful neighborhood. the doormen were pretty nice and attentive.", "Date": "March 5, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "3", "Rooms": "5", "Location": "5"}, "AuthorLocation": "New England", "Title": "“Terrific!”", "Author": "grunk", "ReviewID": "UR56714504", "Content": "We took two separate rooms. One was for my husband and myself and down the hall we took another room for our adult daughter, her husband, one infant, and a 3 year old. It was terrific! Our room was very hot, but considering we keep our own thermostat off all winter, it was welcomed heat. The rooms were clean with all the amenities of an apartment. The location can't be beat. You will not get classic hotel service here. (It's an apartment.) If you don't expect it, you won't be disappointed.", "Date": "February 21, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "2", "Overall": "2.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Red Bank, NJ", "Title": "“This hotel made me sick.”", "Author": "mdeloren", "ReviewID": "UR55978836", "Content": "I didn't expect this hotel to be anything great, but I also did not expect it to be so awful. I knew there would be no room service, which was fine. Upon walking in, everything appeared ok- no obvious dirt or mold, clean towels laid out, clean bathroom. However, after sleeping there one night and seeing the blanket held up to one of the windows, I noticed there was mold growing inside the blanket, undetected until you hold it to the light! Immediately I FREAKED out and brought my own blanket to the room. Later that day I began to feel ill. I now have a terrible, awful cold and I can chalk it up to the room not being cleaned thoroughly. The location is great, right by the subway, and there were some good restaurants in the area. Unfortunately I felt so ill that I went home a day early. Lesson learned: DO invest in a quality hotel room, even if it is just a chain-brand hotel.", "Date": "February 14, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "3.0", "Value": "5", "Location": "5", "Rooms": "3"}, "AuthorLocation": "southern maryland", "Title": "“exceeds expectations”", "Author": "moonlighter42", "ReviewID": "UR54190666", "Content": "We were nervous after some of the more dour reviews and had low expectations when we arrived. We found the room in need of some minor repairs but clean overall. The room was quiet, comfortable and met our needs. The staff was great and accommodating. Reservations, check in and check out were a breeze. The apartments were 1/2 block off the subway and within walking distance to great pizza and two great groceries. For the price we paid, we couldn't have asked for a nicer, better situated room. If you come expecting a modest, city style apartment and don't need luxury, then Woogo Central Park really fits the bill. Thanks Woogo.", "Date": "January 23, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "3", "Overall": "1.0", "Value": "1", "Location": "4", "Rooms": "2"}, "AuthorLocation": "DC", "Title": "“Woogo = No Go”", "Author": "bnns", "ReviewID": "UR52054096", "Content": "Went to NY for a fun family weekend. Woogo has a great location, unfortunately, the rest of their experience is severely lacking. After check-in, a tragi-comedy of events ensued: We put our kids to bed on a mattress on the floor because the pull out sofa bed's metal mattress supports were broken. At 4 AM the next morning, two men entered the apartment using keys and turned on the lights. Seems they saw our children sleeping on the floor, cursed, then ran out of the apartment. This was followed by a security guard knocking on our door looking for someone who apparently worked in the building. We suspect it was the aftermath of the building staff holiday party. In the morning we spoke with both the WooGo staff and the building security about the incident and all claimed ignorance of the event. Of course, the security guard visit to our room was not logged in any report. We have yet to receive any follow-up. Then that evening through the next day, the building was without hot water or heat - too bad considering NYC had a blizzard with a foot of snow. Topping it off, we were awoken at 7AM Sunday morning with a phone call from the building staff asking if we had water in our apartment as the apartment underneath had water dripping through the ceiling. The kicker? Every call to Woogo has started with giving our name, then being put on hold indefinitely. Emails have gone unanswered.We have yet to speak to anyone to voice our issues. Apparently they're not into dealing directly with customer issues. Don't stay there.", "Date": "December 28, 2009"}, {"Ratings": {"Service": "1", "Cleanliness": "2", "Overall": "2.0", "Value": "2", "Location": "5", "Rooms": "2"}, "AuthorLocation": "nesoddtangen", "Title": "“dissappointing as a place for a familiy holiday”", "Author": "kbergaust", "ReviewID": "UR51860786", "Content": "The location is great, I experienced this on a business trip last year. I looked forward to bring friends and family here for a holiday, but unfortunately it seems like the simple things you need for a familiy are not taken care of. We did not get a functioning remote control for the livingroom TV, the bedroom TV did not function at all. The staff seems unable to fix this.", "Date": "December 25, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "4"}, "AuthorLocation": "New York", "Title": "“It's like living on the UWS”", "Author": "Antoney", "ReviewID": "UR50824386", "Content": "I wanted to plan a romantic get away with my wife but by the time I started looking for a hotel everything was booked and tiny less than 200 square feet rooms were going for $600. I happened upon the WooGo Midtown location so I booked online. Since I didn't get a confirming email I called the company and was told I didn't have a reservation in the system. The very nice woman who took my call offered to contact her boss to see if she could give me the Central Park Penthouse for the same price of the one bedroom I though I had already booked. She took my name and number and promised to call me back. In less than 20 minutes she called me back and booked the penthouse apartment for me. I started to read some of the prior reviews and was a little concerned that maybe I made a mistake since several reviews were unfavorable. I gained some comfort when I read a recent review which suggested maybe the building was under new management. When I arrived at the apartment building I was pleased with the warmth in the greetings from the staff and even the residents. Two lovely young women were working the check in desk and they were very sweet and helpful. As we went in and out of the apartment building to go shopping, to restaurants and the like, everyone was so friendly, from small children to other couples; everyone was especially nice and inviting. It seemed like each of the security personnel knew we were in the building since they smiled at us in every passing just like they knew us well. We really felt welcomed. What some of the other reviewers didn't notice is that this apartment building is the home to so many really NICE PEOPLE and the staff does a fine job in making you feel welcome. We even got a recommendation from one of the young ladies on staff and she directed us to an amazing cafe were we had a terrific brunch. The room we had was exactly what we wanted. The sitting area was ample and the terrace was spectacular. It was like having our own apartment on the UWS. The kitchen area is small and so is the bathroom but this is typical for Manhattan. The location is nearly perfect. We went shopping for fruit, cheese, wine and other snacks at nearby markets. We walked to trendy and well know restuarants. It was a great experience. We would book this apartment over and over. After having such a great romantic weekend like this I don't know how I could ever go back to a regular hotel for such a special time.", "Date": "December 7, 2009"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Overall": "3.0", "Value": "4", "Location": "4", "Rooms": "3"}, "AuthorLocation": "Vancouver, Canada", "Title": "“Like staying at a friends! Clean, convenient, safe and independent.”", "Author": "chris_trvl13", "ReviewID": "UR49354265", "Content": "This is an APARTMENT!!! NOT a hotel. There is no \"service\" besides a doorman who makes sure people don't get in who arent supposed to, but pizza delivery does :) and they will order an airport transfer for you if needed.They have kitchen facilities and a grocery store close buy. Its one block from the 72nd street subway with access to the Main routes #1 and #2 express. There is an awsome restaurant for breaky less than 2 blocks away and a Loehmans for shopping the same distance. You feel like a resident for sure staying here. There is the cutest Tea Shop not far called Alice's Tea Cup (wicked scones, but no coffee). WARNING the Futons ARE NOT COMFY but are bearable....just sayin....", "Date": "November 16, 2009"}, {"Ratings": {"Service": "1", "Cleanliness": "3", "Overall": "3.0", "Value": "2", "Location": "5", "Rooms": "2"}, "AuthorLocation": "Sydney", "Title": "“Room for improvement”", "Author": "OzFamily50", "ReviewID": "UR47758682", "Content": "We stayed with 2 small children to be near friends on Upper West Side - so location was perfect and as other reviews have noted, this is a great part of NYC for local shops, restaurants and proximity to midtown and transport options. The room on level 17 was basic but clean. There was a huge outdoor deck that we didn't really use and the single bathroom was very cramped - a generous sized person would find it difficult to use the toilet ! The most disappointing thing about the Woogo is that you feel that with just a little attention to detail this could be much better value for money. Sofa bed was uncomfortable and wouldn't suit adults. Sheets and pillows were very poor quality and the bathroom soap pinched from a competitor was a unique touch ! ? Probably would try somewhere else next time for the money.", "Date": "October 26, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Finland", "Title": "“Great location, clean enough”", "Author": "MaxPsdn", "ReviewID": "UR47489961", "Content": "Location, very near (1,2,3) metro: Only 5-10min to Times Square and 10-15min PennSt [->Macy´s] / Tribeca / Soho. 900m/10 min to Lincoln Center by foot. Also near Central Park, Dakota, Strawberry Fields. Nearby many not over-priced good restaurants, Fairway-market (excellent grocery) & other services. Very nice neighbourhood. We had 17th floor penthhouse w/1 bedroom, spacious living room (with lcd tv), huge roof top terrace with beautiful skyline + bathroom. Next to famous and historical Ansonia building. Small, good enough kitchenette: coffee maker, fridge. Clean - small bathroom, but OK. Check in/out fast. Reception ordered taxi back to JFK, but no actual \"overall service\" (which we didn´t need). Open 8am-10pm, but 24/7 security.", "Date": "October 22, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "South Carolina", "Title": "“Great location, no frills, felt like a NYC resident”", "Author": "angelstar0614", "ReviewID": "UR46203838", "Content": "This location is at 72nd and Broadway. Right around the corner is the subway stop so it is extremely convenient (and one of the reasons why we picked this place). The room was larger than we had thought based on previous reviews - adequate space for a double bed, small couch (not the most comfortable fold-out bed, but it worked), and a small kitchen with a counter. The closet was roomy and nearly a walk-in, and the bathroom was small but clean. There was a normal sized shower, small sink (no counter space unfortunately) and a toilet - the basics, essentially. The room had a large TV and a small dining table with two chairs as well as an ottoman. The view we had on the 6th floor was of the building across the street. We were woken up most of the days by 7:30 because of a garbage truck making constant noise. The only other complaint we had was that you had to request cleaning either very early in the morning the day you want it or have to wait another day, so we never got our room cleaned that week. Note this is not hotel-like service where you have automatic cleaning. This worked for us though. Overall we felt like long-term residents of NYC with a mini-apartment to go home to at the end of the day!", "Date": "October 8, 2009"}, {"Ratings": {"Service": "1", "Cleanliness": "3", "Overall": "4.0", "Value": "4", "Location": "4", "Rooms": "5"}, "AuthorLocation": "sydney", "Title": "“If you expect service No. If you want convinience Yes.”", "Author": "medellino1", "ReviewID": "UR39441129", "Content": "Rather no frills. It is in a good location on Broadway and 73rd just next to the subway. Rooms feature a kitchenette. Bath had no plug but didn't mind as I could still shower. Was convinient that I didnt have to constantly buy food. I could simply reheat ( 3 weeks I was here) in the microwave and had a fridge and bits and pieces. Bed was ok but couldnt adjust aircon. Though the building is almost 100years old I think, just check the plaque next to the entrance. Would stay here again for the convinience with my long term stays and its location. But for some luxury and someone to look after your stay, thats what a true hotel is for.", "Date": "September 1, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Location": "4", "Rooms": "5"}, "AuthorLocation": "Denmark", "Title": "“Nice Hotel with good location”", "Author": "Xantia81", "ReviewID": "UR38343300", "Content": "My friend and i booked our hotel online and was very exited to see if the room would look like in the pictures. And i can only say id did. The room was clean, with a nice bathroom and walk in closet. The staff was friendly and helped us storage our luagage for three days while we were on a small trip to Niagara Falls. The only remark was that they didnt change our towels and sheets for the 7 days we where there. Overall i can only say that it was a good hotel and definitly our mony worth.", "Date": "August 21, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Tampa,FL", "Title": "“Fabulous room ,clean, friendly staff, safe,comforatble”", "Author": "carolingnurse4", "ReviewID": "UR37835912", "Content": "I've read the neagative reviews and either the management is new altogether or has changed. I stayed for 16 days with my mother and teenage daughter. When we checked in, the lobby was average in appearance at best and we were a little concerned. We were still concerned when we stepped off the elevator into the hall. The appearance was fine but it was warm and humid and a little musty smelling. When we opened the room to our apartment, it was beautiful. It had hardwood floors and the whole apartment had a fresh smell. Everything worked well: A/C, plumbing, kitchen appliances. The staff was super friendly and accomodated every request in a prompt manner. They suggested restaurants, gave us tips for negotiating New York, and we felt very secure with a 24 hour front desk. They even saved us from missing our flight when we did not notice that our shuttle vouchers required a 24 hour pre-scheduling. The lady at the front desk personally flagged down a mini van taxi to take us to the airport. The price could not be beat! Very convenient section of the city, Upper West Side. One block from 1 train and minutes from extraordinary restaurants and shopping", "Date": "August 16, 2009"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Overall": "4.0", "Value": "5", "Location": "5", "Rooms": "3"}, "AuthorLocation": "Alfred, NY", "Title": "“Well worth the money”", "Author": "Colerocks", "ReviewID": "UR37188684", "Content": "Stayed there with my wife last Feb. for a weekend. The Woogo is everything they say it is - a no frills hotel. Don't expect the NY Palace. Expect a decent room, in a nice area, a great location at an amazing price. Virtually all of the bad reviews are from people who expected a full service hotel.", "Date": "August 9, 2009"}, {"Ratings": {"Location": "5", "Overall": "4.0", "Value": "5", "Service": "3", "Rooms": "5"}, "AuthorLocation": "Durham", "Title": "“Would stay here again!”", "Author": "Katiemolly1", "ReviewID": "UR34920553", "Content": "We visited new york for our joint birthday celebrations and stayed in the woogo, and we found it fine, the reception staff were young guys who were extremely helpful and pleasant. The room was a studio and was an ok size, felt very much \"new york\" and it was handy having the kitchen area. We felt safe here, and it was clean, the subway is just along the road and its right near the dakota building and strawberry fields part of central park. There is a great diner near the subway which i cant remember the name but its next to a card shop and florist, and it is like walking into a film set of 60,s NYC, and they do great bagels and coffee. We enjoyed our stay here and yes there are probably hotels more plush in the city, but we will defo be going back to stay at Woogo.", "Date": "July 16, 2009"}, {"Ratings": {"Service": "1", "Cleanliness": "2", "Overall": "1.0", "Value": "1", "Location": "4", "Rooms": "2"}, "AuthorLocation": "UK", "Title": "“Never again - came back to find all my stuff gone”", "Author": "rutlanderUk", "ReviewID": "UR34770247", "Content": "I flew over from the UK and arrived needing a shower. There was no hot water. when they told me it was coming in half an hour it took an hour and then it was filthy. i filled a glass of it and couldnt see through it! next morning still no water! went to a wedding the next night and returned at 130am to find all my stuff had been put away in the luggage room including my wallet and passport. they had thrown all my stuff in a case and because there is no one there after 10pm i had to sleep in my underwear and could not shower as all had gone. had wifes medication in case and when i informed security guard he told me that if she got worse i should take her to hospital. an excuse of a hotel. the people who run the desk are young, imature and rude and dont expect to be treated nicely there. their call centre is also a nightmare and no one ever wants to take any form of responsibility.", "Date": "July 14, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Location": "4", "Rooms": "4"}, "AuthorLocation": "Birmingham, United Kingdom", "Title": "“Very Happy”", "Author": "rugernaylor", "ReviewID": "UR34294319", "Content": "We stayed here in 2008 and were more than happy with our apartment, from what I gather standard of places to stay in New York aren't very high, maybe our expectations were quite low however we were more than happy with our apartment to be honest who spends a lot of time in their rooms when staying in New York. I would reccommend this place to friends & family!", "Date": "July 9, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "4", "Location": "5", "Rooms": "3"}, "AuthorLocation": "manchester", "Title": "“You get out what you put in!”", "Author": "caz197", "ReviewID": "UR34109100", "Content": "My partner and I booked this hotel through expedia. Only paid £500 for 6 nights, which at new York prices, this is an exceptional price. Ofcourse the pictures didnt really reflect the size or quality of the room, however it was a good base. The room didnt really have much natural light and it was very small, but the location really made it value for money and the rooms were clean! Bonus having a fridge. We used the location productively and visited a few bars nearby on Amsterdam avenue. Its also very close to central park (One of the best places on earth!) Also Sarabeths, which is a famous breakfast venue! Yummy ! If your all about the dinosaurs like me, then the natural history museum is closeby too. use the card machines for your tickets. I would recommend this place if you are a younger couple ( not meaning to be agest) No frills, but if you want frills and glamour stay at the ganesvoort!.", "Date": "July 7, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "5", "Location": "5", "Rooms": "3"}, "AuthorLocation": "New Jersey", "Title": "“Just like home”", "Author": "jonnyrnb", "ReviewID": "UR33256358", "Content": "I stayed at woogo central park apartments, I was checked right in, my room was great, I thought I would have to sleep in the same room as my colleagues but there was a seperate room for me. I felt safe knowing there was 24hr security. The location was great too, the 2 train was right out of the hotel, it was a great experience!!!", "Date": "June 26, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "1", "Overall": "2.0", "Value": "3", "Location": "4", "Rooms": "2"}, "AuthorLocation": "Boston, MA", "Title": "“Good enough...”", "Author": "aml518", "ReviewID": "UR33052261", "Content": "I wouldn't recommend this for a short-term NYC stay, but if you're staying for a longer period of time and looking for a cheap place, this is it. We were only here for 2 nights, and I wish I spent the extra money to get a nice hotel. That said, the location is great - very close to the subway and within a walkable distance to Central Park.", "Date": "June 24, 2009"}, {"Ratings": {"Overall": "1.0"}, "AuthorLocation": "London", "Title": "“Dodgy - Avoid!!”", "Author": "Oarolian", "ReviewID": "UR29335916", "Content": "Booked a studio apartment on Hotels.com only to find out on arrival that there \"was no record of my reservation...\" Seems to be a trend with this place based on other reviews! Hotels.com were helpful in booking another place but shouldn't have got to that situation. Avoid this dodgy company!", "Date": "May 4, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Irving, TX", "Title": "“Great value and location.”", "Author": "Tpatrick87", "ReviewID": "UR29007645", "Content": "The Woogo is clean and comfortable, what more could you want in New York City? If you only stay in your room I guess you would want more extravagant accomodations, but for the price, the Woogo is a great value.", "Date": "April 29, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Location": "5", "Rooms": "3"}, "AuthorLocation": "Melbourne, Australia", "Title": "“Can't understand bad reviews, loved it”", "Author": "hardcor", "ReviewID": "UR26088564", "Content": "Woo go is a great place to stay if you want a reasonabll cheap place to stay in NY. Very close to subway, three minute ride to Times Square, great supermarket down the road. Can't understand bad reviews. This place is NOT a hotel. If you want room service and your bed made up everyday, book into one! It's like a little home away from home. Make sure you ask for an upper floor, no noise!", "Date": "March 13, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Location": "5", "Rooms": "4"}, "AuthorLocation": "co derry", "Title": "“Will definitely return.”", "Author": "devlin123", "ReviewID": "UR26071141", "Content": "Very nice apartment, when I will return to New York will stay here again. The apartment was within my budget, cheap compared to some of the similar accomadation in Manhattan. The staff were very friendly and the location was very good, residental and very friendly . Only a short subway ride away from times square and all the other must see attractions in New York yet not to close to all of the madness either. The rooms in the apartment were very nice, its really up to yourself how clean you keep them, however in our 2 weeks stay we did get it cleaned twice. All in all, a very nice experience, especially given the price.", "Date": "March 12, 2009"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Location": "3", "Rooms": "1"}, "AuthorLocation": "AUSTRALIA", "Title": "“WARNING”", "Author": "JUDESARAMA", "ReviewID": "UR25228771", "Content": "This place is a dump, the service is zero, they charge your card without permission, i am still chasing up charges made to my card by them not authorized. The boiler pipes bang against the walls all night and keep you awake, the heater in my lounge room wouldn't work, when i used the power point in kitchen or bathroom the power would trip out and go off. BE VERY Careful. No assistance you keep getting told to talk to ANNA and anna never helps and just never really replies,,, although i bet she is busy with accounts. We are taking action through the appropriate channels to get our money back from them. They still owe me deposits they never have paid back. DODGY DODGY", "Date": "February 27, 2009"}, {"Ratings": {"Cleanliness": "3", "Check in / front desk": "2", "Overall": "3.0", "Value": "2", "Rooms": "3", "Location": "4"}, "AuthorLocation": "pa", "Title": "“okay for what it was”", "Author": "phoebendan", "ReviewID": "UR24055399", "Content": "Booked through expedia and we were only there for one night and were not expecting the red carpet. We got in late and left very early. The neighborhood was beautiful and quiet (for big city). We were a bit north of the touristy area but a train, a block away, did a non stop drive to the times square area. The hotel was not too hard to find and had a bit of a sterile appearance. The front desk had a minimal school like desk and the staff was more interested in clock watching than serving. I was to leave my credit card info with them and was a bit hesitant about that but it all worked out. The room was okay, bathroom was clean but tiles chipped and so on. Don't expect to get an extra towel or special treatment unless someone happens to know where they are kept and someone is on the clock to get them. Like I mentioned we were only there for the night and it was okay for the price I found.", "Date": "January 31, 2009"}, {"Ratings": {"Overall": "1.0", "Value": "1"}, "AuthorLocation": "mi", "Title": "“Could not be worse”", "Author": "jfdiii", "ReviewID": "UR22427710", "Content": "There was no heat and the windows did not shut properly. This means that we had a 50 degree night. My wife, who was coming to Sloan Kettering for a cancer treatment, had to spend the night sleeping with her coat on. In the morning, there was no hot water. So we went to the hopital with no shower. I called and complained. But they lied. Do not go there. These are bad people", "Date": "December 3, 2008"}, {"Ratings": {"Cleanliness": "4", "Business service (e.g., internet access)": "3", "Check in / front desk": "3", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "SLOVAKIA", "Title": "“Veyr good quality, price and location in center”", "Author": "bkujanova", "ReviewID": "UR21326924", "Content": "Hi, I really recomend this nice LARA GROUP apartment in New York City. It has very good location in city centre - 5 minutes by walk from Central Park, 50m from Subway station. Our apartment has been very clean and comfortable for 3 person. (see attached pictures) You have to pay full payment in advance but don´t worry, there wasn´t no problem. Beata Kujanova", "Date": "October 28, 2008"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Business service (e.g., internet access)": "1", "Check in / front desk": "1", "Overall": "1.0", "Value": "1", "Rooms": "1", "Location": "3"}, "AuthorLocation": "irelad", "Title": "“Woogo - Terrible place”", "Author": "janefromireland", "ReviewID": "UR20703539", "Content": "Hello, Recently stayed in Woogo. We were a party of three adults so booked a one bedroomed apartment. When we arrived it was between nine and ten in the evening. There was no bed linen supplied for the sofa bed. I went downstairs to request some and was told \"come back tomorrow - it's not my problem\" by the woogo employee responsible for checking people in and out. Eventually, when I refused to leave the lobby without bedlinen he got the message. How he thought we could sleep with no bed linen is beyond me. He was rude, unhelpful - and it was a simple request - can we please have some sheets and some duvets/slumberdowns for the sofabed. The sofabed mattress was thin and not comfortable, i.e. springs and bars stick into you, we ended up sleeping on the floor on sofa cushions because it was so uncomfortable. The bedroom had no door - when we enquired why there was no door, we were told that \"it ws designed that way\". The door frame had hinges still attached, so that seems unlikely. The bedroom with no door was right next to the kitchenette, so a door would have been nice. My husband found a cockroach but these are common in NYC. Noise - unbelievable noise every second morning at around 5am. This was caused by rubbish collection, our apartment was right at the front of the building so we dreaded the early morning wake up call. We requested several times to be moved, finally one nice member of staff offered to move us, but this was after five days and nights of requesting it. We were there for a week - when we requested that our apartment be cleaned we were told it would have to wait a day. That is a joke - they don't tell you they need two days notice to clean the apartment. Left luggage on checking out - they charge you five dollars a bag that you want to leave . We only stayed in Woogo because our other apartment booking fell through. I would NOT recommend woogo. Go to NY for a shorter period and stay in a hotel. The location is great, but the staff there are rude and unhelpful and if you are relying on a sofabed - you are in for an uncomfortable experience.", "Date": "October 7, 2008"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Business service (e.g., internet access)": "3", "Check in / front desk": "4", "Overall": "4.0", "Value": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "South Florida", "Title": "“Not Bad at All - Ignore the Other Reviews”", "Author": "Keesapullo", "ReviewID": "UR20542254", "Content": "I booked the room thru hotels.com. Since it was the off season, I paid a reasonable price. This hotel does not provide everyday cleaning, sheet replacing service. So if that is what you want, pay the extra $200 and spend it at another hotel. The location is great, a couple of blocks from the subway. A huge grocery store close by. My family stayed 4 days, and we made most of our meals in the fully supplied kitchen. Let me mention that I grew up in NYC, so I may be biased. I didn't need much attention from the hotel staff, because you will not get any. As long as I had a bed and clean room that was all I needed. NYC is very expensive and trust me when I say that you should save your money for site seeing rather than a hotel room. The rooms are very sparce, but you didn't come to NY to spend your day at a hotel. Remember that NYC itself is old; buildings are old, surroundings are old, but that is what NYC is all about. You want new go to Dubai. The location of this hotel is amazing. We actually say Bruce Willis and his younger daughter Tallulah on the street. I asked around and was told that many celebrities lived close by. I wish I could move back, but too expensive for me.", "Date": "October 1, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "4.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Plymouth", "Title": "“Felt like a true New Yorker!”", "Author": "PlymouthGirl", "ReviewID": "UR20114035", "Content": "Stayed here back in May, I found it after looked for apartments after realising I would be paying loads of money for a hotel. I think we paid £900 for 8 nights and most other hotels were around £1500. We booked through the Lara Group direct. Location is excellent, really close to a mainline Subway station and a 1 week pass was so cheap. About a 5 min walk from Fairway supermarket which is a great place for any supplies and also very cheap as all the locals shop there. Lots of nice restaurants around and as you are away from the main centre of NY you don't feel like you are being ripped off. We got our breakfast every morning from a man in a cart for about £3 for 2 of us! You shouldn't stay here if you want your bed made and clean towels everyday as it doesn't offer hotel services but as I said at the start it was alot cheaper!", "Date": "September 16, 2008"}, {"Ratings": {"Check in / front desk": "1", "Overall": "1.0", "Value": "1"}, "AuthorLocation": "San Francisco, CA", "Title": "“These people are crooks”", "Author": "rickscherle", "ReviewID": "UR18423781", "Content": "I booked a room here through Hotels.Com. When I arrived, I was told that there was no reservation in my name and that the hotel was full and the office was closed so there was no one I could talk to. I had to go back out into the rain and the dark and find another hotel. When Hotels.Com attempted to follow-up with these people, they were told that the reservations computer was down and they would have to call back. According to other reviews this is a common ploy. Do NOT do business with these people.", "Date": "July 30, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Atlanta, GA", "Title": "“amazing!”", "Author": "WhitneyP", "ReviewID": "UR18279356", "Content": "This hotel was absolutely amazing! My best friend and I spent a week in NYC for graduation, and the Woogo was the perfect place for us to stay! We felt like we were literally living in NYC for a week. Everyone was so helpful with everything... I had even left my cell phone at home and had it mailed to me, and they made sure that I got it as soon as it arrived. Both the staff of the hotel and the security for the apartment building were fantastic. The room itself was perfect... the bed was super comfortable, and since the weather outside was so hot, we always had our room like an ice cube which was great to come home to every day. I would definitely recommend this hotel to anyone! :)", "Date": "July 26, 2008"}, {"Ratings": {"Cleanliness": "4", "Check in / front desk": "4", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Woodbridge, Virginia", "Title": "“Three girlfriends found this to be just fine!”", "Author": "JaneandPaul", "ReviewID": "UR18256911", "Content": "We were 3 high school girlfriends (1954 graduates) having a mini-reunion in NYC. I made the reservation, but then after later reading some of the reviews, prepared for the worst, including bugs, filth, crabby help, and noise. Instead we found no bugs or trace of them, a very friendly and helpful staff, and a sufficiently clean and quiet room. The location was out of the center of things but the price was right and the subway was right around the corner. We had a double bed & single sleep sofa. The mattresses weren't top notch but we didn't wake up half paralyzed so they sufficed for a two-night stay. We didn't use the stove but the refrigerator worked and the small bathroom was attractive, clean and functional. We could live with a few carpet & sofa stains and the price was right - each of us spent just a little over $150 for the 2-night stay, including all taxes. So all in all, we considered our stay a big success and we had a wonderful time in NYC.", "Date": "July 25, 2008"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Check in / front desk": "2", "Overall": "2.0", "Value": "2", "Rooms": "2", "Location": "4"}, "AuthorLocation": "Kettering, England", "Title": "“I'll give this apartment a plug..... or two.”", "Author": "TravelCob", "ReviewID": "UR17305507", "Content": "After reading some positive reviews in reponse to some poor ones, I have to say I was a bit disappointed. First off, the warm welcome. The two guys on the front desk made Jack Dee seem like 'The Laughing Policeman'. The room was large, the bed was small, and the air con didn't work. To be fair they fixed it straight away, it had been turned off at the mains. And it was very efficient. On trying to shave, discovered the plug in the sink didn't work, likewise, when my wife decided to have a bath. The toilet kept refilling endlessly, which was quite noisy. And none of the doors seemed to shut properly. Also there were no curtains, just some inadequate blinds, so we were awake at about 5:30 every morning, except when we blocked the light out with towels and cushions, and then we overslept. And now the good points, yes there are some. Good shower, clean apartment, except for some soap scum where the shower met the bath, and the top of one blind, which was filthy. And the kettle and toaster worked. All in all, I suppose the main appliances were fine, the air con, and the shower, I can live without a plug. Oh, and there was some noise from other apartments, particularly above us, where they seemed to be dragging the furniture around at regular intervals. As has been said, a great location, for subway and Fairways supermarket. I'd definitely go back to the area, but not these apartments. I'd hated to have seen them before they were refurbished.", "Date": "June 28, 2008"}, {"Ratings": {"Service": "2", "Cleanliness": "4", "Business service (e.g., internet access)": "3", "Check in / front desk": "2", "Overall": "4.0", "Value": "4", "Rooms": "5", "Location": "4"}, "AuthorLocation": "London", "Title": "“A great place to stay”", "Author": "kchallis", "ReviewID": "UR17296299", "Content": "My boyfriend surprised me for my birthday and we were looking to live a mini new york lifestyle for a few days. The apartment block is ideally located and the room was very spacious. It has everything you need. A big television and a small kitchen area to cook dinner or breakfast in. The room was very clean and we have enjoyed our stay very much. There is also a good size gym with a range of equipment, which we used once, but would recommend running in central park instead. My only complaint would be that check in is not until 3pm which is a bit of a pain when you have had along flight and you arrive early. Also the staff have not been particularly friendly but we would definately recommend this place.", "Date": "June 27, 2008"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Business service (e.g., internet access)": "4", "Check in / front desk": "4", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Minnesota", "Title": "“Great Value for the money”", "Author": "hurricane_kt1", "ReviewID": "UR16671386", "Content": "I totally *LOVED* my stay at the Woogo Tempo Hotel! 1. The hotel itself is in an apartment building so you share the place with people who actually live there. Nothing wrong with that coz when you get in your room, you can pretend that you live in New York City! It has a little kitchen complete with pots, pans, kitchen utensils, plates etc. The room was clean and surprisingly quiet. We had a two- bedroom and both rooms are big enough. The bathroom is on the compact side but it's big enough to give you room to move around it. Just one hitch: bring your own towels. I think the towels provided were so old I just couldn't get myself to use them. Otherwise, everything was clean and usable. We didn't have a good view from our window, but that' okay. We didn't plan on staying all day in the hotel room. 2. The location was perfect. Although it's on the Upper West Side, it's only a few steps away from the nearest subway station which will take you downtown. Walk two blocks east and you'll find another subway station near Central park-- or stay in Central Park. 3. It's an apartment hotel, so there is no turn-down service or in-room dining like in a regular hotel. That's fine for me. I did need help from the door man to hail me a cab, and he was helpful and friendly enough to do that. The girl at the front desk was helpful enough. You can check your bags if you came in early and you can pay $5 per bag to check it when you check out early and your flight isn't till late in the afternoon. I'll certainly go back to this place.", "Date": "June 4, 2008"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Business service (e.g., internet access)": "3", "Check in / front desk": "3", "Overall": "3.0", "Value": "3", "Rooms": "2", "Location": "5"}, "AuthorLocation": "Guadalajara, Mexico", "Title": "“Good, coud be better”", "Author": "china_12Mexico", "ReviewID": "UR16438026", "Content": "Last week (May'08) we visited NY City and stayed at the WooGo Hotel - Tempo Apartments. Location was just great, half block away from Subway station, three blocks away from Central Park (south). Overall our room (studio) was ok, but most say that we booked for a Studio with Queen bed and had gotten a Double one which made our staying harder when trying to get some rest after walking all day long. The room size was ok for us, it included a kitchenette and DVD/CD Stereo. The bathroom was also ok but cleanliness not enough. The floor has some marks on it that you could assume were from some time ago not been cleaned properly, same as in the room so, better not to be shoeless. Noise was a bad point too. Some guests were having a dog into their room so they left it alone on it and it keeped barking, if you are sensible to noise, take your ear plugs to have some rest because you'll be listening ambulances and fire cars all the time. Overall, I should say that it is an expensive hotel but reasonable compared to others in the city, if you have enough time to plan your trip you should look into other options as there are some lodges that are rated very good and are less expensive. Location is great. Room is average, not too great and should have cleanliness more often as it is offered only once per stay.", "Date": "May 27, 2008"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Check in / front desk": "4", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "UK", "Title": "“A really great find - particularly for the price in NY”", "Author": "janeDo1980", "ReviewID": "UR15062105", "Content": "We are a couple from UK aged 27 and were looking for a great place to stay in NYC. We certainly found it! I booked this apartment as the prices of hotels in New York are just too expensive. I couldn't find anything that looked comparable to these apartments for the money. We prefer to spend our money enjoying the sights and eating great food rather than being too picky about the accommodation. The reviews from a while back worried me a little but I know that some people can be incredibly picky. Remember - these are apartments not a hotel so the service is more laid back... The apartment was fantastic. We had a separate kitchen with table and chairs, walk in closet with iron, and a cute little bathroom (clean!). The bed was a little bit creaky but it was comfy and clean. I also had great service from the guys downstairs and I found them very accommodating. I would definitely go back, and definitely recommend it to a friend or family. The location is fantastic too. Just a nice stroll from central park and very close to the 72nd subway. There's a great diner close to the metro where we stuffed our faces with delicious pancakes, eggs over easy, canadian bacon and maple syrup. Too DIE for! : )", "Date": "April 15, 2008"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Check in / front desk": "3", "Overall": "4.0", "Value": "5", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Annie from Suffolk, UK", "Title": "“Ideal for culture vultures with a side order of shopping”", "Author": "Annie056", "ReviewID": "UR14746695", "Content": "I was apprehensive, having read some negative feedback about rats and cockroaches, but our room was clean with no unwanted wildlife and no hints that they had ever been there. Woogo offers apartments and we had the smallest and cheapest - a bedroom with kitchen facilities (sink, microwave, two electric rings, crockery, etc) on the 12th floor. There was a huge TV. There's a launderette and gym in the basement. We stayed nine nights over easter and it worked out at £900, much cheaper than a hotel room and with much more freedom. Although it was very cold outside, Woogo had its own womb like microclimate. We couldn't work out the heating, so we opened the windows. It was fantastically convenient - the subway is just round the corner and we bought a seven day unlimited ride ticket for 25 dollars which was amazing value and worked for buses too. There was a superb supermarket, Fairway, just round the other corner and best of all a discount designer outlet, Lohemans, also nearby. Central Park was about three blocks away and crossing it directly brought us to Museum Mile. Our apartment provided what we needed and the staff, though not trained to be ingratiating, were nice if you were nice to them.", "Date": "April 2, 2008"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Business service (e.g., internet access)": "3", "Check in / front desk": "3", "Overall": "3.0", "Value": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "hamilton, on", "Title": "“It's fine...really”", "Author": "citygirl020", "ReviewID": "UR14603107", "Content": "Went to NYC with my daughter in early March 2008. Was a little worried about some of the reviews (e.g. rat in the garbage). Personally, I don't believe that review was true. The Woogo was fine. Not spic and span but it passed my daughter's standards and she has a very low tolerance for anything she defines as \"grub\". The \"apartment\" was bigger than hotel rooms I've booked in NY and had a really large closet. It was nice to have the kitchen factilities. Next time, I will request a room at the back of the building because the street noise is something I'm not used to coming from the 'burbs, but it wasn't that bad. Walls were a bit thin, but that wasn't really a problem, although a bit embarrassing as we were packing to leave because the couple next door were having quite a loud session! Overall, I would stay at the Woogo again. Staff not friendly, but I thought the receptionist felt a bit pressured and that was the reason for the her unfriendliness. The doorman of the apartment building was friendly and always said \"hi\". Definitely no rats or cockroaches and everything smelled clean when we arrived. Great location!", "Date": "March 28, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "newport", "Title": "“Wow!!”", "Author": "jadeegreen", "ReviewID": "UR13949959", "Content": "everything about it was absolutely amazing!!! three girls of us on holiday and it was just wow!! we went for a week.... and it just started to seem like reality rather than a holiday!! booking with hotels.com was soooooooo cheap and our room was fantastic!! we had two double bedrooms with plenty of towels... huge closets... a television... a fone!! theres wireless there too... wished we had taken a laptop! sofa in living area pulled out into bed... its on the corner of north face and urban outfitters is just around the corner.. as is a supermarket.. if u ask the guys at the desk they will give u delivery numbers,... we were lazy and had some groceries delievered haha! 72nd subway is just there... its in a fab area.. subway if u can work it out then location is amazing!! just to let u know tho.. its not a hotel... other people actually live there! the staff are fantastic, helpful and friendly! we had sucha amazing holiday! ive been before so ive had the hotel experience.... and 2nd time was amazing.. we just had sooo much space and sucha laugh! we read really bad reviews wen we came.. and were quite worried, but it was seriously amazing!!", "Date": "February 29, 2008"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Ohio", "Title": "“Great location, great hotel”", "Author": "alykaye", "ReviewID": "UR12619164", "Content": "Great location on Upper West Side, one block to 72nd subway station with access to 1, 2, 3, and 9. Levain Bakery, Buttercup Bake Shop, and Grey's Papaya all within 2 blocks. Great rooms, lots of space, clean, apartment-style accomodations. Great price--$101 per night with taxes. I love this place and will go back on my next trip to NYC.", "Date": "January 14, 2008"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "Beaver Dam, Wisconsin", "Title": "“I don't believe the bad reviews”", "Author": "Hilltraveler", "ReviewID": "UR12577567", "Content": "I stayed at this hotel twice in 2007, in March with three friends and in July with my husband and another couple. We had the one-bedroom and used the sofa bed in the living room both times. All of us loved it both times. The location can't be beat; we never saw any kind of bug, or rat. The mattress on the sofa bed is thin, no doubt about that. NExt time, I'll ask for a feather bed to pad it with, as another reviewer stated was provided for her. It's great in NY to have your own apartment with the ability to make breakfast and just a few blocks from Zabars, etc. There's a small kitchenette with frig and dishes. It's small, but that's apartment life in NY. My son, who lives in NY was actually quite impressed with the size and amenities. But if you want to skip this place, that's fine with me. I'll be more likely to be able to get a room when I book!", "Date": "January 13, 2008"}, {"Ratings": {"Service": "3", "Cleanliness": "2", "Check in / front desk": "2", "Overall": "2.0", "Value": "2", "Rooms": "3", "Location": "3"}, "AuthorLocation": "London", "Title": "“Ripped us off”", "Author": "jen_jen_3", "ReviewID": "UR12527920", "Content": "I booked directly with Woogo and thought I had myself a bargain. Rooms are nicely decorated etc, and pretty modern. However TV wasnt working, sheets were dirty and the toilet plumbing kept gurgling every night making a right racket. I told them and nothing was ever sorted. They said id get a refund...and 1 1/2 year later ive yet to receive it. I have called numerous amounts of times, still being told il get a refund, yet nothing. They are compulsive liars. Hotel is good if nothing goes wrong, but if you expect a refund, then trust me you wont get one. Try and avoid paying all in one go, and best to pay as you leave cos then you can refuse at least!", "Date": "January 11, 2008"}, {"Ratings": {"Service": "1", "Cleanliness": "5", "Business service (e.g., internet access)": "3", "Check in / front desk": "3", "Overall": "4.0", "Value": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Boston, MA", "Title": "“I really liked this place!!!”", "Author": "bethany484singer", "ReviewID": "UR12291171", "Content": "I am a young opera singer, and I travel frequently to NYC. For the price I paid, I had a lovely room...spacious and very clean and new. I was a bit concerned with some of the reviews I read this morning, and I wonder if they are reviews for the WooGo Midtown, not the Woogo Central Park. I really found it to be lovely and in a great location. I had an NYC friend come and see me who also said it was a fabulous hotel for NYC - plenty of space. I stayed on the 9th floor. I am wondering if I just got lucky with that particular room....but I would recommend the accomodations that I had. I do have to say that the staff didn't bother to bring me a hairdryer, but other than that the experience was A+. Very clean, new fixtures...nice appliances and spotless fridge.", "Date": "January 3, 2008"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Check in / front desk": "3", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Paris, France", "Title": "“Perfectly decent room despite the warnings”", "Author": "PopMack", "ReviewID": "UR11712429", "Content": "We stayed three nights in December 2007. Despite the warnings we found our room (on 16th floor, looking out onto the street) to be perfectly ok - warm, clean, modern furniture, fully functioning kitchenette, large comfortable bed, and a great view! The only staff member we met was at the reception desk who seemed a bit taciturn but friendly enough. So no real complaints and we certainly can't report any of the discomforts mentioned by some of the other reviewers.", "Date": "December 20, 2007"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Business service (e.g., internet access)": "3", "Check in / front desk": "4", "Overall": "4.0", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Scotland", "Title": "“Dont listen to negative reviews (On holiday From Scotland)”", "Author": "Tazjeep", "ReviewID": "UR11579899", "Content": "After reading all the negative reviews I have to say I was a bit concerned about this apartment block but boy was I surprised. Myself and my wife along with 2 sets of friends booked 3 executive studios and all 3 were spotless, warm and well equipped. The hotel staff were more than helpful and the location was excellant whether you wanted to walk or take the subway into Time Square and all the other main sites in New York. We spoke to other people in the apartments who had read the negative reviews but were also pleasantly surprised with their apartment. If you are looking for a Hilton type level of quality and are willing to pay a lot more in NY then this might not be the place for you but at the price we paid it was well worth the money. We would all highly recommend the WooGo for location and New York level value for money(as NY is not cheap for hotels compared to other parts of the States)", "Date": "December 15, 2007"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Business service (e.g., internet access)": "3", "Check in / front desk": "3", "Overall": "3.0", "Value": "3", "Rooms": "3", "Location": "5"}, "AuthorLocation": "London", "Title": "“Superb location, apartment fine.”", "Author": "LondonKazza", "ReviewID": "UR11497306", "Content": "3 of us stayed in apartment 1315 which was a one bed apartment with a sofa bed in the lounge. It also had a kitchenette and 2 bathrooms, which we weren't expecting. Everything worked fine, including the TV, microwave, aircon etc. The rooms were clean and tidy and looked recently painted. The furniture was older and the sofa bed was in need of replacing or certainly repairs, but otherwise we were very happy with it and the location is perfect. A safe neighbourhood to go out in and right next to the express subway station at 72nd. The Woogo is run as serviced apartments and not as a hotel, so you shouldn't expect the same services as a hotel. There are shops just round the corner to buy things like loo roll and washing up liquid etc. (they provide hand soap and a couple of loo rolls, plus towels and sheets - maybe worth packing an extra towel) We found the front desk staff very polite and the night porter was a really nice friendly man. This apartment was cheaper than any hotel we could find with availability in December, it seems the whole of Manhattan doubles it's prices at Xmas.", "Date": "December 12, 2007"}, {"Ratings": {"Overall": "1.0"}, "AuthorLocation": "Adelaide, Australia", "Title": "“Definitely not worth the money we paid”", "Author": "livinginpenang", "ReviewID": "UR11258804", "Content": "First, there is 1 good thing about these apartments -- we really liked the location. Half a block from the subway, lots of restaurants, quite perfect for a family. But expect some problems. The service is definitely 'take it or leave it'. They really don't care very much what problem you have. They get your money in advance and you will never ever get any of it back. One of the little surprises was that the price you get quoted is a 'cash' price. Once you read the fine print you'll see they'll stick you with another 2.5% to use a credit card. Our room was reasonably clean although once there, they will only clean it for you if you stay more than a week and request it. We only saw cockroaches once thank goodness. Most things functioned and all the pots, plates, etc. were present. The TV cable converter was not functioning so we got only a couple local stations -- trust me the clerks are not interested in fixing it. If you need any extra pillows, sheets etc. expect to ask many times until they finally arrive. It may be a $350/night room but service is definitely not included. You'll need to buy everything because no cleaning soap is supplied, or coffee filters, or salt, pepper... The rooms are reasonably quiet except when someone is talking in the hallway. We had a slightly deranged lady next door that seemed to be always angry at someone and often yelled in the hallway. We made sure we left quietly so as not to face her ire! Worst of all was the evil 'sofa bed'. It was so poorly designed and partially broken so I ended up sandwiched over a metal bar all night. Overall this place is horribly overpriced for what you get, and you should expect numerous problems, most of which you'll have to live with.", "Date": "December 5, 2007"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Check in / front desk": "5", "Overall": "4.0", "Value": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "winchester, england, UK", "Title": "“Small Comfortable Room”", "Author": "normality2000", "ReviewID": "UR10821880", "Content": "Review by professional couple aged mid-30's from UK. First time in NYC. Very simple to book with Woogo on their website with freephone number from UK. Apartment was approx. 11' by 11', clean and comfortable (you are only sleeping there!). Small but not dubious staining on bed linen; comfy bed; no bedbugs or roaches; some fittings need revamping but should not affect your stay; fridge; microwave; large TV with 100's channels; closet space; medium sized ensuite; plenty hot water and towels. Very conveniently situated on W 73rd / Broadway (out of 73rd Street station, turn right at next junction, just past the Tempo church on the LHS); two blocks from Central Park and Dakota Building; lots of food shops to the north (6am till 2am supermarket that does preprepared food); quiet residential neighbourhood compared to Times Square etc. Even a tea shop enroute for Central Park! I enjoyed the convenience and location. There is a $5 per bag if you want to store them on your last day. Rated above average because I've not seen anywhere else for the amount we paid.", "Date": "November 14, 2007"}, {"Ratings": {"Overall": "1.0"}, "AuthorLocation": "cork", "Title": "“woogo do not stay here at all cost!!!!!!!”", "Author": "amycork", "ReviewID": "UR10428555", "Content": "I am just back from New York today , if you want to waste your money this is the place to stay .The apartment was like a building site it had roaches crawling around, not clean at all, very dangerous if you have kids with you. I would rather stay in a gas station toilet than here. The staff were very rude when I tried to get a refund, I could not stay here because of the dirt and there was no refund. Stay in a hotel with a good name.", "Date": "October 29, 2007"}, {"Ratings": {"Overall": "1.0"}, "AuthorLocation": "Scotland", "Title": "“Nightmare at NY Tempo- Woogo Central Park”", "Author": "MishyMo", "ReviewID": "UR10354594", "Content": "Sadly I was niave and unaware of trip Advisor before I booked my daughter & I into these apartments. Like others we found the place to be filthy; stained furniture/ carpets. Poorly laundered linen. Very unhelpful unfriendly staff. However after being refused my money back and trying to make the best of things, a live Rat in the bin within our apartment was totally unacceptable. Not to mention the cockroaches. I gained little reaction when I demanded that the offending rodent be removed, it seemed to be an every day occurrence to them. I ended up cleaning the place and buying bed linen on my first night in order to cope with the awfulness. I have returned home and have no help from Woogoo Staff, feel throughly depressed and disappointed having looked forward to this trip for such a long time.", "Date": "October 26, 2007"}, {"Ratings": {"Service": "1", "Cleanliness": "2", "Check in / front desk": "1", "Overall": "1.0", "Value": "1", "Rooms": "1", "Location": "3"}, "AuthorLocation": "new york", "Title": "“Outrageous”", "Author": "americangirl60", "ReviewID": "UR8838814", "Content": "I arrived at Woogo Central Park at 10:30 at night with confirmed reservation in hand for two nights - a confirmation number, a pin number, and proof that Woogo had my credit card information AND that they accepted the type of credit card that I had given them. I was told at the reception desk that I had to pay in cash upfront for two nights - over $800. They said that after 10 at night they don't accept credit cards - this was never mentioned in any communication, not on the website, not on the confirmation. With no other choices at that hour of the night (I did try to find another hotel but after two calls and no success gave up) I gave up and went to an ATM and got the cash. Another guest was at the desk with the same problem. When I did get up to my room, it was bleak, shared with roaches, no security lock on the door, and a crudely printed sign on the door that was not a fire escape plan but rather a notice about where to put trash. After many good experiences booking online, this was a tremendous disappointment. The management blamed bookings.com, but I say that if you are in the hotel business you have a responsibility to your guests to treat them well and safely.", "Date": "September 21, 2007"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Business service (e.g., internet access)": "3", "Check in / front desk": "3", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "HERTFORDSHIRE", "Title": "“great stay”", "Author": "smudger1971", "ReviewID": "UR8655430", "Content": "Hi, please contact me if you would like to know more about woogo appt in Central Park. All i will say is that we stayed in room 1601 (last but one to top floor), great room, clean, not that big but had just cozy feel, queen bed (comfortable), cooking area, fridge / freezer, air con (worked well ), microwave, iron / board, cable tv, plenty storage space, good sized bathroom. Woogo located in excellent position in NY, west side but close to subway (one stop from times square by express train 2 or 3), supermarkets, good restaurants (try Mikes Bistro, Citrus, both walking distance), central park (go to Tavern on Green in central park for most amazing restaurant, pricey but cool garden to sit in). Staff in Woogo are helpful and will readily deal with questions and problems. Sheets and towels are not changed unless you ask them, we stayed for ten days and we asked them after 6 days, happy to oblige with clean ones. The appts are scattered among appts which are owned and lived in by New Yorkers so you might get a bit of noise as it is there home, we only met good people and our flat was never affected by anything or anyone. Price was good for ten days (just over a grand) although like other reviewers stated dont expect the appts to be like a hotel, they are what you make them and for us they were ideal, we would definitely stay again, especially in room 1601. I am including photos for you all to see, cheers, gary.", "Date": "September 4, 2007"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Check in / front desk": "1", "Overall": "1.0", "Value": "1", "Rooms": "1", "Location": "3"}, "AuthorLocation": "England", "Title": "“Worst place i've ever stayed”", "Author": "nemo26uk", "ReviewID": "UR8605549", "Content": "LOVED NEW YORK, but hated everything about this dirty hole. Being clean people, we didn't appreciate the filth, grime and general heavy traffic this place had to offer. We did make friends with a few roaches that came out from behind the so called cooking area but I would have prefered to have ferritted around the bins to prep a meal. We even ended up going out on the first day and buying cleaning stuff as it made us feel better about staying there because the staff shall we say 'didn't care, and hadn't got a clue. Certainly won't be fooled by the 'stay in an appartment' vibe that we fell for and will ALWAYS book a reputable hotel chain from now on. Lesson learned! My annoyance was that we had booked this for a special occasion - I was stuck in the dilema of kicking up a fuss instantly at the moment we got there or keeping the peace so we didn't spoil our holiday – I know what I will do next time because everything about this place leaves a bitter taste in my mouth. Very unprofessional, even on arriving – my gut said 'dodgy', I wasn't wrong. After complaining to the people we booked through when we got home, offering to show some interesting pictures – we got offered a poultry $50 dollars – was the icing on the crap cake. Please avoid. Please avoid. Please avoid.", "Date": "September 2, 2007"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Check in / front desk": "3", "Overall": "3.0", "Value": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "London, UK", "Title": "“WooGo Central Park is an OK place to stay!”", "Author": "plumcake22", "ReviewID": "UR8280496", "Content": "I booked a 1-bedroom appartment at WooGo Central Park, because we were looking for somewhere to stay with our two children, didn't want to spend a week cooped up in one bedroom with them and needed somewhere reasonably priced where we could make our own breakfast and snacks and thereby keep costs down further. After reading the reviews on Tripadvisor, I was positively scared of going BUT it was fine. As other reviews say, there is no point coming here if what you really want is a swank hotel ( you'll just have to fork out a whole load more cash for that). WooGo provide an appartment, not a serviced hotel room, and there is no point gnashing your teeth about the lack of towel changes - just take extra with you. The appartments are not huge, but New Yorkers live in flats this size, and for us it was fine as we were out most of the time. The kids had the bedroom, we slept on the sofa bed ( which was fiendishly uncomfortabe) and there was enough space for our stuff. It was a litte grubby round the edges, but adequate, and I 've stayed in lots of far worse accommodation. The biggest drawback was the lack of air-conditioning, and the apartment seemed to have a curious ability to attact heat. This could be a reason not to stay here, but after weeks of torrential rain and low temperatures at home in London, I quite enjoyed it. We saw no bugs or roaches, but then we took our rubbish to the communal bins frequently. The location is fantastic: there's a subway station on the corner of the street, there are great shops and delis nearby ( the Fairway supermarket was worth the trip to New York on its own), it's an easy walk to Central Park and the neighbourhood is busy but not frenetic and feels safe. The staff are the desk don't fall over themselves to help you, but are civil and respond to polite enquiries. When the cable TV stopped working, we reported it and it was fixed when we came home. The phone in the room only works if you buy a phone card, but the staff will tell you this if you ask. WooGo Central Park is not luxury, but it suited our needs very well. What we paid for a week would have got the four of us 2 or 3 nights in a hotel, and you have to bear this in mind when you evaluate the place. I would recommend it to friends who are on a budget and can cope with a few fluffballs in the corners.", "Date": "August 2, 2007"}, {"Ratings": {"Service": "2", "Cleanliness": "1", "Business service (e.g., internet access)": "1", "Check in / front desk": "1", "Overall": "2.0", "Value": "2", "Rooms": "2", "Location": "3"}, "AuthorLocation": "Denver", "Title": "“Dicey...”", "Author": "SnapKracklePop", "ReviewID": "UR8181535", "Content": "The Checkin process was a shakedown for cash, offering up to a 20% discount, citing the Credit Card processing was ofline and they really needed cash. Have a cell phone, won't work in the building, the in room internet was offline. The \"business center\" was two older computers that required 7 minutes to print a Google map (this is not an exageration, you pay $0.10 per minute to use these computers that do have Internet Access, oddly...The rooms are very basic, Dorm like, and yes, double occupancy with ever present roach guests. No daily maid service, checkout before 9AM means leaving your key with the Guard. Overall, a third world experience in New York, great for the adventure traveller.", "Date": "July 18, 2007"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Check in / front desk": "2", "Overall": "1.0", "Value": "1", "Location": "5"}, "AuthorLocation": "Santa Rosa, CA", "Title": "“Dangerous for Women and a Scam”", "Author": "VoiceofExperience", "ReviewID": "UR7987528", "Content": "This place is beyond horrible. I understood that I was renting an apartment, not a hotel, but I was not expecting filth and danger. Beyond the tricked out lobby, the place was a slum. \"Luxury building?\" you must be joking. I was later informed by a friend who lives in the neighborhood that the studios rent for $400 per month, and Woogo charges almost $400 per night! The walls and carpeting were filthy. The furniture was stained and the bed linens looked slept in. There was no toilet paper in the bathroom and I had to get the night watchman (they don't have actual hotel employees at night) to get me a roll from the employees' bathroom. Worst of all: the only lock on the door was a twist lock in the doorknob itself. There wasn't even a security chain! As a woman travelling alone, this is extremely dangerous. The door could have been opened in a second with a credit card! I piled up furniture in front of the door and got out of there as soon as I could. Yes the location is fabulous, but this is dirtier than a lot of places I stayed in the third world as a poor backpacker. The desk person was helpful and seemed ashamed by the property. He advised me to ask for my money back. Once you're in contact with customer service, the fly-by-night, international scam nature of this organization becomes apparent. My credit card showed a charge from some hotel in Jamaica, and their written communications show that you're dealing with someone in Eastern Europe or the Far East. This is a SCAM, and should be shut down.", "Date": "June 25, 2007"}, {"Ratings": {"Overall": "1.0"}, "AuthorLocation": "cor", "Title": "“WARNING ITS A DUMP”", "Author": "del504", "ReviewID": "UR7796186", "Content": "Hi four of us booked in on saturday the 2nd until thursday the 7th and i ended up leaving a day earlier, i dont know where to start as its a joke of a place, firstly nobody cleaned your room thats ok for a night or to but 5 days is a bit much secondly on sunday night one of us flushed the toilet and it overflow luckily one of us had the cop on to lift up the toilet system, we rang the reception and they told us that nobody would be there till the next day so we had to put the towels all around the toilet so we had no towels for the next day. we looked for a different room and it was such an effort but eventually we got a new room and they thought that they were doing us a favour, we asked for clean towels and at first we were not getting them but in the end he gave them. all i can say is look elsewhere there is much better places there.", "Date": "June 6, 2007"}, {"Ratings": {"Service": "2", "Cleanliness": "2", "Business service (e.g., internet access)": "3", "Check in / front desk": "3", "Overall": "3.0", "Value": "3", "Rooms": "2", "Location": "4"}, "AuthorLocation": "Dallas, TX", "Title": "“***Read this review first!***”", "Author": "silverjack58", "ReviewID": "UR7628524", "Content": "Ok people, please read this review before you read any others, AND before you plan on booking the WooGo-Central Park apartments for your stay in New York. Trust me, as a poor married college student, I understand that everyone is looking to get the absolute best deal possible when traveling--especially to expensive places like New York. So it makes sense to try and book the place that's only $195 a night, instead of say, the Marriot at $350 a night...But, if you want to save the money and stay at the WooGo apartments there are two things you must understand first!! 1. THESE ARE TEMPORARY APARTMENTS!!! This is not the suite at the Westin Times Square, this is a low-key, low-maintenence facility that is for people who do not care about having their rooms cleaned everyday (because they won't be!!), or care about the frills of a nice hotel (because there are none!!). Think of it more like a slightly nicer hostel/ your friend's apartment instead of a full-service hotel, and you'll start to get the idea... 2. The people that are working the front desk are your average, gruff, immigrant New Yorkers who are expecting you to understand the \"no service\" policy they adhere to--which is why you'll be met with a certain indifference when you come down wondering why your room wasn't cleaned today... Now, as for some of the other reviews listed here which cite the roaches and dirty rooms...I can't speak to any of that. During our week-long stay, we encountered no roaches or other rodents in our (tiny) room. Our \"broken\" airconditioner was fixed within 15 minutes with the flick of a switch--turns out someone had just tripped the breaker--, and when we arrived, our room was (moderately) clean, with no foreign odors or stains (including the sheets). Desk people were, gruff but not unkind. (Hey \"it's Noo Yawk\", right?) Maybe the WooGo is just a hit-or-miss proposition, I don't know...But, I will say that I'm sure you'll have a better time of it if you go in with the right expectations...err, low expecations. Bottom line--if you just want to save the money, and don't plan on spending a lot of time in your room, this might be a good option for you. If you're traveling with a large party, or with kids, spend the money and stay at the Marriot--you'll certainly get no mint on your pillow at the WooGo!", "Date": "May 15, 2007"}, {"Ratings": {"Overall": "3.0"}, "AuthorLocation": "Toronto", "Title": "“Surprised .... and somewhat pleasantly”", "Author": "Shugasong", "ReviewID": "UR7433274", "Content": "After reading all the reviews, I warned my sister and my pregnant friend about the reviews I saw here. I wanted to scare them so that their expectations were low and they wouldn't be freaked out when we got to the hotel. Someone had mentioned that Woogoo is not a hotel, and that is what one has to get into their head when they book here first, then you won't be that disappointed. The men at the desk were very very accommodating to us, and we didn't have any issues with our room. When we arrived in our room, about 10 minutes later, one of the men at that front desk called up and asked me if everything was alright with our room. I am not going to lie, my friend did see one cockroach but after that, we didn't see anymore. We hardly spent time in our room so for our purposes, it was worth the money we paid for it. The very best thing about this place is the location. It really is perfect. We walked a lot and also travelled on the very convenient subway system. If you stay here, be sure to go to Big Nick's it is dive but the food and people serving in it are quite friendly. We also shopped at the grocery store for some water fruit (Fairways) I guess in all, sometimes we get what we may deserve. If you speak to people with the same vigor you expect to spoken too, people will be open and for that, I have no complaints. I would recommend this place, but I might be hesitant to go there during the summer in the dead heat unless you can be assured of an air conditioner or fan in your room. We were there (April 20 through til April 23) and it was very hot at night. Thanks to some of the reviews we brought our own towel, soap, toilet seat covers and extra sheets for the beds.", "Date": "April 25, 2007"}, {"Ratings": {"Service": "1", "Cleanliness": "2", "Business service (e.g., internet access)": "1", "Check in / front desk": "1", "Overall": "1.0", "Value": "1", "Rooms": "3", "Location": "4"}, "AuthorLocation": "USA", "Title": "“Woogo is like Yugo -- Spend your money elsewhere”", "Author": "axrus", "ReviewID": "UR7166527", "Content": "I stayed with my family for 4-days in a studio apartment. I would say this is one of the worst hotel stays we have had. The service is downright terrible -- unfriendly and unhelpful staff. To start with, there was no mattress in the sofa sleeper and it took them two days to find me one, after repeated requests. The hotel room was very hot even though the outside temperature was only 40 degrees F. There is no temperature control in the room, and we had to use the air conditioner (with the attendant noise) to bring the room temperature to a tolerable level. There was no Internet connection available in the room although they advertise that they offer Internet access. There were only 2 towels for the three of us, and we never got the extra towel we requested. During our stay, we heard several other residents also complain to them about various things, but few got satisfactory resolution to their complaints. We would have left after the first day, except that we had pre-paid for our stay via ratestogo. The only positive aspect of our stay was the convenient location. I suspect the company survives because of unsuspecting first-time customers. I am sure they get very few repeat customers. Don't waste your money on this hotel. For the same price, you can find better options in New York.", "Date": "March 15, 2007"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Check in / front desk": "3", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Northwest England", "Title": "“Great Stay !”", "Author": "nikkiN.westEngland", "ReviewID": "UR6894002", "Content": "We were pleased when we managed to get a great deal on a trip to New York through Expedia. Excellent price, direct flights and what looked like good apartment accommodation. After reading all the reviews on Woogo Central Park - Tempo Apartments, I began to get really worried. Dirty apartments, cockroaches, rude staff.....what were we letting ourselves in for? We decided we would grin and bear it, we were not planning on spending much time in our rooms and surely it couldn't be that bad? We were right to do so.... the apartment was brilliant. I think it is important to mention that this is an apartment, not a hotel. You are renting a room for your stay and the guys at Woogo do not have to provide you with towels, toiletries and other extras you would expect to find in a hotel. We checked in at 1pm and was told our room wouldn't be ready until 3pm, the guy on reception locked our cases away and we killed time until the room was ready ( I was still very nervous at this stage at what state our room was going to be in) Anyway, 3pm we returned and were given our keys and collected our cases. With baited breath we opened our door for room 205 and were pleasantly suprised. The room was a good size, double bed, mini kitchen, sofa bed and quite modern furniture with a TV and stereo, looking out onto a quiet street (well quiet for New york!) The bathroom was clean, no cockroaches to be seen (no need to use the cockroach traps I had packed then!) the bedding did appear to have been slept in, there were a few stray hairs in it, however we had been left some clean sheets so we quickly changed them and everything was fine. The room was nice and warm, the bathroom was really hot but we left the door open most of the time so it was no big problem. Overall it was a great relief and we can't complain at our accommodation. For what we paid it was a great bargain. Space in New York hotel rooms are usually limited. We had bags of room. The location was good, there is a subway stop around the corner and plenty of shops on the Upper West side. I would definately reccommend staying here.", "Date": "March 1, 2007"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Business service (e.g., internet access)": "3", "Check in / front desk": "3", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Birmingham", "Title": "“Great location, nice and clean”", "Author": "uktravel-7", "ReviewID": "UR6797412", "Content": "I have come from the Uk to NY with my wife. We were looking for a nice and central location hotel. We stayed at the Woogo Central Park, the 9th of February, for one night. The room was very clean, spacious and you had all the facilities that you would have in your own apartment, even a cd player and cables. The gym is really nice, For those of you who likes to run. The price was great, $79 for two people per night. That's a bargain price for NY. Staff were friendly,location was great, in the centre of all the action. I could walk to Central Park, and it was a walking distance from the MOMA as well. Overall, it was a great hotel at a great price. Great value for your money!", "Date": "February 15, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Business service (e.g., internet access)": "2", "Check in / front desk": "5", "Overall": "5.0", "Value": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Pepsi", "Title": "“It made the trip AMAZING”", "Author": "PepsiBb", "ReviewID": "UR6751024", "Content": "After reading various negative reviews about the place I didn't go with high hopes, though I was suprised at how nice it was! We went for the NY marathon and it was a great base, just a short walk from Central Park, I loved it !The rooms were a decent size and it was all very tidy when we arrived. They weren't huge, but with 3 bedrooms they didn't really need to be. Sure there was lots of noise from the street, but doesn't that just add to the whole buzz of being in New York ?! The staff were lovely, and kept our bags safe on the last day when we had to leave so we could have a final wonder of this great city! I would definely advise going, I can't wait untill I can go again! Ps. There is a great little deli down the round, perfect for breakfast!", "Date": "February 6, 2007"}, {"Ratings": {"Overall": "1.0"}, "AuthorLocation": "Sydney", "Title": "“Woogo = New York's Mistake”", "Author": "Zaer0", "ReviewID": "UR6726663", "Content": "Woogo Apartments on 72nd Upper West Side, New York City, The name sounds harmless, and to an extent, appealing. I must warn you now that this is only because it is located in New York City. The scam that is Woogo is apparently a worldwide phenomenon that has plagued the western world for some time. I was not the person to book the accommodation for my New York holiday that I had been anxious about for the final two years of high school. I had seen one review of Woogo Apartments, and I was not impressed. But as I finally had an opportunity to go to New York, USA. I would brush it off my shoulder as I would stay almost anywhere to get to New York. We arrived and upon seeing the sites of the Manhattan skyline pass me by on the windows of the taxi. However to be dropped off at our destination of Woogo Apartments Lincoln Center was soon to crush my hopes for the adventure that would be to stay in New York City. Upon hauling the luggage of my mother, sister and my own all by myself up the stoop entrance of the apartments of Woogo only to view the ‘doorman’ talking on his cell phone to one of his buddies, whilst failing to recognize that guests are trying to get into the apartment. We were told by front desk, that we had been transferred to the Woogo apartments on 72nd West. We had no way of hailing a taxi at 11pm to take us to 72nd, so we settled for walking with all our luggage, in the dark, at night. Upon arrival to the apartments of 72nd West, we were to open and haul all our luggage inside on our own once again. This would become a common practice. To cut to the chase now – Woogo lacks any management. There were difficulties in getting into a room for the night in the freezing cold, as the front desk ‘management’ didn’t realize that we were due to arrive that night. The room was a one bedroom suite. It was the smallest one bedroom apartment I had ever seen. I tolerated it, just so that I would still enjoy my holiday in New York. We had insufficient bedding, one mug between the three of us that we would have go and buy some plastic cups for ourselves for four days before getting two glasses. There was one role of toilet role and NO CLEANING done in the apartment for our entire stay! ‘Management’ informed us that cleaners would come once every 7 days, but after 16 days, they had not set foot in our apartment! We became fed up when the toilet overflowed and I had to use my ONLY bath towel to mop up the mess, leaving me with no spare towel and no possible way to get one. The next morning we collected up all our bedding and our three towels and dumped it in their lobby and told them to deal with it! The next day, we received the exact same bedding and towels back in our apartment, I didn’t believe that they could have possibly been cleaned, but mealy dried! This vulgar and disgraceful behavior on Woogo’s part was enough for us to pack our bags and move out. While we were preparing our gear to change to a brownstone apartment on 88th West, at 7:30pm cleaners barged in to clean our room – disgraceful. To disturb guests at night, in their room with three cleaners who failed to clean sufficiently or replace the missing toilet roll! We left the apartment and moved to a brownstone uptown which was a heaven compared to the gluten scum of the deplorable and scandalous management that was Woogo apartments! We were scheduled to stay in Woogo for 6 more night after leaving. My mother had put in writing of all the faults and mismanaged aspects of woogo, to woogo almost nightly. Yet they have still charged us and debiting our credit card falsely for services and accommodation that we did not use! WARNING, WARNING, Woogo Apartments have committed acts of fraud. DO NOT USE Woogo! (I have reason to believe that they rented out the apartment to another unsuspecting person(s) once they had realized we had left!) I write this review in the hope that you, the reader, will not fall into the same mistake that me and my family did when it came to choosing an apartment chain to stay with in New York City.", "Date": "February 1, 2007"}, {"Ratings": {"Overall": "2.0"}, "AuthorLocation": "USA", "Title": "“\"Top 10 Reasons\" why you WON\"Tt go to Woogo - Central Park”", "Author": "splitpeasouplover", "ReviewID": "UR6605958", "Content": "1. Live ROACHES (babies & adults) on floor and on stove. 2. Filthy stove burners. 3. Toilet wouldn't stop running even if we jiggled it. 4. Sofa bed very uncomfortable when pulled out. 5. Cable didn't work-and they didn't fix it. 6. Platform bed VERY uncomfortable - tossing and turning. 7. AC--would keep spitting out hot air even when turned off or on air . Had to raise the windows to survive and use cold washcloth. 8. No phone book-guy at front desk said he didn't have one either (looking for pizza delivery). 9. No list of pizza places for delivery. Ended up very expensive. 10. Fridge was dorm fridge size and on the floor-inconvenient. 11. marble on floor of bathroom and hard wood floors were hard to walk on after a long day. 12. no maid service -- had to ask for more toilet paper, a garbage bag, ran out of clean towels. 13. Asked for extra pillow and was given a very lumpy one. 14. candy and drinks and canned soup in room and fridge by hotel were like a mini bar and very expensive and a big temptation to children/teens. 15. toiletries provided were very minimal-breck shampoo and dial soap (2 small bars). 16. Charge $10 a day for internet access in room. 17. No comfortable chairs-just a glass table and some rattan type chairs. 18. They don't really help you with your luggage. 19. Anyone overweight, pregnant, arthritic is not going to be comfortable here. 20. Feel far from times square, greenwich village, union square, financial district. 21. Porn on the tv. PROS: 1. Felt relatively safe in upper west side. 2. 1/2 block to subway station. 3. next to Rutgers Presbyterian church. 4. Chiropractor office entrance in hotel (you'll need it after you sleep on the platform bed) 5. One bedroom unit is spacious. 6. Lobby is cool. 7. one staff guy on nights is helpful and total new yorker. 8. very crowded fairway grocery about 2 blocks away. 9. citibank with atms 1/2 block away. 10. cab ride to zabars/filenes basement/h & h bagels is fairly short-great people watching in zabars cafe on sunday morning 11. great water pressure in the shower 12. working smoke alarms (went off from steamy water in hot shower) 13. closet was big and would have held a lot of suitcases 14. Couch was pretty comfortable when it wasn't made into a bed. 15. Near a Sephora. 16. Easy to hail a cab up by citibank. 17. You feel what its' like to live in an apt in nyc as many people do in the building-they just rent out a few units the rest are lived in. 18. Taking subway north to see Columbia U. is very doable. 19. Close to Central Park.", "Date": "January 16, 2007"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Check in / front desk": "2", "Overall": "1.0", "Value": "1", "Rooms": "1"}, "AuthorLocation": "Warrington", "Title": "“Tempo of Horror”", "Author": "shelleby", "ReviewID": "UR6589707", "Content": "Me and my boyfriend were celebrating our 4th anniversary. We arrived in style at the Tempo apartments expecting a romantic time in New York. The lobby was quite impressive so we paid upfront for our room given a key and told what floor the apartment was on. When we got to the appartment the door looked like it had been kicked in. when we opened the door all you could see was roaches walking along the floor, we were horrified,we checked the bathroom which looked like it had never been cleaned. I stormed downstairs to tell the guy behind the desk who started to laugh saying he would go and get some food for the roaches. He came to look at the appartment and agreed we could have another room. the 2nd room was even worse, stained bedsheets, the seal on the toilet was broken and there were even more roaches than the 1st room. Again we went to see the manager who said he couldn't give us our money back so he showed us a 3rd room. This room was horrific. Whilst i was running to the lobby to complain my other half was taking photos of these discusting apartments, when the manager saw him he demanded that these be deleted or he would cause us trouble. So we had to delete them. this was proceeded by a further 6 hours arguing for our money back. We rang woogoo centra resirvations who told us we needed to email them. In the middle of NYC at 2 at night. Whilst arguing the informed us that there was no hot water in the property. Besides taking our deposit twice we still haven't recieved our refund. We were also charge a further 2.5% on top of the total charge this was a further booking fee. This matter has gone to Watchdog who have been in touch with us and this company will appear on the show soon, as there have been so many complaints about Wogoo and the Tempo apartments. Please do not think we are exadurating, this hotel is filthy and the company will cream you for all you are worth. Thank god for the Doubletree Hotel, it put our faith back in NYC. Please believe us it is discusting and will ruin you stay in a magical city.", "Date": "January 13, 2007"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Business service (e.g., internet access)": "4", "Check in / front desk": "3", "Overall": "2.0", "Value": "2", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Cumbria", "Title": "“Area Was Awsome”", "Author": "thenationsguitar", "ReviewID": "UR6546260", "Content": "I really liked this appartment even though it cost us £900 thats over £200 a night for a week!!! should have been like the Hilton for that money, which is a shock when after all its just a room with a toilet! Anyway, it is a nice place to stay, one block from the subway and in an lovely area. The only real problem was cockroaches in the kichen, which frightened the life out of my girlfreind and i couldnt catch them, so that didnt go down to well. The service was basic, what do you expect from an appartment, to be honest if you want more for your money book a hotel. I would not return or recommend this appartment.", "Date": "January 3, 2007"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Check in / front desk": "2", "Overall": "1.0", "Value": "1", "Rooms": "1"}, "AuthorLocation": "North East England", "Title": "“Horrible!”", "Author": "girlyweekend", "ReviewID": "UR6181011", "Content": "We arrived at the apartment and checked in and paid for the accomodation (the full balance) This was approx 4 p.m. On entering the apartment we firstly noticed the cleanliness, or lack of. There was a dirty floor, a mouldy bathroom, a discarded pant liner on one of the bedroom floors, a light fitting in the kitchen which was not fit for use. We later discovered holes in the towels provided and a stain on the bedding which could only be desribed as either dried blood or excrement. There was insufficient bedding for the fold down bed. I contacted the sales office to complain and requested to be moved to an alternative accomodation, howver they did not have availability due to the holiday season. I was told that a member of the customer service team would contact me within minutes but did not. I called again to be told that the office was shut and I would have to wait until morning. I was not happy staying in the apartment but we all agreed to stay for the night until your advice was sought the next morning. The night was terrible and the girls who slept on the sofa bed were cold. We were up at 4.00 a.m (US)as we were all unable to sleep. I contacted the customer care office and was advised that again there was no alternative accomodation, as I was on the phoen a cockroach crawled up the wall in the kitchen and behind the cupboard. This was the point were we all agreed we could not stay any longer in what I can only call substandard accomodation. We checked into a hotel and had vacated your property by 7 am on Fri 24th Nov. DON'T STAY HERE!", "Date": "November 27, 2006"}, {"Ratings": {"Service": "2", "Cleanliness": "1", "Check in / front desk": "2", "Overall": "2.0", "Value": "2", "Rooms": "2", "Location": "3"}, "AuthorLocation": "Dublin", "Title": "“Basic”", "Author": "DUB-DRED", "ReviewID": "UR6167921", "Content": "I was VERY dubious about staying here after reading all the reports and pictures people have posted, but it wasnt so bad once we got there. We stayed in an exceutive studio apartment. Very small, only enough room for two people MAX. I was expecting to see cockroaches running around the place - I seen NONE and you have no idea how relieved I was! There were no creepy crawlers anywhere in the apartment. The floors were clean, but the rug had very bad stains which I would say are there for good. I dropped money on the floor beside the bed and when I bend down to pick it up I could see old food under the bed which I turned a blind eye to! The bed was rock hard and the pillows are worse! Bring your own pillows!! The beds had hair on them, they were clean but the hair was still there. The bathroom was clean. Cant fault anything there. We stayed on the 14th floor and we had to sleep with the window open as the room was like an oven. The noise wasnt too bad either. We were facing out on to Amsterdam Ave/ Broadway which would have the most noise and we were fine. Location was ok. Would have preferred a bit closer to times square but I enjoyed the walk each day. There is a subway across the road but we didnt use it. We went for breakfast in Cafe Utopia each morning and we were very welcome there. The atmosphere was very friendly and their food was delicious!! Only a short stroll away from Central Park and also Colombus Circle/Time Warner Mall, which was spectacular at this time of the year. They have put up decorations and they are amazing! People just stood looking at them for ages!! I am missing the whole experience already!!", "Date": "November 23, 2006"}, {"Ratings": {"Service": "2", "Cleanliness": "4", "Business service (e.g., internet access)": "3", "Check in / front desk": "3", "Overall": "4.0", "Value": "4", "Rooms": "5", "Location": "4"}, "AuthorLocation": "San Diego", "Title": "“Great for parents with small kids”", "Author": "padu", "ReviewID": "UR6093351", "Content": "After reading other reviews here, I went to my vacation with really low expectations. Good, because I had a nice surprise when I got there. Localization is not bad. The hotel is almost corner of broadway and 73 st. Subway at 72 is really close (that was our main transportation there). Central park is a few blocks east. Easy walk. The entrance of the hotel and the lobby are nice. Modern looking. My bedroom was a small studio, and when I say small, I really mean it. The place was clean and furniture looks very modern. They had a big (about 29, 32 inches) CRT TV combo, with DVD and VCR (see why is it good for small kids?) Additionally, it has a small kitchen. Fairway market is 1 block upstreet on broadway, so we would cook dinner (impossible to fine dine with a 2 year old daughter) every night and I would go to fairway every morning to get fresh bread (try the croissants). Service room was null, but we didn't have any problems making our own bed and washing the dishes (they supply dishes, silverware, even a toaster). Customer service was a mix bag. Sometimes the guy at the reception would be almost rude and someone else would be very nice. Better is not to rely on them and go on with your life. The hotel also has permanent tenants, so it is less \"touristy\". Overall, next time I go to NY, I'll stay there again.", "Date": "November 9, 2006"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "San Francisco", "Title": "“Happy camper!”", "Author": "philcp", "ReviewID": "UR6088024", "Content": "I was in New York in August for the annual All My Children Fan Club Luncheon with Susan Lucci and I was quite excited to find a hotel so cheap! After I booked this hotel I read many awful reviews so i was very nervous but luckily my stay was great! Once I understood it is not a hotel I did fine. The staff was pleasant not overly out going but that was fine by me! My room was excellent with a beautiful view of 72nd St.! I never saw any cockroaches which made me very happy! There is a wonderful laundry room in the basement! I was very happy with everything except the blinds on the window let the morning sun in and I am a late sleeper but I just used a night mask and was fine! One night they were filming a bruce Willis movie across the street which was quite exciting! The subway is right outside the door which is very handy! Overall I was very happy!", "Date": "November 8, 2006"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Check in / front desk": "3", "Overall": "1.0", "Value": "1", "Rooms": "1", "Location": "3"}, "AuthorLocation": "Idaho", "Title": "“Don't stay here!”", "Author": "nonnadeb", "ReviewID": "UR6015377", "Content": "My husband, 89-year-old mother, and I booked a studio for four days. the apartment was dirty, the walls were paper-thin, the double bed and the pillows were hard and lumpy (my daughter in law said it felt like the pillows were filled with gravel), and the sofa bed was absolutely impossible to sleep on. The staff left two thread-bare sheets, but no mattress pad or blanket for the sofa bed. We asked for a blanket twice, but never received it. My mother ended up sleeping with her coat on. After two days, my son and his wife offered to stay a night so we could get a night's sleep --- luckily for us, they hadn't seen the apartment. After their sleepless night's stay, we all decided to crowd into their one-bedroom apartment with them and their twin babies. I complained to the front desk, was referred to the office on the 15th floor, then was told to call \"customer care,\" and finally was told to submit my complaint by email. I did so, but have heard nothing after four days. (I did get an automated survey wanting to know about my stay!)", "Date": "October 26, 2006"}, {"Ratings": {"Service": "3", "Cleanliness": "2", "Business service (e.g., internet access)": "3", "Check in / front desk": "3", "Overall": "3.0", "Value": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Toronto", "Title": "“Excellent Value for Your Money”", "Author": "smokeylady", "ReviewID": "UR6007855", "Content": "After reading the reviews prior to our departure I wanted to cancel the reservation. I am so happy we didn't. As I read the recent posting from Oct. 16 to the 21, I am truly questioning as to whether these guests stayed at the the same Central Park Tempo apts as we did as the description was an opposite of our experience. Our apt. was on the 9th floor. We arrived about 2 hrs before check in and were told there was no room for our luggage in the holding room - but our room was ready. The apt. was relatively clean. The hallway was clean with carpets. The sofa bed was fine but could have had a thicker mattress and been a bit wider... we laughed, calling it the virgin bed. The shower was powerful, the tv great.... ok, the fridge defrosted itself and they cleaned up the water immediately. We asked for extra towels and because of water and they were placed in the apt. as promised. And, people have to realize there is a difference between renting an apt. and a hotel - as an apartment comes with basics and you add what you need i.e. extra towels. The location was fabulous. I think the price was right considering the location and the costs of other hotels. Would I stay there again? I would and I would also at times stay in a hotel if I want the amenities offered in a hotel. But I would sure recommend the central park apt. to others.", "Date": "October 24, 2006"}, {"Ratings": {"Service": "3", "Cleanliness": "1", "Business service (e.g., internet access)": "3", "Check in / front desk": "3", "Overall": "2.0", "Rooms": "2", "Location": "3"}, "AuthorLocation": "Ireland", "Title": "“Cheap and not cheerful”", "Author": "Pecos17", "ReviewID": "UR5981858", "Content": "The studio apartment is ok for one or two nights if you are looking for cheap accomodation and you dont mind putting up with a low level of hygiene. The room we stayed in wasnt exactly clean and the bed linens were creased as if someone had slept in them the night before (they smelled clean though). The bathroom had pubic hair on the floor and in general didnt give an impression of cleanliness. The fridge in the kitchenette had mould and looked like it hadnt been cleaned in months. In general the only bad point for this hotel was the cleanliness of the room. The price was right, location good and in general ok for a short stay in NYC. It would be absolutely perfect if they could improve their hygiene standards.", "Date": "October 21, 2006"}, {"Ratings": {"Overall": "1.0"}, "AuthorLocation": "london", "Title": "“no refund”", "Author": "martin_ep", "ReviewID": "UR5971207", "Content": "I booked a stay at the Woogo in Central Park New York. Woogo took the whole amount of my credit card immediately. I had to cancel the booking, which I did the following day. Woogo said they would refund me the money less $50 cancellation fee (I thought that was a bit steep, and most other hotels wouldn't charge as there was more than one month's notice). They kept stalling me about refunding the money and eventually said they couldn't refund it because they had changed credit card merchants. I have approached my c/c company who are trying to get me a refund. I would be very wary with dealing with this company, as in my opinion, they are not reputable.", "Date": "October 19, 2006"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Business service (e.g., internet access)": "1", "Check in / front desk": "1", "Overall": "1.0", "Value": "1", "Rooms": "1", "Location": "3"}, "AuthorLocation": "Texas", "Title": "“The City Dump is Better”", "Author": "Karen55", "ReviewID": "UR5961856", "Content": "Please read all the reviews and think very hard before you book this hotel. The internet pictures look nice but beware. The bathrooms have mold around the tub You cannot turn around in the bathroom. The water pressure is like someone is spitting on you. The main room was dirty. Coffee maker but no coffee pot. We had a mircowave and sink but no stove like the picture. The straw mat that they call a rug was dirty. The hardwood floors were sticky so make sure you don't go barefoot. The hide a bed was broken, the sheets were dingy, pillows were so old that they were flat like apiece of paper. Take your OWN towels!! The air condition kind of worked. The main hallways were filthy. The ONLY good thing about this place was that the elevator worked. Please don't stay here it will ruin your trip!!", "Date": "October 16, 2006"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Business service (e.g., internet access)": "3", "Check in / front desk": "3", "Overall": "3.0", "Value": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Ireland", "Title": "“It was fine... no problems!”", "Author": "bernadinelyn", "ReviewID": "UR5961284", "Content": "I stayed in a one bed apt with my daughter for 6 nights this month. I was worried after reading the reviews... but thankfully there was no need. Ok the building smelt a but musty like an old building but that was ok... i can deal with that. We were checked in in five mins... OUr room was on the 5th floor... It was perfectly adequate. We had everything we needed, the bedroom was clean and the bed comfortable... the sofa in the living area was extremely comfy too... We had ironing board, extra pillows, blankets, toaster, microwave and fine tv and music centre. There was no view, just a wall but that as fine because it was extremely quiet at night so we slept really well. It is a great area and the doormen helped us with where to get shopping etc... Subway and supermarket only one block away and walking either directiong from building brings you to Central Park or riverside park.... Also the shower , although the tiles were a bit old... it was wonderful, powerful and took away the aches and pains of all the new york walking! I would have no problems staying here again.. Real value for money in a great area.", "Date": "October 16, 2006"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Lincoln NE", "Title": "“Family Friendly Option in NYC”", "Author": "mbrittenham", "ReviewID": "UR5910549", "Content": "We have a family of 6 and is was difficult to find a place for all of us to stay without booking 2 hotel rooms. The Tempo apartments was a great option for us. We were in a safe part of New York City (Upper West Side). A subway station was right around the corner with another up a few blocks. It was also very easy to get a cab on Broadway (less than a block away). There were nice restaurants and groceries available within walking distance. A staff member was very helpful helping us arrange a ride to the airport.", "Date": "October 5, 2006"}, {"Ratings": {"Service": "2", "Cleanliness": "1", "Business service (e.g., internet access)": "1", "Check in / front desk": "2", "Overall": "1.0", "Value": "1", "Rooms": "1", "Location": "4"}, "AuthorLocation": "West Michigan", "Title": "“Our room was bugged.”", "Author": "adventureaw8ts", "ReviewID": "UR5899876", "Content": "This hotel is not for the faint at heart. My colleagues and I booked three rooms to extend our stay following business meetings in NYC. The neighborhood near this hotel is wonderful but the accomodations are nearly nasty. The lobby and staff are pleasant enough but the journey to your room is dirty and smelly. Our door locks did not lead you to believe you were secure. The rooms are spartan and less than sanitary. Ours came complete with roaches, towels that were not clean and even contained hair balls. If you need your luggage held after check-out they stuff it in a janitor's closet and ask you to leave cash on each piece for an unidentified keeper. It's just creepy.", "Date": "October 2, 2006"}, {"Ratings": {"Overall": "2.0"}, "AuthorLocation": "Sydney, Australia", "Title": "“Beware! Scam!”", "Author": "spoiltbilly", "ReviewID": "UR5834421", "Content": "We stayed here in August this year (2006) for a week, having paid in full on my credit card in June. I thought the room was ok for the price, however when I returned home after a three week trip around the world I found that they had charged my credit card the full amount once more without my consent or signature. (over $1000) I called the customer service number and the man said that the amount would be refunded \"in the next few days\", no apologies, nothing. I waited a week and nothing happened so I emailed them. A week later I got an email saying that there may have been a 'technical error' and the amount would be refunded, but if it wasnt refunded, to send the email to my credit card company, all very odd! It was addressed to two other people as well as myself! Anyway, still no refund a month after the transaction and I am awaiting my credit card company to hopefully refund the transaction, fingers crossed. Is this a scam to attract interest on the money? $1000 a month from one person (and the two others on the email?) How many others does this happen to?? I would think twice before handing over your credit card details to this company.", "Date": "September 25, 2006"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Business service (e.g., internet access)": "1", "Check in / front desk": "1", "Overall": "1.0", "Value": "1", "Rooms": "1", "Location": "3"}, "AuthorLocation": "Rotterdam", "Title": "“Unfriendly, dirty, terrible and worst company ever!!!”", "Author": "bart86", "ReviewID": "UR5816133", "Content": "Stayed in june, 7am in the morning workers on the roof, leakage in the room because of the rain, dirty toilet, showers and on top of all bugs crawling all over the place. A refund was promissed over 3 month ago. 10 phonecalls and 10 promisses that the check is on the way later we still got nothing. So beware of going in business with this unorganized company!!! see photos to se the bugs and dirt yourself!", "Date": "September 19, 2006"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Business service (e.g., internet access)": "1", "Check in / front desk": "1", "Overall": "2.0", "Value": "2", "Rooms": "1", "Location": "4"}, "AuthorLocation": "Munich, Germany", "Title": "“Dirty, not service oriented, and uncomfortable”", "Author": "Effektiv", "ReviewID": "UR5790574", "Content": "This place was horrible, but for the price and location, it gets two stars, just know what you are getting into. More like an upscale hostel with unprofessional staff, no planning, and bad ammenities. The shower was not clean with easily visible mold on both the wall and curtain and the room had bugs, big and small. The second 'bed' that we purchased in the room was actually a fold out couch with a bad mattress, no hope of getting a switch for the room and my poor friend who slept on it couldn't sleep well. The only nice spot would have been if we were staying longer and could have taken advantage of the small kitchenette, something you normally do not get in a hostel like atmosphere.", "Date": "September 11, 2006"}, {"Ratings": {"Service": "1", "Cleanliness": "2", "Business service (e.g., internet access)": "1", "Check in / front desk": "2", "Overall": "2.0", "Value": "2", "Rooms": "2", "Location": "4"}, "AuthorLocation": "Colorado", "Title": "“Plan before you Stay”", "Author": "catsie", "ReviewID": "UR5714140", "Content": "The WooGo Central Park would be a place to stay if you want to get a taste of being a resident of New York. Pretend it is your own apartment and bring your own towels and wash cloths, make your own beds, wash your dishes, take out the trash, and be willing to dispose of the previous occupants dropped trash and forgotten underwear. The first night the front desk staff directed me to the 'managers' office where I inquired of two surley young men if I might obtain a wash cloth. They informed me they did not provide anything but one towel per customer. We were there 5 days. No one cleaned our room, brought fresh towels or emptied the trash. As we were checking out other customers were at the desk asking for toilet paper, towels and trash bags. It has a good location - go up two blocks to the Fairway Market and you're set for groceries - it is an easy stroll to a main subway hub, Riverside park and Central Park. So, if you are good at taking care of yourself and don't mind being your own maid, it was a fine stay . P.S. The Fairway Market sells trash bags and Filene's has towels.", "Date": "August 27, 2006"}], "HotelInfo": {"Name": "Woogo - Central Park", "HotelURL": "/ShowUserReviews-g60763-d307945-Reviews-Woogo_Central_Park-New_York_City_New_York.html", "Price": "$189 - $474*", "Address": "<address class=\"addressReset\"> <span rel=\"v:address\"> <span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">240 West 73rd Street</span>, <span class=\"locality\"><span property=\"v:locality\">New York City</span>, <span property=\"v:region\">NY</span> <span property=\"v:postal-code\">10023</span></span> (Formerly YourStay Central Park)</span> </span> </address>", "HotelID": "2514515", "ImgURL": "http://media-cdn.tripadvisor.com/media/photo-s/01/71/67/8b/lobby.jpg"}}