{"Reviews": [{"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Sydney", "Title": "“Very Comfortable Beds”", "Author": "tracestar80", "ReviewID": "UR127047466", "Content": "We stayed in November 2011. We found the rooms to be very clean and comfortable. The price was good for the area. Great position within the city to stay to be located to many attractions. Just a few blocks from central park, times square and restaurants. Check in is a little late but we were able to leave our bags in the lobby and they were safely there when we got back. Free access to internet and a small offering of breakfast pastries is available in the morning. VERY COMFORTABLE SOFT BED.", "Date": "March 31, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "2", "Overall": "3.0", "Value": "4", "Sleep Quality": "3", "Rooms": "2", "Location": "5"}, "AuthorLocation": "San Francisco, California", "Title": "“Need recent reviewing”", "Author": "Tom W", "ReviewID": "UR126933175", "Content": "I have stayed in the Da Vinci many times over the past five years. I am hesitant to do so now because of postings regarding bedbugs. Has anyone who stayed there recently encountered this problem at the Da Vinci? I always found the hotel itself adequate at best, but the location is great. Can anyone who has stayed there recently enlighten me on the bedbug situation at the Da Vinci?", "Date": "March 29, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Summerville, South Carolina", "Title": "“Shhhh, best kept secret!”", "Author": "bkheartnurse", "ReviewID": "UR126515996", "Content": "I really hate to let the cat out of the bag but this place is the best. It is centrally located, just 3 blocks from Columbus Circle, Central Park, and the subway station. I have been staying here for several years and consistency is their motto. Always a clean room, and safe environment. Friendly staff are always there to help with anything you need. Great price! This place allows me the opportunity to come to NYC and still afford to see the sights!", "Date": "March 22, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Aptos, California", "Title": "“Better than expected!”", "Author": "RonSandidge", "ReviewID": "UR124695919", "Content": "We wanted something less expensive than the norm but with quality. We found it in the value of this small hotel. It was easy to book over the phone. While the rooms are small, they are well appointed and comfortable. Clean! Quiet! Located between 7th and 8th. Room cleaning excellent. Continental breakfast is free; don't complain, you get what you pay for. Two computers with internet service and Wi-fi in lobby. Staff says wi-fi not available in rooms but with luck you can still get to the server. Multi-lingual, friendly staff. We recommend you go around the corner to Guantanamera, located at 939 Eighth Avenue. Great Cuban food, drink, atmosphere.", "Date": "February 16, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "4"}, "AuthorLocation": "", "Title": "“Great place to stay!”", "Author": "Baiseur682", "ReviewID": "UR124298602", "Content": "I really enjoyed my stay here! I just needed one night and found this hotel on orbitz ridiculously cheap. The room was small but functional. The bed was very comfortable and there was also a fridge in the room! Free wifi is a great touch! There is a free continental breakfast of coffee tea and muffins. My only complaint was that the room was extremely hot and as far as the heat is concerned you can not controll that in room. I just cracked the window and it was fine for me.", "Date": "February 8, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Manila, Philippines", "Title": "“Value-for-money hotel in Midtown NY”", "Author": "Lilet C", "ReviewID": "UR123401334", "Content": "I found this hotel from the Internet (my two considerations are budget and location) and it met both criteria. Right in the heart of Time Square, this boutique hotel was actually a reasonably good choice especially if all you need is a decent accommodation while spending a few days out and about in the city. The room is small, yes, but not too small that you feel cramped and claustrophobic. If you're alone the room is actually pretty cozy and comfortable. The staff are friendly and accommodating (I had some difficulties accessing the Internet through their free Wifi service but they promptly helped me with my issues), there's free breakfast to start your day and because it is not a big hotel there's a certain air of privacy and absence of all the lobby chatter and people hanging around everywhere. Everytime I go to NYC I always make it a point to check on the availability in Da Vinci - it's one place I have bookmarked as a favorite.", "Date": "January 21, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Cape Town Central, South Africa", "Title": "“Tired Hotel, great location”", "Author": "CapeTownCaitie", "ReviewID": "UR123254171", "Content": "We stayed in the Da Vinci hotel for a few nights in November. The location is absolutely perfect - it's not as noisy as other hotels in the area (if you are staying 5 minutes away from Times Square, expect noise! New York is not called the city that never sleeps for no reason...). The hotel itself needs a revamp. They could also do with some new towels - ours were threadbare! The aircon was quite noisy, but the weather was cold so we didn't need it. Even though it's old and pokey, it's clean, affordable and in a decent location. There was free internet in the lobby as well as WiFi in most rooms. They also have en-suite bathrooms (apparently some hotels in New York have shared bathrooms?!). Not the most luxurious place, but we didn't spend much time in our room anyway as we were out exploring the Big Apple!", "Date": "January 18, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "3.0", "Value": "5", "Location": "4", "Rooms": "3"}, "AuthorLocation": "Sudbury, Canada", "Title": "“Great location, wonderful price, for a one night stay!”", "Author": "Byrnzie", "ReviewID": "UR122943715", "Content": "My husband and I stayed at this hotel for one evening. Yes, the rooms are small, the decor somewhat was dated, and it probably would not have been my first choice. However, I would stay here again. You simply cannot beat the price, the location, and the services included at that price in New York City. We may have been fortunate, but encountered none of the problems with lack of heated water, thoroughly enjoyed the continental breakfast offering, and were able to make use of the computers (with Internet access) in the lobby. Thank you to the staff for making our stay an enjoyable one!", "Date": "January 11, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Christchurch, New Zealand", "Title": "“Great hotel to explore New York”", "Author": "nemo500", "ReviewID": "UR122857243", "Content": "I booked this hotel using airpoints. The room was small but comfortable, and pretty much what you would expect in Manhattan. My room was quite and the air-conditioning worked well. The hotel was centrally located and I found it to be a great base to explore the city. The Staff were friendly and helpful.", "Date": "January 10, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Boston", "Title": "“Clean, good location, friendly staff”", "Author": "spanish_af", "ReviewID": "UR121638287", "Content": "Stayed one night. Room was small but that was expected. Bed was quite comfortable. Room 103 in the back is very quiet and dark. No noise from traffic or other rooms. Steam heat was noisy, but that was also expected. We balanced out the heat with air conditioning which worked. Room had a little fridge which I didn't expect, although it wasn't working. As we didn't really need it we didn't complain. Ice is available from the restaurant downstairs. There were 2 computers for use in the lobby. There are a lot of restaurants and convenient groceries and pharmacies in the area. We also walked to and from the theater (11 blocks, about 15-20 minutes). It is only a few blocks from Central Park.", "Date": "December 11, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "2", "Overall": "2.0", "Value": "2", "Sleep Quality": "1", "Rooms": "2", "Location": "4"}, "AuthorLocation": "Madrid", "Title": "“Good Location - Poor Quality”", "Author": "RDWMadrid", "ReviewID": "UR120334596", "Content": "Just back from a trip to NYC which we thoroughly enjoyed, however it has to be said, despite the hotel. Location is excellent, close to Central Park, walkable to Times Sq. Staff are friendly and the free breakfast is a nice touch. However the bed was very uncomfortable, room had a constant noise outside and heating system is so old it needs to constantly release air to release pressure in the radiators, thus adding to the noise. Rooms are small and in a double room we had one tiny wardrobe and 3 drawers. Not good enough in summary. I have been in one other hotel in NYC of similar price (which wasnt available), and it is much better value for money...so I know there are better offers out there.", "Date": "November 8, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Little Rock, Arkansas", "Title": "“Great place to stay in Midtown”", "Author": "Annette A", "ReviewID": "UR119340440", "Content": "Just returned from a girl's family trip to NYC (with my mom and grandmother) and spent 5 nights at the Da Vinci. It's in a GREAT location (easy walking distance to subway/buses, Central Park, not far from Times Square), staff are friendly, room was actually quite large (we were in a room with two double beds since there were three of us). The carpet was a bit worn and the room could use a new coat of paint but the room and bathroom were clean and you don't go to Manhattan to spend time in your hotel room anyway! We would definitely stay there again, and would recommend it to friends looking for a cheap (by NYC standards) but reliable place in a super good location. They even have a very basic continental breakfast. My mother was terrified we'd have bed bugs (a major problem apparently in all kinds of hotels in the northeast), but we had no problem at all, and I checked everywhere. They had mattress protectors on the beds for prevention. Mom liked the marble tile in the bathroom, and the lobby was lovely and appears to be staffed 24/7. There are lots of great restaurants within walking distance. In short, we had a great stay and will definitely keep their name handy for future visits.", "Date": "October 15, 2011"}, {"Ratings": {"Overall": "1.0"}, "AuthorLocation": "Washington DC, District of Columbia", "Title": "“If you have to cancel your reservation be prepared to be RIPPED OFF!!!”", "Author": "BillieBryant", "ReviewID": "UR118996446", "Content": "The Da Vinci Hotel ABSOLUTELY SUCKS!!! Do Not do business with them! They will RIP YOU OFF! I had to cancel my reservation for two nights because the show that we were going to see up in NYC had been cancelled. We were travelling to NYC just to see this show! Of course Da Vinci said that they were going to charge me a penalty charge of one nights stay because I cancelled within thier 7 day window. I tried to talk to the manager - I sent several emails - I called several times - NO RESPONSE! I was trying to get the charge waived or even credited to a later date.... NO RESPONSE! Da Vinci Hotel IS A COMPLETE RIP OFF! DO NOT TRUST THESE PEOPLE WITH YOUR MONEY!!!!!!!!!!", "Date": "October 6, 2011"}, {"Ratings": {"Service": "2", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Preston, United Kingdom", "Title": "“Average all round”", "Author": "cgodfrey26", "ReviewID": "UR118382896", "Content": "The reception staff were a bit difficult to communicate with, just didn't seem that bothered. Room was fine, small but enough room for 2 with suitcases! Location was good, easy yo get to Central Park and Times square.", "Date": "September 20, 2011"}, {"Ratings": {"Location": "5", "Overall": "3.0", "Value": "3", "Service": "3", "Rooms": "2"}, "AuthorLocation": "Mayaguez, Puerto Rico", "Title": "“Great location not great rooms”", "Author": "Coffeemac", "ReviewID": "UR118175638", "Content": "I stayed at the Da Vinci hotel 4 nights and boy it is well located. Rooms where clean and bathrooms just remodeled (room 205). Costumer service was OK not bad but not outstanding either. The rooms are smaller than the small room I had in mind, to people with two pieces of luggage can make this room feel crowded with barely space to walk. AC unit worked great and be careful with the hot water of the shower because it was REALLY HOT! Breakfast is continental and get there early or other guests will finish it for you. Computers in the lobby where super convenient. The restaurant downstairs is OK. reasonable prices and very good food. They have live music but I rather have no music at all since the band was awful. Do your homework! I had to stay an extra night because a storm was heading to my home and was able to book Hilton Time Square for $10 less per night and WOW Hilton Time Square by itself is and awesome experience.", "Date": "September 15, 2011"}, {"Ratings": {"Cleanliness": "3", "Sleep Quality": "2", "Overall": "1.0", "Value": "1", "Service": "1"}, "AuthorLocation": "New York City, New York", "Title": "“Bad!”", "Author": "theunconvinienttruth", "ReviewID": "UR117332575", "Content": "In addition to poor client service, the rate is very high for the size of the rooms. The rooms are tinny, confined, and set-up with poor taste. Don't come here - there plenty of other places better and cheaper – why I came here? had to rush to find a room before Irene... and they had plenty of them, now I understand", "Date": "August 27, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "4", "Overall": "4.0", "Value": "5", "Service": "5"}, "AuthorLocation": "new york, ny", "Title": "“A hidden gem”", "Author": "simplicate", "ReviewID": "UR117178530", "Content": "I have stayed at the DaVinci numerous times in the past nine months. Obviously I keep going back. The location is excellent for me as my office is only a 15 minute walk away. But when I'm there over the weekend I'm like a tourist and it's a great spot...close to Central Park, not far from Broadway theatres and a bunch of reasonably priced places to eat nearby. It's clean and safe. They put out coffee and croissants in the morning. Because it's small, it's not for everyone but I feel like I've found a hidden gem in New York. The rates are reasonable, the staff is friendly and Joe G's restaurant, in the 'basement' is a real Italian restaurant.", "Date": "August 24, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "1", "Overall": "4.0", "Value": "5", "Service": "4"}, "AuthorLocation": "Sydney, Australia", "Title": "“Overall pretty good for NYC. Location+++”", "Author": "Pinhead22886", "ReviewID": "UR117116705", "Content": "I stayed here with my sister during a trip to North America in winter 2010/11. NYC is hard because all the hotels are just so expensive! I booked this one because it was reasonably priced for NYC, had decent reviews on Trip Advisor and was in a good location close to the park and was close to stations on three or four different coloured subway lines. Well, I was certainly not disappointed by the location. It was the PERFECT spot to stay in NYC. About a 2min walk to the southern end of Central Park, and there are two subway stations within 2min walk, even more within 5mins. Broadway is just around the corner, and a 3-5min walk puts you right in the middle of the theatre district and Times Square. We had no trouble catching the subway right downtown to visit Wall St, Ground Zero and the Statue of Liberty. We caught the train to midtown to see a jazz show and Harlem to go to church. All from stops within 2min walk from the hotel. The room was really quite decent. A little bit of an older style, but clean and comfortable with two queen size beds, and just enough room for our luggage. The bathroom was smallish, but clean and had everything we needed, including a nice hot shower. Just what one would expect from a hotel in this price range! The breakfast is very basic (muffins with juice and coffee), which I understand is pretty normal for NYC, but it was prefectly fine to start off the day, considering it was included in the price. The only drama we had was that, being winter, the boiler system in the building made a VERY loud banging noise which lasted about 1min each time. And the problem was that this happened about every hour or two. I wore ear plugs, but the noise was still loud enough to wake me up each time. I did complain to the front desk, but was told there were no other available rooms with two beds. So the sleep quality wasn't great due to the noise, but everything else about the hotel was actually really great!", "Date": "August 23, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Jacksonville, Florida", "Title": "“very good hotel”", "Author": "455440", "ReviewID": "UR116039510", "Content": "very close to alot of stuff. Would love to stay here again, cant beat the price", "Date": "July 30, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "4.0", "Value": "4", "Service": "5"}, "AuthorLocation": "Launceston", "Title": "“Surprisingly Good”", "Author": "bowiebell", "ReviewID": "UR115742827", "Content": "The room was homely and a great size, clean and air conditioned. Very friendly staff, free internet and great location. Would definitely stay again.", "Date": "July 25, 2011"}, {"Ratings": {"Cleanliness": "3", "Sleep Quality": "3", "Overall": "3.0", "Value": "2", "Service": "3"}, "AuthorLocation": "Thornbury, Victoria", "Title": "“Great location”", "Author": "bcmegan", "ReviewID": "UR115236302", "Content": "Da Vinci Hotel is difficult to find with a small street frontage and minimal signage. Once you are there though, the location is terrific - walking distance to Central Park and Times Square and convenient to public transport. I thought the tariff of just over $200 was excessive for what we got, but I do understand that New York accommodation is very expensive. Our room was tiny and the lift was always slow to come. The room was cleaned late every day and I don't believe they employ enough cleaning staff ( and the ones they have are good but very over-worked). Free internet in the reception area was very handy and they were happy to print a few pages for no charge. There was a very limited breakfast - coffee and a token offering of croissants - nowhere near enough for the number of guests staying there. The bar downstairs was fantastic, drinks were good value and the bar staff were very friendly. Overall, there were a few positives which outweighed the negatives and I would probably stay there again.", "Date": "July 11, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "2.0", "Value": "2", "Location": "4", "Rooms": "2"}, "AuthorLocation": "Cambridgeshire, UK", "Title": "“Not as good as we were expecting”", "Author": "TheGreatestDancer", "ReviewID": "UR112653462", "Content": "Pros: Friendly and helpful staff Location OK size room for New York Cons: Inadequate toilet plumbing Dodgy WIFI Poor condition of towelling TV on last legs Lack of light and ventilation in room Noisy air conditioning Pathetic breakfast offering", "Date": "June 10, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "5", "Overall": "4.0", "Value": "5", "Service": "4"}, "AuthorLocation": "ontario, Canada", "Title": "“A hidden gem”", "Author": "jim1717", "ReviewID": "UR112009559", "Content": "After a few trips to NYC, I can finally say we have found a hotel we are very pleased to return to. Location(1 block to the subway with multiple lines), location(many interesting and multicultural restaurants within 2 minutes), location(take the \"A\" train from JFK to the 59th station - actually walk underground and come out at 57th), accommodation(private washrooms - marble- and shower with plenty of hot water), accommodation(comfortable bed and room appointments - safe(at no extra charge) and bar fridge), a great front desk staff (JENNIFER and ANNA), cost(very reasonable). Just don't tell everyone because we will be going back. One item - if you are going out in the morning let the front desk know and your room will be ready when you return later otherwise it can be a little late in the day. The restaurant blow is very good (and discounted for guests of the hotel). ENJOY!!!", "Date": "June 7, 2011"}, {"Ratings": {"Service": "2", "Cleanliness": "4", "Overall": "3.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "avon, NY", "Title": "“Almost a 4 or 5, then they blew it.”", "Author": "tagavon2000", "ReviewID": "UR109889449", "Content": "I was ready to give the DaVinci a four or five rating based on cleanliness (and odorlessness) of the room, free wireless, good (but not noisy) air conditioning, decent tv channel selections, efficiency at check in, decent bed, and friendliness of desk staff at check in. Then they blew it on housekeeping. A two night stay meant there would be one room cleaning while I was there. On my full day I left the hotel at 10:30 AM with the DO NOT DISTURB sign inside the room (their do not disturb sign does not have a flip side that says \"clean room now\" or some such). I did not return until 5:30 PM and the room had not been cleaned. I called the desk, and they asked me if I had had the Do Not Disturb sign on the door and,I said no. The desk clerk then started BSing about how they did not realize I wanted my room cleaned \"early\" (5:30 PM is EARLY????) and that they had cleaned the rooms on the lower floors and were just getting to my floor now. (That was BS too; I had walked by every room in the one-corridor to get to my room, and there was no cleaning service going on the third floor). When I got back at 11 PM the room was clean. I was not only annoyed that they did not get the room clean during the day but no less bothered by the fact that, rather than apologize, the desk clerk started giving me BS about it. (Maybe it was a new staffer fearful of getting blamed). That left a bad taste in my mouth to an otherwise very good value for a small, private, Manhattan hotel in a great location.", "Date": "May 26, 2011"}, {"Ratings": {"Service": "2", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Sleep Quality": "2", "Rooms": "2", "Location": "5"}, "AuthorLocation": "Geelong", "Title": "“Hit or Miss”", "Author": "Cats09Geelong", "ReviewID": "UR109020103", "Content": "I read all the reviews on this hotel before I booked and I think they are all correct. By that I mean some rooms are fantastic and others are not. I booked in for a week at the end of April/May. I was given room 202. It had a tiny window BUT it was 'smoked' glass so you could not see out and it was covered by venetian blinds. This required the light to be on everytime when in the room. The bed was clean but you sunk into it over the night and it was not comfortable. Bathroom was clean but no soap apart from body wash, so take your own. A major drawback for me was that I went out everyday early and, despite me asking, the maid only came to clean the room at 4.45pm. I would get back tired and want to rest and find the room as I had left it and then have to leave to give them the chance to clean and tidy. Not good.The aircon was very noisy and was largely ineffectual as the room was continually hot. Breakfast was not good. Soggy croissants, dry bread rolls or a cup cake. Plus tea or coffee. Coffee was okay but if you want more there are many small restaurants nearby that would offer more substantial meals or, if desperate, there is Macca's next door. The positives. There are good rooms. A colleague of mine stayed here for one night and he got room 303 and it was fantastic. Twin beds, heaps of light and windows. Such a contrast to what I experienced. Staying a week I would have like a room such as this. Anna on the desk was lovely and very obliging. She always had a smile on her face. One other lass was not. Work appeared to be an effort. One morning the coffee machine did not work. She was not apologetic. Went to the kitchen and came back with another container of coffee. It was cold. The location is wonderful. you are close to subways, Times Square and Central Park. you can walk easily to most locations from here and feel quite safe. Would I stay there again? I would check out other places nearby ( and there are others) and if not price friendly would stay here - but ask for a better room.", "Date": "May 20, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "4", "Sleep Quality": "2", "Rooms": "2", "Location": "3"}, "AuthorLocation": "Los Angeles, California", "Title": "“Gross carpet, moldy shower, LOUD A/C, no cable TV, thin old towels”", "Author": "BudgetTraveler91411", "ReviewID": "UR106866439", "Content": "Cons: mold on the shower wall, loud air conditioner, thin old dirty carpet (you won't want to walk bare foot), old mattress, thin pillows, thin old rough towels, no cable TV not even local channels, narrow hallways Pros: Very nice staff, A./C worked, low price ($250/night for 3 people) for NYC, free wifi, quiet building, remodeled bathroom, hot water", "Date": "May 4, 2011"}, {"Ratings": {"Service": "2", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "4"}, "AuthorLocation": "Newton, Massachusetts", "Title": "“Do Not Stay in This Hotel”", "Author": "Arple", "ReviewID": "UR106690394", "Content": "I have been travelling to New York City since 1967, and this is the worst hotel I have ever stayed in. The corridors were shabby and dingy, the lighting in the room was poor, the air conditioner did not work, the room had no soap, the shower could not be adjusted to a comfortable temperature, and the mattress was so lumpy that I had severe back pain the next day. In addition, I counted three bedbugs. Finally, the management would not refund my money; I had made a reservation for 4 days. They were able to sell two of them, but they charged me for a night I did not stay.", "Date": "May 3, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "3.0", "Value": "4", "Sleep Quality": "3", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Riverside, Rhode Island", "Title": "“Small but a Great Value”", "Author": "BSouliere", "ReviewID": "UR104635788", "Content": "I was able to check in really early and recieved Room 402. Very small room facing an alley. No view. The bathroom was relatively new and clean. The place was very quiet and had no problems sleeping. Subways are really close and its a 15 minute walk to Radio City. The TV only had a few stations?? Overall I would probably stay there again. Parking was 28.00 per 24 hrs...across street.", "Date": "April 19, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "London", "Title": "“Excellent value, clean and quiet..”", "Author": "Paulg390", "ReviewID": "UR104413347", "Content": "Stayed here for 2 nights and found it to be ideally situated for Times Square and Central Park. My room was clean and modern with polished wood floor and marble bathroom. The room was quite small but fine for what I needed. My room was at the back of the hotel (room 205) and so had no view but it was very quiet. Would definitely stay again.", "Date": "April 17, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Portsmouth, United Kingdom", "Title": "“Great price, nice hotel”", "Author": "MariaJM1980", "ReviewID": "UR101955296", "Content": "We stayed here for 2 nights. We arrived at 7am expecting not to be able to check in but thought we would be able to use a public toilet to freshen up. We couldn't check in and they had no toilet we could use. I had to clean my face and put make up on in the lobby where people were having breakfast then we had to go eat in McDonalds to get changed. There is nowhere to store your bags but the lobby. Apart from this the hotel was great. The bed and room was comfy. You get a basic free breakfast which is nice. You also get free internet in the lobby. We would only stay somewhere else in future due to no public toilet for early arrivals.", "Date": "March 28, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Bolivia, North Carolina", "Title": "“FIRST TIME BOOKING A HOTEL ALONE, AND I LOOOOOOVED IT!!! ;-)”", "Author": "leomartin", "ReviewID": "UR100935944", "Content": "This is the first time booking a hotel alone, and I loved every minute of my stay, real close to Times Sqaure, Columbus Circle, Radio City I will be returning for another stay in July and August if u wanna come to NYC choose Da Vinci Hotel u won't regret.", "Date": "March 21, 2011"}, {"Ratings": {"Overall": "1.0", "Value": "1", "Service": "1"}, "AuthorLocation": "Leeds, United Kingdom", "Title": "“surreal & slightly scarey”", "Author": "999ian", "ReviewID": "UR98637336", "Content": "This review is for Joe G's restaurant which is part of this hotel but not listed separately (well I couldn't find it). My wife and I were out walking around exploring the area on our recent trip to NYC, looking at various restaurant menus, when a guy standing on the steps (the owner ?) started chatting to us and inviting us in: the menu seemed ok and he seemed friendly enough so we told him we'd be back later that night. We returned and went down the steps into the restaurant to find it practically empty but decided to stay and give it a go anyway. Our waiter arrived with our water and started the usual conversation - where are you from/been to NYC before/how long staying etc - but then things started turning slightly strange. As part of the normal run of things we asked him where he was from, to which he got us playing a guessing game (?!?) and then started giving us clues eg \"Your country has had problems with my country.\" Eventually he told us he was from Guatemala. As the meal progressed he seemed less friendly and kept telling us at various points in the evening about different problems between the UK and Guatemala, and how the UK has \"double crossed\" his country. Unfortunately both my wife and I had to admit our ignorance of these problems but his comments and behaviour were making us feel very uncomfortable. As we finished our main course we decided that we'd leave without enjoying any deserts or coffee, due to the waiter, however when we declined to see the desert menu he \"accidentally\" knocked an almost full glass of red wine all over my wife whilst taking her plate away. Obviously this made a mess of her dress, as well as being the final straw in THE most surreal and uncomfortable dining experience we have ever had anywhere in the world. We demanded our bill immediately and left (obviously without leaving a tip) - the guy we'd seen earlier (the owner ?) was sitting in a corner seat on his mobile but if he was the owner/manager as we suspected he didn't even break his call (ok he could have been a customer who'd been there for about 4 hours). The food itself was very average and relatively overpriced but the confrontational, unprofessional and weird waiter was disgraceful (and if it was the owner/manager he clearly didn't care about what was going on). All in all it was probably the scariest dining experience we have ever had and it completely spoilt our evening out - not to mention spoiling my wife's dress as well !!!", "Date": "March 2, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "2", "Overall": "3.0", "Value": "2", "Sleep Quality": "4", "Rooms": "2", "Location": "5"}, "AuthorLocation": "London, United Kingdom", "Title": "“Centrally located budget hotel”", "Author": "fab56_11", "ReviewID": "UR96620545", "Content": "Excellent location, but disappointing view .... central service pipe for surrounding buildings, so only view walls and pipes, very little natural light. On the plus side, no traffic noise. Clean linen and bathroom. Sightly shabby. Breakfast consisted of muffins or rolls, butter and conserve on paper plates served with choice of coffee or tea to be collected in hotel hallway. Staff really helpful.", "Date": "February 14, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Wilmington, Delaware", "Title": "“Great Hotel, Great Price (winter rates), Great Location”", "Author": "SteveO6385", "ReviewID": "UR93635465", "Content": "First, great hotel location. Right down the street from Times Square, with easy subway access to most trains from Columbus Circle and Times Square a few blocks away. A little hard to find, but not a very big hotel. Lobby was nice/quaint, computer's both functional w/ free printing. Room was set to be checked into on time. Had ordered flowers to be delivered, and the staff got the package up to the room, unboxed, and placed in a vase with water before arrival. Box was taken away (with card) but hotel staff were able to locate both. First noticeable thing was the tall ceilings (12ft or so). In room 201 (near but not facing street), not much traffic noise. Lovely to hear the sounds of pigeons cooing first thing in the morning. Walls were a little thin for noise, but nothing horrid. Basic room layout. Not a big room, but suitable for 1 or 2 travelers. TV on basic channels only, but you can find better things to do in NYC other than TV. Bathroom had average space, w/ complimentary shampoo/conditioner. One downside was that the tub leaked (emergency run-upstairs from the lobby to inform us it was leaking while filling). Offered another room but declined. No rust / wear / bed bugs / major complaints about the room, better than many others I've been in. Unlike other reviewers, bed was VERY soft and no problems sleeping. Bedding pillows were rather firm but the extra's in the closet made for a good substitution. Morning complimentary breakfast was minimal (coffee/tea, croissants, packaged muffins, bagel, butter, jelly) but appreciated. Would definitely stay here again. Thanks DaVinci!", "Date": "January 18, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Dublin, Ireland", "Title": "“did the job perfectly”", "Author": "ontheditch", "ReviewID": "UR93510758", "Content": "Just back from NY, having stayed here for 4 nights. It was everything we expected, nothing more and nothing less. 10 minute walk to time square, 3 minute walk to central park. Rooms were small, but nice. Had own bathroom, which was nice sized and clean. Had a window, but no view. For anyone going on a budget, would definitely recommend it. No complaints from me.", "Date": "January 18, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Queensland", "Title": "“Very good budget option ... pleasantly surprised!”", "Author": "balis_magic", "ReviewID": "UR91355974", "Content": "Apologies this review is late. The Da Vinci Hotel was great and I have to say that we were pleasantly surprised. We stayed there at Xmas last year and it was absolutely freezing that year. The rooms were small but warm and cozy. We stayed in a front room and was worried about traffic noise but it was no problem at all. The hotel is small and narrow and the stairs are a mission but there is also an elevator if needed. We found the hotel was a short walk from great cafe's, deli's and great subway routes. There is also a laundromat about 2 blocks from the hotel which was really handy for washing. The room was nice and above standard. They are however smaller rooms. The bed was very comfortable. We had stayed at the Salisbury hotel later in the trip and would not stay there again. We were sad that we had not booked back into the davinci. It's a no frills boutique hotel but well worth looking into as accom is very expensive in NY!!", "Date": "January 2, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "5", "Overall": "2.0", "Value": "1", "Sleep Quality": "2", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Baltimore, Maryland", "Title": "“Should have been nicer, not schooled in customer relations”", "Author": "Carolnkids", "ReviewID": "UR91320530", "Content": "1. I reserved a room with 2 double beds. At the last minute my 2 sons decided to come. I figured we had plenty of bed space for a 1 night stay. They charge per person. I felt treated as criminals when I checked in that we were a party of 4 people to stay in this room. Desk clerk with the limited customer service training said it was illegal. Threatened to fine me but in the end charged me an additional $30 per person. I asked what does that $$ translate to and got no answer. I asked to speak to the manager and he was not available. He never did get back to me. I have stayed in many a smaller hotel rooms. Worked out to be over $330 for 2 double beds. Could have stayed somewhere more upscale for that price. 2. I wanted to discuss with the manager about the experience above. When I saw him argue in the lobby with an employee I decided he was a \"I could care less what you think\" kinda guy. 3. Mattress like a box. Very hard. 4. Wifi never worked on 4 different computers. 5. Bathroom was nice. Everyone got 1 towel, guess that is what the $30 per person was for. 6. 5th floor front room noisy but that is what you expect for NYC. 7. Room was cold but there was a space heater to plug in.", "Date": "January 1, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "3", "Rooms": "4", "Location": "5"}, "AuthorLocation": "San Antonio, TX", "Title": "“Great value, great location, great stay!”", "Author": "aegault", "ReviewID": "UR88424442", "Content": "We had a two double bed room which was probably 12'x25' at the front of the hotel, 5th floor. (I will say the beds and pillows were very firm, my husband didn't care for them so much.) It had everything we needed (well a little microwave would have been a crowning touch). A chest of drawers, a closet, an in-room safe, a desk, a portable heater. The bathroom was nice and the whole hotel was clean. Our wifi never worked so I'd say that was the one negative, but I have 3G so it didn't slow us down (plus there are two computers w/ internet in the lobby attached to a printer). Breakfast was simple with crusty rolls, purchased muffins, coffee and tea, but it gave us something in our stomachs to start the day. Easy to get to the subway, easy to walk to Times Square, Rockefeller Center, Central Park, 5th Ave shopping. I would definitely stay here again- had the feeling of living in New York which I really liked.", "Date": "November 28, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Emporia, KS", "Title": "“Best kept secret in New York City”", "Author": "Liblady43", "ReviewID": "UR88049370", "Content": "My daughter and I spent five nights at the Da Vinci on a recent trip to NYC. What a delight. Although the room was small, it had everything we needed including a refrigerator. The room was immaculate!! We had heard about bed bugs in New York, but I don't think one ever crossed the threshhold of this hotel. The restaurant on the bottom level served delicious food and gave a 15% discount to hotel guests ( a nice bonus). The hotel was quiet and a nice retreat from the hustle and bustle of the city. The location is terrific - only two blocks from Columbus Circle and Central Park, 10-12 short blocks from Times Square and close to many of the theatres. Two subway stops were two blocks or less from the hotel and covered most of the major lines. I can't say enough about this little jewel. When we go back to New York, and we will, this is definitely the hotel we will stay in. The price is a bargain for Manhattan but everything else is top notch.", "Date": "November 23, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "3", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Kearney, Nebraska", "Title": "“Great place for the price!”", "Author": "goosebump2", "ReviewID": "UR84695751", "Content": "Was concerned about the bed bug problem in NYC so the first thing we checked was the mattress and box springs! They were both covered in the appropriate BB protection attire! Room was clean, although a tiny bit shabby. On the small size but we weren't there to enjoy the room! Staff was very helpful, breakfast was adequate, two subway stops close by, Central Park down the street, cozy neighborhood bar right around the corner, and very safe and well-lit location! Only complaint is that our bed was not that great, but other reviewers didn't have that problem. We were already settled so we didn't ask for another room. We've stayed in other moderately priced hotels in NYC and we will definitely go back to this one.", "Date": "October 24, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Lima, Peru", "Title": "“Great place to stay, the staff is very helpful”", "Author": "Veronica0928", "ReviewID": "UR84151953", "Content": "I was a little concerned about the hotel bc of the reviews, but they were not true!, the staff is very helpful, they helped us a lot!, since this was our first time in New York, we didn't know too much, they explained how to get to different places and recommended others. If I go back to NY I would definetly stay at Da Vinci's hotel. The rooms were clean, perfect size, I traveled with my teenage daughter and was pretty close from Times Square and most of the theaters were we went", "Date": "October 19, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Stevensville, Maryland", "Title": "“We will be back, what a gem!”", "Author": "kelcarib", "ReviewID": "UR83513374", "Content": "Have traveled the world, stayed in all places from hostels to the Ritz. Took a gamble, despite some other less than favorable reviews. I dont know what they were expecting for less than $200 in NYC. The room was quite adequate size, mostly quiet, except heating system is a bit noisy as is the narrow hallway during non-quiet hours. The bed was very comfortable for 2 people and room was clean. Great bathroom, good water pressure, dependable hot water. Breakfast was crusty white rolls and some packaged danishes with good coffee. What were others expecting fresh crepes and made to order omelets? Free wifi worked great (cut out once or twice, who cares?) on first floor. The front desk was very helpful, even called to check on availability of Liberty tour tickets for us and offered to let us switch rooms when we discovered we were booked on the first floor, though we opted to keep our first floor in the end, and it was fine. The location cannot be beat, especially for the price. Easily walk to Times Square, Central Park, great delis and restaurants or to subway station 2 blocks away. If you want the Ritz, go there. This is a fantastic find, much better than the last budget hotel we stayed in years ago in NYC. Keep an open mind and you won't be disappointed. were expecting", "Date": "October 14, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Glasgow, United Kingdom", "Title": "“very good”", "Author": "bobj_10", "ReviewID": "UR82606113", "Content": "i stayed 5 nights at the da vinci and had no problems at all. room was clean, bed was good, bathroom was perfect. dont listen to the bad reviews this place is perfect for somwhere to sleep and freshen up when in new york!!!", "Date": "October 8, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "3", "Location": "4"}, "AuthorLocation": "racine, WI", "Title": "“Nice location, great price, would def stay again!”", "Author": "autumrose", "ReviewID": "UR73474285", "Content": "Booked the hotel based on the reviews I read from here. Upon leaving the airport the transporter man laughed when we said where we were headed, this scared me!!! From the outside this place looks super cheesey but you get what you pay for. Yes the room is TINY, but the air conditioning worked, the bathroom was very nice and the room was clean. We were hardly ever in our room, pretty much just to sleep so for the price this location was perfect a walk away from times square, restaurants and central park. For my personal tastes the next time I go to NYC I'd prefer to stay in one of the villages just bc they are more my cup of tea but if you're there for the hustle and bustle of NY this is the place to stay for CHEAP :)", "Date": "August 2, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "3.0", "Value": "5", "Sleep Quality": "2", "Rooms": "4", "Location": "5"}, "AuthorLocation": "London, United Kingdom", "Title": "“Budget hotel, fantastic location”", "Author": "d_c_31084", "ReviewID": "UR72413541", "Content": "I stayed here on a budget break to New York in October last year. The location of the hotel is perfect. We took the subway from the airport and only had to carry our suitcases a few blocks. Check in was quick and easy. The rooms and pretty basic in style and content but quite spacious for a budget hotel. A couple of annoyances, we had no view (just looking onto another building) and there was a hum of a generator and road nearby. You can also hear people walking down the corridor outside the room but it wasn't intrusive. Rooms were kept clean throughout our stay. Again, location is the real highlight of this hotel, only a 5-10 minute walk to Times Square. Staff were friendly and helpful when wanted advice on getting around, site seeing, directions. Breakfast is very basic but we were happy with a coffee and criossant every morning. I would definitely stay here again if I wasn't looking to splash the cash.", "Date": "July 26, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Reading, PA", "Title": "“Good deal”", "Author": "murbanReading_PA", "ReviewID": "UR72058016", "Content": "Keep up the good work DaVinci Hotel. We had a great stay at a good price. Good deal on parking as well.", "Date": "July 23, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Toronto, Canada", "Title": "“Great location, great hotel!”", "Author": "Adventurous_1_10", "ReviewID": "UR71553264", "Content": "I stayed at the Da Vinci Hotel from July 12th to 15th. I went with my mother and we were in a room on the 3rd floor. We both enjoyed our stay at this hotel. It is in a perfect location. (5 minute walk to central park. 7 minute walk to Times Square) The front desk staff were always pleasant and very helpful. Yes, the room was small, but that was to be expected in NYC - we were out late most nights, seeing a show or walking around that we only used the room for sleeping. The bathroom was clean and quite nice. The air conditioning worked just fine in our room and it was also on in the lobby. There was free internet and in the morning there was complimentary coffee, mini muffins and pastires. We arrived early and check-in was not until 3pm. We were able to leave our bags in the lobby while we went and explored the area while waiting for the room to be ready. Overall we had a great time in NYC and the hotel was perfect for us. I would stay there again.", "Date": "July 19, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "1"}, "AuthorLocation": "Santa Clara, California", "Title": "“Dirty and Unsafe”", "Author": "California70", "ReviewID": "UR67734932", "Content": "Easily the Worst Hotel I have ever stayed at. The Photos are deceiving. This Hotel makes Motel 6 look like the Four seasons. I had made my reservations for 2 nights based on the reviews I read on Yelp. I arrived to the hotel at 12:30PM and immediately regretted my decision. I informed the front desk that I would only need to stay in the room for one night and he told me that he could not refund my $$. I was stuck there in that Cocker roach infested place for 2 nights! Please whatever you do NOT stay here. It is Dirty, Unsafe and has terrible service. I complained to Joe the manager who did nothing. The room was never cleaned throughout my stay. There were visible dirt (maybe blood) stain on the covers. Sad. I Love traveling to NYC. My stay at The DaVinci ruined the trip for me", "Date": "June 16, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Sleep Quality": "2", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Perth, Australia", "Title": "“A good location, but it's a box with a bed in it.”", "Author": "KarenMonkey", "ReviewID": "UR67065146", "Content": "We selected the Da Vinci Hotel mostly for economy - accommodation in New York is expensive. The room was very small with no view whatsoever. There was only just enough space for the bed (which was uncomfortably firm), a chest of drawers, and a small desk, which meant there wasn't really room for our two suitcases. Compared to the bedroom area, the bathroom was surprisingly large but a little rundown, with chips in the bath. It took about five minutes for hot water to come through in the shower. There are no \"frills\" - no iron, the safe was locked shut, noisy air conditioning. However, the room was quite clean, and the foyer was quite attractive. Staff were average - not rude in any way, but not necessarily helpful. Ignore the offer of free breakfast - it's a meagre selection even if you're there early (6am), and by 9am it's down to plain bread rolls. Definitely eat at Joey G's below the hotel, for a convenient, tasty meal with friendly service. The location is very good, being only a few blocks from Central Park and Times Square, and close to a subway station for anywhere else. Free internet access at two computers in the foyer, although it's first-come-first-serve for access. Overall, wouldn't recommend it over anywhere else, but worth a look if you're after a cheap(ish), convenient place to stay.", "Date": "June 10, 2010"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Overall": "3.0", "Value": "4", "Sleep Quality": "3", "Rooms": "2", "Location": "5"}, "AuthorLocation": "Toronto", "Title": "“We wanted cheap and conveniently located, and that's what we got!”", "Author": "hollyg2", "ReviewID": "UR66312574", "Content": "The DaVinci is cheap, clean, functional and conveniently located. How much time do you spend in your hotel room in New York City, anyhow? A good choice for travelling with a friend for a few days, probably not a good choice if you're travelling with your family or spouse for a longer stay; there is just no privacy at all. The staff were cheerful, if not helpful. They did allow us to leave our bags when we arrived - they have a super late check-in, which I hate. The bags are left unsecured in the hotel lobby without any identifying tags or anything, so I wouldn't leave your laptop or any other valuable item there. The \"complimentary breakfast\" is cold white rolls and plastic-wrapped pastries. And coffee. But if you're travelling cheap and cheerful, a jar of peanut butter and some fruit (there is a fridge in the room) rounds out your breakfast pretty nicely. The free wireless worked in the lobby, but our connection dropped constantly in our room. The rooms are super-small - even for New York - one double bed and we could touch the wall on either side of it. This hotel was a quick walk to Central Park and the Ed Sullivan Theater and right near many major attractions and subway lines. If you're used to travelling on a budget, this hotel will be a gem. If you normally stay at higher end hotels, you will be very disappointed. No concierge service, the staff did not know the city well. Our room keys demagnetized every time we left the hotel, which was annoying and probably our fault. They have one tiny elevator which fits three people tops and takes forever - you CAN take the stairs. There is a restaurant on-site that we didn't try.", "Date": "June 3, 2010"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Overall": "1.0", "Value": "3", "Sleep Quality": "1", "Rooms": "1", "Location": "4"}, "AuthorLocation": "Washington, DC", "Title": "“Horrific Night”", "Author": "CitiTraveler", "ReviewID": "UR65328782", "Content": "Out of thousands of hotel room nights in my lifetime, this was one of the two three worse. Not just because because the room was very small, or faced onto a junky interior wellway-- for low rates in Midtown, what should expect? BUT-- First problem - very dingy lighting (expect in the bathroom) -- one weak ceiling light, one anemic light on bedstand, and none on the desk. Second a VERY HARD BED, so that I was tossing & turning most of the night-- result true soreness! (And I normally like rather hard beds-- this one was hard over the top). Third, an air conditioning unit that made such a racket, especially when cycling on, that I was awakened each time it started up. I left exhausted.", "Date": "May 25, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Location": "4", "Rooms": "4"}, "AuthorLocation": "dekalb,il", "Title": "“Wonderful personal service.”", "Author": "reidsmom", "ReviewID": "UR49785534", "Content": "This hotel was in a good location, the room was large by New York standards and very clean. The service was excellent. They were very prompt at check-in and at check-out we were provided with a printed, detailed map for public transportation to the airport. They were always friendly and let us leave bags there after check-out until we left for the airport.", "Date": "November 22, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Baltimore, MD", "Title": "“Amazing Find”", "Author": "RLee3", "ReviewID": "UR49749276", "Content": "This hotel is a great find in the heart of NYC. It's close to subways and the theater district as well as iconic locations like Central Park and Times Square. The staff was friendly and accommodating. Breakfast was mostly pastries and coffee. The downstairs computer was often occupied but it was nice to have free internet handy. The room was huge by NYC standards and the bathrooms were spacious and clean. The hotel runs a special with a parking garage right across the street so you can save some money on parking.", "Date": "November 21, 2009"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "2", "Location": "5", "Rooms": "1"}, "AuthorLocation": "sweden", "Title": "“Worst ever”", "Author": "Baldrique", "ReviewID": "UR48459657", "Content": "My fiancé and me had planned a 3-day visit to the City. The location sounded great, and to an affordable rate. We arrived before noon, and left our bags at the front desk, knowing check-in wasn’t possible before 2PM, and headed out into the City. We came back later that night, after have been dining at the restaurant below the hotel. (which by the way had great food) Checked in, only to find that our room was ice cold. I called the front desk about the issue, only to be told the radiator was on a timer. That radiator hadn’t been on for days, the pipes, well all was ice cold. Went down to the front desk to confront the staff, only to again, be told “it was on timer.” I have been in the hotel business for almost 15 years, and have never experienced anything like it. Finally the clerk agreed to call somebody to try and fix the radiator. 30 minutes later( it was now close to 11:30PM), the waiter….., from the restaurant came to the room – the radiator had a valve at the3 floor that was closed. He opened it up, nothing happened. Called his buddy -–probably the other waiter, to check the basement connections. The whole system to our room was shut down from below. Finally around 12:30am, things started to happen – as the pipes began to make a few attempts to flush water through them. We got the room somewhat warm - it was F40 outside. The next morning we went down to the ”breakfast”, which consisted of a muffin or two and some coffee – They called it continental breakfast – oh yeah. Never again we will visit that establishment. Baldrick", "Date": "November 3, 2009"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Location": "5", "Rooms": "1"}, "AuthorLocation": "Dutchess County, NY", "Title": "“Never Again!!!!!!!!!!!!!!!!!!!!!!”", "Author": "ILoveNudeYork", "ReviewID": "UR47732574", "Content": "We had decided to go the DaVinci hotel beacuse the rate was low at a very good location. I had checked some reviews and thought it was okay. I was soo wrong.The only thing I gave a good rate to is the location. Your very close to Central Park, Time Square, and near by subways. I do have to give a poor rating to the rest. Here is my reason why. We got there and the front desk came off a bit rude. When I walked in she just asked if we were checking in, no hello or how are you. As we were checking in, we found out that our room was not cleaned when we arrived way after check out. We were patient and asked if we can leave our luggages while we get a bite to eat. Her reply was you can leave it in the lobby. Are you serious? We decided that one should stay in the lobby while the other runs to McDonalds next door to get food. After an hour our room was ready. When we got in we were upset because we had the front rooms and they said that rooms are usually bigger in that end and it was small. We looked around to make sure it was clean, and ended up finding a roach. We went back downstairs and the front desk agent just shrugged and said thats New york. We asked if we can go to another room and she said she was able to do that. She said the manager was the only who could reassign rooms. We asked to speak to a manger and she said that the manager would be in at 11pm. We asked if there was any other time he'll be in and she said \"No, he does night audit\". So we asked for maintenance and she said fine. We waited when maintenace came up he had a cook outfit on. We were a little confused, but we remembered that they had a restaurant below the hotel (same owner). We decided to skip the restaurant downstairs, even with a 10% discount, I dont want to even know. What he did do was sprayed some bug spray (thanks). That night we saw the manager and complained. His response was a shrug. The followng day we woke up and noticed bite marks on our body. We finally had it and asked to speak with someone else. Another girl at the front desk asked for the owner and the owner himself didn't have a response. It seemed as if he didn't know much either or how to manage a hotel. We complained to him about the service and the room. We asked that we get our money back and he said no, but he'll gve us a free meal and we said hell no. We also told him why. We decided we weren't going to stay. We used the computers up front to reserve a room at a different hotel by Orbitz. Much better. Do not be fooled by the low rates, this hotel is unbelievable.", "Date": "October 25, 2009"}, {"Ratings": {"Service": "2", "Cleanliness": "2", "Overall": "2.0", "Value": "3", "Location": "4", "Rooms": "2"}, "AuthorLocation": "Houston, TX", "Title": "“Very Nice Trip”", "Author": "mdmartinez123", "ReviewID": "UR46334373", "Content": "The hotel is Ok, small rooms but good enough just to spend the night. New York is the best city I ever been to. Every thing is very close by the hotel, walking distance. I really recommend this hotel if you want to save money and use it around the city in fun things.", "Date": "October 8, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "4.0", "Value": "5", "Location": "5", "Rooms": "3"}, "AuthorLocation": "Louisville, KY", "Title": "“Really Nice Find”", "Author": "pick6king", "ReviewID": "UR46324075", "Content": "This small hotel was a really nice find. It is one of the better deals around. The location is great... within walking distance of Times Square, close enough to subway lines, and right next to a McDonalds (great for milk for the kids). We will definitely look to stay here in the future,", "Date": "October 8, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Location": "4", "Rooms": "2"}, "AuthorLocation": "Milw", "Title": "“Basic accommodations at a reasonable rate”", "Author": "Tomobama", "ReviewID": "UR46303761", "Content": "Very convenient location right off Broadway.Definitely not a plush hotel but adequate.", "Date": "October 8, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "3.0", "Value": "5", "Location": "5", "Rooms": "2"}, "AuthorLocation": "Boulder, Colorado", "Title": "“great location”", "Author": "RoGoColorado", "ReviewID": "UR44442396", "Content": "I've stayed here a couple of times. The second the water wasn't hot one day and the hotel owner basically thought I was crazy and didn't know how to turn the knobs right. As if. But, I'd stay there again because it is affordable and the location is good. Rooms are clean and fine. Nothing great, no views. Close the Central Park, Columbus Circle, Time Warner Building and Whole Foods, Soup Nazi and walking distance to theater district. Mr. G's Italian restaurant below.", "Date": "September 25, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Scotland", "Title": "“Reasonably priced and handy for most attractions”", "Author": "TheGoodShag", "ReviewID": "UR43693777", "Content": "Cheap and cheerful but exceeded my expectations. The most important thing was that the room and bathroom were absolutely spotless. The bathroom was quite luxurious for a cheap hotel. Breakfast was included which amounted to croissants, rolls, muffins, tea/coffee. You had to get down early if you wanted a croissant; they disappeared fast. An unexpected bonus was a safe in the room and a fridge. There were two computers with free internet access. Staff were friendly and helpful. The only gripe I have was that the air conditioner was very noisy and we had to turn it off for sleeping. We also had a meal (at 15% off for hotel guests) in the restaurant downstairs. No complaints about the food or service but it was VERY, VERY expensive. I would have no hesitation in using this hotel again and can thoroughly recommend it.", "Date": "September 22, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "4"}, "AuthorLocation": "06073", "Title": "“Jewel in the city”", "Author": "nealonb", "ReviewID": "UR38563501", "Content": "Great location, clean, quiet and affordable. It'll be our home base in NYC in the future.", "Date": "August 23, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "2", "Overall": "3.0", "Value": "3", "Location": "4", "Rooms": "2"}, "AuthorLocation": "Greensburg, PA", "Title": "“Very Average”", "Author": "ajjarm", "ReviewID": "UR38195257", "Content": "cheap rate $169/night for two double beds (that was all that was left when we booked). rooms quiet, nice size yet beds were the least comfortable we have ever slept on. We felt safe, liked the location. Did not have the continental breakfast-was not much to speak of. Very average experience.", "Date": "August 19, 2009"}, {"Ratings": {"Overall": "1.0", "Service": "1"}, "AuthorLocation": "CA", "Title": "“Their reservation system does NOT work”", "Author": "varunkohli", "ReviewID": "UR37769686", "Content": "If there was a ZERO rating I would have given that. I booked the hotel using orbits for 2 nights 2 months in advance ... called the hotel 2 days before the trip to confirm and they said they were sold out on one day and i have reservation for just one day. Receptionist was the worst ever front desk person I have talked to ... first she did not want to tell her name ..then she told her name but was not willing to spell it ..... I asked for the manager and she said she is the only person in the hotel ..... this hotel is cheap but please make sure you confirm your reservation with them before you go there. You dont want to sleep on the streets of new york ..... worst experience ever of booking the hotel online .. beware of crooks out there ...", "Date": "August 15, 2009"}, {"Ratings": {"Service": "1", "Cleanliness": "5", "Overall": "3.0", "Value": "2", "Location": "5", "Rooms": "3"}, "AuthorLocation": "Eskisehir, Turkey", "Title": "“RESERVATION NOT HONOURED”", "Author": "csant", "ReviewID": "UR36701171", "Content": "Was looking really forward to stay at this particular hotel, but although I had booked months ahead when I arrived at about 1.30 am on the 30 June no room was available.After a long journey from Istanbul/ London this is the least I expected.They put me up in an other hotel nearby The Chandler....although receptionist terribly nice somehow I felt cheated by the management as I had to pay oabout 250USD for a wasted night.What makes it worse although I have emailed 2 in the last month to the same hotel the management didn't even had the decency to reply and give an explanation..", "Date": "August 4, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Liberty,Texas", "Title": "“Great Location ! Worth a Try !”", "Author": "katze66", "ReviewID": "UR36261078", "Content": "This hotel is in a great location. We could walk everywhere or hop on the Subway if we had to go further. Everthing was close by. The room was a little tiny but quiet and clean, the staff friendly and helpful. We dined at their very own Restaurant downstairs - the food was very good and reasonably priced. I would recommend this little Hotel to anybody.", "Date": "July 30, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Mexico", "Title": "“will stay again”", "Author": "LaPatita", "ReviewID": "UR35784851", "Content": "This hotel grate for the price we paid. It's very clean, and that was the most important thing to me. The room is not that small . 2 blocks from central park and 6 blocks from times square. It has 2 PC and printer free . Small continental brakfast", "Date": "July 25, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "4", "Location": "5", "Rooms": "3"}, "AuthorLocation": "Auckland", "Title": "“Value for money”", "Author": "Trossnz", "ReviewID": "UR35606092", "Content": "Da Vinci was recommended by friends and it proved a good tip. Comfortable, tidy and while a little compact it was more than reasonable - after all, in New York, how much time do you spend in your room? Columbus Circle underground and shopping complex (great food hall) was a short walk away, Times Square was a little further and probably equi-distant to Central Park. Several restaurants and bars in the vicinity, a great international newsagent on the way to the underground, and a laundromat on the next block (heading towards the river). Staff were helpful.", "Date": "July 23, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Aurora, CO", "Title": "“I will always stay here when I'm in NYC”", "Author": "MAtluru", "ReviewID": "UR35373770", "Content": "Nearly everything here was fantastic - the price, the location, the staff and the room. I booked through Travelocity and got a great weeknight deal. They're located right between Central Park and Times Square, and are surrounded by great restaurants. The staff was very polite and helpful, not only when we checked in and during our stay (one night before a cruise) but 10 days later (returning from the cruise) when they allowed us to leave our bags in their lobby for the day before our flight departed. The room was small but quite sufficient, with a comfortable bed and pillows, decent water pressure in a beautiful marble tiled bathroom. The computers with internet access for guest use are a brilliant amenity as well. The one small item that wasn't fantastic was the continental breakfast, but that's very easy to overlook when the rest of the experience was fabulous. I will always return to this hotel when in the city, and will recommend the same to my friends.", "Date": "July 21, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "3.0", "Value": "4", "Location": "5", "Rooms": "3"}, "AuthorLocation": "", "Title": "“You get what you pay for, great location.”", "Author": "vil1074", "ReviewID": "UR32739923", "Content": "We were given a room on the 5th floor at first and we didn't have any wi-fi connection and it was tiny. We were given a room on the first floor the next day which was slightly bigger but the view from the window was a brick wall. The staff was very friendly and accomodating, with the exception of one. It has a Euro atmosphere. The location is perfect, steps away from Times Square. This is the clincher, we'd run out of toilet paper and I asked reception for more. I was told the cleaning lady was gone and I'd have to wait until tomorrow. I had to go buy toilet paper!!!!", "Date": "June 20, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "newport beach, ca", "Title": "“Perfect”", "Author": "jeffyjoe44", "ReviewID": "UR32497023", "Content": "This place is exactly what you need for a quick 3 day weekender into NY. The place is perfectly located to everything, food, drinks, subway. Yeah it's small, but how much time do you reall spend in the room? We had a room on the first floor ,in the hallway between the lobby and the elevator. We didn't hear much the whole time. The one positive/negative thing; depends on how you feel, you do smell french fries all day and all night from the Mcdonalds next door. I'd definitely say here again. Our room was 139 a night. If you want to pay $250 for a chain. Go right ahead! Oh I almost forgot about the bar right downstairs. Good atmosphere. Nice people/", "Date": "June 16, 2009"}, {"Ratings": {"Service": "2", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Location": "4", "Rooms": "3"}, "AuthorLocation": "california", "Title": "“Great Location... so, so service.”", "Author": "sasa07", "ReviewID": "UR28394747", "Content": "The hotel is centrally located and while not large has a wonderful charm to it. The service was only so, so. The front desk staff was not particularly attentive in comparison to the two other hotels that we stayed in during this trip to the East Coast. The room was spacey and clean though we were right next to the elevator and had a great view of a wall from the one window in our room. The pipes did make some strange noises but that was really not a big deal for us since we weren't in the room that much. They did offer free internet access in the lobby which was convenient as we did not bring our laptop with us.", "Date": "April 20, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Kansas City", "Title": "“Great Location, Simple, like Bed & Breakfast w/o the REAL Breakfast”", "Author": "travelangel88", "ReviewID": "UR25551183", "Content": "Got Room 202, a double that overlooks street, plus room was pretty big w/marble bathroom, closet w/safe & hangers, 2 tables, chair, chest drawer w/mini fridge, 2 big mirrors, & flat screen TV. Since we were right next to street, t'was noisy; there were clanky noises coming from pipes, but we were so exhausted by end of day that we fell right to sleep. Smells probably coming from McDonald's next door. Front desk friendly/helpful, came back to the hotel with clean room, towels, & toiletries every day. No problems w/hot water, but might need to wait a to heat up. \"Contintental Breakfast\" is rolls, butter/jam, packaged glazed donuts & muffins, coffee & tea. Eat a lot, you'll be set for the morning. 2 new computers in the lobby for free use. Overall, great hotel for those trying to save money, don't mind lack of luxury, & just want place to sleep/rest. If you're looking for the Sheraton, this isn't for you. If you've stayed in a Bed & Breakfast, you won't mind this one. Did I mention it's a walk away from MANY attractions?", "Date": "March 4, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Location": "5", "Rooms": "3"}, "AuthorLocation": "Galway", "Title": "“Fab location, good value for money if u are just looking for hotel to sleep in.”", "Author": "GalwayLulu", "ReviewID": "UR25243433", "Content": "Great location. So near Times Sq, Central Park, National History Museum etc. You can walk to all of these, no prob. Def recommend to anyone. Great value for money. We left early each morning and returned late each night so only interested in a hotel to sleep in. Rooms very average but got over it as was soooo excited about being in NY!! Hotel offers coffee and muffins in the morning. They are not great but will keep u goin until u get breakfast. 2 computers in the lobby. Very useful for maps etc. Hotel didnt charge for printing. We ate in the restaurant downstairs but thought it was a little overpriced. Nice food tho. Would defo stay again. Prices are great and would prefer to keep my money for clothes instead of spending on hotels!!", "Date": "February 27, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Location": "5", "Rooms": "3"}, "AuthorLocation": "Yardley, PA", "Title": "“A nice two-star hotel in midtown.”", "Author": "DrGoldin", "ReviewID": "UR24420182", "Content": "This is not a luxury hotel, but it's clean and comfortable, with an unbeatable location (three blocks from Columbus Circle), and I'd certainly come back. My room was small but not tiny, with a new queen bed, LCD TV, and an attractive updated bathroom. The one defect of the room was that the carpet was worn badly in one spot (and wouldn't have looked very pretty even when it was brand new); this makes the room seem rattier than it really is. Also, there is no internet service in the room, but two fast computers with internet connections are available for guests in the lobby. I'd advise the management to add a TV channel guide. That would be a very low-cost-high-reward improvement. There are dozens of channels, but it takes quite a while to figure out where they all are. Guests of the hotel receive a 15% discount at the restaurant downstairs, a good-but-not-great Italian place called Joe G's. Parking is available right across the street for $28 overnight. What a bargain!", "Date": "February 9, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "4", "Overall": "4.0", "Value": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Vermont", "Title": "“Great Location, Super Convenient”", "Author": "Mar326k", "ReviewID": "UR23471891", "Content": "Traveled from Vermont via Amtrak, took subway to Hotel. Small family operation, would recommend to anyone. Easy to get to, walking distance to all of Broadway shows and Times Square. Restaurants galore in the area, restaurant in the building was excellent, discount for people staying there too. Would stay at again without any thought.", "Date": "January 11, 2009"}, {"Ratings": {"Overall": "1.0", "Value": "1"}, "AuthorLocation": "London", "Title": "“Cancellation Scam”", "Author": "Apodis", "ReviewID": "UR22554215", "Content": "We didn't actually make it to this hotel but I wanted to share our cancellation experience to warn other unsuspecting travellers that some hotels have a very hard nose approach to cancellations and furthermore set up their cost structure to maximise their take. The reservation was made directly with the hotel a couple of months in advance over the phone. It took several additional calls to ensure we had a booking and eventually the hotel sent an email confirmation (which for some reason had 'modification' at the top and was odd since this was the first communication from the hotel). At no time on the phone was there mention of their cancellation policy and it was hidden in the reams of information at the bottom of the email they sent. In addition the rate we were quoted was $329 for the first two nights and then dropping to $209 for the next night and then $289 for the rest of the stay (a total of 6 nights in all). Overall an average of $289 per night. Their cancellation policy states one night penalty and yes you have guessed it, instead of the average or even the lowest we were charged $329 cancellation fee. Their policy states that any change or cancellation within 7 days of arrival has a one night penalty and I called them 4 days ahead of arrival to cancel. I was told that if I spoke to the manager he may be able to reduce the fee but I made several calls to try to speak to him and was told every time that the manager was either off duty and would be in at 11pm (NY time) or was unavailable. I also tried to email the manger but never got a response from him. The only other communication I received from the hotel was that they had charged my card the $329. My recommendation is to avoid this hotel if at all possible unless you are absolutely sure you won't have to cancel within the 7 days prior to arrival.", "Date": "December 8, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "London", "Title": "“Brilliant”", "Author": "Amandajj87", "ReviewID": "UR22524886", "Content": "Location Brilliant. 10 mins from everything. Central park, times square, broadway, shops! Hotel was a lot better than expected after reading reveiws. Staff were extremly helpful and nice without being intruding. The Italian Restrant below was gorgeous, the food was gorgeous, prices were best around with discount, for what you get (I would recommend the restarunt even if not staying in the hotel). Our room was very spactious, we had two double beds, a chair, two wadrobes, a desk, TV, safe, phone. Bathroom was extremly clean with enough room for 2 girls to get ready!! We left our luggage in the lobby and surfed the net on very up todate computers. We did not notice any smells from the air con (we had it on one night as the heating got a tad hot). Overall a brilliant experiance and would deffiantly stay there again.", "Date": "December 7, 2008"}, {"Ratings": {"Cleanliness": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "USA", "Title": "“Great place to stay.”", "Author": "bluegrassfan48", "ReviewID": "UR21942773", "Content": "This was a very nice and very clean hotel, within walking distance of Time Square and the theaters. The rooms are small but I think most are in NY. I would stay there again if I ever get back. The staff was friendly and helpful. The restaurant food was also great.", "Date": "November 17, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Business service (e.g., internet access)": "3", "Check in / front desk": "4", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Reading", "Title": "“Great little hotel”", "Author": "L0ng_arms", "ReviewID": "UR21470853", "Content": "My wife and I decided to go for a few nights stay in New York to see all of the sights and were looking for a reasonably priced hotel to stay in. Most hotels seem to be very expensive though unless you picked one with a shared bathroom. Allow not super cheap, The Da Vinci proved to be excellant value (£100 per night). It has a nice feel to the reception where they server a very basic breakfast (bread rolls, jas, coffee - and honey buns mmmmm), which is enough to se you up for the morning or a snack before you head out for a NY breakfast. There was also free internet which is always useful when exploring a city. The hotel staff were friendly enough, although I had no real reason to complain or request anything so just passing hellos. The room was a standard double which was small but clean and the decor was all in good condition. The bathroom and shower were all very nice too. The location of the hotel is also good, it's just below the middle of Central Park and 1 minutes work from Broadway. It's on 56th street so you can walk down to time squar in 10 minutes which makes it a pretty central starting point for any sites you want to see. I would definitely try to use it on any future trips to NY.", "Date": "November 2, 2008"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Business service (e.g., internet access)": "3", "Check in / front desk": "3", "Overall": "3.0", "Value": "3", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Ontario Canada", "Title": "“Cheap for NY, AWESOME LOCATION, Small, Neat, Basic”", "Author": "Mela026", "ReviewID": "UR21055071", "Content": "We stayed at this hotel for 4 nights in early Sept. We were on the 5th floor at the end of the hall so we had a small view of the street. For about 200$ a night its not cheap but for NYC it is very reasonable. I was scared since it was the cheapest I could find other then a hostel. We arrived and found parking right accross the street. Dont forget to have the hotel stamp your card so you get a discount. Parking for 3 nights cost us around 85$. The hotel was hard to find. Its in between an Italian resturant and a McDonalds. Just look for the McDonalds at the corner and the hotel is on its left. Cute little loby. Staff was quiet but nice. The hallway is very narrow to the elevator and to your room. The room very very small. Just enough room for one chair/ one queen/double bed and a small dresser. Old but clean. The bathroom was nice and clean but a little mold in the grout and the shower door. Air Conditioning was great and the fride was good for keeping drinks. We did not have the breakfast there, but I did see coffee and dinner rolls? Which didnt seem appealing to me. Great little spot for breakfast around the corner \"bread factory\". We did not have a problem with bugs or cockraches but one of the other ppl staying there on the 3rd floor did see one in their room. We also did not eat at the restaurant downstairs so I cannot comment on that. All I can say is if you only need a place to sleep and wash up, stay here. I'd rather save the $ on the hotel to be able to do other things in NYC. The location was EXCELLENT! Do the bus tours they are really worth it!! Lots of great restaurants near by! Cancun restaurant nice little mexican place and reasonably priced was amazing! We ate there twice! Staff was great! I would recoment this hotel. Not for your honeymoon tho! Which is what we were on! lol but we did enjoy our stay! and again LOCATION LOCATION LOCATION!", "Date": "October 21, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Business service (e.g., internet access)": "3", "Check in / front desk": "4", "Overall": "4.0", "Value": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Denmark", "Title": "“Friendly, helpful staff at clean hotel”", "Author": "Jens2500", "ReviewID": "UR20989408", "Content": "Not much light comes in and no real view from the window, so would rather have spared it to keep out the noise and odour from neighbour restaurant's ventination. But having said that the room was very nice and location was absolutely great for a NYC visit. Breakfast was minimal but enough to get us going until a mid-morning brunch. Room and hotel was clean and the staff was very friendly and helpful. Would stay again if I go back to Manhattan.", "Date": "October 18, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "2", "Check in / front desk": "4", "Overall": "3.0", "Value": "3", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Quakertown, PA", "Title": "“Great Location, Not Much Else”", "Author": "Booch", "ReviewID": "UR20587316", "Content": "My husband and I stayed here one night (10/1) to see a show at Radio City (which BTW was excellent!) We are from the Philly area and really only ever do day trips to NYC so we decided to stay overnight as an early bday celebration for my husband. The hotel's location can not be beat. Check-in was quick, friendly and efficient and check-out was also the same. Times Sq is in walking distance and about one block over are a million places to eat breakfast (Fluffy's, Carnegie, Park). Easy access to shopping and also Central Park and Columbus Circle are two blocks north. There are several subway stops within two blocks of the hotel. If you are coming in from Penn Station, you can take the blue line C train 3 stops up to Columbus circle($2 one way) Now for the hotel itself. Do not expect luxury at this hotel. This is strictly what I would call a tourist 2 star hotel. NYC is expensive so to get a hotel for under $200/night in this location you can't expect much. The room is small, big enough for a queen size bed and a small (very small) desk. They did manage to put a small wardrobe with a frig which I thought is convenient to keep drinks cold and there is space to hang-up shirts. The bathroom decor was nice w/small shower stall, toilet and pedestal sink just as you see in the pictures on this site. The room was clean and the bathroom was spotless. However, I must mention one mishap when we were getting ready to leave our room to check out. There was a cockroach in the bathroom on the floor at the base of the pedastal sink. We were on the 3rd fl and roaches usually make their way up from the ground so it had to make us wonder what was going on in the basement. The restaurant is in the basement and we did not eat there so I cannot comment on that. We only saw one but usually where there is one there is a hundred. Unfortunately because of this mishap, we will probably not stay here again and try to stay somewhere else", "Date": "October 3, 2008"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Business service (e.g., internet access)": "1", "Check in / front desk": "2", "Overall": "2.0", "Value": "1", "Rooms": "2", "Location": "5"}, "AuthorLocation": "Brazil", "Title": "“No hot water and yes, the housekeepers steal!!!”", "Author": "rabeu", "ReviewID": "UR20565065", "Content": "No hot water in our room at all. They changed us to another room and guess what? No hot water. The housekeepers steal too. My wife lost a couple of clothes. The location is good, but with that price you can get better deals.", "Date": "October 2, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Business service (e.g., internet access)": "3", "Check in / front desk": "5", "Overall": "4.0", "Value": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Alpharetta, GA", "Title": "“Very Good Value”", "Author": "AlpahrettaTraveller", "ReviewID": "UR20381540", "Content": "We stayed for 4 nights in end of August. The receptionist was friendly and helpful. We had a double room on 5th floor. The room was comfortable and the bathroom was nice. The only negative we had was that the toilet was clogged up when we checked in. We called and they fixed it right away and that was encouraging. This sort of problem happens sometimes even big name hotels. Great location close to Times Square and Central park. Great value in NY city. Will definitely stay there again.", "Date": "September 25, 2008"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Business service (e.g., internet access)": "2", "Check in / front desk": "1", "Overall": "2.0", "Value": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Rome, Italy", "Title": "“Good location - Staff not OK”", "Author": "freeport76", "ReviewID": "UR20060296", "Content": "Hotel position is very good, near Central Park. Metro stop next to hotel. Rooms OK. Bathroom Good. Breakfast consists ONLY of a cup of tea/coffee and a couple of cookies , which are served directly in the hall (no sitting!). Staff not really polite and quite not available - they sure don't contribute to the untrue story that New Yorkers are rude!", "Date": "September 14, 2008"}, {"Ratings": {"Service": "1", "Cleanliness": "4", "Business service (e.g., internet access)": "3", "Check in / front desk": "1", "Overall": "2.0", "Value": "2", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Atlanta", "Title": "“Location, Location, Location”", "Author": "Jacmac4000", "ReviewID": "UR19879200", "Content": "The location near Columbus Circle and Carnegie Hall is excellent. Clean but very small rooms (some with airshaft views), lobby internet service and good coffee and hard rolls each morning argue in its favor. But there is no baggage storage except in the lobby and the restaurant is in the cellar, down a steep flight of stairs. Front desk service was the worst and least helpful we have experienced in many years, varying from ironic and superior to downright rude.", "Date": "September 8, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Business service (e.g., internet access)": "5", "Check in / front desk": "4", "Overall": "4.0", "Value": "5", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Fredericksburg, Texas", "Title": "“A very pleasant surprise!”", "Author": "78624USA", "ReviewID": "UR19866098", "Content": "This is a fine little hotel. The location was what was amazing. Walking distance to Broadway, Times Square, Hell's Kitchen, 5th Avenue shopping, and Central Park. It's just one block away from the 59th St subway. Let me say it: location location location. The rooms are small and a touch minimalistic, definately \"euro\" style just as they advertise. Still it was all that we needed. The bathroom was above average to what we expected and quite comparable to better hotels in Athens. The staff was very pleasant and polite. Not highly skilled in English conversation but no misunderstandings. There was a small wait to use the free computer in the lobby(a new Dell with wide screen and lightening fast internet) but unlike most hotels these guys are really customer focused and they were already setting up a second computer during our stay. The computer prints to the printer at the front desk. The breakfast in the morning is minimal. Not continential, offering only coffee/tea and pre-packaged muffins/donuts. No coffee/tea service in the room that I saw but there was a small refrigerator. There was a very nice flat screen TV on the wall, and a great \"view\" of the relic of a building 10 feet away, but again it's New York where most views are buildings next door. The mattress was hard with little padding but surprisingly there was no morning backache after a 4 day stay. Our bed was a queen bed. The furnishings, carpet, and bedding were a bit dated but the room was really clean. This place wins my high value award based on the location, cleaniness, price, and friendly staff. We already plan on staying again.", "Date": "September 7, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Business service (e.g., internet access)": "3", "Check in / front desk": "5", "Overall": "5.0", "Value": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "ENGLAND", "Title": "“Classic Hotel in Great Location”", "Author": "Ogre", "ReviewID": "UR18077527", "Content": "This was our 4th Visit to New York and we decided this time to stay down near Columbus Circle. The Hotel has a great location near Columbus Circle and Hells Kitchen both being about a 5 minute walk away. The hotel itself look very narrow from the outside so is quite hard to find. The Reception area is where you can find the free internet and they dont charge you for printing out things. Once checked in which didnt take very long you go down a narrow corridor to the lift. The room we had was of good size (european size) but you only use the room for sleeping and washing. The bathroom had a really nice shower and the size would probably be quite small for some travellers. The air conditioning unit was a god send with the weather being quite sticky. There is a TV on the wall but you dont go to NYC to watch TV but I was glad of it as I was poorly one day. The only thing that I would suggest could be better was storage space in the room. Times Square is about a 10 minute stroll. Staff are really friendly and we even had discount for the Restaurant Downstairs.", "Date": "July 20, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Business service (e.g., internet access)": "2", "Check in / front desk": "5", "Overall": "4.0", "Value": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Calgary, Alberta", "Title": "“Awesome location, great staff, average rooms - would stay again”", "Author": "travelingswer", "ReviewID": "UR17403851", "Content": "We stayed at the Da Vinci from June 24 - 28, 2008. It is a great little hotel. The rooms were average, nothing special, but the location was amazing. Right off of Broadway, walking distance to times square, letterman theater, and all the bus tours, which I also highly recommend. It's also close to the subway, which makes it really easy to get around the 5 Burroughs. The staff were really helpful with all our questions and the lobby has a free computer for internet use. The breakfast in the morning is as basic as it goes, coffee/tea and pre-packaged muffins/donuts, but the coffee was really good and strong, exactly what you need to conquer a long day in NYC. Our room was very basic... 2 double beds, tv, small bathroom and our \"view\" was of another building. The furnishings & carpet were out dated, but really, we were barely in our room except to sleep, so we didn't care about that. Our shower was just fine, contrary to other reports on the hotel... plenty of hot water. We would totally stay again.", "Date": "July 1, 2008"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Business service (e.g., internet access)": "4", "Check in / front desk": "4", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "St Petersburg Fl", "Title": "“a nice hotel with a nice location”", "Author": "zoso190", "ReviewID": "UR16664779", "Content": "i stayed at this hotel on my first trip to NYC and i was very satisfied with my stay. the Di Vinci is a very clean hotel with a very nice staff (although when we had a question about the best way to travel around the city they didn't have an answer they did call and do some research for us, as i said they are very nice) the room we stayed in was pretty nice but kinda small. although this seemed like a problem at first, but once we realized we were going to spend only time sleeping in the room then it worked perfect. the location of the room was also great, you could walk to Central Park, Time Square and many other locations that were close by. one small problem with the room was with the hot water in the shower, some times it would take a long time for it to warm up, once it did get warm it would get nice and hot but it would just take in a little long. all in all the Di Vinci hotel it a wonderful little hotel at a great price, i would stay there again on my next trip to NYC.", "Date": "June 4, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Business service (e.g., internet access)": "3", "Check in / front desk": "4", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Fayetteville, AR", "Title": "“Great deal on basic accomadations- would stay again”", "Author": "Truvirgo3", "ReviewID": "UR16344338", "Content": "I have stayed at the Davinci Hotel twice.Each time it was a great experience. With such a great location, it really is a bargin-shh! Central to most anything. The first time I stayed there it was an adult trip we just needed a clean place to rest our heads- Who goes to NYC and just stays in their hotel?Therefore we did not want to pay extra for ammenities we would not be using. I was so pleased with the place for such a bargin price, that when I decided to return to NYC with my chidren (6&10) I stayed here again. The rooms were clean and the staff was helpful during both of my stays. Amazing, charming little hotel. Highly reccomeded.", "Date": "May 23, 2008"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Business service (e.g., internet access)": "3", "Check in / front desk": "1", "Overall": "1.0", "Value": "1", "Rooms": "1", "Location": "4"}, "AuthorLocation": "Los Angeles", "Title": "“Warning, Warning, Warning”", "Author": "mrgrub", "ReviewID": "UR15584427", "Content": "In 50 yrs of traveling worldwide, the DaVinci was our worst hotel experience. 1st room shown musty, tiny, no drawers for clothes, nonfunctioning AC, one narrow window looking out to brick wall & utilities. 2nd room much larger, decently renovated, good beds. But no hot water in bath, amazingly noisy facing street, centipede crawling on wall. 1st call to desk about water were told “if there’s hot water in sink, there’s hot water in shower.” Do this, do that, you’ll have hot water. We’d done it all & there was no hot water. No offer to send help. 2nd call, “H & C reversed. Move handle to C, you’ll have hot water.” Apparently thought I was lying about having done all that & no hot water. No offer to send help. Go to desk to talk to clerk personally. Says lack of hot water is not her fault. Maybe a prior guest moved the handle incorrectly. Still no offer to help. She insists there is hot water (if I weren’t so stupid) & draws a picture of how to turn the handle so C is actually H. Duh. Can you say, “Mr Guest, you’re a moron.”? STILL no offer to send help. Of course, all my efforts to receive hot water fail. Skip bath/shower to make dinner res. On way out, after much continued arguing, she says she’ll send someone to look at it while we are gone. Next a.m. try to shower &, lo & behold, STILL no hot water. After expressing outrage to a different desk person, she says she’ll send someone to help. Shortly, housekeepers arrive & after just a few minutes of yakking, huffing & puffing, we have hot water. Seems one of the two dials of the two-dial mixing system was frozen in place. (We had told the desk persons that we, including my 275-lb self, had tried to move the inner dial but couldn’t & feared pulling it out of the wall.) On the way out now unfortunately much later in the morning, we were confronted by both the desk women. The first gets in our faces, not to apologize for treating us like morons & for not providing customer service, but to express her anger at us – her customers – that we could possibly have thought she was treating us like morons. A heated & loud discussion ensued, with both the women telling us this: providing us with hot water was not their jobs & if we had a problem we should have talked to the manager (not present) or the owner (not known). OMG. Not even a hint of an apology from the hotel, nor any offering of an adjustment for two days without hot water. Amazing. Please, please … anyone who reads this. DO NOT EVEN THINK ABOUT STAYING AT THE DA VINCI HOTEL IN NEW YORK.", "Date": "May 2, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Memphis, Tennessee", "Title": "“Cozy and Romantic!”", "Author": "JBGMemphis", "ReviewID": "UR14961521", "Content": "The Da Vinci was just what we were hoping for from our first trip to New York! It has a warm, cozy, family-owned, New York-ish. atmosphere. It was romantic! The lobby is all marble and cherry wood. The winding stairway that lead up to our room is marble and cherry. I will say this: from what we could tell, the rooms that face 56th Street are much better than the rooms that do not. We were fortunate to get one that did (room 202): 3 large windows, 2 double beds, comfortable club chair, 2 desks, chest of drawers, refrigerator, safe, flat screen TV, roomy, new but old-fashioned bathroom sink, very clean, great shower, nice toilet, nice lighting. We received great service from Jenny, Jennifer, and Eva at the front desk. We loved the Joe G Italian Restaurant in the basement. New York was like an enchanted city to us, and so was the Da Vinci Hotel!", "Date": "April 11, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Business service (e.g., internet access)": "4", "Check in / front desk": "4", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Toronto Canada", "Title": "“Charming!”", "Author": "leslie73", "ReviewID": "UR14457614", "Content": "I have recently returned from a weekend stay at the DaVinci hotel in midtown Manhattan. It met every requirement and then some! The room was small which I fully expected but was still plenty of space for me and my friend to move around. We chose the room with one bed to save a little more money for shopping and the bed was spacious and comfortable. Having a fridge was a great bonus and allowed us to keep our leftovers after a fabulous and HUGE meal at Junior's. The bathroom was gorgeous and a minor plumbing problem was taken care of immediately. All the staff were friendly and helpful and if they didn't have the answer the free internet available in the cozy lobby certainly helps. Free coffee and pastries were a nice way to start the day. Did not get a chance to visit the restaurant downstairs but it looked charming. Basically for the price we paid (about $160 a night) we felt comfortable and were provided with everything we needed in a convenient location. If you are looking for a big room with a great view and lots of perks this is not the hotel for you. I hesitate in telling people about this hotel for fear of it becoming too popular and not having a room for me next time I want to visit NYC!", "Date": "March 23, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Alexandria", "Title": "“Great Hotel, Great Location”", "Author": "VAWineGal", "ReviewID": "UR14052876", "Content": "This is a fabulous little hotel. The service was absolutely outstanding during our recent visit on March2. The front desk staff made us feel right at home. The price was unbelievable for New York. My husband and I were given room 101 which is right behind the front desk. We were a little worried about hallway noise but we didn't experience a single bit of a problem. The room was small but spotless with a double bed, flat screen tv, small fridge and desk. The location is great. I can't imagine staying anywhere else in New York.", "Date": "March 4, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "3", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "London", "Title": "“Great little hotel!”", "Author": "IrishEyes4", "ReviewID": "UR13541996", "Content": "Great little hotel. Our double room was very spacious for NY. Great bathroom with powefull shower, flat screen TV & comfy bed! Amazing location just minutes from Central Park and a short walk to 5th Avenue/Times Square. Small communal area with free internet access and complimentary doughtnuts & coffee in the mornings. Highly recommended!!", "Date": "February 14, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "The Aloha Corral", "Title": "“Loved the location. Nice room for the $$”", "Author": "Texgirltravels", "ReviewID": "UR13388464", "Content": "This hotel is about a close to perfection as a budget hotel can get. Cute. Clean. Remodeled. New bathroom fixtures and new beds. European style lobby w/ free coffee and hard rolls for breakfast. Close to everything. I wouldn't honeymoon here or plan to make a spa-stay-in-the-room all day experience, but for anything else, this place is A-OK and definately much nicer than many other places I've stayed in NYC. Only drawback: Queen size only beds. No kings.", "Date": "February 8, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Check in / front desk": "3", "Overall": "4.0", "Value": "3", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Blue Ridge, Georgia", "Title": "“Great little place to stay.”", "Author": "dlbr", "ReviewID": "UR13340389", "Content": "We stayed at the DaVinci the week before Thanksgiving & we would certainly go back again. While small, our room was fine, the bathroom was clean, & the bed was comfortable. The DaVinci was located within walking distance to many NYC attractions, & subway. We stayed 3 nights & had no complaints whatsoever.", "Date": "February 6, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Business service (e.g., internet access)": "3", "Check in / front desk": "5", "Overall": "3.0", "Value": "4", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Frederick, Maryland", "Title": "“Great value for NYC!”", "Author": "sinarmatahari", "ReviewID": "UR13206468", "Content": "I was very pleasantly surprised by this hotel. I stayed for two nights, and during that time it hosted a mixture of business travelers and international tourists. There is not much space for sitting in the lobby, but it made the space very cozy and sociable. The hotel is located in a great area, but a subway trip or taxi ride for most of the major tourist spots. It is close to Hell's Kitchen, so great and interesting food choices nearby. The heating for the hotel is the old-style radiator, so a bit loud and unpredictable. There is a window-unit air conditioning unit, which I did not use, being January. When our radiator was not on, they sent someone up immediately to make sure it was working. They also brought and extra blanket for the second bed, and were very kind and pleasant.", "Date": "February 2, 2008"}, {"Ratings": {"Overall": "1.0"}, "AuthorLocation": "West Coast", "Title": "“Housekeepers steal!”", "Author": "lawj101", "ReviewID": "UR11705477", "Content": "Do not stay at this hotel!!! I had my ipod stolen by one of the housekeepers. My ipod was hidden in my suitcase which meant that the housekeeper(s) were searching through our stuff. We also had a Do Not Disturb sign on our door at all times. Management was awful and did not do anything. The beds are the most uncomfortable beds I have ever slept on. Avoid this hotel at all costs!!!", "Date": "December 20, 2007"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "Maryland", "Title": "“Enjoyed my stay!”", "Author": "cansecret", "ReviewID": "UR11298822", "Content": "This hotel was in a great spot. Lots of restaurants within less than a minute. Staff was friendly and helpful. Within walking distance to everything. Felt safe in th is location. The lobby was very nice and they let you drop off your bags there if you got there early and couldn't check in yet. Free internet access in the lobby and complimentary breakfast. Although the hotel hallways are a bit small, the room was fine. We had a room with 2 double beds and although it wasn't a huge room it was quaint. The bathroom was surprising...it was beautiful in my opinion with the marble. Some reviewers complained abou the noise of the pipes, and I did hear that a little. But I was so tired from the days' activities that it didn't phase me. I would surely go back to this establishment again. If you're on a budget, I would highly recommend the DaVinci hotel!", "Date": "December 7, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Texas", "Title": "“A great place to stay”", "Author": "CrystalAC", "ReviewID": "UR11139955", "Content": "This was an excellent place to stay in Manhattan. The owner, Joe G. was so friendly. The hotel was clean and the staff was friendly. It was a great value based on other hotels in the area. This will be our first choice when staying in NYC again.", "Date": "November 29, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Tampa, Fl", "Title": "“Great location!”", "Author": "sugerkat", "ReviewID": "UR10907662", "Content": "Full of charm and excellent staff! Location cannot be beat for the price. I stay away from chain hotels to insure I get a room with character. The DaVinci definitely has character. Had one VERY minor plumbing problem and it was handled within minutes. Room was very clean and was very warm considering it was in the 30's at night, during our visit. Joe G's is a great place to eat and again, great staff. I would stay here again in a heartbeat.", "Date": "November 18, 2007"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Check in / front desk": "4", "Overall": "4.0", "Value": "5", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Auckland Central, New Zealand", "Title": "“Nice Location for a good priced hotel”", "Author": "Jada_7", "ReviewID": "UR10041041", "Content": "We stayed at this hotel for 7 days. It is quite hard to find at first as its such a small place, its right near McDonalds and the Restaurant down stairs which i cant quite remember now. Our room was very small but its the cheapest you can find in NY practically. The bathroom was very nice but the shower wasnt the best and we kept getting lots of cold water in our showers, it would be hot one minute then freezing the next or take ages for the hot tap to come on. Our tv was not showing great reception so we advised the front desk who got the maintenance man to check it out while we were out so good service overall. Our rooms were cleaned everyday. The airconditioning was great but the view sadly wasnt, we were looking out into the back of some buildings but its good for noise control!!!. We didnt think much of the breakfast, no cereal just doughnuts and bread but we thought it seemed a weird breakfast to have at say 8am but maybe thats just me. There are about 20 rooms so its nice and small and we never had any problems hearing other ppl in their rooms. Overall great location for a great price, would recommend to others for sure.", "Date": "October 4, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "3", "Location": "5"}, "AuthorLocation": "ohio", "Title": "“great location”", "Author": "jeffcoan", "ReviewID": "UR8851469", "Content": "just returned from the big apple what a place ! the da vinci hotel is a great location only blocks from times square. the rooms were small but we only needed a place to sleep so it worked out very well . the price was very good, as were the staff very friendly.everyone said no hot water but ours was very hot on the 3rd floor. the place was very clean. boxed doughnuts and hard rolls and coffee or tea in the morning were good saved $$$$ on breakfast. we would stay again for sure !!", "Date": "September 22, 2007"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Business service (e.g., internet access)": "3", "Check in / front desk": "4", "Overall": "4.0", "Value": "5", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Montclair, New Jersey", "Title": "“Good hotel!”", "Author": "Eidel", "ReviewID": "UR8828011", "Content": "I've just come back from staying 2 nights at the Da Vinci with my boyfriend. It was the only place i could find for a decent price (which actually concerned me ) and based on the reviews I decided to try it out. My boyfriend, who was a first-timer to NYC, did not think it was such a great deal, but I myself have visited several hotels in the city, and I think it's a really good deal! The rooms are just big enough, and the bathroom was pretty spacious. There's a full length mirror which is rare in such hotels, and refrigerator which is nice to have. Don''t expect any marble in the bathroom, and we did have some cold water sometimes in the middle of the shower which was annoying, but really for this price..what can you expect?! Downside was window faced into a smelly alley, and we could not leave the window open. There was an A/C which could not be set to any temperature but the original FREEZING one. We complained about this and immediately they came to turn it down, later making our room too hot...luckily, the weather was good so it was ok for us. I thought it was nice they had at least responded to our requests. The staff was nice also, and breakfast was small but yummy. We did have to leave our stuff in the lobby, because they don't have a storage room, but it was fine and felt safe to me (very small hotel). The location is just EXCELLENT, between times square and central Park. I definitely recommend it as a great budget hotel!", "Date": "September 20, 2007"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Check in / front desk": "4", "Overall": "4.0", "Value": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Columbus, Ohio", "Title": "“A great place to stay, not a destination itself”", "Author": "jandy23", "ReviewID": "UR8509688", "Content": "My husband and I spent a week in NYC and stayed at the Davinci. We were very pleasantly surprised. The hotel was in a fantastic location, we were able to walk to so many sites; additionally, we were close to three subway stations so we could easily get just about anywhere and never had to switch trains! Our room was exactly what we needed-a comfortable, clean place to sleep, a safe place to keep our things, affordable and close to everything. The rooms are pretty small but the bathroom was huge and ornate-beautiful! One weird thing was that they cleaned our room in the afternoon which happened to be when we took our siesta so they missed us once. We just asked the desk and they had someone fix it later. The two ladies at the desk are very kind and hospitable. There is a fridge in the room which is an unusual luxury in a lower price hotel. The breakfast is pretty minimal-buns and doughnuts and warm milk (very European). We would definitely stay here again and recommend it to our friends who are looking for a place to stay that is not the destination itself.", "Date": "August 26, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "", "Title": "“The Best Deal in NYC”", "Author": "Galileo321", "ReviewID": "UR8251814", "Content": "The DaVinci Hotel is still NYC's best secret!. I love this hotel, its location and staff. There just isn't a better place to stay in the city. I recommend it to many people and they are most thankful. Wonderful place.", "Date": "July 29, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "4.0", "Value": "4", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Providence, RI", "Title": "“A great find in the heart of the city!”", "Author": "illyanadmc", "ReviewID": "UR8004985", "Content": "I was having a hard time finding a reasonable hotel for my party of six in NYC - getting a room that would accommodate all six of us was near-impossible, and the places I did find were either hostels or other shared-bathroom types; on the other hand, having to book two separate rooms was turning out to be very expensive! Then, I found the DaVinci Hotel! I thought it was too good to be true - a reasonably-priced hotel in Manhattan with good reviews - but the place was great! We were a bit wary before we arrived, but as soon as we met the friendly ladies in the lobby and saw our clean, cozy rooms, we were sold. The rooms are small but have everything you need in NYC (who wants to hang around the hotel, anyway?) - one of our rooms even had a flat-screen TV mounted on the wall. The rooms were cleaned every day (although a bit later in the day on Saturday), and the place was so quiet we could hardly tell we had neighbors in the rooms next to ours (although the loud AC might have helped drown out any noise). Some older reviews mention that the lobby staff ask for your room keys each time you leave the building, but that was not the case for us - we used electronic credit card-sized keys like any normal hotel, so perhaps this practice has been updated. All-in-all, this place is such a great find, and I will definitely be staying at the DaVinci Hotel during my next NYC trip!", "Date": "June 27, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "3", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "baltimore, md.", "Title": "“A Fabulous Place”", "Author": "mikec01", "ReviewID": "UR7940326", "Content": "My wife, son and I had the pleasure of staying at this wonderful oasis. Everything that we needed was there for us as well as genuine friendliness, supportive and knowledgable staff and an ambience of peace and relaxation. The Restaurant downstairs, quaint, relaxing, most efficient staff, wonderful food and again served up with a smile and the great feeling that they could not do enough for the diner. Thank you for this Diamond in what can be the \"rough\" of the world. Mike and Kacy Cross", "Date": "June 20, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "3.0", "Value": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Austin, Texas", "Title": "“My Da Vinci Stay”", "Author": "AustinTexas1961", "ReviewID": "UR7750675", "Content": "I stayed at the Da Vinci hotel from May 29th -- June 1, 2007. It looks a little scruffy on the outside, but once inside, it is a nice little place. As you enter the lobby, you have the stairs leading up to the floors. Also, you have a narrow hallway, with a glass door leading to the first level elevator. The doors are always open to the elevator, so you just go in. When I got to my 2nd floor room, I noticed the hallway was quite narrow. You use a plastic room card to access your room. I was surprised to have gotten two full size beds. There was just enough from from the door, outside in, to move my two main pieces of luggage. Inside was a clean and functional room with: two print pieces on the wall, an old desk with a fold down mirror, facing the main mirror, a television set with a two drawer cabinet and a larger one below that. There is a small closet, which had just enough capacity for my two medium sized luggage pieces. Inside the closet, was a top shelf with two blankets and one pillow. The beds had their own pillows. Luckily, I didn't have room facing street traffic. My frosted window faced the wall of the building next door, so you could hear bits of conversation downstairs and could definitely detect food smells nearby. There is a step down connecting the room to the bathroom, so watch out for that. The bathroom was lovely, with antique looking hot and cold water levers (?) by the sink. You did have a row of toiletries (those samples of shampoo and conditioner) on the glass shelf above the sink. The bathroom also has a combination tub / shower. The shower sliding door was located above the tub, sliding from left to right. It seemed functional enough. The only thing I didn't like was the AC unit. I was unable to use it, since the knobs didn't have their coverings and I forgot to pack my pliers to turn on the unit. I was disappointed in that, since during that week, the temps in the afternoon were in the high 80's and I was sweating a bit. Also, try to work the clock radio and adjust the alarm if you don't want to be awakened at a certain time in the morning. The staff at the Da Vinci were lovely. I had to borrow the iron and board from downstairs. Since those things have been used quite a bit, the dial info on the appliances have faded, so I recommend that you don't put water in the iron. You do get one of those small , not too long ironing boards, but I managed to press some of my clothes. You request the iron and board. It makes sense to return it as soon as you are done, so someone else can use them. Surroundings: You have a McDonalds next door and an Italian restaurant below the hotel itself. The 59th St. Columbus Circle subway is about 3 blocks away to the north, right by Central Park South. The 50th St. 8th Avenue stop is about 6 blocks to the south of the hotel. I recommend the Cosmic Diner on W. 52nd and 8th Avenue, located at the SE corner of that intersection. It's a 24 hour place. Suggestions: Keep an eagle eye ( a very close eye) on the traffic as you cross the lights. Cabs and other cars use the streets of Manhattan as a personal highway, so be warned. Also, even though the crosswalk light may be red, if the traffic is clear enough , people will cross. Pedestrian traffic is heavy, so you have to learn how to walk at a brisk pace... in other words... learn to walk fast. There is a continental breakfast that starts around 6:30 a.m. or 7:00 a.m. I made the mistake of having a donut and coffee before my Super Shuttle arrived a couple of hours later. Bad choice. I don't know if it was the donut or the milk carton (at room temperature and not sitting in ice) that caused problems iwth my head and tummy. I didn't experience that during my first trip and had eaten a full breakfast. It didn't help that the Super Shuttle was making stops here and there before it got to JFK. It could have been.. just me.. but I have my suspicions about that donut and the coffee. My stay at the Da Vinci was generally okay. I wouldn't recommend the donuts and coffee tho. I actually took a bunch of pics as I arrived in my room, on the first day. I hope you enjoy YOUR trip to the Big Apple.", "Date": "June 3, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "oklahoma city", "Title": "“A”", "Author": "servok", "ReviewID": "UR7209114", "Content": "We stayed from March 24-28, 2007, in two rooms. The furniture is dated but functional. Closet space is limited. The room near the elevator was quiet whereas the room facing 56th street was somewhat noisy. The maid service was excellent in one room and sporadic in the other during our stay. The check-in desk personnel were excellent. The Italian restaurant in the basement was fine. We will stay here again. Overall a very good experince.", "Date": "March 23, 2007"}, {"Ratings": {"Cleanliness": "5", "Check in / front desk": "4", "Overall": "4.0", "Rooms": "3", "Location": "5"}, "AuthorLocation": "connecticut", "Title": "“Route 66 without the cactus”", "Author": "mominthecity", "ReviewID": "UR6898240", "Content": "Like an old-time motel with dated snaggy bedspreads, lots of hot water and clangy radiators that hissed on in the am. The room was big by any standards and the bathroom was lemon-lestoil clean. Location handy around the corner from Carnegie Hall -- couple blocks from the Broadway local subway line. Walked home from the theatre at Times Square. Didn't bother with the supermarket donuts in the a.m. -- ate breakfast at Fluffy's Deli on 57th across the street from Carnegie Deli. Next visit I want to eat dinner at Patsy's two doors down. My 13-year old didn't understand the nostalgic value of an actual room key on a diamond-shaped tag.", "Date": "March 1, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "atlanta georgia", "Title": "“Loved this quaint hotel”", "Author": "pink731pink", "ReviewID": "UR6824528", "Content": "Loved everything about our stay here! Personal service from Jennifer upstairs and Walter downstairs was excellent. Just really enjoyed the overall experience of a small, quaint, clean, centrally located hotel. Will definitely book again.", "Date": "February 22, 2007"}, {"Ratings": {"Overall": "2.0"}, "AuthorLocation": "Melbourne", "Title": "“Disappointed.....”", "Author": "caileag", "ReviewID": "UR6714354", "Content": "After reading the many good reviews of this hotel, I booked a 5 night stay in late January. Whilst at the price and the great location I was not expecting the Waldorf, I was expecting a little more than what we got. The room was very very small and dark. There was a tiny window which would not open, this meant the room felt so depressing. In the first hour, we found that the bedside lamp was broken, the fridge didn't work and the TV reception was terrible even the basic cable. The TV and lamp were met with no assistance, the fridge we fixed ourselves. I noted that many people found the reception staff good. On weekdays she seemed pleasant enough, not overly friendly but not rude. The weekend staff were terrible. We asked where the nearest laundromat was, only to be told \"I don't know\". Therefore we searched along 8th Avenue for a internet cafe to look one up. Shame the girl on the desk didn't feel able to do this for us. The cleaning staff were nice, but 2 days out of 5 it wasn't done as we were in the room at 4pm (jetlag). Many reviews are correct in that it was relatively clean and cheap for Manhattan. I would recommend spending another $50 a night and staying somewhere where you can move, that has daylight, and helpful staff!", "Date": "January 29, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Business service (e.g., internet access)": "4", "Check in / front desk": "4", "Overall": "5.0", "Value": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "PR", "Title": "“Excellent location and service”", "Author": "Lelis", "ReviewID": "UR6551060", "Content": "The hotel is excellent for the price, it was a modest room, but was clean and the service was excellent. The location was wonderful to go anywhere in Manhattan. Can't wait to go there again!", "Date": "January 4, 2007"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Business service (e.g., internet access)": "1", "Check in / front desk": "1", "Overall": "1.0", "Value": "1", "Rooms": "1", "Location": "3"}, "AuthorLocation": "scotland/tenerife", "Title": "“MIce in the bed”", "Author": "juanjo", "ReviewID": "UR6501748", "Content": "Weekend reception very surly and unhelpful. We stayed for a week in room 501 after a couple of days we found mice running around room ! On inspection we found evidence of nest under base of bed . (See photos)We managed to trap 3 mice but management couldn't give us change of room due to marathon and everything else was booked in area - eventually got a chenge of room . Little sympathy from management and deaf ears on compensation. If that's what's in bedroom , what's running around restaurant in basement? Not recommended!!", "Date": "December 26, 2006"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5.0", "Rooms": "4", "Location": "5"}, "AuthorLocation": "London", "Title": "“Great Hotel”", "Author": "PrincessPhoebe", "ReviewID": "UR6334168", "Content": "Just returned from a 2 night stay in this hotel. I have to say for the price, I really think this was a great hotel. It's certainly not the Hilton but if you are going to NYC for 2 nights to shop why would you want to pay so much money for a hotel which you are never in. I really think this was great for the money we paid. We stayed in a one bed room on the first floor. The bedding was clean and nice. The bathroom was marble and very clean. The shower was quite powerful and the bath was clean. I think if you are looking for a cheap hotel, then as long as it's clean then you cant go wrong. The lady on reception was always very polite and helpful. She helped lot's with booking my return travel and also find the bus times for woodbury outlet centre. Which I have to add is a really good place to go. It's about an hour outside the City by Bus and the return ticket is about $38.00. It's well worth the visit, there are such great bargains. I would actually recommend visiting here before you hit the other shops in the City because I did see the same watch I bought from the outlets in a Macy's and it was the full price, so it's not even like they are selling old stock. If you also go to the information centre when you get there, you can pick a discount book for most of the stores. Sorry going off track abit here. Anyway the hotel is also in a really good location, a few blocks from time square and also a short walk to 5th Ave. Overall I had a really enjoyable stay here and wold def stay again.", "Date": "December 5, 2006"}, {"Ratings": {"Overall": "3.0"}, "AuthorLocation": "Detroit", "Title": "“Good experience”", "Author": "Motown_traveller", "ReviewID": "UR6028405", "Content": "As one of the many always looking for cheap stays in Manhattan, I was hesitant when reading people's poor reviews. I had a very good stay there. I had booked a 2 bed room, but my 2nd person couldn't come, so the girl at the desk was very helpful in getting me a single room & lower price. I don't need a lot of help w/ NYC, so I don't rely on the hotel staff helping me with things to do. The room was nice...nothing elaborate although the bathroom had recently been updated. I was on the 1st floor & 1st room from the front desk & door, so I could hear noise, but it wasn't very intrusive & never woke me up. I would stay there again. It's a hard place to find, but location is great & subways very close.", "Date": "October 30, 2006"}, {"Ratings": {"Service": "3", "Cleanliness": "2", "Business service (e.g., internet access)": "2", "Check in / front desk": "2", "Overall": "2.0", "Value": "2", "Rooms": "2", "Location": "4"}, "AuthorLocation": "TX", "Title": "“Cleanliness an issue -- but good location”", "Author": "goalie472", "ReviewID": "UR5909065", "Content": "Hotel visit just OK, but the price was good. The bathroom is the biggest complaint. The bathtub DID NOT drain -- and was not real clean. Mildew all over the grout. Towels threadbare. I guess it was adequate. Would stay here again if I had no other choices -- but it's definitley not at the top of my list. I should have learned my lesson by now -- you can't trust websites!! This hotel is not as nice as the website would lead you to believe.", "Date": "October 4, 2006"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Business service (e.g., internet access)": "3", "Check in / front desk": "4", "Overall": "4.0", "Value": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "naples, fl", "Title": "“Perfect place for a budget traveler”", "Author": "souschef51", "ReviewID": "UR5818367", "Content": "At less than 1/2 the price of other hotels less than a block away, the Da Vinci was a pleasant surprise. Although definitly a budget hotel, you don't have to be scared booking here. The rooms were simple, but adaquate and clean. The bathroom, again was simple but had hot water and good pressure. The linens look like the ones from your closet, but they work fine. The rooms TV and A/C worked fine. The wireless connection was iffy, but the McDonalds next door had a good signal you can buy for about $1.50/hour. The lobby was comfortable and the attached restaurant was nice. (Gino, the manager was very friendly and hospitable) The hotel is right in midtown, 3 blocks from central park and one block from broadway. The neighboorhood is safe and active, probably 15 restaurants inside of 2 blocks. This is a perfect place to stay if you plan to spend most of your day exploring the city. Staff was friendly and always available. I'll stay here again.", "Date": "September 20, 2006"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Check in / front desk": "4", "Overall": "4.0", "Value": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "N.F. ON", "Title": "“A Great budget hotel!”", "Author": "Lifeisatrip", "ReviewID": "UR5772240", "Content": "Want a great little place in a 'can't be beat' location? This is it for you! I was so impressed by the friendly and helpful staff, the cleanliness of the whole place and the quaint lobby that I would definitely return in a heartbeat! Rooms are extremely small, but hey, in NYC, you are not going to spend time in your room; at the end of the day you are lucky to crash from exhaustion. Bathrooms all completely redone in marble, lobby staff helpful and sweet -- and a continental breakfast each morning. Walking distance to everything, Central Park, Times Square, Hell's Kitchen, Broadway, etc. Definitely would go back without a second thought.", "Date": "September 5, 2006"}, {"Ratings": {"Cleanliness": "4", "Overall": "4.0", "Value": "5", "Service": "3", "Rooms": "3"}, "AuthorLocation": "Toronto, Ontario", "Title": "“This is an excellent hotel for the price.”", "Author": "Sophie-Steve", "ReviewID": "UR5407715", "Content": "We stayed for four nights in June and found the hotel very nice for the price. Staff is always on duty and they ask that you leave your key at the front desk when you go out but we never did. You can walk to central park, times square subway nearby, we will stay here again for sure.", "Date": "June 29, 2006"}, {"Ratings": {"Cleanliness": "5", "Overall": "5.0", "Value": "5", "Service": "5", "Rooms": "4"}, "AuthorLocation": "Hamilton, Ontario", "Title": "“great spot, great price, great place”", "Author": "A TripAdvisor Member", "ReviewID": "UR5008583", "Content": "I stayed there just last weekend and it was great. The city poured rain for two days straight so we spent alot of time in the hotel. It was a great hotel, the price was the best you can find. The rooms were very clean, and the bathroom was very nice with a large tub and marble floors and walls. It was very quiet and the front door staff were very friendly and helpful. The location couldn't get any better with a 10 minute walk to time square and a 5 minute walk to central park. Subway stops are located within a five minute walk. I would absolutely recommend this hotel to anyone staying in NYC. If I ever go back I will definately stay here.", "Date": "April 25, 2006"}, {"Ratings": {"Cleanliness": "4", "Overall": "4.0", "Value": "4", "Service": "3", "Rooms": "3"}, "AuthorLocation": "Cheshire, UK", "Title": "“A Great Base for Exploring”", "Author": "socksandsandals", "ReviewID": "UR4993352", "Content": "We stayed at the Da Vinci from 12-15 April. We found it to be small but clean, close to the subway and within walking distance of Times Square, what more could you ask for? The Continental breakfast was filling. There was a choice of bread rolls, preserves, doughnuts and tea/coffee. The staff were freindly and there are loads of information leaflets in the foyer to help you plan your holiday. We booked through Travelocity, which gave us the best price out of all the web sites we got quotes from. The hotel is easy to get to from Newark. We got the Olympia Express Shuttle from the ariport ($22 return to Port Authority) and a taxi from Port authority which cost about $5. This is about half the price you would pay in a taxi. The area around the hotel is fairly lively, there are restuarants and shops close by and we felt safe walking around there at night time. We also used the subway at night and felt very safe doing so. A tip for seeing broadway shows: don't go to the TKTS booth in Times Square, go to the one at the South Sea Terminal. The one in Times Square always has a massive queue, but we managed to walk straight into the other one with no queue at all. They both share the same booking system, so you won't lose out on any good deals. If you want a base to explore New York, I would definitely reccomend the Da Vinci.", "Date": "April 21, 2006"}, {"Ratings": {"Cleanliness": "4", "Overall": "4.0", "Value": "4", "Service": "5", "Rooms": "3"}, "AuthorLocation": "Oklahoma", "Title": "“Great Little Hotel”", "Author": "A TripAdvisor Member", "ReviewID": "UR4370218", "Content": "My family and I just went to New York on the 15th through the 19th and we loved it. For being a small hotel, the Da Vinci was very surprising. The Staff was very polite and courteous during our visit. They helped us with whatever we needed. The room itself was not bad at all. There was four of us that shared a two bed room, and there was plenty of room. The bathrooms are very nice and the water stayed nice and hot for each shower. The overall appearance of the hotel is very nice also. Another thing worth noting is that it is in a key location, right next to Broadway. Our stay at the Da Vinci was very pleasing, and we would definitely stay there again.", "Date": "January 22, 2006"}, {"Ratings": {"Cleanliness": "3", "Overall": "3.0", "Value": "4", "Service": "2", "Rooms": "3"}, "AuthorLocation": "Rimini, Italy", "Title": "“Great location and not too bad!!”", "Author": "Ale_Rn", "ReviewID": "UR4331093", "Content": "Just back from New York where I spent the New Year Eve with my boyfriend and a couple of friends. The location is simply great, on the Broadway, just few steps away from Central Park and Times Square. As we arrived the room was very clean, but I think the housekeeper \"forgot\" to clean the bathroom the days after....We don't have problems with shower, hot water and heat, but the bed is definitely too small for two people. They serve breakfast in the reception lounge (what a laugh!!). The staff is not so unfriendly, they simply seem not to live in New York because they aren't informed about anything!!! The only thing they do for us is provide a car service for the airport the day we left. Anyway, we don't spend too much time in the hotel, there are so many things to see in New York! I also think that I would stay there again, the location and the price are great and is definitely decent enough to spend a holiday.", "Date": "January 8, 2006"}, {"Ratings": {"Overall": "2.0"}, "AuthorLocation": "Hamilton, ON", "Title": "“Not Great But You Get What You Pay For”", "Author": "A TripAdvisor Member", "ReviewID": "UR4221157", "Content": "Not a great hotel but you have to accept it for being so much cheaper than the rest. pros: 1) nice lobby 2) cheaper 3) near subway 4) location cons: 1) no secure luggage storage. 2) noise from the street and floor above. hint, turn on the fan to drown it out with a constant buzz 3) not enough electrical outlets. 4) no counter or cabinet in the bathroom 5) envelope on the nightstand looking for tips from housekeeping (I've never seen this before) 6) my request for two double beds was accepted but not filled. bed was slightly smaller than a queen. 7) too much furniture for such a small room. 8) free high speed internet didn't work 9) 4pm check-in and 11am check-out 10) inconsistent water pressure/temperature But after all the rough edges I'd still go back.", "Date": "December 8, 2005"}], "HotelInfo": {"Name": "Da Vinci Hotel", "HotelURL": "/ShowUserReviews-g60763-d99365-Reviews-Da_Vinci_Hotel-New_York_City_New_York.html", "Price": "$160 - $253*", "Address": "<address class=\"addressReset\"> <span rel=\"v:address\"> <span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">244 West 56th Street</span>, <span class=\"locality\"><span property=\"v:locality\">New York City</span>, <span property=\"v:region\">NY</span> <span property=\"v:postal-code\">10019</span></span> </span> </span> </address>", "HotelID": "2514359", "ImgURL": "http://media-cdn.tripadvisor.com/media/ProviderThumbnails/dirs/d3/d5/d3d59914baa0b82ac25a59cb73ec74891large.jpg"}}