{"Reviews": [{"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "3", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Ashburn, Virginia", "Title": "“Great Location, Excellent Staff!”", "Author": "Homebodytwo", "ReviewID": "UR127559062", "Content": "The Plaza Tour Eiffel is an excellent base for exploring Paris. This small, modern gem of a hotel is located in the Trocadero neighborhood, which relatives who live in Paris confirmed is indeed quite affluent. The area has several nearby brasseries/bistros, as well as a good selection of fine dining establishments.The metro is 5 minutes away, and the Eiffel Tower is about a 15 minute walk. Sightseeing buses also have stops about 5 minutes away, but we found tourist destinations such as the Hotel des Invalides and the Musee de Rodin are only about a 30 minute walk from the hotel! To top it off, the hotel staff was exceptionally friendly and helpful throughout our stay.", "Date": "April 9, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "3", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Ohio USA", "Title": "“Home Sweet Home”", "Author": "MarysaCzarna", "ReviewID": "UR127527367", "Content": "This Hotel is in a residential area of Paris and yet it is within walking distance of the Eiffel Tower and other attractions. The Metro is close by if you want to venture out further. There are wonderful restaurants and the entrance to the Metro across from the Eiffel Tower and several Museums and it is only about 5-10 minute walk. There is also a wonderful little turn around called the Place de Mexico where there is a Mexican restaurant and one of the best Italian restaurants both with a fantastic view of the Eiffel Tower. The other thing we found at this turn around was a fantastic supermarket. On the days we just wanted to stay in for dinner and have a lazy evening we would just buy some bread, cheese and olives etc and bring to our room. The bakery next door had wonderful pastries and a Sushi Bar was across the street from the hotel. The room and bathroom were very modern and very clean. Breakfast every morning was a delight, and there was a fitness room. The stars of the Hotel were the staff. The staff made us feel like we were welcomed home every night when we would return from our daily adventures. When we discovered a big problem with one of our scheduled trips the manager of the hotel took it upon himself to help us out when our tour agent bailed out on us. Kiran Rangoo and his staff were not only pleasant but very courteous and helpful. They attended to all our needs promptly and always with a smile. We hated to leave them but we were off for more adventures in another part of town. We would stay there again when in Paris. We would also recommend the hotel to others. Do ask for a room overlooking the street and not the cafe, it will be less noisy.", "Date": "April 9, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "UK", "Title": "“A very good stay at Plaza Tour Eiffel Hotel”", "Author": "ljn_uk", "ReviewID": "UR127035961", "Content": "Location: As previous reviewers have mentioned it's a short walk to Trocadero metro (less than 5 mins), and not much further to the Eiffel Tower. The area around the hotel has some nice cafes and restaurants. The areas around the hotel appears to be reasonably upscale. Hotel: Arrived early afternoon & were warmly welcomed by a very professional young man on the front desk. The front desk staff were always very professional and polite and spoke excellent english. Room: Room was light & bright but compact (but we expected the room to be small) - our room faced the street but was very quiet at night. Double bed, good quality pillows & linens. Small wardrobe with hangers & shelves - good if you are staying for a few days. In room safe Full length mirror Chair & desk The windows fully open so you can let the fresh air in - this was a great feature. Flatscreen TV Free wifi (reception will give you the code) Bathroom was tiny but modern - style over substance, very difficult to store washbag etc Toiletries - good quality Breakfast: Our rate included breakfast (continental) and the food on offer was surprisingly good. Excellent coffee Super breads & pastries Cheese, meats, fruit, yogherts etc I would certainly return to this hotel", "Date": "March 31, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "england", "Title": "“splendid from start to finish”", "Author": "thomas01hahhah", "ReviewID": "UR126853823", "Content": "Many thanks to hotel staff for contributing to a good break. Our visit was for a special occassion, made more special by the stay at the Plaza. arrived at 11.30 and pleasently surprised that our room was ready. Even better was being upgraded to the sixth floor with a room were from the balcony you could see the Eiffel Tower. welcomed by a pleasent young man on reception, did not catch his name and Daniel, cheery courteous and helpful. Room bright, comfortable, clean, bathroom modern, with a massive queen sized bed. Breakfast was a good starter for the day. Location excellent, 5 mins walk to Eiffel tower, restaurants close by. Did all the sights using the Batobus, hop on hop off on the seine. good value at 15 Euros per day, with no restrictions. The sunday market at the bastille well worth a visit, not your traditional english market full of tat. Fresh food, meat, veg , fish looked very appetising. Slightly disappointed at quality of restaurants, and beware, on a sunday, several closed, together with lot of shops. Travel tip, long queues in c de G airport for tickets. used ticket machine, 9 euros, left train at chatlet les halles and took a taxi, 10 euros. saved a lot of hassle.", "Date": "March 28, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "London, United Kingdom", "Title": "“Lovely place, perhaps better for pleasure than business”", "Author": "Robsmodern", "ReviewID": "UR126577361", "Content": "This is a fine hotel in a safe and upmarket area of Paris. It's a short walk to Trocadero metro, and not much further to the Eiffel Tower. The immediate area has some nice cafes and restaurants. And the area didn't feel very touristy, as this may be one of the few - if the only - hotel in the immediate area. The hotel itself was great too. Excellent and friendly service at the desk, and very comfortable rooms (though be prepared for small rooms - this is Paris after all). Super bed, fantastic shower, and little to no noise from the street or corridor. Plus, if your rate includes breakfast, you can have it delivered to your room. This is a nice touch that isn't always offered. The only downside is that wifi reception in the rooms isn't great, so if you have business to do then you'll most likely have to relocate to the (comfortable) lobby. Not a big problem though.", "Date": "March 24, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Reading, United Kingdom", "Title": "“Lovely hotel, great location”", "Author": "KFisher66", "ReviewID": "UR126094650", "Content": "We've just go back from a weekend break staying at the Plaza Tour Eiffel. We had a beautiful room on the sixth floor with a view of the Eiffel Tower from our balcony - fantastic! The beds are very comfortable, rooms nicely furnished and bathrooms well appointed. We had a deluxe room, so plenty of room for our suitcases etc. We only had one disappointment on our last morning - we had requested a late check out due to our flight - and luckily our room was available for an extra hour (until 13.00). We received a phone call at 11.57 on our last morning demanding that we checked out immediately (check out is usually at 12.00). My partner explained that we had had confirmation that we were able to depart an hour later, but the member of staff argued that this was not the case and was quite rude in his manner. We explained that we weren't packed or showered, but were given 15 minutes to check out. Thankfully we were provided with another room to quickly pack our things. Unfortunately we were very disappointed with the way this was dealt with - we completely understand that people make mistakes, especially in this case as the girl who gave us a late check out is new, however we were not given an apology by Reception staff, and one man was shooting us particularly nasty glares whilst we explained that we were simply not aware we had to be ready by 12.00 - letting us know that we had to leave immediately at 11.57 was a bit much! After we returned from packing in the other room, the Manager was on duty and did apologise nicely on behalf of the new member of staff - however we did not have an issue with the error - just the attitude of staff when dealing with it. Such a pity that this happened as we left Paris with a sour taste in our mouths (and slightly upset by the experience) - it really is a lovely hotel and the location is fantastic - lovely bistros nearby, a big supermarket, and of course, the Eiffel Tower so close!", "Date": "March 14, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Location": "5", "Rooms": "4"}, "AuthorLocation": "", "Title": "“Ideal for business stay, great location and good but discrete staff. Tiny room, bed and bath”", "Author": "LadyCate", "ReviewID": "UR125864772", "Content": "I stayed on my own for two nights for work. This was a smart hotel and much nicer than usual chain corporate hotels. Elegant and great decor. Staff very helpful. Lovely breakfast with excellent coffee and pastries. The room 102 was small and I hope the bed would not be classed as a double. Also small bath but immaculate White tiled bathroom. Perfect on my own.", "Date": "March 9, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "London, United Kingdom", "Title": "“Quality hotel in a good area”", "Author": "Richard R", "ReviewID": "UR125752953", "Content": "The Plaza Tour Eiffel hotel is a well-maintained hotel in the Trocadero area of Paris a few minutes walk from the Eiffel Tower. Rooms are a little small but perfectly fine for a short trip. Bathroom perfectly clean and a good shower. Bed really comfortable. Staff were helpful and had good English. Overall no complaints at all - recommended.", "Date": "March 7, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "3", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Cambridge, United Kingdom", "Title": "“A little gem”", "Author": "21bailey", "ReviewID": "UR125294410", "Content": "We recommend this hotel. We have found that, in Paris in particular, the facilities are often overstated and sometimes false. This is not the case with Tour Eiffel, it is a quality hotel ideally located. The staff are friendly and helpful, the rooms are very clean and well appointed and the breakfast was good and fresh. One tip. If you want a taxi, walk to the end of the road to the taxi rank its cheaper. Would not hesitate to go again thebaileys", "Date": "February 27, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Darlington, United Kingdom", "Title": "“Nice Hotel close to Eiffel Tower”", "Author": "Andrew H", "ReviewID": "UR124652409", "Content": "Just got back from our first trip to Paris. This Hotel was lovely, not too big but very friendly and modern. Rooms were not massive but very clean and warm, nice to come back too after a cold winter walk. Staff were all friendly and helpful, food was nice, hot buffet with eggs and bacon, not just bread rolls and stuff. Tea and Coffee great. Beverages in the room would have been nice, what I would have expected from 4* but no other complaints. Would go back again.", "Date": "February 16, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Maryland", "Title": "“A wonderful, wonderful little place”", "Author": "Fitzgig", "ReviewID": "UR124279934", "Content": "‎ We had a recent business trip to Paris and (as always) wanted to avoid the \"corporate\" hotels. We went on Trip Advisor and found this place. What a wonderful find. We highly recommend this hotel, will return to it the next time we are in Paris, and will be telling all of our friends about it. Yes, the rooms are small, but that is normal for Europe. If you are not a frequent visitor to Paris or other big European cities, then you might be surprized at the size of the rooms - but chalk that up to inexperience. In our first room, the lights around the mirror blew, so they moved us to the 6th floor (room 604). That room was more spacious (but still small by US standards), but it had a couch, a desk and two balconies. Unfortunately it was not until our last evening that we stepped out onto the balcony and VOILA! there was the Eiffel Tower. I was wondering why all the other reviews said you could see the tower from the 6th floor. If you end up on the 6th - step outside, even if you don't like heights. You will be glad you did! The place is absolutely spotless. They have really nice towels, big and thick. The towel warmer is really nice - I have decided that I am going to get one for my bathroom at home. I will agree with other reviewers that the bathtub/shower needs a curtain or someting. The classic European style with the tiny glass water deflector does not work. We flooded the bathroom every day no matter how we positioned the shower head. It is a little tricky stepping out over the very high tub wall ontto the bathroom floor after a shower - especially when it was sopping wet. I always felt guilty having to throw 2-3 towels on the floor to soak up the water. I tried! The water temperature is a little flukey - don't run the sink or flush the toliet when someone is in the shower. The breakfast was really great. We were there for 5 days and never once did we have any issue with running out of food or anything like that. Plenty of room to sit, lovely wait staff, great coffee and the croissants............ to die for. Nice fresh fruit as well as chopped fruit. We got a free breakfast coupon off of TripAdvisor, which was great. They have free WiFi. It slows down under load (like in the evening when many people are in the hotel using it), but it was reliable and FREE. The only suggestion I have there for improvement would be to not require that you re- login everytime. It might not have been such a nuisance - but they issue you two long abstract codes that you then have to enter in each time. This is a minor thing, but after losing the little paper they give you with the two codes on it - I finally typed it into a word document and then just cut and pasted when I had to. Minor nuisance only - not a big deal! Nice gym. The rooms were very quiet (and we slept in two different ones). The neighborhood is very toney, we never felt unsafe. Oddly, a lot of the wealthy back in the neighborhoods (not outside the hotel - I mean 2-3 blocks away) have dogs and they poop all over the sidewalks and no one picks it up. I was surprized - just watch where you walk once you get away from the hotel. Outside the hotel is as neat as a pin. The location was great. There was a great taxi stand down at the Trocadero (2 short blocks), as well as the Metro that will take you all over Paris very inexpensively. About 2 blocks the other way is the Plaza de Mexico. There is a big grocery store down that way called Casino. It is on the left, across the Plaza (thrid spoke/road to your right), it is sort of inside of a small indoor shopping mall. The grocery store is HUGE - sort of like a Super Target or SuperWalmart - food, rope, socks, books, etc. Great place to buy foodstuffs if you dont want to have to go to restaurants all the time. There is a TERRIFIC little restuarant down off of the Plaza de Mexico called Skabetti's. It is an Italian joint that has really good prices for the area. If you are looking for low key comfort food - go there. Great ambiance as well. Right across from the Casino market. Also, take the recommendations for where to eat from the hotel staff. I would not take their recommendation for lunch at the Le Coq thought. It was very expensive and not good value. It was crowded and we felt out of place there. We chanced into the Passy Cemetary which is 2 blocks from the hotel. That was fascinating. Reminded us of the Recoletta in Buenos Aires (only no cats). The closest I will ever get to Claude DeBussey! Finally, everyone at the hotel was so nice and so helpful. There was a woman on the weekend who was incredibly sweet. I do not know her name, but she was from Madagascar. The guys at the desk were very wonderful and helpful. A really great experience there. We will be back. This is really a great place to stay. Room Tip: All seemed good that I saw. 6th floor - rooms are bigger, more expensive I suspect (we got upgraded) and you will be able to see the Tower", "Date": "February 7, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Maryland", "Title": "“A wonderful, wonderful little place”", "Author": "Fitzgig", "ReviewID": "UR124171265", "Content": "We had a recent business trip to Paris and (as always) wanted to avoid the \"corporate\" hotels. We went on Trip Advisor and found this place. What a wonderful find. We highly recommend this hotel, will return to it the next time we are in Paris, and will be telling all of our friends about it. Yes, the rooms are small, but that is normal for Europe. If you are not a frequent visitor to Paris or other big European cities, then you might be surprized at the size of the rooms - but chalk that up to inexperience. In our first room, the lights around the mirror blew, so they moved us to the 6th floor (room 604). That room was more spacious (but still small by US standards), but it had a couch, a desk and two balconies. Unfortunately it was not until our last evening that we stepped out onto the balcony and VOILA! there was the Eiffel Tower. I was wondering why all the other reviews said you could see the tower from the 6th floor. If you end up on the 6th - step outside, even if you don't like heights. You will be glad you did! The place is absolutely spotless. They have really nice towels, big and thick. The towel warmer is really nice - I have decided that I am going to get one for my bathroom at home. I will agree with other reviewers that the bathtub/shower needs a curtain or someting. The classic European style with the tiny glass water deflector does not work. We flooded the bathroom every day no matter how we positioned the shower head. It is a little tricky stepping out over the very high tub wall ontto the bathroom floor after a shower - especially when it was sopping wet. I always felt guilty having to throw 2-3 towels on the floor to soak up the water. I tried! The water temperature is a little flukey - don't run the sink or flush the toliet when someone is in the shower. The breakfast was really great. We were there for 5 days and never once did we have any issue with running out of food or anything like that. Plenty of room to sit, lovely wait staff, great coffee and the croissants............ to die for. Nice fresh fruit as well as chopped fruit. We got a free breakfast coupon off of TripAdvisor, which was great. They have free WiFi. It slows down under load (like in the evening when many people are in the hotel using it), but it was reliable and FREE. The only suggestion I have there for improvement would be to not require that you re- login everytime. It might not have been such a nuisance - but they issue you two long abstract codes that you then have to enter in each time. This is a minor thing, but after losing the little paper they give you with the two codes on it - I finally typed it into a word document and then just cut and pasted when I had to. Minor nuisance only - not a big deal! Nice gym. The rooms were very quiet (and we slept in two different ones). The neighborhood is very toney, we never felt unsafe. Oddly, a lot of the wealthy back in the neighborhoods (not outside the hotel - I mean 2-3 blocks away) have dogs and they poop all over the sidewalks and no one picks it up. I was surprized - just watch where you walk once you get away from the hotel. Outside the hotel is as neat as a pin. The location was great. There was a great taxi stand down at the Trocadero (2 short blocks), as well as the Metro that will take you all over Paris very inexpensively. About 2 blocks the other way is the Plaza de Mexico. There is a big grocery store down that way called Casino. It is on the left, across the Plaza (thrid spoke/road to your right), it is sort of inside of a small indoor shopping mall. The grocery store is HUGE - sort of like a Super Target or SuperWalmart - food, rope, socks, books, etc. Great place to buy foodstuffs if you dont want to have to go to restaurants all the time. There is a TERRIFIC little restuarant down off of the Plaza de Mexico called Skabetti's. It is an Italian joint that has really good prices for the area. If you are looking for low key comfort food - go there. Great ambiance as well. Right across from the Casino market. Also, take the recommendations for where to eat from the hotel staff. I would not take their recommendation for lunch at the Le Coq thought. It was very expensive and not good value. It was crowded and we felt out of place there. We chanced into the Passy Cemetary which is 2 blocks from the hotel. That was fascinating. Reminded us of the Recoletta in Buenos Aires (only no cats). The closest I will ever get to Claude DeBussey! Finally, everyone at the hotel was so nice and so helpful. There was a woman on the weekend who was incredibly sweet. I do not know her name, but she was from Madagascar. The guys at the desk were very wonderful and helpful. A really great experience there. We will be back. This is really a great place to stay.", "Date": "February 5, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "London", "Title": "“Small, welcoming boutique hotel”", "Author": "Bob.PLondon", "ReviewID": "UR124168401", "Content": "The rooms are not the largest i've stayed in but not bad, clean, modern and with all you needed for a short break. On our arrival the staff were extremely accommodating and kind. They spoke English but appreciated our attempts at French. The breakfast was nice and fresh but the hot food was not what were were used to. Didnt detract from the fact it was a nice start to the day. The bathroom was smart and modern and had a great shower. Flat screen TV with 2 English news channels, room safe, complimentary bottle of water (1 in three days). There is no bar or restaurant but the reception will pour you a drink for room service. There are some great cafe's nearby (Cafe Mexico just up the road was so friendly pro English and well priced) Situated 5 mins from the Trocadero Metro and in sight of the Eiffel Tower I would stay here again.", "Date": "February 5, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Chicago", "Title": "“Great hotel for work or pleasure”", "Author": "JumpRiver", "ReviewID": "UR123670039", "Content": "I have stayed at this upscale boutique-type hotel on three separate occasions, all for work. The location is excellent and there is a small bar in the lobby. There are plenty of places to eat nearby and they do offer breakfast. The rooms are nice and the beds are comfy. I've never had an issue with noise. They have wireless internet but as with many hotels, it can be very slow.", "Date": "January 26, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Surfers Paradise, Australia", "Title": "“Small but clean, great location”", "Author": "traveladdict1283", "ReviewID": "UR122599173", "Content": "We stayed here for 3 days over Christmas 2011. The hotel staff were friendly and helpful. The room was small-ish but on par for Paris expectations certainly. The area felt very safe, and was a quick walk from the Trocadero metro station. For us, this was always going to be a hotel that we were not planning to be in very much- too much to do! Just within a block or 2 walk in almost any directions are shops, cafes, and restaurants (not to mention the Eiffel tower!). We chose the hotel as we wanted to be close to a great view of the tower, which the Trocadero area absolutely provides, we were astounded. It was easy to walk from the hotel up to the Champs Elysee and also over to the Trocadero, and the Eiffel Tower, so very central for what we were wanting. Wifi in the lobby- free business centre (ie computer and printer), very handy for printing passports etc. We did not have breakfast so can't comment on that. We would definitely stay here again.", "Date": "January 5, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "", "Title": "“Paris's gem.”", "Author": "Merigee", "ReviewID": "UR122116762", "Content": "A truly magical Christmas in Paris made possible by the Plaza Tour Eiffel Hotel. Mr Kiran Rangoo very kindly upgraded our room to the 6th floor, thereby, affording us a beautiful view of the majestic Eiffel Tower. The Hotel is perfect in every way, shape and form. The rooms, bathrooms, linen, breakfast are first class. The staff are truly unique amd a credit to this fine establishment. Thank you for everything and much, much more.", "Date": "December 26, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Jeddah, Saudi Arabia", "Title": "“Charming hotel”", "Author": "2europe", "ReviewID": "UR121924891", "Content": "Stayed there for 7 days in Aug 2010. Very nice and clean hotel with very friendly and helpful staff. They provide good quality soap, flip flops and bath robes. There is even a dryer in the bathroom to dry towels and keep them warm. The only complaint was the cleaning lady would slam the door of the room next to us and wake us up. I do recommend this hotel to others. And the staff are fluent in English.", "Date": "December 20, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "San Diego, California", "Title": "“Fantastic Stay in France”", "Author": "chrislema", "ReviewID": "UR121488294", "Content": "The Plaza Tour Eiffel is a block from the Trocadero metro station in district 16. The first thing to note is that district 16 is upscale and safe, so walking to and from the metro at midnight is no issue (and you'll pass two embassies). The second thing to note is that you're close to two sets of great local restaurants - in Mexico circle and Trocadero circle. So there's no need to travel more than a block for great meals. The bakery next door is incredible as well. Make sure to stop by at 6:30 am as the bread is coming out of the ovens. The third is that the accommodations were fantastic. The room was great, bed was comfortable, staff were very helpful (and spoke great English). While we heard that six floor rooms see the Eiffel tower, room 100 (first floor) has a large bathroom, which was a big win! Our stay included breakfast each morning, which was a nice addition and a bit more upscale than your every day continental option. There is a nice gym as well, though we never touched it.", "Date": "December 7, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "", "Title": "“Beyond friendly & helpful staff!”", "Author": "sonido4404", "ReviewID": "UR121182146", "Content": "Every staff member we interacted with went above and beyond expectations. The staff was so thoughtful, when we asked for directions they practically walked us to our destination. I really can't say enough about the staff! Hotel rooms are on the smaller side, but modern and very clean. The breakfast buffet is diverse enough to meet most needs. The location was great! Close to public trans & tourist buses. A couple blocks to Eiffel Tower. And steps to amazing restaurants. When we go back to Paris we are staying at Plaza Tour Eiffel.", "Date": "November 29, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Dallas, Texas", "Title": "“Perfect location, size and comfortable”", "Author": "SFR0629", "ReviewID": "UR120865258", "Content": "My husband and I just went to Paris for 8 days. We stayed in the Deluxe room at PlazaTour Eiffel. Initially we thought it was entirely too small until we realized that the other room even smaller. We walked to most of the major sights using our maps on the iphone. The Eiffel tower was visible from our window. 3 of the nights we were so exhausted from walking all day so we ordered room service.The beef carpacio, cheese plate and the chocolate cake were great! For breakfast we went down to the breaksfast area on the bottom floor a few times then ordered in the room 2 days. I loved the pastry basket with jam. The eggs and bacon appeared to be undercooked so I didn't bother with them much. There is a small gym onsite that has just about everything you could need. The hotel staff appeared to be very friendly, assisted us with setting up a champagne tour and tour to Versailles. The staff also directed us to some very good restaurants for lunch when we did not stumble across one our selves. I loved the italian restaurant Di Vino which is a hop skip and a jump away. Ask for the Amarone wine. Overall I would say our stay was pretty great at this hotel. I'd definitely recommend it for a couple and maybe 1 small child if you don't pack as much as we did.", "Date": "November 21, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "3", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Marion, Ohio", "Title": "“Nice but small”", "Author": "Jerry H", "ReviewID": "UR120699464", "Content": "Great location! The rooms were a bit smaller than normal for $450 per night and the internet wasn't even on par with dial up. Also, I think it's the only hotel in Europe we stayed in that didn't have coffee or tea in the room. We were given 1 bottle of \"complimentary\" water our first night there. Seriously? Kinda cheap.The buffet breakfast was great and fresh. Other than that, the staff was absolutely fantastic. Professional, helpful and friendly.", "Date": "November 17, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "New York", "Title": "“What a view, what a great stay!”", "Author": "ShazzG", "ReviewID": "UR120680104", "Content": "What a fabulous “boutique” type hotel in one of the best sections of Paris (16th arrondissment). A beautiful location. Extremely close to the metro and nearby are many restaurants and bistros without the noise and clutter. Everything truly was a walk away from everything, stores, bistros, groceries, etc, Trocadero Square. The hotel is just lovely and attentive. Not like your typical “chain” hotels. The staff I can’t even begin to tell you how wonderful and helpful they were. Kirian was fabulous as was George and every one of them. Believe me, we really used all their services for booking tours, breakfasts in rooms, questions, drinks, restaurants, you name it we asked and we always received great information and always happy and with a smile. The beds were VERY comfortable. My only ‘real’ negative was in the bathroom. We in the states are accustomed to a larger shower basin. The width of the shower was quite small and the shower head always went over the shower glass which only covered half of the length of the shower. The floor would always be wet. On the plus side, LOVED the heated towel rack! Taxi’s were gotten very promptly whether outside and walking or in the hotel. Word of caution though: Kirian was fabulous as was George and every one of them. When you have the front desk phone you a cab from the moment it is called into the cab and dispatched their meter is running. So if the taxi is halfway in another arrondissment it doesn’t matter, that meter is running till it reached the hotel. One Sunday evening we had the front desk call a cab and when we got into the cab to go the my daughter’s apartment (she is studying abroad in Paris) and it was usually 10 euros, we got into the cab and it was 11 euros upon entering the cab. Just be aware of that, it is what it is. The breakfast that the hotel offers is really quite enough. Yogurts, fruits, eggs, croissants, jam, baguettes, juice and coffee. The last week we were there it was brought up to our room. Just a great way to start the day. Ask for a room on the 6th floor. You’ll get a fabulous view of the Eiffel Tower (see pictures). Free Wi-Fi in your room and a computer downstairs in the lobby with a printer. If anything was needed to be printed out, all you had to do was go to the lobby. WE printed many tour tickets from downstairs. Notes: Bus and metro tickets are interchangeable. Metro is very easy to navigate. Bakery and fruit store are across the street if you find the breakfasts to expensive. If you are touring get the two day bus pass for the tour bus. It takes you to most of all the nearby “must see” sights (Arc de Triomphe, Eiffel Tower, Champs, etc. You can get off and on any time and they’ll give you headphones and you program in your language of choice. Take a day trip to Versailles. Just beautiful. If you have the time and are interested in history, go to Normandy. Moulin Rouge, the show was fabulous. You can save money by not having the dinner if you choose. They make you check your camera. BUT on a plus side, there is a photographer who goes table to table. Take a sunset or nighttime cruise down the River Seine. Just beautiful. In box me if you have any questions on any of the restaurants, sights, etc. Way too many to list.", "Date": "November 16, 2011"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Toronto", "Title": "“Four nights at Plaza Tour Eiffel”", "Author": "J G", "ReviewID": "UR120551245", "Content": "I recently spent four nights at Plaza Tour Eiffel and four at another Paris hotel. PTE had far superior service. Their staff were friendly and were always looking for ways to be helpful, and my stay was very pleasant. I would suggest they add full shower curtains as the partial glass panel in our shower resulted in much water getting on the floor.", "Date": "November 13, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Y Felinheli, United Kingdom", "Title": "“Paris trip with friends.”", "Author": "felin508", "ReviewID": "UR120344757", "Content": "I have just returned from a trip to Paris with friends. From start to finish we had a lovely time . We booked two double rooms in the The hotel Plaza Tour Eiffel,the rooms were a little small however they were very clean with a nice shower and bath.The breakfast was good with a wide selection of food.The hotel was well placed with the Trocadero metro very close.The Eiffel tower ,Arc de Triomphe and Champs Elysees were all within walking distance. The most memorable thing about this hotel was the friendliness of the staff from the moment we arrived all of the staff could not have been more helpful , helping us to book the Eiffel tower ,sorting out taxis and overall being friendly and approachable.I would stay here again and recommend it to other travelers.", "Date": "November 8, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Miami, Florida", "Title": "“Great hotel in the 16th arr”", "Author": "2ENTravelers", "ReviewID": "UR119875789", "Content": "\"Be a traveler, not a tourist. Nothing is bad, just different. Everything has its charm.\" We had a very good experience at this hotel in late October 2011. I would recommend it to anyone that can be a traveler. For tourists, find another cookie cutter chain hotel on the outskirts of the city with big sterile rooms and no personality. This hotel is a little city centric gem with lots of charm that is clean, comfortable and in a good location. Its 16th arrondisement location is excellent because the neighborhood is very quiet both day and night so you don't get any street noise when you are trying to rest. We learned that the 16th is an upscale and desirable part of Paris. We always felt safe when walking back from the Trocadero metro station late at night (about a 5-10 minute walk). We requested a room with a view of the Eiffel Tower in advance via email and were given a very nice room on the 6th floor. We could see the top half of the Eiffel Tower from our windows, which was quite a sight at night when it twinkled every hour on the hour. True our room was typically small, as are most city-center European hotels but the room was modernly furnished and the bed had a good mattress, down pillows and comforter providing a good nights rest. We had all we needed with the flat screen TV and updated, if cramped, bathroom since we didn't spend a lot of time there. The front desk and breakfast room staff were super courteous and friendly. We were always greeted with a Bon Jour or Bon Soir. One day I called the front desk to get the access codes for the free Wi-Fi expecting that someone would read them to me over the phone but instead the clerk printed and brought them up to our room in person. Very nice! It was convenient to have breakfast at the hotel - about 20 euro per person additional per day but worth it since it is a buffet. One cafe in Trocadero charged us 19 euro on our first day for ham, eggs, one croissant and an orange juice. The selection at the hotel buffet was very generous including eggs, ham, sausage, bacon, cheeses, fruit, yogurt, cereal, milk, juices, coffee and of course the heavenly croissants and pastries - as many as you can eat! Don't miss the nearby (two metro stops away) Marmottan Monet Museum if you like the impressionists - it has a little secret treasure trove of Monets and it is a small house turned into a museum so your feet won't be falling off when you finish! Overall, we loved this hotel and would stay here again. Remember - be a traveler, not a tourist!", "Date": "October 29, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "San Francisco, California", "Title": "“Great location!”", "Author": "phuture", "ReviewID": "UR119779146", "Content": "We really enjoyed our stay at this property. The staff were nice and friendly. The hotel is really close to the Trocadero metro station, 15 mins from the Eiffel tower and is located in a nice upscale residential neighborhood. This was a plus since we got a taste of a typical neighborhood: bakery, grocery store etc. and it was nice and quiet. It's also close to a bunch of restaurants with a nice view of the tower while you are people watching and having coffee. Rooms were standard European style and clean. No complaints there. The electronic safe in the room was useful. Here are some tips to maximize your visit: * To get to the hotel from the airport you can take the airport bus to Etoille, take the metro for a couple of stops to get to the Trocadero metro station and walk to the hotel. Alternatively, you could just take the metro from the airport which probably would take you longer * Get the 7 day visitee pass for the metro. This will save you a lot of time and money and is worth it since we used it a lot to get around everywhere. The pass works on the bus too and we used it on the night buses as well * Do pick up the free map they give you at the hotel. It has a better metro map than the other free maps that you can pick up from the airport * There's a nice bakery as soon as you exit the hotel and is quite convenient. They make really good croissants! * There are two bank ATMs if you just walk down the street. I don't think the banks there charge ATM fees but your US bank for sure will for foreign conversion fees and for the withdrawal. Btw, make sure you call your bank ahead of time and inform them about your travel abroad, especially if you have Ally otherwise they'll decline your cash withdrawal * You'll quickly figure out that the cost of buying water is the same as buying wine or beer. So make sure you bottle up some water before you leave the hotel. If you go to the gym at the lower level, they have a water fountain that you can use * The hotel provides free internet in the room and also in the lobby. There's a computer in the lobby that is connected to the internet and has a printer. This was super useful to print out your tickets online if you are going to Versailles (you'll literally save hours at Versailles if you buy your ticket online) or Moulin Rouge * If you buy items that are eligible for a VAT refund, make sure that you get on the right line at the airport for the refund depending on the carrier you are flying back on. We were in line for 20 mins just to find out that they won't stamp our refund since we were flying Air France and we needed to go upstairs to the other VAT refund office that handles Air France and other airline passengers! More importantly, have fun :) Paris is just great!", "Date": "October 27, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "3", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Cambridge, United Kingdom", "Title": "“Nice stay in Paris”", "Author": "neskin", "ReviewID": "UR119441398", "Content": "Stayed in the hotel for one night on a week long trip to Paris. Fantastic location, only minutes away from Eiffel tower. Rooms were very tidy and well kept, felt at home as soon as we walked in. Staff were all very friendly and helpful, particularly with directions! :) would definitely recommend and will almost certainly stay here again.", "Date": "October 18, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "3", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Lafayette, Louisiana", "Title": "“Boutique Hotel”", "Author": "craysnancy", "ReviewID": "UR119318415", "Content": "This is a small boutique hotel located in an upscale residential neighborhood. It has a very small reception area and serves breakfast. It also has wine if you want a drink before heading out to dinner. It is located near the Trocadero where there are numerous restaurants and which has a great view of the Eiffel Tower. The staff was very friendly and helpful. One of the staff members told us about a little neighborhood restaurant, Le Scheffer, at 22 Rue Scheffer that serves fabulous French food. They have a menu in English although most speak little English. The room is a bit small by American standards but bigger than most others where we stayed in France. It was clean and had adequate space for our clothes and suitcases. It had free wifi. There is no hair conditioner in the bathroom, but I had my own. The bathtub is very narrow compared to those in the USA, but the same as those in all hotels in which we stayed in France. Our bed was quite firm. We are used to a soft Temprapedic mattress, so it seemed hard to us. We would stay here again.", "Date": "October 15, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Lafayette", "Title": "“A wonderful area for a visit to Paris”", "Author": "LightFighter", "ReviewID": "UR119246169", "Content": "A wonderful hotel located in a great neighborhood near the Trocadero.  My wife and I spent 6 nights there and absolutely loved it.  Our room was small but very clean and nicely decorated - breakfast was excellent with bacon, eggs, yogurt, cheese, meats, pastries and pancakes.  The neighborhood is superb - quiet and safe, 2 blocks to the Metro with bakeries, delis, laundry, pharmacies and lots of cafes all within a short stroll.  Best of all, the staff was wonderful and went out of their way to help with directions and talk about our day.  Highly recommended if you are looking for a cute boutique hotel in a fantastic residential area.", "Date": "October 13, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Location": "4", "Rooms": "4"}, "AuthorLocation": "Cheltenham, United Kingdom", "Title": "“Lovely hotel in a good location.”", "Author": "galloponthebeach", "ReviewID": "UR119155280", "Content": "We stayed here to celebrate our birthdays, Hotel staff were great, really helpful. Very clean and comfortable. Breakfast was very good, shame they don't have evening meals!", "Date": "October 10, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Seoul, South Korea", "Title": "“Strongly recommend!”", "Author": "Kimplo", "ReviewID": "UR118641307", "Content": "The room was a little bit small but very clean and comfortable. The hotel is located at an exclusive residential area, it was very quiet and we could sleep very well at night. Number of foods served for breakfast buffet is not so many but all of them were special and delicious. Wifi was free of charge with quite fast speed. All staffs were kind enough to enjoy our stay, they really concerned our status and conditions. Thx a lot.", "Date": "September 27, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Vancouver, Canada", "Title": "“Great Hotel”", "Author": "BShafiee", "ReviewID": "UR118431221", "Content": "We stayed here for three nights and then moved to another hotel. This one was definitely the better one, it was an actual hotel with professional staff, bell boy reasonable size elevator and good service. Free wifi was available in the room. The room was small but apparently that is not out of the ordinary in paris. (it was actually bigger than a room we had in new york!). The room was very clean and the bed was very comfortable. a lot of restaurants and cafes only 2-5 minutes from the hotel. They serve breakfast in the hotel for 20 euros but we found cafes in the area that had really good breakfast for 13 euros. but since the rest of the menu was priced reasonably I guess their breakfast must have been worth the price. Very close to Eifel tower. From metro station Trocadero it is about 5 minutes walk to the hotel. The room has air conditioning, hair dryer, towels, safe, no minibar though. They didnt have conditioner in the bathroom the first day but brought one up when we asked, on the third day though they said they don't have any conditioner so I dont know if it will be available in the future upon request either. the bathroom had a half wall to prevent water from going everywhere but it didnt help that much, aparently though that is the style in paris as the other hotel we went to was exactly the same! We will go here again if we ever go to paris again and we definitely recommend this hotel.", "Date": "September 21, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "4.0", "Value": "4", "Service": "5"}, "AuthorLocation": "Irvine, California", "Title": "“Great staff and good location”", "Author": "slashgari", "ReviewID": "UR117885548", "Content": "All the staff at this hotel are courteous and helpful. Rooms are small for 3 but comfortable. I liked the location, long walk to Champ Elysees, but close to metro station. close to Eiffel tower. I was more impressed by the friendliness of the staff which usually you don't see much in Paris.", "Date": "September 9, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Service": "5"}, "AuthorLocation": "Montevideo, Uruguay", "Title": "“We loved being there, just like a second honeymoon”", "Author": "Andrea A", "ReviewID": "UR117492647", "Content": "The trip was an unexpected gift. The hotel was perfectly located, just a few blocks from the Eiffel Tower, subway station about 150 mts., The Triumphe Arch about 25 min walk. Many restaurants in the area. Very quiet zone yet very near from the Seine. All the staff is very kind and helpful. Hope we can get back soon", "Date": "August 31, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "4.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Boston, Massachusetts", "Title": "“LOVED this hotel!”", "Author": "TravelGrlNY", "ReviewID": "UR116610480", "Content": "Husband and I just spent 4 nights at the Plaza Tour Eiffel, and were very very pleased with our stay. First, the location is perfect - in the upscale 16th arrondissement, very safe with a neighborhood feel, and just steps away from the Trocadero Metro station. The downside was that we felt far away from the tourist areas, which would normally be a good thing, but since we visited during the month of August, many of the local businesses nearby were closed. Tip, which we wish we had discovered earlier: if you're there during August, head down to Rue des Belles Feuilles (2 blocks away) to visit the boulangeries and other small shops there. There is also a large Casino supermarket you can shop at. The staff was outstanding - always friendly, and super helpful. Again, we had planned out all of our meals only to discover the majority of the restaurants in Paris were closed in August. So we compiled a new list and the staff graciously called literally over 20 of the restaurants we listed to check if they were open. In the end, they ended up making reservations for us at a couple nearby. I speak French, but the staff spoke very good English. The hotel is a boutique hotel - our room was small, but had a lovely view of the Eiffel Tower. It was very clean and modern, bedding was clean and was changed daily. The bathroom was quite spacious and updated. There is free wi-fi which is a bit slow, but was fine for the internet research we needed to do. Tip: 2 of our favorite restaurants on this trip were within walking distance of the hotel, in the 7th arrondissement (a scenic 20 min walk). Les Cocottes (no reservations), and La Fontaine de Mars (the front desk can make reservations for you and you will be treated like royalty). Both were reasonably priced and offered GREAT food. We went to each restaurant twice, as our options were limited. Would absolutely recommend this hotel, loved it!", "Date": "August 12, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Riga, Latvia", "Title": "“Highly Recommended”", "Author": "phmw84", "ReviewID": "UR116601810", "Content": "We stayed here for 3 nights on a family trip to Paris (2 Adults and an infant). We were impressed by the cleanliness, the decor and the spaciousness of the room. The bed was comfortable and the rooms were quiet. The hotel staff were very friendly and helpful, eager to help with bags etc. The elevator was large enough and modern, in fitting with the rest of the hotel. The internet was extremely fast and reliable and there was a free printer in the reception area. The location was good, being a leisurely 10 minute walk from the Eiffel Tower and 5 minutes to the Metro. On the downside, the housekeeping threw away some things that were not rubbish, and it would have been nice to have kettle facility for warming the baby bottles, but to be fair we were given free use of the kitchen at anytime for this. Overall we were very happy with our stay here, and would recommend to anyone, particularly those with young children.", "Date": "August 12, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "3", "Service": "5"}, "AuthorLocation": "Sydney", "Title": "“Excellent!”", "Author": "Florence07", "ReviewID": "UR116561415", "Content": "We were very happy with our stay at this lovely hotel. A very nice room, small but ok, lovely decor, super clean and modern yet very Parisian chic. The staff very efficient, polite and friendly. To top it off the location is fabulous. We will most certainly be back, well done on such a wonderful hotel.", "Date": "August 11, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Westwood, Massachusetts", "Title": "“Just Beautiful!”", "Author": "marianneblanch", "ReviewID": "UR116445099", "Content": "My daughter and I stayed here and loved both the area and the hotel itself. it is close to the Eiffel Towere without the crowds. The staff is friendly and very helpful. The room was clean, comfortable and beautiful. We had breakfast included and really appreciated the opportunity to eat downstairs before leaving for a full day of sightseeing. The food was good and the staff was very friendly. The hotel is really just beautiful. The only downside, although minor for us, is that the wifi is very slow. Folks needing internet access to work while in Paris will need someplace else to plug into. But overall, we fell in love with this hotel and its staff.", "Date": "August 8, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "", "Title": "“Simply devine.”", "Author": "Merigee", "ReviewID": "UR115907247", "Content": "This hotel's staff, especially Mr Kiran Rangoo, made our visit Paris a truly exceptional city break. Attentive, courteous, helpful are just a few of a reprtoire of compliments we could mention. Otherwise, the location of the hotel is perfectly placed close to the Majestic Eiffel Tower. Breakfast was delightful and the rooms were equipped to a high standard. Overall a very impressive hotel and staff which we highly recommend. Once again, a BIG thank you to the staff.", "Date": "July 28, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "4.0", "Value": "4", "Service": "5"}, "AuthorLocation": "Newcastle, Australia", "Title": "“Fabulous location, Brilliant service”", "Author": "melaniejbuscombe", "ReviewID": "UR115427865", "Content": "Fabulous location close to metros, post office, food, and Eiffel tower is only a 10 minute walk! Staff were amazing and highly attentiveand efficient to all our needs, extremely helpful, very good with english and extremely polite. The whole hotel had an overall impressive cleanliness and postive vibe. The room like all European hotel rooms was small but practical and well maintained and equiped. Would defiantely recommend and would stay there again!!", "Date": "July 16, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Colchester, United Kingdom", "Title": "“Great location, great service, just great value”", "Author": "Sadbird2", "ReviewID": "UR115055292", "Content": "My partner and I stayed here for 3 nights. The location is brilliant, a few minutes walk from the Trocadero metro station and the Eiffel Tower. We noticed a few embassies based in the surrounding streets so the area is quite quiet and reserved, no rowdiness in evidence whilst we were there. The room was small, but very elegant, and had a nice boutique feel to it. It was very clean, the bathroom was modern and the complementary toiletries were lovely. The buffet breakfast was excellent, a great choice of fruit, yoghurts, bread, cheeses, meats and pastries. Every morning there was a different hot selection too. We made the most of this meal, and took rolls and fruit with us on our travels around Paris for alfresco lunches. The staff were unobtrusive and helpful, the hotel provides a very useful guide to nearby restaurants, museums and sights. We visited a very busy Italian restaurant just around the corner called Il Conte, which was full of locals (a good sign!) very reasonably priced and the food was delicious! To sum our experience up, it was the perfect place to stay and made a great base for our sight seeing weekend. I would recommend this to anyone who appreciates a little luxury after a hard day visiting the various sights Paris has to offer.", "Date": "July 5, 2011"}, {"Ratings": {"Cleanliness": "3", "Sleep Quality": "5", "Overall": "4.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Sao Paulo, SP", "Title": "“Outstanding!”", "Author": "bela069", "ReviewID": "UR115019231", "Content": "We were looking for a hotel that would accommodate a couple and 2 kids, that have enough space but still have good prices. We founded it. What I loved most it was all the details I've found when I got there, The beautiful water, the macarons, the chocolates, the welcoming letter, the packages of the bathroom and so on. Small details that make so much difference! The breakfast was very good also. Great!", "Date": "July 4, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "4", "Overall": "4.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Singapore, Singapore", "Title": "“Such a gem!”", "Author": "RMS83", "ReviewID": "UR114907401", "Content": "Loved the hotel! The staff were so friendly (also speak perfectly good English) and are ever willing to give suggestions on places to see and restaurants to eat. Hotel is also located just 3 mins walk from the Trocardero station (on line 9 and 6). We got a little lost on the first day trying to find the hotel from the metro station but eventually found our way. basically, from the station, take exit 4 (Ave. Gorges Mendel) and once out of the station, turn right and walk till you reach the first line (Rue De Greuze). Once on the lane, walk down to No. 32 (takes abt a minute or so). Hotel was in a great central location and we walked everywhere! Arc de Tromphe was abt a 20 min walk from the hotel (you can also take the metro but walking was just so much more fun!) and it will lead you to Champs de Elysee. Aboout another 30 mins walk will lead you right to Place de la Concorde (with the beautiful obelisk) and if you continue you walk, you will go by the jardin des Tuileries right to the Louvre Museam. A long walk indeed but very do-able if the weather is perfect and you have good walking shoes. Don't bother with the breakfast at the hotel. There is a charming bakery just next door which have the most amazing freshly baked goodies. We had great baguette sandwiches and yummy pistachio tarts. It's closed on Saturdays though. Everytime we walked back to our hotel, we could not help but see the stunning Effiel Tower views from the Trocardero. Even more spectaular at nights! Do sit by the steps, with a nutella crepe (from one of the stalls at the area) and watch the blinking lights that come on every hour at the Eiffel Tower at night. The feeling is just magical. From Trocardero, you can walk down right to the Eiffel Tower and the River Seine (takes about 10 mins). We took the River Seine cruise (so romantic!) and cost us about 12 euros for the hour long cruise. The hop-on hop-off batobus tour also operates from there. Overall, an excellent hotel - rooms are a good size, clean and comfortable with free wi-fi access. Another thing, do visit the Chateau De Versailles if you have a day to spare. It's really worthwhile. Don't bother with expensive tours as you can get a free personal tour in the palace itself. Also, it is very easy to get there from the hotel. Take line 9 to the end (Pont de Sèvres) and then get out at the bus exit and take number 171 to the end. A great hotel indeed! Will surely recommend=)", "Date": "June 30, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "4.0", "Value": "4", "Service": "5"}, "AuthorLocation": "Brisbane, Australia", "Title": "“A great hotel and great location”", "Author": "robkielty", "ReviewID": "UR114775038", "Content": "I've stayed in several hotels in Paris and thios is the best by far. I would describe this as a small boutique hotel. Situated by the Trocadero and within easy walking distance of the Eiffel Tower, Arc De Triomphe and the Trocadero Metro: its a pleasant area just far enough from the main tourist areas to be comfortable. There's a good selection of local bars and restaurants and getting to major tourist sights is easy. The staff are very friendly and bend over backwards to help. the rooms although small are beautifully fitted out and comfortable. I would recommend this to any travellers to paris.", "Date": "June 26, 2011"}, {"Ratings": {"Cleanliness": "3", "Sleep Quality": "3", "Overall": "3.0", "Value": "1", "Service": "3"}, "AuthorLocation": "UK", "Title": "“Tiny, overpriced....”", "Author": "Bizzy_TravellerUk", "ReviewID": "UR114673656", "Content": "You can't come to Paris and expect anything less than small rooms and ridiculously overpriced food. However this hotel really exemplifies the art of charging huge amounts of money for what equates to a tarted up bed and breakfast. YES - the room was nice (minute, but clean and modern), but WOW - Eur275 ? In La Defense I can standardly get a room for Eur200 that would be twice the size with ten times the amenities. Eur18 for a very standard, slightly stale chicken sandwich is taking liberties - especially when you have to wait AN HOUR for it to arrive. The staff are very friendly though and keen to help. They carry the weight of the overpricing and poor facilities. Breakfast is called out by some on here as 'delightful' and 'good selection'. Where have you been eating ? Motorway service stations ? The breakfast was scant, claustrophobic and simply uninspired. Given there is an artisan boulangerie next door, I would have thought they could have done better. I shan't be back.", "Date": "June 23, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "2.0", "Value": "1", "Location": "4", "Rooms": "1"}, "AuthorLocation": "", "Title": "“Way overpriced not a 4 star”", "Author": "kiwis1234", "ReviewID": "UR114643341", "Content": "I feel completely ripped off. This hotel is way overpriced for what it is. There is no hot water for showers. Rooms are very small no where to even put your luggage. Shower leaks puddle on bathroom floor. One English tv channel that flicks every second due to poor reception and it's definately not a large tv like advertised. Internet very slow and also drops out. This hotel just has a very good photography in regards to the photos on their website. Good location, breakfast and friendly staff", "Date": "June 22, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "4", "Service": "5"}, "AuthorLocation": "Adelaide, Australia", "Title": "“Elegant small hotel is not what you expect....”", "Author": "Aussie_Business_Guy", "ReviewID": "UR111939634", "Content": "Firstly, I will say I liked it. I really liked it. I was not wowed when I arrived, in fact I thought it was very plain and ordinary because thats not what I expected or was prepared to see......such a simplistic form of contemporary hotel in the heart of the16th in Paris. There are no photos of the outside of the hotel around because well its boring.....there is no historic facade or glorious entrance. Its just form and function and funny enough, thats what I really liked about it in the end - its simple-ness. You come to realize, simple is good in a city overrun with camera wielding tourists (of which I was one!). Generally the service is great if you attempt as much as possible in French...they really try hard to please and are very helpful. The front desk staff are especially helpful although one must realize this is a small hotel and they can't provide the services like the large chains. The rooms are surprisingly large....for Paris, with dreamy beds and really nice features. There is no mini bar or fridge (you can get ice in a bucket at most times) and you can't have a kettle in your room but and beside all those facts the rooms are great. Breakfast was a very good spread and very consistently well done. Whats really great about the hotel is the location....close to the Eiffel tower, the river, the Bois de Boulogne park (although don't go there at night as its well known red light district), shopping, great side street restaurants. The place has it all. Highlight: Walking 100m down the street to the Place de Mexico to see the Eiffel tower at dusk...one of the best street scape views in Paris.", "Date": "June 7, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "4.0", "Value": "4", "Service": "4"}, "AuthorLocation": "Hong Kong", "Title": "“Good value for business in the 16th”", "Author": "pamarx200", "ReviewID": "UR110848392", "Content": "This hotel is highly unusual for Paris. First: the room is decent sized, perhaps one and half or twice as large as the typical Parisian hotel. It could be in Asia or north America. Second, everything in the room is contemporary and very functional from a users point of view. The internet connection works, the safe is laptop-sized, the TV is a flat-screen; the bathroom is totally renovated. One doesn’t get the feel that nothing has been changed since the hotel opened three decades ago, despite its “traditional look” from the street. Third, the hotel actually makes an effort to serve. I asked for a hot water kettle in the room, and they actually put one in. There is free printing in the lobby. The stationery is of a good quality. The only complaint is that housekeeping doesn’t replace used toiletries every day. These are high quality – Fragonard—and perhaps they are scrimping. But they only give guests one set during the whole stay, which is fine if you are staying for one night, but not good if you stay for three or four nights. Lastly, the hotel is very well located. A few minutes from Trocadero metro station and jogging along the Seine or Champs de Mars (Eiffel tower); a few minutes walk from great shopping and conveniences on rue de Passy or Victor Hugo; and a few minutes walk from many business addresses in the 16th arrondissement. Overall, the hotel represents good value amidst an overpriced Parisian hotel market.", "Date": "May 31, 2011"}, {"Ratings": {"Service": "2", "Cleanliness": "4", "Overall": "3.0", "Value": "2", "Sleep Quality": "4", "Rooms": "2", "Location": "3"}, "AuthorLocation": "London, United Kingdom", "Title": "“Comfortable, quiet, but overpriced and soulless.”", "Author": "Cymro29", "ReviewID": "UR110617656", "Content": "Comfortable beds, quiet street. Small room and tiny bathroom, and this was the second highest grade. Not sure how this hotel can be 4 star with no restaurant and no mini-bar in the room. Staff friendly enough but a bit slow on the uptake. No security when we got home at midnight, which was a surprise. Decent breakfast. Good wireless internet. Expensive, like all Paris hotels.", "Date": "May 30, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Swindon, United Kingdom", "Title": "“This Hotel was Perfect for our stay”", "Author": "Nicholas50_61", "ReviewID": "UR109529811", "Content": "The Plaza Tour Eiffel is a small friendly hotel and just a 5 minute walk to the Trocadero, in a lovely peaceful location. The room we stayed in was very comfortable and clean. The hotel staff were extremely helpful and friendly. The breakfast was continental buffet style with plenty of choice. In all our travels this was by far the quietest city hotel we have stayed in and was perfect for our short break to Paris. There are many restaurants within walking distance and away from the normal tourist locations and on our arrival were given some very helpful information on these. We would definately recommend this hotel.", "Date": "May 23, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Maryland", "Title": "“Great location, great staff, clean rooms, PERFECT!”", "Author": "OrvosVagyok", "ReviewID": "UR108577717", "Content": "I highly recommend this hotel. I brought my wife to Paris to propose and we stayed at this hotel for the week. It was an amazing and memorable week in Paris and this hotel only made the whole experience better. First the location is ideal. It's only two blocks from the Trocadero area with the Eiffel tower just across the bridge and the metro is less than two block's away. However, the hotel is far enough off the main street for peace and quiet in a safe neighborhood. Around the corner, you will find a small bakery, a deli, two small grocery stores and a pharmacy. We stopped at these stores a few times to pick up wine, baguettes and fromage to have ourselves Parisian style picnics. You will also find many cafes and restaurants within walking distance. As for the hotel, it is modern and tastefully decorated. The room was spotless, modern and comfortable. The bathroom was clean and modern as well. The room and bathroom were slightly on the small side but this is expected in Europe. The bed was comfortable, there was plenty of closet space and there was a flat screen TV with several channels, a couple in English but lets face it, you don't go to Paris to sit in the room and watch TV. The staff was extremely helpful and friendly, always eager to help and answer questions. The room was cleaned meticulously everyday and whenever we needed something such as an extra towel or a bucket of ice, it was never a problem. There's no mini bar so the bucket of ice comes in handy. And to top things off, they had free WIFI. 5 stars across the board for this hotel.", "Date": "May 17, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Ottawa, Ontario, Canada", "Title": "“Finally, a Paris hotel I would happily return to”", "Author": "magpie1998", "ReviewID": "UR106358825", "Content": "It's particularly difficult to find a hotel in a strange city if you don't want to stay at another chain hotel. Clean rooms, helpful staff, and a great, quiet location all contribute to to what is a really nice experience. Three blocks from the Trocadero and no more than twenty minutes by foor to the Eiffel Tower, Plaza Tour Eiffel is well located for visitors who want to walk in Paris. Good shopping is also within easy walking distance. On the downside, the breakfast buffet is good (better than that in many hotels I've stayed in), but it is still hard to imagine paying for it in addition to the daily room rate. With the choice of bakeries and restaurants nearby, this really isn't a major concern at all.", "Date": "May 1, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "London, United Kingdom", "Title": "“Excellent service at a superb location!”", "Author": "tabs_eff", "ReviewID": "UR106069453", "Content": "I booked this online after reading a number of reviews that recommended it. I wanted a genuine 4* Hotel (rather than a 3* Hotel ticking some 4* boxes) in a superb location and it did not disappoint. We received excellent service on checking in early; finding the concierge welcoming and polite helping recommend with the day’s programme and mapping. The room was fairly small but certainly not uncomfortable with a spacious bathroom. Location- COULD NOT BE ANY BETTER. With a pleasant cafe just outside the front door and the Trocadéro (overlooking the Eiffel Tower and its Metro Station) within 300m. Amenities- All that what you would expect from a quality 4* hotel. Excellent attention to detail with good fixtures and fittings, toiletries, delightful linen, Wi-Fi, great buffet breakfast, gym etc. However, the list price on the door stated 320 Euros. I don't think that I would pay that much for it but certainly would pay my £190 again!", "Date": "April 29, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "West Sussex", "Title": "“Absolutely fabulous hotel”", "Author": "JAS2008", "ReviewID": "UR105917215", "Content": "We checked out this hotel on Trip Advisor and the reviews were very accurate. It was located literally round the corner from the Eiffel Tower in a quiet street. There was a reasonably priced supermarket nearby which sold everything. The hotel was clean and tidy and the rooms although not huge were perfectly adequate. The breakfast consisted a range of cereals, scrambled eggs and bacon, cheeses, pastries, fresh (with pith) fruit juices, dried and fresh fruit. There was also a gym if you're into that sort of thing. The hotel was central to everything and there were plenty of restaurants, bars and cafes nearby. We particularly liked Cafe Kleber down Rue de Kleber which did really good food but it wasn't cheap - the same as anywhere in Paris - and the drinks (again as in Paris in generally) were extortionate. The hotel was at the Victor Hugo metro stop - 12 stops from La Chappelle (Gard du Nord - Eurostar). The metro was really easy to negotiate. We managed to do the top of the Eiffel Tower at night which was an amazing experience. However to avoid the queues book your ticket on the internet well in advance, ie several days or even weeks beforehand. We didn't and couldn't get any - we even tried to do it at the hotel but without success. We went about 8.30pm on the off chance of getting in and although we queued for about 30 - 45 mins (short in comparison to the day time queues) it didn't seem that long and although the summit was closed when we joined the queue it was open by the time we bought our tickets. The tower is lit up at night and twinkles like a Christmas tree for 5 mins on the hour - absolutely incredible to see. The Sacre Coeur is quite a walk from the hotel but then it's not central to anything and I would suggest staying around the Eiffel Tower to ensure you're reasonably close to the main sites. We walked everywhere but you can of course get the metro, open top bus and river boat. There are loads of lovely parks if you want/need some peace and quiet. It was a fabulous city break and we'd recommend the hotel to anyone.", "Date": "April 28, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Coventry, United Kingdom", "Title": "“Perfect for visiting Paris”", "Author": "globalmanu", "ReviewID": "UR102611926", "Content": "Very good location, just 5 minutes walking from the Eiffel tour. Very nice and quiet area. Rooms are small, but clean and modern. Very friendly staff, always keen to help. Breakfast is not massive but very nice.", "Date": "April 3, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "3", "Sleep Quality": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "England", "Title": "“Excellent reception staff”", "Author": "AngelaCEngland", "ReviewID": "UR102425296", "Content": "Apart from the room being on the small side, I would recommend this hotel, it was spotlessly clean, in a nice area, very central, excellent breakfast and the reception staff could not have been more helpfull.", "Date": "April 1, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Norfolk, Virginia", "Title": "“Very Welcoming and Friendly”", "Author": "lalooman", "ReviewID": "UR102209512", "Content": "Great location, after the thrill of the Eiffel Tower it is so close to metro you can zip anywhere. The room was kind of small but cozy and adequate. The staff felt like old friends, always willing to take time to assist. Breakfast was filling for a busy day of sight seeing and the staff in the dining room was very friendly.", "Date": "March 30, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "3.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "3"}, "AuthorLocation": "East Williston, New York", "Title": "“staff is great but rooms are poor and substandard”", "Author": "piku247", "ReviewID": "UR101784997", "Content": "located about 10 minute walk from Eiffel tower reception staff is great- Cyril and George were great Rooms are small -the rooms we stayed in was on the 6th floor , you may bump into things and hit your head , i fell after tripping coming out of the bath room- dangerous. bed was very uncomfortable- not a double bed , but 2 singles pull together, and in the second room the 3rd bed was a pull out sofa in very poor condition, nobody can really sleep in saving grace for this hotel is its location , staff and breakfast which was decent not good for the family to stay", "Date": "March 27, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Teaneck, New Jersey", "Title": "“Excellent choice for Paris vacation”", "Author": "bobeve", "ReviewID": "UR100966361", "Content": "So many choices for hotel stay in Paris, we were very happy to be at Plaza Tour Eiffel Hotel. The entire staff was extremely professional, welcoming, courteous and informative. The hotel was spotless (tub a littel small), Excellent buffet breakfast, tasty, fresh with many choices. The upscale neighborhood was clean, quiet and safe with easy access to Metro ( two short blocks). All amentities available down the block e.g.restaurants, fruit store, bakery etc. Leaving the Trocodero station the Eifffel tower view was a beautiful way to begin and end our day. Would definitely stay here again.", "Date": "March 21, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Wales", "Title": "“Had a lovely time”", "Author": "Adele48", "ReviewID": "UR100953584", "Content": "WE have just returned from a 3 night stay in Paris and we would recommend this hotel. As other reviewers have siad it is very clean, modern and accomodating and is set in a lovely residential district about 5 minute walk from the Eiffel tour. We spent very little time in the hotel as there was too much to see and do in Paris but we had a great night's sleep every night. The bathroom is small as are the rooms and there was an issue with the water from the shower pouring onto the floor as the shower screens are not wide enough. Breakfast was lovely - typical French fayre with a few hot options (egg, bacon, sausage of sorts) but all very fresh and replenished regularly. The staff were without exception very pleasant and helpful and we were made feel very welcome. Getting around Paris is easy on the Metro and we walked for miles and miles and miles! One word of warning though is to watch your bags and wallets - we saw a couple of people succumb to the pick pockets on the Metro and we were also scammed by a man at the ticket machine at Gard de Nord when we were trying to get out to Stade de France to watch the rugby. He appeared like he was a guard and offered to buy the tickets and we give him cash - given that there were thousands of people behind us and we didn't have a lot of time to think we agreed and ended up with two metro tickets which were worth about £3.40 yet we had seen on the screen the tickets would cost twenty Euro and that is what we gave him! We were annoyed with oursleves but it all happened so quickly! Anyway - just a word of warning. There is a great little shopping area if you go out of the hotel turn left and walk up to the roundabout and then take any of the streets on the left, one is full of clothing shops and the other full of food outlets / patisseries and a small supermarket. We loved St Germaine and the Marais district and had great Falafel in the Marais area. We went to Notre Dame and managed to time it perfectly for a mass which was lovely. We made full use of Citywalkingtours and Tamara and Chris showed us around the city which we might not have found otherwise. Overall we had a fabulous time - we crammed as much in as we could and didn't cover 1/10th of things to see and do. Will definately go back soon.", "Date": "March 21, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Kuala Lumpur, Malaysia", "Title": "“Happy Stay”", "Author": "karuna94", "ReviewID": "UR100648829", "Content": "My office sent me to Paris for a meeting and they booked room at Plaza Tour Eiffel, Paris. I was staying there for 7 days and i want say that i was very happy with ther service of their staffs. The hotel are very clean and quite. It very near ti Eiffel Tour and Metro as well. I also want to introduce Mr Geogre who very very helpful and knowledge. He can give us very good guide especially for those are new at Paris. Ones again i want say thanks to the hotel management and Mr Geogre for his kindness and honest. If anyone want stay there please ask for him for any assistance. Karuna, MALAYSIA", "Date": "March 18, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Belfast, United Kingdom", "Title": "“everything you could want”", "Author": "mark861660", "ReviewID": "UR99683683", "Content": "very clean and contempary. staff were extremely friendly and helpful. this hotel is very close to the eiffel tower etc anywhere else just get a ticket for tour bus, which you can hop on and off at any time and it can be used for 2 days.", "Date": "March 10, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "New York City, New York", "Title": "“A perfect gem of a hotel, great decor, great staff and excellent location”", "Author": "jl424nyc", "ReviewID": "UR98450250", "Content": "From the wonderful welcome at checkin thoughout til checkout, this hotel proved the perfect place to stay for our 1 night in Paris. Delphine (the manager) and the entire staff were amazingly graciuos and made my wife and I feel like King and Queen for a day. The service is impeccable, the hotel decor is elegant and sophisticated, yet very warm and confortable; a perfect combination and the location, tucked away on a quiet residential street just a block from the Trocadero is perfect for touring the city. We cannot wait to visit again, this time for a much longer stay. We highly recommend this hotel to anyone looking for a great hotel in Paris.", "Date": "February 28, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Bristol, United Kingdom", "Title": "“Choose This Hotel and Be Very Happy Indeed”", "Author": "Marksway", "ReviewID": "UR96855752", "Content": "My partner and myself looked at Trip Advisor prior to going Paris and came across the Plaza Tour Eiffel and after looking at a few others we decided to choose this hotel as it was the best looking and in the best location. Upon arrival at the hotel as soon as we walked through the doors we was greeted by kind very well presented staff, they looked very smart and their service they provided was very smart also. We did not see one little piece of dirt in this hotel and was very impressed with our entire stay, we do recommend this hotel for the brilliant staff nice breakfast layout, and all attractions easy to get to. The hotel is in the perfect location, we visited so many places via Metro (Must say very easy to use), the nearest attraction was the Eiffel Tower, which was about 5 minutes walk, you can see it on very clearly at the end of the hotels road. Me and my partner went their loving each other very much and came back loving each other even more so, for those that say the French are rude you are mistaken because the hotel staff and restaurant staff were very kind and helpful. We will be going back again to the same hotel as we liked our stay very much.. Thankyou very much to all the staff at Plaza Tour Eiffel Hotel.", "Date": "February 16, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Bradford, United Kingdom", "Title": "“LOVELY HOTEL, STAFF REALLY HELPFUL, STOPLESSLY CLEAN”", "Author": "sammy186408", "ReviewID": "UR96642554", "Content": "our fisrt time in Paris, the hotel give us directions on how to get to the hotel from the airport, the journey was relly easy on the train. The room was spotless, the Eiffel tower was at the bottom of the street. Well recommended. The staff were very friendly on helpful.", "Date": "February 14, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "gloucestershire", "Title": "“Excellent”", "Author": "philnash", "ReviewID": "UR94223774", "Content": "Having stayed in many hotels in Paris over 30 years, I found this one of the best. The attitude of the staff - particularly the Reception team was certainly the best I have experienced. The hotel accommodation was good value for money and the breakfast was fine. I would recommend this hotel but, of course, it depends on which location people want - this fitted perfectly on this occasion.", "Date": "January 24, 2011"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "Perth, Australia", "Title": "“excellent service, very courteous and helpful staff”", "Author": "johnskidsng", "ReviewID": "UR91962974", "Content": "Very helpful staff, proffesional service. Clean rooms, sufficient gym and good location. 5 mins walk to the metro. Very quient ambience, the staff makes you feel as if you are the only one staying at the hotel.", "Date": "January 6, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Stuttgart, Germany", "Title": "“I've Never Been Treated Better”", "Author": "b_defender1", "ReviewID": "UR89781556", "Content": "This hotel was simply fantastic. The manager (I'm sorry, I should have remembered your name) and staff (especially Daniel) went so far beyond their duty. First, let me preface this with telling you that I proposed to my girlfriend while we were there. I told the staff my plans, and they upgraded us to the best room in the hotel. We had a balcony and a view of the Eiffel Tower that we could see from our bed. The room, while somewhat small, were simply fantastic; the bed was comfortable; the breakfast was adequate, the location was just about perfect, but it's the service that stands out above all others. As I said, I asked my girlfriend to marry me. I told them of this on Saturday, and they arranged for flowers to be sent (not only sent, but they staged the room with flowers on the bed and flower pedals all over the room), the champagne to be chilled, a delicate presentation of the glasses with pedals, and a box of chocolates. Simply AMAZING! My fiancee (by the time we entered the room), took one step in the door and started crying. It was a combination of effort from Daniel who ordered the flowers (and came WAY under budget while still ordering the extra pedals; which I didn't specify but am oh so glad that he did) and the manager (please forgive me for not remembering your name!) who staged the room to be so breathtaking that it brought tears to her eyes and caused her to drape around me and just finalize the most perfect evening. We are forever grateful for your hospitality and for being a part of our special day, and will come back and stay there without even considering another location. Our travels to Paris will be frequent, and your hotel will be our choice from this point forward. For those considering staying in this hotel, when you enter, you're treated with the highest level of respect. The sleep was good, the location perfect, and the staff was, well, you've read my post. Please, don't hesitate on choosing this hotel; you won't regret it! Oh, and if you're searching for a fantastic dining experience, look up Paul Chene. I'll write a review of his restaurant soon, but you will be glad you looked it up. Our trip was simply amazing.", "Date": "December 13, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "romania", "Title": "“a basic hotel”", "Author": "baroma", "ReviewID": "UR89075338", "Content": "it's faaar from a four star hotel as advertised. the location is ok and the front desk staff are very helpful and polite, but.....the hotel badly needs renovating, especially the entrance lobby. the rooms are basic. the heating is absolutely nerve- racking, the only possibility being A/C , which is extremely loud and wakes you up during the night. the breakfast is basic. a modest hotel, but it's clean and it's Paris, isn't it?", "Date": "December 5, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "London, United Kingdom", "Title": "“Fantastic!”", "Author": "extased", "ReviewID": "UR88564678", "Content": "Very good location, walking distance to all sights but in a quiet residential street. Please be advised the staff at this hotel are ALL such lovely people! They are friendly, inviting, professional, courteous, charming and above all very knowledgable. The hotel itself has been decorated to a high standard with some nice touches. The room was modern and well equipped, fittings and finish were good and the bed was spotlessly clean and comfy for a hotel bed. The hotel staff went out of their way for us, keeping our bags downstairs for us while we explored the city once more after checking out on our last day. Breakfast buffet was hearty and fresh, served in an intimate basement dining room adjacent to the gym that didn't feel claustrophobic at all. Food was of a high quality and enough to last until lunch time even when walking for 6 hours. This hotel is head and shoulders above many other more expensive hotels in Paris and I wouldn't hesitate to come back in a few years time. I've already recommended it and will keep doing so.", "Date": "November 29, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Essex", "Title": "“A gem in an ideal location”", "Author": "Wayfarer01", "ReviewID": "UR85079489", "Content": "For our first visit to Paris, we could not have picked a better hotel. The location was ideal - close to Trocadero and the Eiffel Tower and within easy reach of all the mian attractions. Service was excellent - the staff were friendly and went out of their way to be of help. The 'eat as much as you like' buffet breakfast was superb with a large continental selection and also scrambled eggs and bacon! The room was comfortable and clean and just the right temperature. Everything was modern and well presented. A totally good expereince and I would thoroughly recommend this hotel.", "Date": "October 27, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Rotterdam, The Netherlands", "Title": "“Charming small hotel with wonderful location”", "Author": "sailgirl", "ReviewID": "UR84335042", "Content": "My husband and I stayed at the Plaza Tour Eiffel twice on business recently, both times for 3 night stays. This small boutique hotel is on a quiet street in a lovely residential area of the 16th on a quiet street, yet only 5 minutes walk to Trocadero, and within 15 minutes walk of Eiffel Tower, Arch de Triomphe and Champs Elysee. Many lovely shops, cafes and restaurants are found in the immediate area, and both Metro and bus lines are easily accessed. We reached the hotel from Gare du Nord on the metro in 20 minutes, with one connection. The staff was universally warm, friendly and efficient. They evinced a genuine concern that we enjoy our stay. Restaurant recommendations they made were spot-on. The rooms were of reasonable size and surgically clean. Lovely modern bathrooms, and the beds were exceedingly comfortable. On both occasions, we were given rooms on a high floor with small balcony that overlooked the Eiffel Tower. The free wifi connection was good. Breakfast room is small but never felt crowded. The breakfast buffet was standard French breakfast, of a good quality. Excellent coffee! Nice selection of champagnes by the glass and single malts at the tiny bar in reception area. I will happily stay at the Plaza Tour Eiffel again, and have already recommended it to several friends.", "Date": "October 21, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Sleep Quality": "2", "Rooms": "3", "Location": "4"}, "AuthorLocation": "london", "Title": "“shame about the cold morning showers(no hot water)”", "Author": "julieayanna", "ReviewID": "UR82414989", "Content": "great location 5 mins to Trocadero, friendly staff,charming gentleman on reception during the day,clean rooms just no luxury , basic clean decor , a very good quality 3star not a 4star very very noisy elevator(lift ) could not sleep from the noise, all night and i spoke to other guest in lobby every one had same problem,noise and hot water trouble,but all in all not a bad stay, just wish i had the chane to get a good sleep night before my friends Wedding , i was Knackered!!for people who go to Paris to party hard and not sleep then no problem.", "Date": "October 7, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "3.0", "Value": "1", "Sleep Quality": "4", "Rooms": "2", "Location": "4"}, "AuthorLocation": "Ellesmere Port, United Kingdom", "Title": "“comfortable but over priced and slightly back street location”", "Author": "Ajmeaden", "ReviewID": "UR81576657", "Content": "Having been to Paris a few times over the years and trying different hotels I opted to stay at Plaza Tour Eiffel as the website showed a 4* hotel and looked good. On arrival, the Metro stop is indeed a 4 minute walk, but you have to walk up a back street thats off the main hub, its cobbled as well. The Hotel looks good as you approach and on entering the place you are greeted with oppulence and friendly staff. I have no complaint about the staff or the reception, and the porter service of taking our bags up while we checked in, fantastic service. Our room on the 4th floor when we opened the door was small, very small for a superior room, superior in france means standard in the uk and elsewhere in the world. The room was well laid out asnd a very comfortable bed, the bathroom was very clean and complimentary shower and bath products. The view however was of the flats opposite and what ever they were doing. we could also just make out the top of the Eiffel Tower if we leaned out of the window. The shower was one of the worst contraptions I have ever used. To use the shower you had to hold the shower on you rather than leaving it attached tom the wall as if you did it would only spray onto the wall, once I had mastered this it was very good, But I have not had to use a shower like that in years either at home or in a Hotel. I cannot comment on Breakfast as we did not eat in the Hotel, we ventured out to a local brasserie, which I can whole heartedly reccommend, it was right next to the Metro entrance at the trocedero,I forgot the name though, sorry. In all the hotel is very pleasant, well situated to the trocedero but it is not worthy of 4* and is no where near woth the money that it charges, I have stayed in cheaper hotels around the world and had a much better level of room. I would not recommend this place unless you dont mind spending alot of money for very little.", "Date": "September 30, 2010"}, {"Ratings": {"Service": "2", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Philadelphia, Pennsylvania", "Title": "“Good hotel with one exception at the front desk”", "Author": "Bambi0920", "ReviewID": "UR80191107", "Content": "This hotel itself was just fine - clean enough, small rooms (but not unexpected), breakfast is available on site if you'd like, and it's walking distance to the Eiffel Tower. Unfortunately, we had a couple of frustrating experiences (mostly with the same member of the front desk staff). At various times during the trip, we were woken up by vacuuming earlier in the morning, called in our room at midnight about a question we had two hours earlier, and on the final day, after dicussing a possible time change for the airport shuttle, they managed to cancel it altogether. Also, at one point, we asked how to get to Versailles and were given incomplete information. Thanks for telling me I need to get the train but you could have mentioned we need to change trains twice from here... you know? We couldn't have been the first people to ask!", "Date": "September 19, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "2", "Sleep Quality": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "romania", "Title": "“GOOD LOCATION”", "Author": "anca2010", "ReviewID": "UR79118234", "Content": "I have stayed at this hotel four nights in august 2010. The location is great so is the staff, but it does not worth four stars. The room is very small and the breakfast is a waste of money. The tour eiffel is very close by ,10 minutes walk and the metro station Trocadero is 5 minutes walk.", "Date": "September 11, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Poole, United Kingdom", "Title": "“magic”", "Author": "joy035", "ReviewID": "UR78020692", "Content": "this is a lovely hotel in a quiet area 5 mins walk from the eiffel tower the staff are very friendly helpful and ready and willing to assist in anyway they can our request for hot water so that we could make a cup of tea in our room was always meet with \"oh you english and your cups of tea\" we spent one evening in the bar just chatting with the staff and we both learnt alot about each others cultures There are several bars and resturants near by and a supermarket very close its with easy walking distance for the hop-on-hop of bus and i would definately stay there again if i was lucky enough to get to paris again the only down side is not kettle in your room so you either have to buy coffee from the bar (4.50 euros per cup or go out to get a drink)", "Date": "September 2, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Tampa, Florida", "Title": "“Love it!”", "Author": "Breezybre", "ReviewID": "UR77383263", "Content": "This hotel was the best part of our trip. The staff spoke perfect english and were always helpful. They gave us maps and directions wherever we wanted to go. They helped me to understand the tube system, which was necessary to visit everywhere in paris. The room was small but had all the amenities I required. I loved this hotel, it made my trip to Paris!! Thanks again to the wonderful staff!", "Date": "August 29, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Madrid, Spain", "Title": "“Good 4 star hotel in excellent location”", "Author": "traveller_spain", "ReviewID": "UR74852552", "Content": "We stayed 2 nights at this hotel travelling by car to Paris. Overall we were very satisfied with our stay and we would choose this hotel again for an stay in Paris. LOCATION: is quite near from Trocadero, best point to see Eiffel Tower. The street is very quiet and the area is elegant and seems quite safe. We came by car and it was easy to park (it was august, month when it is free and plenty of space). HOTEL: it looks very new, functional and modern. Rooms are a bit small, but they look very clean, elegant, modern and have all amenities you need (only no minibar). Bathroom size is ok, bathtub should have more functional courtains to avoid spilling water. There is flat TV and free WIFI. Staff was friendly and helpful. BREAKFAST: overall is was very good quality, with fresh juices, good bread & cakes, excellent cheese, ham, cold meat, fruit, scrambled eggs, yogurts, ... we only miss more warm food like sausages, bacon, ... but we were satisfied.", "Date": "August 12, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "London, United Kingdom", "Title": "“All round excellence”", "Author": "jogreatbatch", "ReviewID": "UR74824119", "Content": "From the moment we arrived to the moment we left we could not fault this excellent hotwl in any way.Although the rooms can be on the small side, a feature of Paris hotels, it was excellent all round. The hotel staff were some of the best and friendliest I have ever met and the breakfasts could not be bettered. Would I recommend this hotel, yes, would I stay here again, you bet. Only 5 mins from the Trocadero and 10 mins to the tower.", "Date": "August 11, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Athens", "Title": "“Excellent”", "Author": "elegik", "ReviewID": "UR74666567", "Content": "Very nice hotel, in great location. Beautiful interior, small but comfortable rooms. Helpful people. Good breakfast.", "Date": "August 10, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "derry", "Title": "“Highly Recommended Hotel”", "Author": "andunderry", "ReviewID": "UR72979671", "Content": "I wanted to take my wife to Paris for a short break for her 40th birthday and looked at hundreds of hotels. I decided on the Plaza Tour Eiffel and it was an excellent choice. The staff are brilliant and are only too willing to help you. We were upgraded to a superior room on our arrival at no extra cost and they insisted on taking our luggage to the room. The room and bathroom were extremely clean. There was no noise from other guests and the hotel allowed for a very relaxing break. The breakfast was more than enough. The hotel is only a 10 minute stroll form the Eiffel Tower. If I return to Paris I will not be looking at any other hotels as this one was perfect. I would recommend this hotel to anybody.", "Date": "July 30, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Sleep Quality": "4", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Belfast, United Kingdom", "Title": "“Not the best Paris location”", "Author": "UrbanAngel5", "ReviewID": "UR71326635", "Content": "This was a great wee hotel. It was clean and modern and comfortable. The staff were great and the service was excellent. They were very helpful and had excellent English. Unfortunately the location of this hotel was not the best. It was near the Eiffel Tower, we could see the top of the Tower if we leaned out the window, but it was still a bit of a walk even from that. The hotel was not near the Champs Elysees really at all, nor any of the museums, shops, etc. We also struggled to find anywhere nice to eat near the hotel. We weren't being fussy either. The first night we wandered round the streets near the hotel and ended up in this place where they gave us pre made spag bol heated up in the microwave. Its Paris! We didn't go there to get reheated spaghetti! The hotel is a bit out of the way, on a corner of two wee streets. We were in a few taxis coming back from various places and they all struggled to find the hotel. I think that's a bad sign. Lovely hotel but unfortunately the location really let it down and next time I'm in Paris I will definitely not be staying there or anywhere near.", "Date": "July 18, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "", "Title": "“Wonderful Experience”", "Author": "osubux1", "ReviewID": "UR70868140", "Content": "This was a 4 day trip to Paris and the first for me. Picked this hotel due to Trip Advisor reviews and they were accurate. This hotel is wonderful. Some points: -The service is out of this world. Sophie and Daniel are top notch and are two of the top hotel employees we've ever encountered. They and the others delivered on every single request we asked for... and with a smile. I can honestly say it has been a long time since we've experienced such outstanding service anywhere in the world. -The area is not known for nightlife, so if that is what you want, you may try elsewhere. It is a great, quiet neighborhood with a fantastic fresh produce/fruit market steps away, a natural food market next to it (for wine, etc.). It is approximately a half mile walk to the Trocadero with its cafe's all around, and the Tower another half mile. The Trocadero has a metro stop as well, so that was convenient. Very safe area. -The wi fi worked perfectly, the breakfast buffet was very good as well.", "Date": "July 14, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Pasadena", "Title": "“Began with Queen Mary 2 ended with Plaza Tour Eiffel”", "Author": "CalinCa", "ReviewID": "UR70191454", "Content": "Our two-month European holiday began with passage from NYC on the QM2 and ended with a stay at PTE. Neither the QM2 nor the PTE disappointed. The Plaza is a charming small hotel located away from the bustle of the tourist areas and yet no more than a 5 minute walk to a Metro stop and the Trocadero. Although all rooms faced the street, Rue Greuze is not heavily trafficked and the soundproofing superb (our room was on the first level (US 2nd floor). Bedding was excellent, bathroom fresh and spotless. Staff at PTE were no less wonderful than those on the QM2. Within short walks, several patisseries (the best for us-- corner Rue Longchamps and Avenue Victor Hugo) and good not fine restaurants.", "Date": "July 8, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "chicago", "Title": "“Paris: Unexpected pleasure!!”", "Author": "tanmann", "ReviewID": "UR68590199", "Content": "This was our first trip to Paris, and my first trip to Europe. We were booked through \"AvantiTravel\" into the Plaza Tour Eiffel. This was truly an uxepected pleasure. The front desk staff could not have been more accommodating, especially Sophie and George. Their understanding, personal attention, and professionalism were greatly appreciated. They personally helped dispel some of thenegative stereotypes of the European service industry. Our room was tastefully modern and very comfortable. We were off the noisy \"main drag\", but near enough to walk to a bus or the Metro for our sightseeing needs. Keep up the good work!!", "Date": "June 24, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "3", "Rooms": "5", "Location": "3"}, "AuthorLocation": "Kingston NY", "Title": "“Fantastic Breakfast”", "Author": "Maryjpark", "ReviewID": "UR67457405", "Content": "The rooms were clean, hotel staff very helpful and friendly. Breakfast buffet was excellent. Use of computers .A 5-10 minute walk to the Metro and restaurants. We loved the little Brassiere across the street from the hotel and a Pattissere next door. You do have to walk aways to eat. A little noisy if AC not on and windows open.", "Date": "June 14, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "3", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Cardiff", "Title": "“Bit overpriced but great location”", "Author": "LadyWotLunches", "ReviewID": "UR66692160", "Content": "We stayed here for a few nights at the beginning and end of our trip to the south of France. I e-mailed the hotel directly (using my best French!) to find out availability and they came back with a cost per night that was half that of the prices being advertised on all the usual websites, including the hotel's own site. This could be an excellent way of getting a good rate for a hotel that would otherwise be really overpriced. The location however is next to none. Coming out of the nearest metro station to the hotel, you're confronted by the view of the Eiffel Tower which was brilliant. There's a little bar across the road (which does shut very early) and a lovely patisserie and cafe for the full French breakfast experience on the street heading left out of the hotel. All in all, it was a pleasant stay at this hotel (staff were brilliant) but just try and get the best deal that you can.", "Date": "June 7, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "London", "Title": "“Great location and very helpful staff”", "Author": "Sneha23", "ReviewID": "UR64404863", "Content": "My husband & I stayed here for 2 nights and have no faults with the place! It's in a great location - 10-15mins walk to the Eiffel Tower, 5 minutes walk to Trocadero Metro station and near some great bars, cafes and restaurants. Sophie welcomed us when we arrived and suggested an excellent order to see the sights we wanted to see given we only had 2 full days to see a lot. Sophie also recommended a restaurant to eat in the night we arrived (Jamin nearby) - she also made a reservation for us whilst we dumped our bags. I have seen comments that say the rooms are small - we found that there was plenty of space to walk around and put our bag down etc (we had a standard room) - also what more do you want when you just need a base to stay in and will be mostly out and about seeing the sights? We didn't eat breakfast here - Sophie also suggested some restaurants for brunch when she knew we wanted to eat out rather than in the hotel. The hotel is in a nice and quiet location despite being so close to a main road and metro station etc. If we go back to Paris we'd stay here again!", "Date": "May 17, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "3.0", "Value": "5", "Sleep Quality": "2", "Rooms": "2", "Location": "3"}, "AuthorLocation": "Pittsburgh", "Title": "“Okay sums it up”", "Author": "scholnicks", "ReviewID": "UR63423932", "Content": "Plaza Tour Eiffel is a nice modern hotel in a quiet Paris neighborhood. Despite the name it is not close to the Eiffel Tower (a 15 minute walk). Yes it is close to Trocadero metro stop but that is about it. There are some nice cafes/restaurants in the area. We did not try the breakfast buffet (it cost 18 euros, way over priced. Go next door to the tasty bakery). The room is very very small, barely bigger than a cruise cabin. The bathroom is tiny, and the shower is a joke. It barely functions as a shower. Despite going in April, it was quite hot in Paris (>75F every day). Our air conditioning was set on 17C (~ 63F), but it was not cooling the small room at all. We had to open the window and run the air to get any kind of relief. The staff is very friendly and the they all spoke excellent English. The free wifi was stable and easy to use from our iPhones. Be warned check in time is 2 PM.", "Date": "May 6, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Bushey, Herts", "Title": "“Great hotel....but I can't wait for the Euro rate to go up..!”", "Author": "HollyLovesMrTumble", "ReviewID": "UR59863016", "Content": "Like the vast majority of previous reviewers I found it difficult to fault anything about the Plaza and I'm so pleased I always take the time to look at this site before I book anything. I know we can't always have the same taste but there were so many positives that it seemed a bit of a no-brainer. It was clear from the welcome that we received that service is a top priority. Sophie welcomed us and although we were early she kept our luggage and then gave us a map and advised us on how to get around. The tube map can look very intimidating at first but its just as easy as the London Undergound once you've been on it a couple of times and the service is really quick and the stops seem to be so close together you can move about town really quickly. This will sound a bit repetitive but, as the others have said, the hotel is 2 minutes from the Trocadero station which is also 3 stops from the Arc De Triomphe. We also went to Sacre Coeur and Montmartre both of which are unmissable and also only about 20 minutes or so away on the Metro. As we were only away for a long weekend it was difficult to see all the sights but we got a boat trip in and a trip to Notre Dame but missed out on seeing Versailles which my wife hasn't visited before. Breakfast in the hotel is plentiful; meat, cheese and a variety of cereals and yogurts plus a hot tray with bacon and scrambled egg. Again, service was always very polite and efficient. We had a deluxe room and expected it to be slightly small, as all European cities tend to be, but we spent little time in it anyway. It was still decorated and furnished very tastefully and the bed was extremly comfortable. I must echo the 'shower' problem. Its difficult to imagine how anyone came up with this concept but you should just acknowledge that you will be better off holding it rather than take the chance of swimming back to the bedroom...!! A special mention to Sophie on reception who was possibly the friendliest member of staff I have come across and it makes such a difference to be welcomed so warmly every time you enter the hotel. Overall, whilst I couldn't really fault the hotel, Paris is a very expensive place to stay. Most places we visited charged around £2.50 for a coke, £4 for a coffee and between £6.50-7.50 for a bottle of beer. It was clearly a more reasonable place to stay when the Euro was up at around 1.50 to the pound but at the moment you don't get a lot for your money...! If I did visit again though I would definitely use/recommend the Plaza.", "Date": "March 29, 2010"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "Norwich - Great Britain", "Title": "“Great little hotel”", "Author": "Robert_29", "ReviewID": "UR58957815", "Content": "Don't really write reviews for hotels but Stayed at the Plaza Tour Eiffel and I'm compelled to share my experience so that others can benefit from this top little hotel. Its walking distance to both the Eiffel tower and the Arc de Triumph and there really is no need to get cabs anywhere as a; they cost a fortune trying to navigate round the hideous roads of Paris and b; because you have a metro station on your doorstep (Tracadero). I phoned the hotel upon arriving at Charles De Gaulle and they talked me through how to get a train to them, again saving us a fortune in unnecessary cabs. The next day the helpful staff, whom I’m sure if I’d of asked them would of polished my shoes whilst making me a cup of tea and ironing my shirt, advised me to take the metro round the city and the receptionist even walked me to the shop to help buy my metro tickets... how many hotels would even bother, they would just get you a cab as it’s easier for them! The hotel is small and far from palatial but you don't come to Paris to sit in your room. It has everything you need, free wifi which worked perfectly with my Iphone, tidy, clean comfortable rooms in a central location. Don't bother blowing hundreds of pounds on some flash gaff, go here. I would recommend dinner at Le Coq, just round the corner, the snails are awesome. In a city that is full of somewhat rude, grumpy Parisians who's frosty hospitality can often be the accepted norm this hotel offered a refreshing opposite to the stereotype you come to expect. Go here, you would have to be super picky to fault it, and that's coming from someone with OCD.", "Date": "March 19, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "hotelsnob2", "Title": "“The Best Service”", "Author": "hotelsnob2", "ReviewID": "UR57338915", "Content": "This hotel is committed to service. I've never received this level of service in France at this price range of hotel. The employees are very friendly and willing to go the extra mile for you. A very professional staff. The only negative would be the shower. It is difficult to wash your hair without getting water everywhere. So make sure you don't bring your dry clean clothes in the bathroom with you. I would absolutely stay here again as it is a very well appointed hotel with an outstanding staff.", "Date": "February 28, 2010"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "", "Title": "“nice secluded hotel in residential area”", "Author": "jacobsterner", "ReviewID": "UR55651020", "Content": "Nice, clean hotel in quiet neighbourhood. Very friendly and helpful staff! Close to metro (Trocadero), otherwise cheap enough to take taxi wherever we were going in the city.", "Date": "February 10, 2010"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "London, United Kingdom", "Title": "“Plaza Tour Eiffel - April 2009”", "Author": "SamrahQ", "ReviewID": "UR53435955", "Content": "This hotel was in an ideal location. The closest Metro station was 5 minutes walk and the Eiffel Tower, Champs Elysee and Arc de Triomphe were all within 10 minutes walk. The hotel staff were very helpful in places to go and where to eat and taking care of you during your stay. Buffet breakfast was yummy, a good selection for everyone (especially me as i'm not keen on red meat, which seems to be everywhere in Paris) and the staff serve you hot beverages and food is warm. i would definitely stay here again and have recommended it to friends.", "Date": "January 14, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Texas", "Title": "“Cozy and close to everything!”", "Author": "TX2theworld", "ReviewID": "UR51357309", "Content": "My husband and I just returned from a (first-time) short trip to Paris. We found the Plaza Tour Eiffel online at Hotels.com and the great price (considering the awesome location!) is what sealed the deal for us. The staff was super friendly, and the front desk guys spoke very good English. The hotel was clean, modern, and so quiet- which was a welcome evening respite from noisy streets, trains, shops and restaurants all day long. Good breakfast- ours was included...check your reservation for that. TIP> there is also a fantastic bakery (open M-F) right next door! The hotel staff were able to recommend fantastic restaurants (authentically French) and really answered all of our questions with much more grace and tolerance than anyone else we met in Paris. This hotel is only a 5-10 minute walk from the Trocodero and Metro- which is also directly across the Seine from the Eiffel Tower. The tower is visible just a block from the hotel. Surprisingly, for being so close to everything, i will say again that the neighborhood is so quiet. It is quite likely that we would stay here again.", "Date": "December 16, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Location": "5", "Rooms": "4"}, "AuthorLocation": "MA", "Title": "“Lovely, modern hotel with a wonderful staff in a great location.”", "Author": "DiMontebello", "ReviewID": "UR51166025", "Content": "Stayed here for just two nights while traveling Europe, but wish we could have stayed longer. Very hip, modern hotel without being pretentious. Located on a quiet street just off the Trocadero (four minute walk). We stayed on the fourth floor in a deluxe room that we could see the Tour Eiffel from if we leaned out the window a bit. We booked last minute so we didn't expect a higher floor with a great view, but I honestly have NO complaints about the room location or view! For a deluxe room it was small, but I know that's what to expect. I've been to enough European hotels to know. I'm afraid to see what a classic or superior room looked like though! Bathroom was a good size, lovely beveled subway tile, modern sink and amenities. Nice closet with robes and slippers. We had a space just for luggage, and there was a desk and a second sitting area. Nice flat screen TV, though only two channels in English. No biggie. Bed was comfortable and the pillows were giant fluffy clouds... The lobby was beautiful and is where they have a little bar for drinks or tea and a nice sitting area with lots of books. No mini-bar in the rooms, so this is the alternative. My wife got some wine while we relaxed before leaving for our flight and they brought it to us and gave us a little bowl of chips. Very nicely done. Breakfast room is very nice as well. Nice little continental selection. It was included and it was a nice start to the day. Decorated so nice we are going to mimic the style in our front hallway! The hotel is located about a ten minute walk to the Eiffel and about 20 minute to the Arc. A Metro stop is right at the Trocadero and the system gets you EVERYWHERE. We caught a double decker tour bus for 24 euro per person and it's good for two days. It beings you to the Louvre, Grand Palais, Eifel, Arc, Champs, etc. Good way to get around for a short trip to see some major sights. Ok....on to the personnel. Just like everyone else, we got nothing but OUTSTANDING service from the people here. The woman that first checked us in (sorry for forgetting her name) was a pleasure and extremely helpful. she made some nice dinner recommendations based on my wife's craving for a fancy French duck diner. They all went out of their way to speak English, give us directions and suggestions. Daniel helped us at the front desk and with our bags. Always smiling and very friendly. George went absolutely OUT of his way to help us. He was getting off work when we were headed to a shuttle bus a way's away to get out to the Beauvais airport, and he took us on the tram and the RER train line to our stop and even helped pay for our tickets!! What hotel would EVER have a staff member go out of their way like that?? NONE. Enough cannot be said for the graciousness of the staff here. I would absolutely recommend this hotel for anyone who wanted to stay in this area of Paris near the Tour Eiffel and wanted a quiet, extremely clean and modern hotel with amazing service.", "Date": "December 13, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "4", "Rooms": "4"}, "AuthorLocation": "New Jersey", "Title": "“GREAT BOUTIQUE HOTEL”", "Author": "RonNewJersey", "ReviewID": "UR50579694", "Content": "Had a great stay. We planned to stay 3 nights and ended up staying 7. The hotel is in an upscale residential neighborhood. The rooms are newly renovated, clean and stylish. The best part of this gem of a small hotel , however, is the staff who are courteous and professional.", "Date": "December 3, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "3", "Location": "4", "Rooms": "3"}, "AuthorLocation": "Dunedin, New Zealand", "Title": "“Great service, small but comfortable rooms”", "Author": "nzamy", "ReviewID": "UR47111452", "Content": "I returned for my second stay (first in June 2009), both for work so had no choice in where I was staying - but was a good location for me as I had to attend the OECD each day, but perhaps not the best location for tourists. In saying that however, 5-10 mins to the Eiffel Tower, and 15 or so minutes to Arc de Triomphe and Champs de Elysse. Plus 3 minutes to the Troccadero metro and you're off really. Also has lots of nice wee places to eat around the hotel (excluding the Troccadero eateries, which are busy, but overpriced. Look down side streets for nicer places). Excellent and friendly service. Didn't eat at the hotel for breakfast (and no fridge in room) but an excellent pastry shop right next door. Rooms are small, but comfortable beds, free wifi, flat screen tv, and good storage. Bathrooms are awful - very modern but the way the shower is set up it completely floods the room each time you have a shower, so I had to always move all my bathroom stuff off the shelf as otherwise it would get wet, and use a towel to cover the floor and toilet to avoid them becoming completely wet. If that could be fixed it would be a lot better! Would recommend this hotel based on friendly service, quiet and safe neighbourhood, and pretty comfortable rooms. However if you want to be a bit closer to the action perhaps this won't be for you.", "Date": "October 17, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "5.0", "Value": "5", "Location": "4", "Rooms": "4"}, "AuthorLocation": "Mountain View, CA", "Title": "“Clean and modern hotel. Great, friendly staff in a residential area. Close proximity to the Eiffel Tower”", "Author": "WestBayBanjo", "ReviewID": "UR40633295", "Content": "My wife and I stayed here for 4 nights. The Plaza Tour Eiffel is located within a 5 minute walk from the Trocadero metro stop. It's also conveniently located within walking distance from the Eiffel Tower. There's a great pastry store right next to the hotel, and there are numerous restaurants and cafes within walking distance. First off, the staff was very friendly and welcoming. Everyone spoke english and were very willing to help us with any questions we had. They helped us get reservations at L'Epi Dupin, which was/is a great experience. The room was just as advertised here on TA. The bed was very comfortable, free wireless access, and AC. The bathroom was modern but small. We didn't spend much time in the room since we were out all day. But, it was definitely a comfortable room to be able to relax and rest after a long day of activities. I'd highly recommend this hotel if you enjoy staying away from the touristy areas of the city. The 16th district is a little bit far away from the center of the city (like 1/2 hour metro ride with transfers), but if you're okay with that, this is a great find.", "Date": "September 10, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Location": "5", "Rooms": "3"}, "AuthorLocation": "Scottsdale, AZ", "Title": "“Great Location, Clean & Comfortable Rooms and Great Staff”", "Author": "Chillhawk", "ReviewID": "UR35745397", "Content": "Hotel is in great proximity to Metro, restaurants and a short walk to the Eiffel Tower. Staff was very pleasant. Rooms were small but bed and pillows were very comfortable. Quaint area was quiet but yet only a few minutes from the Trocadero metro stop. Had a great time with a wonderful tour guide, my daughter who had just spent 6 weeks in an university abroad program and couldn't have enjoyed Paris more.", "Date": "July 25, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Peterborough, United Kingdom", "Title": "“Great Location, Friendly Staff & Comfortable Rooms”", "Author": "Chasbee", "ReviewID": "UR35161023", "Content": "We stayed at Plaza Tour Eiffel for 3 nights in Mid-July as part of a Eurostar package and chose this hotel from the many on offer, our choice based on the reviews on trip advisor. We arrived at Gare Du Nord from St Pancras ( We had purchased Paris Metro tickets at the Eurostar Terminal St Pancras) and travelled on the Paris Metro to the Trocadero, the hotel is no more than a 3/4 minute walk from the Trocadero metro station. We arrived before the scheduled check-in time but were allowed access to our room on the 4th Floor. The room was clean, fresh and well furnished, after all when you are on a visit to Paris very little time is spent in the room other than for sleeping and showering. As others have said the shower heads do need to be carefully directed if you are not to spray the floor. ( We had used the toiletries after the 2nd day but they were not replenished, we bought our own) Apart from this minor gripe we had no complaints. The bed and pillows were clean and very comfortable making for a good nights sleep after a hard day trekking the streets of Paris. The air conditioning worked very well and we were able to return to a nice cool room during what was very warm spell of weather. The hotel is well placed and we managed to walk to most of the tourist sites without too much effort,(eg the Eiffel Tower can be reached in about 5-6 minutes) we heard no noise from the streets or indeed from other guests on the corridors. All staff were extremely polite and helpful and a credit to the hotel. The provision of their own map of places to see/eat with an idea of the budget required was very useful as was the wider map of Paris given to us on check in. We didn't eat at the hotel so can't comment. We took breakfast at a nearby brassierie within a minute of the hotel at the Place de Mexico which was very good value for money. We tended to eat in little bistros or brasseries in side streets as these were considerably better value than those located around the Trocadero who charged a lot more for food, beer and wine. Overall if you are looking for some where clean and comfortable in a good location then I wouldn't look for anywhere else. We would readily return to this hotel.", "Date": "July 19, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Seattle", "Title": "“Love this hotel!”", "Author": "shellclan", "ReviewID": "UR34098844", "Content": "I recently stayed here and found it to be a wonderful experience. From the moment we arrived, we were instantly helped with luggage from the very friendly and helpful staff. (Here's to you Daniel and Mohammed!) It is a short walk down the street to the Trocadero where you have a spectacular view of the Eiffel Tower. My adult children and I had no problems at night walking here. There is a great boulangerie (bakery) next door and a wonderful grocery/shopping area just down the street. Just ask the front desk, they will let you know. The rooms are lovely, free wi-fi and nice flat screen tv. The bathroom shower/tub is a bit small but I found that to be the case in Spain as well. I will definitely stay here again when I return!", "Date": "July 7, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Location": "3", "Rooms": "3"}, "AuthorLocation": "Antwerp, Belgium", "Title": "“Okay.”", "Author": "EUEx-pat", "ReviewID": "UR33868582", "Content": "We stayed at the Plaza Tour Eiffel for 2 nights in April 2009. We (my boyfriend and I) were in Paris for the long weekend and this was our fourth time to this city and we really haven’t found a hotel in Paris that we would come back to so we decided to give this one a try based on the reviews on TA. Transportation We drove to Paris for the weekend. We parked on the street through the advice of the hotel staff. There were no signs forbidding parking or any signs indicating anything of that nature and needless to say…we got towed on our second day. We know from experience there is no such thing as free parking but we paid the price anyway. Getting our car back was a surprisingly painless process. It is much cheaper to park in the nearby garage Ave Foch. We walked around the city for the rest of our stay and used the metro twice (stations Trocadero or Passy). Neighborhood The hotel is in a residential area and not near any of the main tourist attractions. It seemed to be safe as we walked back to the hotel at night. The metro stations are about a 10 minute walk if you have to go further. Great views of the Eiffel Tower are nearby. The location was ideal as this was a return trip to Paris for us but we wouldn’t have chosen it for our first time here. Room (photos included) We had a standard double room and our rate was €162 as an average per night for the weekend (including breakfast). We booked the hotel through the hotel website. The room was small and the décor was modern. The bed was a queen size and comfortable. The room was equipped with a desk, chair, TV, safe and wardrobe. No fridge was in the room. The room was on the warm side due to unexpected temperature for April and the air conditioner did not help keep it cool – we opened the windows and that helped. Bathroom (photos included) The bathroom was white tiled and modern – photos of it look great but you can tell it is cheaply built. Our bathroom had a shower/tub combination. The bathroom included toiletries and a hair dryer as well. The bathroom was clean. On the outside wall of the bathroom there seemed to be water damage to the wall (see photo). Amenities/Service We did have breakfast one morning. The breakfast was continental with breads, jams, cereal and juice. It was very good. The hotel staff was very nice and when our car got towed they did help us write a letter of contest in French to see if we could get our money back – we didn’t get it back. Overall the hotel was suitable for what we wanted. I give it a rating of three because of the wall damage and there was nothing beyond what we expected. It was just an okay stay with the unexpected high fee for parking!", "Date": "July 4, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "2", "Location": "5", "Rooms": "2"}, "AuthorLocation": "Tulsa, Oklahoma", "Title": "“You pay the price for a great location”", "Author": "TulsaTraveler0807", "ReviewID": "UR33576052", "Content": "My husband and I visited the hotel during a two-week European vacation. I had very mixed feelings about the hotel. It has a fantastic location. You are a block from Tracadero and only 2 blocks from the Eiffel Tower. However, the rooms looked worn and the room seemed expensive in comparison to what we received. In the end the wonderful staff and great location won me over on the hotel. After having a travel nightmare trying to get into Paris, we were greeted by a wonderful staff. We flew into CDG at 9 PM. Little did I know that we were flying into Terminal 3, a small charter terminal. We walked over Terminal 2. I must admit we were not very prepared for our arrival. I didn’t have any Euros at this point because we had flown in from Prague, and we thought we could get a better exchange rate in the Paris airport. However, the only exchange place open was back in Terminal 3. We decided not to walk back there. I assumed it would be easy to catch a cab, but the only option there was the train or metro. We decided it would be easiest just to get on the metro since we had a metro map in our travel guide, but we didn’t have any info on the train. I’m sure the train would have been faster, but it took us an hour and one transfer to get to the hotel (while lugging around 2 big suitcases and 2 carry-ons). Once we got to the Tracadero stop, we weren’t sure which direction to go to the hotel (it is down the street to the left of the row of cafés facing Tracadero). Once we got to the hotel, I realized I had only booked the room for one person. The staff was great! There wasn’t any problem adding my husband to the room. I also had them arrange for a car to pick us up to take us back to the airport. I was not about to try the metro again with the suitcases. We rode in a nice Mercedes taxi with a friendly driver. We chose not to pay the 18 Euros a person for breakfast. I wanted to try as many restaurants and café’s in Paris as possible during our 3-day trip. I discovered a wonderful bakery right next door to the hotel. We would grab a croissant in the morning then walk to Tracadero to take our daily picture in front of the Eiffel Tower. I thought if we took a picture each day, we would have at least one good one. Also, previous reviews mentioned a supermarket down the street from the hotel. We saw several small markets, so we thought we found it. On our last day there, we found the actual supermarket. If you take a left out of the hotel, and go around the round-a-bout so you stay on the same street there will be a shopping center down on your left. There was a supermarket and a Paul bakery. We got a wonderful snack and some well priced wines from there. There is not a corkscrew in the room, so we just bought one at the market. We couldn’t find one in any of the other shops around the hotel. Do be warned that the stores around the hotel are very expensive. Our taxi driver told us that we were in a very ritzy part of Paris. There were a ton of embassies and nice homes. Also, the hotel is difficult for taxi drivers to find. We would just tell them to drop us off at Tracadero, and walk the rest of the way to the hotel. We did some of the usual tourist things. We went to the Louvre. I had bought tickets online about two weeks before our trip. There was enough time to have them delivered to my house, and it saved us a wait in a long line. We walked to the Louvre from the hotel. It only took about 20 minutes. We had a nice stroll along the river and through the Place de la Concorde and Tuileries Gardens. The museum was very crowded so we only went through a few rooms and saw the Mona Lisa and Venus de Milo. After leaving the museum, we had my favorite meal of the entire trip. We went to Angelia. It’s a tea house on the Rue de Rivoli. It’s only a few minute walk from the Louvre. I had a wonderful quiche, and the best hot chocolate I’ve ever tasted. My husband and I shared a small pot of chocolate and their signature desert called a Mont Blanc. It was more than the two of us could eat. One last warning on the hotel. I never considered showering an Olympic sport until I stayed here. The bathrooms are very modern. We had a showerhead like I had never seen before. It was tall and thin, and the water pressure would cause it to turn. This would not have been a problem, but in every European hotel we stayed in there was only a small glass door that was attached to the wall and no shower curtain. This one had the smallest door of them all. We would drench the bathroom every morning. Since the hotel only provided two towels, this made for an interesting morning. The hotel also provided a computer with free internet in the lobby and L'Occtaine bath products.", "Date": "June 30, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "UK", "Title": "“Great hotel in a fantastic position”", "Author": "ErikG", "ReviewID": "UR31542855", "Content": "We travelled by eurostar and arrived at Gare du Nord, from there a 2 min walk over to Gare du L'est to catch the number 30 bus which goes to Trocadero which is a couple of minutes walk to the hotel. Very easy trip and cost all of €3.20 for both of us. We booked through Expedia so not sure of the room designation but presuming it was a standard room it was very nice, if not a bit small but since we were out all day it was absoulutely fine. There is working quiet air con, a safe but no mini bar or coffee making facilities, we always take our own travel kettle as that seems the norm in most hotels these days, the other half does like her morning cuppa! We had a complementary bottle of water in our room, we found a selection of shops next to the hotel to get other water, fruit etc. Room was always cleaned and re supplied each day and the bed was very comfortable, we slept very well, though I'm sure walking round Paris, eating fab food and drinking loads of wine may have had something to do with it. We just had the express breakfast they serve in the foyer which was all we wanted and cheaper than the full breakfast, coffee/tea, small croissants & pain au chocolate, orange juice, tasty and enough to keep you going til lunch. Staff were very friendly and helpful and all spoke good english. We arrive early and they were happy to keep our bags safe till we could check in, as they were to let us leave them the day we checked out to pick up later, inc using the washroom. There is no lounge as such, the reception doubles up as the bar, though there is a small seating area you can use to read, have the express breakfast or just a drink. Some free newspapers are available and also there is a free PC for internet access. There are shops locally, a bakers next door, fruit shop 20 metres, pharmacy etc etc all very near. Bus and Metro stops very close (couple of mins by foot ), as is the Eiffel Tower (5 mins), Champs Elysee / Arc du triomphe (5 Mins).... great position. We would deffinatley recommend this Hotel and would not hesitate to stay there again.", "Date": "June 4, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "4", "Rooms": "5"}, "AuthorLocation": "Bath - UK", "Title": "“Excellent Hotel, quiet location, great breakfast, good restaurants close by”", "Author": "sportycouple", "ReviewID": "UR31207376", "Content": "Arrived at CdeG airport. RER Train to Denfert-Rochereau station and Metro 6 to Trocadero. 8 minute walk to Hotel. Metro 9 from same station for Roland Garros Tennis. All very easy. Total cost from airport to Hotel 10 euros. We stayed in a deluxe double room that was very nice and had all we needed. No mini bar or coffee making facilities but that does seem the norm for a lot of Paris hotels. Small bottle of water bought from reception was 4 euros so best to buy your own and bring with you. Sheets changed each day and bed was very comfortable. No complaints whatsoever. Breakfast was very good and excellent choice including bacon/scarmbled egg as well as croissants, ham, cheese, bread, juices, cerials, fruit, etc. All you would expect Staff all spoke good english and very polite and attentive. Gave good directions to get to the hotel and knew of some very good restaurants nearby. No Evening Meals at the Hotel. We ate in a typical french restaurant one night recommended by Hotel that worked out at approx 50 euros per head and was superb french cuisine. 5 mins walk from Hotel and away from normal tourist area. No lounge as such as reception really doubles up with a very small lounge seating area but we did not need this as we were out all the time. 3 Banks within 2 mins walk so cash machines readiliy available. Also a good Bakers one minute from hotel so if you need to stock up with food for the day then it is ideal. You could walk to Eiffel Tour and elsewhere if you were energetic. Otherwise Metro at 1.5 euros per trip was very easy. We would recommend this Hotel and would not hesitate to stay there again. We had 3 nights. It is not on a main road so very little traffic noise. As far as we were concerned - couple mid 50's - absloutely ideal.", "Date": "May 31, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "pennsylvania", "Title": "“Excellent hotel, location & staff”", "Author": "shelleypa", "ReviewID": "UR30677863", "Content": "Just back from Paris -this hotel is just as described. Excellent location, close to attractions & metro but in a quiet neighborhood setting. The rooms are small (expected in Paris) but beautiful with modern bathrooms and L'occitane bath products. The staff could not have been more accomodating and helpful and all spoke excellent English. Loved eating in the recommended restaurants a very short walk away. Breakfast is included and was suprisingly good (they even had scrambled eggs -unusual in Paris), served in a lovely dining area. Included wi-fi. Highly recommended.", "Date": "May 24, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Location": "5", "Rooms": "3"}, "AuthorLocation": "Budapest", "Title": "“Great location, great value for money”", "Author": "chic0ze", "ReviewID": "UR30570906", "Content": "First time in Paris. I have chosen this hotel based on tripadvisor reviews and on a quick websearch for good prices. I arrived to the airport Charles de Gaulle and my initial plan was to take the train to Paris. The queue was so long to buy the train tickets that probably would have taken more time than the flight itself. I decided to go by taxi, which, at the end, came at 42 EUR. Someone called this a \"boutique hotel\" which is probably a good review. The hotel is small and rooms are small as well, and you will find it difficult to sleep together with your luggage which you will probably try to stuck it under the table next to the tv. No minibar in inside the room where I stayed. Now for the good things> Great location 5 minutes from Trocadero, in a quite area (the 16th district iis THE district in Paris) Reasonable breakfast with delicious croissants and orange juicei Free wireless connection to the internet Friendly staff As you will not spend too much time in the hotel, as Paris has unlimited offers and possibilities for everything this hotel is a very good value for money I would highly recommended it to everyone staying 3 or 4 days in Paris!! I loved beautiful Paris! Great food!", "Date": "May 23, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Location": "4", "Rooms": "5"}, "AuthorLocation": "Johnson City", "Title": "“Excellent Hotel!”", "Author": "5EI8008", "ReviewID": "UR30529456", "Content": "Our stay here was most excellent. The sharply dressed staff were very professional, very knowledgeable about restaurants and attractions (wish I could remember the young man's name we spoke with every morning - he was really helpful and spoke perfect English), and were all very courteous and cheerful. We were always warmly greeted upon entry, champagne was delivered promptly when ordered, and I can't speak highly enough about the level of service at this hotel. The hotel is only about an six minute walk from the subway station (at the Trocadero), and located on a quiet side street in a nice neighborhood close to the main hustle and bustle of the Trocadero (pretty much an ideal location). Plenty of restaurants and a small market were also within a short walk. The room itself was very modern, everything felt very new and meticulously cleaned, and was very comfortable and spacious by European standards. We had a corner room three floors directly over the entrance, so we had a nice view of the (fairly quiet) intersection below from the huge window. The amenities were very nice, our room refreshed and straightened daily, and the bed and pillows very comfortable. A complimentary bottle of water awaited our arrival the first afternoon, which was a nice touch. Breakfast was always good, and we even enjoyed mingling with the other guests (who also seemed to be enjoying their stay - Hello again to the ladies from the Newseum in DC!) Overall, this was a very clean, well maintained, ideal hotel to stay at. I would highly recommend it to others, and will look for it again on my next visit.", "Date": "May 22, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "cardiff", "Title": "“Superb Boutique Parisien Hotel With Perfect Location”", "Author": "ubizydotcom", "ReviewID": "UR29486251", "Content": "Would like a hotel 5 mins from the Eiffel tower? Would you like a boutique hotel at 3 star prices? Would you like superior service? Would you like a hotel where you would want to visit paris over and over again? We stayed here on Sat 2nd May to Tues 5th May. Thanks to the reviews on tripadvisor! Sophie on reception was so friendly, warm, but most of all informative. Our room had a view of the Eiffel Tower! Ive been all over the world, and always look for a fabulous hotel...but more importantly... location and value for money Highly recommended!", "Date": "May 6, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "2", "Location": "3", "Rooms": "3"}, "AuthorLocation": "San Francisco", "Title": "“Did Not Live Up To Its Billing”", "Author": "whachmacallit", "ReviewID": "UR29111855", "Content": "Stayed here 5 nights in April; the interior was overheated and the AC did not work. We slept with our one window open but were awakened early every morning by the noise of daily garbage collection. Our \"Deluxe Room with sitting area\" was a joke! There was a single straight backed chair shoved into a corner with a cheap table the size of a pregnant pizza pan, blocking the only mirror and preventing us from opening the window. We'd hit our shins on it unless we shoved it under the desk. For this we were charged an extra 22 euros per night. The staff was friendly but gave us bum directions to the RER station for a Versailles excursion. The desk clerk also failed to tell us until check-out that breakfast had been included in our room rate--too bad, too late! They had told our booking agency, Hotels.com, that breakfast would be an extra 15 euros per person/day so we ate there only once. I had even sent a fax inquiry before departure, but the hotel never responded. The hotel fails to list a phone number anywhere in their internet material. They did charge us 4.50 euros per cup for coffee at the reception desk. We had read a guest comment in TripAdvisor that the coffee at the desk was complimentary. Don't believe it. The bathroom was all style and no function. The lighting and mirror were poorly placed so hubby needed binoculars to see how to shave and I couldn't get close enough to see the back of my head even with a hand mirror. The shower looked sleek and chic but always got the floor wet and didn't spray very well. The hot water ran out and my shower turned cold one morning at 8:30 a.m. Two people can't fit in the bathroom at the same time, unless one stands in the tub, and you can't reach the towel rack without closing the door. The floor was sticky our first night, so I washed it with the tub mat. Storage space in the room was crappy--no drawers at all in the room or bathroom and the closet was cramped. But, the bed was comfortable and internet was gratis. Had this place not been billed as #19 out of more than 1000 Paris hotels on Trip Advisor, I would have said it was ok for a Paris hotel. But with such a high rating, we expected more and it certainly did not deliver!", "Date": "April 30, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Location": "5", "Rooms": "4"}, "AuthorLocation": "park city, ut", "Title": "“Wonderful botique hotel, great staff, quiet neighborhood.”", "Author": "flyjets", "ReviewID": "UR28175874", "Content": "A great hotel (about 43 rooms) very close walking distance to the Eiffel Tower and the Seine. Located in a very quiet residential neighborhood, but close to small shops and restaurants and the Trocadero. Easy walk to the Arch de Triumph and The Champs-Elysees. Metro station is less than a five minute walk and easy access to CDG airport. Free wifi throughout hotel, nice fitness room, but more importantly a great and helpful staff that speak excellent English. We originally planned to try some other hotels, in other locations, during our 10 day trip, but the hotel and staff met our needs and we didn't want to be disappointed elsewhere.", "Date": "April 16, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Westchester County New York", "Title": "“Very satisfied”", "Author": "Armonk", "ReviewID": "UR26554643", "Content": "My family of 5 just finished a four night stay in two rooms at this hotel. We were very pleased. The staff was consistently very helpful and kind to us -- and we asked MANY questions, all in English. They answered all my emails before I arrived and made reservations for us at a couple of restaurants -- one was particularly special. We left behind an item of jewelry and they called us en route to the airport to let us know they had found it and then shipped it to us promptly. I am very grateful to them for their gracious hospitality to us throughout the entire stay. The rooms were small but had everything one could want. The beds were very comfortable. The shower enclosure is small by US standards but one can figure out quickly how to position oneself and the shower nozzle to avoid splattering the room with water so it was not uncomfortable. I will say that the street outside our room was noisier early on the weekday mornings than I had expected from the reviews. I recommend keeping the windows shut on weeknights. On weekend nights the street was very quiet. The hotel serves a very satisfactory full breakfast for 15 euros and there are multiple decent alternatives within a 5 minute walk if one desires a change. That is true for lunch and dinner as well ( the hotel does not serve either but will arrange for a local deli to deliver items to your room). The hotel is on a corner (rue Greuze and rue Sablons) in an otherwise residential area, a five minute walk from the Trocadero, where there are several museums and a Metro stop for the 6 and 9 lines, and most of all, at the Trocadero, one is just across the Seine from the Eiffel Tower. Then, about 20 minutes in the opposite direction is the Arc du Triomphe and the beginning of the Champs Elysees. The hotel called taxis for us regularly and they arrived within a few minutes. If you do not speak French well, I recommend taking something with the hotel's address on it as it is not a well-known street. So I definitely recommend this and hope you find this review helpful.", "Date": "March 21, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "4", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Hampshire", "Title": "“Peace and quiet, perfect location”", "Author": "lilly57", "ReviewID": "UR22502056", "Content": "Our first visit to Paris, we chose this hotel after reading the reviews on this site and we were not disappointed. The hotel is clean, staff friendly and helpful. The breakfast was good with a good variety of breads/cereal/fruit to choose from, and a few hot cooked items as well. The room we were given was well furnished and comfortable, although a little small compared to rooms in other cities it was more than big enough for two. The location of the hotel was super, a short walk from the Trocadero with a good selection of restaurants to sample, and close to the Eiffel Tower. We will be back!", "Date": "December 6, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Salt Lake City Utah", "Title": "“Lovely hotel in a quiet section in Paris”", "Author": "jewelSLC", "ReviewID": "UR21976210", "Content": "Just returned from a week stay in Paris at the Plaza Tour Eiffel. I usually do not write reviews but the staff were so nice and helpful I thought it was necessary to let others know about this great hotel. The hotel is located about a ten minute walk from the Eiffel Tower and is in a very quiet part of Paris. It is a good break from the crowded streets at many of the city sights. The rooms are very clean and modern. The room we stayed in was a typical Paris hotel room size but it was comfortable and we had a view of the tower from our window. The staff are very helpful and polite. All speak English and do not seem to mind multiple questions and requests. We particularly appraciated Daniel, Mohammad and Sophie. I would definately reccomend this hotel.", "Date": "November 18, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "4", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Mountain Top, Pennsylvania", "Title": "“Staying with the Residents in Paris”", "Author": "MTNester1957", "ReviewID": "UR21975608", "Content": "This was our first trip to Paris, and we only had 3 days. I wanted to find someplace special that wouldn't cost us our house! After reading the reviews here, I was fairly confident that we had found the right place....and we did. When we visti other countries, we prefer to stay in places that will allow us to experience a piece of native life....the Plaza Tour Eiffel does that. The hotel is located in an upscale residential area. At 8 AM, watch the mothers and fathers walking their children to school; by 10 AM the older women are walking to the markets. If you head towards the Trocadera, you will pass the Thailand and Spanish Embassies. If you head toward Place de Mexico, you'll pass a local bakery, boutiques and fresh fruit market. We spent every evening sipping wine and eating cheeses at the various bistros at the Trocadera which is a few minute walk from the hotel. There are very few tourists there (relatively speaking), and you'll find yourself immersed in French spoken with the speed of the TGV. (Although all the waitstaff spoke fluent english.) The hotel is lovely. The personnel are helpful in every way, taking our bags from the cabbie and to our room. Our plane came in early, and we were at the hotel at 10:30 AM. we fully expected to leave our bags there and check in later. However, they had a room ready for us which was a treat as we had just come in from the States and were fairly \"fried\". Our room was a bit small because we had a corner room over the front door, but it suited us fine. The bathroom was spotless, of a good size and has a good hairdryer in it! The storage is primarily in a wardrobe - and it did fit the clothing of two people with no problem. The bed was extremely comfortable, as were the pillows. We ended up leaving at 6 AM to catch a flight, and they offered to check us out the night before so we wouldn't be delayed, as well as arranged for a taxi which arrived right on time. Overall, it was a great place to stay...I would recommend it to everyone and anyone. Should we ever be able to return to Paris, I shall stay there again. FYI, the Metro is less than a 5 minute walk away, the Eiffel Tower takes 10-15 minutes to stroll, as does the Batabus, The Arc de Triomphe is about 40 minutes to walk to via the Avenue of New York next to the Seine. The cab fare from the airport was about 45 Euros.", "Date": "November 18, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "4", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "usa", "Title": "“Loved this Hotel - Great Location”", "Author": "marypicc", "ReviewID": "UR21849941", "Content": "Stayed here for three night in September with my daughter and niece. The Hotel Staff made us feel so welcome upon arrival and everyone speaks English. Stayed in the past at several other Hotels in Paris which I would never stay at again. The rooms were very clean and comfortable and the beds were plush very much like our Wyndham Hotels here in the US. If you needed anything they were at your door immediately. This Hotel is in such a convenient safe area close to all the restaurants in Trocadero and the Eiffel Tower and also the Met. I was going next door to a cafe for coffee each day and been charged four euros, when the Hotel reminded me coffee is served there all day free of charge. The Front Desk Manager Kiran Rangoo was especially helpful when I had computer problems and was always willing to help despite the fact that he was very busy. Will definitely stay there again when I go to Paris.", "Date": "November 14, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Perth, Australia", "Title": "“Well located, clean, modern & great staff. Highly recommended.”", "Author": "FPTC", "ReviewID": "UR20548268", "Content": "We are a young Australian couple that got engaged during our trip to Paris. We upgraded to a Deluxe room for our stay. Our experience strongly supports the positive comments made by others. The hotel is located in a very clean, quiet and safe part of Paris. A local taxi driver described it as one of the best spots in the city. It is very close to the Eiffel Tower and within walking distance of public transport. The rooms are very clean and modern; they have obviously been refurbished recently. The bed and pillows were the most comfortable we experienced during our entire trip. Best of all, the staff were outstanding. They are very genuine and went out of their way to be helpful. We greatly appreciate their hospitality and would have no hesitation returning. This hotel is highly recommended.", "Date": "October 2, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "3", "Check in / front desk": "5", "Overall": "5.0", "Value": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Boca Raton, Florida", "Title": "“Great Quiet Hotel”", "Author": "Bocagirl12", "ReviewID": "UR20531043", "Content": "We recently spent four days in Paris and stayed at Plaza Tour Eiffel. The staff was so nice and helpful. The room was bigger than expected and so clean!! The bathroom was spotless everyday. The shower was a little strange but other than that I reccommend this hotel!", "Date": "October 1, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Baton Rouge, Louisiana", "Title": "“Definitive Review”", "Author": "sacoffee", "ReviewID": "UR20350348", "Content": "I guess the title is a little presumptuous but after reading the reviews on TA before we went I think I can help a little more with our review. We went with two other couples to Paris, this is our second trip and the first trip for the other two couples. I travel abroad extensively as part of my job and am accustomed to staying in 4 - 5 star hotels. So when we were looking into this trip I had to consider the other two couples and their spending limits ... so to the web we went. We looked at at least twenty different hotels, going back and forth on cost vs. features, reading every review we could, consulting a travel agent, etc. until we finally settled on the Tour Eiffel. Once the booking was complete I was never really sold as I know what European hotels are like and you typically get what you pay for. The 4-5 star hotels are very expensive but you get the amenities of large bathrooms, comfortable beds, in house resteraunt, room services, etc. Well knowing all this I was expecting the least from the Tour Eiffel, even though the reviews have been good on TA. Anyway, now to the review; we booked the Executive Suite and it is small but with a balcony, view of the Eiffel Tower (top half) we really enjoyed the room. The bed is large and very comfortable, the linens are fresh and crisp and the pillows are full and fluffy. The bath rooms are small. The showers have the half glass partition and it is difficult (no impossible) to take a shower without getting the bathroom all wet. The hot water ran out on me a couple of times during peak shower time (I guess 7-8 am) In other words the rooms are what you would expect for the price and size of this hotel. BUT; the location can not be beat. It is just off the beaten path and you should take a hotel business card with you to tell the cab drivers the address of the hotel. But the Trocedero Circle is about a 5 minute walk with a Metro station and Taxis stand. Right across the street from the circle is the promenade to the Eiffel Tower, about another 5-10 minute walk. We spent a lot of time in this area, laying on the lawn with our brown bags of wine, sandwiches and enjoyed the scenery and weather. The biggest part of this review is to comment on the service of the hotel; the Staff is genuinely friendly, helpful, courteous and professional. They went above and beyond to accommodate us and serve all of our needs. I must especially compliment the front desk staff for this. I bought my wife a dozen roses at a nearby flower shop (Place de Mexico) and as I was walking through the lobby they asked if I need a vase. It was brought to my room promptly with water and sugar for the roses. We asked for wine glasses on one occasions as all three couples met in our room and from then all we had fresh glasses every day. One Saturday night me and the other two men stayed in the lobby until 5 am listening to a College game, they never blinked an eye and kept the bar open for us all night. Anyway, I don't know what else to say to convince someone that this is a great hotel to stay at. If you want creature comforts and 5 star ambiance it is not for you. But if you want to be in the local crowd , close to the Eiffel Tower and receive excellent service then I highly recommend the Tour Effiel. FWIW; we are now at the Intercontinental Le Grand for the last five days of an 11 day trip, the service is not near what it was at this hotel. Other hints; De Vino on Plaza de Mexico is a very good restaurant. Nicolas (wine shop) is off the Place, third street on the left about 100 yds down in a little mall like area. Pataserier is across the hallway for good pastries and sandwiches. The Eiffel Tower restaurant Jules Verne is worth every penny. Normandy is a must see for Americans.", "Date": "September 24, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Boston", "Title": "“Great service, wonderful location!”", "Author": "DRMNSTR", "ReviewID": "UR20154284", "Content": "I booked my boss into this hotel for one night, midway through a whirlwind business tour of Europe. From the reviews I had read it was a reasonably priced property in a good location with very friendly service and I was looking for an oasis in her travels. When my boss checked into the hotel after having spent a few days in back to back meetings in London this is what she had to say. OMG, Room is on tip top floor of front corner with balcony and I can see the tower! The staff practically tripped over themselves in an effort to help me - in a good way. Love this place! Would definitely book her again and recommend it to future colleagues visiting our Paris office.", "Date": "September 17, 2008"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Business service (e.g., internet access)": "4", "Check in / front desk": "4", "Overall": "5.0", "Value": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "London", "Title": "“Great location”", "Author": "ansh48", "ReviewID": "UR19846069", "Content": "Very clean rooms, loved the L'occitane toiletries! Bit on the small side but central location made up for that. Good breakfast included. Only a couple of minutes walk to the Trocadero - fantastic views of the Eiffel Tower.", "Date": "September 7, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Leicester", "Title": "“Couldn't fault this hotel - loved it”", "Author": "wheeler210", "ReviewID": "UR19707406", "Content": "Just back from a 4 day Paris break at this great hotel. We read lots reviews and were so pleased that we decided to choose this hotel. Stayed in a superior room which was just as described extremely clean and comfortable (clean towels every day and lovely L'Octane toiletries). The staff are v. friendly and helpful no matter what time of day. Had a deal where breakfast was included and it was v.good but not sure that we would have paid the going rate as there are places that are cheaper to eat. Great location just 5mins from metro and the busy Trocadero area that as lively cafes. Metro easy to negotiate and a quick and cheap way to travel, however for a more leisurely trip take the Batbus that travels down the river stopping at the main tourist spots (11Euros for a day ticket). I would recommend this hotel and would definately stay again.", "Date": "September 3, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Maia, Portugal", "Title": "“Great Hotel, excellent location”", "Author": "Blue_Zee", "ReviewID": "UR19527675", "Content": "Stayed in Paris for a week in this small but very pleasant Hotel, with very friendly and helpful staff. As already mentioned by many the rooms are indeed on the small side but comfortable, well decorated, clean and quiet. And with one of the best hotel beds I have ever slept on. Located in a quiet neighborhood but only a couple of minutes away of the Metro station, several bus stops, Car Rouges included, and nice restaurants. Several \"must visit\" reference points within walking distance (Trocadéro, Tour Eiffel, even the Arc de Triomphe and Champs Elysées). Breakfast was included, but this is the weak point of the Hotel, good enough but expensive and should be improved. Concluding: We will return!", "Date": "August 29, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Plano, Texas", "Title": "“Lovely little hotel”", "Author": "tcyaya", "ReviewID": "UR19392885", "Content": "this was a lovely little hotel. my daughter and I stayed here for 5 days. Breakfast was nothing to write home about and a little pricey - but other than that loved everything. Location is great - right around the corner from subway station - very close to the Eiffel Tower. they recommended a little restaurant for dinner - Sgabetti (hoped I spelled that correctly). Could be the best italian food I have ever had. Very close to the hotel - great decor - incredible food. We at there 2 nights we liked it so much. You can't go wrong with this hote or Sgabetti Restaurant!!", "Date": "August 26, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "4", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Los Angeles", "Title": "“Excellent hotel in good location”", "Author": "ivan06", "ReviewID": "UR19017857", "Content": "We were very happy with this hotel. It was a short walk from the Eiffel Tower and from a subway station. The rooms were very clean, and I really liked the way they were decorated. There was also free wifi, a flat screen TV with a good selection of channels. The immediate neighborhood was nice and quiet, and as clean as most of Paris. The hotel staff was friendly, although a few staff members could've been a bit more helpful.", "Date": "August 16, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "4.0", "Value": "4", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Newry, co down", "Title": "“great find”", "Author": "frona", "ReviewID": "UR18773186", "Content": "This was the second hotel we stayed at whilst on our honeymoon to paris in july of this year. The hotel is ideally situated being very close to the Trocadero area. There are plenty of restuarants about five minutes walk away. The hotel itself is well appointed. The rooms are small, but this is usual for Paris. We really appreiated the air conditioning. The rooms were well decorated and clean as was the bathroom. These were serviced daily by friendly staff who really made an effort to communicate with you, even though they had little or no english. The area was very quiet and we were never distuburbed by either noise from in or outside the hotel. The reception staff were very helpful and the little bar was perfect for a night cap- and not badly priced compared to others. We would certainly recommend it and will use it again, when we return to Paris.", "Date": "August 9, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Business service (e.g., internet access)": "3", "Check in / front desk": "5", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Kent, UK", "Title": "“Nice Hotel”", "Author": "MichaelandLouise", "ReviewID": "UR18560984", "Content": "Nice hotel, great location, only a few minutes from Trocadero and Eiffel Tower. Well presented rooms though basic rooms are a little on the small side. Polite and helpful staff. Would return.", "Date": "August 3, 2008"}, {"Ratings": {"Service": "2", "Cleanliness": "2", "Business service (e.g., internet access)": "2", "Check in / front desk": "3", "Overall": "2.0", "Value": "1", "Rooms": "1", "Location": "3"}, "AuthorLocation": "Edinburgh", "Title": "“Dissapointing All Round”", "Author": "MariL", "ReviewID": "UR18383336", "Content": "I was expecting a contemporarty Frech experience, however this could not have been further from the truth. Upon arrival my room was not ready, so I was taken upstairs to be taken back down again and given a glass of tapwater. I was downgraded to give me another room which was small, uncomfortable and badly decorated. The wallpaper was peeling from the walls, the curtains did not match the decor and the bathroom was not clean. There was also significant noise from the street, no mini bar and only one English TV channel (I know this is not why you go to France but I was on business) I was expected to go downstairs to get everything I wanted - even the WiFi key? I was travelling alone and can honestly say I did not feel safe and could hear others through the wall. The locationis good - very central and 5 mins from the Eiffel Tour and underground. The staff were as friendly as they could be given the circumstances. All in all it felt like a travel inn - stay somewhere else!", "Date": "July 29, 2008"}, {"Ratings": {"Cleanliness": "2", "Business service (e.g., internet access)": "2", "Check in / front desk": "2", "Overall": "1.0", "Value": "1", "Rooms": "1", "Location": "2"}, "AuthorLocation": "milan", "Title": "“Nothing Special With Significant Downsides”", "Author": "duke_clar", "ReviewID": "UR17875437", "Content": "Located near the Trocadero in a supposedly nice neighbour. The surronding area is the one of the dirtiest place (garbage out, etc.). really dirty. The hotel is claustrophobic in general: rooms: extremely small (a lot smaller that you would guess) you wont know where to put your suitcase, let alone store it. bathroom: even smaller although finishes are ok and modern. but you will suffocate. bed: ok not too soft cleanliness: average to poor in details (bathroom walls not very clean for instance) soundproof: poor. you will hear neighbours. service: kind on average (although they tried to arrange me with their private cab driver. and of course it was more expensive than regular cabs) there's a smallish room with training equipment (would not call it a gym). all in all: dont stay", "Date": "July 14, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "4", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Switzerland", "Title": "“Ecellente, the place to stay in Paris”", "Author": "starySwitzerland", "ReviewID": "UR17857394", "Content": "My wife and myself stayed in the hotel for 2 nights. Everything was really great, the welcome, the room, the service etc. And also the location was great, quiet in the nights but close to everything you need to see in Parsi. When we go to Paris again, this will be definitive the place we will book again !", "Date": "July 14, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Check in / front desk": "4", "Overall": "4.0", "Value": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Kent. UK", "Title": "“Great but....”", "Author": "fubarinkent", "ReviewID": "UR17773895", "Content": "I stayed here on Valentines with my girlfriend (yuk I know!) for 2 nights following the excellent reviews previously. We took 1st class Eurostar from Ashford and then the tube to the hotel which was very easy to work out. The hotel was much smaller than I imagined but very nice. We were welcomed by warm staff whom were very helpful with the room, maps etc. Our room was a deluxe room and had a small balcony. It was quite cosy to be honest (i dont think any of the rooms in this hotel would have been of any great size) but very clean. The hotel overal was great for a short stay but fairly expensive and the euro exchange didnt help. I think a Gin and Tonic cost around £8. We did not eat in the hotel and options are better outside. Having said that the hotel is superbly situated and there are ample bars and restaurants around. The Tour Eiffel is 5 minutes walk and The Arc de Triumph is only 15 minutes. In addition the hotel sits in a very posh boutique area with lovely shops...at a lovely price! Overal a fantastic weekend at a big price, but highly recommended and I would certainly look no further than this hotel for a short stay.", "Date": "July 11, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Business service (e.g., internet access)": "4", "Check in / front desk": "4", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Asia", "Title": "“Nice location”", "Author": "daniel_chung11", "ReviewID": "UR17743805", "Content": "I book this hotel through www.tramazing.com able to find the best and cheapest rate compare to others. Hotel is in good location, clean rooms, overall is good", "Date": "July 10, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Kent", "Title": "“Perfect hotel in a great location”", "Author": "cnixon1984", "ReviewID": "UR17345776", "Content": "Very clean modern rooms, quiet at night, great location, pleasent and helpful staff who speak perfect English. We will definately go back again. We stayed two nights in this hotel due to it's location near Eiffel Tower and the Metro System. The staff was always on hand to advise us on how to get to places around Paris in perfect english. Our room was a bit small but very clean and were very comfortable. We will be returning to this hotel again because we was treated so well.", "Date": "June 29, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "3", "Check in / front desk": "5", "Overall": "5.0", "Value": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Dublin", "Title": "“Loved it!”", "Author": "Pinky80", "ReviewID": "UR17282303", "Content": "We stayed in the Plaza Tour Eiffel for two nights at the beginning of March and fell in love with the place. We booked our room through the hotel website directly and prior to arrival were emailed special offers available at the time we were staying which the staff very courteously updated our booking to. We ended up staying in a deluxe room with a view of the Eiffel Tour and breakfast in bed for half the price. Upon arrival at the hotel we were warmly welcomed by staff who had very enthusiastic suggestions for dinner (and a great help the next morning with directions and sight seeing suggestions!). This hotel is a gem, 5 mintres walking distance to Plaza du Trocadero and easy access to all of Paris. Would stay here in a heartbeat!", "Date": "June 27, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "4", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Toms River, NJ", "Title": "“Amazing romantic vacation - this hotel made all the difference”", "Author": "BVThomps", "ReviewID": "UR16369032", "Content": "My travel agent suggested this property as I specified I wanted to be close to the Eiffel Tower, and this hotel in an exclusive residential area really fit the bill! The rooms were clean, the bathroom immaculate and the breakfast is well worth it. We arrived on May 11, 2008 and stayed 5 nights in a Deluxe Room. The area was very quiet in the evenings, which made it perfect for our early morning tours. We were within a 10-15 minute walk to the Eiffel Tower, and a 20 minute walk to the Arch de Triumph and Champs Elysees, so our location was ideal for us. Also, the Metro Station, Trocadero, specifically lines 6 and 9, were perfect when we wanted to go into other sections of Paris and see the touristy sights, then come back to our cozy room and relax at night. There is a perfect cafe just a few steps away from the metro - Cafe du Trocadero. You can have an excellent meal in the evenings, and from their outdoor tables you have a clear view of the Eiffel Tower lit up in the evenings and you can stay as long as you like - the waiters don't rush you out. We ate there twice and both times enjoyed watching the Eiffel Tower sparkle like a Christmas tree in the late hours. The front desk staff at the hotel are extremely pleasant and helpful. The fitness room is available throughout the day and is well equipped in my opinion as well as well maintained. Also, there is water available there and we helped ourselves to refilling our water bottles just before leaving on our scheduled day trips or sightseeing. For breakfast, there is a hot buffet available and it is refreshed regularly up until about 20 minutes before closing. There is also an excellent selection of juices, pastries and cereals as well as yogurt and fresh fruit, so every appetite is taken care of. The breakfast staff will provide coffee, tea or hot cocoa and the breakfast room is very clean and the table linens and assorted pictures of the Eiffel Tower bring elegance to the overall room design. The deluxe room is a good size and typical of European hotels. There are no drawers, but they do offer several shelves and when we requested more hangers for our clothes the front desk staff responded politely and promptly. Our hairdryer was not working in the room, and a replacement hair dryer was brought to us within minutes! I simply cannot complain about this hotel. They even offer room service late into the evening. The prices are consistent with local restaurants in the area, so if you have sticker shock over the Euro, I suggest that you budget accordingly and accept the fact that it will take nearly two US dollars for every Euro you spend. As far as this hotel is concerned, I would definitely recommend it to other guests. In fact, when we stayed it was quite crowded with guests, both American and European. It seems to be a well kept secret for great Parisian hotels, and I can see why. My husband and I loved Paris, and plan to stay here again on our next visit.", "Date": "May 24, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "4", "Rooms": "5", "Location": "4"}, "AuthorLocation": "London", "Title": "“Good for a Getaway!”", "Author": "warproder", "ReviewID": "UR15935764", "Content": "> Hotel staff were eager to please > Rooms have been recently refurbished in a contemporary style and are very clean. Like most Paris rooms they are not large > Hotel and street are quite > Beds and linens are very comfortable All and all this hotel is a great place to stay during a weekend trip to Paris.", "Date": "May 11, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "3", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "London, UK", "Title": "“Very pleasant little hotel”", "Author": "dskeeles", "ReviewID": "UR15072622", "Content": "I stayed here one night during a business trip. Plaza Tour Eiffel is around 5 minutes' walk from Trocadero Metro station, down a quiet street - not a picturesque street, but not a bad one, and when you leave the hotel and walk down that street to see a view of the Eiffel Tower across the Seine, through the Trocadero - it's not bad. The hotel itself is excellent - newly refurbished, with modern, understated yet sophisticated decor and excellent detail. eg. as you walk out of the lift, motion sensors outside switch on subtle lighting for the floor, including spots that illuminate the room numbers on each door. A small detail, but it's like this throughout. The room was not huge, but the most was made of the space; a cleverly located narrow floor-to-ceiling mirror in the corner made it feel larger. Everything was clean, and the flat-screen TV was great, with a range of French and international channels. The service was friendly. It's a small hotel, with 4-5 small rooms per floor, and one member of staff on duty during the day. I didn't try the breakfast. WiFi is free, with a free login slip from reception; the internet connection was pretty slow (probably a domestic broadband link), and I had to quit my firewall when connecting, as it blocked the login screen. The room is a bit small for the desk, seat, and bed to fit together - I was slightly cramped at the desk. Also, Trocadero is a bit of a journey from most things, if you're there on business, so this wouldn't be my first choice for a business trip, although it's nice to get away from the bustle for a bit.", "Date": "April 16, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "manchester", "Title": "“what a team”", "Author": "tanner.smith", "ReviewID": "UR15072610", "Content": "We stayed here for 3 days with our 8 year old daughter. I am the fussiest hotel stayer in the world and this hotel exceeded all my expectations for the centre of Paris. The hotel in all areas was very very clean. The room was excellent with a small but perfect bathroom. The view from the window was of a small quaint paris street. The breakfast was super. For me what set this hotel apart from the usual very expensive 5 star all singing all dancing hotels was the staff. They could not have been friendlier or more helpful. NOTHING was too much trouble.", "Date": "April 16, 2008"}, {"Ratings": {"Cleanliness": "5", "Business service (e.g., internet access)": "3", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Montreal", "Title": "“Extreme Pleasant Surprise”", "Author": "Yojadi", "ReviewID": "UR12220658", "Content": "This is a great hotel for no-nonsense travelers. Everything that is important has a comfortable feel : the beds and the bathrooms. The room itself is small, however that is par for the course in Paris; the rooms are also spotless. The staff are very welcoming and hospitable. The hotel is situated in a quiet neighborhood within a stone's throw of the hoopla. As well, the Trocadero metro station is a 2 minute walk. I could see th top of the Eiffel tower from my window, what a sight to wake up to. All in all, I was very satisfied and honestly don't believe that I could have done any better for the same euros; definitely will stay there again.", "Date": "January 1, 2008"}], "HotelInfo": {"Name": "Plaza Tour Eiffel", "HotelURL": "/ShowUserReviews-g187147-d228739-Reviews-Plaza_Tour_Eiffel-Paris_Ile_de_France.html", "Price": "$227 - $531*", "Address": "<address> <span rel=\"v:address\"> <span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">32 Rue de Greuze</span>, <span class=\"locality\"><span property=\"v:postal-code\">75116</span> <span property=\"v:locality\">Paris</span></span>, <span class=\"country-name\" property=\"v:country-name\">France</span> (Formerly Libertel Trocad&eacute;ro Sablons)</span> </span> </address>", "HotelID": "2514909", "ImgURL": "http://media-cdn.tripadvisor.com/media/photo-s/01/da/94/85/plaza-tour-eiffel.jpg"}}