{"Reviews": [{"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "San juan", "Title": "“slice of heaven!!!”", "Author": "Lisa C", "ReviewID": "UR126670543", "Content": "Perfectly french!!! absolutely Parisian. Excellent staff, beautifully appointed, in the heart of one of my favorite neighborhoods. Rooms are super comfortable and exquisitely decorated, the views from the balcones make you feel at home!!! Claudine and Phillipe, Merci!", "Date": "March 26, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Illinois", "Title": "“perfect location”", "Author": "brink9", "ReviewID": "UR125705408", "Content": "I have stayed at this hotel many times, and most recently returned from yet another stay. The ONLY reason I did not give the hotel 5 points, is because 1.) we stayed in room 34 with 3 persons, and the sofa sleeper mattress was so thin it was like sleeping on the springs. We called for a roll away, which Phillipe promptly delivered, and that seemed to be a better sleep. For the price of the room, you would anticipate better sleeping accommodations for the third person. 2) There was a heavy smoker somewhere in the hotel, and the smoke FILLED our room. I would suggest that if the smoke travels through the hotel like that, that it become non smoking in all rooms. We had to purchase a candle and light t with the windows open to air out the room. The staff at this hotel is PHENOMENAL. There isn't anything that they can't and won't do to make your stay as pleasant as possible. They arranged a wonderful trip to the Loire Valley for us, and made our dinner reservations. They even stored our bags for us when we landed on a layover in Paris so we could enjoy the city before our flight. We weren't staying in the hotel until 3 days later, and yet they were completely agreeable to helping us. I have stayed in The George V, The Costes, the Soffitel, and yet the hotel I keep returning to is the Relais Saint-Germain", "Date": "March 6, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "New York", "Title": "“Wonderful Stay at Hotel Relais Saint Germain”", "Author": "lisabobd", "ReviewID": "UR125339402", "Content": "For anyone looking for a wonderful stay on the Left Bank i can without reservation recommend the Hotel Relais Saint Germain. My wife and our two teenage children just completed a one week stay here and it could not have been better. First Claudine and her staff are great, making one feel right at home. The breakfast that was included in our rate was superb and included baguette, croissant, fresh juice, jambon, cheese, prunes and poached eggs. We looked forward to it every day, and it pretty much eliminated the need for lunch! The location of then hotel is also perfect with easy access to many great shops and a Metro stop right around the corner. All in all a great experience we look forward to having again.", "Date": "February 28, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Sausalito, California", "Title": "“charming and spacious”", "Author": "Eustatia", "ReviewID": "UR124361694", "Content": "We stayed in the room 56 on the top floor with the small terrace. The balcony did not face the street to have a great view but it was still nice to sit outside and have a glass of wine or lunch when it was nice out. The location was superb and we walked everywhere. The only time we took a metro (station is around the corner) was to Montmartre and took a taxi back. We had two dinners at the restaurant and it was one of the most memorable meals we ever had. I recommend to book a table on the weekend (pre fix menu, white table cloth, and very good and polite waiters) when chef Yves Camdeborde does his magic. If you're a foodie its a must. Also, people wait for several months to get in unless you're a guest at the hotel, you are in luck! I did select the hotel because of the restaurant but was very happy with the selection at last. The beds were very comfortable, housekeeping excellent. Loved relaxing after dinner at the lounge area, they have Delicious mint water, so needed at the end of the day. One of the most amazing thing about this hotel is BREAKFAST! It is so good and so French! You can tell the chef owns the place. A lot of attention is paid to the quality and presentation. The croissants, the jambon, the cafe o lait, the yogurts, the breads, the honey, the jam, the butter. Claudine, the wife of chef Camdeborde runs the hotel and is the most wonderful host. I had such a lovely gift in my room for my birthday! I would stay there in the future, indeed.", "Date": "February 9, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Le Bar-sur-Loup, France", "Title": "“Loved it!”", "Author": "DizzieG", "ReviewID": "UR124315991", "Content": "Great rooms! Great servie! Great location! This our favorite hotel in Paris, and we have tried a few. Make shure to book a table at the restaurant when booking a room. Difficult to get a table at the Le Comptoir.... even for guests at the hotel.", "Date": "February 8, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Johannesburg, South Africa", "Title": "“The highlight of the holiday”", "Author": "Kathleen_S865", "ReviewID": "UR123745250", "Content": "I have been to Paris many times and this trip was the most enjoyable - in the main because of this hotel. Our usual hotel was fully booked - I relied on the internet and Tripadvisor to make an eight night booking at Relais St Germain. I am reluctant to enthuse too much in case there will never be room for us when we wish to return. Location is incredibly convenient - busses, choice of metro, walking. Staff could not have been more helpful in every way (more later). We had a suite on 5th floor - decor what you would be happy to have at home, comfy beds, no sense of crowding, three large windows on to the carrefour. Whilst we were there the lovely geraniums in our window boxes were changed for beautiful purple boxes. Bathroom small but with full shower and bath. Although on the square (which is busy with traffic and the queue for the restaurant) our room was quiet - there is double glazing but we slept with windows open (it was a warm November).An added extra was the saxophone each evening at about ten. On arrival - Marie (marvellous housekeeper) organised tickets for us at the Luxembourg, was always chatty and gave us a marvellous tour of the entire hotel so that we could choose our rooms for next time (not one room was not pleasantly or charmingly decorated, comfortable and spacious). Three receptionists - all helpful and kindly - making restaurant reservations and so on. Downstairs a very nice little lounge (lots of guide books) and wifi throughout. Breakfast was a great start to the day - Christofff was our host each morning - he worked like a trojan to produce a delightful selection and added much personality. The restaurant was a highlight - we dined in the week on the gourmet menu, we dinnered off a la carte over the weekend, we lunched. We are larger as a result. There was not one selection we did not enjoy. I recommend the haddock mousse with herring caviar. It is incredibly busy yet service is excellent and the food was exceptional - and we eat Michelin star during our time in France. The hotel is not cheap - yet I thought it was excellent value and, compared to other hotels in which we have stayed, we had more space and far nicer decor that anywhere comparable in price. We left planning to return and two months later are working on them.", "Date": "January 28, 2012"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "Sydney", "Title": "“Christmas in Paris”", "Author": "SydneyEther", "ReviewID": "UR122966028", "Content": "This hotel is a botique establishment and has a wonderful sense of character. It only has 6 rooms. It is located in St Germain which if full of cafes, shops and antiques. There is an eccleptic feeling to the hotel, from the two parrots sitting in the lobby to the erray of books. The breakfast is one of the best I have had, the baguettes, crossaint, jambon and fromage are superb. It was a truly Parisian experience not having buffet tables groaning with food. My parents room had a red theme and ours a blue theme. They were huge by Parisian standards. We stayed for four days over Christmas and it was one of the best Chritmas's ever!! The restaurant is run by the famous Yves C and the final meal there was superb.", "Date": "January 12, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Vancouver, Canada", "Title": "“In the heart of real paris”", "Author": "humbug31", "ReviewID": "UR121035321", "Content": "Fourth trip to Paris, first time at this boutique hotel, will Not be our last! Great location, in the saint Germain Des pres area, which we like to stay in. great shopping in this area and great restaurants.Room 20 looks out on to the front street, can be noisy with windows open, but you are in Paris!, enjoy it! Lovely sitting area and this room is very large for Paris standards. good bed and lovely bedding, bathroom is small, but well laid out. Good thing about this place is breakfast is included in rate and you can always get a table at their very popular resturant \"le comptoir\" for dinner Which is a great spot and always packed with no reservations allowed.", "Date": "November 25, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "California", "Title": "“Delightful hotel”", "Author": "CaliforniaLynne", "ReviewID": "UR120584596", "Content": "My husband and I stayed for four nights in late October, 2011; met his brother and wife for a fun filled Paris escape. We couldn't have been more happy with the hotel. The included breakfast is wonderful - hearty, with great service in the dining room. Coffee drinks were promptly made upon request, and were very good. We found the staff to be friendly and extremely solicitous; helped us extensively with reservations, and printing out maps/directions for destinations. Tres bien! Our room was on the first floor and fairly small, but spotless and quite adequate with a great street view from the 2 large windows. There was street noise, but that is unavoidable in a lively, beautiful part of Paris. Bed was comfortable with nice bedding. Decor lovely. We had a very good lunch and dinner in Le Comptoir.", "Date": "November 14, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Melbourne, Australia", "Title": "“Wonderful stay”", "Author": "Jon Potter", "ReviewID": "UR120213573", "Content": "We enjoyed 3 lovely nights in a deluxe room on the 3rd floor looking out over Carrefour de l’Odeon. Our room was very spacious and beautifully furnished. The room, which we think could almost be called a suite, opened into a vestibule which housed the mini bar. From the entry there was a door to the bathroom and also to the remainder of the room which contained a separate lounge area including a sofa and small dining table with 2 chairs. The bedroom area was separated from the lounge area by some structural pillars. The bed was comfortable and the bedding was beautiful. The bathroom was of a good size with a separate bath and shower. The cupboards were in a separate dressing room off the lounge area which provided plenty of storage. Including the dressing room, there were 3 windows in our room looking out on to the street (all with pretty window boxes), great for people watching! The continental breakfast was varied and of great quality. There was juice, tea, coffee, fruit, yoghurt, croissant, baguette, rye bread, boiled egg, ham, cheese, butter and jam on offer. As we had the dining table and chairs and great view from our room, we chose to eat breakfast in our room each morning. All we needed to do was to call reception and request breakfast and it arrived within 10 minutes. There was good, dependable free wifi provided by the hotel. Unfortunately we didn’t get to try the hotel’s restaurant, La Comptoir, on the ground floor during our stay but we were amazed at how long the queues were to eat there whenever we were entering or leaving the building. We enjoyed the location of the hotel. There are lots of cafes, restaurants and shops nearby. The Seine is a short 10 minute walk away, as are the Luxembourg gardens. Service in the hotel was very pleasant and helpful. The staff were very happy to help with restaurant reservations. We would definitely stay here again and have no hesitation in recommending this hotel to our friends.", "Date": "November 5, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Boston, Massachusetts", "Title": "“Just wonderful.”", "Author": "unclejune", "ReviewID": "UR119460651", "Content": "We stayed here for 4 nights this past December - and it was perfect. Though we weren't really interested in some of the tourist locales nearby (Les Deux Magots, etc) we would return to this hotel in a heartbeat. The staff are great, and the breakfast - which you can either take in the restaurant or your room - is the best in the city. And as we were there over New Years', they sent up a bottle of champagne and a basket of nice gifts for us to take home.", "Date": "October 18, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Brussels", "Title": "“Cosy in Saint Germain”", "Author": "rcd1129", "ReviewID": "UR119099800", "Content": "Stayed here for a night as I had been invited to a birthday party nearby and must say that I enjoyed it: the hotel is very centrally located, next door to Brasserie Lipp and across the street from Les Deux Magots and Café de Flore and the church of St Germain des Près. Also lots of interesting places within walking distance which is great as you do not depend upon a cab (everybody knows how hard they can be to get in Paris). We had a little cosy room under the eaves that was very comfortable and quiet (even if facing the Boulevard). Tea/coffee-making equipment and a well-stocked mini bar. Staff was very friendly. Breakfast was ok but could be improved. A bit expensive but one must consider the area.", "Date": "October 9, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Palo Alto, California, United States", "Title": "“Fantastic location, rooms with character”", "Author": "Michelle P", "ReviewID": "UR118856878", "Content": "I couldn't imagine a better location for a boutique hotel in Paris. We stayed here for two nights and loved the neighborhood surrounding this hotel, especially the quaint intersection upon which it sits. There are amazing bars, restaurants and boutiques within 1-2 blocks in every direction. Our room had a huge window overlooking the charming intersection. The room was spacious, tasteful and comfortable. Plus they gave us a complimentary bottle of champagne with tons of snacks because we were there for our honeymoon. Breakfast was included and was plentiful. A great choice.", "Date": "October 2, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Thailand", "Title": "“The Best of teh Best.”", "Author": "TheItalianThailand", "ReviewID": "UR118558794", "Content": "Paris offers a host of great places to stay but there no way you can experience what Paris is all about if you dont stay at Relais Saint-Germain. Yves & Claudine Camdeborde with their exceptional team are so on top of their game that once you stay here you will not want to be anywhere else when in Paris. The Comptoir restaurant makes any well known restaurant guide (I wont name them) \"passe'\". This place is way beyond the stereotypes, baseless hype and editorial bias showed by these guides. The best meals we have EVER had, all down to the genuine top quality produce and an unsurpassed understanding of how to get the best out of them... authentic French food like you have never tasted before and great wines to go with it. All in a special athomsphere that cannot be replicated. The rest has all been said by other reviewers: best location, best rooms, best of everything. We live only once and on top of your list of \"must do before I die\" you got to have \"stay at Relais Saint-Germain & dine at Le Comptoir\". Note: book well ahead, I mean months ahead! Cheers Yves, unforgettable!", "Date": "September 25, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Calgary, Canada", "Title": "“Boutique of Perfection”", "Author": "David A", "ReviewID": "UR117813242", "Content": "Having never been to Paris I wanted to do it up right and while Hotel Relais St. Germain initially seemed out of my price range (I stayed in the double suite) but I am SO GLAD I kept the reservation. Situated next door to Le Comptoir this tiny boutique hotel is just jam packed with amazing features, the most friendly staff, and hotel rooms to die for. The location is close to the north end of St. Germain so accessing amazing sites is an easy stroll. It's also close by to some great cafes. The action outside the hotel continues until the early evening but it just enhances what Paris is all about. The room itself was spotless. The bathroom, huge by Paris standards as I later learned. And the room was just so Paris. When I go back, I'm staying here.", "Date": "September 7, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Exeter", "Title": "“A jewel in Paris !!”", "Author": "Armaniexeter", "ReviewID": "UR117786125", "Content": "I have recently attended the European Society Annual meeting in Paris and stayed at Relais Saint-Germain. This is a small four star located just south of the river, ten minute walk to Notre-Dame, twenty minute walk to the Louvre Museum and with other important sites at walking distance. The Metro Odeon station is just outside the hotel. The hotel has only twenty rooms,is extremely well looked after by the owners who also own and run the bistro-restaurant next door L'Comptoir which is considered one of the best in Paris The staff is extremely friendly and helpful. The room was a very nice surprise as it was much larger than what I expected and it was decorated in a twenty, thirties style with lots of antiques. The queen size best was one of the most comfortables I have ever had in a hotel (having stayed in others such as the Ritz, The Dorchester and The Berkeley in London, the Arts in Barcelona, etc). The room have a lovely view of the street with its bistros and although it was busy it was never disturbing. It had a good size bathroom with a separate toilet and certainly it was spotless as the rest of the room and the hotel. Breakfast was included in the price of 209 euros per night. This was another wonderful surprise as this was served at the bistro by an extremely kind, gentle and professional french waiter. Breakfast was served individualy and included some of the best croissants I ever had in my live, orange juice, beautiful coffee, a perfectly boiled egg, gammon, cheese, yoghourt, fruit...all these brought to you to the table by our waiter. I ate most of the evenings at the restaurant where the owner is the main chef. The quality of the products were outstanding. Most dishes where French based with perhaps a touch of Spanish influence. Every evening there was a large queue of people having to wait a long time to get a table. Clientele was mixed but certainly there were many locals. The staff were fantastic, very well organised and extremely helpful with always a smile in their face. The evening lady manager was a real character and as I ate there three evenings she made me feel like a very welcomed regular customer. One of the advantages of staying at the hotel was that I did not have to queue to get a table at the restaurant....which I really appreciate after a day of ten hours of lectures in Cardiology and after having to travel every day for two hours to and back the conference centre. I tried the scargots, the lobster bisque, a sirloin steak done in red wine sauce (one of the best steaks I have ever had.....!!!), and many other dishes could not fault any....the cuisine is excepcional. The desserts were also beautiful. One night I tried the \"Rum Baba\" and having had the same a the \"Alain Ducasse Restaurant at the Dorchester in London I thought that the one at L'Comptoir was even better. The wine list is french, well priced and with a very good range of wines. In summary the hotel is one of the best one I have ever stayed in with the bonus of having one of the best bistro in Paris. I will certainly highly recommend it and I am looking forward to return one day in the near future. I would like to take this opportunity to congratulate all hotel and restaurant staff for their hard work and professionalism. Charles Avery", "Date": "September 7, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Melbourne, Australia", "Title": "“Amazing, do not look anywhere else in 6me”", "Author": "hilmel", "ReviewID": "UR117299685", "Content": "This review will be long, but there is so much good to say!! This was our first stay at Hotel Relais Saint-Germaine, and we would not consider staying anywhere else in Paris. It is in a fantastic position, literally 10 seconds from Odeon metro, and the Boulevard Saint-Germaine. The Louvre area and the Seine are a lovely 10-15 stroll through side streets with wonderful shops. We walked everywhere from the hotel, except the Eiffel Tower, and that was an easy metro ride away. What makes this hotel so wonderful is the attention to detail, and the hospitality they extend. All our enquiry emails were answered extremely promptly, even though it was often the middle of the night Paris time when i sent them! On arrival we were greeted with charm and offered fresh mint or lemon water from the jugs in reception that are constantly replenished. Our rooms were absolutely fabulous. It's a small and stylish hotel,t the rooms were incredibly spacious, beautifully decorated ( even better than they look in the photos) and very clean. We had a huge room(for Paris!) on the 5th floor and not being a fan of tiny lifts i did use the spiral staircase, but it was fine. We had a seperate shower in the room, which we enjoy. Our 3 teenage children had an enormous room on the 3rd floor, complete with a fishbowl and a fighting fish. They had a seperate toilet in their room as well which was great for 3 people trying to share one bathroom. The third bed in their room was a sofa bed, and everyday it was put away and remade up at night, a fantastic touch. Beautiful window boxes outside the windows, and at night, as we sleep with our windows open, the sounds of the accordionist and a saxophonist in the square below made it a truely Parisian experience. Breakfast was very good, and we ate at Le Comptoir for one evening meal and it was superb. Starbucks is just around the corner for those who wish to sometimes have a home comfort!, and an amazing couple of crepe and sandwich shops are 50m from the door, for an easy lunch or snack. This hotel has a very personal touch, we were given free tickets on a Seine Boat tour, and they scourced out for us a resturaunt we had visited on a previous trip to Paris and couldnt remember the name of (Relais Entreconte...go there for an amazing steak and pomme frite experience). We also mentioned to them we had a 7am train to catch and came down the next morning to find a taxi pre-ordered and waiting for us...absolutely incredible. Lastly, i emailled them 2 weeks after leaving about a shop we were trying to contact. I could only give them a vague description, but one of the staff went for a walk, found the shop and emailled me back all the details. If you can find a hotel in Paris better than this, i will be amazed!!", "Date": "August 26, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Brisbane, Australia", "Title": "“Great location, exceptional service, beautiful rooms and amazing restaurant!”", "Author": "Sires", "ReviewID": "UR116685536", "Content": "My husband and I stayed here for 4 nights in June, we booked this hotel on recommendation from a friend and then reviews on trip advisor and were not disappointed. The location is fantastic, right in the heart of Saint Germain and about 50m to the nearest Metro station. We stayed in a Junior Sutie which was very spacious, especially for Paris standards, and had a nice view overlooking the street. Great for people watching! The bathroom was excellent with a great shower. Perhaps the best part of staying here is prority booking at the Le Comptoir restaurant, and the breakfasts there every morning. Superb food, great service. I have several food allergies and they went out of their way to source gluten free croissants and other deilcacies (including home cooked cholcolate brownie) wthich I was very grateful for. The 5 course set menu on weeknights was fantastic and great value. The service was outstanding, on our last day we had checked out in the morning but had a flight later that evening. It was 37 degrees outside that day and we were given a room to shower and change in before our departure as some guests checking in were to be arriving late. Very nice and not expected. Tip - take a train to the airport! The traffic was so bad, it took us almost 2 hours in a taxi and the flight had closed by the time we arrived. We were very lucky that they let us on! Thanks for a wonderful stay, will definately be back when next in Paris!", "Date": "August 14, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "4.0", "Value": "4", "Service": "3"}, "AuthorLocation": "Manila, Philippines", "Title": "“Found my favorite boutique hotel in Paris”", "Author": "dorycook", "ReviewID": "UR115947973", "Content": "Location (st germain) is one of my favorites in the City of lights. 2 minutes away from the Odeon stop. Its such a bonus that its beside a very good restaurant (le comptor and avant comptor) famous creperie, etc...The breakfast in this hotel is to die for. Rooms are moderately priced and big enough. Not your modern and cold type of interiors. Age is showing a bit. Theres a movie house 20 steps away and its very near most tourist attractions. Service is a bit hot and cold but still ok. This is my favorite lodging n Paris until i find the next one in the same area with the same restaurant beside it. this is like a 4 star hotel in my opinion.", "Date": "July 29, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "5.0", "Value": "4", "Service": "4"}, "AuthorLocation": "Geneva, Switzerland", "Title": "“Fabulous stay”", "Author": "AussieAbroad000", "ReviewID": "UR115913001", "Content": "We realy enjoyed staying at the Hotel Relais Saint Germain. The rooms were very well decorated, the beds comfortable and the location fantastic. We will definately return on our next trip to Paris.", "Date": "July 28, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Sydney", "Title": "“Can not fault this hotel”", "Author": "SydneyOztraveller", "ReviewID": "UR115606371", "Content": "The location of this hotel is perfect for those who enjoy good food, good shopping and close to some of the best tourist attractions that Paris has to offer. The check-in was simple at the front table and we then found our magic room on the 4th floor. Ours was the \"library\" room wth dozens of old books in beautiful old book shelves, with a writing desk, extra table and chairs and the most comfortable bed. In our many stays in Paris we have found the bathrooms inadequate, not the Relais, large and well appointed with the WC in a separate room. The delight came at breakfast (included in the tab) with the biggest array of goodies delivered to your table including wonderful ham off the bone and the biggest cup of coffee. When you open your flowered full window onto the street below you see Parisiennes enjoying life at the tables in front of the restaurants surrounding the Relais. No noise at night in your room. You also find that the Relais breakfast room becomes one of the most sought after lunch and dinner restaurants in the area. At all times the access to the hotel and the ground floor lounges is no where near non guests. Paris at its best.", "Date": "July 21, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Rochester, New York", "Title": "“An awesome place to stay!”", "Author": "Rebecca2494", "ReviewID": "UR114879995", "Content": "If you are looking for the ultimate Paris experience, stay at this hotel. The location is superb, very close to the Odeon metro, beautiful neighborhoods, great restaurants, Luxembourg gardens, etc, etc. The area also felt very safe which I appreciated. The hotel itself was wonderful. The staff was always very friendly and pleasant. Our room was unique, clean and had a comfortable bed. The shower pressure was great too! It was our anniversary so they surprised us with a bottle of champagne and some snacks....very lovely and unexpected. They aim to please and you get the sense that they care about your stay at their hotel. The breakfast was wonderful, just as every says. High quality and filling. The hotel is a bit expensive, but you will not be disappointed. We did not try the restaurant because we were always out exploring so I cannot comment on it, but I would suspect it would be a great experience based on the quality of the hotel.", "Date": "June 29, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "5.0", "Value": "4", "Service": "5"}, "AuthorLocation": "glen ellyn", "Title": "“Ideal place to stay”", "Author": "mudfoot", "ReviewID": "UR114577820", "Content": "The location is great. The restaurant is great. The staff are great.", "Date": "June 20, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "4.0", "Value": "4", "Service": "4"}, "AuthorLocation": "Illinois", "Title": "“very nice”", "Author": "brink9", "ReviewID": "UR113914350", "Content": "I have stayed at the Relais the last 5 times I have visited Paris, and never have ben disappointed. The location is ideal for getting around the city because of it's close proximity of the l'odeon metro stop. I have always found the staff helpful, and the rooms are always clean.", "Date": "June 16, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "4", "Service": "5"}, "AuthorLocation": "New Smyrna Beach, Florida", "Title": "“A great visit to Paris”", "Author": "jsw2009", "ReviewID": "UR112067140", "Content": "My wife and I stayed in Paris, France at the Relais Saint Germain. We are a married couple in our 50's from Florida, USA I hve to say it was one of the best highlights of our trip. To start with the room was very comfotable for a 7 day stay. The location and view from our room was great.The bed didn't make me feel I was not at home. The staff greated us with a smile and couldn't be more helpful. The beakfast was amazing. The freshness and the staff made it a great way to start the day. The wine Tapas bar attached has to be a 5 on a chart to 5. The managers and staff helped me with trying to pick out the fabulous bites that they served. I stopped in there everyday and was greated with a glass of wine and a smile. The food was great also at the sit down restaraunt. If you want to stay in Paris and be close to all the sights and local bistro's this is the place. % stars in my book. J & J.", "Date": "June 7, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "5", "Overall": "4.0", "Value": "4", "Service": "5"}, "AuthorLocation": "Wilmette, Illinois", "Title": "“Perfect place to stay in Paris”", "Author": "raisingkaine", "ReviewID": "UR111086486", "Content": "4 1/2 stars certainly! We stayed in the deluxe room which was charming and with plenty of room to move around. Very comfortable beds. Bathroom is tiny; water pressure amazing. Hotel staff is helpful and the foyer and sitting area of the hotel round out the Parisian experience. LeComptoir is definitely worth a visit. We were fortunate enough to catch Woody Allen's new 'Midnight in Paris' movie around the corner. Interesting Mixology store across the street. Try the Absinthe and then bring some home. Great, great, great location. Bed time caramels are AAAmazing. We found the store in Marais and brought some home", "Date": "June 2, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "", "Title": "“Perfect location, lovely rooms, and very nice breakfast. If I dreamt of Paris, this is what it would look like.”", "Author": "Arquettes", "ReviewID": "UR109215797", "Content": "Stayed here in mid-may and loved every minute. It was pricey, but so lovely that I didnt dwell on that. The staff is charming and helpful. our room was so nice, with a small outdoor space and big bright windows. The bed was comfortable and very clean. I highly recommend their restaurant for a gourmet meal in a lively setting. I will definitely stay here again.", "Date": "May 21, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Indianapolis, IN", "Title": "“Third Time Is Chaming”", "Author": "ParisKat", "ReviewID": "UR104296863", "Content": "My husband and I stayed for four nights at the Relais St. Germain earlier this month, and loved it. It was our third stay there, and everything was consistently wonderful. Our room was number 21, and it was very nicely appointed. The usual Annick Goutal bath amenities, very comfortable bed, very good noise reduction windows. I read one of the previous negative reviews, and I cannot say that I had the same experience. The hotel made and adjusted various restaurant reservations and called us a cab for the hotel. I believe that the driver is someone that they regularly use. There was one front desk employee (female, older, dark hair) who was not very helpful when it came to getting the lobby computer to work, but the head housekeeper helped and she was lovely. The owner, Yves Camdeborde, also tried to help with the computer, but even he had a hard time. Speaking of the owner, who is also the chef of Le Comptoir, his food is wonderful. One of the main benefits of staying at the hotel is being guaranteed a reservation for dinner. If you stay at this hotel, so not miss the restaurant. Breakfast is part of the hotel stay, and is also very good. It includes coffee or tea, juice, croissants, bread, yogurt, soft boiled egg, spanish ham, and fruit. It's so large that you can skip lunch. The chef also owns L'Avant Comptoir, which is a 12 person capacity bar/creperie/tapas place. Great for a quick bite. The Relais never disappoints!", "Date": "April 16, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Austin, Texas", "Title": "“Roomy Junior Suite with comfortable bed--But don't miss the restaurant!”", "Author": "Kayrow", "ReviewID": "UR103534699", "Content": "I loved my room on the 5th floor of this very small boutique hotel. There was more than enough room for my 20 year old daughter and myself to lounge in the sitting area as well as on the bed. Very nice bathroom with shower and tub and separate toilet area. Most importantly, reserve a table at Comptoir du Relais during the evening Monday-Friday. You will enjoy the most delicious 5 course meal for a mere $55 Euros which is the best deal going in Paris. Then you have a delightful breakfast served to you in the same darling bistro each morning. We also get a crepe at the adjoining lunch bar one day and it was incredible. We lucked into these culinary treats when we booked the hotel!", "Date": "April 10, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Chatham, Massachusetts", "Title": "“A new favorite”", "Author": "wright_olney", "ReviewID": "UR102839830", "Content": "We have just completed our 2nd stay in two years - and we can't wait to return. Paris is our favorite destination, and Le Relais embodies all the best of Paris. The location, the breakfasts and the terrific assistance from reception (when needed, as I did with my computer) make this our 1st choice! Of course the restaurant is fabulous, and by booking into the hotel we have a reservation automatically!!", "Date": "April 4, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "3", "Overall": "2.0", "Value": "2", "Sleep Quality": "2", "Rooms": "2", "Location": "5"}, "AuthorLocation": "Toronto, Canada", "Title": "“Great location but do not stay here....”", "Author": "Evsguy", "ReviewID": "UR97707807", "Content": "We stayed at this hotel for four nights while in Paris for a brief conference that we extended into a long weekend in the city. The positives first....the location is outstanding. This part of the 6th, a stones throw from the Seine, L'Odeon Metro stop, shops restaurants and quintessential Paris life was spectacular. The breakfast included with the stay was incredible - bowls of cafe au lait, eggs, ham, cheese croissant at Le Comptoir St. Germain right next door. Awesome. But the negatives...they very quickly overtook the positives and turned the stay into a very frustrating and even dangerous one. First there are no dedicated non smoking rooms, so if you have trouble with residual smoke in the air, this place is not for you. The room was small which was fine, but the brown shag carpet was quite dirty and the bed was uncomfortable. We would have overlooked that, because we really didn't spend much time in the room. But twice when we left the room and locked the door (they use actual keys, not key cards) we returned to find the door unlocked. Wide open. The first time it happened we expressed concern and were apologized to. The second time it happened, we got the French shrug. No apology. No concern. They really didn't care. As two women travelling alone, it was unacceptable. We also had problems with the front desk refusing to call restaurants to make reservations, calling a cab for us and not letting us know it had arrived (so the meter was already at 10 euros when we go to the cab!), and generally not being helpful. At all. While I know service in France is much more laissez faire than in North America, for 300 Euro's a night, this place took it too far. Don't do it.", "Date": "February 23, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "California", "Title": "“Just what we were hoping for!\"”", "Author": "CleoCalifornia", "ReviewID": "UR94638050", "Content": "Lovely comfortable hotel in a great location. Our junior suite was spacious and beautiful. Decor included a live exotic blue fish! Staff was responsive and professional. Lavish breakfast served in room or restaurant below. We would definitely stay there again.", "Date": "January 27, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Perth, Australia", "Title": "“PERFECT”", "Author": "msbali", "ReviewID": "UR93470710", "Content": "After reviewing every hotel in the area we settled on Relais St Germain based on trip advisor reviews. Every aspect of the hotel was fantastic. We were able to check in early to our double room which was more than expected. The room was very spacious and the decor extremely lovely. We had a great aspect overlooking the street. Breakfast was included in the price and was fantastic - quality produce and plenty of it. The staff were extremely helpful. The location of the hotel was ideal, close to everything. Metro Odeon was 2 mins walk as was Blvd St Germain. There was an excellent array of great restaurants within walking distance from the hotel. Room service meals were excellent. The restaurant attached to the hotel Le Comptoir is well worth a visit, guests get priority bookings.", "Date": "January 17, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "new york", "Title": "“Oooh la la”", "Author": "sukiacki", "ReviewID": "UR87506677", "Content": "Le Relais St. Germain was everything and more that we were looking for in a four-day Parisian stay. Close to all the major sites. Great neighborhood. Nice (included) breakfast every morning at the restaurant next door. Great, comfortable beds/pillows. Warm and happy-to-see-you service. They do have non-smoking rooms if you prefer. Cozy and warm and inviting. I would definitely recommend this lovely boutique hotel to anyone...but I like to think that it's my little secret!!", "Date": "November 18, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "New York City, New York", "Title": "“Service, location & value”", "Author": "NewYorkGuy_35", "ReviewID": "UR78828921", "Content": "This is the third time my wife and I have stayed here and we just love it. be sure to make a reservation at the restaurant too.", "Date": "September 8, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Auckland Central, New Zealand", "Title": "“This boutique hotel is near perfect!!!”", "Author": "Mareepv", "ReviewID": "UR77601198", "Content": "If you like small intimate hotels then this is one of the best. Staff are professional and extremely helpful, nothing is too much trouble. The restaurant next door is a reason in itself to stay here..... The food is superb!!! If you have time we definitely recommend the moulin rouge show it was well worth it!!", "Date": "August 31, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "5.0", "Value": "5", "Sleep Quality": "3", "Rooms": "5", "Location": "4"}, "AuthorLocation": "the Netherlands", "Title": "“Just perfect!”", "Author": "HPBKraaijeveld", "ReviewID": "UR76162038", "Content": "I can be brief here. This was about the 53rd (or something like that) that we visited Paris. Over the years we stayed from very basic places up to the Ritz. This time we selected this hotel, mainly based on Tripadvisor. Very nice rooms, good beds, small bathroom (as in most French hotels) good and nice - real Parisien - location. Splendid breakfast and very nice service. One minor; the elevator makes you really clautrofobic; never seen such a small one. They have a restaurant as well; we did not eat here (just one night in Paris and then I just need one of my 'standard' favourite spots) but wished we did. Good value for money and we'll definately be back.", "Date": "August 21, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "baltimore", "Title": "“We have returned to this hotel many times because we love it.”", "Author": "annieBaltimore", "ReviewID": "UR74095968", "Content": "This hotel is so very well situated near interesting sights, cafes, churches, etc. and the rooms are beautifully decorated.", "Date": "August 6, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "5.0", "Value": "5", "Sleep Quality": "3", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Toronto", "Title": "“Amazing location, charming rooms, a bit noisy”", "Author": "TorontoGuy", "ReviewID": "UR64738498", "Content": "This hotel is located in the St. Germain area, which is amazingly convenient. There is great shopping and many fun restaurants close by (including Les Deux Magots, Cafe de Flore and Brasserie Lipp), and its great to go shopping and be able to quickly walk back to your hotel to drop off your stuff before heading out again. The hotel has that whole 'shabby chic' thing going on, so if you like that look, you'll love it. The room was very large by Paris standards. There were two luggage stands so we each had a place to open our suitcase, and plenty of floorspace to walk around. We also loved the decor. There was a giant wooden armoire and several antiquey pieces and the headboard and curtains were a bold red brocadey type fabric. It was obviously an older room, but that was part of its charm. it had a lot of character. We had a room on a low floor, and had a view of the GORGEOUS tree outside and the nearby buildings, which was very charming and Parisian. If we had a negative, it was only that there was a pub across the street that was very lively and so it was quite noisy late into the night. It didn't keep me up, and I kind of like hearing city streetlife sometimes, but I mention it because if people are noise-sensitive they might request a room that's higher up which might be quieter. The hotel is right next to a restaurant which was always busy as well, and I believe hotel guests are supposed to be guaranteed a reservation but we didn't try it out. All in all, we would definitely come back to this hotel!", "Date": "May 19, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Squamish, Canada", "Title": "“charming hotel”", "Author": "traveltoes", "ReviewID": "UR64646448", "Content": "We stayed at this hotel at the end of our last trip to France. We had eaten in the restaurant for lunch the week before, and had dinner during our stay there. The room was nicely appointed with a lovely view of the square, breakfast was good, and generous, dinner was fantastic. My only complaint was that the room was hot at night and if we opened the windows it was loud. Funky decor, great location.", "Date": "May 18, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Virginia Water, England", "Title": "“Utterly Charming - an outstanding gem”", "Author": "r777rms", "ReviewID": "UR63206037", "Content": "We've stayed at the Relais St Germain several times now, and each time we fall in love with it a little bit more. The rooms are beautifully decorated and spacious by Parisian standards. I've stayed at many, many hotel in this city (Lancaster, Bristol, Plaza Athenee, Crillon, Lutetia, Christine, L'hotel, etc etc) and none of them have left me with the feeling that comes from this incredible little gem. Great staff, fab rooms, unbeatable location. Wonderful.", "Date": "May 4, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "los angeles,ca", "Title": "“The hotel is lovely, but the restaurant leaves a lot to be desired.”", "Author": "mflickermd", "ReviewID": "UR62337241", "Content": "The hotel is in a bustling area but was very quiet. The room was elegant and well equipped although the bathroom was quite small. The staff was very responsive to our needs. The lighting in the room was terrible, but the staff brought up an extra lamp as well as some much larger light bulbs. One of the receptionists was quite responsive-the other was rather cool. Our disappointment was with the restaurant,Le Comptoir.The chef was out of town, but bistro food was available. We were there for dinner. I almost had to fight for my bit of space that my chair took up. When I couldn't see the menu on the wall clearly, the manager treated me with disdain.The food was mediocre and we weren't asked if we wanted desert or coffee. The bill was almost thrown at us.However, in the morning, hotel guests are served breakfast in the same room. We felt a bit schizophrenic as the service was good , the meal was delicious, and we enjoyed being there.I would definitely stay here again minus eating lunch or dinner at the restaurant.", "Date": "April 24, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "3", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Boston", "Title": "“Perfectly located, perfectly staffed, perfectly appointed-a gem!”", "Author": "Bostonwwanderer", "ReviewID": "UR46791651", "Content": "This elegant boutique hotel is tucked around the corner from the Odeon Metro stop, next door to the Sorbonne and near the Luxembourg Gardens. Adjoined tot the hotel is the ever popular Le Comptoir Bistro. You are guaranteed a reservation as a hotel guest and this is worth its weight in gold. The room was extremely comfortable and quiet, in spite of the fact that we were on the street side. The location made walking to most sites very appealing. And if one chose not to walk, the Metro was one block away. We cannot wait to find an excuse to return to this delightful retreat in the heart of Paris.", "Date": "October 13, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Location": "5", "Rooms": "4"}, "AuthorLocation": "sewickley, pa", "Title": "“The essence of Paris charm”", "Author": "dishSewickley_Pa", "ReviewID": "UR46086161", "Content": "This is my second stay at the hotel and the first under the new ownership. Happily the experience only gets better. The location is perfect - located on a charming triangular \"square\" just south of Blvd. St. Germain and around the corner from the L'Odeon metro. The decor of the rooms is well done and the inclusive breakfast, excellent. The neighborhood is lively within easy walking distance of the Luxemburg Gardens (you can't help but relax there) and one of a kind shopping. Ludwig, one of the concierge staff, couldn't have been more charming and helpful. This will continue to be my home base in Paris.", "Date": "October 7, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Singapore", "Title": "“Brilliant Haven of Parisian Chic in the Heart of the Left Bank”", "Author": "MajidiGirl", "ReviewID": "UR34444625", "Content": "This being our first family holiday in the amazing city of PARIS - the Relais St Germain could not have been a better choice. Its location is absolutely brilliant, right in the heart of the buzz of the Rive Gauche, at an intersection dotted with cafes, bistros, meandering lanes where you would discover the quaintest shops and patisseries (highly recommended - MULOT - just a 3 min walk from the hotel). Bonus - very efficient wi-fi connectivity that helped us keep in touch with the world. Our family of 4 (one adult child, and one teenager) stayed in the Marcel Proust (room #32), and the Ernest Hemmingway (room #22) rooms - amazing decor and lavishly comfortable. We landed in the midst of an unprecedented heat-wave in Paris (over 32 degrees Celsius), and were grateful for the super-efficient air-conditioning! The team at the Relais - at least those we met - is excellent - namely Stana, Philippe, Anna. Plus the super-efficient bistro gentleman who served us breakfast every morning (except our final morning) at the Le Comptoir cafe. The first day we arrived - we had a late lunch there, and met him for the first time. When asked what's good - he said \"everything is bad\" ... ahhh ... a brilliant introduction to the French sense of humour! On meals - our first lunch at the Le Comptoir was great - we over-ordered (compared to the modest croque monseiurs that other tables were having) - our order included an onglet of beef, two beef chateubriands, a platter of assorted charcuterie etc! We went on to a few hits and misses for our meals in Paris over the 4 nights we were there. HIGHLY recommended is the CHEZ L'AMI JEAN at Rue Malar (within 15 mins walking from the Eiffel Tower) - brilliant x 3! The chef there is Stephane Jego, and he used to work with Yves Camdabord of Le Comptoir. If you want something different to the usual bistro fare - go there - novel Basque combinations in a traditional bistro setting! A major MISS - the Relais L'Entrecote (at Rue St Benoit) - purportedly a 50-year (or more) restaurant that serves only ONE dish - beef entrecote, with what others claim to be an amazing 'secret sauce' - sorry we were extremely DISAPPOINTED. Beef was stringy and powdery, and for the price, we would have fared much better elsewhere. We have fallen in love with Paris - and are determined to return in the cooler seasons (though unlikely again in the summer as the weather was blistering). Thank you, Relais St Germain!", "Date": "July 11, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Connecticut", "Title": "“a top class hotel and staff”", "Author": "pclemarch", "ReviewID": "UR30727751", "Content": "I have stayed many times at this hotel and it is always a pleasure. Everything is right . A real jewel !", "Date": "May 25, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Uppsala, Sweden", "Title": "“A nice comingback”", "Author": "Bettinasgranddad", "ReviewID": "UR26247233", "Content": "We have stayed several times at this hotel, every time service has been very becoming. The rooms are charming, to say the least. Breakfast a marvel, if you can manage it all. The restaurant is absolutely top class at lunch and dinner, be sure to book in advance. If you want to know Paris, this is where you should stay. Christer Heedh MD", "Date": "March 16, 2009"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "Chicago, Illinois", "Title": "“Best Hotel on Left Bank”", "Author": "Athens45", "ReviewID": "UR23612377", "Content": "This was the third time my wife and I stayed at the Relais St. Germain. The location is fantastic, the room very large, the staff extremely helpful and the food at the adjoining Comptoir fantastic.We spent five nights after Christmas and it was wonderful. When we arrived in the morning our room was not ready so the staff gave us another room so we could take a nap and freshen up until our room was available. From this location you can walk to all the best places on the Left Bank.", "Date": "January 16, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Washington, DC", "Title": "“Our New Home in Paris!”", "Author": "Sydney350", "ReviewID": "UR22296172", "Content": "Having stayed in Paris many times, this last visit was the best thanks to Le Relais Saint -Germain. Our Junior Suite was beautiful and had a large bathroom! (Those not used to Parisian hotels; rooms and baths can be TINY compared to US standards). The staff was WONDERFUL and helpful with directions, reservations, etc. On that note the fantastic \"Le Comptoir\" which is part of the property, promises to have a table for all guests. On one warm evening there was a very long waiting line for tables at this popular spot. The staff sent us up to our room, with champagne, to relax a bit and they would call up when the next table was available-what a treat! You cannot go wrong with this wonderful hotel, romantic, beautiful, great location, fantastic food! We shall return as soon as we can! Thank you Le Relais S-G!", "Date": "November 29, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Pittsburgh, Pennsylvania", "Title": "“An amazing accomodation - picture perfect in every way imaginable”", "Author": "djgmota", "ReviewID": "UR22092495", "Content": "We just returned from a 5 night stay and can not say enough about this splendid property. Every member of the staff was more gracious than the next. The room (Jr. suite 44) ,was spectacular and generously proportioned with breath-taking views over the Carrefour L'Odeon. The staff was more than helpful with dinner reservations each night. They also arranged for a table in the hotel-affiliated bistro \"Le Comptoir\" - one of Paris' most in demand tables and generally made certain that our every need was fulfilled. From the amazing (included in the room rate) breakfast ( in-room or in the downstairs restaurant) to the staff member who assisted with the set-up of the internet connection for my laptop in our suite, one could not imagine better, more professional service. Every amenity imaginable was provided at this hotel but the service by each and every member of the Relais Saint Germain staff was what made our stay truly spectacular. We will never stay anywhere else in Paris. This property is paradise. Merci to the Hotel Relais Saint Germain!!!", "Date": "November 22, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "4", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "barcelona", "Title": "“good advice and service”", "Author": "selomo", "ReviewID": "UR15829701", "Content": "the reservation department told us about the scaffolding, which will be finished in mid-juny. We made a reservation for july with a one night deposit, but finally we will not travel to Paris. The hotel refunded inmediatelly our deposit. There are only two examples of good service and advice. Please note that, its restaurant is one of our favorites in Paris.", "Date": "May 9, 2008"}, {"Ratings": {"Overall": "2.0"}, "AuthorLocation": "San Francisco, California", "Title": "“Undergoing Renovation”", "Author": "Anomina", "ReviewID": "UR15489370", "Content": "Check before you stay here to see if the ongoing renovation is completed. The building is covered in scaffolding as of April 28, 2008. The staff was accomodating but we decided to stay elsewhere.", "Date": "April 30, 2008"}, {"Ratings": {"Service": "2", "Cleanliness": "2", "Check in / front desk": "2", "Overall": "2.0", "Value": "1", "Rooms": "2", "Location": "5"}, "AuthorLocation": "SW London", "Title": "“Pretentious ripp off”", "Author": "Enarque", "ReviewID": "UR14484915", "Content": "We were attracted by the description of a charming hotel in an old building, furnished with antiques. The antiques turned out to be oversized and decrepit old junk. The door was hanging off the wardrobe. The ancient bed was too big for the room and left a small gap of 12 inches each side for us to move in. The bathroom was so tiny, you could touch all walls without stretching. Worst of all, the room opened directly on to a spiral staircase - very dangerous - and getting suitcases in and out was a nightmare. No one helped. No public rooms and reception often unmanned. If you make a reservation, make sure you know exactly what quality of room you are getting as the rooms vary enormously but the prices do not. We were ripped off.", "Date": "March 24, 2008"}, {"Ratings": {"Overall": "1.0"}, "AuthorLocation": "Cheshire", "Title": "“Reservation, what reservation?”", "Author": "SophisticatCheshire", "ReviewID": "UR10106065", "Content": "My hubbie booked some flights for Paris, leaving me to find some accomodation. No mean feat, given the semi-finals of the World Cup Rugby were on that weekend. Anyway, as I used to live in the locality I was very pleased with myself when I managed to secure the last room at what I remembered to be a good value for money, clean hotel. I made sure that the hotel confirmed the reservation in writing as I couldn't quite believe they were the only hotel in the area to have a vacancy. Upon arriving at the hotel at 20.00, the receptionist told us that they had given our room away. He said they had emailed us at 17.34 to tell us our card hadn't gone through. We were now stranded on what was one of the busiest weekends of the year with nowhere to stay. I explained that the card details had been given a week earlier and surely if there was a problem they should have contacted me by phone or email at that point, not by email when we were already on the flight to Paris! They agreed they should have done but didn't offer any apology or anything. We stayed in a flea pit that night and didn't sleep a wink and then managed to book one night at the Hotel le Crillon at 800 euros for the night! When we arrived home I checked my email and it made no mention of a card payment not going through. All they said was that if we were arriving late that evening, they couldn't guarantee being able to hold the room! The management of this hotel are liars and they didn't even have the decency to apologise for ruining what should have been a fantastic and romantic weekend in Paris. Don't touch this place with a barge pole.", "Date": "October 18, 2007"}], "HotelInfo": {"Name": "Hotel Relais Saint-Germain", "HotelURL": "/ShowUserReviews-g187147-d194309-Reviews-Hotel_Relais_Saint_Germain-Paris_Ile_de_France.html", "Price": "$380 - $577*", "Address": "<address class=\"addressReset\"> <span rel=\"v:address\"> <span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">9, Carrefour de l'Odeon</span>, <span class=\"locality\"><span property=\"v:postal-code\">75006</span> <span property=\"v:locality\">Paris</span></span>, <span class=\"country-name\" property=\"v:country-name\">France</span> </span> </span> </address>", "HotelID": "2514897", "ImgURL": "http://media-cdn.tripadvisor.com/media/ProviderThumbnails/dirs/c3/4c/c34cab4a6560070e210f8f616af97e1a7large.jpg"}}