{"Reviews": [{"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "4", "Sleep Quality": "4", "Rooms": "3", "Location": "2"}, "AuthorLocation": "New Orleans, Louisiana", "Title": "“Nice Private Rooms, Kind of Out of the Way...”", "Author": "CupKate11", "ReviewID": "UR119300447", "Content": "When you enter the building it almost seems as if you are in the wrong place, from what I understand the \"hotel\" is just a few floors of an apartment building, it was walking distance from a subway, but in the January cold it was a little longer walk than I would have liked. I loved the full kitchen included in the room. The bed was comfortable, the TV was nice. I really don't have too many complaints about the room.", "Date": "October 14, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "4"}, "AuthorLocation": "Coquitlam, Canada", "Title": "“Can I rate no stars?”", "Author": "Normie_1234", "ReviewID": "UR118799873", "Content": "Do you enjoy a shower that turns into a bath immediately? Or a showath as we liked to call it. How about stained, dirty...and I mean filthy...carpets that have never seen a vacuum? And who doesn't like the smell or better yet the sight of white furry mould? On day 3 of our stay our friends realized that the a/c was leaking and had soaked their suitcase. Now their clothes smelled like mildew. Seriously...the subway floors were cleaner. The kicker is apparently sick kids stay here when they get treatment at the hospital...we all woke up with congestion and a cough every morning because of the dust andshouldl, how can that be healthy for a sick child?I'll try and touch on the positive. The apartment was big. The location is great. We really liked the Lucky Diner on the corner. When we complained about the room they fixed the bed and gave us free wi-fi. Bottom line...look elsewhere.", "Date": "September 30, 2011"}, {"Ratings": {"Cleanliness": "1", "Overall": "1.0", "Value": "1", "Service": "1", "Location": "3"}, "AuthorLocation": "Los Angeles, California", "Title": "“Don't even consider!”", "Author": "jodyw900", "ReviewID": "UR118387170", "Content": "We booked a 1 bedroom based on the description and pictures on Envoy's website. What a joke! Upon entering the apartment we were immediately hit with an awful odor. It smelled like years of stale smoke. After pushing through the foul odor, we couldn't help but notice the carpet was stained, burned and so warn out there were several areas that looked like there was no carpet left at all. To add insult to injury, when we saw the bedroom, two prominent circles of wallpaper were cut and falling off the wall with a hole in the middle of each circle. The curtains in both the bedroom and living room were missing approximately half the hooks that keep the drapes up. The unit was so dreary, dirty and warn we did not want to sit on the furniture or sleep in the bed. When we confronted the front desk, they claimed this was the only unit available and there was nothing they could do. We promptly left.", "Date": "September 20, 2011"}, {"Ratings": {"Location": "3", "Overall": "1.0", "Value": "1", "Service": "1", "Rooms": "2"}, "AuthorLocation": "Cleveland, Ohio", "Title": "“Don't trust this hotel”", "Author": "Lorie D", "ReviewID": "UR118077284", "Content": "I stayed here in June and booked (guaranteed) a two bedroom suite. Upon check-in I was told they didn't have one available and put us in 2 one-bedroom suites. I was told there was nothing they could do and it happens all the time. Really? How can they guarantee something and then say, never mind. It was not the girls weekend we had hoped for because we were in different rooms. Then the nightmare began. I complained about the fact that we weren't in a 2 bedroom and that the air conditioning didn't work in one of the rooms (not acceptable in June in NYC) we told the front desk and they said they'd fix it, well, they said it was frozen but working again, wrong, it wasn't and the mildew smell led me to believe it happened a lot. When I got home I called customer service but never got a response, my travel agent called and emailed and never got a response and American Express called and never got a response. I asked for a refund of one-half of my total bill (which I thought was fair). Luckily by using my AmEx card I let them handle it and received the refund. Now, 3 months later, this hotel got my Visa card number and is trying to get the rest of the money from them. Very shady. I have travelled all over the world and have never encountered a problem like this. Buyer Beware!", "Date": "September 13, 2011"}, {"Ratings": {"Location": "3", "Overall": "1.0", "Value": "1", "Service": "1", "Rooms": "1"}, "AuthorLocation": "Cleveland, Ohio", "Title": "“RUN! DON'T WALK FROM THIS PROPERTY!”", "Author": "746Traveler1", "ReviewID": "UR118077275", "Content": "I have never written a review about any supplier before in 30 years in the travel business but....time's up! I am a travel agent who booked a client into the Envoy Club Suites for the express purpose of having the 2 bedroom unit. Three generations of women in one family were going to The City for a getaway celebrating the matriarch's birthday. I even spoke voice-to-voice twice with the reservations department prior to their arrival in order to append a credit card for guarantee and to be certain the 2-bedroom unit was guaranteed. When they arrived.....no 2 bedroom available! They were very casually told that \"it happens all the time\". Long story short....they were separated; one room was adequate while the other lacked working air-conditioning in June and smelled of mildew. No one would return my calls. My client disputed some of the charges successfully but now the management is sneaking around and trying to charge another card that was originally just used for the guarantee. Unbelieveable! STAY AWAY!", "Date": "September 13, 2011"}, {"Ratings": {"Cleanliness": "1", "Sleep Quality": "2", "Overall": "2.0", "Value": "3"}, "AuthorLocation": "St. Albans, United Kingdom", "Title": "“Dont expect too much and you wont be dissapointed”", "Author": "mezzas", "ReviewID": "UR117869871", "Content": "I stayed in the two bedroom apartment. On first impressions the room is impressive, very spacious with kitchen and living room. then the over powering musty smell hits you. The apartments are very worn and shabby, the more you look the more you find. The list of faults includes broken wash basin, dirty carpets, excrement found on the rear of my bathroom door, suspicious looking stains on the curtain, musty smell throughout. The bed linen was clean so I felt comfortable sleeping there but I did not walk barefoot anywhere else. The Aircon was noisy, but at least it worked. The windows were also very dirty. Its location is ok but a bit of a walk to the main areas, it is also noisy with lots of sirens outside, but I suppose you have to expect noise in New York. The roof terrace is good for sun bathing but no good views from up there. A summary is that it is cheap for NY and spacious but not clean, you get what you pay for.", "Date": "September 9, 2011"}, {"Ratings": {"Cleanliness": "2", "Sleep Quality": "2", "Overall": "3.0", "Value": "4", "Service": "3"}, "AuthorLocation": "Houston Texas", "Title": "“Great Location, shabby room”", "Author": "droberts67", "ReviewID": "UR117799001", "Content": "Stayed at The Envoy Club recently and have to say the location is fabulous, the front desk staff for the CONDO part of the lobby are very helpful and kind, and the price point is wonderful considering the location but the place could realy use some freshening. There was a large water/mold stain on the ceiling of the bathroom as well as cracked fixtures in the bath and lighting face plates. The wallpaper was beginning to peel at almost every seam and the sofa cushions flatten into a pancake after a small child sits on them for less than 5 minutes. The internet connection that you pay for is intermittent at best. Its too bad actually because the location is first rate. Lots of restaruants in the area, food stores to stock the kitchen, and very convenient to the subway for sightseeing. Everyone in our party thought they would return to The Envoy if the rooms were fixed up even just a little, but there are too many other choices in the area to have rooms in this state.", "Date": "September 7, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "London, United Kingdom", "Title": "“Excellent place to stay”", "Author": "michael s", "ReviewID": "UR116671761", "Content": "We stayed here for four nights in June and what a wonderful experience it was. The studio was roomy and so comfortable a home from home. Great bathroom and having a kitchen was a great help. It is very handy for travelling around and close to lots of great sights. Very safe, very clean cant wait to go back.", "Date": "August 13, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "4.0", "Value": "4", "Service": "4"}, "AuthorLocation": "Oslo, Norway", "Title": "“No complaints - exactly what we were looking for”", "Author": "David_of_Oslo", "ReviewID": "UR115744516", "Content": "I booked this as an 'unlisted' hotel because we were trying to save money and thought the risk was worth it. Unlisted means you book through a site like hotwire and don't actually know which hotel it is until you complete the booking, you just know the price, general location and rating. Benefit of taking this risk = better price. When I booked and saw it was Envoy Club I came here to read reviews and was a little concerned. They were hardly universally positive. But after a week staying there I can say I was pleasantly surprised, and we thought it was perfect for what we were looking for. Our room was big, very big by Manhattan standards. The neighbourhood was safe and reasonably convenient (Murray Hill is NOT in the absolute middle of Manhattan, so if this is what you want, choose another place), and the apartment style worked well for us. A doorman plus a staff member (most of the time) was enough to handle all of our requests. The bed was comfortable, with nice clean sheets, and the room was dark, cool and quiet at night. The two airconditioning units handled the NY heatwave perfectly. The kitchen wasn't new but it was clean and very usable. The bathroom was big and clean. As for the carpet - I'm not sure if we had new carpet or if previous reviews saw things that we didn't, but our carpet was 100% fine. Internet wasn't free, but it worked very well (a lot better than many hotels I've stayed in) so I was happy. My conclusion about Envoy Club is that it certainly wasn't as bad as some of these reviews make it sound. Whether you like it or not will all depend on what you are looking for - if you want something brand new, gives you the feeling of being right in the heart of Manhattan, has great views, and a really cool vibe, Envoy Club probably isn't the best bet. However, if you want great space, very practical pleasant apartment style and excellent value, Envoy Club could be a great option. My fiance and I had both been to Manhattan before, so we didn't need a rockstar place, we just needed a place that was a decent size, good quality, reasonably located (we actually liked getting some extra walking by staying in Murray Hill) and good value. Envoy Club was all of that and we would have no hesitation in going there again.", "Date": "July 25, 2011"}, {"Ratings": {"Cleanliness": "3", "Sleep Quality": "1", "Overall": "2.0", "Value": "1", "Service": "2"}, "AuthorLocation": "sydney", "Title": "“a disappointment”", "Author": "KOSSYDNEY", "ReviewID": "UR115167737", "Content": "the envoy club suites was recommended to us by friends . on arriving, it was a terrible disappointment!! our one bedroom self contained suite, was rather old. the carpet stained, windows dirty. bath plug broken.thankfully, however, to their credit, they fixed us a plug when requested on the second day. the springs in the sofa bed, stuck into my daughter's back, giving a very uncomfortable first night. the cleaning maid was very accommodating and put an extra comfort on top to improve things a little. the bathroom and kitchen, though old, was clean. i had booked a few months early, and specially requested a rollaway to be added for when my 23 year old son arrived, and confirmed this several times with reservations., and also on arrival. to which, no-one ever said, they were subject to the day!! so, we found, that the night my son was to arrive, there was no rollaway available!! i definitely would not recommend this hotel, unless you desperately need to be next door to the hospital. this part of town is not as pleasant as staying on the west side, especially upper west. true, you are not far from centre of town and the 15 bus is close by to catch to and from lower manhattan. however, if you are looking for somewhere with a nicer view and surroundings or pleasant area to walk, don't book here.", "Date": "July 8, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "4.0", "Value": "4", "Service": "3"}, "AuthorLocation": "Greeley, Colorado", "Title": "“Quiet comfort in a safe neighborhood”", "Author": "Glenmere7", "ReviewID": "UR115049245", "Content": "The Good: Given prices in Manhattan, I think the rates at Envoy Club are competitive and worth it for what you get. The location at 1st Ave. requires a 4-block aerobic ascent up E. 33rd St. to the No. 6 subway line at Lexington Ave. (downhill on the way home, though!), which gives it reasonably good access to the rest of Manhattan. It’s easily reachable from LaGuardia. I have stayed at Envoy Club on four occasions, mainly when in town to see Broadway shows. I like being away from the Times Square commotion but only 2 stops away from the theaters by changing from the 6 line to the shuttle at Grand Central. The suites are roomy and tastefully decorated in muted grays, blues and earth tones. In the suite I rented most recently, the bedroom was a generous 19x13 ft. and the living room was 19x12 ft. The living room includes a glass dining table with seating for four. There’s also an 8x9 ft. kitchen with marble countertops and clean, new, full-size major appliances, microwave and coffeemaker. The bed was comfortable, and linens and towels were of good quality. I found the furniture to be clean and in good condition. There are TVs in both the living room and in the bedroom and a stereo and fax machine (yes, a fax machine) in the living room. The windowless bath is decorated in classic white and black tile with attractive ceramic molding. Fixtures are modern and clean, including a tub/shower combination, and hot water was prompt and plentiful. There is substantial closet and cabinet space, including closets in the bedroom and in the entry vestibule. Service at the front desk is a mixed bag. Some staff are friendly and helpful, others are non-communicative and uninterested. There is a doorman who actually works for the apartments in the building that are not part of Envoy Club, but the added security presence is nice. The maid service was good. A fitness center is available for use, but I have never seemed to find the time to use it, so I can’t report on its quality. The location is close to the NYU Hospital on 1st Ave., so depending on which side of the building you’re on, it’s possible to hear emergency vehicle sirens (ubiquitous in New York, anyway). However, the Envoy Club occupies floors of the building that are high enough from street level to keep noise fairly minimal (ca. 5th-7th floors I believe). I heard no sounds at all from neighbors and always slept well. The Bad: As has been noted, the carpets are worn and due for replacement. However, I personally don’t find them bad enough to keep me from staying there. Unfortunately the place has cut corners in equipping the kitchen. I like to cook for myself at least part of the time and also invite a local friend to join me for dinner in, so the kitchen is one of the attractions of the Envoy Club for me. Basic flatware, dinnerware, cooking utensils, and pots and pans are provided, though in sparse quantities. However, unlike many vacation apartments, absolutely no additional amenities or conveniences are provided in the kitchen. There was not even a dish cloth or dish towel. I had to go to one of the nearby Gristede’s supermarkets to buy paper towels to put in the empty paper towel holder. I suppose when I checked out the paper towels I provided were removed rather than left in place for the next guest. Salt and pepper shakers are provided, but they’re likewise empty. The maid will leave a couple of little filter packs of coffee for the coffeemaker, but you might want to plan to buy some while there or bring coffee with you. Another thing to be aware of is that internet connection in your suite will be an optional extra that is separately billed. It was worth the extra charge for me to be online, and the internet connection available at a desk/work station in the bedroom was very functional. However, I would have preferred having internet connectivity included in the price of the room, and it wouldn’t bother me at all if the fax machine in the living room were dispensed with. The Ugly: Not that the management has any control over the views, but I’ll just note that the various suites I’ve rented over time have had very different views, from the Empire State Building splendidly framed in the living room window, to, most recently, a full-on view of a hideous nondescript building located across E. 33rd St. to the south, probably dating from the late 1960s. The windows in that monstrosity are cluttered with desperate and very tacky window shades and what appear to be stacks of manila folders. Shades of Novosibirsk. Other notes: There are at least two Gristede’s supermarkets in easy walking distance from the Envoy Club, for example just south on 3rd Ave., as well as numerous small groceries, delis and shops. I enjoy the Eastside Midtown / Murray Hill scene, including some interesting restaurants and taverns close by on 2nd Ave. It’s worth a walk in the neighborhood to discover some of the local opportunities. For example, I stumbled across a wonderful concert of Bach harpsichord music at the historic Moravian Church on Lexington Ave. near E. 30th St. There is also a multi-screen cinema around the corner on 2nd Ave. Macy’s is walkable from here as well. For me the positives outweigh the negatives, especially the location and the spacious interiors, and I’m likely to return to Envoy Club in the future.", "Date": "July 5, 2011"}, {"Ratings": {"Cleanliness": "2", "Sleep Quality": "3", "Overall": "2.0", "Value": "3", "Service": "3"}, "AuthorLocation": "UK", "Title": "“A bit odd...”", "Author": "UkTim2008", "ReviewID": "UR113089661", "Content": "This seems like a serviced appartment that doubles up as a hotel. I arrived to check-in at 2:45pm only to be told the check-in time was 3pm. When I asked what would happen between now and then I got the enigmatic answer \"much...\" That was actually worth the stay alone for humour. It's OK but a bit dark, slightly shabby and needs some attention. Zero hotel type facilities, but it does have a kitchen so if you need a bit of space that's good. The list of check-in rules is also amusingly Eastern European. If you check out after 2pm, not only will you pay for a full night, but you will also be charged a penalty fine as well!", "Date": "June 13, 2011"}, {"Ratings": {"Service": "2", "Cleanliness": "4", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "canberra, australia", "Title": "“Just like home”", "Author": "squishy_9", "ReviewID": "UR109135635", "Content": "The 2 bedroom apartment we stayed in was huge! the kitchen was as big as my one at home! the living room size was good, and the hotel was within walking distance to times square, the empire state building and the Rockefeller plaza. we had 6 people staying here and the pull out sofa was a little uncomfortable for adults. It might be ok for kids though, and the living room with the sofa bed was very noisy and let in a lot of light at night. the bedrooms were perfect though.", "Date": "May 20, 2011"}, {"Ratings": {"Service": "2", "Cleanliness": "1", "Overall": "2.0", "Value": "2", "Sleep Quality": "2", "Rooms": "2", "Location": "3"}, "AuthorLocation": "London, United Kingdom", "Title": "“All in all I was left disappointed”", "Author": "euanhusarmi", "ReviewID": "UR106984922", "Content": "I booked the Envoy Club Suites, because I really needed my kids (aged 11 and 14) to get a good nights sleep (separately) after flying in late evening from London. The block itself is on the east side of mid-town, and was easily accessed from JFK, even on a Friday evening. The suite we stayed in was a corner unit,had 2 bedrooms and 2 bathrooms, and we made use of the sofa-bed provided in the lounge area. Unfortunately, the sofa bed was such poor quality that my son had to sleep on it at a strange angle (his feet a good six inches below his head). What was more disappointing, was the fact that as it was a corner suite, there were approximately 8 sets of roman blinds to adjust to cover the windows. Half of these did not close properly, and the brass ropes were very dirty (as were the curtains themselves). Furthermore, the noise form the traffic (why does everyone hoot 24/7 in NYC?) was very audible. The carpets really were dirty, and black in some places, and it is so so frustrating to me when this happens, because it shows that the owners really do not care. The second night we stayed there was a very loud party going on in the room above till at least 1am (which I know can happen at any hotel) but this also soured my stay. I truly believe, if they changed the carpets and the curtains, thus would be a very nice place to re-visit, and worth 4 stars from me. In its current state, I would unfortunately advise against staying here....sorry", "Date": "May 5, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "long island new york", "Title": "“Best weekend ever- LOVE the Envoy”", "Author": "jgraci09", "ReviewID": "UR106489736", "Content": "This is the 2nd time my girlfriends and i have stayed at the envoy and i cannot say enough. the rooms were beautiful and spacious! we had a great time. the roof top was the best part of our vacation as we spent the whole day laying in the beautiful sun. the elevators werent working 100% and that is something they may need to fix in the future. other than that, our stay was great!!!!!!!!!!!! These are apartments, and not your typical hotel with bar/lounge near the check in area so it might not be for everyone...however i will only stay at the envoy club when i visit NYC again.", "Date": "May 2, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "3"}, "AuthorLocation": "MN", "Title": "“Not a bad place to stay!”", "Author": "lyndajoMn", "ReviewID": "UR104035898", "Content": "Stayed here as it was across the street from NYU, and reasonably priced. No extra ammenities, but it was very clean, close to restaurants, close to NYU and reasonably priced. Only stayed for one night (business trip), but would definately stay here again! The desk is only open 9 am until 8 pm, but there is a doorman at the front lobby 24/7. There is no business center, but the front desk staff were very helpful when I needed a document printed from my email (I forwarded it to them and they printed it for me). It seems to be a place for NYU patients, maybe, and NYU physician visitors. Very clean, pet friendly (where isn't it in NYC?).", "Date": "April 14, 2011"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Overall": "3.0", "Value": "4", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "", "Title": "“Good Weird Hotel”", "Author": "Highclasslowrent", "ReviewID": "UR94205775", "Content": "OK here it is. Good - Location, room layout, kitchen, water view. Bad - Certain staff feel that they are doing you a favor to help you - not Shavar sp? he was great and the reason we may stay again. Others - not so great. Rooms were cleaned well but not vacuumed well. Go figure. BUT you get a vacuum in the room so go to it. This place is in many ways a hotel in name only. It is 1/2 a converted apartment bldg shared with tenants of the apartment in the rest. The hotel staff and apartment are different. No bellman for hotel guests. Concierge is limited in scope and hours. $50 charge for late checkout. WARNING: Call ahead if checking in late - be sure you room is ready.", "Date": "January 23, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "2"}, "AuthorLocation": "Cape Cod", "Title": "“Stay here!”", "Author": "MertonCapeCod", "ReviewID": "UR93063350", "Content": "Skeptical about mixed online reviews of this hotel but booked room because it was affordable and convenient to event we were attending. Delighted with studio room #711 which has a view of the Empire State Building. Yes, we've had cleaner, newer rooms and softer bedsheets elsewhere at higher prices but this was comfortable and quiet and $159. The immaculate kitchen is well-equipped and offers standard range and refrig. We were surprised at how instantly we got cabs here, even at 6:30 a.m. but being next door to a huge medical facility probably explains that.", "Date": "January 15, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Phoenix", "Title": "“This Place was Awesome!!!!”", "Author": "JRMAZ", "ReviewID": "UR88759736", "Content": "I read the many reviews for this place and I kept saying to my husband, what is everyone's problem? This place was awesome! The carpets first off were clean and the hallway leading up to our room was nice and clean and well lit. The room was very nice. We had a one bedroom suite on the 5th floor. The place looked just like an apartment. Nice living room, dining area, kitchen, bedroom and bathroom. The bathroom was nice and clean and stocked with toiletries, the bedroom was nice and the bed was so comfy i wished i had the same bed at my house! The bedding was comfy and clean and the pillows were so soft. My teens didn't care for the pull out sofa bed so one slept on the couch and one made a bed on the floor with the couch cushions. That worked well for them. The maid cleaned everyday and it smelled so clean when we came back to our room each day. She even washed our dirty dishes for us. That's beyond the call of duty i think! We asked the front desk for extra bedding and towels and when we returned to our room they were waiting for us. We checked in late around midnight and had no problem getting our room key from the door man. The neighborhood was safe and we enjoyed walking around. It was close enough to walk down town to the Thanksgiving Parade. The subway is just about 5blocks away. I don't know what everyone was complaining about. The place is awesome and well worth the money we spent. Previous customers who stayed must be used to staying at the Waldorf Astoria. But for the price, location, etc. this place was perfect. What was everyone complaining about the carpets for? They were nice and clean and didn't look too old. All I know is my stay was fabulous and I'm sure I'll stay here again if i ever get to come back and visit New York City.", "Date": "December 1, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Edmonton", "Title": "“Absolutely worth it .”", "Author": "Orchidmandy", "ReviewID": "UR87792037", "Content": "Okay I am a research internet junkie ... I rely on trip advisor but also do tons of my own research and I ended up staying for my first stay in New York at the Envoy Club & Suites. Simply stop doing anymore research and book here. New York hotels are so incredibly expensive and typically very small. However the Envoy was very reasonable and the 1 bedroom suite was fantastic. We had coffee and breakfast every morning in our suite as we planned what we wanted to do that day... It saves you lots of money that you can use elsewhere in New York. You live among the locals, and truly experience what living in New York is like. The king bed first had NO BEDBUGS was a luxury mattress with smooth linens and duvet comforter. The toiletries were fantastic and I NEVER use hotel shampoo but i used these and they were high end and fantastic too. The kitchen had a full size natural gas stove, fridge, dishwasher, granite counter top and all the supplies you need. It was great having a dining room area, and a living room area to converse in. I walked to times square and the empire state building many times. It is so close to a deli, conveniance store and restaurants. It has a nice roof top deck that they don't tell you about at the concierge but its fabolous for photos and a drink. The maid service was also fantastic. They were very friendly and they did an amazing job cleaning. The bathroom was completly sanitized from corner to corner everyday. The only set back was concierge does leave at 8pm, so make sure you have any requests in before then. The doormen were always friendly and willing to help. The wireless internet was $24.95 for the week and always worked.", "Date": "November 21, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Knoxville, Tennessee", "Title": "“Uncomfortable”", "Author": "Chris123185", "ReviewID": "UR84279601", "Content": "The beds suck. For $300 a night, you would expect a bed where springs don't stick into your back. I wish I had my sleeping bag so I could at least sleep on the floor and not have stuff sticking into my back. Also the pillows are lumpy and uncomfortable. As for everything else, not very nice, I wouldn't call this a 3 star hotel... I have stayed in nicer Knights Inns.", "Date": "October 21, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Sleep Quality": "3", "Rooms": "1", "Location": "1"}, "AuthorLocation": "Falmouth, Massachusetts", "Title": "“OLD, DISAPPOINTING & WAY OVERPRICED”", "Author": "lucky078", "ReviewID": "UR78647575", "Content": "The area was awful. I expected the place to be much nicer for $315.00 per night. We tried to get a room at The Beekman Towers everything was booked . So if you like broken lampshades, foriegn pubic hair in the bathroom, stained curtains, and a stale smell coming from the air conditioner, then this is your place. I nicely asked the front desk if they could at least match the price of the beekman ( which was much nicer with a beautiful bar/resturant on the 26th floor) for $245.00 a night, I was told no. The only good news about this hotel is the staff seemed nice & we didn't see any bed bugs.", "Date": "September 7, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Vancouver, Canada", "Title": "“Live like a NYer”", "Author": "VancouverValleyGrl", "ReviewID": "UR75208154", "Content": "This suite hotel/condo was a great choice. The king bed was comfortable, the kitchen was beautiful with granite countertop and water/ice-cube dispensing fridge, nice space/storage, had clothes-drying rack. The walk to the 33rd Street subway was a little far in the immense heat, but would be just fine in cooler weather. Attractions all located within a $10 cab ride from here. Only real complaint would be the carpeting that needs to be changed/cleaned.", "Date": "August 14, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Newcastle upon Tyne, United Kingdom", "Title": "“Value for Money”", "Author": "ChicoHutch", "ReviewID": "UR74153315", "Content": "Stain on the carpet !!!!!! so what !!!!!!!! Excellent value for money, especially in Manhattan Quiet area, kind helpful staff, everything was functional, I couldn't ask for more. If I am lucky enough to return to New York, I will have no hesitation in booking with Envoy Suites once again.", "Date": "August 7, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "2", "Overall": "2.0", "Value": "4", "Sleep Quality": "3", "Rooms": "3", "Location": "1"}, "AuthorLocation": "Syracuse, New York", "Title": "“You get what you pay for”", "Author": "rak58", "ReviewID": "UR68182888", "Content": "Booked this Hotel through Priceline, and for the money ($199/night), it wasn't bad...especially for New York standards. I always use Tripadvisor before planning a trip, and had read many reviews about the Envoy Club before I booked. That said, most of the reviews about this hotel are accurate. I chose the Envoy for its proximity to our daughter in the Murray Hill area of the city, and cost. Having spent many weekends visiting the city, I am always looking for good, clean, and reasonably priced accomodations. I am always amazed at the prices that hotels charge in this city! For the most part, The Envoy Club Suites met my needs. First, the good part: At $199 per night, this place is a bargain in New York City. The suite was large and had a full kitchenette. The appliances were clean, the bathroom was large (although a bit outdated), the bed was comfortable, and the linens were clean. Except for the occasional ambulance noise (the hotel is located accross the street from NYU Medical center), the neighborhood is extremely quiet and safe. Now the bad: The Envoy Suites Hotel isn't really a hotel at all. Rather, I got the feeling that an individual/group purchased a number of studio apartments within an apartment building and run their \"hotel\" out of the building. Except for its close proximity to the hospital, it really is not in a convenient location at all. The lobby is quite nice and there is a doorman at the front desk for the apartment building. There was a small desk around the corner for the Envoy Suites, but I never saw anyone at the desk. It was always unattended. So concierge service is non-existent. The doorman is useless. So basically, check-in consists of picking up your key at the front desk from someone unaffiliated with the \"hotel\". Once you get past the nice foyer, this hotel goes downhill fast. Exiting the elevator reminds one of an old college dorm, in desperate need of an overhaul. The lighting is dark and the carpeting is stained. Really a horrible first inmpression. Our suite (#411) was at the end of this dark hall, around the corner. My initial impression was that we had to leave...fast. But after a day of travelling, we were too tired to think about that option. Entering the suite was a pleasant surprise. It was quite large by NY standards and well appointed. One of the curtain sheers was quite stained from water, and there was a glass stain on the table, but other than that, the room was pretty nice. Again, the carpet was in need of replacement. There were two safes in the closet. They were not operational, and were not bolted down...kind of odd. One of the two air-conditioners worked. I didn't bother to tell anyone because I knew from previous reviews that noone was around to help me anyway. Given, that the weather was 90-plus degrees and humid, this was a bit of a nuisance. So for $199/night in NYC, this traveller got a lot of space, in an inconvenient location, with no guest services, in accomodations equivalent to your typical roadside hotel/motel. A little rough around the edges and in need of an upgrade. Would not stay here again as some of the larger hotel chains have rooms with comparable prices in town. The difference being that at least there is someone around in case you need something.", "Date": "June 21, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "2.0", "Value": "1", "Sleep Quality": "2", "Rooms": "2", "Location": "2"}, "AuthorLocation": "Miami, Florida", "Title": "“No Luxury at all!”", "Author": "stay99", "ReviewID": "UR65170034", "Content": "I have to start out by saying this is my first review I decided to write because I am started to rely on the reviews of Trip Advisor. On a scale of 1-5 I rate hotel a 2.5 because the best thing I would say –is the space. Yes it’s better than a hotel but you will have other issues to contend with. The space is only other reason I did not rate it a overall ZERO. But the condition s I can definitely give a zero… The entrance of the condo is a fabulous mask indicating luxury because behind the mask—aint no luxury After exiting the elevator onto the 5th floor I was first greeted by the most horrible smell and grease & grime on the carpet and walls. I opend the door to the condo and again I was welcomed in with a foul and moldy smell along With the inside carpet having the same grime matching the outside.. I toured the condo to inspect what I was getting myself into and wow was I shocked to find the following— Very old and USED furniture in the Living Room with ripped fabric hanging off The dining room table was shaking from side to side as if it was on its last legs—the matching chairs Were just as old and in very bad condition The kitchen was clean and very functional but the fridge did not get my drinks cold and the dust lying on top of the fridge was enough to send my sinus soaring… The first bedroom—nothing fancy or luxury not even close—a spacious size bed—I am thinking it was a queen but after tuning down the white comforter—it reveal what I expected was stains on the sheets The first bathroom was clean – but again nothing luxury or fancy about it— The master bedroom was a good size but the soda cans left under the bed—the dust again and of course stains on the sheets—were also very visible. Once the tour was done I immediately exited the condo to head to the store to buy cleaning and dusting supplies. I didn’t even think of complaining because no one was around to complain to and it was late at night when I arrived So my family and I decided to make lemonade out of the lemons that was given to us.. We traveled so far and we have been planning this trip for months so I decide not to get too upset but try and clean it up to make it comfortable for all of us.. I was prepared for some things, I brought my own sheets and towels and wash cloths because based on previous reviews. I was really shocked about the condition of the furniture. I have stay in other rentals and this has to be hands down the worst…. I will leave on a positive note and state the roof top view is great and it has tables and chairs to relax on and also the cinema room is good. One suggestion take the word LUXURY out of any reference pertaining to the Envoy Club.. Bring your own cleaning supplies, sheets and towels don’t forget a pair of slippers because walking barefoot is not an option unless you want to catch some unknown disease on your foot.", "Date": "May 24, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "3", "Overall": "3.0", "Value": "2", "Sleep Quality": "1", "Rooms": "2", "Location": "2"}, "AuthorLocation": "Philadelphia, Pennsylvania", "Title": "“Not worth the money”", "Author": "destinationqueen", "ReviewID": "UR63251720", "Content": "I stayed in their one bedroom suite which I shared with someone. Upon check in, our room was not ready so we asked that they hold our bags. When we came back, we discovered that our bags had been kept in the public hallway (where the mailboxes are) the whole time! They advised us that new keys had been cut, and it may take a few trys for it to work. After many trys, we got the doorman - who couldn't get it open after several minutes - HUGE inconvenience! The room was spacious and the kitchen equipped with the barest of essentials - 2 cups, 3 plates, 4 forks, 1 knife. The bathroom appeared to be clean until you closed the door and saw that behind the door was covered in mold. I chose to stay on the pullout - typical type bed, uncomfortable, but a bed alas. We did have to ask for extra towels as they did not replace ours, even though we left them on the floor. When they brought extra towels (we explained that we needed 2 sets) they only brought one. The location of the hotel is in a very nice quiet neighborhood about 4 blocks from the subway. If you like peace and quiet, but have to stay in the city, this is a good location. There are several delis and cafes within walking distance but not much else, as this is mostly a residential area.", "Date": "May 4, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Lords Valley, PA", "Title": "“Suprisingly good value for a Manhattan accomodation.”", "Author": "msellie1", "ReviewID": "UR57650536", "Content": "Stayed here while my spouse was having surgery at NYU. The room was larger than expected, and the staff was very nice. I had no problem getting extra towels, and the concierge was very attentive.", "Date": "March 3, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Location": "4", "Rooms": "5"}, "AuthorLocation": "Massachusetts", "Title": "“Spacious and New York hotel room in one sentence?”", "Author": "margalo399", "ReviewID": "UR53492721", "Content": "I was pleasantly surprised by the studio room I rented for a long weekend. A beautiful kitchen stocked with dishes, flatware, cookware, microwave and utensils was a wonderful way to curb expenses by eliminating a few restaurant meals. The bed was comfortable, and there was ample closet space. The bathroom was bright and roomy. The rooms were spotless--the cleaning staff was excellent--and there was even a view down First Avenue with a glimpse of sunrise. There never seemed to be anyone at the \"concierge\" desk, so I suppose that if I needed more than the room key at check in, it could have been an issue. Location was pretty far over on the east side, but certainly midtown enough to be walkable to many things. In all, I was delighted by the spaciousness; it felt as if I had an apartment in the city, instead of a hotel room--which was a lovely experience.", "Date": "January 14, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "2", "Overall": "1.0", "Value": "2", "Location": "2", "Rooms": "2"}, "AuthorLocation": "Rhode Island", "Title": "“Stay away unless you can operate without ANY service.”", "Author": "MamaPillow", "ReviewID": "UR52577346", "Content": "The room was well appointed, but 3 key problems occurred that you should know of. The non-smoking room clearly is smoked in--heavy smell of it. The heat was in over-drive and we had to leave the windows open all night to regulate. Being near a hospital (ambulances) made it a sleepless night. Last, and most important, THERE IS NO ONE AROUND, NO SERVICE, NO ONE TO CALL, after 7pm. So our problems went unsolved. After repeatedly calling them days/weeks after for a rebate or something, NO one returned messages.", "Date": "January 4, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "5.0", "Value": "4", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Dublin", "Title": "“Very Happy Experience”", "Author": "LawlerDublin", "ReviewID": "UR49472023", "Content": "I stayed in Enjoy Suites for 4 nights in a 2 bedroom apartment. We were delighted when we opened the door to see how big the apartment was. We were on the corner of the building too which was great as we had glass going right the way round the living area. Housekeeping knocked in every morning we were there to clean and supply fresh towels which i didn't expect every day but was great. Location wise the apartments were excellent. We walked almost everywhere. You are pretty much in the middle of things with the empire state only a few blocks away. Also when we arrived it was dark. We had heard there was a roof garden so we had to take a look. Its on the 24 floor i think. Wow, what a view.... pretty cool to have a great view of the New York sky line from the building you are staying in. Would much prefer the apartment we had in envoy suites to a hotel as have now done both. The only negative point I would have is one of us was sleeping on the pull out sofa bed and was the most uncomfortable sofa bed I've ever lay on. But in the bigger picture of things this didn't take too much from everything. Who needs sleep in New York anyway!!", "Date": "November 18, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "4", "Rooms": "5"}, "AuthorLocation": "Medford, Massachusetts", "Title": "“Huge Room in Manhattan”", "Author": "aharmonix", "ReviewID": "UR49324366", "Content": "Usually a 3 star hotel in Manhattan means you'll have just enough room to get your bags in and maybe walk down one side of the bed to get in it. The Envoy on the other hand has huge suites. It felt like a 3 room apartment with a living room and a kitchen. It didn't feel old or run down either. Nice place, I would go there again in a heartbeat.", "Date": "November 16, 2009"}, {"Ratings": {"Overall": "1.0", "Value": "1", "Service": "1"}, "AuthorLocation": "WI", "Title": "“Go somewhere else!”", "Author": "seven151", "ReviewID": "UR48974137", "Content": "No internet service that works in the rooms. When I asked the concierge, who is very hard to get a hold of (let phone ring for 20 minutes once) instructed me to get hold of the internet service provider myself. The maids will wake you up every single day regardless of a do not disturb sign with a knock a doorbell ring to let you know that they are around to clean your room and if you don't let them clean it they won't be back to clean it later. The carpets are dirty as well as the wallpaper with stains and this is throughout the interior of building. There is only one concierge around during the day and at night you can leave a message on an answering machine that does not work which is not helpful to say the least. All of the lights in the room are energy saving so it's very dim lighting. For 200 bucks a night this is absolute robbery! Television has 20 channels.", "Date": "November 11, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Location": "4", "Rooms": "5"}, "AuthorLocation": "Harrisonburg VA", "Title": "“Spacious bedroooms for NYC, great kitchen”", "Author": "travel_fan_van", "ReviewID": "UR46246448", "Content": "These are unrented apartments so they are much more spacious than a hotel room. We were traveling with children and adult friends so it was great to have so much room. We were on a budget so we were happy to find the kitchen fully equipped. I couldn't get over the size of our master suite. Although the carpets were worn and the wallpaper drab everything was clean. I hope we can book the Envoy Club for our next NYC trip.", "Date": "October 8, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Bellevue, Washington", "Title": "“Terrific furnished apartments in the heart of Murray Hill”", "Author": "swc26key", "ReviewID": "UR41668369", "Content": "My wife & I stayed 4 nights in total comfort. Rooftop deck (22 stories up) is amazing with views from East River to the Manhattan skyline. Large one bedroom suites (or 2 bedroom also) with 2 TV's & all the comforts of home. We will surely become regular visitors.", "Date": "September 14, 2009"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "2.0", "Value": "3", "Location": "4", "Rooms": "2"}, "AuthorLocation": "", "Title": "“Well.......stay only if you can't find anything else”", "Author": "smittygirl1966", "ReviewID": "UR40352192", "Content": "Stayed for 3 night with our two small children. Had originally booked at the Affinia in a suite but when we changed out dates they didn't have anything available and in the same price range, for a suite, this was the only other place in the same price range. A suite was important to us so the kids had a seperate sleeping area. Location is good. Having a kitchen was a nice feature but we never ended up using it. Sofabed was horrible but fine for a 7 year old. Anyone older/heavier wouldn't be able to sleep comfortably as mattress springs poked through. We also had a rollaway and there was no space left. Bed in bedroom was comfortable but room and bed were tight. Bathroom was adequate but anything screwed into the wall was falling out - toilet paper holder, shower soap tray, towel rack, etc. However the room was dirty!!! Carpets and splatters allover the walls and even the air conditioner. Nothing that couldn't be cleaned off with a SOS pad and some Mr. Clean!!! No excuse if you ask me. Complained to the front desk and they couldn't have cared less. Asked to move rooms but they said they were fully booked. Also the safe is a big joke. Yes there is a safe and yes you can lock your things away. However it isn't attached to anything and ways around 10 pounds and can be easily picked up, tucked under your arm and taken away!!!! Wouldn't stay here again and wouldnt recommend to anyone else unless you really need a suite/apartment and there is nothing else availabe. Maybe we simply got what we paid for???? Remember this is NOT a hotel. It is an apartment building. No services and no restaurants, etc.", "Date": "September 9, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "4", "Rooms": "5"}, "AuthorLocation": "Richmond, VA", "Title": "“If you prefer a quite place to stay...this is it!”", "Author": "Margaret025", "ReviewID": "UR37368275", "Content": "Stayed in 1 BR on the fourth floor which was newly refurbished and spacious. Very comfortable queen bed; teens (17 and 19) didn't complain about queen sleeper sofa. No traffic noises; quiet building; no loud parties, folks walking in the corridors at night. Great bathroom. Really no complaints. Didn't utilize kitchen; not enough glasses/plates, etc. but we just washed them by hand after each use. I loved going to the rooftop deck at night: the city views are awesome. M34 crosstown bus very convient; subway at 33rd and Park -- a short walk. Concierge staff were friendly and helpful, though not always at the desk. We were able to leave our luggage in the mailroom until check-in. We requested additional towels and pillows (the unit was stocked for 2 people, not four) which were provided a few hours later. Remember-- this is not a hotel and the service, though excellent, may take a bit longer. Fred promised to deliver towels and pillows before his shift ended and we returned after dinner to find the items in our unit, as promised. I will return again and recommend this place without reservation!", "Date": "August 11, 2009"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Location": "2", "Rooms": "2"}, "AuthorLocation": "BsAs", "Title": "“Highly dissapointed”", "Author": "FamilyBsAs", "ReviewID": "UR37094804", "Content": "We stayed 3 days and nights.The place has been once decorated but now has very dirty carpets. We arrived and found bread pieces between the linens, TV didnt work and remote control had no batteries or cover.Nobody answered to these complains in three days. Would never go back, left my complaint in their answering machine while I was there and never worried to answer me.", "Date": "August 8, 2009"}, {"Ratings": {"Service": "1", "Cleanliness": "3", "Overall": "2.0", "Value": "4", "Location": "2", "Rooms": "2"}, "AuthorLocation": "Memphis", "Title": "“Descent hotel, terrible attention to detail.”", "Author": "revstrick", "ReviewID": "UR36825574", "Content": "I'm here for 3 weeks. The wireless connection worked for one week even after daily complaints and assurances it was working fine. Receptionist answers the telephone one out of 5 times...voice mail the rest of the time. NEVER a return phone call. Soap for bath was replaced once. It seems like they're really not interested in the 'hotel' side of this condo unit. Less than satisfying experience. Would definitely recommend to friends again. Unfortunately we have 3 couples joining us for the weekend...3 more units rented....but not again. Too bad. Great potential.", "Date": "August 5, 2009"}, {"Ratings": {"Service": "1", "Cleanliness": "2", "Overall": "1.0", "Value": "1", "Location": "2", "Rooms": "1"}, "AuthorLocation": "NY", "Title": "“Worse than awful”", "Author": "Elisheva1", "ReviewID": "UR34924610", "Content": "Do you consider a funtioning bathroom to be a basic amenity? If the answer is yes, do not even consider staying here. My mother was having open heart surgery at NYU Medical Center and my father wanted to be able to stay nearby and made a reservation at the Envoy Club. He asked repeatedly if there was a pull out sofa in the room in case another family member needed to stay as well. He was assured that there would be a sofa in the room. Well, no pull out sofa, no sofa at all. But most disturbing of all was the fact that the toilet stopped flushing and there was no one available to fix it! Ultimately, the staff of the private residences in the same building came to snake the toilet. I was told that there was no other room in the whole building that my father could have and that there was no way anyone could refund our money before morning if we were to leave. Oh, and did I mention that the phone in the room did not work properly either? And that the cot that was ultimately provided was no more than 65 inches long? All in all a disgusting way to treat any guest and that much worse that we were there to deal with a serious medical problem and all we needed were very basic services. Stay here at your own risk.", "Date": "July 16, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "NJ", "Title": "“Great place to stay in Manhattan!!!”", "Author": "fordhotrod", "ReviewID": "UR32062694", "Content": "For less than the price of a hotel room, you get a studio apartment with a fully equipped kitchen. The rooms are clean, comfortable and more like a home-away-from-home than an impersonal hotel room.", "Date": "June 10, 2009"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Overall": "5.0", "Value": "5", "Location": "4", "Rooms": "5"}, "AuthorLocation": "Ballwin, Missouri", "Title": "“Expect to be staying at an apartment”", "Author": "Richland34", "ReviewID": "UR31986751", "Content": "I think most of the disappointments noted by other travelers is that they may have expected a hotel. THE ENVOY CLUB IS NOT A HOTEL. It is much more like an apartment building with short term rentals and a few extra services to make your stay more enjoyable. We stayed at Envoy Club May 29-Jun 3 and absolutely loved it! We had a studio apartment and used the loveseat sofa bed for our daughter. (The bed was not that comfortable, but we were all dead tired each night.) The limited service provided clean towels each day and tidied up our kitchen for us. Our bed was also made. This service is optional, but we accepted it to get the clean towels. We loved the full kitchen, espeically for reheating wonderful restaurant meals which were just too much to eat at one sitting. Microwave popcorn was also handy. The bathroom was clean and well equipped with a great shower. Once we learned how to use the cross town M34 bus, the location was great. If you're only using the subway, the hike to the 6 is several blocks. The cross town bus is a breeze. High-speed internet (wi-fi) in the room worked perfectly. The rooftop deck is fantastic! Great views day and night. Didn't use the fitness room or the laundry. Great bagel shop around the corner and Rocky's on Second Ave for Pizza is excellent. I also enjoyed Ali Baba for Turkish food on 34th...a very short walk.", "Date": "June 9, 2009"}, {"Ratings": {"Service": "2", "Cleanliness": "2", "Overall": "1.0", "Value": "1", "Location": "4", "Rooms": "1"}, "AuthorLocation": "miami", "Title": "“Bad Choice”", "Author": "godhotels", "ReviewID": "UR27580082", "Content": "We had extended family in 4 rooms, all types. The rooms are very large and that is great but the carpets are so terrible that you feel like the entire place is dirty. The carpets are stained badly and in terrible need of cleaning or replacing. Most of us used our shoes or double socks to walk around. I would not stay there again which is a shame because it would take so little to make the place a real bargain.", "Date": "April 7, 2009"}, {"Ratings": {"Service": "1", "Cleanliness": "2", "Overall": "3.0", "Value": "2", "Location": "3", "Rooms": "5"}, "AuthorLocation": "Vancouver, BC Canada", "Title": "“Service? What Service?”", "Author": "DC604", "ReviewID": "UR27253758", "Content": "My boyfriend and I stayed at Envoy Club for 3 nights in March. I had called ahead 3 weeks prior to our arrival and requested early check-in... we got to the hotel at 915 am and there was no one at the front desk, the doorman said someone would be there ``soon`` (even though the hours posted stated that service personnel would be there at 9 am) a guy finally showed up around 930 and just looked at us and asked if we were checking out. I told him we were super early, but requested an early check - in and asked what time we could come back... he told us at around 2 our room would be ready (not 3 pm, the usual check in time) *not impressed* and then told us to leave our bags in the mail room... (anyone else find that a bit odd? leave all your belongings in an unlocked, unattended mail room?) So, we leave... have a wonderful day in the city... return to the hotel after 2 (maybe 210) ... room still not ready, come back at 230ish (so much for early check -in!!) When we actually got into our room, it was GORGEOUS! We had a studio and it was spacious, clean, and the bed was fantastic! Loved the kitchen and all the mirrors in the bathroom! Each day we went out, we requested the room be made up (having a full kitchen, garbage accumulated as we cooked all our meals in the room) Not once during our stay was the room made up. The final day, I called downstairs to the front desk and spoke to the guy who we dealt with on the first day... I asked why the room hadnt been made up at all and he told me housekeeping was still doing the rooms (this was 530 pm!!!) so I requested that SOMEONE come to our room to pick up the garbage and no one came... *VERY UNIMPRESSED* ...hence the title of my review.... SERVICE? WHAT SERVICE?", "Date": "April 1, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "rhinebeck ny", "Title": "“AAA+”", "Author": "lewco", "ReviewID": "UR26629123", "Content": "Great staff ,....Super rooms ...,Great location......Great value", "Date": "March 22, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "5.0", "Value": "4", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Lomas de Zamora, Buenos Aires", "Title": "“Spectacular vacations in NY”", "Author": "NICOale", "ReviewID": "UR26112238", "Content": "We stayed in a lovely one bedroom apartment for 10 days, from Dec 26th till Jan 5th, 2009. It is so well located that we could go walking everywhere: Empire State, United Nations building, 5th Avenue shops. Subway is 3 blocks from Savoy Club and several bus lines pass 1 block from it. We had a wonderful experience in NY. It was the 1st time for me and my two teenagers. We had some frozen days but it was a pleasure when we arrive \"home\". It was so heated that some times we had to turn off one of the heaters. The bedroom was very comfortable, charm and large. We used the sofa bed for my boy (17 years old) in the living room and it was perfect. Sara Azulay, the person I was in contact to make the reservations was extremely nice and answered me all my questions and doubts. Staff in the building helped us a lot. Surely we will stay there in our next visit to NY. I really recommed Savoy Club!!", "Date": "March 13, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Honolulu", "Title": "“Excellent Experience”", "Author": "stina808", "ReviewID": "UR25908421", "Content": "My boyfriend and I stayed in the Envoy Club's 2 bedroom suite during the last week of January, 2009. I was extremely satisfied with the Envoy Club. Fred helped us with check-in and was refreshingly courteous and helpful. The room was spectacular--not only clean but with nice furnishings and everything one could hope for for an extended stay: full refrigerator, microwave, stove, kitchen sink, etc etc. I highly recommend this hotel and will definitely stay here again on my next trip to New York.", "Date": "March 10, 2009"}, {"Ratings": {"Cleanliness": "5", "Overall": "4.0", "Rooms": "4", "Value": "4", "Location": "5"}, "AuthorLocation": "Long Island, New York", "Title": "“Would definitely recommend.”", "Author": "MeloPeach", "ReviewID": "UR25002210", "Content": "We only needed one night and didn't want to spend a lot of money. My husband found this two bedroom apartment for $199. It fit our needs just right. The only downside to the room we had - 410 - was the cigarette smoke that seeped in from the other apartment. The master bedroom, bathroom, and closet reeked of it. So we were fortunate that there was another bedroom that was not affected by it. We were able to walk up to City Center for our show and walk to dinner too. Very convenient.", "Date": "February 23, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Business service (e.g., internet access)": "4", "Check in / front desk": "4", "Overall": "5.0", "Value": "4", "Rooms": "5", "Location": "3"}, "AuthorLocation": "Denver", "Title": "“Efficient and comfortable residence”", "Author": "FultonDenver", "ReviewID": "UR22683183", "Content": "This is a real good choice for multinight stays. The Envoy Club rooms are surprisingly spacious, clean and well maintained. The staff work hard to please. I would definately return.", "Date": "December 12, 2008"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Business service (e.g., internet access)": "3", "Check in / front desk": "3", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "northamptonshire", "Title": "“Good Accomodation/great location”", "Author": "kezabelle23", "ReviewID": "UR21815908", "Content": "I have just returned from a 4 night stay at the envoy club, 377 east 33rd street, new york. I was a little worried from previous reviews but was very happy on arrival as all the carpets were being replaced in the hallways which seemed to be what people who have written previous reviews had complaints about. The 1 bedroom apartment had a full kitchen with microwave,dishwasher and cooker, the living area has a double sofa bed and the double bedroom has tv and hairdryers. The hotel is in a great location just a a few blocks from the empire state building (on 33rd street and 5th ave) and grand central station. There is a fantastic delhi by the hotel which is great for breakfast and a cinema around the corner, times square is a 20 minute walk away. This is my second visit to new york and I would stay at this accomodation again.", "Date": "November 13, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "4", "Overall": "4.0", "Value": "4", "Rooms": "5", "Location": "4"}, "AuthorLocation": "New York", "Title": "“Great place must have been upgraded!”", "Author": "mrbig247", "ReviewID": "UR21798308", "Content": "I had made my reservations prior to reading trip advisor but I decided to keep reservations and give it a shot. A few things to note, the carpet in the hallways was BRAND NEW, with even the new carpet smell! The staff was friendly and courteous, assisting with all requests as needed. Big thanks to them for their assistance with directions. The apartment suite was spaceous with a Kitchen that was a generous size for a one bedroom apartment in NYC, with all appliances and items a kitchen would need. As I was in for business, it was great to be able to cook meals while i did my work in the apartment. (The wireless internet worked great and at a reasonable rate) I will be staying at the Envoy for all of my future needs, as I am working with a company right in the area.", "Date": "November 12, 2008"}, {"Ratings": {"Service": "2", "Cleanliness": "1", "Check in / front desk": "2", "Overall": "1.0", "Value": "1", "Rooms": "1", "Location": "3"}, "AuthorLocation": "Virginia", "Title": "“Oh my GOSH, this place is a disaster!”", "Author": "MemeVirginia", "ReviewID": "UR19117486", "Content": "Oh my gosh! I don't know where those pictures come from on the web site and did the management right those lavish reviews but this place was a mess! I had to wear shoes to walk on the floor; the carpet had stains and mildew. The only thing was clean was the white linen, what a surprise. I had to put the extra sheets on the sofa in order to sit down. I paid about $400 for a 1 star room. I travel a lot and I never had this experience.", "Date": "August 19, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "4", "Check in / front desk": "5", "Overall": "4.0", "Value": "4", "Rooms": "5", "Location": "3"}, "AuthorLocation": "San Francisco, California", "Title": "“\"We're Impressed!\"”", "Author": "jackson8", "ReviewID": "UR14800089", "Content": "Katie and I are here for school vacation - her first time in NYC - and i figured all we really need is reasonably clean and quiet: anything more is a bonus. Happy to report that Envoy Club came through with flying colors. Our roomy 7th floor studio is perfect, in the back so very quiet, me on the double bed and Katie on the convertible. Mattress is 'firm', not my personal choice, but quite comfy. Fold-out is basic but K is very happy, especially after she commandeered my down comforter, leaving me a blanket. Wi-fi is $10. kitchen is well equipped, bath is superb, both are squeaky clean. Linens are Frette, crisp and new. Carpet and floors easily pass the Barefoot Test. Staff are very professional and helpful - good advice on local eateries, and when i told them about the toilet running and the smoke alarm beeping, both were repaired pronto. Envoy would be a 5 except for the location in Kip's Bay or Murray hill, i cant figure which. it is off the beaten track in lower midtown. We're walkers, but some might like to be closer to the action. on the other hand, it is very close to two of our new faves, 2nd Street Deli, with the best pastrami on the planet, between 3rd and Lex on E33rd, and LaSalle Ice Cream at 489 Third, where all is house-made by hand, and just superb - better than Italy. Try the Mango ice, or any of the gelatos - you won't believe they are low fat. Cheers!", "Date": "April 4, 2008"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "LONDON", "Title": "“What a great Place to Stay”", "Author": "KUSHTI", "ReviewID": "UR14453716", "Content": "We have just returned from New York and stayed at the Envoy Club. We were a bit nervous when we read some of the reviews after we booked and went there with an open mind. It was excellent! The staff were really helpful and the suite we stayed in was way above average for the price we payed. Would definately recommend it to anyone. The only thing that spoiled it was it was a good walk or a taxi ride to the main shopping areas of the city but on a good note you didnt get all the street noise in the evening which was great after a hard day of shopping!!! Very comfortable, very clean and great facilities in the room. Definately returning next year!!!!", "Date": "March 22, 2008"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Business service (e.g., internet access)": "3", "Check in / front desk": "3", "Overall": "2.0", "Value": "3", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Ft Lauderdale, FL", "Title": "“Basically satisfied with it”", "Author": "bx2boca", "ReviewID": "UR14396388", "Content": "I was just up in NY for my daughter's wedding and needed to find something both reasonably priced and I needed a kitchenette for preparations, so my choices in NYC were limited by that. I am actually in the business or I probably never would've found this place, since I never heard of it before. All in all it suited my needs. I just needed the studio room but it was actually larger than I expected for NY and I was surprised that the kitchen was a full working kitchen, oven included not just the stovetop and microwave I'd expected, so that was a nice plus. Location was very good to anyone who wanted to be near midtown Manhattan-it's right off the FDR near NYC Medical Center and within walking distance to the everything. The main complaint, if I would call it that, was although I was only there for 2 nights and they do have housekeeping available, this was the only hotel I have ever stayed in that didn't leave an extra roll or two of toilet paper in the bathrooms and I literally ran out just as I was getting ready to check out. Maybe it was an oversight or maybe they have a rash of guests stealing toilet paper, but it was weird. And the other thing I would point out to anyone staying is this isn't an actual \"hotel\", it's part of a condo unit and they only have the front desk available during the day until 8:30pm. I found out the next day that a family member had tried to call me at 9PM in the evening but there is no one to transfer the call and you only get a recording saying someone will contact you ASAP. I know most people these days have cell phones but I do not and had that been an emergency I would never have been reached at night. Just something to keep in mind if you don't have a cell. But it was a comfortable stay all in all.", "Date": "March 19, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Business service (e.g., internet access)": "2", "Check in / front desk": "3", "Overall": "4.0", "Value": "4", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Dublin, Ireland", "Title": "“Great Location at reasonable price”", "Author": "Monty2212", "ReviewID": "UR14161617", "Content": "Apartments are a little dated but are large in size and as your in New York you'll only need the apartment for sleeping (beds are amazing by the way!). Some of the furniture could do with modernising but apart from that no complaints. great location, within walking distance of everything, near subway, empire state building and shops.", "Date": "March 9, 2008"}, {"Ratings": {"Overall": "2.0"}, "AuthorLocation": "Brisbane Australia", "Title": "“Disappointing Envoy Club”", "Author": "Megan08", "ReviewID": "UR12454658", "Content": "Envoy Club Serviced Apartments, New York City New York was the last stop for our family on a month 'round the world' trip and the Envoy Club was the worst acomodation we stayed in even though it's price was higher than London and Paris for supposedly similar standard apartments. It's location on 33rd street was poor - the street is dark and gives the impression of being unsafe. Murray Hill district is neither uptown or downtown - very disappointing. It is 4 blocks to the subway and 3 blocks to a supermarket. The wireless internet did not work ,and it did not have a business centre available to guests. On arrival we had to get the cleaners to vacuum the carpet as it had not been done and the doona cover had not been changed from the former guests. The twin beds requested for our teenage children turned out to be a dodgy double sofabed. The central heating could not be altered unless you were prepared to put up with a very loud rattle. Our 4 towels were replaced with 3. The kitchen and bathroom were very clean but the kitchen had limited kitchenware. We would have done much better in everyway in a well situated hotel and eaten out.", "Date": "January 9, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "3", "Overall": "4.0", "Value": "5", "Rooms": "5", "Location": "3"}, "AuthorLocation": "Belfast", "Title": "“Excellent choice”", "Author": "BigPatricia", "ReviewID": "UR11278155", "Content": "Just back after a 4 night stay at the Envoy. We were originally booked to stay at Radio City Apts but were changed to Envoy 'due to contractural reasons' so they said. But what a place, very spacious with great big king size bed and sofa bed was very comfortable. Apt was spotless and cleaned every day. Only problem was location though a quick hop in a yellow cab and you were right in the centre of everything. Don't let the location put you off. Would definitly return.", "Date": "December 6, 2007"}, {"Ratings": {"Overall": "1.0"}, "AuthorLocation": "london", "Title": "“poor service drab appearence”", "Author": "family088", "ReviewID": "UR8737715", "Content": "I booked an apartment but the hotel had booked a studio as it was Labour Day weekend we accepted on condition compensation was made and a fold away bed was provided. The admin is terrible no attempt was made to compensate they have just been taken over and are not up to scratch. My travel co. GTA were great they got us moved to the 1 bed we booked and 1 extra night free without their efforts the Envoy Club would not help they do not care .This building is in need of a make over all rooms look shabby and tired", "Date": "September 17, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Check in / front desk": "5", "Overall": "4.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Wiltshire", "Title": "“The Dogs Wotsits!”", "Author": "roadster939", "ReviewID": "UR7751444", "Content": "Just got back from staying at the Envoyclub apartments at 377 East 33RD ST New York , NY10016! Great location right in the heart of all the action, the room was great with everything that you would need for your stay! Clean, comfortable and spacious. Cleaners did a great job each day leaving the room spotless for our return! The staff at the desk were very helpful with directions and advice, and made the stay even more enjoyable! I would have no hesitation in recommending the EnvoyClub to other travellers and look forward to returning there in the the near future! p.s do the Liberty Helicopter Tour! best $140 I spent!What a view !!!", "Date": "June 3, 2007"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Check in / front desk": "3", "Overall": "4.0", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Dublin", "Title": "“Ideal for a family trip”", "Author": "Bicyclemadefortwo", "ReviewID": "UR7202100", "Content": "An apartment in the Envoy Club is an ideal choice when travelling with a larger group. Just back from a 5 night stay for St Patricks with my family, 4 adults & a teenager, and the Envoy Club provided excellent accomadation. About a 10 minute walk to Macy's makes it reasonably accessable however bear in mind when you want to get around to see everything New York seems huge when you've only few days in which to do it. The reviews here vary a lot & personally I think people may be a little disillusioned by the pictures and descriptions of the apartments. Yes, they are fitted with the best of everything however it's all gone just a little shabby ... do not let this put you off if it's an apartment you're looking for as they are spottlessly clean and we actually found the staff to be very friendly. The kitchen is well equiped; beds comfortable; bathrooms large with great shower pressure and if its freezing cold, as it was during our visit, the heating system is fantastic. If you're in New York to shop you MUST visit Jersey Gardens www.jerseygardens.com. Take the 111 bus from the Port Authority building - approx 40 minute ride; fare approx $4.50 single (much better value than may $38 to get to Woodbury Common!). This mall is completly indoors with comfy couches so you sit and rest between shopping bursts. Remember as well that there is no extra tax added on to clothes prices in New Jersey as there is in Manhatten. Also, if you want to get a really good elevated view of Manhatten go to the top of the Rockerfeller Centre. Having spent hours queing for the Empire State on our last visit we tried The Top of the Rock this time and had NO queue at all and the view was much better.", "Date": "March 22, 2007"}, {"Ratings": {"Service": "2", "Cleanliness": "5", "Check in / front desk": "2", "Overall": "4.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Ireland", "Title": "“Loved it”", "Author": "Lovemyhols9", "ReviewID": "UR7201869", "Content": "Loved this place. Warm and cosy and only five min walk to Macys. Stayed in two bedroom and the only reason I haven't given it top marks is because when we first checked in we were given wrong apartment and had to be moved. But other than that perfect!", "Date": "March 22, 2007"}, {"Ratings": {"Overall": "3.0"}, "AuthorLocation": "uk", "Title": "“not what i expected”", "Author": "suzieUk", "ReviewID": "UR7178961", "Content": "Sorry folks, we booked through fleetwood travel and were promised 5 star accomodation. When we arrived we were very dissappointed but put it down to being tired. After a good nights sleep the place still wasn't what we expected from the reviews we read on this page. We were expecting a hotel not an apartment block with the smell of cooking in the corridors. The staff were also quite surly and gave us wrong information.We paid extra to be central but it was quite far out and taxi cabs were taken each evening to get back. We had a fantastic time in New York though and when we go back we will not be staying at the Envoy Club.", "Date": "March 17, 2007"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Business service (e.g., internet access)": "3", "Check in / front desk": "3", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Manchester, Uk", "Title": "“Home Away from Home”", "Author": "Travman007", "ReviewID": "UR6137742", "Content": "Having travelled fairly extensively, I was very impressed with the Envoy Club. There were 5 of us in a 2 bed 2 bath apartment on the 4th floor for 5 nights, which I'm sure is bigger than most New York apartments. Plenty of closet space and a large safe, not those pokey toy ones. I wanted to move in permanently. It was great to have somewhere where all 5 of us could spend time together rather than being in separate hotel rooms. The full kitchen was well appointed and well worth having. The furnishings were of a good standard and fairly up to date, the beds were very comfortable as was the sofa bed according to the designated sleeper. The bathrooms were clean and the showers had decent power. Location wise the hotel is well located only a few blocks from the Empire State Building and not to far from Macys. Being on 33rd, cabs were rarely more than $ 10.00 up or downtown. If you're getting a cab back get them to drop you on 33 and 2nd Ave, then walk to the Envoy Club, saves going round the block to the hotel door. Bedding is normally already made up in the sofa bed, you may have to ask for pillows though. There are loads of convenience stores, delis and a cinema near the Envoy Club. Also there are some great take out places, ask the front desk. I would have no problem recommending the Envoy Club to my clients. Overall the staff were great and helped out wherever possible. Big thanks to Gillian, we had a great stay. Minor Points: The rooms could do with a minor nip/tuck here and there, nothing major ie the window blinds need repairing Could do with having DVD players as VCR's a bit out of date The kitchen utensils could do with an upgrade and teaspoons would be good.", "Date": "November 16, 2006"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Business service (e.g., internet access)": "4", "Check in / front desk": "3", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Dublin, Ireland", "Title": "“Great place to stay!!”", "Author": "Tripmemdub", "ReviewID": "UR6036115", "Content": "Stayed in the Envoy Club apartments last week for five nights. We had a studio apartment that overlooked the street which wasn't really noisy. Even though we were across the street from NYU medical centre. The apartment was clean and had everything you need for your stay. A fully equiped kitchen with all mod cons and bathroom. There was a large tv, vcr, stereo and fax machine. You have your own private fax line and phone line. Details are given to you at reception. There is a maid service everyday. The staff were nice and helpful. We didn't need to contact them only to ask if we could stay in the room for an extra hour after check out which wasn't a problem plus we weren't charged for it. The envoy club apartments are on floors 3-7 and the rest of the building is eastbridge lodgings. There are separate elevators for envoy club guests. You can walk to empire state building, herald square etc and a cab is easy to hail. I would definately recommend the envoy club. I will be staying there again.", "Date": "November 1, 2006"}, {"Ratings": {"Cleanliness": "4", "Overall": "4.0", "Value": "5", "Service": "5", "Rooms": "4"}, "AuthorLocation": "England", "Title": "“Well worth the walk”", "Author": "A TripAdvisor Member", "ReviewID": "UR5419653", "Content": "Date 17th-24th June 2006 My husband and I have just spent a week in New York and as it was our 35th wedding anniv and our 1st time to the USA we were worried about where to stay, Well we shouldn`t of because the Envoy Studio was great, not in the centre of things but we were able to walk to anywere we wanted or take the subway on 33rd Street. We were in room 505 and it was very clean and comfortable the towels were changed everyday and the maid came in every day , the receptionist were very helpful if you asked them anything and Jamile even sorted out transport back to JFK.We had trouble with the air-con leaking but just mentioned it and someone was summonded right away and when we returned it was sorted!!!. The bars and restaurants around were great and we spent a few night in Murphys, Ollie the barman is very funny. If you want a more trendy bar go to bar twelve At the end of very busy days we appreciated the location even more as we could get to sleep undisturbed and we were on the front. You had everything in the kitchen you needed if you chose to eat in. Ladies the hairdryer is kept in the cabinet in the bathroom I was looking all over the bedroom for one as even with an adaptor English electric items do not work.We took photos but wouldn`t be any different from photos already posted on site. Thoroughly recommend it if you want more space and freedom.", "Date": "July 3, 2006"}, {"Ratings": {"Cleanliness": "5", "Overall": "5.0", "Value": "5", "Service": "5", "Rooms": "5"}, "AuthorLocation": "Hampshire, UK", "Title": "“Sshh! Don;t tell the world about this place or they'll all go!”", "Author": "SelenaBartlett", "ReviewID": "UR5316250", "Content": "My friend and I stayed here for five fabulous nights! The air conditioning worked very well, but if it hadn’t we could have easily lived in the giant fridge. The rooms were spotless and the bathrooms actually looked like the one on the www (a rarity in my experience). The neighbourhood is very quiet and we both felt safe returning home late at night. The staff were really helpful and gave incredibly helpful local top tips and advice. I hope to return as soon as I can!", "Date": "June 6, 2006"}, {"Ratings": {"Cleanliness": "1", "Overall": "1.0", "Value": "2", "Service": "1", "Rooms": "1"}, "AuthorLocation": "Wales", "Title": "“Mice in the Sofa Bed”", "Author": "Charlie_Alpha", "ReviewID": "UR5293087", "Content": "Well need I say more, mice in the sofa bed and room. When we complained to the lady in reception, she said 'Its a city, expect mice' The previous review was descirbing the place in a nice way, and I agree, the place has obviously gone down hill big time. They have also changed the name to Eastbridge Logdings.", "Date": "June 2, 2006"}], "HotelInfo": {"Name": "Envoy Club Suites", "HotelURL": "/ShowUserReviews-g60763-d256738-Reviews-Envoy_Club_Suites-New_York_City_New_York.html", "Price": "$199 - $299*", "Address": "<address class=\"addressReset\"> <span rel=\"v:address\"> <span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">377 East 33rd Street</span>, <span class=\"locality\"><span property=\"v:locality\">New York City</span>, <span property=\"v:region\">NY</span> <span property=\"v:postal-code\">10016</span></span> </span> </span> </address>", "HotelID": "2514250", "ImgURL": "http://media-cdn.tripadvisor.com/media/photo-s/01/7c/7c/40/bedroom-in-one-or-two.jpg"}}