{"Reviews": [{"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Saint Louis, Missouri", "Title": "“Paris made Wonderful--La Tremoille”", "Author": "Simon K K", "ReviewID": "UR126448229", "Content": "You won't find a more charming hotel in Paris--nor one with a better address--than La Tremoille. Situated between the George V and the Plaza Athenee, La Tremoille offers beautiful rooms, or if you are up for a splurge, wonderful suites (our favorite is the Duke Ellington Suite), at very forgiving prices. In addition to the accomodations, it is the gracious staff and their attention to detail that makes this hotel so special. From the moment you cross the threshold, you are greeted by a staff for whom service is the top priority. Everyone--from the concierge to the doormen to the housekeeping staff--are outgoing and eager to make your stay memorable. We are fortunate enough to visit Paris often, and we have tried many hotels on both banks. After staying at la Tremoille three years ago, we have made it our permanent \"in residence\" address in Paris.", "Date": "March 21, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Dallas, TX", "Title": "“Friendly Staff & Good Accommodations”", "Author": "tburf", "ReviewID": "UR126403251", "Content": "We took the Euro Star from London to Paris for one night to make a dream come true for our little boy who's 6 years old. He wanted to see the Eiffel Tower. We booked the Tremoille and were not disappointed. The staff were very friendly and went above and beyond to make our stay special. The hotel room was very spacious and the bathroom was fabulous. Loved the large soaking tub with lots of Molton Brown products to choose from. We walked from the hotel all the way to the Louvre on a beautiful sunny day on the Avenue des Champs-Élysées. The only complaint I have is that the breakfast was outrageously priced. My mistake by not asking before we ate. When I got the bill for 76.00E I was shocked. I knew it would be high but that was a bit too much. Our dinner the previous night for 3 people wasn't even that much. But despite the breakfast I would highly recommend this hotel to anyone traveling with children, on a business trip, or a weekend get away for 2. We had a lovely time!", "Date": "March 20, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Santa Monica, California", "Title": "“Great Boutique”", "Author": "Tia S", "ReviewID": "UR124364710", "Content": "Had a wonderful experience at this boutique style hotel from the staff to the quaint and comfortable rooms. From arrival the staff was very friendly and eager to help. Speaking little to no French was not a problem at this hotel, the check-in staff made it easy and the concierge was so helpful in suggesting restaurants and booking reservations. The rooms were very comfortable and provided all amenities one would need (except iron). I highly recommend this hotel for the comfort and the location. I would also highly recommend stopping by the hotel bar nightly for a glass or two of champagne, simply wonderful.", "Date": "February 9, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "London, United Kingdom", "Title": "“Charming boutique hotel, great breakfast, prefect location”", "Author": "Parkinsummer", "ReviewID": "UR123986795", "Content": "I stayed here with my husband on a quick getaway. The hotel is charming with comfortable rooms, attentive staff, and a tasty complimentary breakfast. The best feature of the hotel, I must say, is its location. Close to the champs elysee and the river front, it was a very convenient place to embark from. We stayed in a room facing the interior courtyard, which was quiet. The beds are a bit short and on the soft side for my taste, but otherwise the room was comfortable and equipped with a mini refridgerator and wardrobe. The bathroom was typical European with toiletries far nicer than the bathtub/shower combo. Breakfast was served in the dining room downstairs and consisted of a serve yourself selection of pastries, fruits, cheeses, yogurts, and smoked salmon, etc. The selection wasn't extravagant or especially noteworthy, but definitely better than the average hotel breakfast. Overall, we enjoyed our stay here, but will likely try a different hotel for our next trip, not due to any shortcomings of the hotel, but just to experience a new place.", "Date": "February 1, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Toronto", "Title": "“Great stay in Paris!”", "Author": "Alana K", "ReviewID": "UR122993790", "Content": "Lovely hotel, great location, large rooms with nice furniture. Stayed in the lowest priced room (which was still quite expensive). Very nice bath products. The shower in the washroom is typical European style shower - a bathtub with a half piece of glass on one side so water does still get on the floor a bit - but very nice and clean room and bathroom and quite large for Paris. Very comfortable beds. The breakfast was pretty good - if you ask them they will make you fresh eggs however you like. Great service from the stafff. Stayed there in July 2011.", "Date": "January 12, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Luxembourg City, Luxembourg", "Title": "“Lovely in Every Way”", "Author": "jmichael11", "ReviewID": "UR122157528", "Content": "This was our fourth or fifth stay at the property in the past few years, and they never fail to impress. The rooms are spacious and well-appointed, the staff is incredibly courteous and helpful, and the location is unbeatable. From warm greetings every time we came or went, to the extremely pro-active concierge, to the complimentary bottle of Laurent Perrier awaiting us in the evening of our second night, this is a genuinely excellent place to stay, and a great value for Paris. It's a 5-star experience with a boutique feel. We will be back regularly.", "Date": "December 27, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "London, England", "Title": "“The best of Paris”", "Author": "worldwiser", "ReviewID": "UR121814613", "Content": "Have stayed here twice, once on business and we came back for a couple of nights on our honeymoon. I just love the effortless charm of this boutique, seemingly modern and yet delightfully French, hotel. Impeccably located, midway between the Champs Elysees and the Seine. I particularly like the breakfast room service which allows a tray to be left in a cupboard with access from outside the room as well as inside. Never seen this elsewhere, but a lovely touch which ensures you don't have to face a member of staff in your dressing gown! No charge for internet.. just as it should be.", "Date": "December 17, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Mantoloking, New Jersey", "Title": "“For a long weekend in Paris...”", "Author": "Lynn O", "ReviewID": "UR121500972", "Content": "I discovered the Hotel de la Trémoille many years ago when I worked in the fashion industry and stayed there because of all the showrooms on the Avenue Montaigne, just around the corner. I still choose la Trémoille because of its location, in the heart of the 8th, surrounded by wonderful neighborhood restaurants and fabulous shopping. The rooms are very plush, beds very comfortable, bathrooms modern and appointed with Molton Brown products. I find the staff very professional, especially at check in and at the concierge desk. Their years of service and experience at the hotel is remarkable, and that continuity is part of the reason I prefer to stay there.", "Date": "December 7, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "5.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Chicago, IL", "Title": "“Mid November in Paris, 2011”", "Author": "realfan68", "ReviewID": "UR120921196", "Content": "I stayed at this property last week (11/13 - 11/17) during a business trip to Paris. The hotel is very well located and within walking distance to all major attractions. It also adjacent to a great Indian and Thai restaurant (I prefered the Indian). As for the hotel itself, the rooms and bathrooms were of a decent size and reminded me of a modern, edgy NY hotel. The hotel bar was well attended every night and the staff was very helpful. There is definitely a European feel to this hotel and it is a good choice if you want to break out of the Four Seasons, Intercontinental, etc. mode.", "Date": "November 22, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Dubai, United Arab Emirates", "Title": "“Excellent Location, good rooms, perfect service.”", "Author": "noorsliman", "ReviewID": "UR120561196", "Content": "stayed with my husband in this hotel for 2 nights in Nov 2011. I can't say enough about the location of the hotel, its a 4 min walk to the center of the Champs Elysees, 2 min walk from the FS George V. The Hotel has a charming feel to it, small but nice lobby. walking through the corridors you realize the authenticity of place, every room looks different. We had a corner superior room with a lovely view of the surrounding streets, the room is spacious and the bathroom is modern. The service is very personalized, the concierge team is excellent, the doorman is so nice that I can’t miss mentioning in my review. Great training for the staff. Generally till now my experience with the hotels of JJW has been very satisfactory, I stayed with their hotel The Ring in Vienna in august 2010 and it was a memorable stay. In summary, very good hotel, excellent location and value for money.", "Date": "November 14, 2011"}, {"Ratings": {"Service": "2", "Cleanliness": "1", "Overall": "2.0", "Value": "2", "Sleep Quality": "1", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Connecticut", "Title": "“Many Problems here......”", "Author": "ldjsue", "ReviewID": "UR120371362", "Content": "Stayed here for 3 nights. At first glance it seems like a lovely hotel. Beautiful location, a block off the Champ Elysee. The rooms are spacious enough and cozy. But, first off we saw a mouse in the dining room, so they are clearly running in other parts of the hotel. But mostly I complained of a noise in our room that was quite distressing. It was a random, piercing noise,sounding like a whistle. It made sleeping quite difficult. Complained to the front desk and at first no one understood what it was but finally someone said, \"Oh, that's the elevator\". What good is a comfy room when you need to buy earplugs and sleeping medicine for rest? They offered to move me the last night in the evening which I resisted as I was checking out in the morning to go to another city. Packing, repacking and unpacking seemed as stressful and we figured out to use earplugs and drugs for sleep. I suggested they give me a break on my bill and they declined. Not very hospitable as why pay for a hotel room that you can't sleep? They just didn't seem accomodating. Maybe service is not the same as the states or other places where they would be horrified to know we saw a mouse and couldn't sleep in our room. One standout was the conceirges.......both lovely and helpful. There are better places for the money.", "Date": "November 9, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "3.0", "Value": "3", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "bangkok", "Title": "“Near perfect stay, but...”", "Author": "Park T", "ReviewID": "UR119736724", "Content": "We stayed at this lovely hotel during October 20-23, 2011. The first day of our arrival we were greeted with friendly staff and impressed by the perfect location, luxury and amenities of the hotel. Indeed, we were very happy with this place which is close to everything, a few-minutes walk away from brand-name boutiques, Champs-Elysees, Eiffel tower, and many metro stations. Our rate also included American style breakfast which had good varieties of selection. The housekeeping staff was great as well as the efficient front desk team. We stayed here for 3 nights. On our first night, we got a little charming box of very tasty Laduree macarons as a welcome gift and we enjoyed them very much. We thought we'd have had a perfect stay during our three nights here. But a minor incident occurred during breakfast on our departing day. It was 9.30 am and the breakfast room was not crowded at all. The service however was rather slow with the lady in dark suit (manager on duty?) busying around the room with no smile, no greeting. We had to request for coffee many times before she came to attention. The last time I asked for milk (it should have come as a set with our coffee) she said \"wait\" without a glance at us and never returned (there was no milk nor coffee/tea on the buffet table and everybody had to make the request). She seemed to be paying more attention to some other chores than our simple request. Put it simply, she totally disregarded us and intentionally busying herself with something else. Finally, we were saved by a young, nice and smiling assistant who quickly brought what we needed. The incident at the breakfast room did spoil our initial impression about the hotel. We thought all the staff here was well trained to have service-mind attitude. It was sad and disappointing for Asians like us to be treated this way. Except for this little thing, we think the hotel is superb and lives up to its standard for everyone else.", "Date": "October 26, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "London", "Title": "“Stylish, well located Parisian hotel”", "Author": "Ali_23h", "ReviewID": "UR119404692", "Content": "We stayed at this hotel in early September with our 3 month old daughter for one night. The hotel is very well located for the left bank, Champs Elysees and is around a 15 minute walk to the Eiffel Tower. A pleasant welcome on arrival. Room was very comfy and bathroom was lovely, Molton Brown toiletries and a lovely bath and shower. A cot was provided for our daughter which was very good. Continental Breakfast was fairly standard; a good selection of pastries, fruit and juice etc. I would stay here again as the hotel is well located and rooms are very comfortable.", "Date": "October 17, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Moscow, Russia", "Title": "“Very elegant, superb location, has its own charm”", "Author": "Baiser", "ReviewID": "UR118202420", "Content": "Located in\"golden triangle\", steps away champs-élysées and George V, beautiful building, nice and elegant rooms. I tried there several room types from standard to suite and can say that all were nice, very comfortable and roomy. Bedding is very-very good! Service is much better then you normally expect in Parisian hotel ;)). Breakfast is normal, service is good, but food is average. The hotel restaurant is nice, not overpriced, but you better go to Maurice which is 3 min walk away. But what I can say re hotel kitchen is that they alway cook you nice and delicious food for in-room dining. I arrived quite late several times to go out for dinner and they always supplied superb dinner for me. I love this hotel very-very much!!", "Date": "September 16, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "London, United Kingdom", "Title": "“Amazing boutique hotel in the heart of Paris”", "Author": "Leonora M", "ReviewID": "UR117909708", "Content": "Amazing boutique hotel in the heart of Paris...cosy rooms, Molton Browns amenities, great concierge et voituriers team; excellente adress and great location (8eme)....excellent buffet breakfast...small and cosy atmosphere...very much recommended; warm welcome upon arrival and well maintained rooms..", "Date": "September 10, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Los Angeles, California", "Title": "“Outstanding property, staff, and service”", "Author": "Chris F", "ReviewID": "UR117737172", "Content": "Hotel de la Tremoille truly made a trip to Paris unforgettable. A room with a balcony and view of the city rooftops was breathtaking; all very comfortable with high quality fixtures, amenities, and service. Being a very frequent business traveller myself, its undeniable that the hotel staff and management understand the value of customer service and believe in building long-term relationships with their clientèle. The hotel offers the unique comforts that large chains cannot (e.g., beautiful macaroons from Laudree, handwritten notes of thanks, etc.). I will certainly be back, and highly recommend the same to anyone interested!", "Date": "September 6, 2011"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "London", "Title": "“Very Good Hotel in a very good location”", "Author": "Peepiceek", "ReviewID": "UR115763477", "Content": "I stayed here for 3 nights in July 2011. Hotel de la Tremoille is very well situated, literally 3 minutes walk from the Champs Elysees, and with an even shorter walk to Avenue Montaigne. I found the overall level of service consistently very high (and extremely polite and helpful without exception). The rooms are also reasonably large (by Paris standards, at least!) as well as being very clean and the bed in particular is extremely comfortable. I have stayed over the years in a number of other hotels in Paris of a similar class/price and have been disappointed, particularly as regards the level of service, but am happy to say that this was not the case with this hotel, which is very good overall.", "Date": "July 25, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Hartsdale, New York", "Title": "“One of our best experiences in Europe”", "Author": "Tipoul", "ReviewID": "UR115700828", "Content": "For our 3 year anniversary trip, my husband and I decided to travel to Europe. We stayed in Paris for 3 nights at Hotel de la Tremoille before flying to Barcelona for a weeklong cruise. The staff were very nice. Christophe, the evening concierge, was truly the best! He went above and beyond to make our stay at this hotel a memorable moment. The hotel, in general, made this trip very special. The hotel is perfectly situated in a great location in Paris. Our room, # 515, was beautiful with a large wrap around balcony and the daily maid service was exceptional. I highly recommend this hotel and will most definitely return for another stay here again.", "Date": "July 23, 2011"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Overall": "1.0", "Value": "1", "Location": "5", "Rooms": "2"}, "AuthorLocation": "", "Title": "“Horrible stay July 21,2011”", "Author": "Meikomeiko", "ReviewID": "UR115646750", "Content": "Stayed here last night in room 309. Celebrating my anniversary with my husband. They placed us between two rooms that had children in them that were very loud and unruly. the children across the hall were so loud they awoke us to screaming at the top of their lungs at 7am. This is in addition to the restaurant across the street who took the liberty of throwing away tons of wine bottles one by one into a metal trash container on two separate occasions. No one knocks on the door prior to entering. At one point I was using the bathroom when a maid entered the room without announcement. The was no knock nor any indication that someone wanted to enter. I nearly had a heart attack. Wi fi service was o ly operable when you positioned yourself closer to the bathroom. And on top of that, the was a co stant noise of constant loud humming from the bathroom ceiling every three minutes. When checking out, the lady asked, \"How was your stay?\" and I shared these concerns with her. She appeared dumbfounded with no response. We immediately checked out of her an into the Hotel Francois 1st - around the corner. The people at the Francois 1st, are exceptional and know how to take care of their customers. We were warmly received this morning for our remaining four nights in Paris. I would not recommend the Tremoille to anyone based upon my one night stay there. I am an avid user of Trip Advisor, and never have I felt so compelled to write about my stays-but have NEVER had such a horrible experience as such! Again, this is our anniversary, and I felt horrible because I chose the hotel- so if you indifference and an \"I don't care attitude\" this is your hotel- otherwise STAY AWAY!", "Date": "July 22, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "4", "Overall": "5.0", "Value": "4", "Service": "4"}, "AuthorLocation": "New York City, New York", "Title": "“Beautiful, charming hotel on a quiet street”", "Author": "oh_holidays08", "ReviewID": "UR115546597", "Content": "We thought the location was great for us - just off Champs Elysees so you're away from all the noise, and a minute walk to Ave Montaigne where you can do your designer shopping. You COULD walk to the heart of all the shopping around the rue St. Honore area, but it's a bit of a trek (maybe 20mins?). Can also walk to St. Germain (~20mins). About 10mins walk to the Eiffel Tower, 3mins to Bateaux Mouches (for the Seine River cruise). There are also lots of good restaurants and nice cafes around the area. If you don't like walking, there is a metro stop 3mins away. Our room was lovely (room 210). Very cosy, but enough space for everything (queen bed, closets, desk, coffee table, armchair). There was a balcony that overlooked the street below. It's a quiet street so not much to see, but still nice to have a balcony. Decor was rather elegant-plush and made the room feel very warm and inviting. You really feel like you're in Paris - this isn't some cookie cutter generic chain hotel. The bathroom was a little small though - we had a tub with a showerhead and if you use the shower, the screen wasn't long enough to prevent water from splashing out. They had Molton Brown amenities though, which my husband likes, so I guess that made up for it! We paid corporate rates on the rooms so it was definitely a deal! Else I think it's probably a little pricey, but you do get what you pay for so it's probably worth it.", "Date": "July 19, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "New York City, New York", "Title": "“A true Boutique hotel”", "Author": "NadiaTrox", "ReviewID": "UR115101356", "Content": "The location is amazing, the staff super nice, and the rooms charming. Just the perfect place!", "Date": "July 6, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Los Angeles", "Title": "“Great value for this area of Paris”", "Author": "LosAngelesPal", "ReviewID": "UR114760247", "Content": "This is a lovely little hotel in one of the most expensive areas of Paris. While it is not in the same hotel class as places like the George V, Fouquet's or the Plaza Athenee, it is maybe less than half the price with pretty much all the amenities and a fantastic staff. And it provides a much more personal experience than staying in one of the five-stars. We took the metro to the French Open, the stop was a few blocks away but absolutely within walking distance.", "Date": "June 26, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Location": "5", "Rooms": "4"}, "AuthorLocation": "", "Title": "“An very nice expensive hotel in a superb location”", "Author": "Fazzone", "ReviewID": "UR114680142", "Content": "Tremoille is located in the heart of a touristy Paris area. It is super convenient to the Seine and Eiffel Tower and Champs Elysee. As such,however, be prepared to pay! The restaurant is fair and the breakfast buffet is no better. I have had better breakfast buffets in Marriott concierge lounges for free. As a very frequent business traveler I may be a bit of a cynic but if price is of not concern, a great food and value restaurant is of no concern but great location is, give this place a try. Oh and make sure you request an inside room as the windows are old and thin and the sounds of the street are continuous.", "Date": "June 23, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "New York City, New York", "Title": "“The Best Hotel in Paris”", "Author": "ElizabethS4", "ReviewID": "UR114399458", "Content": "I recently stayed at La Tremoille for6 days with my mother, celebrating a big birthday (hers). WE have been coming to Paris nearly every year, both together, with our respective spouses, and and I was young, I of course traveled with my parents together. I had my oldest child baptized in Paris and I have been married in Paris. We have had a long tradition of staying at the Plaza Athenee, but in the last 4 years, have been staying at the Chambiges, or with friends, as the PA is very expensive now. We had booked another hotel, but when we arrived on June 3, my mother found it to be, let's say, not up to her standards. I called the hotels in the area, but all were booked. I remembered the Tremoille because I had stayed there once with my former husband many years ago, and the women I spoke with, Isabelle, was wonderful, alerting me that there was one room left-I gratefully told her we were coming right over! Everyone there was wonderful to us! The concierges was able to secure much coveted reservations at my favorite, L'ami Louis, and we were within skipping distance of my other favorite, Chez Andre. I cannot think of one bad thing to say! To the writers of the negative comments: Yes, Paris has street sounds, don't come to Paris if you don't want to hear them! And I don't know of any hotel that leaves water by your bed, and I have stayed in the best of them! And if the elevator gets stuck, probably a good idea to wait until the fix it man arrives, rather than try and fix it yourself. And to avoid the elevator getting stuck, don't jump up and down and try to break it (this is for teenage and college age kids out there). The location is perfect for anything one would want to do in Paris, as you can walk to Louvre, Musee D'Orsay, Arc,Eiffel, etc. Its about 15 taxi to Marche Serpette, and the FDR metro is minutes away on Ave Montaigne. The is a pharmacie around the corner should you forget any medications from home, and a very good Dr. Charles Cohen about one block away. You can even go to Sancerre for Lottery tickets and cigarettes( smoking there is like New York), but matches are 1/2 euro. Hurry up and grab a seat on Air France flight 7, (take Premier Voyageur, it's almost like business class without the price tag) and fly to Paris and stay at the Tremoille!", "Date": "June 19, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "4", "Service": "5"}, "AuthorLocation": "washington state", "Title": "“Lovely hotel”", "Author": "janetlp", "ReviewID": "UR111171960", "Content": "We stayed at the Tremoille twice this past spring. My husband and I stayed there for a week and then later my parents joined us for a few more days. A hotel can have lovely rooms and amenities but if the staff isn't helpful and respectful it's not worth staying there. The Tremoille has a wonderful staff. Both the front desk and the concierge were incredibly helpful. We had a slight problem with our bathroom and not only did they come right away but sent a card with an apology for our inconvenience along with those amazing French macaroons. This is not a high end fancy hotel but it is certainly luxury enough for me and we prefer a smaller, boutique hotel. If you want to stay on the right bank, the location is fantastic. We walked everywhere from the Tremoille. The first time my family stayed in this hotel was 1966 and I'm sure we'll be back.", "Date": "June 2, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "USA", "Title": "“A Small Gem in the Best Location”", "Author": "misterduke", "ReviewID": "UR110034789", "Content": "We just returned from a 5 night stay at La Tremoille and had a fantastic experience. This is the ideal luxury boutique hotel with a \"10\" for location, service and beauty. It is a small, well-appointed hotel with helpful concierges who treat guests with repect. The staff was very kind and accommodating. The hotel was luxurious and tucked away on a quiet street in a wonderful location close to major shopping and transportation. The breakfast was delicious and the beds extremely comfortable. The rooms are clean and updated. Can't wait to return!", "Date": "May 26, 2011"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "scottsdale, az", "Title": "“Bang for the buck... best deal out there”", "Author": "dustind123", "ReviewID": "UR110013745", "Content": "If you can't afford the five star hotels, this is a great hotel for the price. Clean, updated, friendly staff, awesome location... in europe a four star hotel can often be more like a three or less star hotel especially when they are considered \"boutique\" - this is not the case here, they deserve their stars and I would definetly stay here next time I go to paris. BTW we had a superior standard suite, or something like that on the 4th floor. It was very nice and unique, bigger then most hotel rooms, living area on one level, bath and bed on another level... oh free wireless internet was great.", "Date": "May 26, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Pittsburgh, Pennsylvania", "Title": "“Beautiful Boutique Hotel”", "Author": "ERR1168", "ReviewID": "UR109253340", "Content": "Accomodations were lovely, staff was attentive, friendly and knowledgable. Perfect locations. Would love to return!", "Date": "May 21, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Alexandria, Virginia", "Title": "“What a lovely boutique hotel!”", "Author": "amyoldtown", "ReviewID": "UR107415358", "Content": "We just returned from a 3 night stay at la Tremoille and had a wonderful experience there. We were celebrating our 13th wedding anniversary and were treated to a special stay in a beautiful hotel. The staff was very kind and accommodating. The hotel was luxurious and tucked away on a quiet street in a wonderful location.", "Date": "May 8, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "New York, New York", "Title": "“A fantastic Experience!”", "Author": "PGSchaefer", "ReviewID": "UR104695687", "Content": "My sister and I booked a suite at La Tremoille for 4 nights because we were running in the Paris Marathon and the hotel was 3 blocks from the start of the race. Everything about the hotel went flawlessly for us. When I inquired about getting 2 singles beds in the suite it was done. Hearing that we were running in the Marathon they comped our breakfast and on the day of the marathon they gave all the runners an early breakfast. We asked for ice.. it came in minutes reservations in restaurants no problem, The suite was beautiful with views of church steeples from one window and the top of the Eiffel tower from another window. All sorts of shops, restaurants, and cafes were a short walk from the hotel. I travel extensively and I will certainly return to La Tremoille", "Date": "April 19, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Boston", "Title": "“Very Nice Value”", "Author": "TheFlock1", "ReviewID": "UR99815086", "Content": "We stayed at the Hotel de la Tremoille in August on vacation. We enjoyed our stay very much. The hotel is centrally located. The rooms are nice, but not overly fancy. The restaurant has a nice breakfast. The hotel staff was very helpful. I thought the hotel was a great value.", "Date": "March 11, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "3", "Sleep Quality": "4", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Thessaloniki, Greece", "Title": "“Comfortable hotel in good location”", "Author": "Tashko", "ReviewID": "UR96822427", "Content": "We spent a nice 4 days at this hotel during last February. +++ Reception and concierge staff were very helpful with everything we asked of them to do. Email inquiries before our arrival were answered promptly. +++ By Paris standards the rooms are quite large, certainly a great improvement over the usual offering where two people find it hard to move around their room at the same time. The bathrooms are very nice also, with the bathtub doubling as a shower cubicle at one end - though during shower time water could not be contained effectively. Wifi and cable internet access is fast and free of extra charge. The matress was quite hard but comfortable but I found the pillows to be way too soft. ++ Location is excellent in terms of proximity to Champs Elysees, while being close to the Seine and about a 15 minutes' walk away from the Eiffel tower. The closest metro station is 10 minutes away on foot, while in the hotel's vicinity there are numerous restaurants to sample ( we particularly liked the 'Ginger' ) with the main shopping area being three blocks away. -- Breakfast was nothing special and certainly not good value for money for the amount charged. The omelets are nice but the overall quality is just OK and variety is lacking. -- The hotel's fitness room is really nothing of the sort, just a cramped space with a couple of treadmills and a bicycle - don't be misled into thinking you can have some sort of effective workout over there beyond a little sweating - much better to get that while walking around Paris anyway.", "Date": "February 16, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Brisbane", "Title": "“Absolutely Brilliant”", "Author": "ricardo89", "ReviewID": "UR92361437", "Content": "Spent 4 glorious nights at the La Tremoille over NYE. Hard to fault this brilliant boutique hotel. The staff were magnificent, the rooms excellent & the location is 10/10. Nothing was too much trouble for the concierges & the girls at reception delightful. Anyone who bags this hotel needs an uppercut as I've travelled the world extensively & I rate this hotel up with the very best I have stayed in. Congratulations La Tremoille on ensuring I and my family had a memorable stay in Paris.", "Date": "January 10, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "New York City, New York", "Title": "“Ideal in every way.”", "Author": "AlexDavidson", "ReviewID": "UR91881726", "Content": "We stayed at the Tremoille for five days at the end of the year. The room was modest in size but was comfortable and warmly furnished (and the quality of the bed, no minor matter, was excellent). The large breakfast buffet was a welcome sight every morning -- and while some might consider $45 expensive we've paid more in other hotels for meals not nearly as good. The public spaces are lovely and impeccably maintained. But what most made this hotel so attractive for us, and the reason we'll return later this year, was the attentiveness of the staff. The front desk, the concierge desk, the bellmen, and the restaurant staff -- the degree of courtesy and help they provided was nothing less than extraordinary. We have stayed at far more expensive hotels in Paris where getting someone's attention for minor things was a trial. Here nothing was too small for this staff to give you their full and friendly attention. We often wondered how the management found and kept a staff of such quality. This place sets the standard for what a great boutique hotel should be.", "Date": "January 5, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "PJ", "Title": "“good location”", "Author": "kesharoo", "ReviewID": "UR90592856", "Content": "Stayed here on a business trip for 5 days. Overall a good small sized hotel in the heart of Paris. Location is close to Champ Elysees and Avenue Montaigne which makes it ideal for shopping. Staff is helpful and cheery, umbrellas readily available for rainy season. WiFi was readily available for free in the room which makes it a breeze for work.", "Date": "December 24, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "New York City, New York", "Title": "“the perfect Parisian escape”", "Author": "thibaut a", "ReviewID": "UR89829674", "Content": "Only two days in Paris and not able to afford the palace, but still looking for a luxury hotel located in the heart of the triangle d'or... these were my challenges to find a perfect place for my vacations. La Tremoile simply met every expectation. A calm, sexy, modern, service oriented hotel, few steps from the avenue montaigne, Champs Elysee et George V (only one block from the Plaza Athenee and 2 from the George V). From the concierge Martial to the GM Olivier, all the staff members were so nice and helpful. I cannot wait to be back", "Date": "December 14, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "London", "Title": "“Fantastic luxury hotel”", "Author": "andyrout1", "ReviewID": "UR85265235", "Content": "We stayed here one night and it was truly luxurious. The staff were exceptional - really helpful and attentive without being obtrusive, very professional and generally just very welcoming. We had asked for an early check-in as we were arriving for a lunchtime wedding nearby and were told that they could not guarantee this as the hotel was fully booked the whole weekend. However on arrival they had prioritised the room for cleaning and were just finished cleaning it as we turned up(which turned out to be an upgrade!) and we were shown straight up to it. Very nice little touch. Room lovely and comfortable - the bed particularly soft. Great range of bathroom products, all molton brown if I recall. The room was cleaned and tidied whilst we were out, again a nice touch. Didn't get to sample the restaurant, though we did have a coffee at the bar. Very reasonably priced considering the standard of hotel - half the price of the grotty cafes on the champs elysees (and a nicer coffee!!). Last thing worth mentioning is the location of this hotel. Literally 5 min stroll from the champs elysees, and set in a very quiet and picturesque part of Paris. Metro station nearby, as are many high end shops if that's your sort of thing. Very highly recommended - I would definitely stay here again.", "Date": "October 29, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Pittsburgh, Pennsylvania", "Title": "“Wow, what an excellent hotel!”", "Author": "Rocky132", "ReviewID": "UR84963264", "Content": "Absolutely excellent choice of a great small hotel in the middle of everything wonderful that Paris has to offer. Went for our 25th anniversary and couldn't have made a better choice. The hotel's entire staff couldn't have been friendlier or more helpful, even to a couple of Americans who don't speak the language. Loved the city, love the hotel...will be back!", "Date": "October 26, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Lancashire", "Title": "“Wonderful Hotel & Staff!!”", "Author": "LancashireLuc", "ReviewID": "UR84534997", "Content": "This hotel is fantastic, from the moment we booked to the moment we left the service was brilliant. We booked a suite for myself, husband and our 19 month old little girl for 3 nights and a double room for an Aunt & Uncle to join us for the last 2 nights direct with the hotel and we got good discounted rates, they also arranged for a car to collect us from the airport. When we arrived at the hotel check-in was quick and easy and we were shown to our room. The suite (509) was perfect for us, very spacious and comfortable. The bathroom, bedroom and lounge were all accessed off a small hallway, meaning we could put our little girl down in her cot at night and sit in the lounge without disturbing her. The only small grumble I have is the bed it was 2 large singles pushed together and it wasn't very comfortable, you could feel the join and made a cuddle with my husband a bit difficult!! However the suite on a whole made up for this and as for the staff, you couldn't ask for better, they went out of their way to be helpful and were amazing with our adventurous daughter, especially the evening bar staff. We didn't use the restaurant or breakfast, but we did have room service and morning cofffee & coissants in our room, this was very good and very quickly served. I would highly reccommend this hotel, its in a great location not far from the champs elysees but far enough so you have a quiet nights sleep, the staff are wonderful, it has a very relaxed and cosy atmosphere. We will be returning.", "Date": "October 23, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Location": "5", "Rooms": "4"}, "AuthorLocation": "New York", "Title": "“A very pretty, clean, hotel, spitting...”", "Author": "Tabb", "ReviewID": "UR83335276", "Content": "A very pretty, clean, hotel, spitting distance from the Champs Élysées. Rooms are a bit cramped, but not unexpected on size for Paris. Beautiful bathrooms with many scents of shower gel to choose from! Service was responsive; we were promptly moved to a new room after a night of hearing screeching elevator cables every minute or so. The surrounding area is beautiful, safe, and full of big ticket hotels and shops. A good home base but get out of the neighborhood to explore more unique offerings of Paris.", "Date": "October 13, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Toledo, OH", "Title": "“Ooh la la...la Tremoille”", "Author": "BH64", "ReviewID": "UR81533091", "Content": "My husband and I had a wonderful stay at Hotel de la Tremoille. Our superior room was spacious and very well appointed. If I could give a 10 for sleep quality, I would! Our room had a small extended enclosed porch that I think helped insulate the room from outside noise. I have never had a quieter hotel room...ever! The bed was also extremely comfortable. All of the hotel staff we encountered spoke English and the concierge staff was very helpful...especially Jean Luc, who was very patient with all of our questions. The location is excellent...an easy walk to several metro stations, Eiffel Tower, Seine River, Arc de Triomphe, Champs Elysees and many, many restaurants. There is also a great wine store (Vignon) around the corner on rue Clemont Marot. We would love to return!", "Date": "September 29, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Toronto, Canada", "Title": "“Excellent Hotel with Excellenct Concierge Service”", "Author": "YamaY", "ReviewID": "UR74110678", "Content": "We loved the location, the concierge staff were excellent, very good restaurant recommendations. At the end of our 4 night stay the hotel manager thanked us and asked how was our stay.", "Date": "August 6, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "3", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Orlando, Florida", "Title": "“WOW!”", "Author": "Jaypb", "ReviewID": "UR73005258", "Content": "First trip to Paris, could not believe how friendly and helpful the staff was! Fluent English spoken by everyone at the front desk, incredibly beautiful hotel, just a five minute walk from the Eiffel Tower, and about 10 or so minute walk from the Arch D'Triumph. Food, service, room -- everything was fantastic!", "Date": "July 30, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Nevada City, California", "Title": "“Excellent Service, Fantastic Location”", "Author": "SierraSlackKey", "ReviewID": "UR71716866", "Content": "Excellent service, fantastic location. Stayed four nights. Our deluxe room was extremely comfortable and quiet. It had the feel of an apartment, with 3 tall double windows, high ceilings, cozy well-arranged furniture, a good-sized sitting area, and a large dressing area between the bedroom and bath. The bathroom had a tub and wonderful walk in shower. If you are in the neighborhood on a Saturday morning don’t miss the gourmet open-air food market on Avenue President Wilson", "Date": "July 21, 2010"}, {"Ratings": {"Overall": "3.0"}, "AuthorLocation": "London", "Title": "“Disappointed”", "Author": "alondongirl", "ReviewID": "UR65400471", "Content": "Having read such good reviews on this hotel, I went with pretty high expectations. Unfortunately we were put in a small, stuffy corner room which looked very dated. Our room was really hot so we called reception to see if they could do something about it. They told us that they would turn off the heating, so we went out for dinner, expecting the room to be cool by the time we got back. When we returned, we found that they had not turned down the heating, prompting us to call them again. They were not very helpful and just told us to \"open the windows then.\" Our fridge was not working, all the beverages inside were warm. When we called to complain, they brought us two bottles of water but did not offer to fix the fridge or anything. We had to call again and request this. Then a chambermaid came up and was super unfriendly and grumpy the whole time. On the plus side, the location was excellent and the breakfast was pretty decent. The doormen were very polite and friendly. The concierge was helpful too. If you choose to stay here, make sure you ask for a bigger room.", "Date": "May 26, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "3", "Sleep Quality": "4", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Atlanta, Georgia", "Title": "“Very Nice Time”", "Author": "ThWhite", "ReviewID": "UR65181718", "Content": "We stayed here for 4 days last month. The rooms were wonnderful and the service was delightful. Unfortunately, not all guestsd know to behave. There loud, boisterous (and drunk) Brits in the rooms down the hall who forced us to have our room moved - which the hotel did very easgerly.", "Date": "May 24, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "London", "Title": "“One of the best hotels I have stayed in”", "Author": "JackBauerCTU24", "ReviewID": "UR64022293", "Content": "We were here 5 nights for our honeymoon. The complimentary bottle of Champagne was excellent but moreso the room was amazing. They even sorted out the nice weather for us so that we could enjoy the sun on our balcony!", "Date": "May 13, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Los Angeles", "Title": "“Great Hotel”", "Author": "lalawyer2010", "ReviewID": "UR61637669", "Content": "I stayed for four nights at this gem located in a perfect location. From the moment I stepped into the lobby, service was first rate. The room was so comfortable, plenty of room for one person (no view, unfortunately.) All the ameneties. The only minor complaint I had was the mirror was in an awkward location. Other than that, the hotel was great, I plan to stay there on my next trip. It wasn't cheap, but I got a decent deal and it was worth every Euro!!", "Date": "April 16, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "5", "Overall": "2.0", "Value": "2", "Sleep Quality": "1", "Rooms": "1", "Location": "5"}, "AuthorLocation": "London", "Title": "“Used to love it, this last trip was terrible - gone down hill a lot”", "Author": "JonathanKlein", "ReviewID": "UR61222017", "Content": "I have been staying at the Tremoille for several years. Some friends recommended it back in 2006, and I have stayed there every year since. I used to find it high quality and very relaxing. My 3 day trip over the last couple of days was terrible. My room was very noisy - some rude Americans in the adjacent rooms - and the hotel did little to sort out the noise. The \"business centre\" is tiny and not much use - very out of date. Service at breakfast was offhand and the food offering uninspiring. On Sunday I was running the Paris marathon so needed an early breakfast in my room ... the hotel had been fine doing this for the last few years. This year it was a shambles and was 45 mins late. I will not be going back. No real apology for all the mess above, and no offering of even a drink in the bar to compensate.", "Date": "April 13, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "new jersey", "Title": "“Parisien perfection!!”", "Author": "jerseytravelfan", "ReviewID": "UR55819030", "Content": "I stayed at this hotel for a short vacation. This was my second visit to Paris and having done many of the tourist stops on the first go round, my focus during this stay was on pure relaxation. I must say Hotel Tremoille was the PERFECT choice for me. The location as commented in prior posts is great. It is close to almost everything of interest to the average tourist. The room (a superior on the fifth floor) was also perfection. Large by Paris standards, a wonderful view of the surrounding neighborhood and when on the balcony, the top of the Eiffel tower was visible. The balcony ran the length of the room and if it had not been freezing I can imagine it would be very special. The bathroom was as described with a nice variety of Molton Brown products to sample. I will differ with the prior post which stated there is no high speed internet-not true. Not only is there high speed interet (both LAN and wifi), but it is FREE!!! Now onto the truly special part of this hotel- the service from the everyone was exceptional. From check-in where the receptionist showed the room, but also inquired whether I had a laptop and upon my replying yes, provided the login sheet (also available at the front desk) for the free wifi connection. Upon returning to my room after exploring the surrounding area, there was a lovely bottle of champagne with a note welcoming me. I have to make special mention of the hotel restaurant/lounge/bar Louis2- it was the highlight of my stay. Returning each evening to the warm, cozy atmosphere of the lounge was truly special. They mix a great raspberry martini and unlike other places in Paris, the portions were generous. Also the waitstaff are helpful without being intrusive. You could literally sit for hours with one drink of five (wouldn't recommend five). I can't really comment on the food, as I often had light snacks with my \"beverage\", but the fries were delicious. So having travelled to many locations and stayed at mostly five-star hotels, I rank Tremoille up with the best as it truly makes you feel at home. I look forward to returning again, hopefully when the weather is a little warmer.", "Date": "February 12, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Los Angeles, California", "Title": "“An American in Paris”", "Author": "travelchic21", "ReviewID": "UR55612017", "Content": "Such an amazing time! The hotel was sooooo well situated to everything. Safe area, near the excitement but romantically secluded. We had a junior suite which provided plenty of room (bedroom/sitting area/two balconies/ and a wonderful bathroom w/tub and shower) The weekend concierge was NOT knowledgeable HOWEVER the lead concierge,Jean Luc, AWESOME!! Also the workout facility is a joke! One beat up treadmill, one limping elliptical, ancient recumbent bike and absolutely no floor space. I wish hotels would get on board with fitness! That being said... our stay was beautiful and romantic and full of walking adventures :) One other minus... no high speed internet. Really, in this day and age...yikes", "Date": "February 10, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Kuala Lumpur", "Title": "“Love the location and the Charm”", "Author": "purple_dots", "ReviewID": "UR53716659", "Content": "We selected this hotel for its location, close to Champs Ellyses, The Eiffel Tower and Avenue Montaigne. It location is perfect, away from the noise and tucked away in a quiet street corner. There are nice restaurants around the hotel, you can judge by the number of people queuing to get in. The rooms are comfortable, nicely designed and sound proof. The room that I choose was a standard room but it was spacious enough since I only needed a nice place to stay as we were out most of the day. I also thought the Hatch is a good idea to ensure privacy for room service. Also, the front doors to the hotel are closed at night for security reasons but there is always someone around. Umbrellas are also provided when it rains. The service rendered is impeccable from Concierge to Front Office and Housekeeping. I will definitely choose this hotel again.", "Date": "January 17, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Location": "5", "Rooms": "4"}, "AuthorLocation": "London", "Title": "“Just what we had hoped for”", "Author": "robert123London", "ReviewID": "UR52208296", "Content": "For a short family break in Paris between Xmas and New Year, you want comfort and no hassles. We were not disappointed. The reception has recently been redecorated and the whole area had a warmth and charm that is often lacking in \"Les Grand Palaces\". Staff were friendly, helpful and efficient, and our junior suite, which we shared with our 14 year old son, was comfortably large, if not beautifully furnished. As others have remarked, the location is perfect for just about anywhere. Once the rooms are brought up to the same standard as the reception, this hotel will be a bargain.", "Date": "December 30, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Boston", "Title": "“Excellent”", "Author": "ramike", "ReviewID": "UR50344557", "Content": "I have been staying at this hotel for a number of years and it continues to impress. The staff makes the stay enjoyable, with their friendly, courteous and professional service. The rooms are spotless and very quiet. Best of all is the location, a very short walk to the Camps de Elysee on a beautiful side street.", "Date": "November 30, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Paris, France", "Title": "“Hidden Gem”", "Author": "JackfromParis", "ReviewID": "UR49305806", "Content": "There was a time I was living in London and going to Paris every week for business that I actually camped at the Tremoille, leaving my luggage and clothes on Friday to find them cleaned and pressed in my room on the Monday. Needless to say this is my favourite hotel in Paris. The Tremoille is located at a stone’s throw of the Champs Elysees and Avenue George V, just by the Four Seasons hotel, in an area Parisians call the « Golden Triangle ». This is the home of luxury brands such as LVMH, Prada, Gucci, Valentino, DVF, Cartier, Rolex, Bulgari and the likes that all have shops or headquarters close by. The area also displays some excellent restaurants, like the starred Michelins Le Cinq at the George V or Alain Ducasse at the Plaza Athenee, Asian style Ginger and Indian Ratn further down on rue de la Tremoille, trendy Bound on George V or Maison Blanche on Avenue Montaigne. The hotel itself is on the corner of rue de la Tremoille and rue du Boccador, set in two reconverted Haussmannian residential buildings with all the old school charm and grandeur that goes with it : high ceilings, majestic staircase, fireplaces, large windows, and small balconies on rooms/suites on the 2nd and 5th floors. The bar and restaurant have been revamped last year and are a good place for a pre-dinner cocktail. There’s a good business centre and a small gym. The hotel rooms have been recently decorated in a contemporary style that goes very well with the building style, bathrooms are spacious and well equipped, all rooms have a safe, flat screen TVs and DVD players, radio, mini bar, etc. The best point is the « hatch »: you can order your room-service/breakfast and ask for it to be placed on the hatch. The waiter would then open a pane on the outside of the room, knock on your door and go away. You can then open the pane on the inside of your room, retrieve your order and have a peaceful moment savouring your meal and reading the papers without seeing anyone. This is particularly convenient if you travel frequently and miss the intimacy of your mornings or don’t feel like making much presentation effort before the caffeine injection. And this point actually sets the tone for the place: fantastic attention to detail, amazing customer service, discreet yet efficient staff and a well-connected concierge who can get you pretty much anything you want. Price wise, this is five-star luxury for a four star rate. In a word, I wouldn’t stay anywhere else. The group managing the Tremoille also has a hotel in Leeds (42 The Calls) and in Edinburgh (the Scotsman) that I also recommend.", "Date": "November 16, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Boston", "Title": "“wonderful service”", "Author": "abinitio", "ReviewID": "UR48266994", "Content": "I stayed her for just one night arriving on an international flight from Dallas. Even though I arrived early and my organization forgot to book the room from the night before (as I usually do) they were able to get me a room within the hour. I was in my room before 10am. Staff is super helpful and professional. The right mix of being reserved but friendly and helpful. One reviewer earlier commented that maid have a tendency to barge in. I noticed that as well, but when I told her to wait a few minutes, I found her waiting outside the room when I opened the door. Overall a wondefrul hotel though.", "Date": "November 1, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Cabin John, MD", "Title": "“Above and beyond, charming, warm and highly personalized service.”", "Author": "WinOrChoos", "ReviewID": "UR47157160", "Content": "Our trip was a gift to my mom for her 70th birthday. My boyfriend and I wanted a special hotel that would take good care of us. I have stayed at La Tremoille once before, and while I was thoroughly pleased with my first visit, our second stay was extraordinary. First let me say that the property is pretty and very well kept, but the rooms are standard size for Paris. There was enough room, but not an over abundance of space. The bathroom was well-appointed and a good size. First off, the hotel was helpful when we called to ask if we could check in early after our 6:30am flight arrival. My mom's room was lovely, but I didn't like ours. I gently told the front desk that I was disappointed, and we were whisked to a new room that was just right. Each time we came in and out of the hotel, we were greeted like royalty. The concierge made several reservations and provided fantastic guidance. On day two, my mom slipped and hurt herself enough to require a doctor's visit. The concierge was quick to call a doctor who arrived within a couple hours for a house (hotel) call. All I could think of was how complicated it would be, and the hotel took care of it in an instant. The concierge couldn't have been more helpful or more concerned. When we checked out, I asked to speak with the charming hotel director who graciously accepted my thanks for an excellent visit. One more bit--I managed to leave behind a drawer full of clothes. These were collected in a lovely bag and set aside for my friend to collect for me. The hotel made our trip to Paris a brilliant one.", "Date": "October 18, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Location": "5", "Rooms": "4"}, "AuthorLocation": "", "Title": "“Luxurious in all circumstances”", "Author": "Infernoz2502", "ReviewID": "UR36033665", "Content": "We were traveling to Paris for our first time in a long time but this time we brought our kids. We were very nervous about which hotel to stay in so we picked De La Tremoille. It is a truly a lovely little hotel opposite some good dining choices. The staff were so kind and so efficient. De La Tremoille is a magnificent hotel.", "Date": "July 28, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "London, England", "Title": "“Consistent quality & charming people”", "Author": "MDR04", "ReviewID": "UR32273721", "Content": "Have been staying here on a regular basis over the last couple of years and it is always a pleasure to know what I am staying here. There are so many places that over promise and under deliver; not at Tremoille! Its big enough to not be dull, and small enough to be properly managed. It has a certain chic-ness about it that is charming and they are constantly keeping its standards and adding new little touches. Would recommend this hotel as value for money considering what you can get elsewhere at the same price. The location is excellent, with lots of restaurant choices on the doorstep, and is not as hectic as some parts of paris.", "Date": "June 14, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "3", "Location": "5", "Rooms": "5"}, "AuthorLocation": "London", "Title": "“Fantastic location, nice rooms and superb service”", "Author": "H0merSimpson", "ReviewID": "UR28131085", "Content": "I've stayed at La Tremoille in at least 5 ocassions for business and have never been dissapointed. I trully prefer it to more expensive hotels in the area. Rooms as cozy and comfortable, with great design. Breakfast is really good (although expensive!) and the bar and restaurand are great places for some nice evening time.", "Date": "April 16, 2009"}, {"Ratings": {"Overall": "3.0"}, "AuthorLocation": "belgium", "Title": "“Good location + nice room”", "Author": "topsmed", "ReviewID": "UR18510918", "Content": "Old but completely renovated building in the golden triangle. The room was large (although oddly shaped) and nicely decorated in neutral colours. Smallish but well equipped bathroom with separate shower and large bottles of Molton Brown toiletries. The spa looks better on the Web site than in reality. It is in the basement and feels cramped. Small and cramped fitness room. No staff present in the spa and fitness area. Food is ok but nothing special, including the buffet breakfast. Service is not bad but not memorable. Value for money is average and the hotel is not really better than other four stars and no alternative to the palaces.", "Date": "August 1, 2008"}, {"Ratings": {"Overall": "1.0"}, "AuthorLocation": "London", "Title": "“Terrible Experience”", "Author": "QGGSW7", "ReviewID": "UR17104804", "Content": "We've been to Paris many, many times,and stayed in many of the top hotels. We had stayed at the Tremoille before and chose it again for a recent visit with out teenage son and his friend. We had a one bedroom suite and with a connecting room. Adequate but furnished with Ikea type furniture. Not exactly Plaza Athenee quality when you're paying 1400 euros a night. What was inconceivable was the treatment we received. On our first night I got a panicked cell phone call from my son saying he and his friend were stuck in the elevator between floors. He said they had tried the alarm in the elevator but just heard a recording in French. I rushed down to the lobby and told the concierge who said the alarm when to a company outside the hotel and someone would come. He wasn't more specific. I went up to where my son said they were trapped (they had been in there around 30 minutes by now) and heard them calling out. I tried to pull open the doors, and with the help of a hotel employee who was walking by we managed to pry it open enough for the two boys to squeeze out. Over the next three days I expected the management of the hotel to at least apologize for the ordeal we went through and the fact that children had been put at risk. Nothing, no comment at all, until the last day when, immediately after I had paid the large bill (and after they had to take some charges off the bill which they agreed were wrong), I was approached by a man standing nearby who introduced himself as the general manager. Instead of thanking me or apologizing for the malfunctioning elevator, he said that I had caused damage to the elevator by opening the door and was responsible for paying to repair it. When I said that was outrageous he replied \"Well then, it's a matter for the police\". Until that experience I have always had wonderful stays in French hotels, but this was terrible.", "Date": "June 21, 2008"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Recife", "Title": "“Charming Hotel and Great Locaton”", "Author": "cenoronha", "ReviewID": "UR15080240", "Content": "This is a very charming hotel in a great location. Just a few blocks from Avenue Montagne, Avenue George V and Champs Elisees. The staff is extremely kind and very helpful. I recommend it.", "Date": "April 16, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Business service (e.g., internet access)": "3", "Check in / front desk": "5", "Overall": "5.0", "Value": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "leicetershire", "Title": "“lovely location”", "Author": "visitorLeics", "ReviewID": "UR15075708", "Content": "stayed for two nights to celebrate a relatives 50th birthday. Free upgrade to deluxe room a little smaller than looked on website. Bed good size, yes furnishings a little scary. Bathroom a good size with separate, powerful shower. Service excellent especially Concierges. Lovely restaurants for lunch just around the corner full of parisians and not over priced (same as london). We went to Le Grand Colbert for the birthday celebration traditional french cuisine with a great atmosphere, very busy we had obviously booked and would recommend doing the same. Would return here in the future. Hotel great location just a few minutes from the Champs Elysees then midway between concorde and the arc de triomphe. Had a lovely walk one day along the Seine. Love Paris anyway this was a special stay first time away for my husband and myself on our own for 19 years! Would recommend the Tremoille for couples, however, lots of others to try on a return visit!", "Date": "April 16, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Check in / front desk": "4", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "leeds", "Title": "“Great Everything”", "Author": "mayamum", "ReviewID": "UR13883955", "Content": "I researched a hotel in Paris for ages before booking as it had to be right for our honeymoon. The prices are mad for the best hotels but we found La tremoille with a free upgrade. The hotel is an excellent position in the 'golden triangle' and walking distance to everywhere. The hotel is lovely, cosy, warm, clean, inviting and boutique all at the same time. The rooms are all individual and out junior suite was a good size ( for Paris ). There are lovely Molton Brown toiletries, gowns and slippers and plenty of towels. Our shower broke on the first morning and even though they tried to fix it while we were out, they moved us to a suite for the incovenience straight away. A lot of the rooms have a cute balcony so have a walk out to the nearby shops and buy croissants and orange for breakfast on the balcony as the hotel breakfast prices are crazy. I recommend this hotel for a romantic break with great service and my recomendations dont come lightly!!", "Date": "February 27, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Business service (e.g., internet access)": "3", "Check in / front desk": "4", "Overall": "4.0", "Value": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Sydney, Australia", "Title": "“Absolutely fantastic!”", "Author": "Mel1Sydney", "ReviewID": "UR12911120", "Content": "We stayed at the Tremoille over Xmas and New Year, Dec 07-Jan 08 for 8 nights. It was perfect. Admittedly, we had a fabulous suite (room 516), which had a long balcony (could see top of ET), a large bedroom with terrifically comfortable king size bed, lots of wardrobe space, large bathroom with separate shower and tub, plenty of room for cosmetics etc. Also a small hallway with extra toilet ,then a huge sitting room with sofas, dining table, bar etc. All this for the same price as an \"ordinary\" room at the Plaza Athenee! We are very well travelled and enjoy our space and good service. All the concierges at La Tremoille were excellent, friendly and well informed. Housekeeping was efficient and polite. The place was spotless (well, our suite had just been painted and refurbished, so it should have been!) We did not eat in the restaurant, having continental breakfast in our suite daily, which was relaxing. However we would often stop in the bar for a drink after a long day exploring, and that was pleasant... especially after Jan 2nd when smoking was banned! Really, this is a fantastic boutique hotel in an excellent location, with many lovely restaurants within walking distance. I did happen to glance into a few of the other rooms, and especially the inside room seemed a little cramped and dark, so I'm sure having so much space made a difference to our stay. But the staff, the location, the gracious atmosphere all contributed too.", "Date": "January 23, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Miami, Fl", "Title": "“Loved La Tremoille”", "Author": "mitoboy3", "ReviewID": "UR10946685", "Content": "This hotel is one of the nicest boutique establishments I have stayed in Europe. Everything form the room, to the amenities to the staff was just lovely. So much so, that I am returning this December (12/07)", "Date": "November 20, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "ny", "Title": "“Great Parisien hotel”", "Author": "travelsny", "ReviewID": "UR10028471", "Content": "The hotel is located just two blocks off the Champs Elysse in the same neighborhood as the Plaza Athenee and the George V. But the greatest thing about the place is that it's about half the price with twice the room! The hotel has undergone a great renovation, with a lobby that's quite chic and modern, and rooms that are spacious with large bathrooms. Our room also had a sitting area with a sofa, love seat, and cocktail tables. The high ceilings helped to make the large room appear humongous by Parisien standards. Free internet access is available in each room, and if you have any trouble the hotel actually has an IT person available to help with any problems. Service is professional, courteous, and quite good. The concierge was able to book us a table at a two-star Michelin restaurant nearby with fairly short notice. We tried the room service one night and found that the food was actually quite good, and quite prompt. Considering it's location near the Rue de la Montagne (Gucci, Marni, etc.), it's perfect for the fashionista. If you don't feel like hotel breakfast food, try La Duree on the Champs Elysee. And if you want to experience the best afternoon tea in Paris try the Fauchon shop--the 2nd floor serves great afternoon tea!!", "Date": "October 1, 2007"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "3", "Overall": "5.0", "Value": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "London", "Title": "“A lovely Parisien secret”", "Author": "s0s", "ReviewID": "UR8253134", "Content": "Despite staying at Hotel de la Tremoille for many years during trips to Paris, I have never posted a review of it. I simply don't want to share this hotel with anyone. I want it to be my secret. Sadly, judging by the reviews I have read here, it seems to be being discovered everyday. So I think it is time for me to confess my love of this hotel. La Tremoille is not a grand hotel but it is luxurious. It is not a large hotel, but it is big enough to enable a stay there to be discrete, if that is what you desire. The hotel is family owned and was renovated beautifully to the very highest standards a few years ago. The building is the corner of a beautiful block in the 8th Arondissement, just round the corner from the George V Hotel, the Champs Elysees, etc. One of the delight of the hotel is its characterful rooms which are all slightly different in layout according to their position in the hotel. This makes your trip to your room an unusual and delightful voyage of discovery. The staff are, of course, French which means that their service can sometimes seem slightly offish, but it is really just the French way. The rooms are plush, renovated beautifully throughout whilst retaining lovely features such as the little serving cupboard that allows items to be delivered to your room without anyone having to enter. Fabulous. The only thing to note is that the restaurant is very expensive. Go to one of the restaurants right across the road instead.", "Date": "July 29, 2007"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Business service (e.g., internet access)": "4", "Check in / front desk": "4", "Overall": "4.0", "Value": "3", "Rooms": "4", "Location": "5"}, "AuthorLocation": "u.k", "Title": "“Perfect location”", "Author": "bannanacat", "ReviewID": "UR7728189", "Content": "We stayed in the tremoille for three nights and had a very pleasant stay, our room was small with no view as faced an internal lightwell but well equipped and they let me check in at 7am after a loong flight so I wasnt going to wait around for a better room to come up , The main attraction of the hotel is it is in a really really nice part of paris and hanging out in the locality was really good fun, we could walk to all the major attractions and there are lots of good dining options within a stones throw, I will be back for sure and will make sure I get a larger room next time ..... The only negative is at 370 euro a night its a little on the steep side for the room size ....", "Date": "June 1, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Cambridge, MA", "Title": "“Really feels like Paris”", "Author": "theresama40", "ReviewID": "UR7380711", "Content": "OK, so maybe we're crazy, but the Hotel de Tremoille was one of the highlights of our 4-day trip to Paris. It felt very \"French\". It's in a historic building, so it has Parisian bones. But it's been completely updated to a thoroughly modern boutique hotel. Our deluxe room was supremely comfortable, with a great bed, a fabulous shower and free Internet access (a rarety in Europe). It also had a sense of style. Of course, I wouldn't want to live permanently with drapes made of purple fake fur, but it certainly was fun to feel chic for a few days. We also loved the staff -- warm and very helpful (forget all those stereotypes). And the chocolate croissants at breakfast lived up to the highest French standards. (The hotel restaurant and bar was closed for renovations while we were there, but the temporary restaurant/bar set up in two conference rooms was pleasant for breakfast.) The location had its pluses and minuses. Thehotel is located on a back street in the 8th arondissement. It's off-the-beaten-track location means that there's little noise at night; on the other hand, there's not a long line of taxis at the door, so you'll have to ask the doorman to call one in advance. Still, the proximity of the Plaza-Athenee and other well-known hotels means that there's a lot of restaurants in the neighborhood. We'd go back in a heartbeat.", "Date": "April 17, 2007"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "Estambul", "Title": "“hotel tremoille paris”", "Author": "raimunda", "ReviewID": "UR7251509", "Content": "We have just returned from Paris, we stayed at hotel laTremoille at champs elysees. We stayed at the hotel for the weekend and our weekend turned to a romantic escape weekend with this hotel. The hotel's location is very good, the rooms are very clean and the service is over qualified. The bed was very comfortable and I liked the place of the tv which was hidden in the wardrope. The hotel compliments at the bathroom were excellent quality and I can still remember the smell of the shower gel. The concierge was very helpful and simphatic. On saturday night we booked a show for the Crazy Horse by the concierge and our place at the show was the best place at the club. I recomend you to make reservation over the hotel by concierge, they really help you and make the things perfect. The only negative thing which I can say about the hotel, is the continental breakfast, which was included in our price. The breakfast was very poor. But with the tasty french breads you dont even think about it. I recommend you to take your breakfast outside the hotel. Next time we go to Paris I am sure thet we will stay at the same hotel again!!", "Date": "March 30, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "4", "Overall": "5.0", "Value": "4", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Columbus, Ohio", "Title": "“Absolutely wonderful”", "Author": "gold_nut", "ReviewID": "UR6546265", "Content": "We stayed at hotel de la tremoille for 1 night on new year's eve. The hotel was expensive, but if you can afford it and want an amazing hotel, book this one! From what I researched, it seems like you get very high end service and accomodations, but at the same time, it's not nearly as expensive as some similar hotels in the same area. The bed was plush, the bathroom was amazing, and furnishings were also very nice. It was a great treat for us and we hope to return someday when we have enough money to stay there for our entire trip.", "Date": "January 3, 2007"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Singapore, Singapore", "Title": "“Wonderful Stay!”", "Author": "dcLondon", "ReviewID": "UR6525926", "Content": "This is a wonderful hotel! My wife and I recently stayed for 3 nights and we really enjoyed this place. First, the staff are welcoming, friendly and professional. The room is well appointed and the bathrooms brand new with designer bath and shower products. The king size bed is extremely comfortable and the rooms are big by Paris standards. The hotel is also ideally located for the Champs Elysses and its shopping and restaurants. Also, there are quite a few restaurants literally across the street from the hotel, which we found extremely convenient. The only minor negative would be the breakfast, which wasnt great - however, there are an abundance of cafes etc within a short stroll of the hotel which are great for breakfast. Would also say that we forgot our passports in our room, and they were safely returned to us by the hotel staff. In all it is very difficult to fault this hotel and I will definitely stay there again when next in Paris.", "Date": "December 31, 2006"}, {"Ratings": {"Cleanliness": "5", "Overall": "5.0", "Value": "3", "Service": "5", "Rooms": "5"}, "AuthorLocation": "Singapore, Singapore", "Title": "“Nice Boutique Hotel”", "Author": "sti5brigade", "ReviewID": "UR5421372", "Content": "First time I've stayed in Paris. My Paris office booked me into the hotel, saying it was quiet and quaint Excellent, quiet neighbourhood, with some nice restaurants and rich people driving about (within 5 minutes a Ferrari, Lambo and Porsche GT2 went past me) Hotel is like stepping back in time a couple of hundred years. Rooms small but fine - I was only staying the night. Bed very confortable - bathroom top quality and a proper old fashioned huge shower - fantastic I tried the bar - a bit pricey for 9 Euro's a coke and 16 Euro's for an Oban Whiskey. Nice ambience and music 5 mins walk from a view of the Eiffel Tower. 20 Mins to walk to the Tower Conceirge and Doormen friendly and helpful - a rare treat compared to London! Breakfast nice but not included in room rate I paid 265 Euro's - quite pricey on Business - I would not pay that much personally - but still a real treat Very much recommended", "Date": "July 3, 2006"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "Dubai", "Title": "“8eme Hidden Gem”", "Author": "SnA", "ReviewID": "UR5039303", "Content": "We stayed in Hotel Tremoille for our honeymoon in Paris. It was the first time to be in paris for both of us. And to stay in a such a location was a very pleasant experience to us. The neighborhood was chic and far from all the buzz and traffic. Our superior room was rather good in size, their service was excellent and the staff is friendly. We received complimentary fruits and chocolates as we arrived. Since we were there when it was easter we also received a beautiful chocolate easter egg made by the famaous chocolateir Laduree. We enjoyed this hotel very much and would recommend it to anyone who wants to stay in the 8eme. All neighbor hotels are 5 star and quite expensive , but if your looking for something with a similar service off the beaten track then this is the hotel.", "Date": "May 7, 2006"}, {"Ratings": {"Cleanliness": "3", "Overall": "3.0", "Value": "2", "Service": "4", "Rooms": "3"}, "AuthorLocation": "ocala, florida", "Title": "“quite pricey not worth it”", "Author": "A TripAdvisor Member", "ReviewID": "UR4629944", "Content": "I stayed in this hotel for 3 days. The room was a junior suite on the 5th floor, and while I could see the eiffel tower, I could only see the very top, and only if I was sitting in the chair at the desk. It takes about 20 minutes to reach the eiffel tower using the RER ligne C. The internet was offered in the room, although only 15 or 30 minutes free and it was slower than 56k. By the time you got to the site your connection was lost. The concierge was very helpful, and the bed was comfortable. I ordered room service one night (the quiche lorraine) which was 18 euros....it was so small I was still very hungry after. The concierge did order a pizza from the Pizza Pino on the Champs-Elysees and I was not charged extra. All in all the room was nice, but for the price it was not worth it at all.", "Date": "March 17, 2006"}, {"Ratings": {"Cleanliness": "5", "Overall": "5.0", "Value": "4", "Service": "5", "Rooms": "5"}, "AuthorLocation": "Detroit, Michigan", "Title": "“Perfect Honeymoon Location!”", "Author": "8740RidgeRd", "ReviewID": "UR4461975", "Content": "Oh to be in Paris... and then to stay in such a beautiful hotel it was the perfect honeymoon. We stayed in a Junior Suite and while I will readily admit that I wished the price was less... it was worth it for Paris. We were very close to just about everything. We had asked for a room with a view of the Eiffel Tower and they delivered. We could see it from the sitting room on the couch, the top 2/3's at least... :) The bathrooms really are the crowning glory, gorgeous design and large for Paris standards. As mentioned, we had a separate sitting area with 3 windows which could be opened for fresh air, a lovely entertainment unit housing the TV and minibar. We did not eat at the hotel with the exception of one plate of pasta from room service, so I can't really speak to that part of the experience except to say that it was good, hot and delivered in a timely manner. We interacted with the concierge and were well taken care of. This was our honeymoon trip; I had looked at TripAdvisor and booked three different hotels, the Tremoille, Le Walt and Candran. Neither the Le Walt nor Candran could guarantee a view of the Eiffel Tower so I cancelled those reservations to go with Le Tremoille who did guarantee it and we were not disappointed. It was a brilliant little place that we would definitely go back to, even without the free bottle of Champagne and chocolates as we were honeymooners!", "Date": "February 15, 2006"}, {"Ratings": {"Cleanliness": "5", "Overall": "5.0", "Value": "5", "Service": "5", "Rooms": "5"}, "AuthorLocation": "", "Title": "“Gorgeous!”", "Author": "fffriend", "ReviewID": "UR4345480", "Content": "I love this hotel. Its so stylish and just how you would imagine Paris to be. It is expensive but you can honestly pay as much and more for hotels in Paris that not nearly as nice. I havent eaten here so I cant comment on that, but it's in such a great location you might as well venture out!", "Date": "January 11, 2006"}, {"Ratings": {"Cleanliness": "5", "Overall": "4.0", "Value": "3", "Service": "5", "Rooms": "5"}, "AuthorLocation": "UK", "Title": "“Perfect stay at Tremoille”", "Author": "jojosmaman", "ReviewID": "UR4322359", "Content": "We stayed at the Tremoille for two nights over NYE and we could not have asked for a better stay. The room (deluxe double) was extremely roomy esp for Paris- we have stayed in rooms a third of the size for not much less in Paris. The bathroom was very large with a lovely big bath and shower and Molton Brown products (which unfortunately you cannot steal!!). We were given a complimentary bottle of Champagne on the 31st which was a nice touch! We stayed for dinner in the restaurant on NYE which was good but not out of this world (although the service was excellent despite the restaurant being fully booked)and the wine casino in the bar after dinner was fun. On the 30th we had room service but the room service menu is not great- however, if you phone through to the restaurant then they will send a restaurant menu up to your room so you can choose from that. The style of the hotel is really nice with it being that cosy mix of traditional deco with modern touches which I think is hard to find in Paris-you normally get one or the other. The location is spot on if you like to designer shops with Gucci, Dior, LV and of course the Champs Elysee all in walking distance. All in all a great time at a great hotel!", "Date": "January 4, 2006"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "New York City", "Title": "“Stylish. Not pretentious!”", "Author": "A TripAdvisor Member", "ReviewID": "UR4231398", "Content": "I LOVE this hotel. The room decor is excellent! Coming from NYC we definitely notice when thought is put into interior design. We stayed in one of the two-level rooms which was perfect for one of us working on the computer downstairs (Free Internet a PLUS) while the other could rest in the bedroom upstairs. Cool leopard print here and there, great fabrics and comfy beds. Our friends who stayed on another floor had an incredible corner room with fabulous window overlooking rue de La Trémoille. We were pleasantly surprised that their room had a completely different design – equally as fashionable. We never stay in this part of Paris, but now that we found this fabulous spot we'll be back for sure. Our experience with the service was excellent.", "Date": "December 11, 2005"}, {"Ratings": {"Cleanliness": "4", "Overall": "4.0", "Value": "3", "Service": "3", "Rooms": "5"}, "AuthorLocation": "Lagos, Portugal", "Title": "“loved it! but don't bother with the breakfast”", "Author": "SamG2004", "ReviewID": "UR3941994", "Content": "I stayed here for 2 nights on business. It's a great hotel - I personally loved the deco in the room. I could have happily spent hours there, it was really welcoming. And sounds daft maybe, but it had a really lovely velvet-like carpet that made it so nice to get out of bed in the morning. And the bathroom, complete with Molton Brown products, was awesome! If I stayed again I wouldn't bother with breakfast. It's not a buffet, so €22 just for coffee, juice and a basket of pastry is way too much.", "Date": "September 27, 2005"}, {"Ratings": {"Cleanliness": "3", "Overall": "4.0", "Value": "3", "Service": "3", "Rooms": "4"}, "AuthorLocation": "United Kingdom", "Title": "“Great location but a bit pricey”", "Author": "fcchelsea", "ReviewID": "UR3837992", "Content": "I combined a work trip with a long weekend in Paris and as my company uses the Tremoille as one of its corporate hotels my partner and I decided to stay there for our whole trip. As has been said before the location of this hotel is great. It is far enough away from the Champs d'Elysee to be quiet but near enough to be able to get to most of the main tourist spots either on foot or by metro. We had a superior room which was plenty big enough for the two of us and much larger than the usual European hotel. The bathroom was great with a full size bath which is essential for any British traveller along with a good shower and great Molson Brown toiletries. The bed was huge and I quite liked the faux bearskin rug that covered it. My one complaint about the room would be the lack of a table which would have been handy when eating a room service breakfast. On the whole the staff were very pleasant, particularly the ladies who made up the room and the lady on reception. The porter was a bit frosty and also corrected our French (and not in a good way) but maybe he was just having a bad day. We didn't eat in the restaurant as we wanted to find somewhere with a bit of choice for vegetarians which is definitely a bit of a mission in Paris where no meal seems to be complete without meat, fish or seafood. Overall I would recommend this hotel for a short trip to Paris if you want to push the boat out.", "Date": "September 2, 2005"}], "HotelInfo": {"Name": "Hotel de la Tremoille", "HotelURL": "/ShowUserReviews-g187147-d228801-Reviews-Hotel_de_la_Tremoille-Paris_Ile_de_France.html", "Price": "$420 - $620*", "Address": "<address> <span rel=\"v:address\"> <span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">14, rue de la Tremoille</span>, <span class=\"locality\"><span property=\"v:postal-code\">75008</span> <span property=\"v:locality\">Paris</span></span>, <span class=\"country-name\" property=\"v:country-name\">France</span> </span> </span> </address>", "HotelID": "2514938", "ImgURL": "http://media-cdn.tripadvisor.com/media/ProviderThumbnails/dirs/59/2d/592d6ccdf12fa10f5a620757fc6a307c4large.jpg"}}