{"Reviews": [{"Ratings": {"Overall": "4.0"}, "AuthorLocation": "", "Title": "“Nice clean hotel with a bit of taste for Parisienne life”", "Author": "Fabioru", "ReviewID": "UR127550305", "Content": "Well placed for who searches a bit of real taste of Parisienne life off the beaten track though still at few minutes from metro/bus stops. Excellent and friendly staff always ready to help you with a smile , nice and clean rooms with very comfortable bed. Only drawback was breakfast . We tried both the unispiring expensive and the not very well organized cheaper one ,both not good enough for a \"4 stars \" hotel. We decided to take it out just to the many nice bars outside .", "Date": "April 9, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Canada", "Title": "“A nice surprise!”", "Author": "Ms30", "ReviewID": "UR127111022", "Content": "I must confess, I was a little hesitant in booking a Best Western in Paris. However, the pricing was very good and given some of the recent photos taken by other travelers on this site, we decided to have a go. We enjoyed it due to the following: 1. The location was quite good. Close to some main streets and relatively close to the metro station, making is convenient to go to different sites and places 2. Felt like a nice and safe neighborhood 3. The room we got was very recently renovated. Even though it was small, it had everything we needed. The shower is a rain shower, so that was a nice touch. 4. While we were staying there, there were renovations going on on other floors. So if you are looking to stay there, you may get a very very new hotel room :) 5. Free water/juices from the mini bar, which was great Overall, while the hotel room was small, it was a very nice experience. The staff was always friendly and there was not a lot of people using the free internet at the lobby and we were able to book things and check emails whenever we wanted to. Let me know if this review is helpful to you please. Thanks!", "Date": "April 2, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Johannesburg, South Africa", "Title": "“Magnifique!”", "Author": "Pipsa_12", "ReviewID": "UR126891290", "Content": "We visited Paris in March 2012 and stayed 5 nights at this hotel. We were greeted daily by very friendly and helpful staff. The rooms were clean, the bed was huge and very comfortable. Im still dreaming of the wholesome, fresh and delicious breakfast (served from early to very late)!! Its a bit of a walk to the metro and to Champs but didnt feel so bad considering how much we ate... We had an overall amazing experience in Paris, and thanks to everyone at Regents Garden for usueful tips and recommendations!", "Date": "March 29, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Singapore, Singapore", "Title": "“Excellent staff, lovely room”", "Author": "Charles G", "ReviewID": "UR126626810", "Content": "My wife and I stayed in a classic double room during our trip to Paris from 5-11 March 2012. Even before we arrived, the staff (whom we contacted via email) had helped us make reservations at several restaurants, and also answered several of our queries. During our stay they assisted us with directions, recommendations, contacting restaurants and other inquiries. They speak impeccable English, and are all extremely helpful and friendly. We had heard that hotel rooms in Paris are generally quite small, so were pleasantly surprised to find that our room was actually fairly spacious and also very clean and tastefully decorated. The bed is extremely comfortable! The minibar is free of charge, which was a nice touch. There is a Carrefour just opposite the hotel and a Paul just next door (where we ate almost daily for breakfast.). Our only complaint was that the hotel is a little bit of a walk from the nearest metro stations (about 10 minutes from either Ternes or Etoile), but that was only an issue the first 2 days as it was rainy and cold.", "Date": "March 25, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "London, United Kingdom", "Title": "“Fantastic - a real home from home”", "Author": "weeklycityvisitor", "ReviewID": "UR126200953", "Content": "I have been a weekly visitor to the Regent's Garden for the last few months as I've traveled to Paris on business. The hotel is one of the best I've stayed in almost anywhere. The staff are so helpful, kind - and as a bonus, they speak excellent English. Good sized rooms (particularly if you get one of the more expensive room types) - especially by Paris standards, where other hotel rooms can be so small as to be like a coffin! The Regents Garden is also in a great location - 5 minutes walk from Etoile, 10 minutes from the conference centre, and a 20 minute taxi journey to the Gare de Nord for the Eurostar. Oh - and the price is very reasonable as well. If it had a gym, it would be perfect - but you can't have everything! I will be returning...", "Date": "March 16, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Cleveland, Ohio", "Title": "“The real Paris. A nice find.”", "Author": "BDKtravelsworld", "ReviewID": "UR126148962", "Content": "I was attending a conference at Le Palais des Congrès and had waited too long to make my hotel reservation, so there were not many rooms in the area that were still available. In this situation, I am usually disappointed, but not this time. Let's start with the downsides. This is a small, boutique style hotel and doesn't have all of the fancy amenities that you will find at the bigger 3 and 4 star hotels, however, it is also less expensive. Also, as with many older buildings in Europe, especially former residences, the hallways, and particularly the elevators are small and cramped. This was not a big deal for me, but it could be a problem if you have a lot of large pieces of luggage. Now, on to the good stuff. This hotel is in a very typical metropolitan Parisian neighborhood. While there is plenty of activity; people in and out of local cafes, scurrying through the bakeries and the shoe shop, you do not have the tourist traffic. You really feel like you are part of the city and not just visiting. With all of this activity you might worry that it might be too loud, au contraire. Once you pass through the front gate and make your way to the garden in the back, you wouldn't even know that you were in the heart of the city. Sooo peaceful! I had a fabulous room with large windows that swung open to the garden below and woke to the sound of songbirds in the trees outside. I am serious, I am not making this stuff up! Now, I did have one of the larger rooms in the hotel because it was the only room left (I usually go for the most economical room) but for once I can say that this room really was worth the extra money, which by the way, was not that much more, about 230 Euro. Unfortunately, because I ate all of my meals either at the conference or at dinners afterwards, I did not get a chance to eat at the hotel. I would recommend this hotel to almost anyone.", "Date": "March 15, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "3", "Overall": "4.0", "Value": "4", "Location": "4", "Rooms": "5"}, "AuthorLocation": "wolverhampton", "Title": "“Excellent Staff and Great Location”", "Author": "Melissa1989", "ReviewID": "UR125953675", "Content": "I stayed at the Regents Garden for 2 nights as part of a surprise for my partners birthday, we were taken back by the quality of our room (room 203) it was just as depicted in the professional photographs. We did upgrade to a superior room, which was not cheap but we felt worth it. We managed to walk easily to the Arc d'triomph and even as far a field as the eiffel tower from the hotel. We went to the Moulin Rouge one night which was pricey but throughly enjoyable, and also a Bateux Parisiene dinner cruise. The only slight downside was that the people in the next room were quite noisy and we could hear their television, also i did find a few hairs in the bed on our first night. However overall due to location, helpfullness of the staff and hotel decor we would return if we were to come back to paris!", "Date": "March 11, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "", "Title": "“Wonderful, quiet hotel in excellent location with very friendly service and good price”", "Author": "Jiggyjoo", "ReviewID": "UR125649680", "Content": "We stayed here in March 2012 and booked after reading Trip Advisor reviews. We were pleasantly surprised to find the hotel even better than expected. Our room was immaculate and overlooked the small garden at the rear. A large and very comfy bed complimented a very quiet and nicely decorated room. The service when we checked in was very friendly and we got the impression they couldn't do enough. Location wise it is only a 5 minute walk from the Arc de Triomphe; there is a nice bistro/bar next door and we would recommend the steak and wine at the L'ecluse restaurant on the way to the Arc de Triomphe. We booked through another website rather than directly and this saved us quite a bit on the published rates. So, overall an excellent independent hotel with lots of charm and friendly service which helped make our stay in Paris very enjoyable.", "Date": "March 5, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Pulau Penang, Malaysia", "Title": "“The Right Bank hotel experience: A fusion of the past and present”", "Author": "DeeWei", "ReviewID": "UR124467887", "Content": "I was certainly pleased that the 2 hotels that my hubby and I stayed in during our Paris trip in mid- March 2011 was voted one of the “Top 25 Best Hotels in France” (Traveller's Choice 2012) . We chanced upon this lovely quaint hotel from one of our Paris travel guide books – Frommer's Paris 2011 if I'm not mistaken. As a first time visitor to Paris we wanted to experience both the “Left Bank” and “Right Bank” hence our decision to stay in 2 different hotels. We stayed here for 3 nights from March14-17. Does “Best Western Premier Regent's Garden” justify its #20 ranking? A resounding YES depending on the experience you are looking for. Location – Situated in the 17th Arrondissement: which is arguably “real Paris at its wealthiest and finest”. No major tourist attractions here – we found ourselves nestled in the midst of an upper middle class neighbourhood so every day we got to see local Parisians going to work/ having breakfast/ walking their dogs etc. An almost 10 minute walk to the “Charles de Gaulle-Etoile (CDG-Etoille) metro station/RER urban station” and to Arc de Triomphe and the most famous street on the Right Bank - “Champs Elysee”. A worthwhile point to mention is that the “Air France shuttle bus from Orly Sud (South Exit of Orly airport) that plies Route 1* stops somewhere in front of the CDG-Etoille metro station as its last stop. There is a Carrefour mini market just round the corner from this hotel and a few bakeries nearby – one opposite the hotel and another within walking distance. Numerous brasseries nearby albeit on the upscale side. External facade – Lovely and quaint sums up this gem of a hotel. It can be described as a French country mansion in the midst of urban Paris. The charm of this historical mansion would be its well-maintained garden. Guests have the option of having breakfast in its garden which we didn't owing to our late-winter stay. Room- We stayed in a “Superior Room” - room size was about 20 sq metres with a King size bed. The bed was comfortable with luxurious bedding and duvet. Bathroom came with a bathtub. There was a complimentary welcome platter for making coffee/tea and a packet of biscuit plus complimentary cold drinks in the minibar – which is something we both appreciated after a long day of sight seeing. The wifi connection was superb – a plus point as we could immediately upload pics of our sight seeing to family back home. Breakfast – We didn't try their buffet breakfast (20 euros) as we were more inclined to try the various pastries available at the bakery nearby. Service- The staff were warm and friendly and spoke good English. “Best Western Premier Regent's Garden” is admittedly situated on the rather off-beaten track, but if you are looking at 'Real Paris' of the 'Right Bank' and you want a spacious hotel room(it is spacious by Parisian standards) then this is the hotel for you.", "Date": "February 12, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Ireland", "Title": "“A gem of a hotel, fantastic staff”", "Author": "Meally", "ReviewID": "UR124290972", "Content": "My wife and I stayed here for a 3 nights in early February. The hotel was fantastic, a real home from home. The highlights would be the location, the room but most of all the staff. First, the location is great for exploring Paris. The Charles de Gaulle Etoile station is about a 5 minute walk away and you have a good choice of lines from there. The Arc de Triomphe is a ten minute walk away and dominates the entire area. There is a Carrefour mini-market on the corner about 20 metres from the hotel entrance that has a good selection of most things. Straight across from the hotel is a wonderful boulangerie called Degranges. The fresh croissants and baguettes were a highlight of the trip, and of course the cakes were delicious. The queue out the door on a regular basis showed that the locals valued the place a lot too. There are plenty of places near the hotel to eat and a couple of bars also. We had a room overlooking the garden on the second floor and it was very quiet. We didn’t eat out in the garden as it was never above freezing while we were there but it looks lovely. It also meant that our room was lovely and quiet at all times. There was some redecorating happening on the second floor but it didn’t have any effect on us other than a smell of paint in the hallway. The room was bright and had a decent sized bathroom. There was a very comfortable bath, with a shower in it. The bed was comfortable and there was plenty of wardrobe space. Overall, it was the small touches that made the difference: the complimentary drinks in the refrigerator, the bath robes, the safe, the heated towel rail. The free wi-fi and complimentary newspapers in the lobby were a nice touch too. The biggest positive about the hotel was the staff. From the moment we walked through the door to the time we returned for our luggage they were unfailingly friendly, helpful and polite. They really do their best to make your stay enjoyable, from receptionist to porter to chamber maids. Maybe it’s because of the high competition from other hotels in the area but they really have a great attitude and it sets them apart. They helped us print out our boarding cards, gave us extra blankets on one of the colder nights and held onto our luggage after we checked out. Most people would expect that service, as we did, but it was the friendly helpful attitude that stood out. We weren’t an inconvenience to them but a valued guest. The girl Aude who checked us out is a good example, we were checked out quickly and efficiently but also with a smile. This was our third visit to Paris but we know where we’ll be staying for our fourth, whenever that may be.", "Date": "February 8, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "London, United Kingdom", "Title": "“Great Stay”", "Author": "mayfielduk", "ReviewID": "UR123477222", "Content": "Stayed in a Superior Room and was given a 'garden view' when we arrived. All staff were very friendly, room was great. The Ternes tube station was no more than 5 minutes away, there is a beautiful patisserie opposite the hotel, a supermarket on the corner of the road and a brasserie next door. Would thoroughly recommend the hotel to anyone.", "Date": "January 23, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Toronto, Ontario, Canada", "Title": "“It is a fabulous hotel!”", "Author": "pedroduqueribeiro", "ReviewID": "UR123380840", "Content": "Stayed there last year a week before x-tmas with my husband. We were in a front room with two windows. The rooms are great, I mean, FABULOUS!! They have this cute tiny elevator witch I found very interesting.They also have a very helpful staff. It's also close to arc du triumph and subway stations. If you have money you should stay here! :D", "Date": "January 20, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Chicago, Illinois", "Title": "“Wonderful hotel”", "Author": "Karee W", "ReviewID": "UR122763268", "Content": "The staff was perfect, very helpful and friendly. The rooms were large and beautifully decorated. The location was easy, lots of places to eat in the area and easy to get to the metro.", "Date": "January 8, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "3", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Torrington, United Kingdom", "Title": "“small but perfectly formed”", "Author": "Craske", "ReviewID": "UR122508611", "Content": "This is a lovely hotel in an excellent location, it's beautifully clean and wonderfully decorated. My only personal gripe would be due to the tiny room we were given, room 304, I believe it's the smallest room in the hotel and due to this we found it cramped and incredibly hot. I was also looking forward to having a bath but this room didn't have one. We did ask to be moved but the hotel was fully booked. The staff were very helpful but because of the size of the room I was disappointed with the hotel.", "Date": "January 4, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Brussels, Belgium", "Title": "“Excellent value”", "Author": "Igorius", "ReviewID": "UR122319874", "Content": "We recently spent two nights at the Regent's Garden, and it exceeded our expectations in pretty much every single way. First of all, this is the best value I have ever experienced in Paris (and I've stayed at quite a few hotels in town). Very helpful and friendly staff indeed, and the place has a laidback and cosy air to it. Location is not bad either, with plenty of shops and eateries right outside the door. As luck would have it, we were upgraded to a rather spacious room facing the lovely garden (which must be a great place for having breakfast in the warmer seasons). We will definitely come back.", "Date": "December 31, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Toronto, Canada", "Title": "“fabulous and elegant”", "Author": "albertobrazil", "ReviewID": "UR121806001", "Content": "I stayed at this hotel and I can say they really know their stuff.A very discrte entrance at a very quiet street,this hotel offers the quietness and privacy . The staff is super friendly and courteus.They showed me the whole hotel and a butler insisted to carry even my suitcase! ( but for social/politicl beliefs,I strongly opposed). The suite is not big,as some have stated ere, but I guess this is part of the charm. Breakfast has 2 choices: 5 or 20 euros. zthe location is excellent. I seldom stop to depict this much a hotel but this ne,believe me,was all the way worth it. Moreover, I went with my husband and made c-l-e-a-r that we were ( legally) married in Canada and thereveption the best ever.This,for me, is a super plus.", "Date": "December 16, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Location": "5", "Rooms": "4"}, "AuthorLocation": "", "Title": "“Nice hotel”", "Author": "Eriasoo", "ReviewID": "UR120575322", "Content": "Conveniently located, clean room, friendly staffs. Good enough to recommend to my friends iNice Best Western Premier level hotel.", "Date": "November 14, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "3"}, "AuthorLocation": "", "Title": "“Lovely hotel with lovely staff.”", "Author": "Superkiwi496", "ReviewID": "UR120191513", "Content": "Had a lovely stay at this hotel, and it had everything that you would expect from a 4 star hotel. The staff were really welcoming and friendly, and, thankfully their English was fluent. The room was luxuriously decorated , and we even had our own nespresso coffee machine! On the down sides, it was a bit of a walk from the nearest metro, and whilst that isn't normally a problem, when your carrying heavy luggage, it's a bit of a hike. Also, the room was a bit pricey, but seemed what you should expect to pay for a Parisian hotel, but we didn't have a working shower in our bathroom. We did have a shower but it was positioned so that tin order to use it it was necessary to kneel in the bath. But I'm just being picky. It was a lovely hotel, and I would definitely stay there again.", "Date": "November 5, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "salisbury, uk", "Title": "“Almost ideal”", "Author": "piwismum", "ReviewID": "UR120118986", "Content": "This hotel may be a little out of the way of the main tourist hop spots but that doesn't mean it's badly located. It's just 10 minutes from the Arc de Triomphe, the Air France direct shuttle buses to the airports, and the main RER A line as well as the metro. By being a little out of the way, it's nice and quiet. It has plenty of restaurants, patisseries, ATM's and other shops very near. I've stayed in other hotels along the Grand Boulevards in Paris and it was far nicer to be away from the noise and bustle of these. I don't think it's entrance does it justice - you think you're coming in the trade entrance down the little back street but the welcome from the reception staff make up for it. The room was a little smaller than I expected (having upgraded to a superior room) but it was beautifully equipped and furnished. Contary to a previous reviewer, I found the beds and accompanying linen to be extremely comfortable - probably the best I've had in a hotel. The Nespresso machine (£1 a capsule) was a lovely treat as was the mini bar containing complimentary coke, orange juice, still and sparkling water - restocked daily. My only complaints were that I wouldn't expect to have to kneel in the bath to take a shower in a four star hotel as the fixing was not full height and the there was no shelf or drawer space unless you wanted to stand on a chair to use the shelves above the hanging space in the wardrobe. However, I know that other rooms were a little bigger and probably didn't have these problems so certainly wouldn't let it put you off.", "Date": "November 3, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "3", "Sleep Quality": "5", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Singapore, Singapore", "Title": "“Friendly and Relaxing”", "Author": "champagnesupern0va", "ReviewID": "UR120106481", "Content": "Very friendly, clean and relaxing hotel in a great location. A little expensive but when compared to other hotels in Paris it's very good value for money. Rooms are a little on the small side but again, for Paris, this is not unusual. Bedrooms and bathrooms were very clean. Breakfast was excellent with fresh fruit, pastries, cheeses, cold meats and great bread, coffee and orange juice. Overall, probably the best hotel I have stayed in when visiting Paris. Would definitely recommend it.", "Date": "November 3, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Atlanta, Georgia", "Title": "“nice hotel/ good value if you get a deal”", "Author": "europeantraveler1953", "ReviewID": "UR119872717", "Content": "do not get the smallest room! front desk got us a larger one next night or i wouldnt have stayed.that was much nicer.things i liked..staff,clean,fresh and new.they try to please and be helpful.try for room in the back.was too noisey in front or bring ear plugs.was fine when windows closed up completely but that made the room stuffy.windows open for air made it too noisey.pillows horrible..bed fine.bring your own shampoo.they have stuff for body etc in a container..great if you are taking a shower..i take a bath.i found this place a bit out of the way..make sure you take a map.its 10 min or so to metro.took us a while to figure it out! M1 line takes you alot of places althought metro is crowded and confusing if you arent used to it.id say take a cab from airport to get there,get tickets for hop on hop off bus to get the lay of the land..deal for 2 days;also available for boat on sein.wish we had cause i was ready to scream from getting off at wrong stops or not being able to figure out how to get somewhere.seems no one can speak english?? or they would send us to the wrong place! do not take the airport limo back to airport that they offer..how can i say.. spend the extra 10 euros or you are taking your life in your hands and handing it over to a moron with a piece of crap van thats taped together! i drive safe cars at home ..so what was i doing in the 3rd row seat, with broken seat belts,and a car that sounded like it had bald tires or some problem and taped together! im not kidding and i didnt appreciate best western recommending this.coffee pot in room has 1 euro charge per cup if you use it.i didnt ,but they had a charge for it on my bill..i had it removed...no problem.internet..computer is in french and they do try to be helpful but skip that,unless you are able to figure how to change to english..although there is free wireless.we skipped the 20 e breakfast.across the street is the best pastry shoppe and grocery, good for beer and water.we went up to mcdonalds..for 3 e you get any type coffee..even cappachino..oj and egg mcmuffin..oh and even get to use the bathroom! gardens are nice and you can buy great stuff at pastry shop and eat it in the garden.i found this hotel too out of the way for my taste..bob said he liked it and would stay there again.i like opera area better,closer to it all.price was right for this hotel..and has alot of good qualities.guess i like more luxury and larger hotels..but again good value,nice folks.figure out the metro and carry a map..bring your own toiletries and pillow,and coffee..and youll be fine.i think 4 start hotels should at least have a free cup of coffee in the morning.", "Date": "October 29, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Southend-on-Sea, United Kingdom", "Title": "“Very modern, quiet, recommended.”", "Author": "Edward J", "ReviewID": "UR119789050", "Content": "I went to Paris on business for 3 days and stayed in the BEST WESTERN Premier Regent's Garden. The room was excellent, looked newly refurbished, very stylish and luxurious, if a little on the small side, but this is common to most hotels in the heart of Paris. It's round the corner to the Arc de Triomphe and directly opposite a Carrefour supermarket which is very convenient for stocking up on bits and pieces. I stayed in room 305 which overlooked the garden courtyard, nice and quiet. Very impressive bathroom with 2 sinks, only negative is this room only had a bath and not a proper stand in shower which I prefer. My colleague who stayed in the room opposite had a much bigger room and shower so it was luck of the draw. I would definitely recommend this hotel and will be going back. The staff spoke excellent English, were very polite and helpful also.", "Date": "October 27, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Southern California", "Title": "“Nice Place To See Paris..”", "Author": "EdR2", "ReviewID": "UR119161789", "Content": "We stayed at Regent's Gardens in Paris for Three Days. The rooms were a little small but the staff was great. The rooms were very clean and the prices were very reasonable for Paris. The hotel is within 10-15 minutes of the Champs Elysées and the Arc de Triomphe. The Gardens behind the hotel are wonderful place to have coffee and a light breakfast (8 Euros). There are many wonderful restuarants located nearby.. and it is Paris!!", "Date": "October 10, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Zeist, The Netherlands", "Title": "“What a quiet place”", "Author": "HenM081", "ReviewID": "UR119102493", "Content": "We ( a couple) stayed here two nights. The front desk staff was very friendly and helpful. Our room at the garden site was very comfortable and quiet. Breakfast was served in the garden and was perfect. The hotel is situated on short distance (six minutes to walk) of the Arc de Triomphe and the Metro.", "Date": "October 9, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Lille, France", "Title": "“what a beautiful garden”", "Author": "jean marc G", "ReviewID": "UR119046867", "Content": "everything is fine in this hotel (room, service, location,...) but the cherry on the cake, is their wonderful garden on the backside, where you can have breakfast if the weather is good enough. really great place, and fine staff.", "Date": "October 7, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Bedford, Massachusetts", "Title": "“What you see and what you read is what you got!!”", "Author": "115Nancy2011", "ReviewID": "UR118890057", "Content": "The hotel is lovely. It looks just like the pictures on trip advisor and all the comments that you read were spot on. I arrived at 8:30 AM and I was shown a choice of three rooms that were available. The hotel is spotless and the rooms look just like the pictures. The staff were warm and welcoming and it is very conveniently located. It was a lovely touch to have a bottle of water, juice and a soda for gratis in your fridge every day.I took the bus from CDG airport that drops you off on Avenue Carnot and from their it is basically a straight walk of about 7 min to the hotel. The area is lovely. Residential enuf that if you wanted that kind of experience you got it. Walk down the street to Pauls Boulangerie and have your morning Noisette and crossaint outside and look at the flower shop that puts out all its wares right in front of your table. Watch the parade of nannies and amble to the Metro. You are on the best line. Line 1 that connects to everything. Also 6 and 2 at Etoile. Tres convenient. My only regret is that I didnt have the time to sit in the garden. It truly is beautiful. BOOK IT!!", "Date": "October 3, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Sleep Quality": "2", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Ottawa, Canada", "Title": "“Good hotel, but...”", "Author": "drb8053", "ReviewID": "UR118746935", "Content": "We stayed here at the very end of a multi-week trip to Europe, by which time we were a little tired and starting to look forward to coming home. The hotel is well-situated close to metro stops and the Arc de Triomphe, and we had no problem getting around the city. The front desk staff were very courteous, helpful, and friendly, recommending metro routes to places we wanted to go. It was a very amusing check-in when they showed us to our room - which was about ten feet away from the front desk, and right inside the main hotel entrance. The room itself was fine, but we had immediate concerns about noise. We were assured that the door had been fitted with extra padding to minimize noise (and this padding was visibly in place), but we still found an almost-unacceptable amount of noise from the hotel lobby and stairs, which were adjacent to our room. Fortunately for us, we sleep with earplugs and the noise wasn't quite enough to compel us to ask for a room change - but we thought about it. We also thought the breakfast buffet was a bit on the expensive side at 20E p/p, but in hindsight it was probably in line with other European hotels in this class. We didn't feel like hopping out of bed and searching for other places to have breakfast, so we sprung for the buffet anyway. Based on the noise concern alone (and we are aware of other guests who had similar concerns), if we were to return to Paris I'm not sure we'd stay here again without investigating other options.", "Date": "September 29, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Severna Park, Maryland", "Title": "“Lovely hotel, superior service”", "Author": "Mary Ellen B", "ReviewID": "UR118621748", "Content": "My husband and I spent two nights at this lovely hotel with my son and his girlfriend. Our room was fabulous with a great shower. The staff couldn't have been more accomodating with our feeble attempts at French. We loved Paris and found most everyone we encountered warm and helpful. We can't wait to return to this city and especially to this hotel.", "Date": "September 26, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "4", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Dublin", "Title": "“This is the hotel in Paris that we would go to again”", "Author": "jaybor", "ReviewID": "UR117902372", "Content": "Great room, good location, excellent staff & great value.", "Date": "September 10, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "3", "Overall": "4.0", "Value": "4", "Service": "4"}, "AuthorLocation": "Toronto", "Title": "“A Paris Favourite”", "Author": "boboakville", "ReviewID": "UR117555119", "Content": "I've stayed here on business over the past 15 years. As a couple, we've kept coming back to this hotel, as it's a small boutique hotel, with an interesting history. I believe they said it was the house of the doctor to Napoleon III. We arrived in Paris via Eurostar and took the Metro to the closest stop to the hotel, where it's about a 10 minute walk. The streets are lined with shops and restaurants. Its close to Etoile/Arc de Triumph. Paris is a walking city, which we like to do when in Paris. The room was the usual small Paris room, but comfortable. The bathroom was modern and updated. Not a large desk to work on if you're on business. but it gets the job done. Breakfast was included in the room, and there's a good choice of items on the buffet - all fresh. Staff are helpful and can provide assistance when asked. We'll keep coming back here.", "Date": "September 1, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Rolling Hills, California", "Title": "“My Favorite Hotel in Paris”", "Author": "mer90274", "ReviewID": "UR117553887", "Content": "I was just in Paris last month. I stayed at my my favorite hotel, Regent's Garden for the 4th time. The first time I stayed here was a little more than twenty years ago. I love this place! Situated on a quiet street, patisserie, florist and other small shops across the way, it's like going to your great aunt's mansion. The rooms are clean and pleasant, not dreary like many historic hotels I've stayed in. The staff is cheerful and professional. They seem equally happy to put up with my cruddy French, or speak English with my friends and family. I recommend booking a room with the complimentary breakfast; i can't imagine starting the day without dining in the lush patio garden. For those like me who enjoy taking public transportation, there are two Metro stops within easy walking distance: Ternes and Etoile.", "Date": "September 1, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Dublin, Ireland", "Title": "“Great stay in a great hotel, highly recommend it.”", "Author": "Ruth R", "ReviewID": "UR117471436", "Content": "We stayed here for two nights the start of August... We absolutely loved Paris and this hotel added to the wonderful time we had. The staff were extremely friendly and helpful. Hotel location was perfect, just a couple of minutes walk from all the main attractions...... Would recommend it to anybody looking for somewhere to stay in Paris.", "Date": "August 30, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "4"}, "AuthorLocation": "Toronto", "Title": "“Great location, good value”", "Author": "sferaverde", "ReviewID": "UR117173767", "Content": "Regen't Garden is located a short walking distance from the Arc de Triomphe and the Champs Elysees. The building is a historic mansion, stylishly decorated in a successful fusion of the old and the modern. It's fairly small, but sweet, cozy and comfortable for a short city visit. The service in most cases was great: friendly, accomodating, real pleasure. The only weak link was one unbelievably inefficient waitress who couldn't cope with very few people at breakfast. At 8:45 there was no scrambled eggs, no juice, the tables remained uncleared... And yet , another day, another server (a dark skinned gentleman with impeccable manners) did everything right. The hotel has a charming little garden in the back where one can be served breakfast or just relax (if the staff made sure the loungers were wiped from the morning dew, it 'd be even more fantastic:-). Last, but certainly not the least of the hotel's benefits is a tiny, private parking lot that doesn't offer too many spots, but is certainly very convenient. Overall, great little hotel with loads of charm in an unbeatable location.", "Date": "August 24, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "4", "Overall": "5.0", "Value": "4", "Service": "5"}, "AuthorLocation": "Letchworth", "Title": "“Fantastic Staff and a lovely stay”", "Author": "markgrg", "ReviewID": "UR117073394", "Content": "I have visited Paris many times but have not stay anywhere as welcoming. We went for a weekend and largely thanks to our stay here wished it was longer. The hotel has a lovely garden which is great for families, is not too far from the Arc de Triomphe and the Champs Elyses and is tastefully decorated but its greatest asset is the staff, who were wonderful and very patient with my 21 month old daughter. For any families it is a great location being only a short distance from Le Jardin Acclimatation (http://www.jardindacclimatation.fr/) which is an amazing place to take young kids. Thanks again to the staff telling us about it. When we next return to Paris we will return here and would recommend anyone to do the same especially if you are a young family", "Date": "August 22, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "4.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Kazz101Kazz101", "Title": "“lovely hotel”", "Author": "Kazz101Kazz101", "ReviewID": "UR117048181", "Content": "had a lovely couple of days stay at this hotel. It was spotless clean and the staff were very friendly and informative . Smallest lift ive ever seen in my life", "Date": "August 21, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "4.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Lehigh Valley, PA", "Title": "“You feel like you just moved to Paris”", "Author": "lovedisneyfam", "ReviewID": "UR116941755", "Content": "I now have a very small apartment in Paris. That is the overall feeling. The location both remarkable and out of the way. You can visit a bakery and a Carrefour(grocery store) with the locals, yet it is a fair walk to the Metro. Both of these make the location the top benefit with Regent's. The staff is incredibly friendly and the hotel is very clean. As far as the rooms, well, you are in Paris. My room was small enough that I had to lift my standard size bag OVER the bed to get it in the room. Even a young couple in love would find my standard room \"cosy\". Overall, the hotel is well worth the price and I would give it 5 stars if I just had a bit more space.", "Date": "August 19, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "4", "Overall": "4.0", "Value": "5", "Service": "5"}, "AuthorLocation": "North Yorks", "Title": "“Very Good Paris Hotel”", "Author": "windrusher", "ReviewID": "UR116816080", "Content": "My Husband and I and two teenage daughters stayed here for 3 nights, we had two rooms both of which were furnished to a vey high standard with very nice shower rooms. Our bedroom, a double was a bit small, but perfectly formed. The breakfasts were really good we particuary enjoyed the freshly squeezed juice. The service was excellent, the staff were helpful, polite, knowledgeable and attentive. We would say it was very good value for money for Paris.", "Date": "August 16, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "3", "Overall": "3.0", "Value": "2", "Service": "3"}, "AuthorLocation": "", "Title": "“Expectations not fulfilled”", "Author": "Fluterphil", "ReviewID": "UR116487026", "Content": "My wife really wanted to stay here because of the history and the descripton of the garden. On arrival the room looks good and the bathroom good too but.....the toilet is at the other side of the bed and you need to walk round the bed and past the wardrobes and storage space to wash your hands. The mini bar only had two or three complementary soft drinks in it, Coke,lemonade and a sparkling water plus the normal bottled water all rooms now have. I did not think it was really worth paying over £500 for two nights. The staff were good, the room clean, breakfast was OK but for that sort of money I expected a lot more. I have paid a lot less for better quality in Paris on previous visits. The garden was really good, well laid out with lots of greenery and shady quiet areas with tables and chairs. Disappointing overall and will not return. Not even for half the price!", "Date": "August 9, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "4", "Service": "5"}, "AuthorLocation": "Gloucester, United Kingdom", "Title": "“Absolutely lovely”", "Author": "alekswu77", "ReviewID": "UR116179231", "Content": "Very attentive and helpful staff. Attention to detail - villeroy & boch, rosenthal crockery. Beautiful outside breakfast area.", "Date": "August 2, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "4.0", "Value": "4", "Service": "5"}, "AuthorLocation": "Perth, Australia", "Title": "“Terrific staff and location”", "Author": "janpet47", "ReviewID": "UR116103978", "Content": "The helpfulness and friendliness of the staff was a treat - thank you for making our stay memorable. Loved the bed - so comfy. The location about 300m walk from the Champs Elysee, the patisserie and market across the road and near to many restaurants put this hotel near the top of the list in our opinion. Breakfast was expensive.", "Date": "August 1, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "3", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Leeds, United Kingdom", "Title": "“we thouroughly enjoyed our stay”", "Author": "bee_helen", "ReviewID": "UR115767348", "Content": "lovely peaceful hotel, staff were lovely and very helpful , would definately return. Lovely garen at rear of the hotel also. Our room was a littel noisy at night as it was situatued adjacent to the road but it was during the Tour de france weekend so it wasnt really surpirsing!", "Date": "July 25, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "3.0", "Value": "3", "Service": "5"}, "AuthorLocation": "Cork", "Title": "“V quiet typically old parisien style”", "Author": "Bilberry", "ReviewID": "UR115560335", "Content": "My husband & I stayed here for our first trip to Paris. We enjoyed our stay here and found the hotel to be very quiet, which was lovely after long days sightseeing. The hotel staff are really lovely and spoke excellent english. Praise to all the staff. The hotel is v small and is located about ten minutes walk from the champs elysess. It is a v old building tucked into a side street in the more parisien older section . We found it v easy to reach from the bus depot . We opted to upgrade from a standard room to a deluxe room which if you are staying I would recommend as the rooms beside ours looking v tiny. Our room was exactly on the website, good size, nicely decorated and overlooking inner courtyard and really quiet which we loved. We didn't opt to eat in the hotel, which has a v small dining room, as we booked room only so can't comment on food. There is a gorgeous bakery directly across from the hotel and a supermarket a few steps down. Overall this is a v good old style hotel, with four star decor , it is v bijoux and located in parisien part of Paris, off the tourist beaten path. Would I return? Not sure, would like to try more modern hotel closer to main Champs Elysess if going back, but this hotel ticked all boxes for comfort and friendliness.", "Date": "July 20, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "4", "Service": "5"}, "AuthorLocation": "Cannock", "Title": "“Wonderful hotel”", "Author": "andyd68", "ReviewID": "UR115500488", "Content": "I booked this hotel as a surprise for my wife on our 10th wedding anniversary. I couldn't have asked for more from the hotel, friendly helpful staff, a beautiful hotel full of character ( an upgrade to a luxury room certainly helped!!) and a fantastic location from which to discover Paris. Plenty of good quality restaurants and cafes locally ( L'Arc especially recommended) and situated between two metro stations. This hotel is a true gem in a lovely city !", "Date": "July 18, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Texas", "Title": "“Comfortable and personable”", "Author": "noelani81", "ReviewID": "UR115484971", "Content": "My mother and I stayed here for 2 nights at the end of a work trip for me. We decided to stay at the Regent's Garden due to so many positive reviews on tripadvisor. We were not disappointed. The hotel location is a little out of the way but as long as you don't mind walking or taking the metro it shouldn't be a big problem. The hotel staff is very helpful and friendly. The courtyard garden is beautiful and such a wonderful spot to start your day with some breakfast and free wifi! I would also like to say a special thank-you to the staff for contacting us right away after they had discovered I had left a bag in the security box. They sent the bag to my home and I really appreciate their honesty. I would definitely recommend this hotel!", "Date": "July 18, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "4.0", "Value": "4", "Service": "4"}, "AuthorLocation": "Florence, Italy", "Title": "“Small , great location and quiet would stay again”", "Author": "Steamworks", "ReviewID": "UR114921556", "Content": "Good location for access to the sights, shops and the Metro, the staff were most helpful. the room we had was large (for Paris) and the bathroom had 2 basins, shower and bath. Small supermarket ,bakery and cafe across the road. The garden at the back of the hotel is a gem, provides a nice quiet spot at the end of the day for a quiet wine or two. would recommend for couples and business stay in Paris.", "Date": "July 1, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "4.0", "Value": "5", "Service": "4"}, "AuthorLocation": "Minneapolis, Minnesota", "Title": "“A Piece of Peace in Paris”", "Author": "aussietravelfairy", "ReviewID": "UR114881750", "Content": "This was a great little boutique hotel, hidden from the main road but wonderfully close to everything. Recently renovated, remarkably clean with fabulous decor, a super cute garden and excellent location, this is somewhere I would stay again. There is a chic bar next door, a patisserie across the road, a small supermarket about 25m away, and a few shopts away in the opposite direction (which alas - I didn't find until the last day) a very good, upmarket delicatessen & a chocolate shop. The area is safe, and the Metro is a 10 minute walk. Only a couple of tiny quibbles: maid service occasionally forgot minor items - once it was the milk for my tea/coffee, the other time it was the biscuits (which usually ended up being my breakfast). The maid (in stereotypical but uber-cute French maid's uniform) asked me a question in French. I responded (in French) that I don't speak French, only English. She continued to talk to me in French. I responded (in French) that I didn't understand, and that I needed her to ask in English. I then said in English that I was going to work and my room was ready for when she wanted it. She snapped at me (in French), glared, threw her hands up in frustration, and stormed off. Not sure why she was surprised that a hotel guest spoke English. I had 4 weeks notice I was going to Paris - not enough time to become fluent in French. All other staff were fluent in English and lovely. Parisien hotels can be awful, but despite the maid's minor hissy fit, this was great and I wouldn't hesitate to return PS: LOVED the rain shower, but the bathroom needed more lighting for putting on my make-up. Also, a full sized mirror would be nice.", "Date": "June 29, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Brisbane, California", "Title": "“Absolutely fabulous”", "Author": "crazyblonde_10", "ReviewID": "UR114695303", "Content": "Cant say enough good things regarding this hotel. The room we had overlooked the garden and was ultra modern with a kingsize bed. The staff are helpful, friendly and kind. The hotel is close to restaurants, grocery shop(just across the street) and not that far from the metro (ten minute walk). Unlike most hotels in Paris this hotel is quiet, we were on the ground floor and didn't hear a thing. Loved it. Would stay here again.", "Date": "June 24, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "London", "Title": "“Lovely hotel and rooms”", "Author": "princessme123", "ReviewID": "UR114175690", "Content": "Beautiful hotel with gorgeous garden and rooms. Very comfortable bed with heavy curtains so we slept peacefully. Lovely modern and clean bathroom with rain shower. Enjoyed a bottle wine in quiet leafy garden after lots of sightseeing. Didnt have breakfast as so many lovely bakery's in Paris. Efficient and friendly staff.", "Date": "June 18, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "4", "Overall": "4.0", "Value": "4", "Service": "4"}, "AuthorLocation": "gmp67", "Title": "“Good business option - quieter than most”", "Author": "gmp67", "ReviewID": "UR113115587", "Content": "Friendly in a quite arrondissement. Enjoyed the stay - although having a room that led off immediately off reception was a little bizarre.", "Date": "June 13, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Sydney, Australia", "Title": "“So comfortable, so chic”", "Author": "toknowhow", "ReviewID": "UR112850199", "Content": "We recently stayed here and found the hotel to be very comfortable, clean with very friendly, helpful staff which made our stay very enjoyable. Our room on the top floor top was newly renovated and was beautifully appointed with a big comfy bed and glorious shower. The hotel was in a very good location with a delicious bakery across the road and lots of good cafes and restaurants nearby. The staff were very helpful and Michael in the breakfast room made everything spot on. Would highly recommend this hotel to anyone wanting a truly parisian experience, we will certainly return when we can. Thank you....job well done. Mr B Gettens.", "Date": "June 12, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Winnipeg, Canada", "Title": "“Broke in the newly renovated suite”", "Author": "Mandatron", "ReviewID": "UR109556847", "Content": "The hotel is beautiful, and since we used air miles to help pay for our best western stay we didn't mind indulging a little bit. The service staff were all exceedingly kind. The suite had just finished renovations the day before and had been triple cleaned that morning. It was rather nice, especially the shower, and my partner and I had a wonderful time there. It's so near the Arc de Triomphe and so many beautiful stores and cafes on the way. It helped make our romantic Paris weekend unbelievably wonderful!", "Date": "May 23, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Maastricht, the Netherlands", "Title": "“Nice hotel with friendly staff”", "Author": "Dutchess12", "ReviewID": "UR109008589", "Content": "We stayed here during a congress with a group of 10 and all of us absolutely loved the hotel.The hotel is small and doesn't have all the amenities of larger hotels, but makes up for it in atmosphere and wonderful staff who are genuinly friendly and provide great service.", "Date": "May 19, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "London", "Title": "“An oasis of peace and calm”", "Author": "Litro_K", "ReviewID": "UR106883287", "Content": "What a lovely hotel! I had no idea a Best Western could be so nice and usually try to stay away from hotel chains when travelling for pleasure, but this one was fantastic. Clean, quiet, calm, and with perfectly pleasant staff who really made an effort to help without being overbearing. We stayed in a standard room overlooking the lovely oriental-style garden which was huge and furnished in a classic style. Bed was comfy, shower was great - and room had all the touches you'd expect of a four star, and more - including free soft drinks! I would definitely go back again.", "Date": "May 4, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Sleep Quality": "5", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Leigh-on Sea, United Kingdom", "Title": "“Great hotel”", "Author": "GraceyL0u", "ReviewID": "UR106207158", "Content": "Me and my partner have just returned from 3 nights in this hotel, which was lovely. It is of a nice modern design in the reception and bar, and our classic room we had booked was nice too, although not as modern. The room was quite small, but we only used it to sleep it and were out all day so this was fine for us. The staff were all very friendly and booked us a restaurant for the night after we arrived no trouble at all. I do have one bad point to say however only small, we had checked out and then as we were walking down the steps out of the hotel were called back as we had made a phone call we had forgotten about from our room, this was a local call that she said cost 30 cents, but insisted we had to pay it! So we had to put down all our luggage, walk back to the reception and find 30 cents in our bags to pay for the call. Sadly this left a bad impression for us, we had paid nearly 500 euros for 3 nights, so to insist we pay 30 cents seemed like bad service at the end there.", "Date": "April 30, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Athens, Greece", "Title": "“Marvellous hotel!! For sure the best place to stay in Paris!!!”", "Author": "Stavros_Sofia", "ReviewID": "UR105629532", "Content": "Me and my wife have stayed at regent's garden for 4 nights during easter vacation. In any case this hotel is a treasure. We loved our stay there by all means. Before our arrival we've booked a classic room, but we stayed there only for the first night. The classic room was beautiful and 100% clean, but we wanted some more space, so we asked to the reception for an upgrade. Of course, the staff helped us immediately and we've spent the rest three nights in the superior room!!! This was the greatest experience!!! Huge room, amazing decoration, confortable bed, relaxed atmosphere with garden view...!! The bathroom was huge as well and the cleanliness was impressive!! The location of the hotel is really good as you only need 5 minutes on foot to get to Arc de Triomphe and the metro station (Terner station) is at the same distance. Next to the hotel there was an excellent restaurant, while there are other brilliant choices for dinner and lunch in a really short distance. The staff were more than pleasant and helpful, while being always ready to serve our requirements!!! We both consider that we were so lucky choosing to stay at Regent's Garden, as we are 1000% satisfied and pleased!!!", "Date": "April 26, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Da Bronx", "Title": "“Great small Parisian hotel for family with teens”", "Author": "TheYanksWin", "ReviewID": "UR102312539", "Content": "Spent six nights here with two tough teenagers, who enjoyed the free soda and wifi and fairly convenient location (markets, stores, pastisseries, Metro only 10 min. away). Staff was wonderful and always helpful, rooms were large by EU standards and very clean and well-kept, neighborhood not touristy, rates reasonable. Highly-recommended.", "Date": "March 31, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Rome", "Title": "“Very good Hotel”", "Author": "Dudemon73", "ReviewID": "UR101090110", "Content": "We stayed at this hotel and everything was fine. Staff is really friendly and they are willing to help you for every need. Room was large enough to add a crib for my little daughter and everything was clean. We had complementary drinks in our minibar and free wi-fi connection is available. Just two remarks for people who are travelling with infants: * Elevator is very small, so it is pretty difficult to enter with a stroller; * Location is good, but could be better: you have to walk 10 / 15 minutes to arrive to Arc de Triomphe . A small Carrefour market and a very good boulangerie is placed in front of the Hotel. I would definitively recommend this Hotel.", "Date": "March 22, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Sydney, Australia", "Title": "“Excellent boutique hotel”", "Author": "skyeyed", "ReviewID": "UR98856030", "Content": "I have rarely experienced a hotel with such attention to detail at this price. Without doubt a strong 4 star property with excellent staff, comfort and location. Comfort - great bed, wifi in room (stable for our time) Clean & cozy. Staff - Always thoughtful and attentive but don't bother you Location - All convenience stores are within 1 minutes walk. The closest metro is 5 minutes. Final remarks - The hotel is small and boutique which is nice in Paris. If you like a detached experience often experienced in large hotels then this isn't for you. If it is for you, then, your decision is best made around which size room you desire. The standard room is small but adequate though you might go bigger if space is your issue. Other than that a great place to stay.", "Date": "March 4, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "sheffield", "Title": "“fantastic hotel,staf could not have been more helpful”", "Author": "briansheffield", "ReviewID": "UR97932132", "Content": "we have stayed in paris on a number of occaisions in the past so was really impressed by the quality of the hotel.The room was very clean with an impressive bathroom.Room service arrived with a glass of champers!the next day was my partners birthday and the reception staff helped me arrange transport etc for the evening as well as providing plenty of ice for our own bottle of champers.free drinks ...bottled water orange and coke in the fridge replaced every day. Overall a lovely hotel with friendly,helpful staff,,,a real gem and astep above others we have stayed in .", "Date": "February 25, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Glendale, CA", "Title": "“Great rooms in a charming hotel- lovely for business travel”", "Author": "kzally", "ReviewID": "UR95630218", "Content": "We had a superior room (103). Loved the historical building, and swanky lobby and room decor. For Paris standards, this room was very big and spacious. As a business traveler I loved the free wifi on room, free soft drinks in room with extra space in the fridge for my own goodies, and coffee kettle. Breakfast was 20€, I found out after the fact. It was good quality but definitely a rip off for my group that only went for the coffee and croissants. This area is great, you feel you are in the heart of Paris. The distance to the nearest metro stations was a tiny bit little longer than ideal, but not an issue for me personally.", "Date": "February 6, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Maidstone, United Kingdom", "Title": "“Welcoming, friendly and comfortable hotel offering all you could need for a weekend break in Paris!”", "Author": "DanandCate", "ReviewID": "UR89993104", "Content": "We stayed here on a Saturday night and were very impressed. We got an early morning Eurostar to Paris so arrived at the hotel around 11am in the morning. The receptionist was welcoming, arranged for our room to be prepared early and offered us a choice of any drink we wanted free of charge whilst we waited. The room itself, a Superior Room, was spacious (particularly by Parisian standards), clean, nicely decorated and furnished in a style befitting to the period of the property. There was a mini-bar in the room which just had soft drinks in it however these were all available free of charge and there were also tea and coffee making facilities and specialist coffee (at 1 euro each). Other items in the room were the standard toiletry items (flannel, soap, nail file, shower gel etc...) and dressing gowns. Anything we didn't have or was not provided was avilable free of charge at reception. The bed was comfortable so we had a good nights sleep and the breakfast, whilst it probably wouldn't win any prizes, was more than adequate with a good selection of cereals, pastries, bread, fresh fruit, yoghurt, cold meats, cheeses, eggs, sausages, coffee, tea and fruit juice. The service was attentive throughout our stay and they were more than happy to arrange for a taxi to take us to the Gare du Nord when we checked out. The hotels is set back from the road with a courtyard at the front making it more welcoming and it is housed in an attractive period property which makes it ideal for a romantic break. The only downside is that it is a little walk from the nearest metro station (Approx 5 to 10 mins at a steady pace) but still in a pretty good location for the Arc De Triomphe. One of the nicest things about the hotel is that despite being 4 star it was not pretentious which meant that we felt like we could relax during our stay. Overall we would definitely recommend this hotel to others who want a relaxing and romantic place to stay in the heart of Paris.", "Date": "December 16, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Las Vegas, Nevada", "Title": "“Great Location, Friendly staff, beautiful property.”", "Author": "LVonthemove", "ReviewID": "UR83336690", "Content": "This was a great little hotel in a great location near the Arc de Triomphe. The staff was very helpful and friendly, and the rooms , although on the small side, were beautifully decorated, spotlessly clean, and charming.", "Date": "October 13, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "3"}, "AuthorLocation": "West Bend, WI", "Title": "“Great Hotel, Great Staff, Ok Location”", "Author": "undjohn1", "ReviewID": "UR82784993", "Content": "We stayed here for 3 nights and had a great time. The staff spoke English very well and was very helpful. We had an updated room which was wonderful, the couple we traveled with did not have an updated room, so you may be unhappy with the room if you were looking for Paris charm or modern comforts and got the other. I thought the location was pretty good, it's about a 5 minute walk north of the Arc de Triomphe. The rest of the group thought we could have been in amongst the sites a little more. I liked the charm of the neighborhood though, there is a cheese shop about 100 yards from the hotel, a bakery right across the street, a grocery store about a 100 yards away and a great restaurant next door. So if you aren't interested in eating out for every meal you have options close by with which to get food and drink at better prices than restaurants. They also have free wifi.", "Date": "October 9, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Tel Aviv, Israel", "Title": "“Excellent Hotel Great Staff, Great Rooms, Great Location”", "Author": "IsraeliTourist", "ReviewID": "UR82609054", "Content": "I stayed in this great hotel from oct 3-8. The location is great - walking distance to tourist sites and the metro - one reader said 4-5 blocks, but there is a metro station closer if you cut through by a nice church and walk to Carnot Ave. The staff are very friendly and very helpful. Emanuelle, Philip, Sabine and everyone are all really nice and helpful. You really get SERVICE WITH A SMILE. There is a safe in the room but it is kind of small, so every morning I gave the staff my notebook computer -- \"my baby\" and they put her in the Hotel Safe - no problem and every time I need my notebook they gave it to me immediately. My room had a kettle and a brand new espresso machine. A very nice feature is you get for free everyday - 2 bottles of water, 1 sparkling water, one coke and one orange juice. This is free everyday - placed in the fridge that comes in the room. The rooms are big by paris standards and are very nicely decorated. The bathroom is big - a shower and bath tube. The rooms are EXTREMELY CLEAN and the cleaning staff are very polite and friendly Breakfast is really good - all kinds of bread, cheeses, cereal, yogurt, coffee, tea, meat, sausage, beans, eggs, FRESH SQUEEZED Orange juice - truly an excellent breakfast. There are great restaurants very close and the staff will recommend some based on what you want and your budget. There is a very good one right down the street - walk out hotel turn right and walk one block - forgot the name but excellent food The hotel also has a beautiful garden where you can eat breakfast or a snack or just sit and enjoy. There is one computer in the lobby free to use and you can also use it to print (also for free) This is really a great hotel - they do not nickel and dime you to death - Internet is free, the drinks I mentioned above are free and the nice coffee machines in the room are also a very nice and free touch Another nice touch is that you can have a continental breakfast in your room if you don't feel like going to a big full breakfast and they don't charge you for bringing the food to your room. I highly recommend this hotel - made my trip to Paris even more special.", "Date": "October 8, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "New York City, New York", "Title": "“Charming Hotel + Gracious Staff = Wonderful Find in the 17th Arr.”", "Author": "susu_in_nyc", "ReviewID": "UR79443667", "Content": "The Regent's Garden is a delightful gem of a hotel. The rooms are well appointed, which you'd expect from a four star hotel, and include air conditioning, wireless, heated towel racks and flat screen TVs. An added bonus are the complimentary beverages including water, juice and Coke stocked in the in-room fridge. As implied by the name, the hotel features a lovely garden with beautiful flowers and a fountain. It's the perfect spot for morning breakfast or an afternoon cocktail. This guest enjoyed the fact that there was wireless in the garden - I could work outside while enjoying a beautiful late summer day. A buffet breakfast is served daily and provides ample selections. However, for a quick bite I preferred walking across the street to Paul, a well-known boulangerie and patisserie. Rue Demours is lined with charming shops and a few restaurants. Around the corner are an outdoor market and a Carrefour. The availability of affordable food \"shops\" makes me think that the hotel would be ideal for families who may want to avoid the high cost of restaurant dining at every meal. The staff was helpful and accomodating. I was loaned a universal adaptor for my computer. assisted with dinner reservations, and met with a warm greeting all the time. I appreciated their personalized care and attention. The one drawback to the hotel's quiet and charming location might be the 10-12 minute walk to the Arc de Triomphe metro station.", "Date": "September 13, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Switzerland", "Title": "“Fantastic place”", "Author": "travelbern58", "ReviewID": "UR79049948", "Content": "We were staying 5 nights in the very nice hotel. very quiet, nice garden, everything perfect.", "Date": "September 10, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Sydney, Australia", "Title": "“Outstanding Hotel”", "Author": "df0810", "ReviewID": "UR78178812", "Content": "We decided on this hotel firstly on the excellent reviews, then the location. Arrived 10am at the hotel and not a problem as we were checked in straight away which was so good as we were able to catch up on some zzzzz to help with the jet lag. The room was spacious, very clean, free wi-fi, kettle, toilettries. Separate toilet, bathroom was clean with a fantastic shower. Large towels, crisp bedding and lots of wardrobe space. Location was excellent close to Metro and Arc de Triomphe and the Champs Elysees. (walking) The ladies on the front desk played an important part in making our experience in Paris so remarkable and unforgetable. Breakfast option is great. Choose from the express or the full continental where you can enjoy this in the beutiful garden setting, Highly recommend this hotel when staying in Paris !!!!!", "Date": "September 3, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "5", "Location": "4"}, "AuthorLocation": "southeast PA", "Title": "“The perfect place to feel like a local”", "Author": "sanmarc1", "ReviewID": "UR78061365", "Content": "My husband and I stayed here for 5 nights along with our teen daughter. Our daughter and her grandmother had stayed here last summer and loved it. We knew we wanted to stay here and fortunately they were able to accommodate a room for 3. It was very tight for 3 in the room, but it worked fine for us. The staff is very friendly and helpful no matter what time of day or night. The outside courtyard gardens are lovely and the perfect place for breakfast in the morning or a glass of wine in the evening. We often went across the street to the bakery, brought back croissants and had the hotel waiter provide coffee. Our room and bathroom were quite clean. The bathroom we had was a bit small and the shower was an interesting challenge since it only had a 10 inch partition to keep water inside the tub/shower area. The bathroom seemed to be newly renovated though and was very nice. My only real gripe was that the beds could have been more comfortable. The mattress left us with aches in the morning. We loved the architecture of this historic building - Napoleon's dentist resided here. We loved that we did not feel quite so touristy staying here. It seems to be more of a local's area there in the 17th district. There were many good restaurants within a short walk. The hotel is only a 10 minute walk at most to get to the Metro at the Arc de Triomphe. Metro line 1 and 6 are there and those two lines get you to most of the tourist spots that you desire. Next time we're in Paris, I see no reason to choose another hotel. This one is quite fine.", "Date": "September 2, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "London, United Kingdom", "Title": "“Excellent hotel with beautiful garden”", "Author": "Tamara07", "ReviewID": "UR75475008", "Content": "We stayed in this hotel in April after reading all the reviews. The rooms are amazing, service is excellent, free coffee and tea, bathrobes. At the back of the hotel there is a wonderful garden where you can sit and enjoy your drink or food. There are plenty cafes and restaurant around. Also the location is so good, you can walk in the evening and watch life. I would stay there again.", "Date": "August 16, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "London, United Kingdom", "Title": "“An exceptional hotel”", "Author": "alisoncraig17", "ReviewID": "UR72075480", "Content": "Sitting in the garden of this hotel on a hot summer's evening with a glass of Chablis was a delight. My room wasn't huge but very well designed and attractively decorated and the bathroom super. These things alone made it a very good hotel; the charming staff made it exceptional.", "Date": "July 23, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "3", "Sleep Quality": "5", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Port Washington, New York", "Title": "“Very Nice BUT”", "Author": "Busterkitty", "ReviewID": "UR71372730", "Content": "The Pro's first. The hotel is very clean, the beds are great, the Suite was decorated beautifully and the staff was really very kind. Con's The entire hotel is really much smaller than the photo's represent, the suite while handsome was small compaired to others we've stayed in, for less. While it does have a TV and sound DVD system they are not connected to each other, so we were not able to see DVD's, hear the radio, or play music, but there is a good system,if it worked. The so called coffee and tea bar is a pot to boil water with instant coffee provided, that/s it. nothing else.. What makes it a suite is a wall in the middle of the room, the AC needs to be on full blast so the bed area temp. becomes comfortable because there is not air vent in the bed area. AS far as parking they have 8 spots for 38 rooms and it costs 20 euro per day, it has a very small gate and the spots are very small if you have anything else then a compact it's a hassel to get in or out. The hotel is NOT AC'd so lobby, bar and reading room is hot, they do not open windows or doors, and all the public spaces are very small if you have more than 5 people in the room it's crowded.. The toilet is in a closet as you walk into the room, not with the shower and bath tub, which is a big room. The hotel charges 19 E and it is like the free breakfests in every hoel in Italy. While we did have a nice stay if you want a large room and a large hotel this is not it. The bar has 2 bottles of water, a bottle of juice and 1 coke, thats free, everything else has a charge.The staff helped make our stay enjoyable.", "Date": "July 18, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Southern England", "Title": "“Great place to stay - we enjoyed it very much”", "Author": "UKrover", "ReviewID": "UR71107781", "Content": "After some of the pretty lukewarm reviews that others have made, I have to disagree with them. This is a very inviting hotel, with friendly and helpful staff, well furnished and rooms that exceed the average paris hotel in size. It is also a great spot for reaching many of the main attractions being a short walk to the Arc de Triomphe, Champs Elysee etc. Transport links are good with buses, metro etc being within walking distance. There are also a good number of eating places within half a mile, at all sorts of prices. We most liked the little cafe just opposite the end of the road where the food was very good, and where the locals ate. The buffet breakfast which many people speak about in these reviews is 19F but is superb, lots of choice and if you want to, you can fill up and save on lunch! Eating it in the beautiful garden is the icing on the cake. In short, we were very pleased we chose this hotel and would go there again", "Date": "July 16, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "England", "Title": "“Excellent, 10/10, fabulous hotel”", "Author": "samblackdog", "ReviewID": "UR66231964", "Content": "I chose this hotel firstly on the excellent reviews on this page, then the location, and we were not disappointed. I went with my mum for 3 days, we had a twin room which was amazing. We did book a classic room but were upgraded to a deluxe room, we are not sure why but did not complain! The room was spacious, very clean and had lovely extras like a coffee machine, ipod docking station, free wi-fi, kettle, toilettries. Bathroom was clean with a large bath and powerful shower. Lovely fluffy towels, crisp bedding and lots of wardrobe space. Was a lovely room to come back to after a hard days touring Paris. Location was excellent, as everyone has said close to Metro and Arc D'T. We travelled on the eurostar from Gare du Nord and caught the public bus from the end of the road which was so easy and cost very little, drops you off right at the door and only a 2 min walk from the hotel - perfect for us ladies with large bags. On the way to the hotel from the station we did the Metro, but for the return journey the bus was so much easier and nicer. Our only negative comment would be the breakfast, it was expensive and we chose (rather cheekily!) to buy some lovely crossiants for the pattisere directly opposite the hotel (on the same road) and had them in our room! The pattisere were closed Monday morning as was the supermarket also opposite the hotel. The Carefour supermarket, a stones throw from the hotel was very handy indeed. Oh and the hotel provide free soft drinks which are replenished each day in the fridge. The staff were very friendly and helpful. There is a computer with internet located in the lobby whichis free to use. We booked our Eiffel Tower tickets the night before to avoid queing. I would highly recommend this hotel and if I ever get to go back to Paris I know which hotel I will be booking!! I hope I have done this hotel justice!", "Date": "June 2, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Daly City, California", "Title": "“A very charming European hotel.”", "Author": "061010f", "ReviewID": "UR64889907", "Content": "I love this hotel. Recently renovated, the guestroom has very European interior and furnishings, spacious and very clean. The bathroom has a towel drying rack (?), first time I've seen in a hotel and we're not even in a superior suite. 5 mins. walk from the hotel, you will find a train station by Arc d' Triomphe. Also nearby are good restaurants, bars and shops. Richard (Night Auditor), was very accommodating and gracious. Thanks for the warm welcome Richard. :D If you need airport transportations, you can book it thru the front desk for a cheap price of 15 Euros (for 2 people) in oppose to a cab that will cost you 50 Euros depending on the meter. This will be a van you will share with 6 others. Breakfast if not included in the room rate is 20 Euros per person. This is the only turn off since it is not much of a buffet, very limited choices for the price. Oops, one more thing, wi-fi is free. :D", "Date": "May 21, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Gloucester", "Title": "“Fantastic hotel, friendly service”", "Author": "AlexGlos", "ReviewID": "UR64795878", "Content": "My wife and I stayed for two nights in May. The hotel was lovely, really clean and well presented. The staff on reception were friendly and welcoming. The position of the hotel is good, a 10 minute or so walk to the Arc De Triomphe and Champs-Elysees. Getting there from the CDG airport is simple - just catch the RER line B and change at Gard De Nord for the Metro from La Chapelle. Take the Metro to Charles De Gaulle Etoile. It takes about 1 hour. There are loads of cafes and restaurants around the hotel. Alternatively, head for the Champs-Elysees in the evening for a bite to eat. The breakfast in the hotel should be avoided however - it's nice but not worth the 19euros price tag per person. You can get something much better value nearby in one of the cafes. There is a red bus tour company that does a tour of the sights. The stop is right by the Arc De Triomphe and runs regularly. Quite a good way to see things, and you can jump on and off as you please.", "Date": "May 20, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "London, United Kingdom", "Title": "“fantastic stay, lovely hotel”", "Author": "KimT1981", "ReviewID": "UR64376491", "Content": "chose this hotel mainly for the reviews and price. was not disappointed. staff were all friendly and the room was exactly what we were looking for - something that didn't have a huge corporate feel to it but had the 4* luxury not always found in boutiques. was about a 10 min walk from the Arc de Triomphe and easy access on the Metro. spoilt for choice with restaurants. there wasn't a reataurant in the hotel but not a prblem with so many nearby. we mentioned we were on our honeymoon and was upgraded from room only to bed and breakfast free of charge. would definitely stay again", "Date": "May 17, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Southampton", "Title": "“Excellent hotel, friendly staff”", "Author": "Paris1959", "ReviewID": "UR60224227", "Content": "Went to Paris for our 25th Wedding Anniversary and flew in to CDG, where we caught the Air France shuttle bus to the Arc de Triomphe, which took about an hour. We then had about a 10 min walk to the hotel, where we received a very warm welcome and were given a tour of the hotel. As requested on the website we had a room overlooking the lovely garden at the back of the hotel away from the road, although this was just a side street anyway and was not busy, there was a good convenience store on the corner of the street that closed at 10pm The room was excellent, very nicely decorated in a traditional style, tasteful furniture, clean, everything we needed for a relaxing stay. The bathroom was very spacious and clean, with a shower over the bath. We had a coffee machine and free soft drinks in the minibar, MPS docking station and TV, the room also had stacks of storage which including a safe. The hotel had a small bar area and doors onto the garden, which would be a great place for a quiet drink in the summer. The breakfast room was also very well decorated in a similar style to the bedrooms, the breakfast is buffet style with hot and continental (best scrambled egg I have ever had !) Staff were extremely friendly and could not be more helpful, particularly Sabine who often encouraged us to try out some school boy French. The Hotel is in great location, a walk to the end of the road brought you onto a main street with various restaurant/bars and less than a 10 min stroll and you were on the Champs-Élysées. To sum up we would definitely return to the hotel when next visiting Paris, everything about it made our stay very special.", "Date": "April 3, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "London", "Title": "“Absolutely perfect romantic stay in Paris”", "Author": "aneldebruyn", "ReviewID": "UR58609404", "Content": "I booked this hotel for a romantic trip to Paris to propose to my girlfriend, based on the excellent reviews on Trip Advisor, and the great deal I managed to find on Expedia, after some days of research. I was worried at first, because my initial emails to the hotel, asking about breakfast and a room with a garden view went unanswered. Subsequent emails were answered very cordially, and I suspect I was dealing with two different receptionists (one who was very friendly and willing to help, and the other who didn't really care). Luckily we were greeted by the one who did care, because we were shown around the hotel personally, and our room was available well before check-in time, which was a god-send. The room was amazing, tastefully decorated, clean, larger than anything else I had paid the same amount of money for previously, and with the garden view, absolutely perfect, quiet and secluded. The bed was comfortable beyond measure and the bathroom absolutely exquisite. The room has an espresso machine (unfortunately the hotel provides only two coffee pods, delicious as they were) and everything in the mini-bar is free! The hotel is a 5 minute walk from the Arc de Triomph (and the metro), as advertised, down a main street, in a wonderful location, with supermarkets and other little shops close by. Apart from the one receptionist, the staff were charming, spoke English and were proud of their hotel, which makes all the difference. The value for money is incredible and the experience I was able to give my now fiancee was simply perfect.", "Date": "March 15, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Antwerp", "Title": "“A time to remember”", "Author": "Trip2Paris2", "ReviewID": "UR56162261", "Content": "excellent location, friendly staff, nice and clean room, nice breakfast and a safe parkingspace just in front of the hotel and this all in the hart of Paris!!!", "Date": "February 16, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Parma, Italy", "Title": "“la vie en rose!”", "Author": "cinqueterreinsider", "ReviewID": "UR53510146", "Content": "I stayed 3 nights in this hotel during christmas 2009. paris is fantastic and this hotel is a plus. at 2 minutes walking from Arc du Triomphe and the Champs Elysee this hotel has everything you need to have for a pleasant stay.: beautifullt decorated room, well accessorized bathroom and all facilities (included free minibar). we did not take breakfast but stopped each morning in the brasserie in front of (very very good!). we will be back!", "Date": "January 15, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "dublin ireland", "Title": "“Excellent small and quiet hotel, very comfortable with courteous staff”", "Author": "cailinailin", "ReviewID": "UR48250881", "Content": "We stayed for three nights late October. Very close to l'Arc de Triomphe. Our room was smallish but beautifully decorated with an extremely large and comfortable bed. Bathroom large with shower in bath but proper glass shower screen. Everything was clean, clean, clean. This is a small hotel - our rooms overlooked the inner courtyard (where you can have breakfast in warm weather) and so was very quiet at night. The staff were so courteous and helpful - they made our stay a pleasure. We didn't have breakfast as felt it was too expensive, but there are lots of small patisseries on this street where you can sit and eat for about Euro5-8. The Ternes Market is literally around the corner where you can buy bread, cold meats, cheese and fruit - for a lunch later in one of the many Paris parks and gardens. Recommend the Restaurant de la Campagne down the street - small menu but everything delicious. There is parking available this hotel just outside the door, which was a great bonus. Would absolutely recommend this hotel to anybody.", "Date": "November 1, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "4", "Rooms": "4"}, "AuthorLocation": "Longford, Ireland", "Title": "“Excellent service, really friendly and helpful staff, luxurious and beautifully presented rooms”", "Author": "Caold39", "ReviewID": "UR47310513", "Content": "Service was excellent, all staff very smartly presented, very friendly and proud of their hotel. Great breakfast including hot and cold buffet. We stayed in a standard room which was small but very comfortable with a lovely blend of classical and contemporary furnishings and fittings. Bathrobes, tea and coffee making facilities in room and free soft drinks in minibar (replenished every day) a really nice touch. We flew in from Beauvais airport and hotel is only a 5 minute walk from Pershing car park where bus drops off and collects for airport run. Its about a 10 minute walk to nearest metro at the Arc de Triomphe. There is no restaurant but hotel does have room service which we thought was a bit pricey but there are plenty of restaurants nearby. We would definitely go back.", "Date": "October 20, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Location": "3", "Rooms": "4"}, "AuthorLocation": "london", "Title": "“A bit too far from the metro, but great staff and room”", "Author": "eatlive", "ReviewID": "UR47226054", "Content": "The hotel was not close enough to the metro station as I would have liked, but rooms were great and staff ( specially Emmanuelle) was charming and helped with reservations and directions without any sign of being bothered too much.", "Date": "October 19, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "4", "Rooms": "5"}, "AuthorLocation": "Sugar Land, Texas", "Title": "“Truly a Garden”", "Author": "PixalMaster", "ReviewID": "UR46559203", "Content": "I found the hotel in the magazine National Geographic Traveler, then booked online. I was not disappointed. I called a couple of times prior to leaving on the trip and the reservations person was more than helpful. She was even, honestly, pleased that we were staying there. Upon arrival the staff met us at the entrance and while my wife and I were filling out the appropriate paper work they took our luggage to our room. Quaint and elegant describes this Best Western's property. A beautiful sitting room is in close proximity to the reception area where you can relax in the afternoon after touring classic Paris. I rate an establishment on two things. Cleanliness and staff. Both are 5 star. Emanuele, Maria and all the other fine folks made us feel like family. They were tolerant of our halted high school French and worked extra hard to practice their English (especially Maria). During our four day stay we all became good friends. The hotel is located in the \"high rent\" district with several fine restaurants within walking distance. The metro is at the Etoile and is a bit of a walk but great little side walk cafes can be used as way stops. We had a grand time and when we return to Paris will definitely book with the Regent's Garden. A plus", "Date": "October 11, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Harrison", "Title": "“Wonderful Hotel”", "Author": "jas_aus", "ReviewID": "UR45074977", "Content": "We really enjoyed our stay at this hotel. It was our first time in Paris and I was expecting a teeny tiny room for the price we had paid (ranging from $280-$340 AUD a night) based on what I had read in other reviews about Paris hotels generally. However the room was spacious enough and the bathroom had a very genourous shower. The location is great (close to the Arc de Triomphe) and has a wonderful patisserie directly opposite (highly recommend the quiche!!) and a supermarket. At the time of our stay there was also free wi-fi and mini bar (soft drinks only, refilled daily) which was a nice touch. Re parking, there are only 8 spots available in total which can't be reserved, so if you are driving it might be worth checking in earlier in the day, rather than later (parking was 20 euros a night). Otherwise, there was a public carpark up the road.", "Date": "September 27, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Location": "4", "Rooms": "5"}, "AuthorLocation": "Brazil", "Title": "“A wise choice for your next honeymoon (even with the current wife)”", "Author": "weddingtripBrazil", "ReviewID": "UR43800539", "Content": "The hotel is located at a 10 minute walk from the Arc du Triomphe in a cozy Paris region. I stayed there for a week with my wife. The location allowed us an easy access to all Paris attractions. The room is spacious and well-kept. Furniture is new and clean, and the bathroom is excellent. The staff are very friendly and courteous. I paid EU 230 per night, which is not cheap,but considering that Paris is not a cheap city, I found that this hotel is excellent value for money.", "Date": "September 23, 2009"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "Louisville, KY", "Title": "“The best hotel in Paris”", "Author": "brownwren", "ReviewID": "UR43462006", "Content": "My husband and I stayed here in August, and I can't say enough good things about this hotel! The staff was very friendly and helpful (for example, found us a doctor when most are out of town) and the service was excellent. They spoke excellent English but encouraged us to speak French--and were very tolerant of our mistakes! The hotel is charming! It was converted from a mansion (a gift from Napoleon III to his doctor) to a tasteful, intimate hotel and has been recently remodeled. Our spacious room overlooked the garden and had a large modern bathroom. The bed was large and very comfortable with superior linens. Breakfast in the lovely private garden was one of the delights of our stay! The hotel is near a Metro station and the Arc de Triomphe, with many restaurants and shops nearby. A bakery and market are right across the street, pharmacy on the corner, post office three blocks away. The area is residential/small business, so we were not surrounded by other tourists. We wouldn't stay anywhere else in Paris and hope to visit with our friends at Regent's Garden again soon!", "Date": "September 21, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "4", "Rooms": "5"}, "AuthorLocation": "Boston", "Title": "“A charming hotel with impeccable service”", "Author": "LMN8993", "ReviewID": "UR39080942", "Content": "My husband and I stayed at the Regents Garden in Paris for the first 4 days of our honeymoon. Upon arrival, we were upgraded to a lovely suite. We had arrived early due to the overnight flight and were completely exhausted. Incredibly, they had our room ready for us at 10am. Our entire stay was lovely. A full buffet breakfast was offered in the dining room, but generally eaten outside in the beautiful courtyard behind the hotel. The concierge was excellent, kindly helping and encouraging me with my fumbling French, though always ready with the English words when my French failed me. Our room was beautiful--a bedroom with a comfortable king-size bed with an adjoining sitting room. The bathroom was also quite nice and included a large, soaking tub and a glassed-in shower. Overall, a wonderful stay in a charming hotel. We can't wait to return!", "Date": "August 28, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Slovenia", "Title": "“Everything you need”", "Author": "giva21", "ReviewID": "UR37407477", "Content": "This is a lovely hotel, located very near the city centre (Arc de triomphe). The rooms are not exactly spacious, but were big enough for our needs. They were clean with modern furniture. I really liked the bathrooms and the fact, that the beds had duvets instead of sheets and blankets (I really hate those since the blankets are usually very unclean). The staff were nice with positive attitude. We also got complimentary drinks in our minibar. I think we could not have stayed in a better hotel regarding the price and what we got for it, so I would recommend this hotel to anyone.", "Date": "August 11, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Belfast, United Kingdom", "Title": "“The best place to stay in Paris”", "Author": "Pauline_1", "ReviewID": "UR37146176", "Content": "My husband and I stayed here at the end of July for 4 nights, we were celebrating our 1st wedding anniversary. The hotel is located near the Arc de Triomphe and is within walking distance to most sights - we walked everywhere. Our room was gorgeous - bold decoration and a modern bathroom, it was also quiet big for Paris. The bed was very comfy and the shower was great. Our room overlooked the courtyard, we had massive windows which opened right back allowing us to enjoy the sun shine in our room. It was really nice in the morning to sit by the open windows and have breakfast. The courtyard is a great asset to the hotel, its not often you find a hotel in central Paris with such a lovely garden to relax in. The staff were great and very helpful with directions and contacting attractions on our behalf to check opening times etc. My husband had arranged for champagne and chocolates to be waiting for us on arrival. The hotel staff went and got me Jeff de Bruges chocolates - they were delicious and a bottle of Laurent Perrier champagne - Yum! They also gave us a card congratulating us on our 1st anniversary - it was a lovely welcome! There is a supermarket across the street from the hotel and a great bakery. We had delicious fresh croissants for breakfast every morning. The is a bar next door to the hotel, which was always busy with locals, it had a nice atmosphere - it also serves food although we didnt eat here. This hotel is fabulous and when we return to Paris this is without a doubt were we will stay. Its unbeatable!", "Date": "August 9, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "London England", "Title": "“Great hotel, great location and great hotel staff!”", "Author": "DChouhan", "ReviewID": "UR37133536", "Content": "This is a great hotel in a quiet location and yet is still within 10 minutes walking distance from Tearne Metro station and 15 minute walk from Champs Elysees. Many eateries to choose from and a useful supermarket close by. We had a spacious Superior room with amazing decor, great shower/bathroom and mini fridge with complimentary drinks provided (topped up daily!). Hotel staff were fantastic especially Emmanuelle, spoke English and were all extremely welcoming. Luggage service provided was very useful with our timings of the Eurostar. This is a great hotel and would definitely book again.", "Date": "August 9, 2009"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "california", "Title": "“Awsome Staff”", "Author": "hjbj", "ReviewID": "UR37020978", "Content": "Picture this...rolling in to Paris at 5pm on Friday, stressed out, with the rental car on fumes and overdue to be dropped off, but where? Found the hotel with the GPS and the lady managing the desk knew immediately something was going on. We explained we situation and she called the rental company, got an extension and gave us directions to the closest place as the GPS might not explain all the recent detours because of the Tour d France taking place & construction going on. Got there in the nick of time and saved another days rental charges and upon returning to the hotel our bags were in the room and our large bike boxes safely stored in a locked closet. Nice first impression!", "Date": "August 7, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Location": "4", "Rooms": "3"}, "AuthorLocation": "Dallas, TX", "Title": "“Beautiful Parisian Hotel”", "Author": "KayakChick72", "ReviewID": "UR36735682", "Content": "If you want to stay in a traditional Parisian hotel, this is it! Very old but well-kept. Decor is nice, not quite my taste but they did lots of upgrades to make it comfortable. Room is small and bathroom is smaller. The room is big enough for a queen-size bed, the flat screen TV, and an closet/armoire. The closet fit all of our clothes. The first day we arrived, we were tired from jet-lag so we opened the windows (w/o screens of course) and took a nap. The breeze felt awesome! Not much room to walk around in the room. The shower that was greatness too, a walk-in shower, my husband loved it. But for the ladies, not much counterspace. Really cant fit two people but upgraded nice. One of the best things about the hotel was the free WiFi! We each have an iPhone and we could get email/internet easily. It is quite a walk to the train but we enjoyed it because of the good weather and we love to look at all of the buildings. It is in a great part of Paris. No worries about crime or feeling uncomfortable but that is most of Paris anyway! Could not really find too many good restaurants nearby. The bakery across the street was good but it was closed on the morning that we left, not sure why. And we left on a Tuesday. Maybe they were gone for their summer holiday. Didnt like the hotel breakfast very well plus that was expensive. However, they did supply you with a free minibar, how awesome is that! Staff was also helpful and very nice. We stayed here for four nights and would definitely consider staying here again!", "Date": "August 4, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Prestwick, United Kingdom", "Title": "“Fantastic staff, lovely hotel, quiet and respectable area”", "Author": "queenmalice", "ReviewID": "UR35384381", "Content": "Loved this hotel with their highly trained, smiling, helpful staff; receptionists rose from their chair to greet us each time we passed them (who does that nowadays), and waiting staff couldn't have been more caring. For us, front of house staff can make or break a holiday - this helped make ours. If the staff could help, they did and nothing was too much bother for them. The hotel has a wonderful wee garden in which to dine and even a wood pigeon was finding the hotel so good that she was building a nest in one of their trees. Decor is snazzy! Room 305 was spotless, spacious and our lovely comfortable bed had a duvet. We also had a in-room free safe, free soft drinks, white bathrobes etc, sewing kit etc, free daily newspaper. We had an express breakfast one day which was fine because we were in a hurry. The day we left we had a full buffet breakfast which had everything we wanted, cold meats, cheeses, eggs, sausage, yoghurts, fresh and dried fruit, nuts, jams, honey, cereals, croissants, brioches, selection of breads, juices... everything! We liked the area because it was near the Arc de Triomphe and has a few little nice shops and restaurants nearby, but we liked the hotel and its staff even more.", "Date": "July 21, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Location": "4", "Rooms": "4"}, "AuthorLocation": "Scotland", "Title": "“Excellent standard of service and accommodation”", "Author": "AdoScotland", "ReviewID": "UR35003815", "Content": "The standard of the classic room was excellent: well-decorated, spatious, exceptionally clean and with extras such as complimentary soft drinks, hairdryer, bath robe and toiletries. Staff were very friendly and helpful. Breakfast is fairly expensive but high quality. The internet price for accommodation is reasonable for the standard of room and location of hotel. It is only five minutes walk from the Arc de Triomphe. I would recommend this hotel equally for business or pleasure and plan to use it again in future.", "Date": "July 17, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "4"}, "AuthorLocation": "New York", "Title": "“A jewel of a hotel”", "Author": "WeL0veT0Travel7", "ReviewID": "UR34403100", "Content": "We stayed at this exquisite hotel for 7 nights and would recommend it without hesitation. The staff was courteous, knowledgeable and quite helpful. This a boutique hotel located close to the main sights, but in a neighborhood setting with a pastry shop and market right across the street. The hotel was renovated recently so everything is pristine, and sparkling clean. The color palette is in rich deep tones and the materials used are exceptional. Our room was a little small, but overlooked the garden, which was lovely. Also, the elevator was only big enough for 2-3 people, but we walked up the stairs to our first floor room Our favorite restaurant was Maison de Campagne at 18 bis, rue Pierre Demours - just around the corner. We took the Metro everywhere (just 4 blocks away). Our stay here was perfect!", "Date": "July 10, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Business service (e.g., internet access)": "5", "Check in / front desk": "4", "Overall": "4.0", "Value": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "SECUNDERABAD, AP, INDIA", "Title": "“Nice and Quite Hotel close the Local Rail Station”", "Author": "SRIRAM_05", "ReviewID": "UR31155460", "Content": "WE had a very pleasant stay at the hotel with the front desk personnel being quite friendly and helping us out with the Maps et al. Very friendly people. Both me and my wife eally had a good time with the staff. The location too was pretty good being very close to the Arc-de-Triumph and the local station. It is just a 5-10 min walk to both these locations. Also proximity to a convenient Store was an added advantage. The service too was quite decent. The biggest bonus was free Internet Usage at the business center located just adjacent to the front-desk. The only discomforture was the size of the elevator in which not more than 3-4 normal sized adults could fit in comfortable. We used the stairs most of the time and they too were quite narrow and serpentine in nature. One Cavet For new comers/first time tourists to the city, the location of this hotel might be a bit confusing as it is not visitble from the local station. One has to enquire about this hotel at nearby shops or diners to get there. As this was our only 2nd visit to Paris and coming straight from India we did find it difficult to initially locate the hotel after alighting from the station. But once we reached there, we could easily navigate ourselves well with the use of maps.", "Date": "May 30, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "3", "Location": "2", "Rooms": "3"}, "AuthorLocation": "san diego", "Title": "“Paris location of this property is not ideal, but it has a great garden!”", "Author": "kokosandiego", "ReviewID": "UR31051845", "Content": "We stayed here for four nights and although we were not disappointed, I would not stay here again. It is definitely out of the way, in the 17th...and the subway is a walk of about 5-6 blocks in either direction, which at night is not great. Personnel are great! Very, very helpful and accommodating to a degree. The rooms are very small, great beds, color scheme/design was not my taste but did look recently redone and baths were modern, although very small, ours was anyway. We did have a garden room which I would say is a must, but garden can only be used in nice weather and you are not allowed to take your own food/drink there which was a disappointment. There are no comfortable sitting areas, lobby is uncomfortable and only for looks..never saw anyone sitting there...bar should be made into a lovely sitting room with couches and lamps..never saw anyone in the bar. Breakfast is too expensive...18 euro pp...we never ate there...and breakfast room was not particularly inviting. Carpets in hallways need to be redone...the district is mainly businesses..not great walking, although we ate in a terrific restaurant not too far away, \"Hier et Aujourd'hui\"..was great food and cute place.", "Date": "May 28, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "San Francisco", "Title": "“Wonderful, just simply Wonderful!!!”", "Author": "SFtraveler022", "ReviewID": "UR30459564", "Content": "We would recomend this beautiful hotel without any doubts in our mind. We stayed in 2 different rooms during our 5 nights stay in this hotel.Each of this rooms is beautifully designed with such a great taste!!! The colors are so cheering! The curtains are the joy to your eyes.The beds are very comfortable. Everything is so clean. The moment you enter the room you feel like you left the worries of the world behind you. Even such little things as several bottles of water in the refrigerator makes you feel that somebody was thinking about your conveniences. You can make your own tea or coffee, the supplies are there in the room. The windows are very clean. The ceilings are high and beautiful. There is a huge mirror in the classic room. The bathrooms are designed very thoughtfully for the needs of everybody. There is a magnifying mirror for the women to apply their make-up. The towels are so soft and are kept warm.The staff is super friendly and they speak English.If you choose to eat breakfast there you are not going to make a mistake. There is no room here to describe how delicius everything is: cheeses, bread, meats, juices, coffees, jams; it's cute how you can make your own eggs; and the setting..Wow!..and the polite staff..Wow! There is a little garden outside, very cosy one. The furniture in the lobby and the adjusting areas is very beautiful, in French style.You can have an umbrella if you did not bring one with you. There are fresh newspapers every morning. Internet connection there is and so on so forth... Thank you to all the people working there ( including Sofia, Emanuella, Bijan and the others) for your wonderful service! These people give you all practical advises necessary when you are traveling the first time in the foreign country. Taxi, wake-up calls, etc.,you can rely on the staff. They are not only knowledgeable, but also very smiling and polite.", "Date": "May 21, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Location": "3", "Rooms": "5"}, "AuthorLocation": "Gravelines, France", "Title": "“beautiful hotel large rooms but a bit of a walk from the tube”", "Author": "GodisGoood", "ReviewID": "UR29910067", "Content": "great hotel. pastry shop across the street. places to eat near by. but if i were with a family its a bit of a walk from the metro. i would not stay here again due to the location. but the beds, staff, wifi was great. if u do book go directly to the bestwesternwebsite. we paid much less using them directly", "Date": "May 13, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "3", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Indianapolis", "Title": "“Great location and wonderful personal service”", "Author": "bizie2", "ReviewID": "UR29177929", "Content": "We stayed here five days and loved it. The hotel is newly refurbished...(we stayed here 10 years ago) and very chic. The staff was the best part. They were wonderful (Etienne and Sabine especially) helping with dinner reservations by email prior to our arrival but available for our every need. The rooms were spotless and very comfortable with comfortors and minibars in the rooms. (good place to cool your own drinks) Internet wireless was available and a computer for guest use in lobby. The breakfast is very grand!! (cereals/sausages (cooked/cold sliced), eggs scrambled/boiled, cheeses, breads: croissants, rolls, fruit cut and whole) but expensive so we just walked across the street to a wonderful bakery that opens at 6am. Most bakeries even have cute individual size pizza now for the guys. I had the pain au chocolate everyday. Beware- most French bakeries are closed on Mondays. There is a grocery for other needs on the corner and the hotel is close to Terns Metro, Arc Triumph Metro as well as the Convention center. Thus it was easy walking distance for a meetings. The rooms on the garden side are the best as street noise can be a problem some nights (Thurs has live jazz in bar next door). Our favorite restaurant was very very reasonable great food and only a block away: La Casa de Sergio. Busy nightly so arrive early before 8:15pm. We would stay here again. Great Location. If you have a car as we did. Arrive by 10-11 am when others are checking out. Parking is tight, with 6 inches between cars (standard for Paris) and only 8 spaces. Do not bring a minivan...:)", "Date": "May 2, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "4", "Rooms": "5"}, "AuthorLocation": "eastbourne", "Title": "“The hotel, and its staff, met with all my hopes and more.”", "Author": "voyager27nov", "ReviewID": "UR28065780", "Content": "The hotel is well situated - close to metro stations and some main attractions. The staff are very welcoming and helpful even before arrival. The room we had was perfect and all the little accessories lovely. My sister had a superb 60th birthday - thank you!", "Date": "April 15, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Scotland", "Title": "“Great hotel, fantastic location, great room.”", "Author": "TravellingJ81", "ReviewID": "UR27840230", "Content": "We booked this hotel after reading reviews on Trip Advisor and were still surprised at how fantastic the hotel was. We stayed in a classic room, it was stylish, had everything we required, had windows which opened over the garden and the bathroom was fantastic. We did not eat at the hotel but there is a bakery opposite and a supermarket at the corner. The location was perfect, just a short stroll (around 10 minute, maybe less) to the Arc de Triomphe. We would definately stay again.", "Date": "April 12, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Location": "4", "Rooms": "5"}, "AuthorLocation": "athens", "Title": "“excellent stay”", "Author": "eos4os", "ReviewID": "UR27508362", "Content": "everything was fine........room was big.....very clean.....big bathroom...the brekfast was little poor and expensive but there was a bakery accross the street", "Date": "April 6, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Dublin", "Title": "“Little Gem”", "Author": "DublinCoopers", "ReviewID": "UR26822925", "Content": "Stayed in this hotel for 3 nights. We went for a superior room with garden view. The room was lovely and spacious with a big bathroom. Couldn't fault the room. The hotel is handy to the arc the triomphe and the metro (charles de gaulle etoille). Had a great couple of days. Highly recommend the pattiserie accross the road. I would not go for the breakfast as it is overpriced at 19 euro a head. But have to say that is the only downside.Would definetley stay here again. We flew to Beauvais and the hotel is only a few minutes walk from where the bus drops you off, very handy.", "Date": "March 25, 2009"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "Sacramento, CA", "Title": "“A perfect stay, can't wait to go back!”", "Author": "cntrystar8", "ReviewID": "UR26213261", "Content": "I stayed at the BW Regent's Garden for 3 nights vacation in January 2009, extended from a business trip. I absolutely love this hotel, I rank it in my top 5 ever. The location is perfect, decor is beautiful, the amenities unbeatable and the price was fine. The staff was so nice and accomodating, like staying in a prestigious B&B. I stayed on the third (top) floor in a Premier room. I paid 189 euro for Thrs night, 169 euro for Friday and Saturday night. The fridge is stocked with juice, water and soda that are complimentary(!), which made it nice each morning to just grab a drink and trek out in Paris. The bathroom was luxurious with marble, bathrobes, towel warmer, etc. They have a computer to use, I sat and uploaded photos each night and Facebooked. Their breakfast (extra charge) looked really good, but I didn't have it because I'm not a sit-down breakfast person. Instead, I went just across from the hotel, the Desgranges Boulanger-Patisserie....absolutely incredible bread, pastries and treats!!! It's just a few minute walk from the Arc D'triomphe, it took me ~15 mins to walk to the Lourve, including window shopping time on the Champs de Illyses. They are also near several BNP banks, which was perfect because Bank of America doesn't charge you for using BNP ATMs, so you can take small cash out worry-free! I absolutely cannot wait to return to Paris and stay at this hotel. Dinner Tips: We ate next door at Clair something for yummy hamburgers; for an early 6pm dinner go to La Eccluse close-by which is very very nice and pretty reasonable on price.", "Date": "March 15, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Berkshire", "Title": "“Classy little hotel”", "Author": "DarcyBerkshire", "ReviewID": "UR26098333", "Content": "Stayed here for 3 nights with my daughter. The hotel was vey clean and the rooms and en suite bathrooms were excellent. Nothing was too much trouble for the staff , who were most polite and very accomodating.The hotel is very near The Arc de Triomphe, so the location is vey good and we felt completely safe there.We did not eat at the hotel because the exchange rate made it very pricey, however there are a number of good boulangeries nearby and an excellent French Restaurant on the same street We would thoroughly recommend this hotel and look forward to returning..", "Date": "March 13, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Location": "4", "Rooms": "4"}, "AuthorLocation": "London, United Kingdom", "Title": "“Great Affordable Hotel in Paris”", "Author": "LV23", "ReviewID": "UR25851477", "Content": "I am a huge fan of the Best Western hotels in Europe. This one in Paris is in the 17er but very close to the Arc and the Champs Elysees. We walked almost everywhere, but you could easily take the metro as well. The hotel is situated in a calmer area than other hotels where I have stayed in Paris, which was nice. You are able to get a different feel for the city being in this location. We also found fabulous shops and restaurants in the area, which are not typically visited by tourists.", "Date": "March 9, 2009"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "LISBON, PORTUGAL", "Title": "“Wonderful Hotel”", "Author": "RIBASLisbon_Portugal", "ReviewID": "UR23998214", "Content": "We went there in January of 2009. It´s a Wonderful Hotel, with a very good location ( a few minutes from Charles de Gaulle Étoile), reasonable rates, very nice rooms, plenty of character, a charming hotel. We really enjoyed our stay there. We will return there next time. The staff was outstanding and we even found two portuguese ladies in their staff. They were amazing. Very good Hotel. Pedro Ribeiro and Ana Fernandes from Portugal", "Date": "January 29, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "3", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Dublin, Ireland", "Title": "“Excellant, excellant, excellant”", "Author": "nryan33", "ReviewID": "UR23954489", "Content": "Great hotel in a nice location and reasonable rates. Really enjoyed our stay here. The hotel has plenty of character, nice rooms and garden. But the outstanding element are the staff. Really friendly and helpful. We didn't eat here but there are areas just to sit and have coffee and locally there are plenty of coffee shops and a superb bakery across the road. Its about a 5-8 minute walk to the Arc but plenty of metros to get you around from there.", "Date": "January 27, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Ireland", "Title": "“classy convenient hotel”", "Author": "baddiel1", "ReviewID": "UR23485981", "Content": "This really is a charming hotel. The service and location is excellent. We stayed in january when it was very cold so it was important to have a few nice restaurant in very close proximity. These were mostly frequented with locals rather than tourists which is always a good sign (Try the galvacher which is only a few yards away). The room was nice and had facilities such as a free soft drinks mini bar and bathrobes. The Breakfast room was elegant and the little garden at the back was very charming. will be back on my next visit to Paris i would imagine.", "Date": "January 12, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Business service (e.g., internet access)": "4", "Check in / front desk": "4", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Sheffield", "Title": "“Lovely Hotel”", "Author": "Chrisgale", "ReviewID": "UR23323282", "Content": "Super Hotel recently refurbished to a very high standard. Comfortable with friendly helpful staff. Walking distance to Metro and main shopping streets. Car parking and small garden which is unusual. Would be great to have breakfast in the garden in Summer. Quite and peaceful yet in the middle of Paris. Went for New Year which was great.", "Date": "January 6, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Avalon Beach, Sydney", "Title": "“AAA Recommendation”", "Author": "AvalonNSW", "ReviewID": "UR22180404", "Content": "Not my first stay and by no way my last. I arrived at the end of August and left the 26th October. Amazingly friendly staff and yes renovations were going on as they have just gone from 3 star to 4 star. During this time I did a few trips and I left the extra luggage in the hotel with no problem at all and when I arrived back it was waiting for me in the room. I would highly recommend this hotel to anyone travelling to Paris. Rooms great, service awesome and close to most popular sites. A fantastic experience for such a long stay. P.I Sydney, Australia", "Date": "November 25, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "California", "Title": "“Loved the Best Western Premier Regent's Garden Hotel!”", "Author": "CaliforniaKimster", "ReviewID": "UR20917468", "Content": "The Best Western Premier Regent's Garden Hotel was wonderful. We spoke very little French, but the staff all spoke English. The hotel was clean, with new bathrooms and a large shower. The staff was also terrific, making reservations for us for dinner, tours and the train. We loved Paris, and we loved the Premier Regent's Garden Hotel!", "Date": "October 15, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Toronto", "Title": "“Very nice hotel for our first visit in Paris”", "Author": "Sparkles2008", "ReviewID": "UR20649072", "Content": "I really liked this hotel because it was very clean, some what close to the metro, the Arc and there was grocery store right across the street which we used often for fresh fruit and breakfast items as the breakfast in the hotel was a bit expensive. The staff was very friendly and helpful, our room was clean and the hotel is tucked away on a quiet street. The walk to the Arc is around 10 minutes which is great during the day but the streets are a bit quiet in the night. All in all it was a good experience.", "Date": "October 5, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Brisbane", "Title": "“What a gorgeous Hotel!”", "Author": "dreamingparis", "ReviewID": "UR20455439", "Content": "I was staying in Paris by myself, having never been there before, in between visiting 2 lots of friends in Europe. From the minute I arrived, I knew that I had made the right choice. This hotel is beautiful. There were some very minor renovations still going on, but absolutely nothing that bothered me (like some tape around room numbers while they were painting, which was there one day, gone the next). I never saw any work, or heard anything. I stayed in a standard room, but it was quite large by Paris standards from what I had read on this website. I had a lovely comfortable bed, writing desk, bed side tables, bar fridge and LCD TV. There was a little foyer with a closet in between the bathroom and bedroom. I even had a bath. On request, the hotel provided tea and coffee making which I believe is standard for the bigger rooms. I used my iphone in my room and in the garden with the free wi-fi the hotel provided. There is also a computer with free web access near the lobby. The foyer downstairs was divine, the garden immaculate and I can't rate this hotel high enough. Staff were extremely friendly and helpful. What makes this hotel a stand out is the little supermarket, no more than a 20 second walk across the street. It is such a charming place. It's located in the 17th arrondissement, which is quite residential (but Parisian residences are vastly different to Australian so don't be turned off by that). It gave me a real insight into the Parisian culture being in this location. I was a little worried about the hotel being away from all the action when I booked it, but it definitely was not. A lovely short 7 minute walk or so, and you were at the Acr de Triumph, which is at the top of the shopping end of the Champs Elysees. This is a quieter part of Paris, but definitely not away from the action. I will stay at this hotel again in a heartbeat. It made my short 3 day trip to Paris memorable. When I was leaving, a couple of the larger rooms were being cleaned and I had a quick peak. If you have more than a couple of people, or you want to splurge on the bigger room, you will not be disappointed. They were individually decorated and looked spacious and very charming. I can't wait to return to this hotel again. I don't usually write reviews on things, but seeing as I found this hotel after looking at this website, I wanted everyone else to have the benefit of my experience.", "Date": "September 28, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "New York", "Title": "“Outstanding”", "Author": "NewYorkMilkman", "ReviewID": "UR20280157", "Content": "Great hotel. Great location. The hotel staff was fantastic. I will stay here on all my future trips to Paris.", "Date": "September 22, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "France", "Title": "“Great hotel, shame about the price increase!”", "Author": "seg7", "ReviewID": "UR20024392", "Content": "We enjoyed a fantastic Mother-Daughter trip to Paris in August and were very impressed by the quality/cost ratio of Regent's Garden Hotel. We got a really nice, recently refurbished twin room for only 99 Euro (booked direct on the hotels website). However, rather large negative: A few weeks later, having been so impressed by the hotel that I was planning a second trip back there to stay with my husband, I was told by the hotel that it had just been upgraded from a 3* to a 4* hotel and that subsequently the price has increased from 99 Euros for a Classic room to 169 Euros! A huge increase which dramatically changes the 'value for money' aspect of the hotel. While I would agree that an increase was warranted based on the refurbishment, it does not warrant a 70 Euro increase and it's a real shame as it puts a nice little hotel in the unaffordable category for a lot of people who would previously have stayed here (a comment I made to the hotel).", "Date": "September 13, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "4", "Overall": "5.0", "Value": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Doncaster, England", "Title": "“Stylish and Friendly”", "Author": "janarie", "ReviewID": "UR20008367", "Content": "A very well located hotel within 5-10 minutes of two metro stations on different lines. Obviously recently refurbished as it was very smart and stylish. We booked a superior room which was reasonably large and had a view onto the front street,. It had a separate bathroom and toilet (unusual). The bathroom fittings were superb and the quality of the linen was very good. The breakfast room was smart and the breakfast (included in our deal) was more than adequate. Staff were very friendly and welcoming. Added bonuses were a superb patisserie opposite the hotel, a nice little cafe/restaurant next door (Cafe Pierre) if you are two lazy to go anywhere else and an excellent restaurant called 'La Galvacher' in the nearby square with wonderful beef, reasonable prices and friendly service. Thoughly recommended.", "Date": "September 12, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Delhi-India", "Title": "“Excellent Place to stay”", "Author": "vinivivek", "ReviewID": "UR19609127", "Content": "During June 2008, I planned to take my Wife and my Son (11 years old) to their first trip abroad to Munich(Germany), Salzburg(Austria) and Paris(France). After doing a great research on trip advisor for good hotels in Paris, I zeroed in for this hotel. For booking I sent an email to the hotel (found on their website) and was amazed to receive their prompt and decent offer. I booked the hotel. I found no difficulty in reaching the hotel from CDG RER station following the map sent to me over email by the hotel staff. On reaching the hotel, we were welcomed by the hotel staff with great charm and we were informed that our room was being vacated by the earlier tourists and would take about 30 minutes, They made us feel comfortable in their restaurant and served us with complimentary tea and snaks. Within 30 minutes, they informed that our room was ready and they escorted us to our third floor room, It was a really nice triple room with garden view. The bathroom was spotless. Everything was perfect. Moreover, free Wi-Fi internet connectivity was also available in the hotel which helped me a lot for doing the online check-in in flight, accessing emails etc. Every morning free tea was served in rooms. The staff at the reception was exceptionally cooperative and helped us a lot in touring different parts of Paris. My son had very good interactions with the front desk staff. Me and my wife loved the hotel location as all the important attractions like Arc the Triomph, Eiffel Tower, Champ Elysee were at walking distance. Good bus connectivity was available for places like Louvre, Opera House, Sacred Core etc. A good departmental store is just in front of the hotel where you can get all the daily needs items, We enjoyed every bit of our stay at this hotel and would strongly recommend it to any body who wishes to stay in Paris.", "Date": "September 1, 2008"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "Melbourne, Australia", "Title": "“great value for paris”", "Author": "bombayandy", "ReviewID": "UR19335268", "Content": "This hotel was a fantastic place to stay in Paris, a 5-10 min walk to arc triomphe and about the same to the nearest metro Ternes. Hotel is under renovation summer 2008 but is nearing the end, the foyer was a mess but the front desk staff were happily working around it and looking after us. For the price about 110 euro it was outstanding value because it is a hotel with all the services in a good district and manages to merge the historical paris decor with the modern requirements. As far as european hotel standards go is a good 4 star. Wifi was included, tea and coffee facilities, friendly staff. As mentioned by others champion supermarket across the road along with patisserie. There is also a market which opens up in the streets on the way to ternes metro in the streets just behind, great fresh bread and fruits, etc. Note we stayed during tour de france and it was perfect for champs, close enough, not too close. I will stay again some day soon.", "Date": "August 25, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Germany", "Title": "“the nicest place to stay in paris!!! loved it!!!”", "Author": "happytraveller61_8", "ReviewID": "UR18655340", "Content": "after been in paris more than 10 times this hotel is by far the nicest place i ever stayed in paris. its a 39 rooms hotel in a very quiet street and its only 5 minutes walking distance from the arc de triomphe. the rooms are completely renovated, every room has its own charme but they are great. we had room 101 and 112 and there was just a big WOW when we walked into these rooms. the money+price value is fantastic. the little garden (great for having breakfast) makes up the day and the staff is more than friendly. many thanks to sabine who did a great job! whenever i will go back to paris this is the place, and the ONLY place where to stay. No doubt about it and not even a single small something to complain. Simply GREAT!!!!!", "Date": "August 5, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "3", "Check in / front desk": "5", "Overall": "5.0", "Value": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Belfast, United Kingdom", "Title": "“Brillant find in Paris-loved it!”", "Author": "Hols3", "ReviewID": "UR18547736", "Content": "This was our 4th trip to Paris and we had always stayed on the Left Bank on previous trips. We thought we would like a change of scene and also the hotel in which we previously stayed had very small double rooms and our girls are now an age at which its nice to give them there privacy and the family room days are now gone! We booked our trip through a web site and got a rate which included breakfast. When checking in at the desk I enquired if the rooms (2 superior) were overlooking the garden as we had requested. We knew there was no guarantee on this but as soon as we mentioned we would prefer it the very helpful receptionist had it sorted out for us. One had already been a garden view and she changed ours no problem! On arrival into our rooms the four of us were delighted with the cleaniness,size of rooms-especially ours, as it was the same size as the quadruple we had in our previous hotel. It was really a special touch to have tea and coffee making facilities as Paris hotels dont usually have this little touch. The supermarket-Campion chain was very handy just across the road with a huge selection. We were concerned about the area being quieter but it was great to come back to after racing around Paris all day. It was very easy to find as we used the Air France bus from CDG which dropped us off a 5 minute walk away. We used the Ternes metro stop 5-10 minute walk to get around Paris. All in all we can highly recommend this great hotel, they were just one day away from completion of the renovation work and we will no doubt return to stay here again in the future.", "Date": "August 2, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Business service (e.g., internet access)": "2", "Check in / front desk": "5", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Ottawa, Canada", "Title": "“Nice hotel, good location, currently under renovation”", "Author": "ottwatrvlr", "ReviewID": "UR17799789", "Content": "This is a nice and cozy hotel located in the 17ie arrondissement. It is walking distance to Arc de Triomphe/Champs Elysee (10 minutes) and the Eiffel Tower (20 minutes) and also close to the Metro and walking distance from drop-off points for (Porte Maillot and Etoile) when using Cars AirFrance from CDG. We were a bit turned off upon our arrival due to the renovations in the common areas of the hotel. Those fears were put to rest when we got into our room which was a nice, recently refurbished \"superior\" room. Rooms in Paris are notoriously small. I would say that the room that we had was just the right size for 2 people. Bathroom was modern, albeit very narrow between the shower and toilet area. The staff was very friendly and offered good tips/advice on sites nearby. The hotel is in front os a small supermarket, a bakery and a butchery so it is also convenient to grab some food for a quick snack or breakfast. We were there four nights and picked up pastries at the \"boulangerie\" and juice/yogourt at the supermarket on all but one morning (you don't get much for the 17EUR that they are charging for breakfast at the hotel) I was very satisfied with my stay and would have probably rated the hotel as excellent if it would not currently be under renovation. Speaking of renovations, they were done during \"business hours\" and did not prove to be a disruption.", "Date": "July 11, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "4.0", "Value": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "tunbridge wells", "Title": "“don't be put off by the refurb”", "Author": "JulianTunbridgeWells", "ReviewID": "UR16429707", "Content": "The appearance of this hotel is down at heel (definitely not as good as the official photo). But don't be put off! Once inside, we found that it is being refurbished and we were to occupy a room that had already been refurbished on the first floor. The room was good, with nice bathroom fittings and decor. Cleaning was first-rate. We were told that the hotel is aiming for 4 stars. I think they may be almost there. They need more luxurious towels to complete the effort. The choice of satellite TV stations is however excellent. The reception was still awaiting the refurbishment treatment (and distinctly hang-dog) but the staff are nice and friendly and to be honest you are not likely to spend a lot of time there. Breakfast was also good and there is a charming rear courtyard where you can sit to read the free newspapers. The situation is just great, within walking distance of Place des Ternes Metro and in a quiet back street. There is a really first rate and reasonable restaurant just 200m. up the street called Maison de Campagne - be sure to book ([--])", "Date": "May 27, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Toronto, Ontario", "Title": "“Absolutely gorgeous rooms”", "Author": "CountingSchooler", "ReviewID": "UR15485971", "Content": "Paris has close to a hundred Best Westerns, but the \"Premier\" hotels are essentially the \"first class\" brand of their hotels, the Regent's Garden didn't disappoint. Each room has its own unique decor - I was traveling on business so I saw my colleague's room. Each had its own charms - but the beds were exrtemely comfortable, the washrooms clean and fancy thanks to the modern fixtures, and the general decor was just wonderful. I have pictures of my self grinning goofily as I wandered around the room, amazed at how stunning everything looked. The Napoleonic apartments are incredibly spacious, and even the regular rooms are relatively large by Parisian standards. You definitely have room to sprawl here. In addition to having great rooms, the front desk was very helpful too: they shared information on the best options for getting to the airport and when I forgot to return a Parisian friend's electronics they held on to it for her to pick up. They were also prompt in hand-delivering the wireless internet access code to my room on a slip of paper - very good service. Didn't try breakfast as I prefer to go to the shops/cafes like everyone else who knows Paris. Top tip: make sure to try the pastry/bakery shop across the street - it won an award for best chocolate eclair in Paris less than three years ago, and the quality is top notch there too.", "Date": "April 30, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "4", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Limerick", "Title": "“Highly Recommend”", "Author": "LimerickCailin", "ReviewID": "UR14006895", "Content": "Just returned from Paris and stayed at the Regents Garden for 4 nights with my boyfriend. We got an excellent deal on the Best Western website and were very impressed with the hotel. The location is ideal, 5 minutes walk to the Arc de Triompe and metro station. The area feels very safe and there are a very good selection of restaurants nearby (recommend the Brassier around the corner where you can cook your own meat). Our deal did not include breakfast at the hotel (which is quite pricey), instead we ate breakfast at the cafe's which were much more reasonable. The hotel is going through some refurbishment at the moment but this did not disturb us in any way, our room was very nicely decorated, really liked the layout and presentation, very clean and modern. The staff were very friendly and good to recommend places to eat, etc. Overall we were very happy with our stay and would highly recommend this hotel", "Date": "March 3, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Dublin", "Title": "“Rugby weekend in Paris”", "Author": "sean_e78", "ReviewID": "UR13564334", "Content": "Stayed here recently with my fiance and found the experience fantastic. The room was recently refurbished, and the service was exceptional. The front desk staff were very friendly, although the guy who served breakfast was on the grumpy side. Overall, we loved it.", "Date": "February 15, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Check in / front desk": "4", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "London", "Title": "“Great location, recommended to All!”", "Author": "murveyrock28", "ReviewID": "UR12912951", "Content": "We've stayed at the Best Western Premier Regent's Garden Hotel from 24 to 27 December. I booked via Best Western website and got an excellent rate. We had a superior non-smoking room. The room was very spacious and clean with a good size, modern bathroom. The view from the room was great, not only we enjoyed the look at the garden but the rooftops of other parisian houses were very pretty indeed. We had our 2 year old son with us and the travel cot in the room was handy. The best thing about this hotel is its location! It is about 10, 15 minutes walk from Arch de Triomphe and 25, 30 minutes from the Eiffel Tower. Also there is a bakery across the road from the hotel with fresh croissants and a supermarket few steps away. Recommended! Oh I almost forgot to add that there is a small lift in the hotel which is helpful when carrying a pram etc. Au revior", "Date": "January 23, 2008"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Los Angeles", "Title": "“New Years in Paris.”", "Author": "sapphiredragon", "ReviewID": "UR12670561", "Content": "Stayed at this hotel days leading up to New Years 2008. You are actually walking distance to the Arc de Triomphe as the hotel is located on that side of town. Definitely a fantastic hotel location if you don't mind walking a little. The hotel has some historical significance as it used to be a mansion of Napoleon III. So it definitely has a charming look and feel about it. The room we stayed however, was remodeled and had a fairly modern french look about it. Very comfortable room and bed. Free in-room wireless internet and public computer in lobby a big plus. The bathroom was decent size and and had a towel warmer. No complaints there. We stayed in room 309 which seemed to be located near or over the next door restaurant/bar which stays open into late into the morning. You can hear chairs being pushed in and out and maybe shoes with heels walk across the wooden floors of the restaurant. May bother you if you are a light sleeper. We walked so much during our stay that at night, we usually slept right through it. The neighborhood in which this hotel is located is great. There is a market and pâtisserie right across the street. Both very nice and convenient. Tons of cafes and shops in the nearby area. The hotel staff was very helpful and spoke good english. Made for a delightful experience. Definitely would stay there again and recommend if you don't mind walking a little.", "Date": "January 15, 2008"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "Maine", "Title": "“Absoulutely charming hotel!”", "Author": "tillieboo", "ReviewID": "UR11203717", "Content": "I have stayed at this charming hotel twice this year, in September and November. I located it on the internet and was worried about finding the right place and location as I was traveling alone the first trip. I was thrilled to find a hotel right in the middle of everything, but on a lovely side street with a garden courtyard. I had only planned to stay a few days but because of the staff, location, comfort and feeling of the hotel, I stayed for ten days and then came back in November! The accommodations were excellent. On my first trip, I ended up staying in four different rooms as they accommodated my extra days and they were all lovely. The bathrooms are exceptional( I am very picky!) and the beds are very comfortable. The staff is seasoned and very personal. The little dining room for breakfast is adorable. You really feel like you're in Paris, but also right at home! I hope to return in May.", "Date": "December 2, 2007"}, {"Ratings": {"Cleanliness": "3", "Business service (e.g., internet access)": "2", "Check in / front desk": "3", "Overall": "3.0", "Value": "3", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Germany", "Title": "“During the Metro/Train Strike - yaikkkkssss”", "Author": "dwild2005", "ReviewID": "UR10937112", "Content": "We just got back from our 1 week stay in Paris. We stayed at Best Western Premier Regent's Garden the whole week. The Hotel is old, but well maintained. They have a secured small parking spaces in front of the hotel. The reception stuff speaks english and are very friendly and helpful. The room we were in was small - which is a standard size for Paris. The room and bathroom are clean. Our room faces the street and across the street is a contstruction and it get really loud and noisy with all the drilling and hammering. At night time, we could here the cars on the street, the honking and motorcyle -- a bit loud. Breakfast is not included with the room fee, so you have to pay an extra 12-15 Euros per person, so we decided to walk a few meters up the mainstreet and viola . . . . we found several Boulangerie/Patisserie with excellent bread/pastries/croissants and they also offer petite dejouner. The Hotel is average, nothing spectacular . . . we were out most of the time so we only use the hotel for sleeping. There is a Grocery across the street which is very convinient to buy some drinks and snacks. There is also Boulangerie/Patisserie and Asian food take out. The location of the hotel is pretty convinient . . . the metro (if it was operating normally) is only 10 minutes walk. Etoile and Champs Ellesey are also only 10 minutes walk. We will probably stay at this Hotel again . . . mainly because of the location. The Train/Metro strike started the second day we arrived in Paris -- this was a disaster. We have been in Paris 7 times the past 8 years and we never had this strike experience before. Metro is very important to get around Paris. Ohhh .... what a catastrophe. But we decided to enjoy Paris with or without Metro and we had a great time despite of it all. The worst part was that, we purchased the 5 day Visite Paris -- unlimited Metro ride for 5 days for € 27.00 per piece and we did not even use it. The Metro clerk did not even informed us of the strike when we bought the tickets -- oh, well ce'st la vie! We should have been more informed . . . our bad !", "Date": "November 20, 2007"}, {"Ratings": {"Cleanliness": "5", "Business service (e.g., internet access)": "2", "Overall": "5.0", "Rooms": "5", "Service": "4"}, "AuthorLocation": "Michigan", "Title": "“Great wedding anniversary experience”", "Author": "peace08", "ReviewID": "UR10035950", "Content": "My wife and I stayed at The Regent's Garden nine nights. Compared to our only other Paris hotel experience 35 years ago, this hotel provided much more luxurious surroundings and a very courteous, attentive staff. We had a quiet room that overlooked the rear garden. The carpeting, tile WC and separate tile shower/bath appeared to have been upgraded recently. The Arc de Triomphe is only about 1/2 mile away, but it is uphill all the way! I recommend using the Ternes metro station if you want to go the the Arc de Triomphe (Charles DeGaulle Etoille Metro) or Museums beyond. On your short walk to or from Ternes Metro, you will walk by one of the best outdoor markets in Paris, where you can pick up fresh bread, cheese, pastry, smoked fish, vegetables, fruit and inexpensive wine for your evening meat in your hotel room. We can recommend the L'Orenoc, Spoon, and Chez Georges restaurants from personal experience. These restaurants are within walking distance of the hotel or Charles DeGaulle Etoille Metro stop. My only disappointment was that the free hotel WiFi Internet connection blocked two of my U.S. email providers, Verizon and Compuserve. Fortunately I had a third email site available that was not blocked. Also, my favorite web browser, Mozilla Firefox, did not work there. The hotel staff could not tell me if the blocking was being done locally or nationally.", "Date": "October 3, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "4", "Check in / front desk": "4", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Calgary, Alberta", "Title": "“Great choice for hotel in Paris”", "Author": "Albertasaurus", "ReviewID": "UR8718608", "Content": "Spent 6 nights at the BW Regent's Garden in September, 2007. We highly recommend the hotel. We stayed in a Queen-Garden View Room on top floor (3rd floor). The room was spacious by European standards. The bed was large....more like a King size....reasonably comfortable. Washroom was also fairly large with combination tub/shower. The room was very clean. A/C worked well and was quiet. Room comes with bar fridge and safe. Apart from the size of the room, the best thing about the hotel room was how quiet it was. In 6 nights we hardly heard a sound. Staff was courteous. Free computer/internet in the lobby (The hotel guide in the room advised that there was a charge for the lobby internet. However, we used it on several occassions and were not charged.) Two small nits: No kettle tea/coffee in room....although you could ask for a tea/coffee tray free-of-charge at the front desk. Elevator is small. But that's standard for most hotels in Europe. The hotel is located in the 17th Arr.; a 10 minute walk to the Arc de Triomphe. Three Metro stations are within a 10 minute walk: Porte Maillot; Charles de Gaulle Etoile (aka Arc de Triomphe) and Ternes. The first two stations also have access to the RER. So while there are few sights close by the hotel....you have easy access to transit. We took the Air France Bus from CDG to Charles de Gaulle Etoile....20 Euros return....took about 45 minutes....with a 10 minute walk from there to the hotel. We didn't try the breakfast in the hotel. There is a great pattiserie across the road and numerous other restaurants, cafes in the area.", "Date": "September 15, 2007"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Business service (e.g., internet access)": "4", "Check in / front desk": "4", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Essex, Connecticut", "Title": "“Great - again!”", "Author": "sfisherphd", "ReviewID": "UR8715378", "Content": "My wife and I stayed at the Regents Garden last in 1988, before Best Western purchased it. When my teenage son and I decided to take a short hop, Expedia had it listed as one of the top picks. I was a bit wary of what might have changed since BW purchased it - my concerns were completely unfounded. The rooms are spacious by European (particularly Parisian) standards, staff was friendly, and the location is fantastic. The bathroom was clearly recently upgraded, and is again quite large for a boutique hotel in Paris. I agree with all of the previous reviewers and suggest skipping the overpriced breakfast and walking 100 meters to a cafe for le petit dejeuner at half the price. I will be traveling to Paris again in a few months and will certainly stay here again.", "Date": "September 14, 2007"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Check in / front desk": "4", "Overall": "4.0", "Value": "5", "Rooms": "5", "Location": "3"}, "AuthorLocation": "Frankfurt a.M.", "Title": "“Best choice in this price range”", "Author": "natffm", "ReviewID": "UR8513214", "Content": "I have travelled to Paris dozens of times and know quite a few hotels there. This was the first time I stayed at the Regent's Garden, and I will make it my favourite from now on. I had booked a Queen's Room with garden view for a little more than 100 EUR. I am not sure if I actually got an upgrade, because the room I got (on the top floor) was the spaciest I have ever seen in this city, where the standard is to be crammed into some tiny space where little else than the bed fits in. The view to the garden was not really overwhelming, but pleasant. Totally quite, except some occasional noise from what I guess was the elevator. I could easily cope with that. The decor was nice, what you might call typically Parisian, as in the rest of the hotel. The garden is a great feature, very rare in Paris. Staff was friendly and efficient, and really everybody speaks English - they not only know it, they actually speak it, which is also not typical for France. Highspeed internet for free in the lobby. I am not sure about internet in the rooms since I did not bring my notebook. The only real downside was the breakfast buffet, which at 14 EUR is wildly overpriced. Choice is rather limited, and they even charge you extra for scrambled eggs and the like. When I came in short before closing on the last morning, there was hardly anything left, but I still paid the 14 EUR. While it is certainly very nice to have your breakfast in the garden, you will get much better value outside. What I liked, however, was the \"fair trade\" tea and coffee which I have very seldom seen at any hotel. The location is OK but not exciting, in a mid- to upscale residential neighbourhood with little of interest. It is about 10-15 min walk to the Arc de Triomphe. If you want to stay close to the main tourist attractions, this is probably not the optimal choice, but anyway the metro system is so efficient it does not really matter where you are located. There are several stations on various lines within 10 min walking range.", "Date": "August 27, 2007"}], "HotelInfo": {"Name": "BEST WESTERN Premier Regent's Garden", "HotelURL": "/ShowUserReviews-g187147-d198109-Reviews-BEST_WESTERN_Premier_Regent_s_Garden-Paris_Ile_de_France.html", "Price": "$203 - $399*", "Address": "<address class=\"addressReset\"> <span rel=\"v:address\"> <span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">6 Rue Pierre Demours</span>, <span class=\"locality\"><span property=\"v:postal-code\">75017</span> <span property=\"v:locality\">Paris</span></span>, <span class=\"country-name\" property=\"v:country-name\">France</span> </span> </span> </address>", "HotelID": "2514886", "ImgURL": "http://media-cdn.tripadvisor.com/media/photo-s/02/3c/0a/3c/jardin.jpg"}}