{"Reviews": [{"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "1"}, "AuthorLocation": "Cochrane, Canada", "Title": "“Terrible customer service AVOID”", "Author": "780Michelle", "ReviewID": "UR125715229", "Content": "Online booking system is terrible. Hotel charges for stays that are not confirmed. Terrible customer service. No help. Will not reverse charges following their mistake! Should be able to give zero stars.", "Date": "March 6, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Providence, Rhode Island", "Title": "“Just Basic!”", "Author": "Souri_10", "ReviewID": "UR121349169", "Content": "We chose Hotel L'amiral while we had read other's reviews about it. Our main reason to choose was it's location as it is about 30 min walking to the Eiffel which is a relief (however this is not a straightforward & easy rout). The bad thing is that it is a bit hard to find the hotel. We were lucky that Parisian people were really friendly in helping us with finding addresses even with poor english! The hotel is just basic in my opinion. We got a very small room with a backyard view. It was just after the first day that we found out there were empty rooms with Eiffel view that we could move if we want. The elevator was very small. Room was not so clean. Bed coverings were old & worn out. The bathroom was big enough, reasonably clean & there was a bath tub.There was no minibar. WiFi connection was fast in the room. The most annoying thing was the toilet odor since the ventilation system didn't work in the bathroom & we had to leave the window open always. The staff was friendly & helpful. They prepared us what we asked for. They gave us an iron which we desperately needed! Also we asked for some boiled water & they brought us a full tea service with no extra charge! Overall, it was OK for 2-3 nights since hotels in Paris are often expensive with poor quality.", "Date": "December 3, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "1", "Overall": "1.0", "Value": "4", "Sleep Quality": "1", "Rooms": "2", "Location": "4"}, "AuthorLocation": "Medina, Saudi Arabia", "Title": "“so bad”", "Author": "Mosha A", "ReviewID": "UR121347635", "Content": "reception; the stuf were nice but they were not helpful the manger was rude, the hotel take from my master card the price twice, and i had problem between the bank and the hotel. the room was old fashion and very small not like i saw it in booking.com. the Elevator very small and takes ages to go up.", "Date": "December 3, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "4", "Sleep Quality": "4", "Rooms": "2", "Location": "4"}, "AuthorLocation": "Bangalore, India", "Title": "“Could be better !”", "Author": "mmsahu", "ReviewID": "UR120558171", "Content": "Location : Very good. Very central. Most eateries are round the corner. The Vaugigard metro station is nearby too. Ambience, & hotel stay : We were three of us on a budget trip so took up a double room with an extra bed, and cost wise was very effective ! But sadly, what you see in pictures is what you get. Not an inch more not an inch less. So yes, for 3 people, it was quite cramped. With the beds, a table & 3 suitcases we had to literally jump around to navigate the room. BUt then, we werent complaining that much, since we spent the least amount of sleeping hrs in this room. Ambience was decent overall. Staff : Were a little grumpy. the ones who understood english were not exactly helpful, and the girl who didnt converse very well in english was utterly sweet. So, you know! we found our way around thanks to pamphlets :) The life and the staircase are worth mentioning - The lift was extremely tiny. Would hold one person & one suitcase & thats about it. And trust me, if you suffer from a wee bit of claustrophobia, you will probably decease in there! So yeah we managed again...climbing 4 levels through the spiral staircase. Each day at least 4 times up n down for 4 days! :) Price : Very cost effective for budget travellers!", "Date": "November 14, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "3", "Overall": "3.0", "Value": "3", "Service": "4"}, "AuthorLocation": "Bangalore, India", "Title": "“Nice Hotel- Worth the Money Spent”", "Author": "Niktraveler", "ReviewID": "UR115788062", "Content": "Amiral is a nice hotel which is just some 2 KMs from the Eiffel. Its also 5 minutes walking distance from vaugirard Metro station. The rooms are small, but well maintained. You will be greeted by friendly staff and who are ready to help you out with any sort of queries you may have. This hotel has free Wifi, though the reception will be poor as you go high up. So if you prefer to have Wifi, its better to opt for a room in the first three floors. The only problem is with the Hotel is the cramped lift, which is quite archaic and could just hold 3 people at a time.", "Date": "July 26, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "3"}, "AuthorLocation": "Newcastle Upon Tyne", "Title": "“Gem of a hotel”", "Author": "Kirsty38", "ReviewID": "UR83038973", "Content": "We picked L'Amiral for a cheap weekend break in Paris,we paid 320 euros for 3 nights and compared to other hotels in paris this was very resonable.The hotel is in a lovely area which feels safe even at night.The rooms are well appointed and very clean and the bathroom is a resonable size (i was expecting to not be able to turn around after reading some reviews!) We had a room on the top floor of the hotel and a fab view of the Eiffel tower! The room had double windows which made it feel very Parisian! The bed was really comfy and we didnt hear a nosie from the streets below so slept really well.The staff were really friendly and we got some recomendations for some fantastic resturants and bars so do ask! The only few downsides are the location-it is about a 20 minute walk from the Eiffel tower and then its a further 10-15 mins before you are near any resturants,shopping and even further still to any of the other famous landmarks in Paris.Yes there is a metro station very near by but personally i wouldnt use the metro at night. The only other thing was the cleaning lady was very loud on a morning-you could hear her in the other rooms from very early. Generally the hotel is really great and very friendly and besides the location is everything you need.", "Date": "October 11, 2010"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Overall": "2.0", "Value": "1", "Sleep Quality": "3", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Utrecht, The Netherlands", "Title": "“Basic hotel - careful with the parking (it is paid even when told otherwise)”", "Author": "Inge_B_1", "ReviewID": "UR72353637", "Content": "My partner and I wanted to do a last minute trip to Paris and were looking for hotels online. We were going by car so needed accommodation with car park available. I lined up several options and called the hotels to enquire about car parking. By the gentleman who answered the phone at Amiral hotel, I was told that not only was the car parking included in the rate, the swimming pool was as well. I decided to book the room and showed up the following day to then be told, by the gentleman at reception, that car parking was at an additional cost of 20 euros per day. This gentleman was clearly very stressed as he was trying to leave for the day, the next person was not there yet and he could not help with check in coz he had to close the register plus he kept insisting (almost shouting) that I had to pay for the carparking. He informed us, and other guests, of this in a very rude and agressive manner so we ended up leaving our stuff in the hotel to go sightseeing and wait for someone else to help us. Anyway, I will make a very long story short. I travel weekly for business and am vert familiar with 4 and 5 star hotels. This is not one of them. If you are looking for basic and accessible and you dont need carpark, it will do the job. If you are looking for a slight bit more, including service, space, quiet and cooperation, don't go here.", "Date": "July 26, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Location": "4", "Rooms": "4"}, "AuthorLocation": "London, United Kingdom", "Title": "“Great value hotel in great location”", "Author": "anchel79", "ReviewID": "UR49421027", "Content": "I just returned from a 4 day break in Paris. We stayed at the Hotel L'Amiral and were really pleased with the Hotel. It is in a great location, only a few minutes walk from the Vaugirad Metro Station, it is also walking distance to the Eiffel Tower (about 20 mins or so). There are plenty of cafe's and restaurants in the area so food options are plentiful. We ate breakfasts of delicious pastries from the local Patisserie each morning - only a 5 minute walk down the street. It is in a nicer area, which feels quite safe while walking around at night. We were on the first floor and could even see the top of the Eiffel tower from our room. The hotel is great value, we paid 230 euros for 3 nights for a decent size (European sizes that is!!) double room. There was a table, small closet, and small TV in the room. The bathroom was very clean and recently renovated, with really good water pressure. They serviced the room daily so we always had fresh towels and soaps. The hotel has a lift (Again - its small - usual Paris size) which would be great if you were on the higher floors. The staff speak great English and were helpful if asked. My only criticisms were that the walls were quite thin so we were disturbed one night by some noisy neighbours in the next room, the purchase of some earplugs the next day prevented a repeat. The hotel doesn't provide tea & coffee facilities either, I think the addition of a kettle and some tea would be fantastic, Especially in winter. The bed wasn't great, it is quite saggy in the middle so not overly comfortable, but linens and blankets were clean. Other than that I can't really fault the hotel, it is good value, and a good location so would definitly stay there next time I go to Paris.", "Date": "November 17, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Location": "4", "Rooms": "4"}, "AuthorLocation": "Boston", "Title": "“Clean and quiet; I'd definitely return.”", "Author": "kathykBoston", "ReviewID": "UR33097531", "Content": "The hotel and rooms are small, but very clean, with spacious bathroom and good plumbing. Initially we were given a room with a view of an inner court yard where the walls were being painted. We requested a room with a view looking out, and got on with a view of the Eiffel tower! Most of the staff were extremely friendly and helpful. We were advised to eat at nearby restaurant \"Le Cap\" and it was wonderful. The hotel is close to a train station, and on a quiet and safe street.", "Date": "June 24, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Geneve", "Title": "“Good value for money”", "Author": "phasma", "ReviewID": "UR28536772", "Content": "We have staid 3 nights in this hotel. We arrived very late, at 1AM, and needed to wake up the receptionist to open the door and do the check in. The guy was nice, even if we woke him up at night, and he gave us a room at the top floor. The rooms are very clean and with new furniture, but quite small - like in most of the hotels in the central Paris Area. The walls are a bit thin, so if you have noisy people in other rooms, you can easily hear them (which is also the case for most of the hotels in the center) There is a lift which can fit 2 persons with no problem. The hotel is located 3 minutes walk from Vagirard metro station, and around 20 minutes walk from Eiffel tower. The street is very silent - and there was no problem sleeping with open window. The staff is nice and friendly, we could leave our luggage after the check out as well. For the 70 Eur/night for double room, it is really a good value for money. Breakfast is 8 Eur, but I think you can get real french breakfast anywhere in the city coffees for the same price. I would recommend this hotel for short weekend stays for sightseeing Paris.", "Date": "April 22, 2009"}], "HotelInfo": {"Name": "Hotel l'Amiral", "HotelURL": "/ShowUserReviews-g187147-d529614-Reviews-Hotel_l_Amiral-Paris_Ile_de_France.html", "Price": "$148 - $172*", "Address": "<address class=\"addressReset\"> <span rel=\"v:address\"> <span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">90 rue de l'Amiral Roussin</span>, <span class=\"locality\"><span property=\"v:postal-code\">75015</span> <span property=\"v:locality\">Paris</span></span>, <span class=\"country-name\" property=\"v:country-name\">France</span> </span> </span> </address>", "HotelID": "2514784", "ImgURL": "http://media-cdn.tripadvisor.com/media/ProviderThumbnails/dirs/e2/79/e279a8f555ecd93c332d72a435213eab3large.jpg"}}