{"Reviews": [{"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Omaha, Nebraska", "Title": "“great experience”", "Author": "ChristyS6", "ReviewID": "UR127311635", "Content": "my husband and i went to NYC to celebrate NYE. we stayed 2 winters ago. the memorial wasnt done yet, so we were able to see ground zero still under construction. it was so neat to see what they were working on. there was an amazing silence around just that part of the hotel. and as soon as you walked away, the sound of laughter was all around. its like everyone knew to be respectful. the hotel its beautiful. coming from the midwest, the rooms were smaller than we're use to, but very accomodating. its a \"green\" hotel, which is nice too. i liked the water bottles that can be re-used for our leisure. the staff is helpful also. staying near the trade center made the experience even more intriguing to be there.", "Date": "April 5, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "5", "Location": "3"}, "AuthorLocation": "Toronto, Canada", "Title": "“Cozy and Clean”", "Author": "GraemeLaird", "ReviewID": "UR127217172", "Content": "Our room overlooked ground zero, but had a support pillar between the chair and the bed making conversation difficult. No complaints otherwise as it was clean, had fresh water available, and cozy. No parking, but that's New York for you. The underground parking next door is outrageous. Prepare to pay a parking fee equal to the cost of the hotel stay. The location of the place was a little out of the way for the sites we wanted to see, but the subway was always accessible, and there were good breakfast-style cafes nearby.", "Date": "April 3, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Waltham, Massachusetts", "Title": "“Great Price for NYC”", "Author": "emanthony", "ReviewID": "UR127201715", "Content": "This is a nice hotel with the modern amenities like free water, coffee/tea, internet and more. The rooms are smaller than average but that is expected in NYC. This is a good choice for a person on a budget.", "Date": "April 3, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Arlington, Virginia", "Title": "“Good Value”", "Author": "Sapna B", "ReviewID": "UR127184850", "Content": "My husband and I came here with some of our friends this past weekend and had a pretty enjoyable stay. The coffee in the lobby is great and they have purified chilled water scattered through the hallways. The room was comfortable and clean and we had a direct view of the construction of the new WTC. We only stayed one night on a Saturday night and from what I've heard, there is no construction on Sunday so we weren't awakened by that. My only complaint is that it took almost the whole night to get the temperature up in the room. We turned it up as high as possible as soon as we checked in (around 3 p.m.) but I didn't really feel warm until about 12 hours later! There is coffee (Starbucks) and shopping (Century 21) nearby but the location isn't really all that fantastic. But it was a good price for a NYC hotel, so we would probably stay here again if it was for one or two nights.", "Date": "April 3, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Sleep Quality": "4", "Rooms": "2", "Location": "4"}, "AuthorLocation": "Geneva, Switzerland", "Title": "“Can't be a 4 star”", "Author": "atime4pleasure", "ReviewID": "UR126955541", "Content": "I booked through Hotwire who classed it a 4 star hotel. I am not sure who comes up with these classifications. I would say it is a 3 star hotel. They have one person at reception who goes back and forth between the Club Quarters and the regular Hotel. This is not adequate when they have to answer phones, deal with people checking-in or have questions. The person at the front desk was very nice and courteous at all times it should be noted. The room is clean itself and new. My room had a double bed, a kitchenette and a desk. But the rooms are quite small. It was difficult to find a suitable place to keep your suitcases. I ended up putting mine in the closet. I would have expected a larger room for a 4 star hotel. I would have also expected the towels to be clean. One towel had a large yellow stain on it. Another towel was left on the floor by the cleaning staff. Thankfully, they were both different size towels so I did not need to worry about have a body and face towel as there were 2 in every room. The hotel is right beside the World Trade Center (WTC). There is construction going on. Many people complained about the noise. I was their on business so it did not seem to matter. I left early and came back late. I would recommend staying in the area if you look peace and quiet during the evening and night. During the day, I think it is packed with all of the tourists visiting the WTC. To summarize, I think the hotel is a good value 3 star hotel. If you are looking for something more upscale, spend the extra money and stay at the W across the street.", "Date": "March 30, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "boston", "Title": "“Excellent Stay !!”", "Author": "b757ac", "ReviewID": "UR126906442", "Content": "My partner and I stayed at the Club Quarters for a little weekend getaway and could not have been any happier. I own a B&B in Portland Maine so I look at everything when I am checking into a new place. From the minute we walked in we were happy. Front desk were very helpful and nice. The room was very clean and nicely laid out. I would would stay here again anytime. Already planning our next trip. Loved all the little extra touches.", "Date": "March 29, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Arlington, Virginia", "Title": "“Great Wall Street hotel”", "Author": "PinaColada02", "ReviewID": "UR126280167", "Content": "I stayed one night at this hotel to attend a work meeting in the World Trade Center area and was pleasantly surprised at how nice this hotel was. The main thing that really impressed me was how well laid out the room was. Although somewhat small, the room never felt that way as every inch was well though out and designed efficiently. The room was tastefully designed with modern furnishings and had all the requisites for a business traveler: free wi-fi, plenty of outlets for charging electronics, ample desk. One really nice touch was the espresso machine in the lobby's \"great room.\" If I had a longer stay I could see lounging in the great room as there was a lovely fireplace and lots of comfortable chairs. Instead after I checked in and got situated, I headed to the lobby lounge (in my socks!) and helped myself to a cappuccino. It was definitely a little treat that made my stay a little nicer. One other thing I thought was a good idea was the self check in/out. You just go up to a kiosk and check in and check out. Saves time waiting for a desk clerk especially for business travelers who invariably are either tired from a long trip or in a rush to head out of town or to a meeting (as I was the next morning when I checked out). The one small negative is the construction across the street on the new World Trade Center memorial. The construction noise started quite early which was not too bad for me since I had to get up early for my meeting but I can see how it would be terrible if one wanted to sleep in. The hotel is definitely geared to business travelers so I wouldn't necessarily stay here if I was in NY for fun but if I had meetings in the area, I'd definitely return to this hotel.", "Date": "March 18, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Buffalo, New York", "Title": "“Good deal for 1-2 travelers, not for families”", "Author": "Tabu812", "ReviewID": "UR126151631", "Content": "Got this hotel on a deal via Travelocity. Was slightly hesitant based on some of the poor reviews. Overall, I am satisfied with my stay at this hotel but if I had paid more, I would have been less satisfied. Below is an overview: Location (all Pros) * Directly overlooks Freedom Tower, view from the restaurant is breathtakingly eerie * Using Airtrain, LIRR, and Line 1 to downtown on Subway, you can get here from JFK with under $20 in roughly one hour - perhaps less if you don't get as baffled by Penn Station, like I do - most people don't. Getting off at Rector St., you only have to walk about 3 small blocks to the hotel. * Neighborhood is quiet. Only drawback is most things close early since this is financial district. However, there is a small Italian restaurant/bar within walking distance with a low priced dinner menu - since not too many customers in the evening. Cleanliness * Pro: The hotel is clean and you can tell it's quite new. The rooms have that Ikea showroom feel and smell. * Con: The shower curtain had a few tiny hairs in it. Not pleasant, but this is common to anywhere. The room felt clean enough to take your shoes off in, but this was the only complaint I had about the cleanliness. Comfort * Pro: Had a desk and comfortable armchair for guests. Worth the price. IPod dock on nightstand - nice touch. * Con: Booked a room with a queen bed. Was traveling with a friend. It was definitely not a queen, slightly larger than a twin - luckily, we're good friends and both quite small. Service: Many of the reviewers warned about the service in this hotel. It seems to be hit or miss. 1) There are two entrances and seemingly not enough staff, which may have been part of the issue 2) Staff not always very helpful or clear: When I called to ask for an iron, the front desk gave a room number to retrieve the items from. After several attempts to enter the room number I was given, a staff member happened to walk by. I asked about an iron. The staff member reached over and opened A CLOSET directly across from the room I was trying to open. The closet was full of supplies, including irons and ironing boards. The incident was funny, but had someone been in the room I was trying to open, this could have been quite embarrassing. 3) Check-in: However, my friend checked us in before I arrived and stated that the man at the front desk was really rude to her. When I arrived, the person at the front was a woman who was very polite. Again, it seems to be hit or miss. 4) Restaurant: Don't bother. Went up for a few cocktails with friends later in the evening. The view was gorgeous, but there seemed to be one waiter on hand and he was wildly incompetent. He kept forgetting that we were there. Not rude, just seemed annoyingly inept. Overall review: * Don't pay over $150/night to stay here or you will be disappointed * Do stay here if it is only a few nights and you are traveling solo or only with one friend * Good for the bargain price, would stay here again solo", "Date": "March 15, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Syracuse, New York", "Title": "“Good value, very close to subway, clean and comfortable”", "Author": "salzanojl", "ReviewID": "UR125964931", "Content": "We stayed one night, booked at a discount site. The hotel is close to the rector st. station. Easy walk. Behind the WTC memorial site. The rate was very good, the room was immaculate. The restaurant was overpriced but there are several good delis and diner type options nearby ( George's was good breakfast choice) Check in and out was quick and painless. Bottle water on each floor was great and coffee/ espresso/lattes available in the lobby free of charge was nice and the quality was good. No complaints at all.", "Date": "March 11, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Sleep Quality": "4", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Washington DC, District of Columbia", "Title": "“It's good, but not outstanding”", "Author": "DDBSB", "ReviewID": "UR125681638", "Content": "Everything is very functional - it feels a bit like an European budget hotel. Room had an honest size, average bed and clean restroom. It looked somewhat newly built. On the downside, decor is very spartan, there's no minibar in the room and also no safe to keep your valuables/laptop. TV is small. Restaurant/bar on one of the top floors of the property has a nice view of Ground Zero, but menu isn't exactly inspired. All in all it's a good hotel, but not outstanding. I definitely would not give it four stars.", "Date": "March 5, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Southampton, United Kingdom", "Title": "“Lovely hotel next to WTC”", "Author": "boots_is_alive", "ReviewID": "UR125092320", "Content": "This hotel is right next to the WTC site - this may put some off at the moment as it can be noisy but then this is NYC so everywhere is going to be noisy ! The hotel itself is very modern and really clean throughout. There is free tea/coffee in the lounge area and free bottled water on each floor which is very handy. The staff are really helpful and very friendly - I don't think I passed any member of staff without them giving a friendly hello and the 'welcome back' every evening from the reception staff was a nice touch. The restaurant and bar on the 20th floor is certainly worth a visit for the fantastic views. I would say the rooms are on a par with new york/london/paris city centre size so not massive but certainly big enough. If we return to new york we will certainly use this hotel again as I think it would be hard to beat as an overall package of value/cleanliness/location and helpfulness of staff. Very nice hotel :)", "Date": "February 23, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "3"}, "AuthorLocation": "virginia", "Title": "“Wonderfu”", "Author": "meamaam", "ReviewID": "UR124670936", "Content": "We spent the holiday weekend in January in New York touring. I've been told this hotel is less expensive on the weekend, and that may be the case as we received a WONDERFUL rate compared to many other NY hotels. It is in the financial district, and not where we were doing alot of our \"tours\" - however it is SO close to the 9-11 memorial and it was on our list. For the rest, we were able to take the subway which is VERY close by & to head uptown only takes about 20 minutes. Our flight brought us into town very very early (7a.m.) -- they allowed us to check into the room @ 7a.m. for just a $35 extra fee - which was nice, we dropped the luggage off, used the restroom, washed up & had the rest of the day to spend in the city. The staff was very very nice - helpful with directions - and with our young daughter. When they noticed we had a small child they suggested a room away from the memorial side as it can get loud w/ the construction - how nice! There is plenty of bottled water, coffee (not just plain \"yuck\" coffee either) free every morning & a closet open to guests to grab extra pillows, towels, toiletries. We were thrilled with the value & experience at this hotel. Will go again for sure!", "Date": "February 16, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Montreal, Canada", "Title": "“Great Hotel”", "Author": "poohrose", "ReviewID": "UR123847505", "Content": "Really nice hotel with wonderful views. The price was really good for Newyork and very close to the subway . Restaurant was very good althou a bit on the pricy side. Loved the fact that they had bottled water available 24 hours.", "Date": "January 30, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Connecticut", "Title": "“Best Club Quarters I've stayed at”", "Author": "Reactor1966", "ReviewID": "UR123833175", "Content": "I've been to a lot of Club Quarters as part of my business travel. They are usually cramped rooms with very few amenities in the hotel, earning them the unofficial nickname \"Club Closet\". This one breaks the mold. The rooms are actually fairly large by NYC standards. The hotel is pretty new, so that's probably a big part of why it seems so nice. The lobby has a great lounge area, with cappuccino machine, newspapers, magazines, TV, internet stations and ample seating. On the roof they have an open and airy restaurant, which has a bar for the evening and breakfast buffet in the morning. There is also a rooftop patio to lounge in the warmer months, or just get a good view of the surrounding area. If you are planning to visit the 9/11 memorial, you can get much closer than this. In fact you can see the hotel in the pictures on the memorial website (http://www.911memorial.org/explore-memorial, it's the white building in the back left of the photo). Our room faced the memorial, which is lit up at night. I do strongly suggest visiting it, the tickets are free. If you are driving in, I suggest using the parking lot they are affiliated with, which is on Albany St a block away. If you \"self park\" it's $37/day, compared to the $50 or so at other garages. They will also bill the charge directly to your room. You can find the address for the garage on the directions page of the Club Quarters website. When you get there, it looks closed, but if you tell the guard you are staying at Club Quarters he will remove the various security measures and let you in. I probably shouldn't let out the secret, but unlike most NYC hotels, the room rate at the Club Quarters actually DROPS on the weekend. They get most of their business during the week from business travelers, and so the weekend is pretty dead. As part of their business model though your company needs to be a member in order to make a reservation here. But if you know someone whose company is a member, they can make a reservation for you. I'd definitely stay at this hotel again.", "Date": "January 30, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Manchester, United Kingdom", "Title": "“excellent great friendly staff especially the restuarant and bar”", "Author": "john4590", "ReviewID": "UR123611131", "Content": "Fantastic hotel , ive been on holiday here staying for 2 weeks leaving today , i couldn't recommend this more if i tried , lookin forward to returning next year", "Date": "January 25, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Loughborough, England, United Kingdom", "Title": "“Great location, clean, stunning views, perfect!”", "Author": "Sonnorcteer", "ReviewID": "UR123301677", "Content": "We got to the hotel not that early as we had a later flight, and the desk staff were still very friendly, checked in very quickly and went up to the room. The room itself was great, the bathroom was perfectly clean, with a great shower (always a bonus!). It had a little kitchen area, which we didnt use, but if you wanted a small meal everything seemed to work. The beds were comfortable, i slept on the sofa bed which was fine, the duvet slightly thin considering the weather, but it didnt bother me that much at all. The services were great, they had a lounge area downstairs with free coffee and tea, there was free water and ice for all guests which we used regularly, and also the restaurant which had fantastic views over ground zero and the new twin towers, meant we didnt have to queue for ages to see the site! The staff were friendly, similar to what you would expect in other american bars/restaurants, so slightly different to english culture but friendly none the less. The location, whilst it seems a little bit away from the whole midtown buzz, was actually not a problem. We were very close to the twin towers area (no building works heard ever, and we were on the 2nd floor!) so had that benefit, but also very close to a metro station which could get you pretty much everywhere you would want in new york. Plus we were really close to wall street/battery park/statue of liberty, so a great location overall.", "Date": "January 19, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "London, United Kingdom", "Title": "“Stunning views from ceiling to floor bedroom window”", "Author": "andrea60_2012", "ReviewID": "UR122790507", "Content": "Lovely hotel, its was very lovely to wake in the morning, no curtains drawn and to see the beautiful views & skyline in the morning and last thing at night. I couldn't complain of the price it cost to stay here because we where staying for New Years Eve 2011/2012 it was the cheapst, best location I found on line for this occassion. I really love the idea of having purified water (free of charge) available 24hours. Also great to see a microwave in the room in a New York hotel (I've stayed in a couple of NY hotel and I haven't seen this facility in the room) in a city hotel only in Florida hotel rooms. I found the staff friendly, I wasn't impressed of a 2min working microwave that I reported before going out for the evening just after landing, just to find out that on my return that the maintence man (took a look at it in my absence) but didn't swap it out for a working appliance. So the next day I had to call Housekeeping again to actually have the microwave replaced, that should have been on the 1st call that I made to them, me thinks. Anyway. Liked this hotel alot and really enjoyed the breathtaking views in the restaurant on the 20th floor. The breakfast was waaay to expensive and really not worth it, its so basic and over priced I can't remember the price but it was between $15-20 person. Very clean hotel, loved the ipod alarm clock- felt like home from home to me. Very close to tubestations, fast foods places and tube stations/subways Was pleased when I stepped in the room and flying from London and Very happy to be in New York for New Years Eve- it was GREAT! On a down side- Resturant across the road- Blue Planet Grill- Nice food, again expensive and terrible that they give you a 'recommended gratuity amount' approx i.e. $19.80, $23.80, etc. You tell them what you are prepared to pay in terms of gratuity i.e. IF I HAD TO PAY- I will pay the lowest, the Server blanks what I tell him and he gives me a sob story that the gratuity that he PICKED for himself goes to his him. Making my bill $164.94 now thats a lot of money for just 2 people!! I don't even give that tip amount to anybody that brings my food & drink to me in LONDON, ENGLAND Self Server selected tip amounts in US restaurants - expensive, wrong and greedy", "Date": "January 8, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Pittsburgh, Pennsylvania", "Title": "“A great hotel in New York”", "Author": "IcelandicQueen79", "ReviewID": "UR122675746", "Content": "My husband and I stayed here and had a great time. Our room overlooked Ground Zero. I know some reviewers complained of the noise, but we did not seem to notice it too much. The room was reasonably priced (for New York!), very spacious, and the amenities were great. There is a complimentary laundry room (you have to pay for the detergent and fabric softener) and free filtered water on each floor. The restaurant had a great view of the city. The front desk staff was very knowledgeable, helped us with directions to some of our destinations, and even found a pizza place that was open at midnight! We would definitely stay here again!", "Date": "January 6, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "4.0", "Value": "4", "Sleep Quality": "3", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Bournemouth", "Title": "“Fab View overlooking Ground Zero!”", "Author": "smenchie1", "ReviewID": "UR122643870", "Content": "We stayed in this Hotel over Xmas and New Year 2011. The hotel is very clean and new. We stayed on the 18th floor and had outstanding views of Ground Zero and downtown New York. The room was clean and fresh, and very spacious, and VERY comortable bed. Bathroom was a good size for 2 people, with a shower. Could have been a little hotter and more powerful, but didnt really matter. You get free tea and coffee all day from the machine in lobby which is lovely to start the day off. Also use of computers and WIFI and printers - very handy for boarding cards and entry tickets for all the attractions! The only down side to this Hotel is the noise from the building work on Ground Zero. They start at 6 in the morning and continue through till at least 10pm. If your room is overlooking Ground Zero you will need ear plugs if you love to sleep in! Complimentry drinks were offered because of the noise which is a nice gesture! Overall - if you dont mind being woken early this hotel is fab! Great location, with subway stations so close making it easy to get up town within minutes!!!", "Date": "January 6, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Toronto", "Title": "“Amazing view of Ground Zero!”", "Author": "Lee H", "ReviewID": "UR122004413", "Content": "I love NY, and I love staying in Lower Manhattan. I had a regular hotel I would go to until they closed for renovations recently... that's how I found the Club Quarters. Get a suite if you have more than two people, the price is fairly reasonable for an upscale NY hotel and you'll have an incredible view of Ground Zero. This was my second time staying here within the last 12-months and it's incredible to watch the changes going on. For the view alone, the hotel is worth it. Beyond that however you'll have a fully appointed suite with Queen bed and pull out couch, two TVs, iPod dock, kitchen, and everything else you'll need. Great for a family looking to save, or a couple people looking for a plush NY jumping point. With all the little extras they have like free waterbottles, great espresso and coffee, this is a can't miss.", "Date": "December 22, 2011"}, {"Ratings": {"Service": "2", "Cleanliness": "4", "Overall": "3.0", "Value": "4", "Sleep Quality": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Jacksonville, Florida", "Title": "“Good Value-Bad Attitude”", "Author": "SunDogandCompany", "ReviewID": "UR121783054", "Content": "This hotel is newer than the Club Quarters on Williams Street (Wall Street) and the rooms are larger. (I have nothing nice to say about that hotel.) For this part of New York City the room rate of $314 is a \"reasonable\" value. As I said the rooms are new and the furnishings are fine. The windows are tiny and in my room, only looked out into an air shaft. My business colleague staying in another room complained of the rooms feeling claustrophobic. I really like some of the things they are doing. They are trying to conserve water, which is a good thing in NYC. They have dual-flush toilets so you can select the flush that is most appropriate for the need. They have pure water dispensers in the hallways and plastic bottles that you can refill. Their top-floor restuarant offers a great view. The buffet breakfast there is \"only\" $16 and includes scrambled eggs, toast, bacon/sauage, fruit, juice, coffee, cereal etc. Better deal than the $24 for breakfast at the nearby Millennium. A major inconvenience was that one elevator was not working. It took over 7 minutes to get from the restaurant down to the lobby. What will cause me to avoid this hotel is the attitude of the front desk staff. They seem to have a real chip on their shoulder. No customer service skills. Check-in and check-out are self service so if you can avoid the staff you may have a better experience. But I will take my business elsewhere.", "Date": "December 15, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "middlesbrough", "Title": "“Fantastic !”", "Author": "petermckeone", "ReviewID": "UR121680129", "Content": "This hotel was a little out the way down in the financial district but it all added to the magnificent experience that is New York City. Statue of liberty was very close by, everything was just a subway journey away and the hotel itself was excellent. The staff were always very pleasant and polite. The bar staff were very good company and my girlfriend and i had a great laugh with them. There is a subway station 5 mins away, cafes, bars, restaurants, a main road that leads you bang into the middle of Manhattan. Perfect hotel for by far the best city on the planet. Take a bow", "Date": "December 12, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "3.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Shreveport", "Title": "“Room with a (amazing) view”", "Author": "windshop", "ReviewID": "UR121640348", "Content": "What a surprise. The W across the street was booked solid, so I booked this CQ and found it a terrific value and what a view when I went down for dinner. Looking right into the World Trade Center Museum site. Will go back again and again", "Date": "December 11, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "", "Title": "“Great service!”", "Author": "Khatter", "ReviewID": "UR121559318", "Content": "The staff was excellent and very helpful!!!! I thought the rooms were a bit small. What I really liked was the free bottled water on each floor and we could refill as much as we wanted.", "Date": "December 9, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "5.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Saint Paul, Minnesota", "Title": "“Great hotel...great location!”", "Author": "MacGregor892", "ReviewID": "UR121464811", "Content": "We stayed at the Club Quarters WTC from Dec.1-4th. Great location near Battery Park and the WTC Memorial. Very easy access to the uptown area via the subway. We were on the 6th floor right above the construction, and while there was some noise, it did not deter from the numerous positives of this hotel. Clean rooms and everything in perfect working order. All of the staff were very helpful and courteous. The free coffee in the lobby throughout the day was a major plus, as was the free access to the Internet. Have visited NYC many times, and can't imagine staying anywhere else. Bravo!!", "Date": "December 6, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "3.0", "Value": "2", "Sleep Quality": "1", "Rooms": "3", "Location": "2"}, "AuthorLocation": "Indiana", "Title": "“Construction Noise”", "Author": "Brandi A", "ReviewID": "UR121338572", "Content": "Cannot fault the hotel for the construction noise, but definitely request a room AWAY from the construction. We were on the 8th floor with a great view of the 9/11 Memorial, but the view does not trump the horrible construction noise that goes on all day and all night. I'm not sure what time they stop, but I'm thinking after 11p and it begins again bright and early at 6a. The construction is directly below this side of the hotel and they use a giant jackhammer attached to a Catepillar that goes on all night long. The hotel does offer a free drink (doesn't help someone who is pregnant) and earplugs (which you can still hear the noise with them in, the construction is so loud)! My husband had training in the financial district, but if he hadn't we definitely would not have stayed in this area. The hotel is convenient to the subway, Statue of Liberty, Wall St, Battery Park. Hotel staff was all helpful, had no problems with the hotel itself, but it should be discounted greatly with the construction going on! We had a 1 queen or king room but the bed is really 2 twin beds pushed together so there is a definite valley/bump in the middle of the bed, not the most comfortable. Will not stay at this hotel until the construction is OVER!", "Date": "December 2, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "4", "Rooms": "5"}, "AuthorLocation": "", "Title": "“great hotel”", "Author": "alexnz01", "ReviewID": "UR120977642", "Content": "stayed just one night and really enjoyed it. large room, no noise, free water bottles...whats not to love.", "Date": "November 24, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Baghdad, Iraq", "Title": "“Truly amazing experience”", "Author": "Billy C", "ReviewID": "UR120945516", "Content": "First and foremost, let me say this: If you aren't familiar with driving in NYC I would argue that you should NOT! We drove in from Syracuse, NY by way of Huntsville, AL and I will NEVER drive into the city again! Having said that, let me say, this hotel is a hidden gem in the jumble of NYC. When I checked in it was quick and efficient. My room had a view of the WTC site that was unbelievable. I actually cried. The hotel is just a few minutes from the subway stop and also located on the same block as the WTC 9/11 Visitors center. I would recommend this hotel to ANYONE who is coming to the city for their first visit or for a return visit! Definitely request a room with a view of the 9/11 site; while it is a little loud, it's NYC, and you can't beat that. Also, make sure you are staying on the Club Quarters side of the hotel. Not sure what the difference is, but is matters for the use of the elevators!", "Date": "November 23, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Greenville, South Carolina", "Title": "“Nice stay at Club Quarters”", "Author": "Dawn B", "ReviewID": "UR120275134", "Content": "We stayed at the Club Quarters this fall and had a lovely time. The rooms were the perfect size for the two of us. They were clean, nicely decorated, and comfortable. The hotel was in a great location to see the World Trade area and Wall Street. We would stay here again!", "Date": "November 7, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "", "Title": "“Excellent location to Financial District / WTC Memorial / Battery Park!”", "Author": "DLBroyles", "ReviewID": "UR120217028", "Content": "Basic but new and clean rooms. Great rates and very friendly staff. I love this hotel as it is dependably good! Two things though: 1) No hair conditioner 2) Bring earplugs because the construction on the WTC Memorial can be heard throughout the night (literally the entire night)", "Date": "November 6, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Binghamton, New York", "Title": "“Great location, water dispenser, complimentary drink, great view.”", "Author": "Cfedorick", "ReviewID": "UR119994199", "Content": "Very impressed with the view (rm 1516) and the purified water dispenser in the hallway was awesome. Coffee machine in the lobby brewed excellent coffee and the lobby was very relaxing. Room was decent size (queen with pull out love seat). Parking right next door. Subway real close as well as excellent breakfast nearby. Restaurant on 20th floor nice option. Complimentary drink was a plus.", "Date": "October 31, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Holliston, Massachusetts", "Title": "“Club Quarters Wall Street Location, NYC”", "Author": "PammyBret7", "ReviewID": "UR119964674", "Content": "I loved staying in this hotel, simple without a grandeous lobby, yet with all the amenities you'll need. Free coffee/tea/water in lobby, restaurant in the building, closet for extra linens and coffee bags ,and fresh filtered water you fill bottles yourself. Very clean. Greeted every time you walk in the building, close to shopping, subway right on corner, safe location. We upgraded to a suite, which was excellent: too rooms, microwave, dishes, refrigerator, two desks, free internet that came in fast and easy to load, big spaces. Bathroom very small, just for one at a time, but just fine. Room service people very friendly and accommodating. Even borrowed a pair of scissors from front desk; no problem.", "Date": "October 31, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "4", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Roanoke, Virginia", "Title": "“Excellent hotel”", "Author": "thaJack", "ReviewID": "UR119593964", "Content": "The customer I was visiting paid for the room through direct bill, and I\"m not positive how much it was. But, I am under the impression that it is very reasonable. The room was great. It had an LCD television, with a PC hookup (though the cable was broken on mine). Room had a touch screen climate control device and everything was very modern. If you needed anything extra (blankets, pillows, etc) there is a closet out in the hall and you just take whatever you want. Also, there was a machine in the hall that will fill bottles with purified water. It was very nice and I enjoyed my stay there.", "Date": "October 22, 2011"}, {"Ratings": {"Cleanliness": "5", "Overall": "4.0", "Value": "3", "Sleep Quality": "2", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Miami, Florida", "Title": "“Great Hotel”", "Author": "AnaSS121", "ReviewID": "UR119555168", "Content": "The hotel is located right next to the WTC, close to the metro and battery park. Its brand new, rooms are small but comfortable. Only problem is the construction which is 24/7, although on sunday they rest at night.", "Date": "October 21, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "3", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Jupiter, Florida", "Title": "“Very satisfied”", "Author": "drmakh", "ReviewID": "UR119495439", "Content": "Spent a weekend with my daughter. It was a good location for our activities, easy access to the subway and cabs. The staff was accomodating for our requests. Would go back again. The restaurant/lounge area had a great view and a nice happy hour. Even with the construction, if your room is on a high enough floor, sleeping is okay.", "Date": "October 19, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "4", "Overall": "2.0", "Value": "3", "Sleep Quality": "1", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Niagara Falls, Canada", "Title": "“Loud Sleepless Nights & Rude Staff”", "Author": "JessN909", "ReviewID": "UR119406534", "Content": "I am not one to complain about service or staff at hotels when I travel, but after staying at this hotel for 3 nights in mid-October with my girlfriends, I had to post a comment. Construction on the WTC ran 24 hours a day for 2 of the 3 nights we stayed there and we were not able to sleep whatsoever. It was VERY loud, I'm talking jackhammers, cranes and air horns ALL NIGHT LONG. When we talked to staff after the first sleepless night, they did not seem at all concerned about us and did not offer ear plugs or any apologies. They merely said that it should stop soon. After the second sleepless night, we spoke again to the front desk staff and they very rudely told us that 'once they start a project they don't like to stop until the job is done' and without even checking their computer, they said there was no other room that they could move us to. They then said that they could give us ear plugs if we needed them, but it was too late because we had already purchased our own! A staff member then proceeded to inform us while she was using her cellphone that 'they don't work on Sundays, so we can sleep in then' ... that pretty much sums up the (very poor) customer service that we received. This hotel is directly beside the WTC grounds, which we were aware of, however we were not aware that the construction would run all through the night. The hotel should be notifying guests that the construction continues 24 hours a day and staff should be acknowledging this major inconvenience to their guests and acting much more proactively to this issue. If you want a good nights rest, do not stay here.", "Date": "October 17, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Newport News, Virginia", "Title": "“100% satisfied, will go back!”", "Author": "klbrywry2", "ReviewID": "UR119149400", "Content": "My sister and I took a long weekend trip to the city and could not have been more pleased with the hotel choice! We had a standard room booked through Hotwire, 2 twin beds. From the moment of arrival to check out we were 100% impressed with the service, quality, accomodations, and location. Being next to the WTC memorial it was patrolled by NYPD round the clock, very safe and quiet area. There are many bars, restaraunts, etc within a block, right around the corner there is a taxi line at the Marriott (VERY CONVENIENT). The room had a modern \"IKEA\" feel to it, each floor had a customer supply closet unlocked for extra pillows, blankets, etc. along with a water machine and empty bottles for FREE, much needed after a long day shopping and/or night out. There is a 20th floor restaurant and observation deck/lounge. Would highly reccommend for business and leisure! I will return.", "Date": "October 10, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "4", "Sleep Quality": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "London", "Title": "“Good location and reasonably priced - but watch out for the noise”", "Author": "Susan8552", "ReviewID": "UR118942286", "Content": "I stayed here for a couple of nights on a business trip in early October. It is a great location for visiting the financial district, within walking distance of Wall Street and Broadway and reasonably priced compared with other hotels in this part of New York. The rooms are modern if a tad functional and basic. They are on the small side too, with only a shower (no bath) and a very small double bed. The hotel has good facilities, however - complimentary wifi throughout the hotel and free PCs/printers in the lounge, and a nice touch in the bedrooms with an ipod docking station built into the radio. Its greatest advantage though is its proximity to the 9/11 memorial site. Most rooms have a view of the emerging tower and memorial pools and there is a great restaurant on the 20th floor overlooking the whole site. This great advantage is also the hotel's biggest downside however - Ground Zero is basically a huge building site and the pile drivers start early in the morning and don't finish until late at night. So a reasonably priced hotel if you don't mind the noise.", "Date": "October 4, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Austin, Texas, United States", "Title": "“My stay @ Club Quarters World Trade Center”", "Author": "Raynel B", "ReviewID": "UR118718569", "Content": "I enjoyed most of my stay here.It was conviently located to Times Square and pubic transportation.Plus my room was clean.", "Date": "September 28, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Sleep Quality": "1", "Rooms": "3", "Location": "4"}, "AuthorLocation": "New York, NY", "Title": "“Nice hotel, rooms are efficiently laid out - however, WTC construction is loud”", "Author": "lcnyc123", "ReviewID": "UR118607845", "Content": "This is a nice hotel. The staff at the front desk is nice (though a bit hurried when I checked in b/c a ton of people -seemed like a convention - was checking in at the same time I was). The rooms are very efficiently laid out (NYC hotel rooms are small in general, but this hotel did a great job with the layout). Very nice touch with the free water bottles and filtered water on each floor! My only problem: WTC construction. My hotel room was overlooking the WTC site and there was construction going on from 6am - midnight. Not just a slight hum in the background, but full on jackhammering until midnight. Started again at 6am on the dot the next morning. I had a big day of meetings the next day and I was not prepared b/c I couldn't get any sleep. It would have been nice for the front desk to hand out ear plugs or something when I checked in. No mention from them whatsoever of the noise.", "Date": "September 26, 2011"}, {"Ratings": {"Location": "4", "Overall": "4.0", "Value": "5", "Service": "4", "Rooms": "4"}, "AuthorLocation": "Houston, Texas", "Title": "“It was what we were expecting.”", "Author": "Gabytad", "ReviewID": "UR118171493", "Content": "We stayed for three nights. It was new and clean. The room had a good size compare with others hotels in New York. Location was excellent for us, but too noise, there are a construction in front and they work since 7-12 so it's there when you are there, but it wasn't that bad really...They have a nice terrace and a restaurant with a nice view and service. It worked perfectly for us. I would come back.", "Date": "September 15, 2011"}, {"Ratings": {"Location": "5", "Overall": "4.0", "Value": "4", "Service": "4", "Rooms": "5"}, "AuthorLocation": "Evansville, Indiana", "Title": "“Excellent hotel”", "Author": "jodonahue", "ReviewID": "UR118033998", "Content": "Excellent location and close to the subways. The hotel is new and very nice. Nice and clean, and great value. Highly recommend.", "Date": "September 12, 2011"}, {"Ratings": {"Location": "5", "Overall": "4.0", "Value": "4", "Service": "5", "Rooms": "4"}, "AuthorLocation": "Atlanta, Georgia", "Title": "“Perfect”", "Author": "amitchella", "ReviewID": "UR118008919", "Content": "Another location I use when traveling to NY on business. Great location, easy access and pleasant views. The staff is always amazing and the rooms clean and comfortable. Subway lines are about a 5-minute walk and cabs are always in the area. I would wholeheartedly recommend this hotel to anyone for business or pleasure.", "Date": "September 12, 2011"}, {"Ratings": {"Location": "4", "Overall": "4.0", "Value": "4", "Service": "3", "Rooms": "4"}, "AuthorLocation": "Los Angeles", "Title": "“Decent Hotel”", "Author": "Springercrazy", "ReviewID": "UR118007075", "Content": "i stayed here at the beginning of August and found the hotel to be in a good location, but noisy. The rooms are a decent size for NY hotel rooms and the fact the internet was free and always worked was a plus. My problem with the hotel is that it's right across the street from Ground Zero and there is all kinds of construction going on. There is constant noise from generators and dozens of lights blazing at all hours.", "Date": "September 12, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "4", "Overall": "4.0", "Value": "4", "Service": "5"}, "AuthorLocation": "London", "Title": "“Great Location”", "Author": "suzi52", "ReviewID": "UR117719612", "Content": "The hotel is well situated, right across from the world trade centre site. We were originally assigned to a room on the 2nd floor, but this was going to be way too noisy with the construction. They moved us to the 11th floor - much quieter. The room is small but clean and comfortable, but we knew that from other reviews. Really enjoyed the free water refilling station on the floor and took full advantage of that. Free coffee and tea were available in the room as well as on the main floor lounge just off reception. We also enjoyed the view from the 20th floor viewing area and a nice relaxing cocktail before dinner. Staff was friendly and very accomodating. We would definitely stay at this hotel again if wanting to be in the lower part of Manhattan.", "Date": "September 5, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Location": "4", "Rooms": "4"}, "AuthorLocation": "Toronto, Canada", "Title": "“Good value”", "Author": "myfreckleface", "ReviewID": "UR117701997", "Content": "Overall, my stay at Club Quarters WTC was great. The location, while not in the thick of tourist activities, was convenient. Several subway lines are within 2-5 minutes walk. Despite what I'd read prior to my arrival, the area is not deserted at night. There definitely aren't crowds of people after dark, but there are several big hotels nearby, and enough bars and pizza/fast food places around that there were always cabs driving around and people walking about, even at 1:00 in the morning. The front desk staff were very helpful and professional. Housekeeping was similarly well-maintained, although the bathroom in my room did smell mildewy. I suspect this has more to do with the lack of ventilation and cheap shower curtain in the bathroom than lack of housekeeping. People who complained that their sheets weren't being changed must not have read the laminated card that was placed on the bed on arrival. If you want fresh sheets, you must put the card on your bed, otherwise they will simply make your bed with the existing sheets. This is clearly explained and certainly not unique to this hotel. Same thing applies for towels (leave them on the floor if you want fresh towels). We originally booked a standard room with queen bed, but upgraded to a much larger room with mini-fridge and microwave for an extra $20/night, and it was surprisingly roomy for Manhattan. The WTC construction really is 24/7, but we requested a room on a higher floor, on the opposite side away from the construction, and we couldn't hear it at all. We DID hear the elevators going all night long. Our room must have shared a wall with the elevator shaft and the walls are thin. I was also disappointed that there wasn't a safe in the room to lock up valuables. My only true complaint about the hotel, however, is with the restaurant. We went there once, for breakfast, and did not have a good experience. The food was fine, but I was not impressed with the service. The hostess did not crack a smile even once. She looked like she truly loathed her job. When we arrived, she offered us the worst table in the place. When I asked for a different table (one that wasn't in the middle of a nearly empty room, in the path of the main aisle used by the servers), she robotically brought us us to a better table and said, \"Here,\" before walking away. Thirty seconds later, a server came and told us not to sit at that table because we were only two people, and told us to \"sit there\", while pointing to a smaller table. We had the buffet, which was fine, however I was irritated to find that they tacked an automatic 18% gratuity on the bill, which I do not think is warranted for a buffet, ESPECIALLY since I had to flag someone down to get coffee and to get a menu, and since the bill was dropped on my table before we'd even finished our first plate. I took a small portion of eggs, not wanting to heap my plate with food and look like a slob, and intended to go back for some fruit, but I was so irritated when our \"server\" dropped the bill on the table when I was still eating (without asking if I wanted anything more), that I had to leave. The automatic gratuity was just icing on the cake. Aside from the restaurant, I'd return to this hotel in a heartbeat. Good location, helpful staff, convenient amenities, and GREAT value.", "Date": "September 5, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Amesbury, United Kingdom", "Title": "“Superb hotel, great for couples, loads more bang for your buck”", "Author": "Dan M", "ReviewID": "UR117701750", "Content": "We loved this place. The rooms were clean, modern and perfect for travelling couples. Location is great also if you don't fancy sitting on top on every main street in uptown NY. Subway is on the doorstep which will get you anywhere in NY you need to get to, price for the room is well worth it when you compare it to others in town. The roof top terrace is awesome whether your using it for the restaurant or just for some good photos etc. The club quarters has the best coffee and its all free both in your room and reception. There are chilled bottles of water on every floor which is great when your heading out for the day in the city. Overall this place well exceeded our expectations and if were ever coming back to NY and the price is the same i'd be back here in a flash!", "Date": "September 5, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "4.0", "Value": "5", "Service": "3"}, "AuthorLocation": "Boston, Massachusetts", "Title": "“Clean - but a bit far from the main city sites”", "Author": "TriciaTravels", "ReviewID": "UR117390933", "Content": "The hotel was very clean, the staff was somewhat helpful but all in all I wouldn't stay that far away from the main part of the city. My family and I took cabs everywhere but it took a good 20+ minutes to get to the main areas. There is always the option of taking the trains but we stuck to cabs. Price was good and a nice view but take in mind location.", "Date": "August 29, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "4.0", "Value": "5", "Service": "4"}, "AuthorLocation": "Miami, Florida", "Title": "“Loved it! Highly recommend staying here!”", "Author": "JJ811", "ReviewID": "UR116784929", "Content": "The location of this hotel was great. All of the \"hot tourist spots\" in NYC were easily accessible by subway from the hotel (or short cab rides), yet it was not in a bustling and crowded area, which made it a nice, quiet place to come back to and relax after a day of sightseeing. There were many restaurants and bars close by to choose from and they were all merely blocks away. There was also plenty of sightseeing to do in the Financial District area of the hotel (Wall Street, 9/11 site, St. Patrick's Cathedral, etc.), although the area around the hotel is a little dead on the weekends. Considering that it was a 4 star hotel, the rate we paid was such a steal. We didn't want to pay a lot of money to stay right in Times Square, and the cheap hotels were too far out in areas like Queens, Bronx, or Long Island, so this was a bargain considering how nice it was and the area. The room was very spacious. There was plenty of room for 3 of us girls to move about, with all our bags, suitcases, clothes strewn about, in addition to the 3 mirrors and overabundance of outlets, which was nice when we all got ready at the same time. We had a queen size bed and a pullout couch, both of which were very comfortable. The filtered water bottle machines on each floor, free coffee/tea/hot chocolate, and internet room/lounge were great amenities that the hotel provided. Also, I recommend having a meal at the restaurant or drinks at the terrace, both on the top floor, as the view was beautiful to look at while enjoying food and drinks. I really have no complaints about this hotel, except that it was tricky to initially find, but if you ask any businessman or police officer, they can direct you right to the hotel. All the staff were incredibly friendly and helpful (except for one man at the desk who was a little rude). While many people complain that it is literally overlooking the World Trade Center construction, the noise was never a problem, as we were not in the room for a majority of the day. By the time we returned, they were done. If you think you will be affected by the noise, request a room that is not facing the construction. We had a room on the opposite side and we couldn't hear anything.", "Date": "August 16, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Location": "4", "Rooms": "3"}, "AuthorLocation": "", "Title": "“Cheaper than the average, ok location”", "Author": "Sid247", "ReviewID": "UR116563725", "Content": "Rooms: not the biggest, but thats the norm in NYC. They are all like serviced apartments. A nice feature of the hotel is to offer filtered cold water bottles on every floor. Location is right opposite the trade centre and not noisy at all. The hotel has a nice rooftop bar on L20.", "Date": "August 11, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "4.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Montreal", "Title": "“clean, affordable and a few xtras!”", "Author": "Single_in_MTL", "ReviewID": "UR116451019", "Content": "great stay. very clean modern hotel located in front of ground zero. it is very affordable for manhattan and a decent alternative to staying in midtown. bonus: the hotel includes bottled water and coffee. will go back for sure. the only downside is the water pressure in the shower was bad.", "Date": "August 8, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "4", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "London", "Title": "“Great views”", "Author": "ryan_knapton", "ReviewID": "UR116449470", "Content": "Stayed in a corner room on the 18th floor and the views were spectacular! Two of the four Walls were glass windows, one looking towards Wall Street and it's skyscrapers, the other looking out south towards the bay and the Verrazano-Narrows Bridge. At night the lights are so beautiful. Of course the one view is of the construction site at the WTC, but that high up we didn't hear any noise. The hotel has a great enclosed rooftop bar, friendly staff, clean modern rooms and great downtown location. Couldn't have asked for more.", "Date": "August 8, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "4", "Overall": "3.0", "Value": "5", "Service": "3"}, "AuthorLocation": "flourtown", "Title": "“Nice amenities but small and know that there is construction late into the night”", "Author": "jlcollier", "ReviewID": "UR116274984", "Content": "Got a great deal money-wise here and the construction was noisy but it ended by midnight. This hotel is in a great location and it was very meaningful to see the area and to be able to run along the harbor at night.", "Date": "August 4, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "", "Title": "“The Best Hotel In NYC-amazing price!”", "Author": "Danitay", "ReviewID": "UR116262617", "Content": "I stayed at this hotel last weekend. It was one of the cheapest hotels we could find in NYC so when I saw the nice photos and 4star rating, I thought I would show up and be disappointed. But the hotel was exactly like the photos. The staff was super helpful and courteous. I have paid double the price for hotel n NYC and was not nearly as happy with the quality of my stay. Love this hotel!", "Date": "August 4, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Toronto", "Title": "“Excellent price and Location”", "Author": "Elisa08", "ReviewID": "UR116255227", "Content": "My Husband went to NYC for 4 days over the long weekend and really doesnt need or require much of a hotel , since he spends most of his time out . However he was delightfully pleased . The location was quite central and easy to get around to wherever you needed to go . The rooms were spacious and very clean and the bed was super comfortable( no bed bugs here ! ) The complimentary ice cold filtered water that was available on every floor was a really great touch . It was scorching in NYC the last weekend in July and since my husband likes to walk everywhere HE loved being able to take water with him every day as he was heading out into the heat . Front desk staff was very helpful andhe had no worries about leaving his luggage and purchases at the front desk when he checked out. This included a large Gucci bag with a pair of boots for me which really could have easily gone \" missing \" . His flight was not until 8pm and check out was at 11am . His luggage and parcels remained with them all day and obviously nothing was taken or even messed with . Lastly I wanted to make a comment re the World Trade Centre construction , many people have written that the noise was un bearable but my husband was not bothered by it at all , He said that yes you could hear them in the morning but he wanted to be up and out of the hotel by 9am anyway and as for the evening and nighttime to sleep , they stopped working so he was able to get as much rest as needed . Overall it was a great experience. Tip : NYC can get quite pricey to eat . My husband found a fantastic place to eat j, a cafe just around the corner from the hotel called Arome . He ate there every morning ....because for $3 , he got a made to order custome Egg White only , veggie omelette with 4 peices of Toast and coffee or tea ...THATS RIGHT I SAID $3 !!! Now how can you beat that ?? Also they serve a Breakfast Buffet and had what looked to be quite a nice Lunch Menu .", "Date": "August 4, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "4", "Overall": "4.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Baltimore, Maryland", "Title": "“Yes, we really loved it and we will return very soon”", "Author": "yourpersonalteacher", "ReviewID": "UR116123717", "Content": "We selected Club Quarters World Trade Center due to its location. We were curious to see \"Ground Zero\" and its development since 9/11. We were pleasantly surprised with the level of our accomodations, especially since this was our first trip to New York City in quite awhile. Our room overlooked the construction on \"Ground Zero\". The noise associated with the construction was very minimal. The room was virtually sound-proof. Our suite was exactly what we need, since our 17 year old grandson accompanied us to New York. He had his own room within the suite, and we had our privacy. We felt very secure. The food on the 20th floor was more than we expected. I would recommend this hotel to anyone who wanted a great place to stay, while in New York. The hotel is very close to the subway, which is very convenient for those who move about via subway.", "Date": "August 1, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "3", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Philadelphia, PA", "Title": "“Shocked at how nice this hotel was.”", "Author": "fischman44", "ReviewID": "UR115930268", "Content": "I'll admit it, I wasn't expecting much from this hotel. I booked at the last minute and found a good rate, so thought I would give it a try. I was extremely pleased with the room. We booked a suite for a great price in NY and had a room overlooking the work at the WTC. Sure, there was some noise but what a wonderful location and everyone understands why they are working so hard to rebuild these towers (or they should). Room was beautiful and all brand new. I stay in NY alot and this is my new favorite!", "Date": "July 28, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "3", "Overall": "4.0", "Value": "4", "Service": "4"}, "AuthorLocation": "Louisville, KY", "Title": "“Nice Surprise”", "Author": "pick6king", "ReviewID": "UR115737138", "Content": "I was put up in this hotel by a mid-town hotel that overbooked. I was pleasantly surprised. Rooms are of course not huge, but were exceptionally clean. Free internet worked great. My room overlooked the WTC monument construction site, and it was a little noisy. Seems like they settled down around 10pm and picked back up fairly early. Not a deal killer, but you should be aware. However, it's NY, and you are basically just trading normal street noise at other hotels for the construction noise. I had never stayed downtown before. I found it cleaner and more vibrant than expected. There was more going on, more people, and more opens restaurants than I thought there would be. Red and yellow subway lines are just a couple of short blocks away. The \"guest closet\" storing the irons, coffee supplies, etc., might be viewed by a pain as some or chic by others. No big deal either way. Would stay again.", "Date": "July 24, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Surfers Paradise, Australia", "Title": "“First Class for Great Price!”", "Author": "holidayers007", "ReviewID": "UR115709633", "Content": "We got this hotel from the Mystery Quick. Hotel was lovely! Restaurant was nice. Staff was friendly. Hotel was new and had great amenities. They had discounted parking available near by.", "Date": "July 24, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "4", "Overall": "4.0", "Value": "4", "Service": "4"}, "AuthorLocation": "Toronto, Canada", "Title": "“2nd time at this hotel”", "Author": "cmo_matsuk", "ReviewID": "UR115667414", "Content": "The first time we stayed here we booked without knowing the name of the hotel, and it was a great surprise.The 2nd time we were with in-laws, so preferred to go for a place we already knew. The hotel is super clean, organized, brand new. We could walk to the WTC, Century 21st, Battery Park and (longer walk) Brooklin Bridge. The only con is the closest subway station - Rector st. - is served by only one line, so it can take a while. But I'd rather stay here again than at an awful hotel at Times Sq.", "Date": "July 22, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "2", "Overall": "3.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Weirton, West Virginia", "Title": "“Great NYC views but very noisy”", "Author": "cindyfawn", "ReviewID": "UR115405370", "Content": "The hotel was nice with fast and efficient self service check-in, quick delivery of room service, and comfortable room. The only issue with the World Trade Center location is the 24 hour construction to prepare for the September 11 ten year memorial opening..... It was very noisy and hard to sleep but truly the view was almost worth it.....", "Date": "July 15, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "4.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Durham", "Title": "“Great Hotel, Would Recommend”", "Author": "ali34", "ReviewID": "UR115336972", "Content": "I stayed here with my husband, two kids and my parents for 3 nights. When we arrived at the hotel there was a little confusion with the booking which was made through booking.com. They could not find the reservation but they sorted this out very quickly. As they were not expecting us the family suite we booked was not ready until 4pm. This was not an issue as we put our luggage in my parents room which was a very small twin. We arrived back at reception at 4pm but the room was still not ready. The lady on the desk was very apologetic, and as the company we booked it through had not sent the booking through to them I was hardly in a position to complain as they had found us two rooms on a Bank Holiday Weekend without any problem. The receptionist allocated us another suite on a different floor. Oh I was so glad she did, The room was amazing. Double bed with flat screen TV at the bottom, in from of that was a double sofa-bed with a flat screen in front of that. A small dining room table at the side with a kitchenette. Spotless compact bathroom. The room was cleaned to a very high standard. On every floor there was complimentary water stations with bottles for you to take away.The best part of the room though was a huge rap around balcony, amazing views of the New York City skyscrapers. The hotel is literally on Ground Zero. A very humbling experience to say the least. The hotel offers a complimentary cocktail in the bar to say thank you for supporting the businesses around the area which was a nice touch, you also get a plan of intended site. I understood that the building work at Ground Zero was 24 hour, when I seen how close we actually were to the site I was worried. I needn't have been as they do work through the night but no heavy equipment is used. They are very noise conscience. I did not hear anything for all 3 nights we were there. All in all, we had a great stay and would recommend.", "Date": "July 13, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "4.0", "Value": "5", "Service": "4"}, "AuthorLocation": "Baton Rouge", "Title": "“Loved this place and rested very well each night of our stay!”", "Author": "aftkel", "ReviewID": "UR115140623", "Content": "My 14-year-old daughter and I just spent 4 nights at Club Quarters World Trade Center. We enjoyed our stay and would highly recommend it to anyone traveling to NYC. We had a club-size room with a queen bed on the 12th floor. It was the quietest room I have ever stayed in! The bed was extremely comfortable, and we thought the linens AND the pillows were very nice quality. Loved having the very large thermostat near the bed; TV was nice and big; there were two sets of drapes (a sheer with room darkening drapes). Never saw the maids, but our room was always tidied up very nice! Water cooler on the floor always had cold water (I had seen complaints from others about this, but we never had a problem!) Coffee downstairs was good, and it was nice to have access to 4 computer terminals to retrieve my e-mail. Never a wait to do this. People at front desk were always friendly and very, very helpful and knowledgeable about the subway. We had a cocktail and appetizer on the 20th floor terrace one evening around 6:00, and this gave a wonderful view of the WTC construction site. I find this sort of thing fascinating. Yes, when you're on the terrace, there is some noise from the construction. The men and women are working 24/7 to get the job done. This is history in the making, and I was kinda proud to be on hand to see that. I hope to be back at Club Quarters for another visit very soon. I think the management is doing a fantastic job!", "Date": "July 7, 2011"}, {"Ratings": {"Cleanliness": "2", "Sleep Quality": "3", "Overall": "2.0", "Value": "2", "Service": "3"}, "AuthorLocation": "Charleston, West Virginia", "Title": "“Could have been a good place, but...”", "Author": "wishfulpig", "ReviewID": "UR114851310", "Content": "1. The room was minimal - in size, in decor, in cleanliness. 2. Had to secure iron and board from the \"guest\" hall closet each day. 3. Glasses/Cups and coffee not replenished each day - could obtain coffee from closet... but the one time in four that we attempt this, there was one coffee available. Inconvenient location, unless your stay is focused on the financial district. Hotel did have a strong sense of safety.", "Date": "June 28, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "4", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Allentown, Pennsylvania", "Title": "“Great spot...we will be back!”", "Author": "PANancyM", "ReviewID": "UR114735561", "Content": "This is a very cool little hotel. Rooms generous by NYC standards and quite the bargain. Yes construction continues at WTC site but we came in and asked to switch to a more rear facing room. ALBERT at the front desk was SO nice and accomodating to our needs and he switched us right away. KUDOS to him! We had a few noisy neighbors who came in very late and had to sit on the terrace of the room (only they could access it) but it was not that bad. Overall, this is a very clean, modern property with lots of green touches I(free water, free internet) that really make it worthwhile. We have always stayed midtown but I think we will stay here again on our next visit.", "Date": "June 25, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "1", "Overall": "3.0", "Value": "4", "Service": "5"}, "AuthorLocation": "Cambridge, United Kingdom", "Title": "“Very Good in many ways - but oh! - the noise”", "Author": "bigmarty", "ReviewID": "UR114649913", "Content": "The noise of jack hammers and drills from the World Trade Centre building site at the front and the grinding noise from air conditioning fans on a nearby building at the rear spoils the visit. Very helpful staff. The superior rooms with kitchenettes are well equipped but a little odd as they are 35ft x an average of circa 12 ft. To get to the hotel you have to negotiate blocked off streets because of the building work. Good price if booked in advance but take ear plugs.", "Date": "June 22, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "3", "Overall": "4.0", "Value": "4", "Service": "5"}, "AuthorLocation": "haddonfield, nj", "Title": "“Good Hotel at Ground Zero”", "Author": "kt3", "ReviewID": "UR114625030", "Content": "My family (infant, wife and myself) stayed here last weekend. The hotel seemed more spacious than the CQ Wall Street and the staff was very helpful in arranging a crib for my son and giving me a Time Out New York magazine when I asked where the nearest store was that sold TONY. Hotel has slightly discounted parking just around the corner, but you need to remember to ask the staff for a sticker/stamp to show the parking attendant. It is at the southern foot of the WTC site and construction begins at 6 AM and finishes at 11 PM per the front desk staff. Make sure to ask for a room away from the noise. We did and it was still relatively noisy, however we had our own noisemaker in our room, courtesy of my son, who tried to drown out the ambient noise several times during the evening. The nearest subway stop is about a 5-10 minute walk and you can catch the PATH train as well nearby. West Side Wwy is one block away so cabs were easy to catch. Free Wifi in the hotel was nice.", "Date": "June 21, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "4.0", "Value": "5", "Service": "5"}, "AuthorLocation": "NEW YORK", "Title": "“Exactly what I was looking for...”", "Author": "SAKY10", "ReviewID": "UR114587536", "Content": "I am from NYC and I just needed a reasonably priced hotel in the city so I could go out and not have to drive back to Long Island. The hotel's entrance was on a dead end street (due to the WTC construction) and a little difficult to find but that was the only unexpected thing... The rooms were small but they were just as the hotel website described. The room was clean and modern...and I thought the recycled water bottles offered in the hallway were pretty cool and \"green.\"", "Date": "June 20, 2011"}, {"Ratings": {"Overall": "1.0"}, "AuthorLocation": "Columbus, Ohio", "Title": "“Avoid this hotel like a plague”", "Author": "Sri19", "ReviewID": "UR112858134", "Content": "I stayed in this hotel in May 2011. There are many things wrong with this hotel a) The staff is rude and incorteous. They act as if they are doing you a favor by giving you a room.They are unhelpful except possibly one front desk person b) They do not change linens though we told house keeping repeatedly c) The noise on the construction outside starts at 3 AM in the morning and only stops at Midnight. So if you planning to sleep in this hotel forget it. d) Fitness center is awful. The have age old machine which are broke", "Date": "June 12, 2011"}, {"Ratings": {"Cleanliness": "1", "Sleep Quality": "1", "Overall": "1.0", "Value": "1", "Service": "1"}, "AuthorLocation": "Boston, MA", "Title": "“Do Not Stay Here”", "Author": "Brandie_in_Boston", "ReviewID": "UR111897262", "Content": "What a disappointment. I was in NYC to attend a conference in the area. I do not normally stay in this part of the city and when I tried to book at the Club Quarters - Wall Street it was sold out. Seeing how close CQ WTC was to CQ WS, I booked there instead. What a mistake!! Like many others on this site the first room I was offered was only a pull out sofa bed. When I called to complain I was told that was what I booked. I was swtiched for a higher nightly charge to a different room. This room was bigger (1803), but was simply not clean. There was a large stain on the carpet by the bed on the floor. Near the desk there were food crumbs on the carpet which remained there all three nights. Oh and to boot, construction was 24/7 on the WTC site. The hotel should be letting people know this when they book. I totally understand that the construction is necessary, but people should be aware of what they are getting into. In fact, when I called the front desk to ask about it on the first night I was told it would stop at 11:00 pm. It simply did not. Stay somewhere else - at all costs.", "Date": "June 6, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "2", "Overall": "3.0", "Value": "3", "Service": "5"}, "AuthorLocation": "Chicago, Illinois", "Title": "“Everything But The Bed”", "Author": "sportsandboobs", "ReviewID": "UR111856281", "Content": "After having an insane day of losing my I.D. & getting lost in the 59th St subway station, I arrive to my room only to find...a let-out sofabed? Flat-screen TV? Check Nice kitchenette? Check Space-age Thermostat system? Check Awesome wooden decor & sliding bathroom door? Check So with everything in the room being from the 21st century, why was my bed from 1983? The mattress was as hard as the bed of nails ninjas train on, trying to get in and out of it was a task cause of the metal railings. And let's not start with the sofa cushions \"hiding\" underneath the bed portion. If you book here do NOT book the City Kitchenette because you will be disappointed.", "Date": "June 6, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Toronto, Canada", "Title": "“A beautiful hotel in a great location”", "Author": "lisamichaels", "ReviewID": "UR111313274", "Content": "I took my 13 year-old daughter on a special long weekend trip. I wanted to stay in Manhattan, but all the other hotels in this price range had shared bathrooms and were in much older buildings. This brand-new. hotel was beautiful, with helpful staff and a great location. It was less than a 5 minute walk to at least 3 subway lines, which made getting uptown super easy. And less than 5 minutes to Battery Park. The rooms are a touch small, but sparkling clean and well suited, with comfy chairs for end-of-the-day lounging. There is free wifi and computers and printers in the lobby as well. There is a top-floor restaurant and sun terrace, which we only discovered on our last night - too bad, as we would have spent our evenings up there! The only drawback is that it's right behind the World Trade Center reconstructions and one morning we heard the machinery very early. I will stay at this hotel again in a heartbeat and highly recommend it.", "Date": "June 3, 2011"}, {"Ratings": {"Sleep Quality": "1", "Overall": "1.0"}, "AuthorLocation": "Toronto, Canada", "Title": "“No Bed!”", "Author": "danielleharris", "ReviewID": "UR109731398", "Content": "After a pleasant stay at this hotel last year, we booked again in April 2011. THERE WAS NO BED in our room! It was literally an uncomfortable pull-out couch (made up to look like a bed). Terrible! After a very angry phone call, we were transferred to another hotel. Will not be staying here ever again.", "Date": "May 24, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Oklahoma City, Oklahoma", "Title": "“Decent”", "Author": "ShawnMcGraw", "ReviewID": "UR107830906", "Content": "This hotel was nice. It is right next door to the World Trade Center site. The only downfalls were that my bathroom had a bad mildew smell to it and that you could loudly hear everyone talking / closing doors in the hallway. The rooms were tiny.", "Date": "May 11, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "3", "Overall": "1.0", "Value": "1", "Location": "3", "Rooms": "3"}, "AuthorLocation": "", "Title": "“Non-Military Friendly”", "Author": "bryanrocks", "ReviewID": "UR104850321", "Content": "I called in at 3:30 the day before my reservation to cancel. I talked to Mike and informed him that I was just informed that I had mandatory pre-deployment training for the next day. He informed me I had to cancel by noon and I was 3 1/2 late. I asked him if he could waive it since I had nothing to do with my plans changing. He informed me that he had to charge me the full nights rate. To me that is horrible customer service. I gave a 26 hour notice and I had no control over this. I will make sure to spread the word about this hotel being non-military friendly.", "Date": "April 20, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "4", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Montreal, Canada", "Title": "“Amazing find in NYC financial district.”", "Author": "evamaria2011", "ReviewID": "UR104652276", "Content": "Checking in is quick and the security is high (you can use elevators with your room card only) The single rooms are on the small side, but two people have enough space to walk around. Intelligent room organisation and quality technology. The washroom like the room is on the small side, but perfect ! The location is great: it's FAR from Times Square, but if you're there to discover NYC in 4 days+ than youreally ought to get a weekly pass OR by tickets as you go. Therefore, you're gonna use the metro anyways and there are stations nearby and the ride is quick! So the locations is IDEAL if you don't want to be in the middle of it all and want a GREAT deal and clean one too! What made me happy as a customer is the fact that we had access to bottled water and coffee at all times on each floor! IT's the little things that hotels can do that show 'thought' was put in towards customer care. We also had a view of ground zero and it was bitter sweet ... I also recommend going and having the All American buffet breakfast (but it will cost 36$ with the 18% included gratuity). But do it once and enjoy the view and the good food (meat, eggs, coffee, juice (e.g. orange with pulp! :D, ceareal, yogurt, fruits, pancakes, American syrup, potatoes, continental pastries). Visit St-Paul's chapel, it was dedicated to help the volunteer workers working on ground zero. You can also walk to the ferry that brings you to the statue of liberty :)", "Date": "April 19, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "2.0", "Value": "2", "Location": "5", "Rooms": "1"}, "AuthorLocation": "", "Title": "“What kind of hotel room has NO BED!!!”", "Author": "ReglrTravlr", "ReviewID": "UR103974680", "Content": "Seriously, my room had only a sofa bed. No real bed. Horrible. Shame on you.", "Date": "April 14, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Victoria, Canada", "Title": "“Good Value Option”", "Author": "RSR74", "ReviewID": "UR102936013", "Content": "Got a room for $85 US per night from priceline for a couple of nights stay at the end of March (2011). The room was small but reasonably well appointed and very clean. There was no in-room safe or mini fridge, but the bed was comfortable, I had ample towels, and a reasonable amount of closet space. The location is adjacent to the ground zero construction site and Wall St and Battery Park (Statue of Liberty ferries). There is also a subway station a 5 minute walk away on Rector Street. I actually walked all the way up to Central Park (up to 76th st......I think) and it took me just over an hour. With the nice weather I had it was a great way to see the city. Be aware that there is some noise from the construction site starting fairly early in the morning until 5pm-ish. If you're not an early riser or don't wear ear plugs (like I do) it may bother you a bit. When I did remover my ear plugs one night I could hear the guy in the room next to me snoring. I don't know if that means the walls were thin or this guy was just abnormally loud. Free high speed wi-fi, complimentary coffee and tea in the lobby every morning, and filtered water with plastic bottles provided on each floor was a nice touch and the front desk staff were very professional, helpful, and efficient. This hotel was quite a good value.", "Date": "April 5, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Location": "4", "Rooms": "4"}, "AuthorLocation": "", "Title": "“Efficient and Clean”", "Author": "Grande2305", "ReviewID": "UR100860910", "Content": "Really nice surprise. Very clean and European on style. Restaurant overlooks WTC -- very emotional. I will certainly go to any CQs. Love the free bottled water.", "Date": "March 20, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "5", "Location": "4"}, "AuthorLocation": "atlanta ga", "Title": "“Absolutely the best value in New York City....”", "Author": "mikeonderon", "ReviewID": "UR100620657", "Content": "I never do this, I never write a hotel review in the middle of my stay but the Club Quarters deserves something very different. First I typically stay at 4/5 star hotels, The Ritz Carlton, The Intercontinental etc, we stay there for the service, few will ever offer service like the Ritz Carlton or The Four Seasons. The service at The Club Quarters is good, efficient, courteous. The hotel is in excellent condition, new, nicely appointed, the rooms are spotless, modern and spacious by New York hotel standards. The lobby coffee area is vibrant and comfortable, 30 chairs with internet, free coffee, tea and a fire. This is the perfect hotel for New York City, less than a block from the Rector Street subway station and close to food, Battery Park and The Hudson River, Statue of Liberty, Ellis Island etc. FOR THE PRICE THIS HOTEL IS A STEAL.", "Date": "March 18, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "3", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Mumbai (Bombay), India", "Title": "“Nice Clean Compact Rooms Located in the Heart of Wall Street”", "Author": "akdangra", "ReviewID": "UR99215298", "Content": "Club Quarters is located right across the street from NYSE and Wall Street. Close to WTC and metro links. Rooms were clean, though slightly on the smaller side - sufficient for one person; particularly business traveller. The staff is good and helpful (though the desk staff is not the most curteous you will find) in arranging for cabs and answering general queries. Pure veg food is hardly available in the restaurant but there a number of veg restaurants (incl. Indian) around the hotel.", "Date": "March 7, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "New York City, New York", "Title": "“Better than the Ritz !!”", "Author": "SonaRishi", "ReviewID": "UR98813285", "Content": "The WTC Club Quarters is the BEST hotel I have ever stayed at - HANDS DOWN ! The customer service is of the highest caliber. They treat you with kindness, warmth and professionalism. For over a year every week I stayed there and it was always the ONE thing I was looking forward to. A quiet, clean, advanced technology oasis in dowtown Manhattan. After a long hard day I ALWAYS know I can go \"home\" to friendly people who are there to help me relax, enjoy and decompress from my day. In fact I have nick named the hotel \"BLISS\". They have great rates for luxury service and rooms !", "Date": "March 3, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "3", "Sleep Quality": "3", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Dublin, Ireland", "Title": "“Great view, but expensive”", "Author": "Bosseler", "ReviewID": "UR98576865", "Content": "We stayed in the hotel during our New trip for one night for a price of $300, so you can expect a lot. The hotel is located at Ground Zero and is easily reachable by different train stations. Check in was smoothly and really fast by friendly staff. Rooms were spacious, clean and without Bedbugs, which can be seen as an important feature in New York. Highlight of the hotel is the rooftop restaurant, which offers a great view on Ground Zero. This extraordinary view is definitely worth the price because the other hotels are at least on the same price level, even higher. All in all great hotel!", "Date": "March 1, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Toronto, Canada", "Title": "“Reasonably priced, no frills Business option for NYC”", "Author": "jason416", "ReviewID": "UR97780089", "Content": "Situated right beside the World Trade Center and a short walk from the subway, Club Quarters provides a comfortable option for business travellers on a tight budget. It is efficient, clean, new and ideally located close to Wall Street. I recommend it for those doing business in the area. My opinions and recollections below are based on a 2-weeknight stay for a business conference which was about a 10-minute walk away. Check-in and check-out are efficient as they can be done on a self-serve basis on the terminals provided. Upon check-in you swipe your VISA and out comes a receipt with your room number and rate information and with the help of the receptionist your room keycard is quickly setup and you are on your way. Elevators are right beside front desk and to the left of the elevators is a business centre. Keycard swipe is required for the elevator to function which is expected and appreciated from a security standpoint. In the main lobby of each floor is a unique feature, with that being a station where you can fill up provided sealable water bottles for future use at a machine that dispenses filtered water. I had a standard room. Decor is very much like an office building like other individuals mentioned. Very narrow but clean and new; furnishings look well put together and honestly the style seems as if it was determined via a joint venture between Ikea and Umbra. Amble closet space with a few hangers (including one for delicates) plus shelf space, washroom was basic - shower only, stainless steel sink with granite top; toilet comes with small/large flush; hand soap, body bar, shampoo and mouthwash all provided. Two towels, a hairdryer, and two glasses but no further amenities beyond these must-have items. Vanity mirror outside the washroom. The work station is convenient; glass countertop with wooden trim. Coffeemaker, dining menu, plus a few useful books (dictionary, Steven Covey's First Things First, The Book of Lists, Inside the Apple), phone, retractable desk lamp and flat-screen Philips TV. The neatest thing was the monitor cable which allows you to watch what's on your laptop on the screen. Only one free plug though beside the coffee maker. There is a sofa chair and lamp beside the bigger-than-King-size bed which turns out to be two twins put together, plus a huge wooden headboard with two night lights on each side. A large framed photo presents itself opposite to the bed, and to the right is the window. Room 427 doesn't have much of a view, but others do have a great view of WTC from what I understand. Noise from the construction outside was not an issue. I was beside the laundry room and could not hear it. You can hear the sound of people rolling away the laundry so if you're a light sleeper that might be a problem. But not for me. Can't comment on the fitness facilities but they are available and on the 6th floor. There is a dining room on the 20th floor as well. Didn't eat at the restaurant so can't comment on that either. If I was here for business again I would definitely stay here. If I was here as a tourist and ran out of options in cooler areas of the city, i would not. However, given the location, Chinatown and the East Village are quite close and if you wanted to, the Statue of Liberty is also near by. Not ranked higher for good reason, but it doesn't mean this isn't an appropriate option for those with similar needs to mine for this given trip.", "Date": "February 24, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "new haven, ct", "Title": "“Pleasant surprise”", "Author": "sullific", "ReviewID": "UR90418587", "Content": "We stayed once before in Club Quarters midtown and I was not impressed, especially with the non-existent service. When we got this on Hotwire and it turned out to be a CLub Quarters again I was disappointed. However, I was proven wrong... The hotel is difficult to find because of the WTC construction site - it sits directly next to it, and even though I knew the area relatively well and GPS said we were a tenth of a mile away it took forever to find it because of closed sidewalks, etc. So know before you go... When we arrived after two hours of searching I was whining and when it said \"Suite Upgrade, $40.00\" on the counter my fiance asked for it and the girl (perhaps because of me) gave it to us for $15.00. We had a very large room for NY, with kitchenette and table, bed area, hall with bathroom and a sitting room overlooking the ground zero site (not the happiest of views, but historic). Kind of an awkward layout but comfortable. The room was clean and quiet and, unlike at the midtown location, there were people to help when we needed washcoths, Splenda, whatever. Decor is all light woods and translucent panels, easy on the eyes. The hotel also has a restaurant on the roof which overlooks the Hudson and downtown (and as they out it \"the rising Freedom Tower\") where they had a decent breakfast buffet on weekends (a la carte during the week). The restaurant has an indoor area, nicely elegant without being uber-chic, and an \"outdoor\" enclosed area. It was enjoyable. For the money paid this was a very good hotel experience. Surroundings were replete with coffee shops etc. and subway is a two-block trek (just be sure you get off at Rector Street to avoid the construction nightmare!).", "Date": "December 21, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "3.0", "Value": "5", "Sleep Quality": "3", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Mexico City", "Title": "“Average Stay”", "Author": "wagamamawonderings", "ReviewID": "UR90315831", "Content": "Having pre-paid more for an upgraded room with a kitchenette, the room was very small and the \"kitchenette\" was not what was advertised in pictures. Depending on the room, a kitchenette is nothing more than a coffee maker, a mini-fridge, and a countertop. We were told a full kitchenette was two upgrades higher than ours. Also, if requesting a king-size bed, it is merely two twins pushed together. Disappointing was the lack of cleaning. The bathroom tiles were dirty from the time we arrived to the time we left. Also, mildew buildup in the shower. I suppose that's what is meant by eco-friendly: your room only gets a superficial cleaning. Perks of the hotel are free laundry and detergent, free water, and free internet. Not sure, though, if these perks would bring me back to Club Quarters.", "Date": "December 20, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Pasadena", "Title": "“Great hotel at a great price and close to several subway lines”", "Author": "RJDTravels", "ReviewID": "UR87421001", "Content": "I was in New York City on a business trip and stayed here for the weekend when my business trip ended. When I have to pay for a hotel, I tend to look for high quality good value for money properties and Club Quarters ALWAYS fulfills that requirement. I was more than pleasantly surprised by my accommodations. While the bathroom was on the small side, there was still ample space to work with. I found the desk space area to have plenty of room for my laptop and takeout food and I really liked the room set up. Granted the rooms are on the smaller side, but this is excellent value for your money and the room was very comfortable. Let’s face it, it is New York city folks! The city is your playground and your room should be someplace sleep, shower and well you know the rest. Club quarters provides a nice respite, good location, security, and great value for your money.", "Date": "November 17, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Toronto", "Title": "“Sleek new hotel adjacent to WTC”", "Author": "lwwylam", "ReviewID": "UR87100251", "Content": "I spent two nights at the Club Quarters WTC with a colleague in a twin-bedded room which faced away from the construction site. Although it was possible to hear some slight noise from the street and from the hallway, it was not enough to be disturbing. The Club Quarters concept is an attractive one for business travelers. The Club Living Room at this location, with a fireplace, large screen tv and multiple computer work stations along with comfortable chairs, was a welcoming place to take advantage of the free internet and printing access. The room was reasonably spacious by NYC standards, immaculately clean and comfortable, with contemporary design and convenient amenities. The Guest Request closet, which makes it possible to help oneself to extra pillows, blankets, or coffee supplies, is an especially nice touch, as are the chilled bottled water dispensers on each floor. The bar/restaurant on the 20th floor is quite nice, with excellent food and drinks. The view of the WTC construction site from the 20th floor terrace is stark and powerful.", "Date": "November 14, 2010"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "SW Wales", "Title": "“Very helpful staff”", "Author": "carallangennech", "ReviewID": "UR85589799", "Content": "Great for visiting Ellis Island/Statue of Liberty and ground zero but not close to shopping or theatres so awkward to go back to rest before evening out. Subway 5 min walk though and very safe to use but chaotic 8.45-9.30 am and 4.45-5.30pm. On our only visit, Restaurant staff rude. desk staff very helpful and friendly and knowledgeable if you smile and say hello! Our room overlooked the memorial construction site but the noise was only bad when you opened the window. No taxi driver knew where the hotel was, shame, as they were very reasonably priced. Town car to the East village $25. Room was very comfortable", "Date": "November 1, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "3.0", "Value": "5", "Sleep Quality": "5", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Denver, Colorado", "Title": "“Great value for NYC but off the beaten path”", "Author": "Mnree7", "ReviewID": "UR83490210", "Content": "Good value, but off the beaten track I stayed at the Club Quarters at the Trade Center for 3 nights and I would recommend it because of the value. I am originally from NYC and was back for a visit-- it is in an area that is hard to get to and always a cab or subway away from where you probably want to be. Also, it is VERY hard to find as it is on a dead end street that borders the World Trade center. It is close to Wall Street and Battery Park though, and pretty much deserted at night. Once the Freedom Tower is built, I am assuming the price of the hotel rooms here will shoot up, and there is a rooftop restaurant that looks into the WTC site. It was creepy to see people drinking martinis and eating dinner while viewing that, but once the construction is done that will change. The hotel itself is new and nice,although you can tell it was once an office building turned hotel, as the hallways are narrow and the rooms are tiny. I originally had a room where the window opened up onto another person’s balcony which I found that strange, but they immediately gave me the keys to another room. Overall, if you are looking to save money and don’t mind staying in a remote area or taking public transport everywhere, this is a modern and clean hotel", "Date": "October 14, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Mumbai", "Title": "“A World Trade Center Experience I’ll never forget!!!!”", "Author": "mrali52", "ReviewID": "UR83337380", "Content": "The hotel is in a non exit street, so you have to walk like three minutes to get to the street... Overall the hotel is very clean and I was really satisfied. The price was a little high.... Great service and fast checkout. Has a lot of restaurants just blocks away and even the subway station is close. I loved the decoratipn and the view of the terrace is priceless... It was worth every penny!", "Date": "October 13, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Sleep Quality": "1", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Windsor, United Kingdom", "Title": "“Good hotel - bad staff”", "Author": "LAwindsor", "ReviewID": "UR83294736", "Content": "I went with my other half for a 5 day break. The hotel is good, clean and safe. The staff however where a great let down. They where rude, moody and just not very helpfull at all. I am quite light sleeper and found the noise from the building site very hard to deal with. It goes on all night, even thought he staff promised it would stop at 10. The airconditioning is also rather loud. All in all, no help from staff when this was mentioned.We where offered a downgrade, as we where in a suite, to a standard room on the other side of the building, but no refund or any other help. After picking up some earplugs from a local shop, the sleep was better. There is water on every floor with bottles which is quite handy, but make sure you take a bottle when you see one as we only saw them on the first day and never where filled up untill we left. There is also a guest cupboard on every floor with extra pillows, blankets coffee etc. Same goes for this, when you see something you need grab it as they dont fill this up either. The restaurant staff seemed more interested in chatting with each other than helping and became rude when the tip was inadequate. I didnt feel the need to tip seeing as i had to order and pick up my drink from the bar myself! The view is spectacular as it is overlooking the ground zero site. As more people have said its a bit of a mixed feeling sitting on the rooftop with a cocktail overlooking this. There are quite a few metro stations around, and its very close to the staten island ferry, wall street and battery park. I think this hotel caters more for the business guest, than leisure and would therefore suggest you stay more uptown to get the best service. When taking a yellow cab, tell them its the old Club quarter hotel, just around the corner from the Mariott downtown. Otherwise it will be hard for the cabbie to find the hotel.", "Date": "October 13, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "London, United Kingdom", "Title": "“Similar to other club quarters”", "Author": "Meagen_S", "ReviewID": "UR82078040", "Content": "Decent rate for New York. Was able to book in for 5 nights with less than 24 hours notice due to another hotel reservation cancellation caused by a bed bug infestation. Reception staff dealt well with confusing requests from my extended family despite it not being a full service hotel. Construction noise could be bothersome but why go to New York and spend your day in a hotel room? Construction noise stopped during evenings and nights. I would have preferred to stay in Midtown simply because of location but being able to stay here was a relief as I could depend on a level of quality without having to do further research.", "Date": "October 4, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "London, United Kingdom", "Title": "“Perfect Business Hotel for World Trade Centre”", "Author": "MattTripper", "ReviewID": "UR81859627", "Content": "I spent 5 nights at the Club Quarters WTC for business and when i first walked into my room i thought wow this is small. However the room had everything i needed with free wi-fi which was essential for me. As others have said before the work going on around the hotel did start early in the morning but i was already up for work & enjoying the fantastic view from the breakfast terrace. I would recommend this hotel if in WTC area for business but on any leisure trip i'd book a hotel in midtown for a better location to explore", "Date": "October 2, 2010"}, {"Ratings": {"Service": "2", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "3", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Kelowna, Canada", "Title": "“new hotel, very clean modern rooms, needs security for women travelers.”", "Author": "tobad", "ReviewID": "UR81282956", "Content": "I liked the hotel over all even with the noise from ground zero rebuild. Actually found that nice to see after all these years but could be disturbing to some people. Hotel staff OK but not really into it's clientel. Some nice amenities like the botled water station. Not much ssecurity for women travelers as no one at front desk some times and easy access to stairs. Common ..maybe you could install a security access at the entrance like the one in the elevator. ..using your room key maybe? Otherwise clean, great rroftop reasonable dinning and the best value in NY this year.", "Date": "September 28, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "3", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Hallandale Beach, Fl", "Title": "“Very well located and spacious for New York”", "Author": "Mixbag65", "ReviewID": "UR80529330", "Content": "A fair price; a nice, clean and spacious room with everything we needed. The A/C unit was a little old and rickety, noisy, but it worked. Also, the wall insulation seemed somewhat thin, as we could hear everything going on in the hallway at a very early hour. The location is superb if you wish to be in the financial district.", "Date": "September 21, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Toronto, Canada", "Title": "“Average Hotel at Decent Price (for NYC Standards)”", "Author": "PatrickCA15", "ReviewID": "UR78803132", "Content": "Stayed at this hotel over the Labour Day weekend. Definitely would not be my first choice, but was able to get a good price ---especially for Labour Day weekend--- so I couldn't pass up the deal! The location is not great as it is just south of the World Trade Centre, and there is construction going on right now to rebuild the World Trade Centre. It is a bit far from everything, but due to the availability of taxis and the extensive subway network, it was not too bad to get around. The hotel itself is only 2-3 years old, so everything is fairly new & in working order. There is complimentary wi-fi throughout the hotel, so that helps! There is also a filtered water dispenser on each floor. The rooms are quite small ---which is to be expected, as it is NYC. But not much to complain here as we were only in the hotel to sleep in. There is no parking at the hotel, but there is valet parking on the side street (Albany St), which is somewhat costly ($45 USD for a 24-hour period). Overall, I don't recommend it at this time because of the location & the construction for the World Trade Centre. The construction is scheduled for completion in 2013, so may be it will be better then. But of course, the prices will probably be higher as well.", "Date": "September 8, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "2", "Overall": "2.0", "Value": "2", "Sleep Quality": "3", "Rooms": "3", "Location": "5"}, "AuthorLocation": "London, Canada", "Title": "“NOT worth the money”", "Author": "brookssus", "ReviewID": "UR78067818", "Content": "In the 5 nights we were there our bathroom floor was NOT scrubbed ONCE, the shampoo and soap was NOT replaced (thankfully we had brought our own). There was water bottles and filtered water but by 1100hrs each morning the water bottles had not been replaced so we were forced to have to buy water. No parking, no off load zone. Parking around the corner was $175.00 for 5 days. Even though I had talked to the hotel a couple of times to verify logistics they never ONCE informed me of a $40.00 PER DAY charge for incidentals. So on top of $900.00 for the hotel plus $175.00 for parking they then wanted in excess of $200.00 for incidentals. I say NO WAY--enough was enough. There was no continental breakfast included....everything you needed or wanted you had to pay for. There was a \"fitness centre\" and both treadmills did not work leaving just a creaky eliptical and an exercise bike. It should never have advertised it as a fitness centre.", "Date": "September 3, 2010"}, {"Ratings": {"Service": "2", "Cleanliness": "5", "Overall": "3.0", "Value": "5", "Sleep Quality": "1", "Rooms": "5", "Location": "4"}, "AuthorLocation": "toronto", "Title": "“Great value. Noise will prevent a good sleep.”", "Author": "soloToronto", "ReviewID": "UR75448483", "Content": "If you don't mind the noise this is a great bargain hotel. The rates will jump dramatically when the construction and deconstruction is done. The construction speaks for itself. This will be ongoing for another 5 years but in the immediate future it's the deconstruction that created the most noise. As per my photographs the 40-story tower adjacent to the hotel that was badly damaged by the events of Sept. 11, 2001is being cleaned and deconstructed systematically from the top down. Dumping concrete and twisted girders in dumpsters all day long is deafening. The deconstruction efforts started every day, besides Sunday, at 07:30 AM. Don't plan on sleeping in. I did have trouble checking in. I pre-paid a Suite. I questioned why my reservation had me reserved in a Studio. The person at check in told me to disregard the term Studio? When I entered the Suite it was indeed a Studio? I called down to explain my dilemma. I was told they would try to get me a better room. I didn't want them to do me any favors, I just wanted them to give me what I pre-paid for. Anyway, to make a long story short I got my Suite but not without some \"discussion\", for lack of better words. In summary the hotel as it sits today is in a construction zone and the rates reflect that. If you don't mind the noise it's a diamond in the rough.", "Date": "August 16, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "2.0", "Value": "4", "Sleep Quality": "3", "Rooms": "2", "Location": "3"}, "AuthorLocation": "London", "Title": "“Meh”", "Author": "ItinerantLondoner", "ReviewID": "UR72304219", "Content": "Stayed here on a business trip because the usual accommodation was full. CQ seems to have cornered the market in doing the bare minimum in acceptability to ensure corporate bookings. Everything can be endured - but there is nothing that makes your stay pleasant. - Water pressure was like showering under a tap - All the lighting in the room was halogen/fluorescent - a bit like trying to relax in a sunbed. - The restaurant/bar was more like an extra-large bedroom and lacked any kind of atmosphere or ambience that would have made it pleasurable - but this didn't stop them enforcing a dress code. - If you're travelling on business (especially alone), a half-decent room service or restaurant/bar makes like a lot easier, especially on the night you arrive. I ended up at the marriott next door. - TV only half-worked in the channels you could get. If you're not planning to spend any time in your room other than to sleep this is probably not a bad option. It is clean and efficient but gives nothing more (assuming the location works). If you're a business traveller who values a decent shower and somewhere to retire to for a couple of hours - possibly also to work - it's not great.", "Date": "July 25, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "3", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "2", "Location": "1"}, "AuthorLocation": "Dublin, Ireland", "Title": "“Don't stay here...”", "Author": "Shep48", "ReviewID": "UR71204409", "Content": "This hotel has to be one of the worst hotels I've stayed in ever if only because it is perched adjacent to the rebuild site of Ground Zero. This wonderful show of determination in the face of greatest adversity and tragedy has the unfortunate knock on effect of causing sleepless nights - this is night 2 of a planned 3 night stay and I have already booked another hotel Midtown to escape the frustration and upset of not being able to get a night sleep due to the constant construction work. This is Friday night into Saturday morning and the construction continues... The rooms are small, clean and the hotel tries with guest laundry facilities and plentiful water to all as well as internet facilities. But the staff are not very present, and it's such bad value at any price if it's a nigh sleep you're after. I'd never recommend it and I'll take the hit on having to pay for the 3rd night without actually staying...", "Date": "July 17, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Boca Raton, Florida", "Title": "“Great Value”", "Author": "ray1green", "ReviewID": "UR67939452", "Content": "Stayed here only because the Downtown Club Quarters gave my room away. Yes, when I checked in they said my room with 2 twins was being cleaned. After lunch I came back and was told I had a new room with 1 queen. Once I explained this was not ok and a pretty long argument they put me in a cab and took me to the WTC Club Quarters. What an upgrade. Brand new room, great location and free breakfast. I believe that will only last until the outdoor area is open. The place is ready and is really nice. For the money you cant beat it. Clean, modern and easy to check in/out. Next time I would just book WTC and avoid Wall Street.", "Date": "June 18, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "3", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Indiana", "Title": "“Quality hotel, even with construction”", "Author": "donkey31", "ReviewID": "UR64765102", "Content": "We stayed here because we're from the midwest on midwest salaries ;) So paying an NYC rate for a room is murder to the wallet! But we managed to stay for $199 a night for 3 nights and thought we got a lot for our money - a clean room, clean bathroom, nice closet, free WiFi, free breakfast (even though it was probably only for a short time since they're under construction and they didn't even have tables!), etc. What I didn't particularly like was the fact that our room was facing out down a small hallway with a direct line to the elevator. Since the walls are pretty thin and / or the acoustics in the hall are a little scant, we would be woken up by people congregating in the hall waiting for the elevator. Anywhere else this wouldn't be a problem, but if I were to stay here again, I'd request to NOT be by the elevator. That really is the only complaint I have about the place. Even the construction and lack of breakfast tables didn't bother me! You might be far away from things in Midtown, but the subway is only about a block away off Rector. We had no problem taking the subway uptown to hit all of our touristy stops. We really did nothing downtown but walk around the WTC area. I recommend taking this hotel up on its low rates right now, because it's a high quality facility and rates will probably sky rocket once everything's done!", "Date": "May 19, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Dundee, United Kingdom", "Title": "“Good for a short stay in NYC”", "Author": "so3003", "ReviewID": "UR64047237", "Content": "My girlfriend and I stayed at Club Quarters WTC for a few nights at the end of April, at the start of a holiday in the US. It's in a prime location right over the site of the planned Freedom Tower / 9-11 memorial in Downtown Manhattan. We booked a studio suite through Hotelclub, but when we checked in the first room we were given was a standard room, so they moved us to a studio room. To be honest, there was very little difference between the two room types, and if anything their website is a bit misleading when it infers the studios are much bigger rooms - have a look at my photos to see what I mean. Despite the above our room was fine, definitely spacious enough for two people, and in addition to the Queen bed there was a separate desk, microwave, fridge, flatscreen TV etc. The bathroom was a decent size, though the toilet-roll holder fell off the wall on the first day! Decor, furnishings etc were very clean and modern. As others have mentioned the hotel is still under construction, though really you're only aware of this if you 1) see the signs about this in the lobby or 2) meet the workmen in the hallways. We bumped into some one morning and it turned out the room next to us was being \"installed / built\", but we really weren't disturbed at all by the work. The construction work means there's no hotel restaurant, so the hotel provides a free buffet breakfast in one of their meeting rooms - very good selection of muffins, cereal, fruit juice, coffee etc, and the inclusion of breakfast was what made this a super good deal in New York. They didn't do room service, but instead offered a delivery service from local takeaways to your room. The club \"living room\" area of the hotel is very well appointed, and is a significant positive for this hotel. There are computers with colour printing, and a dedicated \"boarding pass\" computer/printer every morning to get your lastminute documents before heading for the airport. In terms of hotel location it's right in the heart of downtown, only a couple of minutes walk from Battery Park (and ferry to Statue of Liberty), not too far from the Subway, and being next to the WTC site makes it a good landmark for taxis, airport buses etc to aim at. I'd go back to this hotel, though next time I'd probably just book a standard room.", "Date": "May 13, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "5", "Location": "3"}, "AuthorLocation": "Delaware", "Title": "“Great hotel, fantastic rooms, odd breakfast set-up”", "Author": "Conomo", "ReviewID": "UR61211192", "Content": "Stayed here for one night and loved the downtown location & rooms. They have floor-ceiling windows, wonderful new amenities, very tech saavy and environmentally conscious. This hotel will probably sky-rocket in price once the construction ends. The only odd thing was breakfast - it was a fantastic, fresh continental selection, but there were no tables for eating. The hotel provided boxes to \"takeaway\" your meal. So, we toasted our bagel, scooped fresh fruit, poured good coffee and juice and then, returned to our room to dine. The hotel is still without a restaurant. Also, the parking deal $25/day with a local garage is fantastic for NYC. I recommend and will go back without hesitation.", "Date": "April 13, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Boston", "Title": "“Very pleasant stay with very good amenities”", "Author": "Trav3l1er", "ReviewID": "UR61158607", "Content": "I stayed at this hotel for 2 nights while I attended a conference downtown. The location worked very well for me as the conference was right by the New York Stock Exchange, and was a mere 5 minute walk away. While the hotel is under construction, they are offering a nice continenta; breakfast spread. There is also a managers reception/happy hour in the evenings offering beer wine and cheese. The value of the room at just over $200 was good for the area and I was very happy with the room. I got a corner room on the 15th floor which had a flat screen tv at the foot of the bed with cables to hook up a laptop or other video source via component cables. There was another tv at the end of the small workspace which could be viewed from the table or from the easy chair which could convert to single bed. There was also the added benefit of both a microwave and small fridge. There are filtered water machines in the halls with water bottles that you can fill up for your day of sightseeing. The fitness room was adequate with 3 treadmilIs, free weights, an adjustable bench, eliptical and 2 other machines? The first floor has a number of workstations which you can use to check email, surf the web, and they even have a color printer you can print to. I was a little disappointed that they hit me with a $35 early check in fee, but oh well.", "Date": "April 12, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "melbourne", "Title": "“Very Good Hotel after bad 1st experience”", "Author": "aussietraveller1960", "ReviewID": "UR60881805", "Content": "On checking in found that despite booking studio room was provided with a standard room. As hotel was full and we were returning we were offerred an upgrade on our return which was honoured but was not a great 1st experience. Being relatively new the rooms are in excellent condition. The space in the studio was awesome. As currently no restaurant a free breakfast is provided. This has great variety. Hotel has good access to the subway. Being in Lower Manhattan there is not a large range of dining options. Location is very quiet.", "Date": "April 10, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "London", "Title": "“Fantastic Hotel”", "Author": "himpantsou", "ReviewID": "UR60524378", "Content": "I have just got back from staying 3 nights at Club Quarters. I arrived at 12pm and left my bags as check in was not until 3pm. When I came back to check in after dinner, I pleasantly found my bags had already been taken up to my room. I booked a standard room and was given a superior corner room on the 17th floor with amazing views of the Brooklyn Bridge, downtown Manhattan and the river from 3 corners. It really was breathtaking. The quality of furnishings was very high with thick cotton bedsheets, thick blackout curtains and nice towels. There is also unlimited bottled water in the hallway. There was no noise at all from outside, I had a view of the World Trade Center and could not hear the construction work going on. Service was excellent. The concierge were very happy to book tickets for you for theatre, Empire State etc and they charge a $2.50 admin fee or you can book yourself on the free computers they provide in reception. The printers really came in handy as I was able to print out maps for my walk abouts. The only downside I found was breakfast and the reason why I have marked it down by 1 star. It really was chaotic. Breakfast is served in a side room near reception and there are no tables so you have to eat from polystyrene plates off your lap. There is also not a lot of choice. They had cereal, muffins and bagels. The rest of the hotel made up for the poor breakfast. Sunday - Thursday they have beers, soft drinks, cheese & salami 5-7pm which was nice to come back for a small rest before dinner. Overall, this hotel was fantastic and I would happily stay at any Club Quarters again.", "Date": "April 6, 2010"}], "HotelInfo": {"Name": "Club Quarters World Trade Center", "HotelURL": "/ShowUserReviews-g60763-d1595302-Reviews-Club_Quarters_World_Trade_Center-New_York_City_New_York.html", "Price": "$208 - $327*", "Address": "<address class=\"addressReset\"> <span rel=\"v:address\"> <span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">140 Washington Street</span>, <span class=\"locality\"><span property=\"v:locality\">New York City</span>, <span property=\"v:region\">NY</span> <span property=\"v:postal-code\">NY 10006</span></span> </span> </span> </address>", "HotelID": "2514715", "ImgURL": "http://media-cdn.tripadvisor.com/media/ProviderThumbnails/dirs/98/7f/987ffdeaab7b4a87493af03bbf189bd84large.jpg"}}