{"Reviews": [{"Ratings": {"Service": "1", "Cleanliness": "4", "Overall": "1.0", "Value": "1", "Sleep Quality": "2", "Rooms": "3", "Location": "1"}, "AuthorLocation": "Newport UK", "Title": "“Best?! Don't Make Us Laugh!”", "Author": "Joe K", "ReviewID": "UR127208936", "Content": "We booked to spend a weekend here, having stayed in a Best Western hotel in Paddington before. Unfortunately, this was not up to the high standards we experienced there. Despite having paid fully in advance the staff were adamant we had to pay at reception, which entailed wasting an entire morning on the phone trying to sort everything out in the absence (typically) of a manager. The room was okay but the bathroom was no bigger than a cupboad with a malfunctioning shower and no fan so the room quickly filled up with steam. Equally the TV and hairdryer both failed to work on arrival. Further we found ourselves placed next to the elevator shaft with the wonderful nighttime accompaniment of whirring and banging noises. Breakfast was acceptable but the staff hovered uncomfortably around us the whole time, with grim stony faces constantly asking if we needed coffee and literally chucking toast at us every five minutes. Overall it was a clean hotel with a decent breakfast but terrible staff who treated you more as an annoyance than as a guest. We won't be returning.", "Date": "April 3, 2012"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Overall": "1.0", "Value": "2", "Sleep Quality": "2", "Rooms": "1", "Location": "3"}, "AuthorLocation": "UK", "Title": "“Nothing \"Best\" about it”", "Author": "NeedaholidayUk", "ReviewID": "UR127130330", "Content": "This room was booked for me for overnight business, shame. Take note, Google maps locate it very close to Victoria station - it is not, go for Pimlico tube or enjoy a walk along Belgrave road. Reception were polite and efficient but tried to get me to buy breakfast as an add on, which was clearly included in my pre booked room, but they were having none of it. Third floor room. Very compact (as often expected for London terraced property hotels). Depressing dark orange and blue decor - tired although at least not dirty. Shower room was relatively new, but the sink was so tiny I could barely wash my hands, let alone brush my teeth. I can only imagine having a shave would be tricky. The shower had two settings - hot and burning hot. The room was overheated (window wide open all night) in March, so a hot summer night would be unpleasant. Thin walls so very noisy and not a good night. I would probably have considered booking this myself based on other reviews - having now been there, I would never go back! I have done MUCH better for £130 in the centre of London before!", "Date": "April 2, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Sleep Quality": "4", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Bijapur, Karnataka, India", "Title": "“Nice Hotel”", "Author": "kkdas", "ReviewID": "UR126725577", "Content": "I was in Best Western Corona on 17th and 19th March 2012. The front office is very cooperative & helpful. The single room where I was staying is small but descent. The breakfast was good and adequate. But there was no restaurant and bar. This is needed.", "Date": "March 27, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Manchester, England", "Title": "“Basic but Good”", "Author": "PaulandJoanne_10", "ReviewID": "UR125544904", "Content": "Stayed one night, 28th Feb 2012. I am a user of Best Western hotels world wide and try to use them whenever possible, as I have always been satisfied (except once) with what they provide as trademark for quality. This hotel was what it sys it is, and just satisfied us for a small room, fairly decetly priced, with no frills. Not happy that all we had in room 306 was hot water in teh toilet sink, absolutly no cold water whatsoever. For cold drinking water one has to request a jug of it or buy in bottled water. mind you I am no lover of Londons 'hard' water anyway so try to avoid drinking it from a tap anyway. All in all, a good clean room, good service, a really decent breakfast the next morning with plenty of choice. Staff were friendly. Check in and check out was rapid, no problems whatsoever. If all you want is a room that provides a bed and roof over your head, this is the place.", "Date": "March 3, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Maidstone, United Kingdom", "Title": "“A brilliant hotel right near the city centre and a very good price”", "Author": "Neese12", "ReviewID": "UR124700494", "Content": "all of our concerns/niggles picked up from reading other reviews were groundless. Friendly helpful staff, a lovely clean, quiet, smart and freshly decorated (small but nice) room, comfortable bed, plenty of hot water, large shower (bathroom in general maybe a tad cosy but what they hey), good breakfast and an easy walk to and from Victoria station and all at a VERY reasonable price.What more could you ask for? We would definitely stay at the Corona again", "Date": "February 17, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Gilbertsville,", "Title": "“Clean, employees very nice”", "Author": "Barbara C", "ReviewID": "UR123277184", "Content": "We spent a week here while vacationing in December, 2011 from Kentucky( United States ) The room was clean and everyone was very nice and polite. We enjoyed the breakfast every morning there and the ladies were very helpful. We would stay there again. Thanks", "Date": "January 18, 2012"}, {"Ratings": {"Service": "2", "Cleanliness": "2", "Overall": "1.0", "Value": "1", "Sleep Quality": "2", "Rooms": "1", "Location": "3"}, "AuthorLocation": "Colchester, United Kingdom", "Title": "“Extremely disappointing”", "Author": "Davie D", "ReviewID": "UR121800222", "Content": "There is no way to describe this hotel other than as substandard, and for £130 a night (for a double room in which you'd struggle to swing a cat) I expected at least to be able to have a nice cup of tea or glass of water in my room, but alas, in the 21st Century, we have an English hotel where you're not recommended to drink the water. Even boiling it produced rather grim tasting tea that didn't make me feel so good. In fact, in a bored moment, I read from the folder in the room that no one ever reads, and it is stated there that guests shouldn't drink the tap water and should either buy bottled water or ask reception to bring a jug of drinking water to their room! If this were the only problem here, it wouldn't be so bad. There is next to no tv reception on the next-to-knackered tiny portable televisions that were possibly bought 25 years ago, the shower (where you just about break your neck coming out of it as the shower, toilet and sink are all rammed into a tiny room) hardly worked, starting warm then cold then warm then cold then off, the heating wasn't working, you can hear just about any noise outside the room as the walls are thin, the bed just about had the springs coming out of the mattress, the breakfast was very basic, with the coffee unpalatable, and the whole place was soulless and more like a poor bed and breakfast place than a branded hotel. I haven't stayed in a Best Western hotel before, but I'll avoid them like the plague in future. I have to say that I stay in London on business on a regular basis and, although London hotels are variable in the extreme, you can do a lot better than this place, especially in this price range. I wasn't even paying the bill for this one and still felt ripped off!", "Date": "December 16, 2011"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Overall": "3.0", "Value": "2", "Sleep Quality": "2", "Rooms": "2", "Location": "3"}, "AuthorLocation": "Leeds, United Kingdom", "Title": "“Small but ok”", "Author": "abbymorgan", "ReviewID": "UR121062104", "Content": "i stayed here while on a recent work trip to london, i stayed in a double room alone and thank god i was alone no way a couple no matter how much they love each other could share a room that small. breakfast was ok - basic with bad coffee ( a serious issue to me) noise from road quite bad so request a room at the back!", "Date": "November 26, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "3.0", "Value": "4", "Sleep Quality": "3", "Rooms": "2", "Location": "4"}, "AuthorLocation": "Stockholm, Sweden", "Title": "“Good enough for a few nights and very good value”", "Author": "thesaint01", "ReviewID": "UR120751165", "Content": "The Best Western Corona is located a few minutes walk from Pimlico tube station but it is also walkable from Victoria (around 7-10 minutes) so the location is not bad at all. Check-in was smooth and efficient when I was there.Two people behind the front desk so no wait at all. Was promptly given my room and I was also asked if I wanted to pay now so that I could check-out without a wait in the morning. Room was on top floor so used the elevator, it is a bit on the small side and fairly slow as often is the case in the hotels in rebuilt Victorian houses. The room was fairly small but still big enough to fit a bed and desk that was at least big enough to sit at. The TV was extremely small (most computers have bigger screens) but was working fine. Free wifi (was strong enough to reach my room, in reception they said it was not sure it would be strong enough there so received a cable as well) is included and it worked well. Bed was pretty comfortable so slept well. For those who are light sleepers do be aware that while the locations is pretty quiet the rooms have paper thin walls and doors so it is impossible not to hear people from other rooms or those moving around in the hallway. All in all still a good budget option for those who wish to stay close to Victoria. Bathroom was very small but was fresh and clean so no complaints there.", "Date": "November 18, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Santa Fe, New Mexico", "Title": "“Excellent value for money”", "Author": "Verdi2013", "ReviewID": "UR120704522", "Content": "For the price, this was good value all round with the room price on average ranging from US $90 to US$135 (cheaper on Sunday night, for example). As with many London hotels which have been converted from former terrace houses (sometimes with several joined together), one does not expect large rooms. I stayed six nights in a single room which, of course, was small, but it is good that there are single rooms for a more reasonable price wjern traveling alone. As has been noted, it is old-fashioned tv but fine for morning news, etc. Otherwise the bathroom was excellent, with nice modern shower enclosure. Re: the internet. It is free, and they supplied an ethernet cord, since wi-fi on the 3rd floor wasn't great. For the price, the breakfast was fine (unless you're expecting a full English breakfast). There were rolls, croissants, lots of fruit, yoghurt. And coffee served at the table. It's an excellent location with Pimlico tube just 5 mins. away, a nice cafe on the way to it. #24 bus runs right in front of the hotel all the way to the West End. As has been noted, it has easy access to Victoria station and, going north towards Victoria, there is a wide seelction of restaurants and local shops. Tate Britain is 10 mins. away on foot along the river.", "Date": "November 17, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Colchester, United Kingdom", "Title": "“Pleasant stay”", "Author": "Jim W", "ReviewID": "UR120677546", "Content": "Stayed here while on business. It was nice and clean and I had a good sleep in the bed. I had breakast in the morning which was nice enough.", "Date": "November 16, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "2", "Location": "5"}, "AuthorLocation": "San Francisco, California", "Title": "“Good location”", "Author": "chanchan_11", "ReviewID": "UR119325070", "Content": "This was a decent hotel for the price we paid. It was in a good location...we could see the London eye from our room, it was just a few minutes from the Plimlico tube, and pretty close to other attractions. The hotel did provide breakfast which helped saved some money, however, their selection of breakfast items were slim pickings. The receptions were very helpful, the only negative thing I have to say is that the hotel rooms were tiny. Also, wifi is free at the hotel; however, we could never get signal from our room which was on the 4th floor, so we had to always go to the lobby since it had a stronger signal.", "Date": "October 15, 2011"}, {"Ratings": {"Service": "2", "Cleanliness": "1", "Overall": "2.0", "Value": "2", "Sleep Quality": "2", "Rooms": "2", "Location": "5"}, "AuthorLocation": "Summerville, SC", "Title": "“No, thank you.”", "Author": "Scrivner", "ReviewID": "UR118963264", "Content": "While we expected the rooms to be small, we were shocked by all the other issues. The only positive was our location. The bathroom was extremely small, to the point where you would be doused with water when turning on the shower. The water temperature in the sink & shower ran hot. When we brought this to the attention of the manager, she came to the room explaining you need to let it run for several minutes until you get cold water . . . What a waste! Just when you think you have the right temperature, it turned hot again. Miserable! The room was also not clean. Someone left behind hair and there were dead bugs. If you think you can use the phone to call the front desk, think again. There was a \"reception desk\" button, but it just rang. I went in person to the front desk and was told you are not supposed to use that button, dial \"0\". Back to the room, dialed \"0\" and that did not work either. Don't believe the online information saying they are multilingual. An Italian gentleman staying there came to the front desk trying to ask questions, and the clerk shrugged his shoulders. While I don't speak Italian either, I did hear pizzeria in his question. With no knowledge of Italian, I was able to assist by saying \"Pizzeria\" and pointing in the direction down the street. On another occasion, I asked if there was a phone book so we could find a French or German restaurant. After checking around, he said they must have thrown out the phone books. He then proceeded to call friends so they could find one. He did tell me there was a French restaurant 3 blocks away, but said we would not want to do there because it is too expensive. Since we knew we could not depend on his advice, we went anyway and had a wonderful meal. And the price was reasonable. We will not plan a return trip to this hotel.", "Date": "October 5, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "4.0", "Value": "4", "Service": "3"}, "AuthorLocation": "Toronto, Canada", "Title": "“I think I'll be back”", "Author": "Agitater", "ReviewID": "UR117841982", "Content": "Although the rooms at the Corona are not air conditioned, they're still comfortable albeit typically London-small. The hotel is kind of boutique-ish. For walkers and other people who like to explore big cities, the Corona is reasonably well situated. Pimlico tube station is about three minutes walk, Victoria station is only an eight minute walk. There are probably two dozen little restaurants of all descriptions (Italian, euro-modern, up-scale vegetarian, mid-scale vegetarian, Indian, mediterranean, pub fare) and several good pattisseries (late night snacks!) and other shopping within a 1-10 minute walk of the hotel. The Corona is one of 48(!?!) small hotels which are located on Belgrave Road stretching from Lupus St in the south to King's Road in the north. That's a lot of hotels on a 2 kilometer long street even for central London, so the Corona staff are used to lots of traffic. That said, don't expect anything but cool, business-like service. The hotel has few amenities, but the well-appointed rooms are very clean and comfortable and that's a lot of value, I think, for $130-$150/night in London. The only downside is wireless internet connectivity, which is handled by a third-party service provider - it's a bit pricey, the connection is slow and if Best Western decides to update/improve only one thing in the hotel, internet service should be it. Slightly less than ten minute walk to the Tate Britain and some great pubs, shops and theatres on Vauxhall Bridge Road and Victoria Street.", "Date": "September 8, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "4.0", "Value": "4", "Service": "5"}, "AuthorLocation": "Southend-on-Sea, United Kingdom", "Title": "“Fantastic stay”", "Author": "DonnaH48", "ReviewID": "UR117764499", "Content": "I travelled with my Father and sister to visit Buckingham Palace. We got an excellent deal and a room for 3. There was little space in the room but it was clean and comfortable. The bathroom was clean and water hot. We slept well and had a very good breakfast. Particulalry nice staff brought frest toast and hot coffee to the table and a good continental spread was provided. The location is wonderful, just a short walk from Victoria with a bus stop opposite. This is not a luxury stay, nor are the rooms big but for a comfortable, good value stay its hard to beat. We will be back", "Date": "September 6, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "2", "Overall": "4.0", "Value": "5", "Service": "3"}, "AuthorLocation": "Hinckley, United Kingdom", "Title": "“Very good value”", "Author": "T0nyB", "ReviewID": "UR116719311", "Content": "This is a very reasonably priced hotel of a good standard for a short visit. I had a single room (407) at the front of the hotel. On the negative side, the room was very small, there is street and aircraft noise and it was too warm. However, they have made excellent use of the space available and the decor was good. The bathroom was newly fitted out and the shower was excellent. I found the staff efficient and friendly. Much better than the last place I stayed in London and cheaper. I didn't have breakfast but it was reasonably priced.", "Date": "August 14, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "4.0", "Value": "3", "Location": "5", "Rooms": "3"}, "AuthorLocation": "", "Title": "“Great location”", "Author": "Alimil", "ReviewID": "UR116454264", "Content": "Stayed one night for work,really easy to get to. Plenty of places nearby to grab food and drinks too. Don't expect luxury this provides clean base in very central location and no more. I have stayed at holiday inn over the road as well which is identical but on average 50% more expensive. Only big downside to corona is no a/c.", "Date": "August 8, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "4"}, "AuthorLocation": "Hastings, United Kingdom", "Title": "“Very pleasant stay”", "Author": "Foxyphilo", "ReviewID": "UR115637327", "Content": "Stayed here whilst attending a christening in London. Very convenient, not far from Victoria rail station. Friendly staff, comfortable bedroom at a reasonable price. Good continental breakfast. Will be sure to re-visit when in London again.", "Date": "July 22, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "2", "Overall": "4.0", "Value": "3"}, "AuthorLocation": "Kennesaw, Georgia", "Title": "“Very Small Room”", "Author": "gbbird", "ReviewID": "UR115212000", "Content": "This hotel is fairly close to the Pimlico tube stop and a fair walk to Victoria Station, although we usually chose to walk to Victoria. There is shopping district between the hotel and Victoria that has a Tesco, KFC and other small restaurants. The staff was friendly and helped us book a day tour to Stonehenge and Bath. The room was clean but one of the smallest we have stayed in. We asked for a double and should have requested a twin because we got a double bed that was uncomfortable for two people. The room had a/c that worked. Having stayed in several previous hotels and B&B's in London that were noticeably shabby, we were pleased that this hotel appeared better maintained, neat and clean. We did not eat breakfast at the hotel. It is within walking distance of the Tate Britain museum and Victoria Station.", "Date": "July 10, 2011"}, {"Ratings": {"Cleanliness": "2", "Sleep Quality": "1", "Overall": "3.0", "Value": "1", "Service": "3"}, "AuthorLocation": "Baku, Azerbaijan", "Title": "“not coming back”", "Author": "Nikki_Elchin", "ReviewID": "UR115123531", "Content": "stayed in this hotel just few days ago. My room was so tiny and uncomfortable. The TV is from the 1980s. The location is ver good, but still one can find much better hotel for the price you pay for the Best Western Corona Hotel. The breakfast was not good, at all. However the reason why I am not coming back is that it was very loud there, the walls are very thin, you can hear everything going on outside of your room. I could not sleep properly because I could hear every car passing by, in one word, I wish I had stayed somewhere else", "Date": "July 7, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "1", "Overall": "2.0", "Value": "2", "Service": "2"}, "AuthorLocation": "Montgomery, Alabama", "Title": "“Two nights - two completely different experiences”", "Author": "susiewhite", "ReviewID": "UR114770400", "Content": "Stayed two nights at the Best Western Corona in London, and managed to have almost two completely different experiences. First night - incredibly loud (doors slamming well past midnight and the walls are very thin), followed by a forgotten wake-up call (no alarm clock in the room). Lucky we made it for our trip to Paris early the next morning. Front desk employee's response? \"Hmph\" Second night - much quieter, and we got our wake-up call. Another issue - the shower's hot water ran out each morning before the end of the first person's shower (we are a family of 3). Rooms were clean, and convenient location. However, would look elsewhere when we return to London.", "Date": "June 26, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "2", "Overall": "3.0", "Value": "2", "Service": "2"}, "AuthorLocation": "England", "Title": "“Small and noisy”", "Author": "phoebe_skywalker", "ReviewID": "UR113293166", "Content": "The single room I booked was tiny and I had to put the kettle under the shower to fill it up as it woudn't fit under the microscopic sink. The room faced the noisy street and the windows are old so do not keep out the sound. I subsequently asked for a quiet room but was told only the doubles do not face the street and was not offered one. So book a double or bring earplugs! On the plus side, the bed was very comfy, clean, and the price was good considering the location.", "Date": "June 13, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "4.0", "Value": "3", "Service": "4"}, "AuthorLocation": "Brighton", "Title": "“Very, very small but clean and comfortable”", "Author": "CoolAllie", "ReviewID": "UR112559124", "Content": "We stayed here as we didn't want to travel home after a night at the theatre. It has to be the smallest hotel room I have ever stayed in. I think I could touch both sides of the bathroom if I stretched my arms out and there was not quite enough room for me to brush my teeth facing the corner sink. Saying that the room had everything you need for a one night stay, basic clothe hanging space, desk, chair, TV, shelf and tea/coffee etc. Also, the ceiling were tall and this meant the room didn't feel claustrophobic in any way. Everything was clean and comfortable, breakfast is continental but the service was good. Two mins from Victoria Station and Pimlico tube, so good location for us. It was a little pricey at £110 for the night but despite being small I would probably stay there again if we couldn't get similar brand for cheaper.", "Date": "June 10, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "4", "Sleep Quality": "2", "Rooms": "1", "Location": "5"}, "AuthorLocation": "Kenai, Alaska", "Title": "“Small comfortable room with basic needs...Close to the Tube!”", "Author": "Homergruven", "ReviewID": "UR109885854", "Content": "It was close to the Tube & walking distance to everything! Not too many places to eat close by..But get on the Tube!", "Date": "May 25, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "3.0", "Value": "5", "Sleep Quality": "3", "Rooms": "2", "Location": "4"}, "AuthorLocation": "S Wales", "Title": "“A cheap but average experience”", "Author": "drc225", "ReviewID": "UR104025736", "Content": "I stayed for three night in mid-April booked through hotels.com for £250 inclusive for the three nights. It would be very easy to be negative about this hotel. My room (#407 I think) was tiny. The bed was 'OK' not comfortable but not uncomfortable, the shower was adequate. The hot water hotish. I had to wait ages for the cold water to come through (presumably the pipes run together and this makes both taps a sort of hotish temperature!) but it did come through. I needed a ironing board and iron on my first evening. The iron was fine but the board had seen better days. I think there are a couple of boards/irons which are shared so I guess I was lucky that there was one available. The free internet (they advertise wifi but apparently the signal is so bad on the 4th floor they have wired and issue you with an RJ45 cable) finally worked after they gave me a different username/password and was adequate. There was another guy at reception with a similar issue. Fine for browsing/email - don't expect to watch movie clips. I didn't really use anything else. My room had a tiny TV - didn't use it. Breakfast was an additional £5.95 - didn't buy it. Staff were pleasant enough in my limited dealings with them. So moving onto the positive. The room had a small kettle and tea/coffee and everything worked and was clean. Housekeeping did their stuff in the day. The location is good - about a 5 minute walk from Victoria station and within an easy 10-15 minute walk from the The Queen Elizabeth II Conference Centerer opposite Westminster Abbey which is where the conference was. The key thing, of course, is price. With anything decent being over £200 *per night* and even your travelodges and holiday Inn expresses being well over £100 per night, £250 for the 3 nights was stunning value. You get what you pay for and there is nothing wrong with this hotel - just don't expect the Ritz.", "Date": "April 14, 2011"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Overall": "2.0", "Value": "2", "Sleep Quality": "3", "Rooms": "3", "Location": "2"}, "AuthorLocation": "Los Angeles, CA", "Title": "“Glad I only had to stay one night...”", "Author": "tjcheerio", "ReviewID": "UR102495478", "Content": "Unless you must be near Victoria station, I wouldn't suggest this hotel at all. The room was one of the smallest rooms I've ever encountered while traveling through Europe/UK. There wasn't even a closet or a safe. The TV was smaller than my laptop and it didn't even work. The staff was extraordinarily unhelpful...they act like they are doing you a favor by being there. I would never stay here again...I've stayed in more than 15 hotels in London and this is by far the worst.", "Date": "April 2, 2011"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Overall": "2.0", "Value": "1", "Sleep Quality": "2", "Rooms": "2", "Location": "3"}, "AuthorLocation": "Bath, United Kingdom", "Title": "“Poor value for money”", "Author": "minimad66", "ReviewID": "UR94773378", "Content": "Where shall I start, well, no facilities for either meeting or relaxing no hot food available at breakfast just toast and cold meat, no bar or resturant. Room was clean enough but tatty. For a Best Western brand I would expect better. As for the price, I am just glad my company was footing the bill, I certainly wouldn't pay those prices for what is to be honest a glorified B&B. How the AA rate it as 4 star I will never know.", "Date": "January 28, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Location": "1", "Rooms": "1"}, "AuthorLocation": "Skopje", "Title": "“Bad and small”", "Author": "LjupcoSkopje", "ReviewID": "UR89198954", "Content": "Small and not friendly. Breakfast is sharp to 9:30 if you came at 9:25 you must finished at 9:30 to avoid vacuming during breakfast", "Date": "December 6, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Leicester", "Title": "“Good all around I would say”", "Author": "mam24", "ReviewID": "UR88919900", "Content": "I recently stayed at the Best Western Corona Hotel for a couple of nights. Location was great, breakfast was ok - limited choice but ok, room was on the small side but i was impressed on how clean the room was. Our room in particlar had a great view outside of the london eye and the big ben. The hotel is sitauted in a great location walking distance to all major places i.e buckingham palace, victoria theatre and main tube station. We brought this room from a travel agency in Swindon called Travel Indigo. www.travelindigo.co.uk. The customers advisors were very friendly and were very helpful to get us a good deal. I would highly recommend you try them for any of your travel needs.", "Date": "December 3, 2010"}, {"Ratings": {"Service": "2", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Sleep Quality": "2", "Rooms": "2", "Location": "2"}, "AuthorLocation": "Bergen, Norway", "Title": "“Both good and bad”", "Author": "olabri", "ReviewID": "UR88736184", "Content": "Good breakfast to be continental. Very strange and complicated wifi system. The water in the sink was warm, and impossible to get cold. The water in the shower was cold though :) Very small room and bed for two people. Very small TV with no BBC. The door didn't insulate against noise in the corridor. Short walk to pimlico tube", "Date": "December 1, 2010"}, {"Ratings": {"Overall": "2.0"}, "AuthorLocation": "Solihull", "Title": "“poor”", "Author": "Patricia99", "ReviewID": "UR88674128", "Content": "Was disappointed in this hotel. The rooms very small and very basic. there was no central heating it was out of order and clearly had been for a while and there were plug in electric heaters in various locations - I had one in my room, my colleague didn't. There was no cold water. The tap only gave you hot water whichever way you turned it so I had to clean my teeth in hot (not even warm) water! Breakfast was very basic - cereals and cold meats - no full english - although full breakfast advertised. In my view very overpriced even in central London you can get a better hotel with full breakfast cheaper.", "Date": "November 30, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "", "Title": "“Good Value”", "Author": "Veggyplot", "ReviewID": "UR87562768", "Content": "Had a couple of nights here. Although the room was on the small side everything was clean and the bed comfy. There was some traffic noise in the morning but not that bad. Breakfast was a continental buffet and fine to get you started for the day. The tube is close by although we used the bus which is even closer. Overall, clean and good value with helpful staff.", "Date": "November 19, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "3", "Location": "4"}, "AuthorLocation": "London, United Kingdom", "Title": "“Clean and efficient.”", "Author": "Fee L", "ReviewID": "UR86251605", "Content": "The hotel was clean and tidy. The rooms were small but that's to be expected in this part of London in townhouses. The staff were on the whole very helpful and breakfast- in the bizarrely themed Marilyn Monroe themed room- despite being listed as \"continental\", was very filling and tasty. The rooms had wi-fi but you had to get a daily access code from reception which was a bit of a pain. Drinks and biscuits were provided on day 1 but not renewed for other days- a tad mean I thought. All in all a good place to stay- great location, clean and friendly.I would go again.", "Date": "November 7, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "leeds", "Title": "“Cant fault this hotel one bit”", "Author": "lewbec", "ReviewID": "UR86190278", "Content": "Came down for a short stay. 5 minutes walk from pimlico tube very convenient as you are anywhere in minutes, even walked into westminster to big ben, houses of parliament etc in 15 mins. Staff excellent even let us check in 2 hrs early. Room much bigger than average booked via late rooms and saved £60 on the cost. Tea coffee and buscuits in room, toiletries and generous sized towels included. Definately use again soon.", "Date": "November 6, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Ibiza, Spain", "Title": "“Average basic hotel”", "Author": "fabmc", "ReviewID": "UR85527720", "Content": "Average hotel close to Plimco tube station. It is a three star hotel and I paid GBP110 per night, breakfast included. Booked via their web site: www.coronahotel.co.uk", "Date": "November 1, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "3.0", "Value": "5", "Sleep Quality": "3", "Rooms": "3", "Location": "5"}, "AuthorLocation": "sunderland, united kingdom", "Title": "“Great Location, Clean & Comfortable !!!!Good value for money”", "Author": "flump16", "ReviewID": "UR85433482", "Content": "was concerned when reading reviews but pleasantly surprised with this hotel. Fantastic location for city centre 15mins walk to buckingham palace & 5 mins walk to nearest underground station. We came back late one evening after seeing a show & felt quite relaxed in the area we walked through. Loads of amenities near by ie coffee shops, restaraunts & local supermarkets.A must to visit is the Patisserie near by great coffee & the most amazing cakes. Hotel room was small but ideal for us as all we wanted was some where to sleep. We had a room at the front which was quite noisey as the road does get quite busy early in the mornings so if you are a light sleeper would suggest asking for a room at the back. Staff friendly & rooms cleaned everyday. Breakfast great, nothing warm but enough to fill you up for the start of your day.", "Date": "October 31, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Sleep Quality": "3", "Rooms": "2", "Location": "4"}, "AuthorLocation": "Vancouver", "Title": "“Well positioned for a couple of days”", "Author": "riev", "ReviewID": "UR83146112", "Content": "Small room and bath. Clean and hospitable. Close to the tube and easy to get to from Gatwick.", "Date": "October 12, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "3.0", "Value": "2", "Sleep Quality": "3", "Rooms": "1", "Location": "4"}, "AuthorLocation": "Bedford, United Kingdom", "Title": "“Suitable for my specific purpose”", "Author": "LaurenceJWhiting", "ReviewID": "UR81208858", "Content": "I had work nearby so it was well located for what I required. The price, around £30-40 lower than surrounding hotels, probably reflected the size of the room. I have never stayed somewhere that small. To use the bathroom I had to squeeze inside the door and shut it behind me. The room was not very well protected from the traffic noise either. by far and away the biggest plus for this hotel is the staff they have working there. I spoke to around 4 different staff members over my one night stay and each of them made you feel that nothing was a bother. They were great on reccomending dining out and getting taxis. This hotel is fine for a one, maybe two, night stay if you are a business traveller on a budget working nearby. Anything else may be stretching it.", "Date": "September 27, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Sleep Quality": "2", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Belfast", "Title": "“Did the Job”", "Author": "iedpg", "ReviewID": "UR80690262", "Content": "I was moved here by another hotel near-by due to a mix up. The room was small but it was clean. My room faced the street, had to open window to cool down at night because the air-conditioning didn't work. The road was busy and noisy throughout the night. Breakfast was included and there was a decent enough selection of what to eat. Only stayed one night. For people on a budget it seems a good choice", "Date": "September 23, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Prague, Czech Republic", "Title": "“Great location, small room”", "Author": "MalvolioBlanco", "ReviewID": "UR80279079", "Content": "Hotel is located in a very quite area few steps away from Pimlico tube station, within walking distance of Victoria Station. Typical Victorian style street of white houses, many of which are hotels as well. Very fast check-in and check-out, my room was very small, but that is what you expect at this kind of hotels. As most Best Western hotels, only basic equipment, i liked marble floor in the bathroom. Toiletries provided every day. The only thing that needs improving is their WLAN access system. Each day, you have to get a new printout with username/password for the network, which is pretty annoying if you stay from three days like I did (and always forgot to ask for a new one on my way back). Giving one code for your whole stay would be much better.", "Date": "September 20, 2010"}, {"Ratings": {"Service": "2", "Cleanliness": "2", "Overall": "2.0", "Value": "1", "Sleep Quality": "1", "Rooms": "2", "Location": "3"}, "AuthorLocation": "Birmingham, United Kingdom", "Title": "“Well it's better than a youth hostel....”", "Author": "186402Sarah1984", "ReviewID": "UR80164265", "Content": "I ended up running out of options when making a business trip and having to pay £120 for the privilage of staying here for one night; London Fashion Week meant everything was booked up. On initial glances it looked a bit rough around the edges but OK. On peeling back the duvet I found some suspicious looking hairs in the bed. It was late, and it struck me as the kind of hotel that would have this standard throughout the rooms anyway so I did the sensible thing - went out with a friend and had some drinks! Even with earplugs in the old sash windows meant that it was very noisy, and my curtains didn't cover the window fully so I woke with the light. What really upset me about my stay here was that there was no hot water in the morning. I ended up having a cold shower, as I was facing clients that day, it was miserable! I've stayed in youth hostels in London. If you were paying £50pn then this would be a great alternative as you have your own room. As an actual hotel, I hope I never have to go again.", "Date": "September 19, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Sleep Quality": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Glenview, Illinois", "Title": "“Able to walk to all the sites and have a nice room to come back to.”", "Author": "stevelewin", "ReviewID": "UR73791562", "Content": "The Corona was perfect for our 24-hour stay in London. The location is excellent. The Shuttle to the airport is a good value and the staff was very helpful. I would highly recommend this hotel for sightseers. You can easily was to Buckingham Palace and Parliament. The stroll down the Thames is great. The hotel is clean and comfortable. The breakfast room, though in the basement, is lovely.", "Date": "August 4, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Sleep Quality": "1", "Rooms": "2", "Location": "4"}, "AuthorLocation": "florida", "Title": "“Hotel is very clean but rooms small”", "Author": "Gin21", "ReviewID": "UR71941554", "Content": "The staff were very polite and courteous. The breakfast was pretty basic but filled a gap! The rooms are small but were spotlessly clean, however it was very hot. There is no air conditioning and the windows won't stay open. Having said all that it was in an ideal place to access the tube - it is very close to Pimlico tube. I would stay here again, but not in the summer!", "Date": "July 22, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "2", "Sleep Quality": "2", "Rooms": "2", "Location": "4"}, "AuthorLocation": "Porto, Portugal", "Title": "“Good location and good price!”", "Author": "lucasousa", "ReviewID": "UR71794827", "Content": "I've been in this hotel for 3 nights on the beginning of June 2010 with my girlfriend. The room was small, as almost everyone in London but it was what we expected. Small, but clean and suficient for everything we needed. There was some noise during the night because our room was next to the elevator. We heard lot of noises coming from the floor of the room upstairs. The noise was really what we disliked more. The best was the location. We could go by foot to 2 metro stations (victoria and pimlico) and we could go by foot to central places like big ben or buckingham palace (20 minute walk). Belgrave road is full of hotels and it's a very good place to start your trip in London.", "Date": "July 21, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Renfrewshire", "Title": "“Pleasant comfortable hotel, nice staff good breakfast”", "Author": "pado21", "ReviewID": "UR70314372", "Content": "I would use this hotel again. Nice reasonably sized room. Big sash windows that you can open. My room was back facing, quiet with great view towards parliament over the roof tops.", "Date": "July 9, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "4", "Sleep Quality": "1", "Rooms": "1", "Location": "4"}, "AuthorLocation": "New Jersey", "Title": "“True Budget Hotel”", "Author": "continentquest", "ReviewID": "UR70056543", "Content": "As many of the previous reviewer have noted, the rooms in this hotel are small. I was in a single and though I don’t think a human could touch both walls, I did have to pause to consider the question. The wall paper and paint in the rooms were fresh and the bathroom seemed recently renovated. Everything was clean and orderly. In fact, the cleaning staff found a good balance between keeping my room clean and not disturbing my things. I found the staff helpful and courteous. The location is good, less than three blocks from the Pimlico tube stop and only a little further to Victoria station. Belgrave Road is home to a number of other budget hotels, there is a Holiday Inn Express across the street and another Best Western two blocks north. On the downside, there were a number of small things that were annoying while a few bigger ones might disqualify this hotel for some people. First, there is NO AIR CONDITIONING. While this is not often a problem in London, it was while I was there. Due to the small size of the room and the placement of the furniture it was impossible to fully open the windows when the air was cool. The windows would not stay open with the drapes closed, plus there is enough street noise to make an open window incompatible with sleep, at least for me. A small table fan helped, but not as much as ceiling fans and modern windows would have. Now for the more petty complaints. The furniture in my room had seen some hard use, chipped and dented close to the floor where it had no doubt been hit by luggage. There was no flat sheet on the bed, just a duvet, which was far too warm to use for most of my stay. There were two drawers in a small desk, but the top one was filled with a blow dryer bolted to the interior and the bottom one had an electric tea kettle, mug, spoon, tea, sugar and milk. This left the five hangers as the only place to put clothing. In the morning, the cleaners run the vacuum in the hallway starting at about 9:30 am, frequently bumping the walls for extra effect. The doors seemed noisier than in any other hotel I’ve ever stayed in. I started to hear doors banging early in the morning, making it hard to sleep off my jet lag. So would I stay here again? In cool weather, almost certainly -- mainly due to the location and price. I paid an average of $115 per night including taxes. In London this is quite reasonable.", "Date": "July 7, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Melbourne Australia", "Title": "“A well positioned hotel surrounded by restaurants and transport”", "Author": "jennyknight18", "ReviewID": "UR69527295", "Content": "This is your typical small hotel room in London as the building is a converted Victorian. The standard double room only allowed for one person to dress and get ready while the other person sat on the bed. Our luggage did take up some of the available space but the floor area was very small. The bathroom only allowed one person at a time. The furnishings and decor were of a good standard and as we were out during the day were not too concerned about lack of space. The position of the hotel is great being in Belgrave Street was very close to the Pimlico Tube station and buses. We walked to Westiminster and the London Eye along the Thames and explored most of London by foot. There were many varities of restaurants to choose from and an express Supermarket when you knew where to find them.", "Date": "July 3, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "3.0", "Value": "3", "Sleep Quality": "1", "Rooms": "3", "Location": "5"}, "AuthorLocation": "USA", "Title": "“Heat wave made it uncomfortable--too hot and no cold water”", "Author": "MusicalMamaUSA", "ReviewID": "UR69339335", "Content": "Good location and quite clean. Breakfast was good and the staff was helpful. However: London was having an unusual heat wave (28C) and the water pipes are not insulated so we had NO cold water. We're not kidding! They need to upgrade that system and at least install ceiling fans. We were provided a tiny fan that didn't help much. With no air conditioning we couldn't sleep and were very uncomfortable.", "Date": "July 1, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Hamilton, Ontario", "Title": "“Wonderful time”", "Author": "Belgraveroad", "ReviewID": "UR68566807", "Content": "I have just returned to Canada, following my annual 8-nights visit to The Corona. As always, I had a wonderful time, and was made to feel so welcome. Special thanks to Mariya, Anna and Klara. Can't wait for next year. Patricia Bannon, Hamilton, Canada", "Date": "June 24, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "3", "Overall": "2.0", "Value": "2", "Sleep Quality": "1", "Rooms": "1", "Location": "3"}, "AuthorLocation": "Las Vegas", "Title": "“This place was scary”", "Author": "mkart1", "ReviewID": "UR66382898", "Content": "We flew in from Scotland very late and had little choice about where to stay. The place was clean but very small. We were in the basement. The towels were the size of a postage stamp and there was only one bath towel. The air conditioning was a small fan sitting on a little ledge! The bathroom reminded me of the bathroom we had on a night train car 20 years ago. It was almost impossible to regulate the hot and cold water in the shower. We would never go back here. I thought the price was high too for the poor quality of the accommodations.", "Date": "June 4, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "3", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Brisbane", "Title": "“Great location for exploring London”", "Author": "Cryjam", "ReviewID": "UR63455553", "Content": "We stayed for three nights on our first time to London. The hotel is located in Victoria which is just south of Buckingham Palace. The Victoria train/tube station is close with many very good restaurants on the way, the Pimilco tube station is also close which makes exploring London very easy. Buckingham Palace, Big Ben & Westminister Abbey are all a 15-20 min walk away. We had a standard room which had a queen size bed, desk, bathroom. The free internet which most hotels have is unreliable however the internet at this hotel was great. A complimentary breakfast is included and the breakfast room has ample room. This is ideal for tourist who are looking for a base. The hotel was also good when after checkout an ash cloud killed our flights by giving us the internet and an area to sit.", "Date": "May 6, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "3", "Rooms": "4", "Location": "5"}, "AuthorLocation": "kingsclere newbury berks", "Title": "“ideal location small room”", "Author": "jellyhead0", "ReviewID": "UR59263288", "Content": "my wife & i stayed here for 1 night on new years eve the location was excellent not to far from the houses of parliment the eye etc but far enough away to be not to noisy. when i booked in i asked the receptionist how far it was to westminster & the london eye she said that we would have to get a bus as it was to far to walk, we decided to walk anyway we got there in about 3/4 an hour along the thames (dont people ever walk in london) we had a great time watching the fireworks at the eye, we walked back but a word of warning make sure you know exactly where your hotel is as all the roads look the same especially if you have a load of beer inside you also if you are a bit of a bloater like me make sure you have a skinny wife cos the bed & the rooms are small lol", "Date": "March 22, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "3.0", "Value": "2", "Location": "5", "Rooms": "2"}, "AuthorLocation": "New York City, New York", "Title": "“A mixed bag that I wouldn't recommend”", "Author": "jwall915", "ReviewID": "UR50703987", "Content": "This hotel is really a mixed bag. First, the pros. The location could not be better. Absolutely superb. It's about a block away from the Pimlico Tube station, which is a few short stops from everything you'll want to see in London. It's in a nice, safe, residential neighborhood w/ several pubs and convenience stores, plus an internet cafe. The service is good too. The front desk staff is nice and helpful. They gave us a map that gave us discounts to lots of stuff, which they didn't have to do. The rooms are clean and the bathrooms are fine. A breakfast buffet is included w/ limited hours every morning. The food is standard fare, nothing fancy, but decent and nothing to complain about. Now, for the cons. This room is small. I mean, tiny! It's small by european hotel standards. There was literally no room for the suitcase on the floor. The double bed took up the entire room. There's no closet, just an open armoir. The bathroom door opens up toward the bed instead of near the doorway like most hotels. In fact, you cannot open the bathroom door all the way, b/c it hits the side of the bed. It's that small. Secondly, the amenities are quite lacking. They provided shampoo, but no conditioner. The hair dryer was not located in the bathroom, so it was two days before I found it. And when I did locate it, I found it to be damaged. There was no refrigerator or safe. There is also no room service. The bed in our room was very uncomfortable. Neither of us slept well the entire four nights we were there, and my spouse actually awoke in pain most mornings. But the biggest negative to this hotel for me would have to be that the walls in the rooms are painted ORANGE!!! I don't know what the management was thinking when they did that! It is nearly impossible to sleep well in a brightly painted orange room. I literally couldn't sleep w/o Benadryl. Overall, I wouldn't recommend this hotel. there are some positives, but they are unfortuantely outweighed by the negatives. I do recommend that you find this hotel on a map, research the area, and then book a different hotel in the same neighborhood, because the location is spectacular!", "Date": "December 5, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Location": "5", "Rooms": "4"}, "AuthorLocation": "superstarintheworld", "Title": "“VERY, VERY NICE HOTEL!”", "Author": "superstarintheworld", "ReviewID": "UR50094211", "Content": "This was our first time in London and we booked this hotel trough internet since it was quite cheap being in the centre of London and we made the right choice, we loved to stay there! The hotel is located in the centre of the town, about 10 minutes from Victoria subway station and about 3 minutes from Pimlico Subaway station, both by feet. Close to it there are some shops who sell food and drinks, some restaurants...the road is very calm and safe also in the evening and there is not much noise. The bus stop is just few steps from the door of the hotel. The road is very nice too, all victorian style. The hotel was clean and nice, the staff is not too much friendly but when we needed something they answered and that is what matters. We had a double room and it was clean, maybe a little small for some other travellers but we have been in smaller places :) Anyway, there was the bed, some space for the suitcases, the wardrobe, chairs and desk...the bathroom was small, there was the shower, the silk. The breakfast is included ( at least with our booking ) it was from 7 am and it is served in a nice and big room so we did not have to wait to have a seat. You can choose among coffee, milk, chereals, brioches, ham and much more! The waitress do their job and ask you if you need something more. In total, we would come back there since the position is very good because with the bus or subway you can easily reach every other place of London, the hotel was safe and clean and was nice, after a tiring day, to come back there!", "Date": "November 26, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Location": "3", "Rooms": "2"}, "AuthorLocation": "USA", "Title": "“Adequate for most purposes”", "Author": "Ace50", "ReviewID": "UR49993942", "Content": "Given that all one needs is a comfortable bed and hot shower the fact that I could touch opposite walls at the same time (which means I have very long arms or the room is exceptionally small) has little bearing. It is given 4 stars, a push but again clearly the rating doesn't include the square footage of the room or the size of the TV screen. Clean yes, helpfulness at reception, mixed but generally ok. Squeeky floorboards from the room above and considering their room was no bigger than mine there was an awful lot of walking about being done! Continental breakfast - no sleeping in, breakfast finishes at 10am sharp!! For a business traveller with an entourage of paperwork, laptop, files, there is precious little room to work, but the internet was free, one just had to pick up a password from reception every 24 hours, no biggie. Handy, a range of pubs to choose from with reasonably priced food and good beer (if you like British beer). Everything within walking distance, Victoria Stn handy too. Stay there again, probably if I had business in that part of town... on the other hand the Grosvenor on Buckingham Palace Rd looked appealing...", "Date": "November 24, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Location": "5", "Rooms": "4"}, "AuthorLocation": "S.Korea", "Title": "“Very Clean & Nice Location”", "Author": "LucyYoon", "ReviewID": "UR49244329", "Content": "I stayed at Best Western Corona for 5 nights. The location was very good, near Pimlico tube station and bus stop. Staffs were very friendly and very helpful. Breakfast was just moderate. Room and bathroom are small but very clean and well kept. I would stay here again if I come to London next time. :)", "Date": "November 15, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "3.0", "Value": "3", "Location": "4", "Rooms": "3"}, "AuthorLocation": "Las Vegas, NV", "Title": "“Super location, clean small rooms, helpful staff”", "Author": "Cruzon68", "ReviewID": "UR46332468", "Content": "Ten minute walk from Victoria station...great location for central sightseeing. Hotel is small (no bar, restaurant, parking that I observed), elevator smaller and rooms tiny. Rooms had basic necessities, seemed like new and were exceptionally clean. Range of ree wireless internet limited - didn't extend to our 4th floor room. RJC cable provided by front desk (3 pound deposit) worked great. Staff courteous, helpful and gave us great tips on transportation, dining, etc. Numerous pubs and restaurants located about 3 blocks from hotel. Continental breakfast had great selection, fresh foods and meats and very filling.", "Date": "October 8, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Location": "3", "Rooms": "2"}, "AuthorLocation": "New York", "Title": "“Just fine for basic needs”", "Author": "Blackiefazz", "ReviewID": "UR45911664", "Content": "The purpose of a hotel in London is just to shower & sleep for us & don't need all the amenities, ususally found in USA hotels. The Corona was convenient to all transportation & if you don't mind walking, within distance of several major attractions. The neighborhood had several nice restaurants & an Italian Place on the corner was exceptional. The staff was friendly & the breakfast buffet was adequate. Good value for the money & was nice to come back after sightseeing to a quieter section of town.", "Date": "October 5, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Location": "4", "Rooms": "4"}, "AuthorLocation": "West Midlands", "Title": "“Clean, comfortable London hotel”", "Author": "SooziJane", "ReviewID": "UR41832894", "Content": "Good hotel, Room comfortable and clean. No drinking water available in room but reception provided jug of water. Had little extras in room such as Tea/Coffee, toiletries & hairdryer. Location is good, near Pimlico. Regular buses go towards Trafalgar Square. About 10mins from Victoria or 5 mins from Pimlico. Staff were very friendly & helpful. Only bad point is that they don't do a cooked breakfast.", "Date": "September 15, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "4", "Location": "4", "Rooms": "3"}, "AuthorLocation": "N.Ireland", "Title": "“nice location”", "Author": "DeeC80", "ReviewID": "UR36296953", "Content": "really good location, handy to victoria station. Nice pubs and restaurants in the vicinity. Rooms basic, quite small. We were beside the dining room which we found very noisy as we could hear the staff at 6.45am!!! As a group of 3 we always had a wait to get a table together at breakfast. But for al the time you spend in a hotel when you are sight seeing in london this was a grand choice and good value for money!", "Date": "July 31, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "3.0", "Value": "4", "Location": "4", "Rooms": "3"}, "AuthorLocation": "Galway", "Title": "“Good value for money, great location”", "Author": "GalwayRuthGalway", "ReviewID": "UR35892538", "Content": "I travelled with two friends for three nights and paid £335 for B &B for that time for the three of us booking directly through the hotel website. We had a 'family' room - one double and one single bed. It was spotlessly clean and, as I requested a quiet room, we overlooked the internal courtyard. The only negative comment I have is that there is no ventilation in the bathroom and after three showers in the morning it became a bit of a sauna. For the money we paid, we definately didnt' expect as good as we got. Genuinely, I believe the more negative reviews on the website either expected too much or paid way too much! Admitadly breakfast can be a little nuts - the lady serving the tea/coffee and toast does walk around talking to herself and commenting on everyone but once again, for what we paid, we weren't going to complain. The hotel is about 2-3 minutes walk from Pemlico on the Victoria line and about 7-8 minutes from Victoria station which has 4 separate tube lines coming into it. Unfortunatley for us, the Victoria line was closed for maintenence the weekend we were there so we were grateful that Victoria station gave us other options.", "Date": "July 27, 2009"}, {"Ratings": {"Service": "1", "Cleanliness": "2", "Overall": "1.0", "Value": "1", "Location": "2", "Rooms": "1"}, "AuthorLocation": "North East", "Title": "“No moe than a glorified B & B”", "Author": "LondonTraveller010", "ReviewID": "UR35826412", "Content": "On arrival we were extremely disappoined at the size of the 'double' room. There was hardly any space to maneouvre our suitcase past the furniture. The bathroom door couldn't open fully without moving the bed. To say the room was 'compact' is an understatement. There was insufficient hanging and storage space for two people staying for more than one night. On trying the airconditioning it failed to operate. When we asked at Reception we were told it had not worked for two years and to use the fan provided and open the window. This we did but still found the room temperature to be in excess of 80 deg F. This was unacceptable and caused us sleepless nights due to the heat and the noise and volume of traffic on Belgrave Road. To add to this the water from the cold tap was piping hot therefore we had no alterative but to purchase bottled water from Reception at the rate of £1.50 per 500 mls. This was extortionate and had we realised before we were getting into bed we could have visited the nearby shop. We were astounded to be told that the complimentary biscuits were only made available for the first night of our stay and at a rate of £115 per night adds to our frustration. To top it all, on returning to the Hotel on Sunday 19 July at approximately 6.30 pm we were met by a member of the Reception Team who was standing smoking and spitting on the stairs at the main doorway. This was unacceptable behaviour and does not create a favourable impression of your hotel.", "Date": "July 26, 2009"}, {"Ratings": {"Service": "1", "Cleanliness": "3", "Overall": "2.0", "Value": "1", "Location": "5", "Rooms": "1"}, "AuthorLocation": "toronto, ontario, canada", "Title": "“no air conditioning, no screens on the windows”", "Author": "bnirving", "ReviewID": "UR35017288", "Content": "stayed here from july 2-8, right in the middle of a heat wave, no airconditioning, very small room, no screens on the windows and even though we had a 4th floor room, a cat almost jumped into our room (and on my head), in the middle of the night, so, had to keep the window almost shut during this heat wave. Wasn't very comfortable due to the heat. My teenage sons were not comfortable at all, the fan didn't cool off the room at all. Continental breakfast was not very good considering the price paid for the room. the floors in the room were slanted and everything squeezed in really tight. Almost not enough room to open your luggage and live out of it. staff in the lobby not very friendly nor knowledgeable. If you want just the basics, it's okay, but for two teenagers and their mom, certainly not very comfortable. Even the elevator is very small.", "Date": "July 17, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "2.0", "Value": "2", "Location": "4", "Rooms": "2"}, "AuthorLocation": "cornwall", "Title": "“don't go when hot!”", "Author": "easterpromise", "ReviewID": "UR34243033", "Content": "I stayed for 2 nights as I was attending study days in London.Unfortunately it was on the 2 hottest days of the year so far.The airconditioning was broken so I arrived to the very small room equipped with a fan and with the window wide open (luckily I was on the 3rd floor).Later, on reading the hotel in-room guide it was suggested if I needed 'drinking' water a jug could be requested from reception.Puzzled by this I wondered \"is this a way of getting foreign travellers to buy bottled water?\"-the inference being tap water wasn't OK to drink. No,basically there was no cold water in the room the shower was hot water and whichever way you turned the tap hot water came out! The hotel was fine for what it was but still really expensive - it does concern me that unless you pay top dollar this sort of shoddiness is par for the course in London", "Date": "July 8, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Illinois", "Title": "“Absolutely clean”", "Author": "PJMBE", "ReviewID": "UR31866105", "Content": "We stayed at the Best Western Corona in the middle of May and the reason why we stayed there is because of all the reviews on Trip Advisor. Yay for you! Anyway, the room is small, but very clean and I find that more important. The smallness of the room didn't matter, as we only used it to sleep in. I loved the location. We were very near to the sights, but it was in a quiet neighborhood. The bus stand was just down the street, so we could get to where we were going very easily. We will definitely stay there again!", "Date": "June 8, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Location": "4", "Rooms": "3"}, "AuthorLocation": "Orange County, CA", "Title": "“Very good value, great location, well kept.”", "Author": "MisterPelican", "ReviewID": "UR31729908", "Content": "Set in a convenient spot a few minutes walking distance from the Pimlico and Victoria tube stations and walking distance from the major sights of London, BW Corona is, if you rate shop prudently, an excellent value. Rooms are very small -- good for sleeping, showering, and stashing your stuff, but not for relaxing - but clean and well-maintained. The TV is Lilliputian, but who comes to London to watch TV? I booked Sunday through Tuesday nights for a total of 208 GBP, and a subsequent Saturday night for 72 GBP, which included the quite decent continental breakfast. Rooms facing Belgrave Avenue are noisy - the traffic never dies, and it's very loud. As other reviewers have noted, the staff is oddly morose and chilly, utterly oblivious to simple pleasantries (much less to warm engaging of customers) that might make their guests feel welcome, valued, and, you know, want to come back.... nary a smile from any of them, almost grudging thank yous, and not the slightest effort to generate good cheer and human connection. Wake up, guys -- I don't personally make hotel decisions based on that, but it certainly does influence me. That noted, for the price and location, and considering London's hotel rates in general, Corona is a good value, and especially if you can get a top floor room facing away from the street, quite worth booking.", "Date": "June 6, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Portugal", "Title": "“Better than expected”", "Author": "MrBluePorto", "ReviewID": "UR29317023", "Content": "Me and 2 friends stayed at Corona from 1 May to 3 May 2009. We booked a familiar room (1 single bed and a double bed) and the room we get was n.º 106, on the first floor. As many said before, there's not much space in the room but the cleanliness was very good and that, i think, is the most important thing. Talking about the service, i should say it was average. Personally i expected more welcoming staff...But, in the end, the hotel is just a place to sleep as London don't give you time for stay \"at home\" for too long. The room we stay in was on the first floor, on the back side of the hotel, very quiet at the night. Breakfast was a surprise as i expected something not so good. It's a Continental breakfast that includes, as far i remenber: bread, croissants, cereals, milk, coffe, tea, fruit, cheese, toasts, jam, butter, ham, juice. The breakfast room is not that big and you may need to wait a little before get a table. The location is great, walking distance from many places that one must see. Victoria Station (Train, Tube and Coach) is 10 min (max) walking distance, and you have also Pimlico Tube Station in the area. Finally i should talk about the value. We paid £260 for the 2 nights, and i think it's a good value according to the area. All in all if i have to go to London again in the next few days, i will not have any problem in choosing Corona as my hotel.", "Date": "May 4, 2009"}, {"Ratings": {"Service": "1", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Location": "3", "Rooms": "3"}, "AuthorLocation": "The hague", "Title": "“Reasonably priced”", "Author": "Gerardthehague", "ReviewID": "UR27111901", "Content": "Reasonably priced hotel, rooms not big, the double bed rather small, bathroom very small, but all clean and acceptable. But the breakfast is served by two most unfriendly ladies, never heard of a smile, never heard of service, every question is one too many.", "Date": "March 30, 2009"}, {"Ratings": {"Service": "1", "Cleanliness": "3", "Overall": "3.0", "Value": "2", "Location": "3", "Rooms": "2"}, "AuthorLocation": "Dublin", "Title": "“Reasonable hotel - unreasonable staff.”", "Author": "Astja", "ReviewID": "UR26059567", "Content": "Overal clean and bright hotel with a tidy, if a bit worn, room that was cleaned daily. VERY small bathroom even for a size XS girl, but with plentiful hot water coming out of a power shower! Continental breakfast - no hot options. BEWARE: \"Breakfast bat\" - a mean rude housekeeping supervisor that gives out stink if you dare to arrive five minutes prior to the end of breakfast session - the reson for it \"no time for you, breakfast ladies need other work to do! \" That is to challenge those who claim the customer is the key to the hotel industry! Arrive in time to catch some milk and watever else otherwise you will have to fight for it at 9 something am on the morning of your not-so-cheap trip carefully planned in this uneasy for all times.", "Date": "March 12, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Location": "4", "Rooms": "2"}, "AuthorLocation": "Cambridge", "Title": "“Adequate hotel in good location. Rooms small.”", "Author": "garfodie", "ReviewID": "UR26043331", "Content": "Had a stopover in London, so booked the Best Western Corona with air miles. Most of the previous comments are valid. The single room that I booked was really small, and when they say single, they mean it. I can't figure out how they would have placed another person in this room. The room also faced Belgrave Road, which is pleasant, but loud, even on a Sunday morning. This said, the hotel is about a 5 minute walk from Pimlico Tube stop, or a 10 minute walk from Victoria station, with the major coach and rail services in the area. Location is pretty good, and this part of Westminister is safe and not dodgy at all. Room came with free Internet access (wired or wi-fi for laptops), and a TV that did not work. The bathroom is small, with a shower stall only, and (yes) a very small sink. And surely, they could pitch in for a face towel? That said, the room was perfectly clean, the foyer is tidy, and the hotel ambiance was clean and well-maintained. Since this was a booking by points, I don't know if this was good value or not (though easyhotel is just around the corner), but this part of town is relatively safe and centrally located.", "Date": "March 12, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Business service (e.g., internet access)": "3", "Check in / front desk": "4", "Overall": "5.0", "Value": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Worthing, United Kingdom", "Title": "“Very pleasant, ideal for short stay”", "Author": "neildoody", "ReviewID": "UR20803900", "Content": "10 minute casual walk from Victoria Station. Very clean, friendly staff and excellent breakfast. I shall stay here again.", "Date": "October 11, 2008"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Check in / front desk": "3", "Overall": "3.0", "Value": "4", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Oz", "Title": "“Value for money”", "Author": "GusCat", "ReviewID": "UR20491220", "Content": "Stayed at Corona back in August. Rooms are very small but were modern and clean. Hotel is in a great location and was perfect for a couple of days break in London over the weekend. Breakfast was great, couldnt have asked for better. Service was ok, only criticism would be the lack of an iron/ironing board in the rooms. But these were available from reception upon request.", "Date": "September 30, 2008"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Business service (e.g., internet access)": "3", "Check in / front desk": "3", "Overall": "2.0", "Value": "2", "Rooms": "2", "Location": "5"}, "AuthorLocation": "Dundee, United Kingdom", "Title": "“Basic London Mid Price Hotel”", "Author": "Dundeetravellers_8", "ReviewID": "UR18986746", "Content": "We were just looking for a mid range priced hotel in London. Just somewhere to \"crash\" after a days sightseeing. We booked this hotel as it was extermely handy for Pimlico Tube Station & Victoria Train Station. The Tate, Buck Palace,Science /Nat History/ & the V & A Museums are also just a 20 minute walk away. As stated before we only wanted a basic room. The room was clean, BUT, the Air Con was broken & it was extermely hot. They had placed a fan in the room, but this was not much help. Also the TV was nowhere near suitable. Just a basic 18\" portable with every channel not set up properly. AGAIN, You get what you pay for & it was just a place to collapse in at night. Plenty of extermly good placed to eat around that area. Thia/Chinese/Indian, you name it it was there. If I had to choose again I would look elsewhere, but all in all it was OK.", "Date": "August 15, 2008"}, {"Ratings": {"Service": "2", "Cleanliness": "2", "Business service (e.g., internet access)": "2", "Check in / front desk": "1", "Overall": "1.0", "Value": "1", "Rooms": "2", "Location": "3"}, "AuthorLocation": "Derbyshire", "Title": "“what a fiasco”", "Author": "jbl08", "ReviewID": "UR18617331", "Content": "We booked this hotel months in advance for a weekend theatre break for our 22nd Wedding anniversary. When we arrived, they told us that they had a problem with rooms available ! They told us that they had moved us to their sister hotel down the road 100 yards. However, when we got to this hotel it was also full and claimed not to have received the fax from Best Western Corona. So, we went back to the best western corona, who then decided that they could re-arrange some rooms. They gave us a small dingy room in the basement with a bathroom the size of a matchbox. The breakfast was adequate but nothing special. Then to cap it all, they charged us more than the pre-arranged price, by putting through the card transaction without showing the total price. We have stayed in Best Wester Hotels many times before which were good, BUT we will think twice before booking with them again.", "Date": "August 4, 2008"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Check in / front desk": "3", "Overall": "3.0", "Value": "4", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Edinburgh", "Title": "“Good Location”", "Author": "CHabroad", "ReviewID": "UR18160300", "Content": "Myself and 2 freinds booked a family room to share for the weekend at this hotel. The location was great, just 5 minutes from Victoria and the 24 bus stops on the street that is on a very good route. Taxis to Leicester Square area are only about £12 so after a night out you don't have to worry about getting home. The room itself was a decent size, clean and airy. Only problem was it was very very warm, even with the window open for two days and the fan constantly on. Breakfast is your usual continental breakfast served in a busy breakfast room, but it's enough to set you up for the day. Staff we friendly and stored our luggage on our last day so we didn't have to drag them all over London. I'd definitely stay here again as it's also very good value for money in London.", "Date": "July 23, 2008"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Check in / front desk": "3", "Overall": "3.0", "Value": "3", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Uppsala, Sweden", "Title": "“A nice hotel at a good location”", "Author": "Falling2", "ReviewID": "UR16851699", "Content": "My girlfriend and I was looking for a descent hotel close the city center and found the Corona while looking at different websites. The location is great, just a few minutes walk from the closest tube station (Pimlico) and with Victory within walking distance. The hotel is nothing special, but it offers good location, small but clean rooms combined with a good price. It was a great startingpoint for our weekend in London. Some other reviews mention \"thin walls\" but we didn't notice that at all, maybe because our room was at the lower ground floor and the neighbouring rooms was for staff and the breakfast room. Check out time is 11 am and the hotel offers a luggage room if you need to leave your bags there for a while (i.e. a late flight home like we had). I would definitely recomend a stay at the Corona if you are looking for a centrally located hotel with descent prices.", "Date": "June 11, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "3", "Check in / front desk": "5", "Overall": "4.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "New Zealand", "Title": "“Great value for Central London”", "Author": "weezer-85", "ReviewID": "UR16781240", "Content": "Stayed here for 2 nights as emergency accomadation after our initial London accomadation plans fell through. Good service from check in staff, lovely warm comfy room with clean bathroom. Excellent location, close to Victoria station and walking distance to a lot of tourist attractions. Good basic breakfast. Price very good for central London. Would reccomend to anyone looking to stay in Central London for a couple of days.", "Date": "June 8, 2008"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Walsall, UK", "Title": "“Decent London Hotel”", "Author": "TravellingSaddler", "ReviewID": "UR15525951", "Content": "Stayed in the Corona for 1 night in Sept '07. Thought it was a cracking little London hotel. My room was based on the ground floor and was very spacious with good facilities. Staff were very friendly and the hotel is loacted very near to Pimlico tube station so it is ideal for anything around that area or just a few tube stops into the west end/central London.", "Date": "May 1, 2008"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Check in / front desk": "2", "Overall": "3.0", "Value": "3", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Malmo, Sweden", "Title": "“Good neighbourhood”", "Author": "MarieMalmo", "ReviewID": "UR14482648", "Content": "Yes, the rooms are very small. But for a short stay if you want to stay in this area of London it is a good choice. Clean bathroom - but dont plan to wash anything else than your hands in the basin unless you want water all over the floor. An added electrical radiator was an unexpected and welcome bonus since english houses tend to be cold indoors in March. The breakfast was ok (nothing to write home about). I got what I paid for. (65 GBP/night)", "Date": "March 24, 2008"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Check in / front desk": "3", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Stoke-on-Trent", "Title": "“Great triple room”", "Author": "dobo1", "ReviewID": "UR14336343", "Content": "Spent a girls weekend at this centrally located hotel. Triple room was very spacious and very good value for money. Hotel very clean and pleasent, and staff helpful and friendly. Short walk to Houses of Parliament or Buckingham Palace. We will definately use this hotel again.", "Date": "March 17, 2008"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Check in / front desk": "5", "Overall": "3.0", "Value": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Los Angeles, California", "Title": "“OK for Brief Stay”", "Author": "JasmineMarti", "ReviewID": "UR13265429", "Content": "I stayed at the Corona Hotel for one night. Having arrived early in the morning, the room was not ready yet, but the front desk gentleman was very kind, and invited me to eat breakfast compliments of the hotel. When I came back in the afternoon, the room was clean, but very small. The bathroom also was very clean, but again very small. It had the smallest corner sink I had ever seen, I did not know they were manufactured that small. Overall, for one night in London, if you are using the place to just sleep, it was just fine.", "Date": "February 4, 2008"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Business service (e.g., internet access)": "3", "Check in / front desk": "5", "Overall": "3.0", "Value": "3", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Dublin", "Title": "“Compact Hotel.”", "Author": "Dublin_Dude", "ReviewID": "UR11874396", "Content": "Stayed for 3 nights, 1 double room with breakfast. Had breakfast 1st morning and decided to not bother as it was very basic, but this was not a problem for us. Yes the rooms are compact, and bathrooms are tiny only room for 1 person. Overall very pleasant stay and the front office staff were very welcoming. The only thing that was very annoying was the chamber maid kept slamming, the entrance door to the tiny corridor outside the bedroom, and well we were only 20 minutes pass check out time. Would stay again providing the price was OK...", "Date": "December 21, 2007"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Check in / front desk": "1", "Overall": "2.0", "Rooms": "2", "Location": "4"}, "AuthorLocation": "Bath", "Title": "“Important Feedback”", "Author": "MortonBath", "ReviewID": "UR10853630", "Content": "Poor reception when I arrived, no customer care. Double room extremely small and facilities basic but clean. Decoration poor. Wash hand basin miniscule with no room around it. TV remote control did not work but was eventually provided with another. No bar or restaurant. I had to ask for advice on where to eat. Room cold and no central heating but had a heater that worked. Receptionist did not even say Good morning the next morning! Continental breakfast below average and customer care poor again. Had to pay for newspaper and was not advised of this Location pleasant. Altogether a disappointing stay and do not intend to stay at this hotal again.", "Date": "November 16, 2007"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Check in / front desk": "4", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Rochdale, United Kingdom", "Title": "“Better Than Expected”", "Author": "TABRochdale", "ReviewID": "UR10716053", "Content": "We stayed at the hotel for 4 nights and having read some of the reviews AFTER we booked we were a little concerned about the hotel. However, in the main we had a good stay and would stay there again if in the area. The staff were friendly on arrival and the rooms were compact (we booked a family room for three people) and you had to dodge round a bit sometimes. As we planned to spend most of our time seeing the sights of London this was ok. The bathroom was fine and as others have said, the shower had plenty of space and was fairly powerful. When we have stayed in a family room before we have had to ask for extra towels as they usualyy only leave two of everything. It was nice to find we had three of everything for a change. Everything was clean and we did not have any 'smells' that other guests reported. Our room was on the second floor at the front of the hotel and although there was some noise from the street it did not cause any real problems. The only problem was the breakfast room which is small for the number of rooms in the hotel. There are only 30 seats available and unless you get there for the start of breakfast or the end of serving there is uaually a queue to get a table. We also found that it is set for couples and if there are three or more people, it could be difficult to get seats together. We tried to move two tables together on the first morning and the restaurant manageress went a bit over the top and told us we could not move the tables (someone else made a comment about her in a previous review). We insisted and asked to bring the hotel manager if it was a problem and she backed away and was very pleasant with us for the rest of our stay. So stand your ground to get the seating you want. Oh and you only get complimentary biscuits for the first day of your stay which seemed a little on the mean side. If you booked in everyday you would get them! There is a little Italian restaurant just up the road ' SOLE MIO' which is reasonably priced and the food is top quality. The hotel is just 4-5 minutes walk from Pimlico Underground which is on the Victoria line which is handy for central London and also runs directly to Euston Station if you arrive by train. You can get a day rover ticket for £5.10 after 9.30am which lasts for the remainder of the day. generally a thumbs up and we would stay again.", "Date": "November 9, 2007"}, {"Ratings": {"Service": "2", "Cleanliness": "1", "Check in / front desk": "2", "Overall": "1.0", "Value": "1", "Rooms": "1", "Location": "2"}, "AuthorLocation": "Canada.", "Title": "“Would not go back”", "Author": "ValpOntario", "ReviewID": "UR10197300", "Content": "The room was the smallest, smelliest and most expensive place we have ever been in. We were winding down our trip to England and looking forward to London after 45years since we went there. What a disappointment in the Hotel. We had to spray the room but still could not get rid of the smell. The bathroom was so small and the room was wedged inbetween the elevator and the cleaners room. Being an old building the floors creaked. On our last night we were to be up early for a flight out and the people above were so noisy. Could not wait to get out of there. As we were prebooked we could not leave, but the experience dampened our trip tremendously.", "Date": "October 21, 2007"}, {"Ratings": {"Service": "1", "Cleanliness": "2", "Business service (e.g., internet access)": "1", "Check in / front desk": "1", "Overall": "1.0", "Value": "1", "Rooms": "1", "Location": "2"}, "AuthorLocation": "Los Angeles", "Title": "“Awful treatment”", "Author": "Collise", "ReviewID": "UR10011961", "Content": "This hotel canceled my reservation eleven days prior to my arrival without contacting me, despite having my email address and home phone number. I arrived to find that I had nowhere to stay after the first night. I was offered no assistance until I requested management. The manager promised to help us find another room the following day. The room they gave us for the night was on the ground floor and extremely noisy. The hotel staff treated us like Lepers as we entered or exited the hotel that night to make phone calls to find another place. They would not let us use their phone without a service fee. The following morning we found that the hotel manager CALLED IN SICK! I would never recommend this hotel to anyone. Although the location is good for sightseeing, the area is noisy and the hotel staff inconsiderate. At over $180 (U.S.) per night you would be better off staying outside the city and take the underground railway into the city during the day. The transportation system in the UK is convenient and cheap.", "Date": "September 27, 2007"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Check in / front desk": "3", "Overall": "3.0", "Value": "3", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Vejle, Denmark", "Title": "“Basic, but clean”", "Author": "Mopa1009", "ReviewID": "UR10009995", "Content": "We chose Corona because of the reviews here, stating that the hotel was relatively clean. This turned out to be true, so we won't complain about that. In fact we won't complain about a lot; we got what we payed for which was a basic London budgetclass hotel. The breakfast was ok, but not any more than that. The room was small, placed on lower ground floor (I call that a cellar), but everything was clean, which was what we wanted in the first place.", "Date": "September 27, 2007"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Check in / front desk": "3", "Overall": "1.0", "Value": "1", "Rooms": "1", "Location": "2"}, "AuthorLocation": "Aberdeen", "Title": "“Give it a wide berth”", "Author": "TETAberdeen", "ReviewID": "UR8877631", "Content": "Small and cramped is the best way to describe this hotel. I must have stayed somewhere different compared to the 'small and luxurious' hotel being described by some of the writers. The Receptionist on arrival was friendly and helpful. The Receptionist on departure asked 'which room' and 'enter you PIN'. No other words. The breakfast staff, of which there appeared to be 2 were incredibly busy - more on the food later, but didn't appear to be welcoming guests. The room - I booked a single as I was travelling alone. There must be bigger cells in HM Prisons as to the room I stayed in. The room was about the width of two and a half single beds and depth of one and a half. There were 3 windows. Two were incredibly small and the third had been painted over with black paint. The curtains were matching but one piece of fabric which didn't fully cover the window (although there was a cream coloured fabric covering the glass. I had to stand on the bed or the chair to see out of the window. The desk had 3 drawers, one of which had been removed. The bottom drawer held the kettle and cup, some tea, coffee etc. The hairdryer which was fixed was adequate but you had to hold your hand on the button to keep it going. At the bottom of the bed there was a wardrobe, with no door and a tray stand inside with a 14\" portable on top of the wardrobe. The ensuite consisted of a shower, toilet and wash-hand basin. Again it was incredibly small, room only to stand between the loo and shower. The towels were quite hard and seemed to be fairly old. The shower was hot with good pressure. The room was tidied and bed made but the linen on the bed wasn't changed though I did receive fresh towels. The selection from room service was disgraceful. 3 hot meals consisting of Tomato Soup, Lasagne and Cannonilli. The rest was sandwiches. The breakfast room was located in the basement of the building. It was filled to over flowing when I went down. I hovered for a bit before I was given a table. The breakfast consisted of orange and apple juice (glasses were slow in coming), cereal (4 types), fruit (4 types - one was prunes and another grapefruit), hard small rolls, croissants, ham and cheese. Tea and coffee. Toast came as I was leaving but no butter or jam. Another guest was put at my table as she was on her own also. It would have been nice to have been asked. This is most definitely NOT a hotel I would recommend. If possible give it a wide berth - spend the extra £20 on something more adequate.", "Date": "September 24, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Barcelona", "Title": "“Great hotel at a great location”", "Author": "Zyro", "ReviewID": "UR8660344", "Content": "I stayed in this hotel with my boyfriend a few years ago, in winter and I must say that it's a beautiful place to stay, the bedroom always was clean, the bathroom is big and everything seems new for each visitor. They have a free continental breakfast with cereals, juice, hot milk, coffe, cookies and many other things. The hotel is near Victoria Station (10 minutes by foot aprox.) and you have a tube station 2 minutes away from the hotel aprox. Although you can walk to many attractions like Big Ben, British London Eye or Trafalgar Square, I like walk by the cities I visit so if you like walk too, it's a great thing to do to visit in a different way the city.", "Date": "September 5, 2007"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Check in / front desk": "5", "Overall": "4.0", "Value": "4", "Rooms": "2", "Location": "4"}, "AuthorLocation": "GREECE", "Title": "“very pleasant stay”", "Author": "ANTMAR", "ReviewID": "UR8547730", "Content": "We stayed there for 7 nights-18-24 August. The hotel was clean except a terrible smell the first day-we had to run to a convenient store in order to buy scented candles. Breakfast was poor in selection but what it included was of good quality.However, the breakfast room is very stuffed! We practically, were all seated in the same table! The staff was very helpful, both in the reception and in the breakfast room. The hotel is situated 2 min from Pimlico station and 5 min from Victoria, the bus stop is just opposite the hotel -very convenient. Bus no 24 can take you to Trafalgar sq. or Leicester sq in just 10 min. Do not expect much, but for the price you pay I would recommend it and would definately stay there again. However it is not a 4 star hotel as it states!No way! ANTONIS+MARINA GREECE", "Date": "August 30, 2007"}, {"Ratings": {"Service": "2", "Cleanliness": "4", "Business service (e.g., internet access)": "4", "Check in / front desk": "3", "Overall": "2.0", "Value": "2", "Rooms": "2", "Location": "3"}, "AuthorLocation": "FL", "Title": "“A room, or a closet?”", "Author": "BeerinDaJacuzzi", "ReviewID": "UR8121731", "Content": "Living in the US spoils us all! The Corona, a 3-star? This would be considered a youth hostel in the US!! This place is SMALL! Be very careful and do not stay there during a London heatwave if you cannot take the heat. The fan in the room is tiny and barely adequate. Thank god no heatwave when I stayed (Jul8-10). The bathroom was just 1/2 the size of the tiny room. No room for a desk and chair, tiny single bed that was pretty lumpy. The place passes as adequate because it was clean with no sign of pests. Only 2 small towels provided NOT ENOUGH...one pillow (no room for anymore). Do not bring valuables! There is no hotel safe and I would not trust the front desk. One evening I returned and my valuables could not be located. It took threats and a confrontation before the receptionist located a bag OUTSIDE OF THE SAFE with my valuables. Sounds like a youth hostel! Breakfast: simple rolls, cereals, danishes. Nothing special. This hotel needs a room safe, more towels, and perhaps some air conditioning to be considered a 2-star in the US. In London? I say spend some money for a 4-star which would probably be a US 3-star.", "Date": "July 15, 2007"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "hampshire", "Title": "“Enjoyable stay!”", "Author": "ivahHampshire", "ReviewID": "UR7867599", "Content": "Best hotel bed I have experienced - normally it takes me two or three days to get accustomed. Polite and helpful staff. Excellent breakfast - absoloutely stuffed! Coffee, cerial, mixed fruits, yoghurt, rolls, croissants, cheese, ham and cottage cheese. Could not ask for more! The room was small but adequate, with a colour television and en suite shower - very clean! Personally, I found the rooms very quiet as the hotel is not on a busy road. I had the window open and it was very quiet, so I cannot understand the complaints about noise. I live in the country and any noise would certainly have disturbed me! Very enjoyable will definitely stay there again. Ivor Hobbins, Hampshire, England.", "Date": "June 17, 2007"}, {"Ratings": {"Service": "2", "Cleanliness": "4", "Business service (e.g., internet access)": "5", "Check in / front desk": "4", "Overall": "4.0", "Value": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Edinburgh", "Title": "“A wee gem”", "Author": "Sapphoxxx", "ReviewID": "UR6838147", "Content": "We booked a two night stay in London to go and see a show and were lucky enough to get two nights for the price of one in this hotel. The room was comfortable enough. Some may see it as being a little cramped but lets face it, you don't go to London and spend time in your hotel room! There's plenty of storage and wardrobe space. The shower is brilliant, lots of room and really good power. I was really impressed with the bathroom all round. The only downside to this hotel is the breakfast. The dining room is small and cramped and if you go at the wrong time you'll have to queue for a seat. If you aren't up for breakfast when it begins then you are unlikely to ever see the selection of foods on offer. This hotel does continental breakfasts only and the variety of food available is poor. The pastries run out very quickly, the toast will be cold when it arrives and the restaurant staff are very unfriendly. In fact, the head waitress gets quite uppity if you don't hear her shouting across the room whether you would like tea or coffee! We didn't let this put us off though, for the price you are lucky to get breakfast included and there is no short supply of places in the vicinity where you can get a full english breakfast for next to nothing. We did this the second morning of our stay as we couldn't face the breakfast room again. I will definitely stay at this hotel again, although I won't be having breakfast there!", "Date": "February 25, 2007"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Business service (e.g., internet access)": "5", "Check in / front desk": "4", "Overall": "4.0", "Value": "5", "Rooms": "3", "Location": "5"}, "AuthorLocation": "San Francisco", "Title": "“A little gem in the city of London”", "Author": "SanFranExplorer", "ReviewID": "UR6629920", "Content": "Just spent 3 nights at BW Corona earlier this month and I must say it was quite a plesant experience. I didn't expect much since the price was significantly cheaper than many other hotels in the area but this hotel turned out to be a very good value. The hotel is a property converted from the traditional English residence with British interior decor. Location wise, it's roughly 10 minutes walk to the Victoria Station, which is extremely convenient for me since I had to catch the express train from the station to Gatwick Airport. The room, of course, is your typical European \"single\" size room - small yet functional, very clean and tidy. Absolutely nothing fancy about it but for the price I paid (less than 50 pounds a night), a clean room with a clean bed is all I need and I got exactly just that. The bathroom is small but the shower area is relatively spacious compared to many other hotels that I stayed in Europe before. Breakfast is included in the price but don't expect much other than cold ham & cheese, juice drink, cold cereal, coffee, etc. One thing worths mentioning is the FREE internet access throughout hotel, which is fantastic and very unusual for London. Most hotels in this town will charge you a premieum for that. Many reviews here complained about the front desk reception which I had absolutely no problem with. Maybe I was lucky but I seem to only encounter the professional and courteous staff at the hotel this time. Overall, I give my thumbs up for BW Corona. I walked passed by quite a few hotels on Belgrave but still like this one the best considering what the hotel offers. I will most definitely stay here again next time when I come back to London.", "Date": "January 20, 2007"}, {"Ratings": {"Service": "1", "Cleanliness": "4", "Business service (e.g., internet access)": "3", "Check in / front desk": "1", "Overall": "1.0", "Value": "1", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Derby", "Title": "“Don't expect to feel welcome.!!!”", "Author": "Frisco_del_toro", "ReviewID": "UR6354027", "Content": "Arrived early in the day and was almost trampled by a costumer who wanted help with a flooding room!! receptionist couldn't care less.! Rooms are small for the money. In the morning.. went to ask for a bit of tea in the kitchen as there was noone in the restaurant and no food worth eating avalable.. Met by polish girl who looked like she had a sour lemon stuck in her mouth and it had been in place for several years.. NO SERVICE WITH A SMILE HERE..!!! Was left feeling awful for asking the misserable sod for a cup of tea. She then proceeded to bring cold toast which she dumped unceremoniously on the table .. NO SMILES HERE..!! Wouldn't go back and wouldn't recommend. Go somewhere else for your hard-earned cash.", "Date": "December 9, 2006"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Business service (e.g., internet access)": "2", "Check in / front desk": "4", "Overall": "4.0", "Value": "3", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Winslow,Az", "Title": "“Nice hotel for the money”", "Author": "Amarquez2021", "ReviewID": "UR6135273", "Content": "The Best Western Corona is a nice hotel. The rooms are small by American standards but clean. The staff was very helpful (The two male night clerks were the best). The closest tub station is Palimico (not sure on the spelling). Maybe a three minute walk. There are several resturants in the area as well as a internet cafe. I would recommend this hotel for anyone.", "Date": "November 16, 2006"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Business service (e.g., internet access)": "3", "Check in / front desk": "3", "Overall": "3.0", "Value": "3", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Sheffield, United Kingdom", "Title": "“ok for budget hotel”", "Author": "stalig", "ReviewID": "UR5920157", "Content": "Stayed here for 2 nights due to being on a course nearby. I had booked a single room, which turned out to be a triple with a double and single bed in it, so plenty of space - although would have been very cramped with 3 or even 2 people in the room. The room was ok, basic and small, with a strange musty smell! There were tea and coffee making facilities along with a portable TV and useless hairdrier. The bathroom was very small, but clean with a decent shower. This hotel is on a busy main road, normally this wouldn't be too much of a problem, however, the hotel does not have double glazing, therefore it is very noisy - all night! The breakfast consists of fruit juice, tea/cofffee, toast, cereal, a bit of cheese and ham and stale croissants and bread buns. The best thing about this hotel is it's location, which for the price probably can't be beaten. It is a 10 minute walk to Victoria and 5 minute walk to Pimlico with plenty of bars and restaurants nearby. In all, this is a basic/budget hotel in a great location - you get what you pay for. I've stayed in worse but also stayed in a lot better!", "Date": "October 5, 2006"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Business service (e.g., internet access)": "4", "Check in / front desk": "3", "Overall": "4.0", "Value": "3", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Melbourne, Australia", "Title": "“Not action central, but a great place to stay for lone traveller”", "Author": "sandboy", "ReviewID": "UR5856722", "Content": "The rooms here are VERY small (the smallest in all of my european trip), but very clean and I found quiet. The bed was comfortable and free in room wifi if you have your own laptop. The location is not action central, but is close to the underground and a 24hr bus (route 24 I think) runs right past the front door and takes you to the action/clubs/theatres in the west end. If you are travelling alone and are a bit past the partying demographic I would highly recommend it. There are a few restaurants and pubs in the area which I had some good reasonable meals at. Had no trouble coming from Heathrow to the hotel via the tube (prob 400m walk). Would stay there again and would recommend it to others looking for a clean quiet place that is close to good transport. Paid about GBP47 pn.", "Date": "September 26, 2006"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Business service (e.g., internet access)": "4", "Check in / front desk": "5", "Overall": "4.0", "Value": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Wisconsin", "Title": "“great staff members”", "Author": "parjatak", "ReviewID": "UR5716671", "Content": "The hotel was pretty average by London standards - small rooms, basic amenities, etc. Two things worked really well for me: the excellent location near Victoria terminus made transportation very accessible. I was also very happy with the friendly staff members who went out of their way to make my stay pleasant. Would definitely recommend it if you are looking for a basic relatively inexpensive lodging in London. devarati Wisconsin, USA", "Date": "August 28, 2006"}, {"Ratings": {"Service": "2", "Cleanliness": "2", "Check in / front desk": "2", "Overall": "2.0", "Value": "2", "Rooms": "2", "Location": "3"}, "AuthorLocation": "Bristol, UK", "Title": "“Poor service”", "Author": "Torianna", "ReviewID": "UR5602422", "Content": "3 of us travelled here on business and I can safely say I will not be staying here next time. Check in was fine but the rooms although an acceptable size had an appalling smell, even with the window open all day. I requested a complimentary newspaper each day and only received one of 3 when i specifically told the receptionist I'd wanted one the night before, the 3rd never arrived. Breakfast is poor, and there are only a handful of tables so we had to wait 15 mins one morning. There's a small selection of stale rolls, ham, cheese, canned fruits and cereals and the tea and coffee is at the end of the self serve area - but do not try to serve yourself the hot drinks, the incredibly rude waitress runs out to take it from you! The location is quiet enough and just around the corner from Pimlico tube and there are a few nice eateries in easy reach. This said, with the staff generally rude and unhelpful, requests not fulfilled and the breakfast as it was, i wouldn't stay again even for a few nights on business.", "Date": "August 12, 2006"}], "HotelInfo": {"Name": "BEST WESTERN Corona", "HotelURL": "/ShowUserReviews-g186338-d193153-Reviews-BEST_WESTERN_Corona-London_England.html", "Price": "$128 - $237*", "Address": "<address class=\"addressReset\"> <span rel=\"v:address\"> <span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">85 - 89 Belgrave Road</span> | <span class=\"extended-address\">Victoria</span>, <span class=\"locality\"><span property=\"v:locality\">London</span> <span property=\"v:postal-code\">SW1V 2BQ</span></span>, <span class=\"country-name\" property=\"v:country-name\">England</span> </span> </span> </address>", "HotelID": "2514519", "ImgURL": "http://media-cdn.tripadvisor.com/media/ProviderThumbnails/dirs/f7/bd/f7bd9ef406280c56c7ce9dc7d8fb32734large.jpg"}}