{"Reviews": [{"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Redruth", "Title": "“Friendly and good value”", "Author": "twincart", "ReviewID": "UR126819350", "Content": "Our room was large and quiet, overlooking the garden, which was very pleasant. The decor and furniture were basic, but the bed was comfortable and the TV was pretty new. The shower cubicle was a very good size and the room and bathroom spotlessly clean. Breakfasts were good, with a good range of options.The staff were all very friendly and helpful The location was good and the price very reasonable.", "Date": "March 28, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "4", "Sleep Quality": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "South Wales", "Title": "“basic but comfortable”", "Author": "Anna_in_Wales", "ReviewID": "UR122732736", "Content": "Our room was basic, but large, clean and quite comfortable. The furniture could use a bit of update. The breakfast was very decent (they should have more tables available), the staff was polite, and the hotel was located very conveniently 5min walk from Woodsite Park tube station (approx. 20min travel to the city centre). Good value for money.", "Date": "January 7, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Ireland", "Title": "“Great Breakast!”", "Author": "JonathanIreland", "ReviewID": "UR121088825", "Content": "My wife and I stayed here for 3 days. We had a triple room with a double bed and a single bed. The room was basic but a reasonable size, clean with a TV and tea making facilities. The en suite was a bit small. You have to sit sideways on the toilet!. The metal shower was good but there was nowhere to put soap etc. There were plenty of towels provided. Our room was quiet on Thursday and Friday but there was more noise on Saturday night presumably due to the other guests. Breakfast started at 6.30 in the week and at 8 on weekends. The basic breakfast consisted of two sausages, two slices bacon, 1 egg, 2 tomatoes, 3 three mushrooms, two tomatoes and baked beans. This came with as much toast as you required. Cereals, yogurts etc were also provided. Service was cheerful and very efficient. We went when breakfast started and never had to queue. Overal great value for London at £80 per day. A good Italian restaurant nearby was Chix Chocs. The hotel is 5 minutes from the underground but only 3 minutes from the shops-buses.", "Date": "November 27, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Luxembourg", "Title": "“Good place to get your head down.”", "Author": "Serenesiren", "ReviewID": "UR120910784", "Content": "This is a basic B and B, clean and a good location. There is no bar and the breakfast room can get a little crowded. The staff were helpful and polite.", "Date": "November 22, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "3", "Overall": "4.0", "Value": "3", "Service": "5"}, "AuthorLocation": "Wrexham, United Kingdom", "Title": "“Further than we thought...”", "Author": "catttmail", "ReviewID": "UR115060544", "Content": "Booked this hotel due to its advertised distance to Alexandra Palace, sadly it was further to get to than we thought, a 15 minute taxi ride which added to our cost, no tube or bus. On the plus, this is a lovely presented hotel with spacious rooms and very friendly hosts which served a lovely breakfast. Although the local town is only a 5 minute walk we didnt find any nice bars or restaurants, it was abit rough.... I would recommend this hotel as its clean, friendly and a 5 minute walk from the tube", "Date": "July 5, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "4.0", "Value": "5", "Service": "5"}, "AuthorLocation": "canberra", "Title": "“Would certainly recommend this guest house”", "Author": "lgblakers", "ReviewID": "UR114747869", "Content": "The rooms were large (we had two different ones) and comfortabley furnished.Bathrooms clean and also good size. The cooked breakfast was excellent though there could have been more choice in cereals etc. The staff were extremely helpful and went out of their way to assist. us .Close to tube shops and restaurants...good value if you want something in N.London", "Date": "June 25, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "staffs", "Title": "“Very convenient and comfortable”", "Author": "Seasoned69", "ReviewID": "UR108675955", "Content": "This guest house is in a superb location being just a short walk down a very pleasant side street to the main road where there are plenty of bars and restaurants. The owner is friendly and attentive without being overbearing and the general feel of the guest house is one of cleanliness and comfort. Our room was large with a bay window and had everything you would expect including digital tv. The breakfast was very good quality. I don't think you can go wrong with this one if you are looking for good value accommodation close to the capital.", "Date": "May 17, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Maple Valley, Washington", "Title": "“Lovely small hotel, not far from city”", "Author": "JohnHMapleValley_WA", "ReviewID": "UR87941198", "Content": "We were looking for a nice, quiet and reasonably priced hotel for a visit with our daughter in London. While we've stayed in some hotels in downtown areas, many of the hotels are either too high priced, in a \"dodgy\" area, or funky/not well maintained. We are not afraid of going further afield nor of riding the Tube, so when we stumbled across Heatherbank, we decided to give it a try-- what a great choice. Jackie Patel, family, and staff run this boutique hotel in North Finchley, not far from the Woodside Park tube station on the Northern line. The hotel is on a quiet street, about 500 meters from the Tube station and about 200 meters from the High Street with shops, restaurants. Jackie was not bothered at all when we arrived at 1130 at night, nor with our need to sleep in the next day! The hotel is a set of old houses that they have been refurbishing very nicely and the rooms are filled with cool old touches like scalloped ceilings, beautiful woodwork, etc. Full breakfast is included-- pretty much anything you would like! The hotel also features a huge backyard that we would have loved to have used when we traveled with kids (but in the summer, it looks like it would be an oasis to rest in, too). Parking is a bit tough in the area, but there are spots available in front of the hotel (we just tubed it-- about 25 minutes to King's Cross). Some folks would find that too far, but we figured it was a small price to pay for a great hotel at a reasonable cost. Bathrooms are small, but functional and clean-- and equipped with instant hot water for showers. A little noise from people coming and going, but not much more than you'd have at any other hotel Downsides? not many that I can think of... Would be great if they'd move a few hundred meters closer to the tube (just kidding!). Not a lot of nightlife around (a few pubs), but we're not really into Discos and all-night partying anyway. They are upgrading mattresses and had not replaced ours yet, but it needed it. Despite these would we stay there again? You Bet!", "Date": "November 22, 2010"}, {"Ratings": {"Service": "2", "Cleanliness": "4", "Check in / front desk": "3", "Overall": "2.0", "Value": "2", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Grimsby, United Kingdom", "Title": "“Good Quality”", "Author": "GKHA", "ReviewID": "UR13777128", "Content": "Stayed at the Heathebank Hotel in February 2008. The room we stayed in was excellent in quality & cleanliness. Staff were not particulary welcoming or friendly. My email requesting hotel booking confirmation & car parking request was ignored so I had to telephone to confirm. Woken early by other guests noisily going for breakfast at 6am (close doors quitely!) Good location for tube service into central London & road networks to North of London. Good choice for breakfast. Reasonable value for money overall.", "Date": "February 23, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Business service (e.g., internet access)": "4", "Check in / front desk": "4", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Dallas, Texas", "Title": "“Loved it”", "Author": "Scyene", "ReviewID": "UR8213092", "Content": "I was in London with substandard arrangements so a friend suggested Heatherbank Guesthouse. So while I was in Paris on the weekend, I called and booked the room, and it was so easy. The breakfast was nice, and the area wasn't dodgy (unlike original location). Very nice staff, and even have arrangements to transport to the airport for a reasonable fee considering the airport is light years away. The train is just a three minute or 5min walk straight down the road. The grocery store is straight up the street in the opposite direction and a SUBWAY among other eateries. Great spot! Loved it!", "Date": "July 21, 2007"}], "HotelInfo": {"Name": "Heatherbank Guest House", "HotelURL": "/ShowUserReviews-g186338-d279653-Reviews-Heatherbank_Guest_House-London_England.html", "Price": "$119 - $237*", "Address": "<address> <span rel=\"v:address\"> <span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">25 - 27 Woodside Park Road</span> | <span class=\"extended-address\">North Finchley</span>, <span class=\"locality\"><span property=\"v:locality\">London</span> <span property=\"v:postal-code\">N12 8RT</span></span>, <span class=\"country-name\" property=\"v:country-name\">England</span> </span> </span> </address>", "HotelID": "2514550", "ImgURL": "http://media-cdn.tripadvisor.com/media/ProviderThumbnails/dirs/76/49/7649d10cd9e4f80e9e5653782bd831b55large.jpg"}}