{"Reviews": [{"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Chester, United Kingdom", "Title": "“It is was it is.”", "Author": "marksim", "ReviewID": "UR125189596", "Content": "Small room, basic, clean, comfy. If you need somewhere to crash for a night or so and on a budget and willing to make a few compromises you won't go wrong. There is no lift in the hotel so if you have limited mobility it might not be suitable. Would stay again, the receptionist was friendly and efficient and sorted out a power problem quickly after reporting it.", "Date": "February 25, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "2.0", "Value": "4", "Sleep Quality": "1", "Rooms": "1", "Location": "5"}, "AuthorLocation": "Luton, United Kingdom", "Title": "“Even prisoners get more space -”", "Author": "Madrid_Hatter", "ReviewID": "UR124474659", "Content": "I expected a small room but when I walked into the room, I thought I had entered an airline toilet. You find two hooks on the wall to hang your clothes. A small bed and a door that says a tiny loo. There is no room to stand or move about and if there are two of you in the room you have to take it in turn to change while the other sits on the bed. Lying on the bed my head would touch one wall while my feet were touching the other wall. The room has no controllable heating or air-con and even though it was -6 outside the room had the feel of a sauna, so hot that it was sickening. The tiny loo (as it said on the door) was as it said on the door, the shower curtain was about as useful as a chocolate tea pot and the whole cabin ends up soaking wet. The good points are the location of the hotel, very close to the tube and an excellent pub. Sainsbury and Tesco within a five minute walk. Staff were very friendly and courteous a real asset to the hotel. There's basic and then there's Easyhotel basic.", "Date": "February 12, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "3", "Overall": "4.0", "Value": "3", "Location": "4", "Rooms": "3"}, "AuthorLocation": "London, United Kingdom", "Title": "“Basic clean comfy great receptionist”", "Author": "plc76", "ReviewID": "UR122953928", "Content": "Easyhotel promises a basic standard and that's what it delivers if all you need is somewhere to sleep its ok. Even though this hotel is firmly budget end the lady on reception was one of the most courteous, friendly and helpful I have ever encountered.", "Date": "January 12, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "3.0", "Value": "4", "Sleep Quality": "3", "Rooms": "2", "Location": "4"}, "AuthorLocation": "Orange, CA", "Title": "“Very Small Room. Close to tube”", "Author": "Jayda L", "ReviewID": "UR122911584", "Content": "The room we knew was going to be small and for the price we paid it was fine for just one night. The hotel is close to gloucester road tube station and that was the main reason we picked it for just one night. The room was very small for a couple and we had no place to put our bags without falling over each other and the bathroom was also a bit small. So small in fact if you shower to end up soaking anything else in the bathroom at the same time. There are some good shops and places to eat near the hotel. We stayed in august on the top floor and it was a bit like a sauna, and with no air con in the room we did not get much sleep.", "Date": "January 11, 2012"}, {"Ratings": {"Service": "1", "Cleanliness": "3", "Overall": "4.0", "Value": "3", "Sleep Quality": "4", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Birmingham, United Kingdom", "Title": "“Good value”", "Author": "SafariMan149", "ReviewID": "UR121471605", "Content": "£45 per night is good value for central London. The hotel is about 20 minute walk from Gloucester Road tube station - on the way you pass a number of pubs, eateries and shops. The rooms are small - just room for a 3/4 bed, somewhere to stand and a WC/shower cubicle. The only fixtures = a couple of hooks for clothes and a TV - the purchase of a remote is an extra and last only 24hours. Extra towels, cleaning and bed change are also extra. You are just buying the room - no food. There is a vending machine in reception.", "Date": "December 6, 2011"}, {"Ratings": {"Service": "2", "Cleanliness": "4", "Overall": "2.0", "Value": "2", "Location": "2", "Rooms": "1"}, "AuthorLocation": "", "Title": "“Has all the chic of an airplane toilet”", "Author": "HJJT", "ReviewID": "UR120035845", "Content": "When you buy a Tescos value sausage you set your expectations low. The same applies for the Easy Hotel and it is difficult to conceal your disappointment. The room is barely functional and the fit out is EXACTLY the same as an airplane/train toilet. Noisy aircon average beds. Would suggest paying a fraction more for a travel lodge. Easy Hotels is properly bargain basement and I would say expensive given what you get. They even have the audacity to charge you £5 extra for a TV remote. But the room was very clean to be fair. You need to be desperate to stay in one of these.", "Date": "November 1, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "2", "Location": "4"}, "AuthorLocation": "Athens, Greece", "Title": "“Ideal for short stays, if you know what to expect.”", "Author": "manasta", "ReviewID": "UR119651096", "Content": "The Easyhotel South Kensington is ok, if you know what to expect. We were prepared for the size of the room, so we had no shock when we opened the door. The hotel is ideal for those who just want a place to sleep and shower, after a full day in this wonderful city, and do not intend to spend time in the room. The location is fantastic, near two metro stations of Piccadilly Line (very convenient for both Heathrow and major London signs). There is also a big Sainsbury’s supermarket very close to the hotel. The room was clean, the staff was polite and luggage storage costs only 2.5 pounds. It would be perfect if the room was a small shelf to put things like your watch or mobile phone.", "Date": "October 24, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Tamworth, United Kingdom", "Title": "“Great value for a London Hotel”", "Author": "lonzie", "ReviewID": "UR118998355", "Content": "Let´s get one thing straight this is not a place to stay if you intend to spend a lot of time in your hotel room, they are absolutely tiny but if you want a clean room in a good location at a cheap price then this is for you. Rooms are effectively a bed, shower and a toilet but when you've got one of the world'g great citys to explore then what more do you need? The hotel is handy for tube stations (Gloucester Rd) is probably the nearest (5-10 min walk). Kensington High St is also 10 minute walk away and for those of you who are interested in such things there is a launderette and a supermarket less than 5 mins walk away. There are plenty of pubs and restaurants in the vicinity. So to conclude, cheap, clean, great location but very tiny rooms. Would recommend to anyone on a budget", "Date": "October 6, 2011"}, {"Ratings": {"Cleanliness": "2", "Sleep Quality": "1", "Overall": "2.0", "Value": "3", "Service": "2"}, "AuthorLocation": "spoonygee", "Title": "“Not Recommended for Adults/Couples”", "Author": "spoonygee", "ReviewID": "UR117960460", "Content": "We read the great reviews of this \"hotel\" and booked based on all the positive things people had to say. This is an OK place to stay if you are on a TIGHT budget, on a VERY short stay, are travelling alone, and plan on using the room ONLY for sleeping/showering and not as a place to relax after a long day of sight-seeing. My husband and I couldn't fit our luggage AND walk in the room. We were stuck in the very last room in the entire hotel (LG5) which is in the basement with no windows and a gritty, sandpaper flooring). The shower curtain smelled HORRIBLY and was moldy (think of the smell of sweaty hockey equipment and you've come close). The room had no temperature control so I ended up sweating through the sheets, while my husband commented on the stained quilt, however the quilt cover was clean. We slept with the lights on for fear of bugs. The next night we inquired with all nearby hotels until we found a vacancy at the Marriott across the street. The staff was understanding when we explained why we were leaving despite 3 more days we had booked. The refund policy is stupid but understandable (you can get a credit towards future EasyHotel stays as long as you cancel 24 hours in advance), and since we prepaid for the room, we didn't expect to get any sort of refund. The location is fantastic, in Kensington about 2-3 blocks away from the Earls Court tube stop, 1 short block from a large Sainsbury grocery store. I would never stay at an EasyHotel again and would NOT recommend it for MOST travelers.", "Date": "September 11, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "4.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Johannesburg, South Africa", "Title": "“Perfect”", "Author": "Melissa Z", "ReviewID": "UR117065650", "Content": "Perfect and all you need. Very cheap and great location. A very short walk from a massive Sainsbury's, very useful. Helpful staff, very efficient and the rooms are clean. All you're doing is sleeping there, so you don't need anything more than that! I've recommended it!", "Date": "August 22, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "2", "Overall": "2.0", "Value": "2", "Service": "3"}, "AuthorLocation": "tralee", "Title": "“not worth it”", "Author": "jonnyb00", "ReviewID": "UR116649675", "Content": "i usually go for budget hotels, etap, formule1, independents, travelodges - this one isn't worth it, even for the location. for £50, i'd go with one of the independent hotels in the area. the cabin-like rooms, lack of air, i'd have been happy at £30 but not £50.", "Date": "August 13, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Bournemouth, United Kingdom", "Title": "“Great value for money!”", "Author": "ChrisH87", "ReviewID": "UR116409002", "Content": "Stayed here in August '11 for a cheap weekend getaway. Was very impressed - room clean, beds very comfortable and staff very friendly. All in all, a great night's sleep. I recommend this one as long as you are aware of the room sizes! Can't get much better in this location for the price we paid.", "Date": "August 8, 2011"}, {"Ratings": {"Overall": "1.0", "Value": "1", "Service": "1"}, "AuthorLocation": "San Jose, California", "Title": "“No refunds, horrible service”", "Author": "jjmcurry", "ReviewID": "UR114380633", "Content": "We booked then cancelled two rooms. No refunds. $1000 down the drain. Try getting someone to respond to you. We cancelled two weeks in advance , but all they do is credit your hotel account for a year then pocket the money. Unbelievable!", "Date": "June 19, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "London, United Kingdom", "Title": "“EXCELLENT CHOICE!!”", "Author": "Specus", "ReviewID": "UR113845815", "Content": "We spent a really good time in this cosy hotel, It´s the perfect choice when you plan to enjoy the city and finish your day relaxing in a clean, nice and quiet place. Price was great for the good location this hotel offers, close to downtown, museums and 2 tube stations. Safe and nice location! Staff was also very friendly and helpful with us. Totally recommended!!", "Date": "June 16, 2011"}, {"Ratings": {"Service": "2", "Cleanliness": "1", "Overall": "2.0", "Value": "2", "Sleep Quality": "1", "Rooms": "1", "Location": "1"}, "AuthorLocation": "London, United Kingdom", "Title": "“Not Recommended”", "Author": "jamiroquia", "ReviewID": "UR106681553", "Content": "It was one of my worst hotel experience for a very long time. We have previously stayed at other easyhotel, so we kind of know what we are gonna get for that sort of price we pay, but it was far from what we expect. 1) The SOCKETS DIDN'T WORK. Apparently, they knew about it already, but they can't do anything about. They can't change our room cus they're fully booked blah blah blah. So, obviously we can't use any electronic appliance, won't be able to use hairdryer etc. But, that wouldn't be a problem, because number 2 2) There was NO HOT WATER IN THE MIDDLE OF THE NIGHT. We left the water running for literally 15mins, and the water was still COLD. 3) and finally, what you don't want to see after all these nightmares is a COCKROACH IN THE BEDROOM. It's not even a small one, it's nearly as big as my thumb! I don't think I have ever seen a cockroach of that size in the uk....", "Date": "May 3, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "2", "Location": "5"}, "AuthorLocation": "Barnsley, United Kingdom", "Title": "“Great for short stays”", "Author": "0utlier", "ReviewID": "UR100756441", "Content": "I feel I have to reiterate just how tiny the 'small' rooms are in this hotel...! But having read previous reviews we were well prepared. The only negative thing for us was the complete lack of any storage, except for 3 wall hooks. There was easily space for a drawer under the bed which would have gone a long way to easing the problem. As it was, we had our suitcase and clothes piled up in front of the door, which is definitely a fire hazard! But with the negatives out of the way, I think this is a great place for a short visit to London. It's within 5 minutes of Gloucester Rd Tube station and is well served by cafes, restaurants and shops. There's also a Waitrose and Sainsburys really close by. The room was clean and warm, and the shower always had hot water whenever we used it. Plenty of towels The staff on the 24-hour reception were friendly and helpful. Vending machines for hot and cold drinks and snacks are handy. Overall, I'd say this hotel is great value for money and in a really great location. I'd recommend this place for a fuss-free, short-stay in London. Personally, I wouldn't want to stay for longer than a few days as there just wouldn't be enough room for all my stuff! I also wouldn't recommend it if you have any walking difficulties, there's no lift here so if you're in a small room you'll be on the third floor, which is a bit of a hike if you're unfit like me!", "Date": "March 19, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "N.I", "Title": "“Great”", "Author": "Rainai", "ReviewID": "UR97510487", "Content": "I thought I would use easyhotel again since we had no problems with the last one. And again we had no problems with this hotel. There isn't anything bad that I can say about it. Although what I didn't like about the room we had was that the mattress was sunk in and there was no mirror on the wall. The walk to the hotel from the nearest tube station takes a bit more than 5 minutes but along the way there's a supermarket which is quite handy and there are a number of restaurants but most were italian.", "Date": "February 21, 2011"}, {"Ratings": {"Service": "2", "Cleanliness": "4", "Overall": "3.0", "Value": "4", "Sleep Quality": "3", "Rooms": "3", "Location": "2"}, "AuthorLocation": "Yorkshire", "Title": "“Completely no frills and very small but clean and simple”", "Author": "andyshire", "ReviewID": "UR93998829", "Content": "If you're someone who likes to spend time in their hotel room then this isn't the place for you. If you're claustrophobic then likewise. If you hate orange then don't even go there. But if you want somewhere that is completely no frills but clean and basic then this is the place for you. I picked EasyHotel as it was a similar price to many other central London hotels, but I worked on the basis that EasyGroup have a brand reputation to keep up and so it couldn't be too bad. I was right. When I booked I was told that it was a very small room. When I checked in I was also asked \"you do know this is a very small room don't you\". When I got to the room I realised quite how small it was. You could walk from the door of the room to the bed with one stride. The plastic shoe box that is both the shower, toilet and sink is similarly tiny. However it sort of works. It's clean and the bed is possibly the most spacious thing in the room. My room didn't have a window and so it could be a bit too stuffy and claustrophobic for some. A decent hotel, very simply but good if you want somewhere cheap and reliable to stay in. The only negatives I have is that the location is not ideal. It is just slightly too far from the surrounding tube stations and so if you have luggage it feels a bit of a drag.", "Date": "January 21, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Sleep Quality": "3", "Rooms": "2", "Location": "5"}, "AuthorLocation": "gooder77", "Title": "“Ok place to lay your head as long as you understand what you're getting”", "Author": "gooder77", "ReviewID": "UR89004838", "Content": "EasyHotel is described as a no frills hotel. Very basic. You get a bed and toilet, sink, and shower in a little train cabin-like compartment. Good: Inexpensive Clean Very nice and helpful staff Good location – close to restaurants, shopping, public transportation (Tube) Bad: Poor room configuration– This is for the \"standard\" room. 2 people in a room may prove difficult to move about. We stayed in the Yotel at Heathrow (Terminal 4). It was even smaller but had a better layout and we didn’t have issue moving past each other. Not many electrical outlets, or outlets not located in ideal location “Standard” room (smaller rooms) are located on the top floors. Lots of steps. Our room was 4.3…4th floor (top floor), no elevator. Standard rooms especially bathroom may be small for taller, or bigger people. My wife and I short (<5’6”) and felt slightly cramped Only 2 hooks to hang bags, jacket, etc – we ended up with most of our belongs on the bed. Many additional charges – TV, internet, luggage check. See site for full listing Overall: For the budget minded traveler this may be a good option. As long as you know, understand, and accept that EasyHotel is “no frills” and is very basic it is a decent value if you are only staying for 1 night. We chose the hotel with the intent on shopping during our 1 night layover. Unfortunately, our flight was delayed and all shops were closed by the time we arrived. If we had another long layover in London and had no plans to shop in the city we would chose the Yotel at Heathrow Airport instead. It has a better room layout, free TV and free internet, table, chair, and readily accessible electrical outlets.", "Date": "December 4, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "3", "Rooms": "3", "Location": "5"}, "AuthorLocation": "London", "Title": "“VERY HELPFUL STAFF AND GREAT LOCATION”", "Author": "gile", "ReviewID": "UR87912085", "Content": "My company booked this hotel for me and I was pleasantly surprised as I had seen the previous reviews. Normally I don’t stay in budget hotels but this time I didn’t have an option. Reception staff is a credit to the hotel, they were helpful and very polite. I had a problem with the internet connection and they went out of their way to help me. If you are looking for service and value for money I would recommend this hotel", "Date": "November 22, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "4.0", "Value": "3", "Sleep Quality": "3", "Rooms": "2", "Location": "4"}, "AuthorLocation": "Heidelberg, Germany", "Title": "“VERY SMALL but good price”", "Author": "HANSIBANSI", "ReviewID": "UR86717026", "Content": "For London the easyhotel has a very decent price to offer. The room is tiny tiny tiny, however if you are not planning on being in the room any longer than for sleeping and showering it is alright. It is located quite well, with a subway stop around the corner, restaurants and stores are close by.", "Date": "November 11, 2010"}, {"Ratings": {"Service": "2", "Cleanliness": "4", "Overall": "2.0", "Value": "2", "Sleep Quality": "2", "Rooms": "2", "Location": "4"}, "AuthorLocation": "Melbourne, Australia", "Title": "“Really nice staff but depressing place”", "Author": "Gotoday1", "ReviewID": "UR83397358", "Content": "Good location and clean but the rooms are really small and have no windows. Felt like being incarcerated and I considering that I was going to be in London for a week, I decided that I didn't need to put myself through the experience of staying here. Suits a purpose if all you want is a place to sleep I guess.", "Date": "October 13, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "4", "Sleep Quality": "3", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Toronto, Canada", "Title": "“Great location but tiny rooms”", "Author": "TLTraveller", "ReviewID": "UR79261975", "Content": "As expected, I knew this will be a no-frills hotel. I booked a single room with no window. The room is basically a double bed, a toilet and shower. If you try fitting two people in there with luggage, it will be quite claustrophobic. Though for the price for this convient location it maybe something one can live with for a short time. As a single traveler, I didnt mind so much the space deprivaty. Inquire about the larger rooms if they have. Luggage storage for a fee (depending on length of stay). Room cleaning is extra, Extra towels is extra, Internet and TV are extra. So things can start adding up if you want all the services. I would consider going back if I was a single traveler again. Likes: Location - About a 5 minute walk from Gloucester Station (across from the Marriott Hotel). Which is accessable by the Piccadilly line from Heathrow airport. Grocery/Convience stores close by. Walkable to many of London's attractions (Kensington Palace, Buckinham, Albert Hall) Dislikes: Thin walls, I could hear the guy next door snoring. Tiny washroom. One can sit on the can and take a shower at the same time.", "Date": "September 12, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "5", "Sleep Quality": "3", "Rooms": "2", "Location": "4"}, "AuthorLocation": "Toulouse, France", "Title": "“A bit like a prison cell, but in a good way”", "Author": "bntcurtis", "ReviewID": "UR78570764", "Content": "The idea behind easyHotels really appealed to me: A clean room and bed in a good location for not much money. I figured, who would want to spend their time in London sitting around at the hotel when there's so much else to do. At any rate, easyHotel lived up to my expectations, but I can see how others would be turned off by the spartan amenities. Pluses: + good location, close to many attractions and tube stations + clean + cheap Minuses: - room bordered on the ascetic (no window, no furniture) - a bit noisy (I slept with earplugs) - there's a charge for every extra (including leaving your luggage after checkout)", "Date": "September 7, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "3", "Rooms": "3", "Location": "5"}, "AuthorLocation": "mansfield", "Title": "“Very clean but very basic”", "Author": "ijw54", "ReviewID": "UR75006615", "Content": "I booked the hotel online and thought the price reasonable for a 2 night stay at the last minute. £45 per night for a room in London in August is extremely good value. I chose a double room with no windows as I knew we only needed a room to sleep in. The room, located in the basement via 2 sets of stairs (but no lift), was very basic, literally just a bed and bathroom facilties. Even my small 5 yr old grandson, commenting as we walked in the room exclaimed 'Is this it!!' It was very inventive how easyhotel managed to squeeze a toilet,washbasin and shower into the tiniest space. There was a tv on the wall, but you had to pay £5 for use of remote (from reception). No bedside lamp, but you can control main lights (using dimmer) from the bed, a couple of sockets by the bed, but too far away from mirror in bathroom. No tea/coffee making facilities, but a vending machine in reception. Internet services I think were charged by the half hour. In hindsight I wish I'd booked a room with windows as this room felt claustrophobic, but it had air conditioning so very well ventilated. Because it was in the basement I couldn't get a signal for my mobile so had to go to street level to make calls. There isn't anywhere to sit, so we ending up sitting on the steps outside. The only problem was that that's where the smokers were as well. The hotel is situated a good 5 minutes walk from the underground. Lots of good eating places along Earl's Court Road, we had breakfast at McDonalds, and one evening meal at Nandos. Underground connections good, and about 30 mins from Kings Cross/St Pancras. Personally I don't know whether I would stay here again, simply because of the lack of home comforts. I like to read in bed and be able to make a hot drink! I usually stay at Travleodge, booking in advance, in a £29 room. But as I said at the beginning, this was last minute. It was clean, it was basic, and you didn't have to share a bathroom. I have to mention that the staff were very helpful when my grandson had a small 'accident' during the first night. I was mortified, but they dealt with it very matter of factly, so top marks to them.", "Date": "August 13, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "4", "Overall": "1.0", "Value": "2", "Sleep Quality": "2", "Rooms": "1", "Location": "4"}, "AuthorLocation": "Sao Paulo, SP", "Title": "“Worse than a hostel”", "Author": "alessandrosra", "ReviewID": "UR74783421", "Content": "I unfortunately chose Easyhotel to stay in the hope that it would be a simple but comfortable place to stay. It resulted that, differently from what they state, the room does not have even the basic facilities to survive. 1. There is no table and insufficient space for your bags. The result is that your luggage will be around the places you are supposed to walk or up in your bed. After a few days you will be sleeping with your bags because you will get tired of taking them from ground to bed and vice versa all the time. 2. Additionally forget about comfortable using a laptop or writing anything - you will have to do it over your bed as there are no table or anything like, inside the room and outside. Prepare your back. 3. The bathroom is absolutely small. Smaller than you can imagine. Taking a shower is hell. The shower is horrible also. 4. There is no cleaning, unless you pay, no internet, unless you pay, no television, unless you pay. In few days you will either be paying a average hotel fare or be living in sty. I don't usually write reviews, but this one I had to do as no one deserves such a bad experience like mine. Best of luck on your trips.", "Date": "August 11, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Dublin", "Title": "“Helpful staff”", "Author": "TouristDublin", "ReviewID": "UR74603059", "Content": "I stayed here at the weekend and was prepared (having stayed in Easyhotels before) for the size of the room. Room was possibly the least likeable of the three I've stayed in (Victoria and Paddington being the others). Room was roasting and no air. Angela the receptionist was so helpful, got me a fan, a sheet and some water when she felt that the temperature controls were not functioning as they should. So thoughtful and very friendly. Not just interested in taking the cash! Good value for the location if you just need bed and shower!", "Date": "August 10, 2010"}, {"Ratings": {"Service": "2", "Cleanliness": "2", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "4"}, "AuthorLocation": "Los Angeles, California", "Title": "“Huge mistake staying here- almost ruined our trip to London!”", "Author": "neufus", "ReviewID": "UR73254856", "Content": "My boyfriend and I stayed all over Europe in budget hotels. Some smaller than others; some even only some what bigger than this place. The difference here is that you can absolutely feel this company cares nothing for the people who stay here and have no problem with swindling or tricking you. You want us to pay for the remote to the tv that might make this little orange prison feel a little less terrible; fine, I can do without it. No window? Hey, I probably would've jumped out of it by now anyway. Don't care that they're not going to clean my room. Don't care that there is no elevator and we had to lug our stuff up about 5-6 flights of stairs after a long day of traveling. And the bathroom that I could use the toilet, shower, and brush my teeth in all at once- fine. But I think they are extremely misleading calling these double rooms. Think of it this way if you happen to make our mistake and open the door to your room for the first time. Would you ever keep your dog or cat in here, even for a night? The answer is probably \"no\". So why would humans inhabit such a small space? They could have easily made this amount of room livable with shelves, a bed that could fit things underneath, more hooks.. I could go on forever. But like I said, this place doesn't care about their customers, only their money. So here's where it gets uncomfortable. You've been traveling a month through Europe and each have a regular sized suitcase. They don't really fit. You will always be tripping over them and wrestling to figure out a way to open them in the morning and at night when you need to change your clothes. Want to go to the bathroom? Good luck getting past those suitcases to the light switch, then going back around, then trying to shimmy the door open. Once inside the bathroom, where there is almost no room for anything you might need you can expect the worst. Tip: always keep the toilet seat down. My contact solution (which is a thin, small size) couldn't make it on the little ledge by the sink and promptly fell right into the toilet. This was my breaking point. Whether you stay here a day or 10 days they are only giving you one towel per person; each other towel will cost you. Seriously? I don't care that the maid doesn't clean the room; how could she when there isn't even a place to walk? But if she does for some reason be prepared to pay to store your luggage in addition to having her clean your room. As for the bed this is another story. It is at least passable for comfort, however, whoever is sleeping on the outside is going to get crushed every time the other person has to climb over them to use the bathroom. Have some things plugged into the wall? They will fall out every single time you walk by, regardless of how careful you are. If you wear glasses it's a huge struggle not to get them broken in here as there is no where to store them when you go to sleep. The tiny piece of orange that sticks out from the side of your bed is not sufficient to even hold those. How could they not put even a tiny shelf somewhere near the bed? It doesn't take a rocket scientist to figure this stuff out! As for the wifi you can pay for don't bother. It only works on the very lowest floor or sometimes only if you sit outside on their stoop. Easily fixable by adding routers but what do they care about you? That seems to be the ongoing theme here. And the last punch to your gut; you decide you can't take it anymore. Can we upgrade to the slightly bigger room where there is space on each side of the bed so no one gets hurt when someone has to pee? Yes, for a night here and there. But no, not really. Can I get a refund? Sure, go to our website. Website says to cancel however many days and pay a 10 pound fine- the rest will be credited to your account. Well, we didn't notice that the first time they wrote account it was actually to our \"account\". So no, you will NOT be getting back your money, despite how horrible these living conditions are. This is for your easyhotel account! Because you will definitely want to come back in the near future (within 12 months) and live through this absolute nightmare again. NO THANKS. Please beware- I know this review is long but people need to know what they are getting into. An orange prison of insanity that no one should stay in more than 1 night. A place where the staff is nice and smiles but never can actually help you. This hotel almost ruined our entire trip to London. Maybe it is just a place to sleep, but when you are traveling all over the place you need a chance to rest and this is not going to be a hotel that will provide that in any way!", "Date": "August 1, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "3", "Rooms": "2", "Location": "5"}, "AuthorLocation": "Copenhagen, Denmark", "Title": "“Great staff”", "Author": "BOS33", "ReviewID": "UR72130128", "Content": "We were there for eight nights in all, in three rooms, with children aged 12, 15 and 18, and we found the young staff very helpful and friendly at all times. The hotel facilities are very basic, just as you would expect at that price, but the rooms, though tiny and windowless, are clean and very secure, and of course the location is perfect - within walking distance of the museums, Earl's Court and Harrods, and close to tube stations. Coffee and tea are available at reception, and Sainsbury's around the corner has a Starbucks café for breakfast. The restaurants along Cromwell Road range from good to poor and overpriced. For a better selection and value for money, try nearby Earl's Court Road. (The Gourmet Burger Kitchen is particularly recommended. ) This hotel is not for those who like luxury, but as a kind of \"camping in the city\", and as value for money, it is highly recommended.", "Date": "July 24, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Burton upon Trent, United Kingdom", "Title": "“Excellent!”", "Author": "maciety", "ReviewID": "UR70962236", "Content": "I spend there three nights while on a city break in London and cannot say anything wrong about the hotel. For the little price I paid I got a spotless clean room with own bathroom and comfy bed in a prime location. I booked a small room without window, as I needed it only to get clean and rest, and the room satisfied these needs perfectly. Hotel staff was friendly and helpful, always happy to help me with valuable advice to my endless questions about all sorts of things. The best was the location as everything was just few bus or tube stops away. The room size and visual appearance was an attraction itself for me as I haven’t seen anything like this before ;). Overall I would recommend this hotel to anyone on a tight budget but not claustrophobic.", "Date": "July 15, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "5", "Overall": "1.0", "Value": "5", "Sleep Quality": "1", "Rooms": "1", "Location": "5"}, "AuthorLocation": "London", "Title": "“One of the worst stays”", "Author": "Al1234London", "ReviewID": "UR70544806", "Content": "There was no room temperature control in the room, the room was way too cold, I got sick. It was the worst stay ever", "Date": "July 11, 2010"}, {"Ratings": {"Service": "2", "Cleanliness": "2", "Overall": "3.0", "Value": "2", "Sleep Quality": "2", "Rooms": "2", "Location": "3"}, "AuthorLocation": "chennai", "Title": "“Only for people who are in tight budget”", "Author": "feenixs", "ReviewID": "UR69275411", "Content": "The hotel is only for peoples who planned their trip with low budget. The rooms are 65-75 sq. ft. among them the most space was taken up by standard double beds. There is no lift or Elevator facilities there to lift our luggage's, so make sure to book on the first few floors. peoples holding big luggage's are not recommended because of small room size. the hotel provide Wifi access with some few additional bugs, There are flatscreen TVs in every unit, but a 5pounds fee is assessed to use the set. also there is a vending machine for water, soda drinks and chocolate bars is available and there is no dining room there in the hotel. we have to pay additional for room service s like cleaning, toilet papers and towels the hotel is located near to two train stations-Gloucester Road and South Kensington.", "Date": "June 30, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "3", "Rooms": "2", "Location": "4"}, "AuthorLocation": "Munich, Germany", "Title": "“Small but Great Value!”", "Author": "GlobeExpat", "ReviewID": "UR67630438", "Content": "It is what you expect. The room is small, very small. I mean I imagined it was small like a cruise ship cabin, but in reality it is much smaller than that (and we had their bigger room)! It is very clean and the location is good and it is cheap. My complaints would be if they just put in a couple shelves or some more hooks on the walls it would be much better. We ended up with everything on the floor and it was a bit of a mess since it was so tight. Our room was on the 1st floor and suffered from poor air conditioning. The staff said that it would be fixed but it wasn't. They did offer for us to move to another room but we ended up not moving because it would be a hassle. The last night there was a noisy group in the room next door. They were making noise until 3AM and that kept waking us up but the other nights we did not have this problem. Overall I would say was good for the price. It was cheap, clean and central. If you do have the option to stay in a normal hotel for a similar price or a bit more I certainly go for the upgrade. But if not, easyhotel is not a bad choice. Would I stay again.....I wouldn't rule it out!", "Date": "June 15, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Winnipeg", "Title": "“Amazing value for the price!”", "Author": "Sarahbearah28", "ReviewID": "UR66793941", "Content": "We picked the easyHotel South Kensington for the proximity to the tube (10 min walk) and to the museums, and ease of getting to and from the airport (one tube line, 40 min). We went with the standard double-bed room with no window. It is definitely the smallest space you will ever find yourself in and the lack of natural light can make it a bit disorienting in the morning when you wake up, but the price is virtually unbeatable and location can't be beat, and did you come to London to hang out in your hotel room? There is a grocery store around the corner and an internet cafe within a five minute walk. The staff were very helpful at check-in and the room was clean. I would strongly recommend this to anyone traveling with their spouse or partner but not to anyone traveling with a sibling, parent or friend - you have to have a VERY close relationship to be in those close of quarters!", "Date": "June 7, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Venice", "Title": "“Cheap hotel, good quality”", "Author": "madeale", "ReviewID": "UR64080767", "Content": "Good quality for real. The hotel is in a very beautiful position, 5 min walk to Earl's Court metro station (zone 1). We were in a standard double room, with no window. The room was very small but very clean, the bathroom was maybe too big compared with the room, but it's fine. The only thing is that you don't have space for putting your clothes and shoes somewhere, and so you have to keep your luggage always open and use it as your wardrobe. The room was very well isolated. Since there was no window, in the room there was air conditioning all night, but you have to ask reception for increase or decrease the temperature. The hotel was very nice and clean, with automatic machine for food and drinks. The hotel staff was very helpful and nice. Around the metro station, there are a lot of restaurants, fast foods, shops, and the neighborhood is quite and nice, even in the night.", "Date": "May 13, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Paris, France", "Title": "“Brilliant”", "Author": "Rrralph", "ReviewID": "UR62591045", "Content": "Brilliant. Fantastic location - a quiet street in South Kensington, 6 mins walk from a Zone 1 tube. Spotlessly clean. Very well ventilated - the air always felt fresh, which was important to avoid issues of claustraphobia in the small room with no window we'd opted for. The smallness of the room really wasn't a problem - we knew what to expect since they are totally upfront on the website. Unless you're a giant or feel the need to unpack all your clothes when you arrive in a hotel, it's not an issue - we didn't go to London for the weekend to hang out in our hotel room. The bathroom is tiny, clean and functional with endless hot water. Very friendly and helpful staff on reception (24hrs a day). And it's so inexpensive. For somewhere to sleep cheaply, in comfort, in central London, without decades-old shabbiness or being in a dormitory or sharing facilities, this surely can't be beaten.", "Date": "April 27, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "5", "Location": "4", "Rooms": "3"}, "AuthorLocation": "Laguna Beach, CA", "Title": "“Good value for London”", "Author": "LagunaGrrl", "ReviewID": "UR52482144", "Content": "Yes - you get what you pay for, but it's fine. We stayed 5 nights and actually grew to enjoy what we eventually called \"the nest\". ROOM: Literally as small as you've been warned. But we found the sheets clean, the bathroom clean and the amount of space we needed to at least place our bags on the floor was sufficient (about 2.5 feet by 10 feet running along the end of the bed and the bathroom door). If you can spring for a room with a window, you might want to - it may make it feel a little less small. LOCATION: This easyHotel location was great. Safe area near a grocery store and a 5 minute walk to the tube. It appears there's an \"easyHotel Earl's Court\" location nearby that has better reviews, so you might want to check that out as well. PROPERTY: The building is in a long row of white townhouses. Nothing fancy, very basic. We were on the basement level in the back of the building. Completely quiet area, not on a main road. PLUSES: We felt we got value for our money. All we wanted was a place to sleep and shower - that's what we got. The staff were friendly. The location is central. The bed was surprisingly comfy. MINUSES: Paper thin walls mean that you may end up with noisy neighbors who keep you up all night. We stayed 5 nights. The first night and last night our next door neighbors were loudly talking and engaging in other nocturnal activities literally all through the night making it very hard to sleep. But those 3 in-between nights were pretty peaceful. Also, if you aren't one of the first to shower you'll likely end up with cold water. BOOKING: 40 pounds a night booked directly through their website. Again, check out the Earl's Court location reviews and photos - seems like it'd be worth it the spend a little extra for a window if you can. For the price, we can't complain. It wasn't dirty, smelly or unsafe. It's extremely basic, but serviceable. We might do an easyHotel again if we're passing through London, but not sure I know a lot of friends who I could \"recommend\" it to.", "Date": "January 3, 2010"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Mexico City, Mexico", "Title": "“Easyhotel in London”", "Author": "ChangoViajero", "ReviewID": "UR50717215", "Content": "After being tired of looking at affordable places to stay in this area of London, we finally discovered the Easyhotel recommended by a friend who lived in London. Great place to stay, room is extremely small but only what you need, a place to shower and sleep, strongly recommend it.", "Date": "December 6, 2009"}, {"Ratings": {"Cleanliness": "4", "Overall": "2.0", "Rooms": "2", "Value": "5", "Location": "4"}, "AuthorLocation": "Stockton-on-Tees", "Title": "“Small, uncomfortable and noisy...”", "Author": "Neal2K", "ReviewID": "UR50700350", "Content": "I'm afraid I can't recommend. We booked 2 nights here but only stayed 1. We thought we would \"economise\" but this was going a bit far. The room was a \"standard\" room, which is apparently the largest! It was tiny, no room to swing a cat and too small for 2 people (to attempt) to share. The bed was uncomfortable and we both had a terrible night, we were also awoken several times by noise from the neighbouring rooms. We paid extra for a TV remote but this was a joke - it was a LCD TV, mouted high up and fixed so when lying in bed, you couldn't see the picture. The bathroom portion of the room was also very small but I guess you could call it \"compact\"! It really annoyed me that there were no surfaces on which to put anything - your stuff either has to go on the bed or on the floor! On the plus side, the hotel was very modern and clean, a friendly receptionist, great location for the tube - either Gloucester Road or Earls Court within about 5-10 mins walking distance. Go to Bench'o on Earls Court Road for breakfast - lush! Ideal for backpackers or single travellers - definitely \"no frills\" - I would not consider this as somewhere to stay on a city break with your wife!", "Date": "December 5, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Antwerp, Belgium", "Title": "“Best budget hotel I've had in London. Clean and friendly!”", "Author": "Elwing", "ReviewID": "UR50619406", "Content": "I have travelled to London alone and on a very low budget quite a bit over the last few decades and have slept in some amazingly lousy hotels over the years. You know, flowery carpet that squishes under your feet, 4 kinds of hair in the shower, staff that barks at you... And after my last experience in 2004 (Free extra blood in bed, concert from the drunk choir next door, sit on the toilet to take a shower all for just 40£ a night!) I decided to forget about London for a while. But recently the £ against € exchange rate has become to good to ignore and I had a look at what's new. It turns out a lot has changed in London. Several chains of budget hotels have arrived, and I decided to check out Easyhotel. If you -like me- take pride in travelling light and only stay for a few nights, if you are not extremely claustrophobic and not allergic to the colour orange you should defenitely check this one out. I booked two months in advance and got my room for an amazing 25£ a night. The room was a bit like something you would find on a train or boat- space kept to an absolute minimum, in simple modern design. No window, but fresh air from an efficient airconditioning system. A heavy door keeps the sound out, and the bed was fabulous, I slept like a baby. The bed was technically wide enough for two, but I wouldn't recommend it unless you *really* like each other. But I hear there are other room configurations available. The bathroom was also an exercise in space-saving. A toilet, a wash basin and a nice hot shower, with a multifunctional soap dispenser and one (1) towel. And orange, lots. All spotlessly clean, with a friendly and helpful staff member welcoming you downstairs. This hotel does not come with restaurant, breakfast room, elevators, pool, room service, wake up service, complimentary champagne, valet parking, any other kind of parking, cocktails- if you want that, go to the Hilton. If you want a good clean bed and a shower for few £ go here! There are a few other things I must mention. There is a tv in the room, but you have to pay to use it. Also, you pay for extra towels, internet, a window in your room or a linen change. This pleased me, as I didn't need any of these things and it saved me money. The room was so dark and quiet and the bed was so good I had trouble waking up in the morning. There is really no way to tell that morning has arrived, so I would recommend setting an alarm to avoid oversleeping. The location is great, short walk from Earl's Court Tube station, trough a street with a wide choice of restaurants, pubs and supermarkets. Also there is an internet cafe there that charges £1 an hour. I loved this hotel and wish it had been around back in the bad old days. I will certainly be back, either here or on a different location. I hear they are opening one in Berlin...", "Date": "December 4, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "4"}, "AuthorLocation": "New Zealand", "Title": "“The nicest staff in London. :-)”", "Author": "Kiwi_Bean_Team", "ReviewID": "UR45819960", "Content": "We stayed here for 12 days in the smallest room with no window. While the room was small it had everything we needed and because we stayed so long they gave us 2 complimentary room cleans. The bed and bathroom were spotless and the rooms were very soundproof. Was in a great location, 2 minutes walk to the subway, 1 minute walk to the supermarket and 3 minutes walk to some restaurants. Very safe at all times of the day and night. Staff were super friendly and really helpful, made our stay so much more enjoyable, with a hello and goodbye every time we walked in and out the door and lots of local info with anything from second hand bookshops to local pubs. Would stay here again and would recommend it to anyone! :-)", "Date": "October 4, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Nordland", "Title": "“Super budget hotel!! Nothing to complain about.”", "Author": "Lasherh", "ReviewID": "UR41357822", "Content": "After reading through some reviews, I was quite unsure of the choice of Easy Hotel. But so very pleasantly surprised we were! Anyone who writes that the rooms are too small, and everything is too small ..! HELLO! It's on the home page in black and white Small Room - no window, 6-7 sq. meters ... You can not seriously expect more than this for 35 pounds for the day.? And who in the world ask staff to come up with the measurement band two measure up the room! But enought of the strange reviews. I am a man of 188 cm, at around 100 kilograms grams, but had no problem with getting me into the shower and the toilet. When my wife was changing i just laid in the bed planing the day .. We had a small room without a window, thought I'd get a claustrophobic feeling of a small room with no window, but it went just fine. When it came to the air conditioning it was very good, was afraid it would be hot and humid in the room, but worked very well. We stayed for three days, which went very well, as we did sightseeing on the first few days, but noticed that as we started to shop a little, we got problems, but I had booked a larger hotel room for the last days, so we were prepared for it. Soo if you are looking for a cheap hotel, where you can have a good nights sleep, in a comfartble bed, whit good staff, helping staff, GREAT LOCATION! this is the hotel for you! But if you think the rooms are larger than the home page says, and if you think that a hotel at this price has a lift, and you can not manage carring your own luggage, and if you think that you will get soo much comfort for the 35 pounds, you've got to be kidding! Dont book the hotel. The only thing i regret is that in accualy belived some of the bad reviews. I would definitely use this hotel the next time i go to London!", "Date": "September 13, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Colombo", "Title": "“Excellent value for money!!”", "Author": "urek", "ReviewID": "UR37951385", "Content": "I have stayed in Easy Hotel for business this time, on my own. I have really enjoyed the comfortable bed - to be honest I slept like a baby. Having chosen a small room without a window I knew what I'm expecting - tiny orange capsules, perfect for a couple days stay. Room was extremely clean and the staff was incredible. Always so helpful when it came to getting information about London and transport. The hotel didn't provide any food exept for the vending machine, but there was plenty of different shops (such as Sainsbury's) and restaurants in the area - so you won't be hungry. The location itself was perfect, really close to Harrods, museums, High Street Kensington etc. I know it's a place where you have to sacrifice the space in order to be in such a great location. However, there are no compromises when it comes to cleaniness and the staff - very cheerful and polite. I highly recommend it to all the people who come to London - not to the Hotel!!!", "Date": "August 17, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Sheffield, United Kingdom", "Title": "“£24.50 for a central London hotel?”", "Author": "PenistoneJames", "ReviewID": "UR34566778", "Content": "Yes please. Thats what we paid for 1 night in this desirable location. The shower was good The bed was really comfy There was no window in the room - which believe me is no bad thing (lie in anyone?) Reception staff were good Walk away from Hyde Park, Gloucester Rd Tube, Science Museum, Natural History Museum. Enough said....Don't listen to anyone who moans about the size of the rooms...it is clearly states how big they are on the website.", "Date": "July 12, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Belfast", "Title": "“Fantastic”", "Author": "glentorangirlie", "ReviewID": "UR26910655", "Content": "A room in central Lonon, 5 minutes from the tube stop for £35 punds a night for TWO people, amazing!! Yes the room is miniscule, but they give you the EXACT measurements when you are booking if you go expecting something huge you will be disappointed. There is a comfortable bed, a showerroom and a tv, what else can you possibly need? Lets not forget that you are in London and the time you spend in the hotel should be totally minimal. I loved this place, would totally stay again. Those who complain the room was too small knew what they were getting before arrival so I find this a really unfair criticism.", "Date": "March 27, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "4.0", "Value": "4", "Location": "4", "Rooms": "1"}, "AuthorLocation": "London", "Title": "“Small Room.....small price!”", "Author": "FCSX", "ReviewID": "UR25496091", "Content": "Stayed at the Easy Hotel in London (Kensington) for one night. I shared a room with my neice so we paid roughly £20 each for the night. It is VERY small, no floor space apart from a tiny square to stand in where the door opens so if you want to spend ages getting dressed up and ready to go out, then probably not for you (unless you potter around on the landing outside the room). The room we shared had no windows so felt a little closed in........but for the price it had clean linen, a good hot shower and was generally clean and not noisy and it felt secure. All in all in was fine for one night!", "Date": "March 3, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Check in / front desk": "3", "Overall": "1.0", "Value": "1", "Rooms": "1", "Location": "3"}, "AuthorLocation": "London", "Title": "“Ridiculously small room”", "Author": "KiwiTopp", "ReviewID": "UR22866036", "Content": "We (late 20s couple) obviously weren't expecting much from EasyHotel because of the price and budget reputation but the room was just unbeliveably small. Would have been too small for one person. Total floor space not including bed and equally tiny bathroom was perhaps less than 2 square metres. A prison cell would have been more comfortable, and I am not exaggerating. Not a hotel. You have to pay for every small little thing and the staff were pretty unhelpful when I complained, just referring me to the website. Fine, it keeps costs down and there is a market for budget hotels, but surely quality has to come in somewhere. Small is advertised on the website, but they need to make this even clearer, ideally with pictures. But then, of course, noone would book it in their right minds would choose it and it would go back to being the utility cupboard it is just about large enough for. Struggling to find pluses, but the location is handy, the hotel was clean, tidy and quiet, and the booking online was simple. The Easy concept has had some successes, and I look forward to the day the cinema chain opens, but this is not one of them.", "Date": "December 20, 2008"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Check in / front desk": "3", "Overall": "4.0", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Portugal", "Title": "“Great Hotel”", "Author": "Palmela", "ReviewID": "UR22669186", "Content": "I've just returned from London where I spend 4 days. EasyHotel South Kensigton it's a great hotel if all you want is to enjoy London. I stayed in a \"Small Room no Window\", yes it's very small and it has no window. I paid 170£ for 4 nights, so I knew exactely what to expect and had no surprises. The room was very confortable, clean, the water hot and it has a great location very close to Earl's Court tube station. If all you want is to enjoy the wonderfull city of London it's perfect. In the hotel I only showered and sleep. That was it! So enjoy London, which during christmas time is absolutely gourgeous!", "Date": "December 12, 2008"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Business service (e.g., internet access)": "2", "Check in / front desk": "3", "Overall": "2.0", "Value": "2", "Rooms": "2", "Location": "4"}, "AuthorLocation": "new delhi", "Title": "“It was unbelievably small”", "Author": "pinkyNewDelhi", "ReviewID": "UR21008879", "Content": "We knew that easyhotel was going to be small but nothing prepares you for how small it is. If you have more than couple of overnight bags, then, it's best to forget it. But then, to be fair, they do have a bag storage place for which they charge you GBP 2.50 per bag. We were travelling with two suitcases, which meant there was no place in the room to stand even. And while the toilet operates fine, use of the shower means that you wet everything else However, we did managed to have a good night's sleep since the bed was quite comfortable. But not having a coffee vending machine meant that every morning, we'd have to trek to Sainsbury's nearby to get our fix from the local Starbuck's", "Date": "October 19, 2008"}, {"Ratings": {"Service": "1", "Cleanliness": "4", "Business service (e.g., internet access)": "1", "Check in / front desk": "1", "Overall": "2.0", "Value": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Cheshire", "Title": "“Good if.....”", "Author": "ndjefc82", "ReviewID": "UR20751109", "Content": "If all you want in a hotel is a place to get your head down and shower, then you won't be disappointed with easyhotel. As other reviews state, it is cramped, but this particular hotel is in an excellent location, close to Gloucester Rd and Kensington high st tube stations. We stayed for two nights, but we were barely there at all. I'm afraid I don't agree with the previous review about hotel staff being helpful, When we checked in I had the feeling that we were an interuption to the staff member that checked us in, and they were not very helpful or informative. Calling this place the Ritz is deceptive and defeats the object of writing reviews, whilst it is clean and cosy, there is no hiding from the fact that this particular hotel has obvious pros and cons, the main ones being that whilst it is cheap, you don't get an awful lot for your money. If it's a bed and shower you are after- book it! If you want space and extras, spend more and go elsewhere!", "Date": "October 9, 2008"}, {"Ratings": {"Service": "1", "Cleanliness": "3", "Business service (e.g., internet access)": "1", "Check in / front desk": "1", "Overall": "1.0", "Value": "2", "Rooms": "1", "Location": "4"}, "AuthorLocation": "South Wales", "Title": "“Won't be using Easy Hotels again!!”", "Author": "WelshTraitor", "ReviewID": "UR19850039", "Content": "My husband I stayed here for 1 night only - and are we glad it was for one night only?!! Whenever we visit London, we do a lot of sightseeing and really only ever look for a hotel that is fairly cheap and is pretty well connected for London transport. We travel light (a backpack each only) and only ever need a decent, clean bed and shower. From the hotel's own website, and from the previous reviews, we weren't expecting a king size super spacious room (after all we had booked a room with no window, and for a pretty cheap price) but still..... I cannot stress enough just how TINY the room actually is!! One of us had to sit on the bed, whilst the other one moved around, got dressed, etc. as the room is that small - and we are not large people! Even with only having backpacks for luggage, there is no room for storage, and having things piled up behind the door, to me is certainly a fire hazard! The hooks on the wall are a bonus, but only if you are 6 foot tall, as they are so high, it is a struggle to reach them! Having stayed in a \"concept\" hotel like this before when overseas, we were expecting a little bit more (please try out the Hotel SO, Christchurch, New Zealand - again a space-saving window less room but SO much better on Design, Layout, Style, etc. and also not that much more expensive in comparison). Having both been students, where we lived with similar style bathrooms, I would say that even our student accommodation wins hand-down. Also having worked with the Prison Service, I have seen Prison Cells that are more spacious!! There is no carpet on the floor - a moneysaving trick for easyGroup - but I suppose this helps when the shower leaks under the bathroom door! And never having suffered from Claustrophobia, I suddenly experienced quite bad panic attacks in the middle of the night, as I felt completely hemmed in!! On a positive note, the room was very clean, the bed pretty comfortable and the hotel is in a nice area, and is very well located for transport. However, we will NEVER stay there again. We found the Travel Lodge the previous night was by far the best for money (at £29 per night on the saver rate it was £10 cheaper than easyHotel) with much more room and the use of the TV thrown in for FREE. To us, these rooms have been built with one thing in mind only - money making for easyGroup - and with very little thought to the actual customer - the budget traveller. Yes, we want cheap accommodation, but we also want a little comfort. A note to easyGroup: Please take a leaf out of the books of Travel Lodge and Hotel SO.", "Date": "September 7, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "3", "Location": "5"}, "AuthorLocation": "UK", "Title": "“Value for money!”", "Author": "emmaredwan", "ReviewID": "UR17785266", "Content": "I have recently stayed at easyHotel South Kensington and was pleasantly surprised. First of all the location is perfect and it is great that you can afford such a small room but in such a nice location. I arrived at the hotel before the check-in time of 3pm but a very helpful member of staff checked me in earlier and explained that whenever they have rooms ready, they will always do their best to let you check in. They will also store your luggage for you but I didn't need it. Rooms are extremely small indeed but because I was there alone it wasn't too much of a problem but I knew what to expect from the website and the price was appealing Rooms are modest but very clean and everything is provided. Overall the experience was a good one and would definitely go back again.... nice helpful staff who gave me directions and maps, anything I needed really. Hotel doesn't provide any luxury but good value for money.", "Date": "July 11, 2008"}, {"Ratings": {"Cleanliness": "2", "Check in / front desk": "1", "Overall": "1.0", "Value": "1", "Rooms": "1", "Location": "4"}, "AuthorLocation": "exeter", "Title": "“Awful night's sleep”", "Author": "bigjohnboy", "ReviewID": "UR17432033", "Content": "My wife and I stayed here for one night, knowing fairly well what to expect in terms of size and facilities. The location was OK, not too far from the tube and in a decent area. The receptionist had clearly not received the customer service training - charmless and unhelpful would describe him. He told us which room but the numbering system mades it difficult for us to find it that we had to return to check. The room was phenomenally tiny. One person could cope OK for a night but for a couple...we literally had to take it in turns to move around. The shower room was fine with a good shower. What we really disliked was the total lack of storage space. Surely the designers could have incorporated a number of shallow recesses for small possessions to avoid having them all over the tiny floor? The main issue we had however, was being given only one thin pillow each. We asked for extra pillows and were told by Mr Surly to ask later (we were off out). We were told on our return by a different person that there were no extra pillows. As a result we had to fold up extra clothes to provide some sort of neck support. I find it hard to imagine that we are the only people to experience this problem. In every other hotel we have ever visited we have either found two pillows in the room or have been issued extra ones when required. Our night's sleep was disrupted badly by this easily rectified situation and to say we were disappointed with Easyhotels would be an understatement. Yes, the room is cheap and we didn't expect greatness but surely it wasn't too much to ask to be given sufficient pillows? We also wouldn't recommend a windowless room as you get no sense of day/night in this already claustrophobic environment.", "Date": "July 2, 2008"}, {"Ratings": {"Service": "1", "Cleanliness": "4", "Business service (e.g., internet access)": "1", "Check in / front desk": "1", "Overall": "1.0", "Value": "2", "Rooms": "1", "Location": "4"}, "AuthorLocation": "Los Angeles, CA", "Title": "“The Unhappiest Place on Earth”", "Author": "fuschia920", "ReviewID": "UR17063710", "Content": "i will have nightmares for the rest of my life about this place. you could barely fit your suitcase on the ground, and there was no way to leave it open and then actually open the door to the outside. our room was on the fourth floor, no elevator, no help from the staff. the bathroom was so small that you could shower sitting on the toilet. if me or my friend showered in the morning, the entire bathroom was a puddle for the remainder of the day. it advertised \"internet access.\" false. they let you use the manager's computer if you really needed it, but limited your usage to five minutes. the recirculated air conditioning didnt stop the rooms from overheating, and in the morning my eyes and mouth were painfully dry. on my last day there, i woke up with an awful cold, probably blown in from another guest. for only 15 pounds more, we're staying at a days inn in hyde park. it has a real bathroom and doesnt charge to use the TV. DO NOT STAY AT EASYHOTEL!", "Date": "June 19, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Check in / front desk": "5", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Northumberland, UK", "Title": "“Pleasantly Surprised”", "Author": "GemmaK77", "ReviewID": "UR16057856", "Content": "Having read other reviews, I was quite nervous on arrival but pleasantly surprised with the friendly reception and the room itself. For our 1 night stay for a concert at the RAH it was all we needed. Clean, comfortable bed, great location, relatively quiet at night and the bonus of the 24 hr sainsbury's over the road. Admittedly we did pay extra for a window. The bathroom was very small but perfectly clean and did the job. Absolutely great if you just want a bed for the night and don't mind having no extra space. I wouldn't recommend a stay of a few nights or more. Would use again.", "Date": "May 15, 2008"}, {"Ratings": {"Service": "3", "Cleanliness": "2", "Business service (e.g., internet access)": "3", "Check in / front desk": "4", "Overall": "3.0", "Value": "4", "Rooms": "2", "Location": "4"}, "AuthorLocation": "San Juan", "Title": "“Ok for the money”", "Author": "rcasi", "ReviewID": "UR15372769", "Content": "Check in was very fast and convenient. The attendant was more than willing to give us directions. The room was very small but for the amount of money I paid I can’t complaint. I had a disable room so there were no stairs for me, but the hotel has no lift. The TV had a very low screen resolution so the way that is set up is very hard to see anything. The room was basic clean by no means spotless.", "Date": "April 26, 2008"}, {"Ratings": {"Cleanliness": "1", "Check in / front desk": "2", "Overall": "2.0", "Value": "2", "Rooms": "2", "Location": "4"}, "AuthorLocation": "Huddersfield", "Title": "“Dont Bother”", "Author": "pw699", "ReviewID": "UR10948799", "Content": "I have previously written a review on this place praising it, however I stayed here for the second time the beginning of this month. I knew it wasnt going to be the same as last time due to the immediate horrendous smell in the reception area. The room we stayed in was a tiny room without a window, I cannot complain about the size of the room as I knew what to expect, however this hotel has gone downhill since my last stay, the shower curtain was mouldy around the bottom and smelt terrible, the whole bathroom appeared grubby, There was also a large amount of dust behind the television set. Dont Stay here you can stay in the travelodge in holborn for a similar price.", "Date": "November 20, 2007"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Check in / front desk": "2", "Overall": "1.0", "Value": "1", "Rooms": "1", "Location": "3"}, "AuthorLocation": "Minneapolis, MN", "Title": "“Horrible place”", "Author": "Suze612", "ReviewID": "UR10676490", "Content": "Yes, we knew the room would be small, and that was something we were willing to live with. But we were shocked that the room was in such poor condition when we arrived. There was a big dirty watermark from a drink on the windowsill, dirty-looking linens, and a thick coating of dust on the walls and ceiling. On top of that, the toilet seat was completely disconnected from the toilet. We only used our room toilet in emergencies, but tried to use public toilets whenever possible. We complained about it minutes after arriving, and it was still not fixed two days later. The hotel wasn't able to give us a discount because of the inconvenience, but they did throw in a free TV remote. Considering the little time we actually spent in the room, being able to watch TV didn't really help us much. The only nice thing I can say is that the hotel is located in a good neighborhood, a few blocks from the Tube and next to a large grocery store.", "Date": "November 7, 2007"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Check in / front desk": "3", "Overall": "3.0", "Value": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Peterborough, United Kingdom", "Title": "“Better than expected”", "Author": "marksmissus", "ReviewID": "UR10186447", "Content": "My husband and I stayed here the night before catching an early Eurostar to Paris and were pleasantly suprised.We wern't sure what to expect after reading some of the reviews so had quite low expectations.We had a windowless room(standard) on the lower ground floor and it was a perfectly adequate place to spend the night-all we wanted to do was watch a bit of tv and have a sleep before an early start in the morning and this served it's purpose.Both the room and the bathroom were very clean and the bed was comfortable.We actually had a bit more room than we thought we would have,the only downside being that there is no room either side of the bed to put drinks etc(3 sides of the bed touch the wall).The shower was nice and powerful though a bit on the small side.An average size towel is provided but no toilet roll(don't know if this is the same in all rooms or if we were just unlucky!)We also found that is was quite-we had no problems with noise. The location is good-nice area,Sainsburys and Tube within 5 minutes walk.Receptionist was ok-not rude,just not over friendly. For what we paid for this room we were perfectly happy with what we received and have already booked a room in January for when we go to a concert. If you want luxury this isn't for you,but if you want a cheap,comfortable crash pad for the night then this is ideal.", "Date": "October 21, 2007"}, {"Ratings": {"Overall": "3.0"}, "AuthorLocation": "San Francisco, California", "Title": "“Tiny loo”", "Author": "preuss122", "ReviewID": "UR10051070", "Content": "We stayed here last month, it was ok we had a room down stairs without windows. the room itself is what we expected but the hotel has very loud. Everytime a door shut it would rattle our room. the staff was ok but the location is great. i would stay there again just maybe get a room with a window.", "Date": "October 7, 2007"}, {"Ratings": {"Overall": "1.0"}, "AuthorLocation": "Exeter", "Title": "“This place should go out of business!”", "Author": "thosthos", "ReviewID": "UR8375174", "Content": "I paid extra to get a room with a window. There was no double glazing and appalling traffic noise. The room is tiny, the bed touched three walls, and there is no other furniture. The bathroom is very small with no room for your stuff. For the same price, two weeks ago I got a palatial room in a 4* hotel in Birmingham + a luxurious breakfast. Here you get nothing, you even have to pay extra to use the TV! There is wifi - at £5 an hour!. I know another hotel, near Paddington, where I can get a room twice the size for half the price, with furniture to work on, tea. coffee and biscuits, and they don't employ sullen East Europeans with no training and little English. But, I'm not telling anyone where it is. I want to avoid ever having to stay in this dump again.", "Date": "August 8, 2007"}, {"Ratings": {"Service": "1", "Cleanliness": "2", "Check in / front desk": "2", "Overall": "1.0", "Value": "1", "Rooms": "1", "Location": "4"}, "AuthorLocation": "hants", "Title": "“dont go here unless your mad”", "Author": "dangerbunny", "ReviewID": "UR8237573", "Content": "if i had known then what i know now i would pay the extra and stay in a real hotel. the room was so small that 2 people could not stand up at once. when i argued that the room was smaller then i booked i was told \"tuff\" and when i checked later that same day they had altered the sizes online! we had booked 3 nights and only stayed one, having moved accross the road and paid for another hotel. £5 to use the TV! thats a joke! the tv hangs above the bed and you can only watch from laying down. if you have more then a small bag forget it! there is about 5feet by 1foot of TOTAL floor space in the whole room and you cant put things under the fitted bed (so hard!). if like us you like a glass of water during the night forget it! no where at all to even put a glass! the shower/toilet is so small that you touch 3 wall at the same time just to shower. if you had to stay here or police cell your better off getting nicked and at least then the staff would talk to you. avoid this place", "Date": "July 26, 2007"}, {"Ratings": {"Cleanliness": "4", "Check in / front desk": "3", "Overall": "2.0", "Value": "2", "Rooms": "2", "Location": "4"}, "AuthorLocation": "California", "Title": "“Noise factor a negative”", "Author": "mksfca", "ReviewID": "UR8128508", "Content": "The room had central A/C, it was clean, and was pretty much what we expected. There were a couple of hooks on the wall, but otherwise no storage space except the window sill. The suitcases were in the walking area between the outside door and the bed, and could not be left open. Getting up in the morning and using the bathroom required a ballet between the two of us unless one stayed on the bed while the other one got dressed. It was cozy; but having been on a self-drive barge trip ten years ago, we anticipated that this hotel room would bring us back memories. But I would not recommend this room because of the noise. One of the A/C compressors was just outside the window, plus there was an unexplainable noise as if a metal garage door or elevator were going up and down that kept us awake at night. I say “unexplainable” because the back of the hotel, where the room was located, looked over the parking lot of a Sainsbury market and we could clearly see from that parking lot that no such garage doors or elevators were close to our room or visible anywhere. We tried to change our room, but were unsuccessful, and gave up after the 4th night. I suspect that the noise factor would not have existed in rooms facing the street. Since the location of the room cannot be guaranteed, anyone booking with easyHotel may come across a similar problem", "Date": "July 16, 2007"}, {"Ratings": {"Cleanliness": "3", "Check in / front desk": "4", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Chicago, IL", "Title": "“Better than Expected -- great for traveling students”", "Author": "Boilermaker21", "ReviewID": "UR8027982", "Content": "I actually found my room to be quite a bit larger than what was pictured on the hotel's website. I stayed for a week and it fit my needs perfectly. It wasn't nearly as bad as many of these reviews make it out to be. Any college student or people used to living in \"efficiency\" style living will find it will suit their needs as well. A few value-added amenities would have been nice such as complimentary shampoo and a free TV but you can learn to adapt to anything. I didn't purchase the TV remote since I didn't fly 4000 miles from the States to watch television, I would have rather gone out to a bar and enjoyed the scenery of London. Although it would have been nice to have it to watch for a few minutes before bed. I never had an issue with the hotel staff and was a perfect place if you just plan on sleeping in the hotel and being out and about London the rest of the time (which you should be doing anyway).", "Date": "June 29, 2007"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Business service (e.g., internet access)": "1", "Check in / front desk": "3", "Overall": "1.0", "Value": "2", "Rooms": "1", "Location": "3"}, "AuthorLocation": "London", "Title": "“Awful Place - its like receiving a punishment!!!!!!”", "Author": "Coz-7", "ReviewID": "UR7727925", "Content": "I stayed in the London Victoria easyhotel last night, upon arrival the staff were ok, there wasn't much friendly-ness but once we opened the door to our 3rd floor (with no lift and extrememly narrow stairways and hallways) pod I was extremely UNIMPRESSED!!!!! It was like boarding a plane, aeroplane toilet, plastic floors, hard bed!!!! Although it states on the website that it is a standard size double bed, it does not inform you that you are literally rammed in against 3 walls, which makes it extremely uncomfortable if your tall... I had a lovely evening at the theatre and came back to this hell hole! Firstly we had to pay £5 for a remote control for a tv stuck on a bright orange wall, which also had a restriction on the volume! We could not shower after sitting in a hot theatre as we would then have been charged for requesting clean towels in the morning! And worst of all which is the main reason I'm writing this complain is we pulled the quilt back to make ourselves comfortable in bed (as you have an air conditioning unit directly above your pillows which is horrible contact wearer such as myself) to find the bed unmade underneath..... As we were making our own bed, we found black hairs on the sheets and duvet which physically made me feel sick - this is disgusting and there is no need for it at all! All in all I would never recommend this hotel, not even to someone I truly hated - I would never go back and I would be writing this to easyhotel themselves but conveniently there is no way to make a complaint on their website!!!!!", "Date": "June 1, 2007"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Check in / front desk": "3", "Overall": "3.0", "Value": "4", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Neuss", "Title": "“Recommended for informed travellers.”", "Author": "TheatreFriend", "ReviewID": "UR7488013", "Content": "My stay from April 24th-27th: From hotel's website I (aged 43) knew what it expected me: small rooms, functional bed and washroom, clean but tiny room. I selected standard size (9qm) without window and went there only for sleeping during a 3 night stay in London. The bed would have been too small for 2 adults but I was there on my own. I felt like in a ship's cabin, nothing else and not terrible at all, but just something total different from hotel rooms. I must say: It was exactly what I paid for (and was money saving because of early booking, 4 months in advance). The staff at the desk was friendly and helpful.", "Date": "May 1, 2007"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Check in / front desk": "3", "Overall": "3.0", "Value": "3", "Rooms": "2", "Location": "3"}, "AuthorLocation": "Edinburgh, United Kingdom", "Title": "“You can do better”", "Author": "brigadoon", "ReviewID": "UR7414135", "Content": "It's cheap, but my God, are the rooms small. I paid £45 which is obviously cheap for central London, but I'm glad it was for only one night. The room was very clean and the shower/toilet was small but bearable. It was a bit too hot for me, and it's not possible to adjust the aircon, so I was less comfortable than I could have been. The total lack of stowage space wasn't great either, but again, I was aware of this before I came, so the whole thing was pretty much what I expected. If the location is important you you, along with the low price, I would say try it out, but if you look around you can do better. My next hotel was the Travelodge at City Airport for £26, which was utter luxury compared to this.", "Date": "April 22, 2007"}, {"Ratings": {"Service": "1", "Cleanliness": "5", "Check in / front desk": "3", "Overall": "5.0", "Value": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "uk", "Title": "“cheap clean crash pad”", "Author": "ukukuk", "ReviewID": "UR7225072", "Content": "Does just what its says Small rooms Pay tv No window A/C rooms Dont understand people who rate this place poorly you pay average £45 for a double, cheapest for London is often around £70 Great place just to crash no frills but cheap and clean", "Date": "March 26, 2007"}, {"Ratings": {"Service": "1", "Cleanliness": "2", "Business service (e.g., internet access)": "1", "Check in / front desk": "1", "Overall": "1.0", "Value": "1", "Rooms": "1", "Location": "2"}, "AuthorLocation": "UK", "Title": "“Awful - avoid!”", "Author": "scamp1", "ReviewID": "UR7155135", "Content": "Don't stay at the easy hotel!! It is a complete rip-off and I am confident a better hotel could be found for the same price. The room was just a bed and the duvet was smelly. The floor was like the floor from a plane and it is hard to tell if it is really clean. We paid the extra £5 to get a remote for the tv, but the reception was awful. I think you probably get better conditions in a prison cell. Staff were not particuly welcoming either. Avoid, Avoid, Avoid...I know I will never return!", "Date": "March 13, 2007"}, {"Ratings": {"Overall": "3.0"}, "AuthorLocation": "Perth, Australia", "Title": "“Good idea”", "Author": "El_Greenholio", "ReviewID": "UR6833334", "Content": "Booked this hotel after I finished a European tour. Booked directly through the website which was easy to understand and quick to use. The hotel itself is a bit of a trek from the Earl's Court Underground station and can be hard to find as it is off the main road a little. On the plus side, the walk down to the station passes a heap of stores such as a Laundromat, Fast Food, Banks, Supermarkets and Pubs so it is useful for the traveller. The rooms are VERY small and the bathrooms even smaller. It is definitely a place to crash and nothing more. It is neat and tidy though and well presented. The orange colour scheme wears off after the first few hours. Overall this would suit the single traveller or couple that wants budget accomodation that is a clear step above backpacker/youth hostels.", "Date": "February 23, 2007"}, {"Ratings": {"Overall": "2.0"}, "AuthorLocation": "Detroit", "Title": "“Don't Do It!”", "Author": "notanotherscreenname", "ReviewID": "UR6179094", "Content": "I really like the idea of this hotel, on paper, I think it's great: A cheap/no frills, place to do nothing more than sleep, located near both Earl's Court and Gloucester Road tube stations. I like to believe I'm the kind of traveler that needs nothing more than a bed, a shower and a toilet; however, after my one night stint at easyhotel, perhaps I'm not. The hotel was pretty easy to find, it's pretty close to the Sainsbury's on Cromwell, not a terrible walk from either Earl's Court or Gloucester Road tube. Checkin was pretty easy, the man behind the desk was nice enough. The room......okay, I read all the reviews, I KNEW it would be small (I had a small room, 2.1, no window), I was prepared for the smallness, but it was the least welcoming hotel room I've ever walked into, it was literally a cell. Pretty much the last thing you'd want to see after an 7.5 hour flight. It was clean though, the bed was comfy, although there was no way to regulate the air temp. I didn't have much luggage so even that wasn't an issue....but with no window, no phone, no TV (I was not going to pay the equivilant of nearly $10 to watch a couple hours of TV) and no CLOCK in the room, it was disorienting. Then there's the bathroom. All I have to say is that it's very tiny, and that you must close the door when showering or you will flood the room....but it worked, again, the size of everything was not my main problem with this hotel. It just seems that they are almost going out of their way to make a guest's stay unpleasant by not offering free TV access for one (I can understand maybe collecting a deposit for the remote, which is returned upon checkout but it's ridiculous to charge outright for use of a remote), or even a clock, the worst part by far was the lack of a window. After a day in London, I reluctantly came back to the hotel and asked the woman at the desk if somebody could let me know when it was 10 a.m. (checkout time....no WAY was I going to be charged extra for staying later...and no phone in room means no conventional wakeup call) as I had neglected to bring my travel alarm clock and she acted like it was the most absurd question ever posed by a human being. Fortunately, I woke up early, checked out and spent the next night at a real hotel. I paid $85 VAT included for the hotel, and it was booked at the very last minute. I will admit $85 for a hotel in London is not bad, I just think that for what you get, it's not a great value. I typically use Priceline for my London hotel stays and it's not uncommon to get a 4 star there for $60-$85, and all of those places offer TV and WINDOWS! The next night I stayed at a hotel I was kind of dreading (read lots of bad reviews) the Copthorne Tara, and it seemed like a palace compared to the Easyhotel. I really wanted to like the place, like I said, I love the idea, I'd never go back unless I absolutely could not find something else at a reasonable price.", "Date": "November 27, 2006"}], "HotelInfo": {"Name": "easyHotel London South Kensington", "HotelURL": "/ShowUserReviews-g186338-d550121-Reviews-EasyHotel_London_South_Kensington-London_England.html", "Price": "$32*", "Address": "<address class=\"addressReset\"> <span rel=\"v:address\"> <span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">14 Lexham Gardens</span> | <span class=\"extended-address\">Kensington</span>, <span class=\"locality\"><span property=\"v:locality\">London</span> <span property=\"v:postal-code\">W8 5JE</span></span>, <span class=\"country-name\" property=\"v:country-name\">England</span> </span> </span> </address>", "HotelID": "2514514", "ImgURL": "http://media-cdn.tripadvisor.com/media/photo-o/01/c0/1d/7c/easyhotel-london-south.jpg"}}