{"Reviews": [{"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "San Diego, California", "Title": "“Hotel Saint-Louis en L'Isle”", "Author": "Richard B", "ReviewID": "UR127496303", "Content": "This was the second time I've stayed at Hotel Saint-Louis en I'Isle. The first time (2006) was great. Now, with the recent re-model, the hotel is even more pleasant. Not only is the location excellent for everything you want to see and do in Paris, but the neighborhood has everything you'll need to make your trip enjoyable. The best part, however, are the staff members at the hotel. From making the reservation, to offering advice on Metro routes, to calling a doctor when we needed one, Denis and Bernard were the best. I will stay here next time I'm in Paris.", "Date": "April 8, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Albuquerque, New Mexico", "Title": "“Perfect little hotel in the heart of Paris”", "Author": "Larry R", "ReviewID": "UR126853622", "Content": "This hotel is really as described in the different reviews: newly refurbished, central, very clean and with great staff! Our room was on the top floor and we could even see the Seine and the Pantheon monument from our little balcony! Also, there is free Wifi and you can get a free ipad during the whole stay in the hotel. We really recommend it!", "Date": "March 28, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Nottingham, United Kingdom", "Title": "“Superb”", "Author": "Debbie H", "ReviewID": "UR126646481", "Content": "Wonderful hotel in the very heart of Paris. The rooms are tiny, but well equipped, clean and those with a balcony give a wonderful view. The staff are extremely friendly and helpful. This was our second visit, and we hope to return again next year.", "Date": "March 25, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "3", "Rooms": "4", "Location": "5"}, "AuthorLocation": "London, United Kingdom", "Title": "“Excellent location”", "Author": "Umf50", "ReviewID": "UR126516647", "Content": "Stayed here last year and am going back again this year. Had a superior single room which was exactly like a double room. Nice decor, comfortable bed, small but well fitted bathroom. Great value breakfast compared to the cafes around town. Staff very helpful and friendly. Really good location easy to wander to all the major areas. Village atmosphere, lovely shops, good restaurants right on your doorstep. Superb views across the river to Notre Dame two minutes away at the end of the street. Only downside was the noise from the rubbish collectors each morning. Great for a mini break, would recommend.", "Date": "March 22, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Grand Rapids, Michigan", "Title": "“Awesome hotel and staff”", "Author": "Pete H", "ReviewID": "UR126448619", "Content": "My wife and I spent 7 nights and the hotel was great. The staff was excellent and English was easy for them. We had room 101 with a great view of the street scene. The hotel is settled on a small residential island in the middle of the Seine River. It is in the middle of paris and only 5 minutes from Notre Dame Cathedral. The central location was perfect for walking to most sites. But the subway is easy to use! There are NY Times newspapers available and the bathroom is more American than European. Great shower once the hot water starts...We had a small market 30 yards away that we visited daily for cheese, crackers and great inexpensive french wine! Also, the main street has shops that you can stroll and easily kill and afternoon. Again, highly recommend and the price and value are truly a steal.", "Date": "March 21, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Adelaide, Australia", "Title": "“Nice hotel, great location”", "Author": "Light03", "ReviewID": "UR126163817", "Content": "Spent 5 nights here in January and enjoyed it. I had booked a superior twin room (I was travelling with my mother) and on arrival was told it wasn’t available for the first night. They had a double room we could have for that night however. To compensate, they provided us with breakfast at no extra cost for the full time we stayed there. That was fine for us – things happen. The first room was beautifully furnished and clean. The building is old and they have retained some original features. The room was quite small without enough space to put two large cases on the floor. I could open the window and step out on to a balcony however and had a great view of the main street. The bathroom was also compact. We were cramped but okay. This room would suit a single traveller or a loved up couple. The next day they moved our bags to the superior twin room. This again was beautifully furnished and clean. We had much more room and could leave our cases on the floor. The bathroom was also large and modern. The rooms have a tea and coffee tray and free Wi-Fi. The hotel has a snug lift and winding stair case.The breakfast was served in the basement. It had cereal, bread, bread rolls, croissants, ham, cheese, boiled egg, orange juice, coffee, tea and yoghurt. I’m not sure that many people have the breakfast as often we were the only people there. There are plenty of places nearby to have breakfast also. The staff were always helpful and friendly. We booked them to pick us up from the train station and that worked well. I have been to Paris a number of times and love the Isle St Louis. I have always wanted to stay on the island. It is like a little village and we ate in the various restaurants on the island each night. It has a supermarket, pharmacy and post office all within walking distance of the hotel. The hotel was good value for money in the heart of Paris and I would stay here again.", "Date": "March 15, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Hicksville, New York", "Title": "“Nice hotel”", "Author": "Bill S", "ReviewID": "UR125800624", "Content": "Very pleasant hotel, located in the core of Paris, with nice staff, pleasant decoration and renovation. Also, there is free Wifi. We recommend it!", "Date": "March 8, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Brighton, United Kingdom", "Title": "“Little Gem”", "Author": "CarolynBanks", "ReviewID": "UR125580238", "Content": "Hotel Location: excellent! It is on the charming and relatively quiet l’Ile St Louis and within easy reach of Batobus and Metro stations and a short walk away from Notre Dame and St Germain des Pres and the Marais district. There are pleasant little restaurants on the doorstep although a 10 minute walk will take you off the island and to cheaper ones. The Staff; unfailingly pleasant and helpful. The Hotel: very welcoming and spotlessly clean. There is a lift to all floors but there are still some small and winding stairs to negotiate which could be a problem if you have mobility difficulties or a very large suitcase! The room: I think we had the smallest room in the hotel (looking at the plan in reception) but it was about the same size as our guest room at home and perfectly adequate for sleep and lounging about. The bathroom was small but well appointed. We took tiny suitcases that luckily fitted into the wardrobe but storage of large suitcases would have been a problem. The bed was comfortable. The welcome tray was much appreciated (bring your own milk!). Breakfast: I initially thought 13€ for breakfast was rather a lot but the cafes nearby charged 7€ for an orange juice, hot drink and croissant or bread/toast and butter and jam. Perhaps the hotel breakfast with as much as you can eat and offering a variety isn’t such a bad idea? As long as you can eat that much early in the morning! Romance: Just being here is romantic with the walks by the Seine and the cosy restaurants but if you want to push the boat out.......buy a lock from the souvenir shop on the quay north of Pont l’Archveche and write your names/message on it and lock it onto the bridge; make a wish as you throw the keys in the Seine! We had a great time here and listening to a group play Si Tu Vois Ma Mere on the Pont Saint Louis was a real bonus! The onion soup at the Brasserie on the corner of Rue Jean de Bellay makes a great Springtime lunch.", "Date": "March 4, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Manchester, United Kingdom", "Title": "“Don't miss that one if you visit Paris!”", "Author": "Joan P", "ReviewID": "UR125082928", "Content": "Following the positive reviews on Tripadvisor, i booked this hotel for our trip to Paris and i really didn't regret it. It is located in the historic center of Paris (Ile Saint-Louis) which looks more like a village than the city. Many good restaurants and shops are there and the hotel was recently renovated. The hotel concierge was very helpful and could speak excellent English. Our room was cozy and extremely clean and we also enjoyed the buffet breakfast that was served at the basement. We recommend it with no reluctance.", "Date": "February 23, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Houston, Texas", "Title": "“Wonderful stay!”", "Author": "Kate R", "ReviewID": "UR124975556", "Content": "My boyfriend ans i stayed at this hotel for 4 nights in February for our honeymoon trip. We definitely wanted to stay on the Saint-Louis island and booked this hotel on the basis of its Tripadvisor reviews. This was a excellent choice and the hotel met all our expectations. We highly recommend it!", "Date": "February 21, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Hanover, Pennsylvania", "Title": "“Location, location, location!”", "Author": "Mary F", "ReviewID": "UR124624852", "Content": "This recently renovated hotel is absolutely fabulous! What an amazing location, in the Saint-Louis island, a pleasant village in the center of Paris. We spent a couple of days there and we were really pleased! We recommend this hotel.", "Date": "February 15, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Hobe Sound, Florida, United States", "Title": "“A must place to stay in Paris”", "Author": "Nicole O", "ReviewID": "UR124448537", "Content": "This hotel is a one a typically Paris street with great shops. A short walk to the river and great views of Notre-Dame and a very short cab ride to the Musee and great shopping. A must stay, I will be back! The staff was so nice and helpful!!", "Date": "February 11, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Austin, Texas", "Title": "“Very pleasant hotel”", "Author": "John W", "ReviewID": "UR124070301", "Content": "The top floor room that we booked was really excellent, with a nice bathtub, a pleasant view and all the comfort that you can find nowadays (free Wifi, courtesy tray for coffee/tea, iphone docking station,...). Staff were polite and advised us on good restaurants in the area. An excellent choice for spending vacations in Paris.", "Date": "February 3, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Denver, Colorado", "Title": "“Excellent location!”", "Author": "Oliver S", "ReviewID": "UR124017315", "Content": "This hotel is a great value for money! Located in the heart of Paris, the Saint-Louis island is definitely the best place to stay. Staff were friendly and price was reasonable.", "Date": "February 2, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Location": "5"}, "AuthorLocation": "Marlow, United Kingdom", "Title": "“The place to stay”", "Author": "peter r", "ReviewID": "UR123913077", "Content": "Wonderful location, great staff, small but adequate rooms OK price and surrounded by good eating places. For us working at the Parc des Expositions on a daily basis it was perfect", "Date": "January 31, 2012"}, {"Ratings": {"Service": "2", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "5"}, "AuthorLocation": "New York, NY", "Title": "“not up to expectations”", "Author": "nickijags", "ReviewID": "UR123708465", "Content": "First let me say that this was my 9th trip to Paris. I had always wanted to stay on the beautiful Il St. Louis so for our honeymoon weekend this seemed the perfect time. There are only 4 hotels on the little island. And I thoroughly researched all 4 before choosing Saint-Louis En L'Isle. We booked the \"best\" room at the hotel and explained it was our honeymoon. If someone had told me it was a busy weekend, I would have gladly booked the day prior to our arrival to ensure easy check-in at 6am! The hotel was much smaller than expected (and again, I lived in London for 2 years and have traveled extensively thru Europe, I expected small!) The room at the top of the hotel was clean but the beds were not comfortable (*the bathroom was excellent!) Views were exquisite. Really, we were there for the location so this might have all been tolerable if the service had been more agreeable. Again, I don't expect US standards of friendliness, but we clearly stated it was our honeymoon. NOTHING was done to celebrate - or even acknowledge- this occasion. The most troubling part- whenever we asked the kid at the desk (and he was barely 20 ) to call us a taxi, he'd shrug and say, they are not available. We had to argue with to call other car services every single night. Simply put, there are far better places to stay in Paris. And then you can visit Il Saint Louis.", "Date": "January 27, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Sunderland, Massachusetts", "Title": "“Perfect location”", "Author": "Kate D", "ReviewID": "UR123495248", "Content": "We were recommended this hotel by long-standing friends. The place is exactly as described and shown on the website pictures. The shuttle service was great and staff were friendly. To make the story short, we were very pleased with this hotel.", "Date": "January 23, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "3", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Wirral", "Title": "“Lovely Location”", "Author": "DJG_KAG", "ReviewID": "UR123360089", "Content": "Hotel beautifully placed on a quiet street with easy access to Notre Dame and the Marais. There are no views from the hotel itself but you only have to walk a few yards for beautiful views of the Seine and Notre Dame. Very friendly staff and spotlessly clean but like everything else in Paris, very expensive. A better deal for breakfast is to eat at one of the many local cafes. One slight niggle was the hot water which took some time to run before it became hot.", "Date": "January 20, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Eastpointe, Michigan", "Title": "“Outstanding location!”", "Author": "John B", "ReviewID": "UR123358271", "Content": "We found this hotel in Rick Steeve's guide and we were very satisfied! They always give good recommendations. We loved the renovation, the staff were very friendly and we found good restaurants in the area.", "Date": "January 20, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Mount Pleasant, South Carolina", "Title": "“A very good choice”", "Author": "Marylin H", "ReviewID": "UR123210185", "Content": "This hotel is ideal for spending a few days of vacations in the marvelous city of Paris. First the location is really central and close to the subway. Also, this hotel was newly renovated with lots of taste and a choice of quality material. On top of that, you can borrow an iPad freely during the whole stay! We will go back there...", "Date": "January 17, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Richmond, Virginia", "Title": "“What an amazing hotel!”", "Author": "Marvin P", "ReviewID": "UR123022352", "Content": "We found this hotel after checking all the reviews on Tripadvisor, and we were more than happy to spend a few days there! Our room was nicely decorated and very clean, with free Wifi and a courtesy tray for making coffee. Staff were friendly and above all, the location is really central (in the Paris historic core). We enjoyed the good restaurants and shops in the area and we will go back there for sure!", "Date": "January 13, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "London, United Kingdom", "Title": "“Outstanding location!”", "Author": "Kylie N", "ReviewID": "UR122919362", "Content": "A more centrally located hotel, you probably won't find one: the Saint-Louis island is just in the middle of the Seine river, in it central part... The piece of land is also a small village where you can find trendy shops and restaurants. The hotel itself is well decorated and recently refurbished. It would really recommend it to any visitor that likes off-the-beaten track areas.", "Date": "January 11, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "ponca city, ok", "Title": "“A gem in the center of Paris!”", "Author": "Harry R", "ReviewID": "UR122879202", "Content": "Don't miss that one if you ever visit Paris! This hotel is absolutely a must, at 2 blocks from Notre-Dame cathedral and in a small village in the middle of Paris, would you believe that? Moreover, it was recently renovated with charmful and noble materials. I would definitely recommend it for spending a good time during your vacations in Paris.", "Date": "January 10, 2012"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Sleep Quality": "3", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Brussels, Belgium", "Title": "“Cosy-en-isle”", "Author": "MoxBxl", "ReviewID": "UR122574640", "Content": "Nice rooms but not quite spotlessly clean; small ish but acceptable for two people (especially for Paris standards). The bath was modern and adequately sized also for two people. Unfortunately the airing in the bath which switches on together with the light, is extremely loud. The staff was friendly and English speaking, but could not provide concierge services (we had asked for a restaurant recommendations, but their suggestion did not at all correspond to the criteria we had given so we did not take it up). Good location if you like going for walks and pick up some Parisian atmosphere, so perfect for my preferences - but a bit far if you only want to visit the shopping streets and the Eiffel tower.", "Date": "January 5, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "", "Title": "“Perfect location, beautiful rooms”", "Author": "pinkymay", "ReviewID": "UR122156697", "Content": "There is not a more perfect location in all of Paris - it's completely magical. This is a most wonderful little hotel, such an easy arrival from the airport on the RER, too. Close to the metro, but within walking distance from so much, you might not need it. Rooms were lovely and I didn't find mine too small at all. Coffeemaker, free wifi, nice little fridge, comfortable beds, beautiful views, delicious breakfast (although that was a tad pricey - 16 euros, I think.) And right across the street from a delicious boulangerie, two doors down from a great little market and of course, Berthillon. Staff was wonderful and helpful with directions and a corkscrew! Will definitely make this part of my permanent Paris itinerary.", "Date": "December 27, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Phoenix, Arizona", "Title": "“The creme of the creme”", "Author": "Carrington N", "ReviewID": "UR121952859", "Content": "My partner and i spent a week in this marvelous hotel. Our room was well decorated (brand new renovation) and cozy, but with all the up-to-date amenities (free Wifi, iPhone docking station,...). The staff were very helpful and booked for us very good restaurants in the area. We definitely recommend this hotel.", "Date": "December 21, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Cambridgeshire", "Title": "“Consistently perfect hotel”", "Author": "foxesforever", "ReviewID": "UR121845051", "Content": "We have stayed at the St Louis en l'isle many times times and the standard never slips. Friendly staff and an excellent location make this a perfect choice", "Date": "December 18, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "5.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "San Francisco, California", "Title": "“Charming Hotel with fabulous location, your own island at night!”", "Author": "SFSeeingTheWorld", "ReviewID": "UR121829736", "Content": "This review is coming after 9 months but wanted to get in it because I am thinking of going back to Paris next fall and to stay at this hotel again so wanted to share my thoughts about this charming place. Background/Context - My husband and I stayed here the last week in February 2011 for 6 nights. We were there when the hotel was just about to add their new facade, so factor in that it was not quite complete but the interiors were done. I recently looked on their website and the updated facade looks great. In my opinion, it now looks a lot nicer than the Hotel de Lutece or Hotel Deux-iles just down the block . After a painstaking review of hotels for this trip, I selected Hotel Saint-Louis en L'isle because of the location and value as they had lower rates compared to the other Ile Saint Louis hotels. I have visited Paris 7-8 times before this trip and have stayed primarily in the 7th Arrondisement and wanted something different. At the time, this hotel was cheaper than the Hotel De Lutece and Deux Isle down the street. With all the renovations, I am thinking it now gives those other hotels stiff competition. It was a hard decision at the time but now realize the value of this Hotel. The Hotel - Besides the wonderful location, it has been renovated as mentioned above. Room renovations are good and fixtures of good quality though rooms are typically your small Parisian size but to be expected in a historic building. I was surprised and very pleased that an electric kettle with complimentary tea/coffee was in the room and that there was a small fridge with (reasonably priced) snacks/drinks. Buffet breakfast was a good value for us at 13 euros as it was \"all you care to eat\" (breads, cold cuts, cheese, eggs, yogurt, cereals, coffee/tea/hot chocolate, jams) and for a small surcharge (3 euro) scrambled eggs, more for an omelet, can also be ordered. I know others think it is too expensive but we like the convenience of just going downstairs to eat before the start of the day and there was protein included; it sure beats just a creme cafe and croissant. Another good point is that the hotel has their own shuttle (very clean with the hotel's decal on the car!) one can book for the airports. No need to pay cash to the driver as the cost of the shuttle will be added to your final bill, we just tipped the driver! Location - The island is packed with tourists during the day. The main street, Rue Saint-Louis, can seem like Las Vegas Boulevard during the day. At night, yes, that is when it becomes all yours and you can stroll around without the crowds for the most part. It has the feel of a little village with its own bakery (only one at the time but I think there is usually 2 bakeries), restaurants, bank/atm, post office, local church. Oh, there is a self-serve laundromat in the center of the island (I forget the exact location) but I noted that for future reference. I liked the selection of reasonably priced Salon de The (favorite is Cafe Med) and our favorite restaurant, Relais De L'isle, down the street where we ate there twice. I am going to write a review for them as well, I agree with their high rating on Tripadvisor. This location is convenient to both Metro and RER lines....you can take the lines on the Marais side (Line 7 - Pont Marie or Sully-Morland), Rive Gauche side (line 4 Saint-Michel) and Il de la Cite (line 4 - Cite). With both Metro and RER close, how central can you be? We took the RER from CDG straight to Saint Michel stop and walked to the hotel, we travel light and are fit so not a problem for us. What a grand way to start your Paris visit by walking by Notre Dame to cross a bridge to Ile Saint Louis!", "Date": "December 17, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Fredericton, Canada", "Title": "“An outstanding hotel!”", "Author": "Laura G", "ReviewID": "UR121744084", "Content": "This hotel is absolutely fantastic! The new decoration, the central location, the area, the staff. It's the perfect place for spending a few days in Paris.", "Date": "December 14, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "London, United Kingdom", "Title": "“A marvelous hotel”", "Author": "Christine W", "ReviewID": "UR121527094", "Content": "My husband and i spent a week-end in this hotel and we were really impressed by the decoration, the service and the location. The hotel is indeed just like what you can see on the website: newly renovated, clean and with a warm atmosphere. We took the hotel airport shuttle (extra fee) upon departure and we enjoyed talking with Philippe (who speaks English fluently). We will go back for sure!", "Date": "December 8, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "New Haven, Connecticut", "Title": "“We love this Hotel!”", "Author": "Patricia C", "ReviewID": "UR121493922", "Content": "we give this hotel a double thumbs up--stayed here 12 years ago and hope we can stay there again when we visit Paris the next time! service is warm and very friendly and rooms are most comfortable, though a bit small. however, we have lived in small NYC apartments, so we were OK with this.", "Date": "December 7, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Ottawa, Canada", "Title": "“A perfect hotel to stay”", "Author": "Jackie W", "ReviewID": "UR121463845", "Content": "We booked this hotel upon recommendation from our friends and indeed, we were more than happy. The staff, the room, the location, everything was perfect. Also, we appreciated the hotel shuttle service (for an extra cost). Last, the area looks like a small village, in the middle of Paris city, would you believe that?", "Date": "December 6, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Peebles Scotland", "Title": "“Dont tell anybody”", "Author": "Gordon10", "ReviewID": "UR121248055", "Content": "Great little hotel on this fab little island.Position is wonderful easy to walk everywhere and the island is like a little village with its own unique atmosphere,lovely quirky shops,cafes / bars and restaurants to suit all tastes.Front desk staff very friendly and helpful on arrival. Hotel looks like it has been renovated in the recent past and it has been tastefully carried out,bedrooms were of a very good standard and tastefully decorated not enormous but with evrything you need.We did not eat breakfast in the hotel so can make no comment on its quality etc at 13 euro per person.We did use the bistro at the end of the street on the right hand side heading towards Notre Dam it was very traditional black and white tiled walls and they do a fab brunch.", "Date": "November 30, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Seattle, Washington", "Title": "“Such a lovely hotel!”", "Author": "Allan S", "ReviewID": "UR121134380", "Content": "This hotel is location at the center of Paris, on the Saint-Louis island, which looks more like a village than a big city. All around, you can find good restaurants and interesting shops. The hotel by itself was renovated and our room was cozy and very clean. We appreciated the courtesy tray for making coffee or tea after a long day of sightseeing! We also used the airport shuttle service that was convenient and at a reasonable price. Last, but not least, the staff were really charming & helpful (they made restaurant reservations for us, since our French is more than approximate...).", "Date": "November 28, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Washington DC, District of Columbia", "Title": "“Wonderful Hotel”", "Author": "AreWeThereYet2011", "ReviewID": "UR121115342", "Content": "My wife and I stayed at the Hotel Saint-Louis en l'Isle this past week, and absolutely loved it! I booked the hotel as part of a surprise trip to Paris for my wife, and had decided to book our room through the hotel's website instead of a travel website. In doing so, I was in constant contact with the hotel staff long before we ever arrived. I was very pleased that all of my emails were answered quickly, with the information I requested everytime. Upon arriving in Paris, we were met by the Hotel's shuttle service. The driver was very friendly, spoke English very well, and helped us with our baggage. This was well worth the money, as CDG is farther out of Paris than I had originally thought. The driver took us right to the front door of the hotel, and helped carry our bags into the front lobby where we were met by the friendly hotel staff. The staff was very friendly, helpful, and knowledgable. They were able to help with directions,provide suggestions on where to eat, and even went out of his way to help us find a restaurant which specializes in raclette. (thanks again!) The rooms are very nice, and I believe remodeled recently. The bathrooms are much larger than I expected in a Paris hotel, and include a large walk in shower. Lastly, the hotel's location is amazing. On our first day, after setting our bags down, we exited the hotel and headed left. After walking down the first narrow street on the left, we were surprised to find ourselves staring at Notre Dame. Located on the Islands, you are in a perfect location to set off to anywhere in the city, with several metro stops (and metro lines) within walking distance. Additionally, contrary to what we read, we found several great meals on the Island! You do not have to walk far to find everything from crepes and pastries to full fve course meals! Thank you again to everyone at the Hotel Saint-Louis en I'lsle for helping make our stay in Paris very enjoyable. Several thoughts I think will help: - I highly suggest the shuttle to and from the airport. It certainly made getting to and from the airport much less stressful. Remember to book, and reconfirm, it ahead of time. The shuttle is added to your bill which makes it easy to pay. - My wife and I read in several places that finding a good place to eat on the Islands is difficult. I would highly suggest trying some of the restaurants there. We found several on the street the hotel is on, and the main intersecting street that were delicious and not budget busting! - Utilize the breakfast at the hotel when venturing out to one of the tourist sites. I quickly found that 13 Euros was not unreasonable in Paris, especially for the amount of food you get. Additionally, eating a big breakfast allowed us to avoid to over priced tourist traps near or in the sites. - the hotel has an IPAD, free Wifi, and a computer and printer downstairs for guests to use.", "Date": "November 28, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Corona, California", "Title": "“What a pleasant hotel!”", "Author": "Patricia J", "ReviewID": "UR121025576", "Content": "We traveled with our child to this marvelous hotel and we booked a Top floor room for 3 persons. That hotel has been recently renovated with lots of taste and quality material. The most important thing is its location: in the heart of Paris (even in the middle of the Seine river, on the \"Saint-Louis\" island). The area looks like a small village and you can see people smiling everywhere. What a pleasant place to go! We highly recommend this hotel. Don't miss it!", "Date": "November 25, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Montreal, Canada", "Title": "“What an amazing hotel!”", "Author": "Henry H", "ReviewID": "UR120958681", "Content": "My wife and i spent a couple of days in this hotel and we were extremely pleased. The location is absolutely central, on the \"Saint-Louis\" island, facing the Seine river. The staff were very polite & helpful. Our room was a reasonable size (according to Paris standards...) and breakfast was excellent (for a reasonable price : €13.00). Last, we used the airport shuttle service from the hotel and it was on time and very efficient!", "Date": "November 23, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Las Vegas, Nevada", "Title": "“great stay; will definitely return”", "Author": "jjaylad", "ReviewID": "UR120894673", "Content": "this place is beautiful and has a great location, en lisle... definitely a different experience. The location on an island makes you feel less congested, if you follow me. It definitely beats staying in the latin quarter(blah) or anywhere north of the marais(blah... too many tourists/too nyc-esque). This area is also incredibly quiet(i stayed on the first floor my last week there, but I got plenty of sleep even when i turned in early). regarding the bathrooms, unless ur doling out $$$ for the the ritz/intercontinental, the awkward showers are to be expected in paris based on my (12+ years) experience. my second room on the first floor had a better shower(stand-up) than the top floor room. the staff here is help, funny and charming.... and most all of the restaurants nearby are amazing(though i'd skip the sandwich shops for better/cheaper ones east of l'isle). make sure to take a stroll from here to the place des vosges, and check out the wine selection at the little market a few doors down(amazing selection of reds), and i very much enjoyed the seafood (country) salads at Le Louis Ix on the corner toward the lower eastward bridge. this is my first time visiting alone or away from the 17th arr., and I learned that the marais is even more awesome than they say! i'd recommend the marais for random cafe dates and drinks, and the latin quarter westward for nice sit-down dinners. prices here are amazing for the cleanliness and Very new, historically preserved rooms. even my snobby french cousin was impressed when I told him the price! this place is a great find and I'll be back later this winter.", "Date": "November 22, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Arlington, Virginia", "Title": "“A gem in Paris!”", "Author": "Gary W", "ReviewID": "UR120862248", "Content": "A very good place to stay. This is a nice elegantly decorated hotel, in an excellent location within walking distance from the main sites. Great shuttle service!", "Date": "November 21, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Victoria Australia", "Title": "“Charm and service right in the middle of Paris”", "Author": "SusanP196", "ReviewID": "UR120723135", "Content": "On our return to Paris in late October 2011 we had a brief overnight stay at the Hotel Saint-Louis en l'Isle and it was just delightful. Booking it was made easy on line as you got to see photographs of the accommodation. Only disappointment was we had booked a deluxe superior double room paid for it through bookings.com and although we were given a delightful room on the ground floor, I don't think we got what we paid for. However, the service and charm of this very well kept hotel was excellent. Walk out the door and you could east to your heart's content (at a price of course!). We would stay there again for the excellent service, which included a pre-arranged shuttle to and from the airport if you required for 60 euro.", "Date": "November 17, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "1"}, "AuthorLocation": "Los Angeles, California", "Title": "“Rodents”", "Author": "GeorgeK832655", "ReviewID": "UR120603295", "Content": "Well,we had a mouse in our room. The management was outraged, insulted, and shocked that we should suggest there was a mouse in our room. Given the exengencies of my business schedule, I could not change hotels the first night. The mouse came back the second night. We didn't sleep all night. It was a brave little mouse, and I have much more respect for it than I do for the manager of the hotel!", "Date": "November 15, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Sarasota, Florida", "Title": "“Just returned from Paris ! Want the perfect hotel?”", "Author": "Suzanne T", "ReviewID": "UR120527501", "Content": "I just returned from 2 weeks in Paris! The last nights of my trip were spent at this wonderful, quiet little hotel. Close to everything and easy to navigate from and to. I felt safe and well taken care of. The hotel arranged to have their driver take me to the airport as well. No hassle. I am an over 60 traveler who has traveled all over the world so travel and hotels are nothing new to me. I will be coming back to this hotel....the room was lovely and clean with everything anyone would need. Breakfast was easy and pleasant as I read the paper. I would highly recommend this hotel with no doubts. Do not hesitate unmaking this your Paris destination hotel!", "Date": "November 13, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Denver, Colorado", "Title": "“Perfect Paris Hotel”", "Author": "susan_0002", "ReviewID": "UR120423871", "Content": "I stayed at the Hotel Saint-Louis en I'Isle in November 2011 for 7 nights with my daughter while on business. We stayed 2 nights in a small room on the 2nd floor which was perfectly adequate, then 5 nights in a superior twin on the 5th floor which was a great room with two balconies, large bathroom, loveseat etc. The concierges, especially Bernard, were very helpful - charting my way to meetings in the suburbs, recommending (walking me to) local restaurants and the ATM, booking tours etc. The street is very quiet, with many good options for dining as well as a small grocery store, fabulous cheese shop, creperie, boulangerie etc. We did not eat breakfast in the hotel, but chose instead to either have a crepe across the street or pick up a croissant and coffee at the boulangerie and eat on the banks of the Seine (the boulangerie had by far the best baguettes we were served in Paris). By the end of the week I was greeting many merchants daily and felt as if I were really living in the neighborhood. The rooms are completely updated while still charming with exposed beams. They even have a very convenient and reasonably priced shuttle service to the airport which was teriffic after arriving on an overnight flight. My colleague stayed at the charming studio aparrtment down the street that is also managed by the hotel. Look no further, this is a great hotel, in a quiet, friendly neighborhood oozing with charm and convenient to all of Paris.", "Date": "November 10, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Beverly Hills, Michigan", "Title": "“Romantic Hotel Saint-Louis en I'sle”", "Author": "travelbugfrotur", "ReviewID": "UR120289751", "Content": "We stayed at Hotel Saint-Louis en I'sle a few years back for 5 nights and had a wonderful visit. This time we booked for 9 nights. The location of this hotel is perfect in every way. It is nestled in the heart of Paris. The Saint-Louis en I'sle is very romantic and beautiful. Our favorite thing is to walk over the bridge that connects to L'ile de la Cite and pass by the staturisque Notre Dame as we set out on our daily venture. The hotel is perfectly maintained, friendly, and helpful. I can't say enough about our friend Denis - he is so helpful and kind. At the end of the day if you find yourself too tired to go to dinner there are meat, cheese, bread, wine, and even ice cream and dessert shops all steps from the Hotel Saint-Louis en I'sle - you can make yourself at home right in your hotel room and watch passerbys from your window. The I'sle becomes quiet in the evening with possibly a few happy people passing by singing on their way home. Looking forward to another return visit to Paris and definately another stay at the Hotel Saint-Louis en I'sle.", "Date": "November 7, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "3", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Canada", "Title": "“Great historic hotel”", "Author": "madamepapillon", "ReviewID": "UR119203666", "Content": "I highly recommend this fantastic small hotel in central location of Paris, Isle Saint Louis in the middle of the Seine River. Hotel is located near small cafes and grocery shop, short walk across Pont Marie to Metro stop, great creperie a few steps away from hotel. Comfortable bed in very clean bedroom, great view of streets with sound of bells of Notre Dame. Included in our rate was a continental breakfast, including croissants and pain au chocolat in stone cellar. The staff speak English very well and are very helpful.", "Date": "October 11, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Atlanta, Georgia", "Title": "“Apartment at 24 Rue Saint Louis en l'Ile”", "Author": "pcinPTC", "ReviewID": "UR119150813", "Content": "We had book a double for two nights at the Hotel for a short stay in Paris. An early train into Paris put us at the hotel at around 11:00am. Our room was not quite ready, but the friendly host offered us immediate check in at the apartment they manage down the street at #24 Rue Saint Louis. It was a little less expensive than the double at the hotel proper and we were offered complimentary breakfast at the hotel each day. No daily maid service, but the room was clean when we arrived and we only stayed 2 days so it was not an issue. The small, 2nd floor (no elevator) studio apartment turned out to be just fine and although we really only spent time there to sleep it was a perfect accommodation for exploring Paris from L'Ile.. It had a little, well-supplied kitchenette (which we did not use other than borrowing a corkscrew and glasses to drink wine down by the Seine), bathroom with shower (no tub) and towel heater. With an adequately queen-sized bed and a small table with chairs there was not much room to move around in the bedroom, but if you're not planning on spending a ton of time in the room it is OK. The room overlooks a small, quaint courtyard (as do many adjacent apartments) and although we were a little concerned about potential neighbor noise when leaving the windows open we did not experience any significant noise issues. I'd recommend to those who would like a clean, comfortable (if small) apartment off the street on L'Ile.", "Date": "October 10, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Reading, UK", "Title": "“Great Hotel for a romantic break”", "Author": "Monkey2007", "ReviewID": "UR118873268", "Content": "Beautiful, recently refurbished boutique hotel in a fantastic location on the Isle St Louis, the smaller of the two islands in the middle of the Seine. This means all the attractions are literally on your doorstep, yet this hotel is relatively peacefully located. Very friendly welcome and helpful management. Really lovely clean, modern bathroom with a walk-in shower, comfortable bed with good quality linen. The room even features tea and coffee-making facilities: a rarity outside the UK in hotels of this category. Recommend this for a romantic getaway!", "Date": "October 3, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Atlanta, Georgia", "Title": "“Not a fan of small hotels - but this one is the exception”", "Author": "Gail S", "ReviewID": "UR118449016", "Content": "I usually stay in large full service hotels when in Paris. However, ventured out to the Saint Louis I'isle and found both the hotel and neighborhood to be the \"real\" Paris. Hotel is close to pastry shop, butcher, cheese shop, cafes, excellent restaurants, everything needed for a great vacation. 10 minute walk to the Marias, Notre Dame, Latin Quarter, Maubert Markets, etc. The hotel is very reasonably priced. We had two rooms, I recommend room 212 which is a very large room with a winding staircase up to a sitting area, with King bed. Exposed beams and skylights make it bright. All amenties including large marble bathtub, free wifi, lovely bath products, robes, etc Hotel staff, especially Theirry, are very friendly and helpful. Loved this place, and will recommend to all my friends and co-workers. .", "Date": "September 22, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "3", "Overall": "3.0", "Value": "4", "Service": "4"}, "AuthorLocation": "London", "Title": "“Sweet place but room was tiny”", "Author": "trueLondoner", "ReviewID": "UR117414336", "Content": "We stayed there for the location. Overall a good experience but the room was tiny you could hardly stand by the bed. Most importantly the light in the shower was quite exposed and didn't seem very safe. The location is great but with the room being so small you felt you were sleeping in the bathroom. Also the water in shower did not drain quickly enough so we had to take breaks in the shower in case we got water in the room. The bed was a bit tough and if you have problems with noise it can be a bit noisy. On the plus side the guy in the reception offered to give us some of his toothpaste when we told him we forgot ours at home!", "Date": "August 29, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "4", "Service": "5"}, "AuthorLocation": "Marzabotto", "Title": "“romantic, perfect location”", "Author": "Italian68", "ReviewID": "UR117195076", "Content": "If you are looking for a large luxury hotel, with spacious rooms and jacuzzi, this is not the place for you. Here you'll find a small hotel full of charm and atmosphere, but nonetheless comfortable and well equipped. The rooms are tiny and beautiful and the hosts are very friendly. Moreover, its location within the Isle Saint-Louis is simply perfect, with many bistrots and nice shops in the vicinity. Just one defect: the breakfast, not included in the price of the room, is perhaps too much expensive (€ 12 per person).", "Date": "August 24, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "3", "Overall": "4.0", "Value": "4", "Service": "4"}, "AuthorLocation": "Philadelphia, PA", "Title": "“Perfect location”", "Author": "Mitch16", "ReviewID": "UR116535841", "Content": "My wife and I stayed at the Hotel Saint Louis primarily for its perfect location as a starting out point for exploring Paris. The hotel couldn't have worked out better. The rooms were definitely on the smaller side (at least ours was) and the bathroom was tight as well. However, what an experience it was to open our shutters and lean out the windows overlooking the foot traffic of Isle St. Louis. This place offers great value for its location and I'd highly recommend it.", "Date": "August 10, 2011"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "Reading, United Kingdom", "Title": "“Amazing location - great hotel”", "Author": "Elmozza", "ReviewID": "UR116205896", "Content": "Ile St Louis is my favourite place in Paris - we'd spent a few hours exploring on our last trip to Paris and decided we'd definitely stay on the Island if we visited Paris again. The hotel is in a great location - our room was small but perfectly formed. Couldn't really ask for anything more. Would definitely stay here again, for the location if nothing else!", "Date": "August 3, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "USA", "Title": "“Perfect!”", "Author": "abrownchair", "ReviewID": "UR115846713", "Content": "The best location in all of Paris! You are literally in the center of Paris and the neighborhood is so charming, so intimate, so close to everything, it is hard to leave. Bernard at the front desk will walk you to your desired location, not just tell you about it. The hotel was very clean, very neat and looked like it had just been renovated. The spiral staircase was beautiful and elevator was helpful (amazingly small!). The air conditioning worked perfectly, the view was lovely and the bed was comfortable. The closet handled all our luggage for a two week stay. The mini fridge was well stocked and had room for other items. The bath was beautiful, well laid out and CLEAN! The price for Paris boutique hotels was lower than most so we all (2 couples) felt that the value was exceptional. Will be our 1st choice when we return.", "Date": "July 27, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Lafayette, Indiana", "Title": "“C'est Magnifique”", "Author": "tbrooksjr", "ReviewID": "UR115507126", "Content": "It has always been a desire of ours to stay on the Isle St. Louis. This was the perfect place to stay. We were greeted by Dennis and he couldn't have been nicer or more helpful. He was always smiling and attentive when we were in the lobby. Our real surprise was the room. What a fantastic room. If you've ever been to France, you know the rooms are small. We were expecting this, so were surprised that it was as large as it was. But, the best surprise was the balcony. We had a fantastic view out the window and could step out and watch the crowds below. They have recently renovated the hotel and the rooms were clean and comfortable. The hotel is centrally located and close to all the sites. This is the place to stay in Paris.", "Date": "July 18, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "ct", "Title": "“Quiet, Charming Hotel in the heart of Paris”", "Author": "maynev", "ReviewID": "UR115284405", "Content": "The Hotel was perfect for us and the staff was very helpful and attentive. They are focused on providing a hgh level of personal service. Booking via e mail was easy and painless. All was just as we requested when we arrived. We hope to stay here again on our next visit to Paris.", "Date": "July 12, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "4.0", "Value": "5", "Service": "4"}, "AuthorLocation": "Scranton, Pennsylvania", "Title": "“Lovely hotel in the best part of Paris, but missing a few things”", "Author": "Nkwoman", "ReviewID": "UR114806844", "Content": "I stayed on the 3rd floor and thought the room and the view were quite charming. Yes, the rooms are very small. Yes, there are teeny tiny steps and you have to lug your stuff up half a flight to get to your room. They look to have recently upgraded the rooms, but some key stuff is missing. No door hook on the back of the bathroom door for a robe. No shelf or soap holder for your hair care, body wash etc in the shower itself. Had to put them on the ground. No plug anywhere near a mirror so us ladies can blowdry our hair and actually see what we are doing. I appreciate the free wi-fi and the reasonably priced mini bar items. You couldn't find a better deal for snacks and sodas. There was an issue with some garbage truck noise in the early hours so if you are a light sleeper, take this into account. You're still going to hear it at another place down the street. I would definitely recommend this hotel for those who can get around. If you are elderly, overweight, or can't manage hiking your stuff up the stairs, look elsewhere. For everyone else this is a beautiful place in the best part of Paris.", "Date": "June 27, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Melbourne, Australia", "Title": "“A boutique hotel in quiet location, clean, comfortable and charming, Great location. Someone else has described it as quirky a”", "Author": "Aussietraveller084", "ReviewID": "UR114496912", "Content": "A lovely place to stay but you have to be prepared for it to be small, small room, small lift and you need to be able go carry your luggage up or down 1/2 a staircase. The staff were very helpful and the place was spotlessly clean. It would be hard to find a quieter place to stay in Paris. Good restaurants nearby and walking distance from lots of the highlights ib Paris.", "Date": "June 20, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "4", "Overall": "4.0", "Value": "4", "Service": "4"}, "AuthorLocation": "Calgary", "Title": "“nice hotel on the island”", "Author": "DRT1404", "ReviewID": "UR114343234", "Content": "It was always nice to stay on Ile St Louis, especially when you find a nice hotel at good rates. This is the case here. The service was excellent and very helpful. It is centrally located on the island, near many restaurants, and just a few minutes from Notre Dame and the Seine.", "Date": "June 19, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "4.0", "Value": "4", "Service": "4"}, "AuthorLocation": "London", "Title": "“Small but perfectly formed”", "Author": "mynameisalwaystaken", "ReviewID": "UR113709762", "Content": "Stayed for 2 nights here recently whilst attending a sporting competition. The location is just about the most central part of central Paris that you could find! which makes the price of 169 euros a night a fairly decent price when you compare with other central Paris hotels. Hotel itself is extremely well maintained and very pleasant. I have read some reviews on here that mentioned noise from the street cleaners, which whilst I did experience it, it really wasn't much of a nuisance. Very comfortable bed, slept very well. The hotel were happy to look after our bags as well on the final day as we weren't leaving until later on. Would happily stay here again.", "Date": "June 15, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "4", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Eugene, Oregon", "Title": "“Great hotel, will surely return!”", "Author": "blacklab1601", "ReviewID": "UR113254716", "Content": "This is by far the best hotel we've found in Paris. The staff was uniformly excellent, (especially Dennis, who greeted us on our arrival and got our room prepared in one hour, even though we arrived on an early morning flight) and the location can't be beat. Accomodations are Paris size but the A/C and free wi-fi in the room more than make up for a bit less space than we are used to in the USA. Also had a nice little balcony for our morning cup of tea and croissant purchased from the pâtisserie across the street. Highly recommended.", "Date": "June 13, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "1.0", "Value": "3", "Location": "5", "Rooms": "3"}, "AuthorLocation": "Melbourne", "Title": "“Ouch”", "Author": "tortoise3", "ReviewID": "UR111291539", "Content": "Currently enjoying a double bed when we booked a twin. My friend will have to borrow a camping mat from a local buddy & sleep on the stone floor. NOT HAPPY.", "Date": "June 3, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Ashburn, Virginia", "Title": "“Worth waiting a lifetime!”", "Author": "Uprcase", "ReviewID": "UR109170911", "Content": "I spent six nights at the Hotel Saint-Louis en l'Isle in mid-May, and it was a wonderful experience. Traveling alone for the first time in France, I felt completely at home in the excellent care of Denis and the entire staff. For each of my million questions, there was a helpful answer delivered with a warm smile and great good humor. The housekeeping staff is top-notch, giving constant care to the surroundings and to the comfort of guests. The location is perfect for a pleasure visit to Paris, with easy access to the city's exquisite museums and historic/cultural venues. And the tiny surrounding streets are filled with cafes and unique shops just a few steps from the hotel's front door. The only negatives a guest may find at the Saint-Louis are the room sizes and the night noise from some of the nearby cafes. I have several tall and round friends who would have trouble fitting comfortably into the bathroom. But size and noise are more an issue of Parisian life than of hotel deficiency.", "Date": "May 21, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Ballarat, Australia", "Title": "“Great location and wonderful staff”", "Author": "Lawrence8866", "ReviewID": "UR104996374", "Content": "Central, stylish, clean and welcoming. Comfortable room, beautiful surroundings, ambience plus and helpful staff. Will return on next trip to Paris.", "Date": "April 22, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Cambridge, United Kingdom", "Title": "“Wonderful hotel, generous staff”", "Author": "cmurc", "ReviewID": "UR99562168", "Content": "Received graciously by hotel staff; conveniently located in central Paris, amenities excellent with recent renovation. We will happily return!", "Date": "March 9, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "3", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Amstelveen, The Netherlands", "Title": "“Excellent Hotel”", "Author": "SuzzieQ16", "ReviewID": "UR96741458", "Content": "We really enjoyed staying here, it is a perfect Hotel with a great location and clean rooms and perfect staff!! We stayed 2 nights on 4th floor with great view and okay really small but great room with everything in it. The minibar has normal prices so you can take a drink without spending to much money. And Wifi.....really nice and boxes to put your Iphone on for your music...EXCELLENT! The breakfast in the hotel you must experience, so nice. Tip is also go on the Batobus though the Seine with hop-on hop-off service great to see Paris from the water. And go see the Marais and Les Halles really nice parts of Paris! Museums: Musee D'Orsay....wauw what a building to go and the paintings....if you like Monet I must visit this museum. Have fun and stay at this Hotel, we really recommend it and we will go there if we are visite Paris again, no doubt.", "Date": "February 15, 2011"}, {"Ratings": {"Overall": "2.0"}, "AuthorLocation": "Colorado", "Title": "“disrespectful staff”", "Author": "jcliff5", "ReviewID": "UR92210088", "Content": "The hotel itself was lovely, but one of the staff thought it was perfectly okay to stand next to the breakfast room and discuss the quality of his recent sexual encounter, in detail, to another staff member while I was sitting there having my breakfast. It was pretty disgusting.", "Date": "January 8, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Washington DC", "Title": "“A jewel of a hotel”", "Author": "KathyD79", "ReviewID": "UR91279364", "Content": "We stayed at the Hotel Saint Louis for 5 nights and really loved it. The location is wonderful, giving the capability to walk to many places. There are lovely shops and restaurants right on the rue Saint-Louis en I'Ille. The shuttle service to/from Orly was efficient and worked really well. The staff was very helpful. All in all, a wonderful experience, the best we have ever had in Paris. We will certainly come back again the next time we are in Paris.", "Date": "January 1, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Gold coast australia", "Title": "“A perfect place to stay”", "Author": "MikeyGoldCoast_11", "ReviewID": "UR91267938", "Content": "Thoroughly enjoyed my three day stay at this charming property. Dennis and Bernard were so professional, nothing was too much trouble. A quaint little hotel with a big heart in a perfect location.I'll certainly stay there again, given the opportunity to return to Paris. Miley Gold Coast Australia", "Date": "January 1, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Atlanta, Georgia", "Title": "“Great renovation, great location”", "Author": "CW17", "ReviewID": "UR89173198", "Content": "I've stayed at Hotel St Louis at least once each year for the past 4-5 years because of the great location and great service. Now it's even better. The 2010 renovation is wonderful. Owner, Philippe, has added sound proofing, modernized the bathrooms, upgraded the lobby and handicap accessible rooms. Bernard and Denis continue to provide excellent front-desk service. A great little hotel.", "Date": "December 6, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Kemah, Texas", "Title": "“Fantastic Hotel -- Perfect Location -- A Real Gem”", "Author": "GalvestonSailor", "ReviewID": "UR88643929", "Content": "We stayed for five nights and I wish it could have been longer. The staff at the front desk was great; they helped with restaurant reservations, directions, ideas of things to see, anything we needed. The room was larger than I expected and we had a cute little balcony. Also, the location is perfect. It is in the middle of everything to do in Paris -- we rarely had to take public transportation since we could walk everywhere. But at night this neighborhood is residential so it is very quiet and peaceful. We definitely will stay here again the next time we go to Paris.", "Date": "November 30, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "3", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Baltimore", "Title": "“Great room, great location, noisy trash collectors”", "Author": "dancerjohn", "ReviewID": "UR87208310", "Content": "This was our second time staying at this hotel and we love it. The staff is really nice and helpful. The rooms have newly been renovated and are very comfortable, modern and fairly roomy. The location is absolutely perfect being 100m from Notre Dame. The hotel was doing improvements which were noisy at times but they said they are closing next week and all the updates will be done. We love Ile Saint Louis and will probably stay on the island every time we go back. There are only two warnings. First we were woken up each day at 6am by the trash collectors. We stopped opening the window which helped but then the AC wasn't great. Second, the elevator stops between the floors so you have to take your luggage up at least 5 stairs to get to your room.", "Date": "November 15, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "3", "Rooms": "5", "Location": "5"}, "AuthorLocation": "London", "Title": "“Location perfect, wonderful staff, small but nice very rooms. NOISY REMODELING!!! I recommend but with some reservations”", "Author": "CJA23", "ReviewID": "UR86214147", "Content": "Let start with the staff. The reservations person (Dennis) was my first contact. Very friendly and always nice. However, I requested two rooms since we had three adults traveling. He told us that he had the two rooms for all but the first night. He insisted that a \"triple\" room would be a good solution and that it would fit three adults so we went with it. Mistake#1. The room was extremely small and could barely fit two people comfortably so for american standards skip the triple room and always get the extra room if more than 2 adults. For children may be appropriate. Nevertheless the second night we got our 2 rooms as promised and it was a lot better. The rooms are tiny compared to american standards but very modern and very clean. However, the air conditioner in my room was not functioning. Since it was November, I thought it would not be a big deal. Mistake #2. The room was never really hot as long as you kept the nice breeze coming through window. However, the location of the hotel, although excellent, has is weaknesses. Expect a lot of late night drunk people walking by singing in French, which is cool only when you are drunk and singing along. If you are trying to sleep then you need to close the window and guess what... No AC. It was not a big issue but I would had not gone along with it in the summer heat. Again with th staff: Dennis counterpart was an older man who spoke French, English, Spanish and then some. He was such a nice man. Always very helpful and had a lovely personality. He is the reason why we decided not to complain about any of our issues. The cleaning lady was also very friendly and appeared to do a good job.The rooms were tiny but very pretty. THe bathrooms small were very modern and spotless. Now my biggest issue with the hotel will hopefully be a transient one and relates to the remodeling. there were nosies of a hammer heard as early as 9am sometimes and that was not pleasant to wake up to during vacation. I think the hotel overall is very nice and I would stay here again as long as the remodeling is done and over with (and the AC works). The breakfast is not good in any way so forget about spending 12 Euros on it when you have amazing food shops surrounding you which are a lot cheaper. The location is unbeatable and the staff are lovely but noise was bothersome at times. I recommend this hotel but would call ahead and make sure you get what you want in a vacation. The price appeared reasonable for the wonderful location (140 Euros) but if this goes up the so should the experience (ie NO NOISE). Overall, I would likely stay again but will make very specific questions before booking.", "Date": "November 6, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Boston MA", "Title": "“OOH La LA”", "Author": "EdsoF", "ReviewID": "UR82645665", "Content": "This Hotel is a jewel. It is in a perfect location for anyone visiting Paris. Just around the corner, a few miutes away is theNotre Dame Cathedral. Fabulous, Awesome to be able to walk. The little streets are filled with lovely shope, cafes and patisseries. What more could you ask for. The hotel staff are wonderful, very helpful and pleasant. They are there to serve, to make your stay in Paris everthing you desire. I recommend this hotel highly but advise you to plan ahead. It is a small hotel so you must make you reservation months in advance. They do offer a shuttle service from the airport, there is a charge. I hope you will have a pleasant journey and enjoy the Hotel St Louis as much as we did. Au revoir", "Date": "October 8, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Saint Louis, Missouri", "Title": "“Nice and Simple”", "Author": "matthewpaul80", "ReviewID": "UR81632856", "Content": "A nice cozy hotel in an area with a lot of cute shops and bistros. It's a slight walk from the metro, so I recommend taking a taxi if you have a lot of luggage. The breakfast room in the cellar is very charming. Rooms were recently redone and in a nice modern taste. Some small details missing, no towel rack in the bathroom or soap dish in the shower, but not a big deal, overall a great modern room. i recomend it.", "Date": "September 30, 2010"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "New York City, New York", "Title": "“ABSOLUTELY LOVED IT”", "Author": "lrivera51", "ReviewID": "UR76968694", "Content": "this was our first trip to Paris and we didn't know where we were going to stay. from the moment we entered the lobby we all fell in love with the place. the staff was super friendly... loved the quaint breakfast...room was small but comfy, bathroom was excellent..very clean and quiet. we had the room facing the street .. was not nosey at all.. sorry we were there only for 2 days would have loved to stay longer. planning to return for our 40th anniversay and staying in the same room... great location walked to different places from there... went in sept which was a little cool... took a day trip to Normandy Beach... very emotional.... the guide was fantastic...", "Date": "August 26, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Arlington, Virginia", "Title": "“A gem -- perfect location, great staff, some quirks”", "Author": "LovesFrance2010", "ReviewID": "UR72248557", "Content": "Ile Saint Louis is a great place itself, right by Notre Dame, and this hotel's location is perfect for seeing the whole city, especially if you use the hop-on, hop-off Batobus to get to different quarters. There are two stops very close to the hotel. The hotel was being renovated when we stayed, but the work wasn't inconvenient. The rooms are not huge, but they're very nice, and the decor has obviously been upgraded very recently! There's even air conditioning. The windows are virtually soundproof, which is good because the garbage trucks go by early in the morning and will wake you if you have the windows open. All of the reception staff speak fluent English and various other languages, and they are exceptionally friendly and helpful. There is an elevator, but it stops between floors, so you have to go up or down half a flight on a circular stairway. Breakfast is in a cave-like basement and is fine but not special, so walk a block down the street to a cafe and enjoy the view. The Ile has bakeries, cheese stores, grocery stores, wine shops, fruit stands, a self-service laundrette -- and Bertillion's excellent sorbet! The hotel has free Wi-Fi, but downloads are very slow; if you need the Internet a lot, you'll be frustrated. Also, you must insert the room key in a special holder for the electricity to work, so don't try to charge your cellphone when you aren't in the room. (Ask at reception, though, and you can get a card to work the \"juice\" without the key.) Overall, a lovely place and a great experience.", "Date": "July 25, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Washington DC, District of Columbia", "Title": "“Quaint Hotel in a Great Location”", "Author": "lapope", "ReviewID": "UR69792350", "Content": "The hotel is small and simple with some Parisian charm. My room was small but very clean and up to date. The lobby is small but comfortable and the staff was helpful and courteous. (The stairs are steep and the elevator is very small.) Breakfast was fresh, simple and served in a cool, grotto-like cellar room. For me, the best feature was staying on Saint Louis island. It’s charming and quiet, but central to both the Marais and Latin Quarter, and several metro stations. A pleasant surprise: on Friday evening the river bank along the Seine filled up with students picnicking into the evening.", "Date": "July 5, 2010"}, {"Ratings": {"Service": "2", "Cleanliness": "2", "Overall": "3.0", "Value": "3", "Sleep Quality": "1", "Rooms": "2", "Location": "5"}, "AuthorLocation": "Chicago, Illinois", "Title": "“Beware: no ac, construction dust and noise”", "Author": "janemc24", "ReviewID": "UR66374092", "Content": "We arrived on May 24, a day when the temperature in Paris went up to 84 degrees. It was very unusual for it to be that hot in Paris in May. Our room on the third floor was stiffling. We tried in vain to turn on the air conditioning. When we inquired at the front desk, they simply said that the air conditioning is never turned on until June. They weren't very apologetic about it either. Our first night I was so hot that we had to open the windows ,,, the only problem with that is that the narrow street where the hotel is located reverberates with noise. Honestly, you can hear each person cough. It was a holiday in France that day and so people were partying and the street was loud well into the night. I didn't sleep the entire night and came downstairs to talk to the front desk clerk and burst into tears. I am not trying to be dramatic here but I do have to say it is the worst night's sleep I've ever had in a hotel. It just wasn't what I pictured at all. I had to beg for a fan and they made a big deal about the manager bringing over two fans - one for us and one for our daughter;s room. Lucky for us the weather cooled off after the first two days we were there. Otherwise, I don't know if I'd have gotten any sleep and we were staying there for an entire week as we were visiting our son who is studying In Paris for four months. I guess if it was stiffling hot and loud for just one night, you could put up with it but for a whole week ... it just didn't seem like we got what we had hoped for out of our hotel. The other problem is that the place is under construction. Loud banging all day long ... even on the weekend. If you want to come back to your hotel to rest, you can forget about it. There is construction dust and the carpeting on the stairs is disgusting from all the construction traffic. I complained to the front desk clerk and they didn't offer us anything for our inconvenience. I found this appalling but my husband didn't want us to seem like \"ugly Americans.\" I loved the location but I wished I had spent more money and stayed down the street at the nicer hotels. The hotel just wasn't the antiques-filled, charming property I thought it would be. The lobby was very rundown with four headboards stashed behind on of the pieces of furniture. It could be so quaint but it was all so run down except for the new bathrooms which were gorgeous.", "Date": "June 3, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Summerfield, Florida", "Title": "“A gem of a hotel located in the perfect setting!”", "Author": "ElizabethStak", "ReviewID": "UR65702364", "Content": "The Hotel Saint Louis is the perfect spot from which to visit Paris. We were within walking distance of Notre Dame, the Bastille and even the Louvre! The hotel is located on L'Isle of Saint Louis and a short walk will lead you to anything you may want -restaurants, shopping, boulangerie, ice cream, crepes, ATM, etc. The hotel is undergoing renovations and we (6 women) stayed in rooms which had been renovated. Although the rooms are small ( to be expected), the beds were comfortable and the rooms had a nice closet, flat screen TV, free wi-fi and the bathrooms were great! Bernard, the concierge, took great care of us. He helped us make all kinds of travel arrangements and book museum passes before we ever arrived. Bernard also took us on a tour of Versailles which I would highly recommend. Due to a passport mix-up I was delayed by a day and Bernard made arrangements for me to stay another night and to get me back and forth again to the airport. A great place!", "Date": "May 29, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "3", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Calgary", "Title": "“Vive La France, Vive Hotel Saint Louis!!”", "Author": "sarafish81", "ReviewID": "UR65401844", "Content": "My hubby and I stayed here at the beginning of April for our honeymoon. The location of this hotel is incredible. You are steps away from Notre-Dame Cathedral, there is a fromagerie, bakery, grocery store and liquor store all right outside the hotel. We stayed on the top floor (which has recently been renovated) and it was fantastic! The rooms are small, but clean, with comfortable beds, flat-screened tv, iPod docking station, and new bathroom. Bernard and the rest of the staff were so accomodating. I would go back again in a heartbeat. I think once the balance of the hotel is renovated people won't be so hard on the quality of the rooms. That being said, I'm sure the prices will increase drastically once the hotel is completely renovated.", "Date": "May 26, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Notts", "Title": "“Lovely little hotel in a fabulous location”", "Author": "Lindylu1", "ReviewID": "UR65374038", "Content": "I was a little concerned after a friend booked this and then I read some reviews stating that the hotel was filthy and the staff were rude, thankfully my concerns proved to be completely unfounded. There was some major refurbishment of some of the rooms going on while we were there, they had started at the top and were working down, when we stayed they were finishing the second floor (3 bedrooms) and were about to start the first floor (3 bedrooms). On our first night we had an old non-refurbished room which was indeed very disappointing as it was very dated and the shower wasn't very good but we asked for a different room and the staff were very obliging asking us to pack our things before we left for the day and when we returned they had moved it all into a refurbished room. The new room was very nice and finished to high standard with a king sized bed, it was an extra bonus to find that all the refurbished rooms are also fitted with an ipod/iphone docking station and flat screen TV with BBC world news. My only criticism would be that there were no drawers to keep the smalls in and the hanging space in the wardrobe was not long enough. Our friends had room 52 at the top of the hotel, this room was much bigger with better storage and a jacuzzi bath (all other rooms have showers), I would ask for this room on any future visits. We found all areas in the hotel to be spotlessly clean with the exception of the stairs due to the works being carried out. This hotel would not those with serious mobility problems as the lift goes between floors so there are always about 5 or 6 steps to deal with on a spiral staircase, the lift runs up the side of the staircase and you exit onto a small landing between each floor. The hotel provides a taxi service to and from the airport (about 80 Euro each way), this was great as it is about a 40 - 50 min trip from the airport. The staff were friendly and helpful with a pleasant sense of humour and I would have no hesitation in returning to this hotel for future trips to Paris. The hotel is situated on the small Isle Saint-Louis tucked away just behind the Notre Dame. It can be a little noisy as the Isle is lively until the wee hours but during the day and at night there is some wonderful entertainment from the buskers and street entertainers. If you like comfort and being close to but not in the middle of the action this hotel is for you.", "Date": "May 26, 2010"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "Buenos Aires, Argentina", "Title": "“Tiny but priceless”", "Author": "Abbe_Faria", "ReviewID": "UR52686295", "Content": "To be based in the Ile Saint Louis is priceless. The most perfect spot in the most perfect city. Forget about amenities, and huge rooms. Location, location, location!", "Date": "January 5, 2010"}, {"Ratings": {"Service": "2", "Cleanliness": "2", "Overall": "2.0", "Value": "2", "Location": "5", "Rooms": "1"}, "AuthorLocation": "Denmark", "Title": "“Bad hotel in great location. Avoid room 44”", "Author": "KasperJ", "ReviewID": "UR49788808", "Content": "We were recommended this hotel by family that had just stayed here. The location is really great onthe isle in a very charming street with small charming shops and great restaurants. The hotel itself seems quite run down from the lobby and the stairs etc. Our room (44) a \"superieur\" was a real disappointment. It smelled like an old smokers room and walls are covered with green moist fungus. So much we had have the terrace window/door open the whole time. Which is not good for noise during the and early morning. When we complained about the room the owner said he could not help us because the hotel was fully booked. He offered us free breakfast instead. The bathtub was also unusable because it was missing the plug. Overall we were disappointed with the hotel but the location is inbeatable.", "Date": "November 22, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Location": "5", "Rooms": "3"}, "AuthorLocation": "Cincinnati, OH", "Title": "“Great location, friendly staff”", "Author": "heidisue15", "ReviewID": "UR47358164", "Content": "I enjoyed my stay at Hotel Saint-Loius en l'Isle and have already recommended it to others. We were there in February during the \"off season\" and practically had the place to ourselves. The staff was very friendly and helpful. They made restaurant reservations for us via e-mail correspondence prior to our arrival and then further helped us with reservations once we arrived in Paris. The hotel is situated on a lovely street filled with boutiques, restaurants and cafes. While there is no metro station on the island, it is a short and picturesque walk to several metro locations off the island. Rooms were typically small but bathrooms were new and updated.", "Date": "October 20, 2009"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Overall": "4.0", "Value": "3", "Location": "5", "Rooms": "2"}, "AuthorLocation": "Vancouver", "Title": "“Great Location”", "Author": "Jack1977", "ReviewID": "UR36218490", "Content": "My wife and I just returned from a european honeymoon. First stop, Paris and the Hotel Ile St. Louis in Paris. Like the other reviewers, we found our room extremely small, and the bathroom like something out of the Hobbit. That said, you couldn't find a more ideal location from our perspective. We enjoyed being on the island right behind Notre Dame and we were able to walk to most of the major sights or rent the city 'velo' bikes and putter around town. We found the front desk staff friendly and helpful. My only complaint is that during our stay a silver necklace of my wife's went missing. We cannot say for certain whether it was taken by the hotel cleaning staff but we were pretty sure it was left in the room during one of our trips. On balance however, particularly with regard to the hotel's perfect location, we strongly recommend this hotel. John & Karley, Vancouver Canada", "Date": "July 30, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "3.0", "Value": "4", "Location": "5", "Rooms": "3"}, "AuthorLocation": "Netherlands", "Title": "“Great location”", "Author": "Hollandtraveller", "ReviewID": "UR35157124", "Content": "A friend and I stayed at the Hotel Saint Louis during a weekend in Paris in July. Although we had booked a standard double room, we were upgraded and got Room 52, which is a room on the top floor. The room was incredibly large by Paris hotel standards and had two beds, a double and a single bed. The room was fine, although the bathroom could use some renovation. The best thing about this hotel is the location. It is walking distance from the Marais and the Quartier Latin, so you waste no time on the metro getting anywhere. We didn't have breakfast at the hotel. There are plenty of places to eat around the hotel. The man at the reception was extremely helpful and gave us lots of useful tips. Overall, for the price we paid, we were quite happy with this hotel. If you're looking for a hotel with a good location and don't plan to spend much time at the hotel, this is the place. There are a couple nicer hotels on the Ile St Louis but they are more expensive.", "Date": "July 19, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Location": "5", "Rooms": "3"}, "AuthorLocation": "New haven, CT", "Title": "“Location...Location...Location”", "Author": "CT5kids", "ReviewID": "UR34068074", "Content": "Loved this little hotel on the Ile St Louis less than 300 yds from Notre Dame Cathedral. Rooms were small, slightly dusty, but the bathrooms were immaculate. We required 2 rooms (dbl and a triple) so we had the top floor. The floor to ceiling french doors to balconies in each room were breathtaking as we went to sleep and awoke across the rooftops of Paris....but if you were taller than 5'3'', you had to duck in the shower. Also, 81 steps up the narrow winding staircase was tiring after a long day (we got the luggage up the tiny lift day 1, but after being stuck for a few minutes nose to nose in the cellar while on the elevator made us all leery thereafter.). The concierge, Bernard, was friendly and helpful and our drivers to/from the airport were incredibly efifcient and welcoming (we travelled with 3 girls aged 10-15).....again, location was worth every bit of the steps upstairs at night. Great boulangerie across street and market 2 doors up. Also, nice creperie next door. Overall, a good experience", "Date": "July 6, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "rochester, NY", "Title": "“Great Find!”", "Author": "gapgirl2111", "ReviewID": "UR21968289", "Content": "Initially we chose this hotel for it's great location! It is right in the dead center of Paris. That location CANNOT be beat! It is near tons of little shops and restaurants, also there is a little super market right next door , which is convenient. The staff was awesome, also friendly and talkative - they all speak great English. They have a small elevator - my husband and I mainly took the stairs - but if you have a hard time with stairs you might want to request a room on a lower floor. We didn't have problem with noise at night. Slept well. We asked for a double bed and to our surprise actually got a double bed and not just two twins pushed together which is sorta the norm in Europe. They have a great continental breakfast . Fruit, Juice, Coffee, Cereal, Bread, Pastries.... This hotel is not a luxury hotel by any means, but you wouldn't expect that for the rates your paying (we paid about $200 / night) including breakfast. I definitely reccomend this place and I'm VERY happy we found it and stayed there.", "Date": "November 18, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Check in / front desk": "5", "Overall": "4.0", "Value": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Nottinghamshire, UK", "Title": "“Beautiful Location!”", "Author": "psarah", "ReviewID": "UR19072267", "Content": "This hotel is situated on the beautiful and quaint Ile Saint Louis, which is a little island in the middle of the Seine. It is surrounded by boutique shops selling gifts, trinkets and lots of ice-cream, crepes and snacks. It is just behind the Notre Dame Cathedral and within walking distance of the Louvre museum. The staff were very accomodating and friendly and they provided us with a room on a high floor as requested. We were given a lovely corner room with two double french doors that led out onto a corner balcony with fab views! As a word of warning - be ready for tiny bedrooms with tiny bathrooms... We couldn't sit straight on the loo! I resorted to putting things on the balcony as the room was tres tres petite! Overall though, it was worth the £115 per night we paid but not sure if this would have been the case without the balcony and high floor room...", "Date": "August 18, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Mountain View, CA", "Title": "“Nicest hoteliers ever and improvements to come”", "Author": "arizonarutz", "ReviewID": "UR17916463", "Content": "After almost ten years without seeing Paris, I returned and stayed at the lovely Hotel Saint-Louis for five nights. This sweet place is located in the true heart of Paris on the Ile Saint Louis. Mom ( a spry 81 year old) and I opted for the new hotel airport shuttle service from Charles de Gaulle so we had the luxury of being swept from baggage claim to the hotel. Our little room, as are most average hotel rooms in Paris, was small. A plus tho, it was immaculately clean. The bathroom was also spotless. Two enormous windows, doors almost, opened up for a full view of the Ile. We had a terrrfic view of the Berthillion ice cream line. We opted for the convenience of breakfast in the cave (basement) of the hotel. Wasn't cheap but with ample coffee, croissants, bread, juice, cheese or yogurt, it was a soothing good morning to the day. The desk managers were so very kind. They were the best and a special shout out to Monsieur Bernard who offered tea, reassurances and a pillow to Mom waiting in the lobby, as I combed through the soldes at Galleries Lafayette. We met the brand new owner, a fellow former high tech exec who is now acquiring hotels. He was already working on the improvements just days after he had purchased the hotel. All in all, highly recommended. One note, one day in the lobby, an American guest checked in and immediately wanted to know how to use his TV in his room. I recommend not watching a second of TV in the room but going out to explore Paris instead.", "Date": "July 15, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Check in / front desk": "4", "Overall": "4.0", "Value": "4", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Bristol England", "Title": "“Good experience.”", "Author": "ReginaldMolehusband", "ReviewID": "UR15147149", "Content": "We spent two nights at Hotel St Louis. Getting to it from the Metro was easy - hop off at Pont Marie station and cross over the bridge onto the Ile St Louis - an island in the river Seine close to Notre Dame, it is a 5 minute walk. The hotel is in a very pretty street, lots of people not many cars and with lots of little shops, a small supermarket, bakers etc and several restaurants and bars with a wide variety of prices. The welcome was friendly and efficient. Yes the rooms we had were 'compact' and the bathrooms pretty small but they were very clean and we were comfortable. From what I can see though, looking at other hotels, the prices of the rooms are very fair if not a bargain. The first morning we had breakfast in the crypt which is very enclosed and I felt we preffered it/did better the next day when we went 50m down the street to one of the bars.A really good feature of the hotel is it's position. It felt a quiet and safe area and is central. Getting to the airport (Charles de Gaulle) on leaving is also easy - a ten minute walk to the RER station in front of the Notre Dame cathedral and a 1/2 hour direct run to the airport. All in all I would feel fairly confident in recommending this hotel to friends and I would return to it myself.", "Date": "April 19, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Columbus, Ohio", "Title": "“Loved Hotel St.-Louis!”", "Author": "from_Ohio_with_love", "ReviewID": "UR13970558", "Content": "We stayed here three nights on our first trip to Paris and absolutely loved it! Ile-de-St-Louis is a fantastic location- within view of Notre Dame and walking distance from the Latin Quarter and metro stations to take you wherever you wish. The island itself has lots of great restaurants and boutiques- we especially recommend the creperie across the street from the hotel. Do note that parking is very limited on the island and what is there is metered (and they do enforce them); if you must drive to the city leave your car elsewhere and take the metro to the island. Our room was wonderful- not huge but plenty of room for the two of us and our luggage and very clean with a fun view of the street outside. Ensuite bathroom was similarly clean and included a good-sized bathtub/shower, toilet, and sink. The staff was very friendly; we were received graciously even though our arrival was well after midnight (long day of driving). We will absolutely return on our next trip to Paris!", "Date": "March 1, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "4.0", "Value": "5", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Milwaukee, Wisconsin USA", "Title": "“A great value with a great location!”", "Author": "ParisFan242", "ReviewID": "UR12695623", "Content": "We stayed at the Hotel Saint Louis for a week. Due to planning the vacation only 2 weeks in advance, the only room they had left was on the first floor behind the check-in desk. The staff all spoke english well, and helped us with anything we didn't understand or needed advice on. They were really accomodating. The room was small - but I hear most rooms in Paris are. We only used it to store our luggage and sleep, otherwise we were busy enjoying all the city had to offer. The bed was very firm, and the pillows were good. The water pressure in the bathroom was excellent. I would recommend this hotel, in fact, we will probably stay here the next time we're in Paris!", "Date": "January 16, 2008"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Business service (e.g., internet access)": "1", "Check in / front desk": "1", "Overall": "1.0", "Value": "1", "Rooms": "1", "Location": "3"}, "AuthorLocation": "Gainesville, Florida", "Title": "“Hell hole!”", "Author": "psaarc", "ReviewID": "UR12463461", "Content": "Totally agree with Surlamer, Scituate, MA review. We booked this hotel online for 5 nights and checked out after we muttled through the first. We had reserved two rooms for my husband and myself and our 15 and 21 year old children. We travel several times a year and are very experienced travelers and really appreciate small, boutique style hotels. When we first checked in Bernard spoke with us and gave us a room on the 4th floor and one on the 5th floor. I explained to Bernard that I am claustrophobic and therefore I would rather take the stairs as opposed to the small lift. He gave me the key to the room on the 5th floor and after climbing 5 flights of stairs I put the key in and realized that clearly I was in an occupied room (it was a mess), so I walked back down 5 flights of stairs and Bernard was speaking with my husband and I told him what had happened and he actually responded \"yes, sometimes I try to be funny but I'm not! I couldn't believe anyone would give such a response. So I once again hiked up the 5 flights of stairs. My husband later told me that the people that had the room I walked in on had come in while I was upstairs and asked if they could please get their key and he told them \"he couldn't give it to them because he had just given it to somebody else!\" It was unbelieveable. There was NOTHING quaint or charming about it. The carpet, walls and bedspreads were filthy. The furniture was not \"antique\", it was old, junk! The bed broke everytime our daughter sat on it (she weighs 120 lbs). The bathrooms were the only acceptable thing because they had been renovated. In the bathroom the only amenity provided was something our kids nicknamed \"Soapoo\" because it was some multi-purpose soap/shampoo, (probably toilet cleaner also) in a pump bottle. The only reason we stayed at all was because we checked in on New Years eve and we didn't know where else to go at the last minute. When we came in at the end of the night there was some guy (not an employee) lying on a mattress with the door open in a sloppy room just off the reception area, he rolled over and mumbled something and rolled back over and finished watching t.v. We enquired about the early checkout policy and Bernardsaid he couldn't respond and that we needed to speak with his co-worker. After going out New Years Eve we came in and asked the night deskclerk the same question and he said there was no problem, you pay for the night you stay. Needless to say, the following morning we got up and prepared to leave. When I called downstairs in the morning about checking out I spoke with a different person who got quite upset about us leaving. I conveyed to him what we had been told, he was very rude, we paid for our one night and left. We didn't know where we were going but we knew we were leaving that hotel! Twenty years ago my husband and I backpacked through Europe as broke students and we wouldn't have stayed in this dump back then. This is nothing more than a \"flophouse\". In the end it worked out fine, after walking a few blocks with our bags we got a cab and checked in to the Four Seasons for the next 4 nights. Now that it's over and we only stayed one night we all look back and laugh like hell at the dump and the crazy guy. The kids will always remember the \"Soapoo!\" What we have learned is that there are several hotels with similar names so make sure you book the hotel you mean to book (confirm the address) **THIS HOTEL ADDRESS IS ...75 rue St-Louis-en--I'IIe (4th Arrondissement). I also read the review in the Frommer's Paris 2008 book and it is extremely misleading. It is in no way a \"charming family atmosphere\" and as for offering baby-sitting...you would have to be crazy. I do regret that we did not think to take photographs because the photos we have seen didn't look anything like our 2 rooms. To top it off, when we returned we got an angry e-mail from Bernard at the hotel. Needless to say, we did not respond!", "Date": "January 9, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "US", "Title": "“Wonderful”", "Author": "Amoureusedechats", "ReviewID": "UR10205671", "Content": "A wonderful little hotel on the Ile St. Louis. The location is, of course, perfect. Right in the center of Paris. You can go in any direction for day walks and have a wonderful time. There are nice restaurants, all within walking distance. Our room was a \"double twin\" which is two twin beds put together. A very nice change from the usually smaller French beds. Which was very appreciated since both my husband and I are on the \"larger\" size. The bathroom was small but adequate. The rooms were kept very clean and the staff was very pleasant. The only suggestion I would have for this hotel is to decorate the rooms a little more. It would make a great experience into a totally \"Parisian\" experience. Do not bother with the hotel breakfast. Or maybe just once to see the little cave. You can get cafe-au-lait and croissant a lot cheaper at one of the cafes just a block away. All in all, a great value.", "Date": "October 21, 2007"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Naperville, Illinois", "Title": "“Loved the hotel and location”", "Author": "pondfan1", "ReviewID": "UR10085910", "Content": "We were in Paris during September and stayed for seven days at the Hotel Saint Louis. The location is wonderful, located on a lovely small island which is a terrific oasis to come back to after sightseeing. The hotel is an old small hotel; however with certain charms. It is not fancy; however, the deluxe double was of adequate size, although the bathroom was very small. The price of 140 euros for this location is a terrific inducement. The island is charming, with many restaurants and little shops. We especially enjoyed the Cafe St. Regis at the end of our street. Bernard, the day person at the hotel, was very knowledgable and helpful for us. I would highly recommend.", "Date": "October 16, 2007"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Check in / front desk": "4", "Overall": "4.0", "Value": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Oklahoma", "Title": "“Great quiet location!”", "Author": "lezelsafi", "ReviewID": "UR7164613", "Content": "We stayed at Hotel Saint-Louis for 4 nights in March 2007 for our 10 year wedding anniversary. After reading Trip Advisor reviews, we were mixed as to stay here or not. We decided to chance it because the sheer amount of hotels that Paris has to offer is quite frankly overwhelming. We had our expectations set very low, not expecting the Athenne or George V but not a rat trap either. We arrived before 11 am on the day of our checkin after a \"red-eye\" flight from Dallas. We were warmly greeted and given the key to our room immediately! The reviews were right regarding the lift, it is small, but who cares, we took 2 trips with our luggage. We booked the top floor room, #51, and it was large for Paris standards. A double bed, 2 chairs, a desk, small closet, and an enormous bathroom with a tub that 2 people could fit in and you could still get 2 people ready at the same time in the bathroom. The room was extremely clean, the bed was very comortable (I slept the best I had in a year considering we have 3 little ones at home 5 yrs of age and under!), and it had to small step out balcones, one off the bathroom and one off the bedroom. The bedroom balcony offered a view of the Pantheon (which was gorgeous at night) and the Seine. Maid service came every day with fresh towels and tidying up the room. Oh, and the hot water (steaming) and water pressure were to die for after a long day of sightseeing! The Ile Saint Louis itself is a quaint little island with a couple of great brasseries, an amamzing crepeire and bakery (both directly across the street from the hotel!) We slept with the windows open every night because the island is so quiet at night (even after the island literally fills up on the weekend with Parisians shopping). One night there were some noisy drunkards wandering up and down the street, but we simply shut the window and could not hear a thing. We never saw another guest during our stay or heard another guest, though the walls appear to be rather thin, even though the hotel was full. Bernard at the front desk was extremly helpful with dinner reservations (Bofinger Restaurant) and even walked us around the corner of the hotel to give us a quick history lesson of the Pantheon on the hill and his favorite church, St. Etienne du Mont. He would even grab a map and draw the route we should take or Metro stop to go. EXTREMELY helpful overall was the entire staff. It is pretty bare bones, no mini bar, no room service, no Hermes bath products (only a combo soap in a squeeze bottle was offered), no amazing decor. But we paid 220 euros a night and felt we paid a fair price, as for the location (right across the bridge from Notre Dame, and the other direction across the bridge from Hotel de Ville, and several Metro Stops really close and the Les Cars Rouge bus stops right at Notre Dame, the cleanliness and it was an extremely safe area (no urine smelling dark alley entrance here!). We are already planning our next trip back and would defintely stay here again, though we did fall in love with the 6th arrondisement, St. Germain de Pres, and might give that area a stay. We cannot vouch for the size of the other rooms at the hotel or the breakfast (we always grabbed a pastry across the street and a cafe creme at Le Lutetia), but have no reservation about staying at this quaint, clean and safe hotel. Lezel and Rick Safi Edmond, OK USA", "Date": "March 15, 2007"}, {"Ratings": {"Service": "2", "Cleanliness": "2", "Check in / front desk": "2", "Overall": "1.0", "Value": "1", "Rooms": "1", "Location": "5"}, "AuthorLocation": "Scituate, MA", "Title": "“This hotel is a disaster”", "Author": "Surlamer", "ReviewID": "UR6177804", "Content": "I booked this hotel for a much anticipated mother/daughter vacation after researching Ile St. Louis online. I requested a room with TWO beds located on the top floor with a VIEW. I emailed and phoned before leaving the U.S. When we pulled up at the hotel, my daughter and I told the driver that no, this couldn't possibly be it. It looked too shabby. The lobby looked a little scruffy, but I was hoping for the best. I told the desk clerk that we had made a reservation for the room described above. He started making jokes. When we opened the door of the room, I couldn't believe it. A tiny tiny dingy room with one bed and no space to walk around on the 3rd floor with no view. We turned to leave, but the clerk told me that this was indeed a double. He pulled the bedspread back and we saw that it was two beds pushed together. He said that if we stuck our heads out the window and looked to the left, we would see the Seine. We felt sooooo conned! At that point, we had just crossed the Atlantic and were exhausted. We stuck it out. The bathroom was not properly equipped, the shower/tub was dangerous and we had no hot water for two days!!! As if this were not bad enough, we received a 6AM wake up call we had not requested. Were they trying to torment us? Never again. We finally left early, paying full price on a second airline because our tickets on Air France required a fine of close to $3000 to change, more than I paid in the first place. The Hotel St. Louis gave us a 10% discount for our inconvenience. Caveat emptor!", "Date": "November 26, 2006"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "4.0", "Value": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "", "Title": "“Lovely stay at the Hotel Saint Louis”", "Author": "paris_1204", "ReviewID": "UR6060713", "Content": "I've stayed at two other hotels (Deux Iles and Lutece) on the Ile St. Louis. I wanted to stay again on the Ile St. Louis for my October 2006 visit, but I did not wish to pay as much as the other two times. I have been shying away from booking the Hotel Saint Louis due to the mixed reviews. But since there were a few positive recent reviews I decided to take a chance and I am glad I did. First of all the hotel's lobby is small but has enough seating for two antique chairs and a white leather sofa which is dirty looking and not appropriate, in my opinion, to match the ancient building the hotel is in. My room (#42) on the fourth floor was cosy but had enough room for a desk and chair plus enough walking room around the bed area. Fortunately it was a corner room so I had the advantage of having two large French windows which led to a small balcony which is really not useable. It's much too narrow to wander onto that balcony for safety reasons. Yet it was nice to have a balcony! I cannot understand why the hotel is rated 3* as the amenities offered are limited, but with the complicated hotel star rating system I suppose that's not surprising. Here are the pros and cons of my stay: Pros: Excellent location on the Ile St. Louis Very modern and extremely clean bathroom with a nice sized bathtub with wall shower attachment Friendly, helpful staff Room has individual a/c and heating Value is excellent considering the hotel's prime location (rate for a double room for one person is about 40 euro less than the other hotels I stayed at on the island) Cons: Above mentioned white leather sofa in lobby that looks dirty now and which the night clerk sleeps on. Tatty, old, faded bedspreads which are orange colored. They should be changed (one bedspread in 3rd floor room I had a choice of getting had a noticeable hole) immediately as they look awful. Extremely small regular double rooms as the bed takes up practically the entire room. Very very tiny bathrooms. For example, in my bathroom one could literally use the toilet and wash one's hand at the same time. Wall shower attachment is not adjustable. Hotel provides no soap except bottles of liquid soap that's meant to be used for multiple uses as soap, shampoo, and bath foam. Yuck. I brought my own bar soap as I hate liquid soap to use in the shower. There are no clothes hooks in the bathroom. Optional continental breakfast costs an additional 12 euro (didn't order) and is served in a vaulted room below the ground floor.", "Date": "November 5, 2006"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Business service (e.g., internet access)": "1", "Check in / front desk": "4", "Overall": "2.0", "Value": "2", "Rooms": "1", "Location": "5"}, "AuthorLocation": "carmel", "Title": "“great location but bare bones”", "Author": "oellen", "ReviewID": "UR5775646", "Content": "The location is wonderful. The rooms are bare, tiny and well worn. For the same price, I think we could have done better.", "Date": "September 6, 2006"}, {"Ratings": {"Cleanliness": "5", "Overall": "5.0", "Value": "4", "Service": "4", "Rooms": "4"}, "AuthorLocation": "Toronto, Ontario", "Title": "“A Charming Hotel in a Superb Location”", "Author": "A TripAdvisor Member", "ReviewID": "UR5348820", "Content": "My husband and I recently returned from a four night stay at the Hotel Saint-Louis in Paris. It was terrific little hotel charmingly situated in the middle of the Seine on Ile Saint-Louis in the heart of Paris. We booked this hotel on a recommendation from a friend and were not disappointed. You can't get a better location for touring the city - it's 5 minutes from a metro station, Notre Dame (you can hear the bells chiming from your room), the Marais district on the left bank, and St. Germain des Pres and the Latin Quarter on the right bank. There is a great ice cream shop on the island (Berthillon) and numerous cafes, shops etc. (note that they are a bit pricey b/c of the location so generally we ate dinner off the island where you get better value for your money). The staff at the hotel are very friendly and helpful with dinner reservations, directions etc. and were all very fluent in English (if your French is not). The rooms are small and compact but are very clean and charming and have everything you need. The bathrooms are also small but again are very cheerful (and seem to have been recently renovated), spotless and efficent. We did not find the street noise to be an issue and our room was facing the street. It's busy during the day and into the early evening but the bustle seemed to slow down by 9-10pm. I recommend having a drink at one of the cafes on the island overlooking the Seine/Notre Dame in the evening - a perfect place to appreciate the beauty of Paris and the lovely sunset. We also felt the hotel was well priced and good value for the money.", "Date": "June 14, 2006"}, {"Ratings": {"Cleanliness": "5", "Overall": "4.0", "Value": "5", "Service": "4", "Rooms": "4"}, "AuthorLocation": "", "Title": "“Located in the middle of tranquility”", "Author": "cpdh", "ReviewID": "UR4471870", "Content": "We spent a long weekend in Paris this winter and chose the Hotel Saint-Louis based on its location mostly. We were not disappointed. Ile-St-Louis is such a calm center amid the bustle of Paris. There was something immediately relaxing about walking across the bridges from either bank. A village within the city, we delighted in the small shops, a handful of cafes and restaurants, and the proximity of the Berthillon ice cream! Research on this site had told us beforehand that Paris hotel rooms can be small, that these are sometimes cramped places with character instead of size and amenities. Consequently, we were happily surprised to find that our room on the top floor was kind of spacious. It seemed a simple room due to its decor - the fine floral prints and the exposed old beams - but it opened out onto a view of the rooftops with the Centre Pompidou just visible. The bathroom, I should add, was also nicely sized, and the shower had good water pressure. An especially pleasant thing was our arrival at about 9:00 on a gloomy morning following an overnight transatlantic flight. Our room was ready, and our bags brought up for us. We were able to unpack and rest for the remainder of the morning before setting out into Le Marais. That neighbourhood was just there, across the bridge. Getting around Paris by foot and Metro proved to be quite easy from our location. I hadn't intended my first trip to Paris to be in the winter, but it was wonderful just the same, and our enjoyment of the hotel was certainly a part of that.", "Date": "February 19, 2006"}, {"Ratings": {"Cleanliness": "5", "Overall": "5.0", "Value": "4", "Service": "4", "Rooms": "5"}, "AuthorLocation": "Tulsa, Oklahoma", "Title": "“Je t'adore Paris!”", "Author": "cadybugtours", "ReviewID": "UR4044405", "Content": "Wow! After some dismal hotels in Italy, this hotel was a breath of fresh air. The staff was courteous and friendly (as friendly as Parisians can be), especially the support staff. The breakfast was fabulous and the location was optimal. The rooms were amazing and if we opened the window we could hear the bells on Notre Dame. The best crepes in the world are at a restaurant at the North side of Notre Dame and the hotel is just a few steps from it. Also close are fabulous restaurants and a grocery store where you can buy bottled water at a reasonable price. Paris is a second home to me and the Hotel Saint-Louis makes it even homier. I highly recommend this hotel for couples, business and leisure...not a very good hotel for kids but it is possible.", "Date": "October 22, 2005"}, {"Ratings": {"Cleanliness": "5", "Overall": "5.0", "Value": "4", "Service": "5", "Rooms": "4"}, "AuthorLocation": "Boston, MA", "Title": "“Lovely hotel in a lovely spot!”", "Author": "joyciemc", "ReviewID": "UR4018146", "Content": "The staff was extremely friendly and accomodating. I sent a few questions via email before our arrival, and they were always very helpful and quick to respond. Our room was small, but very clean with a nice, bright bathroom. Our window looked out on the street, and it was nice to hear the sounds of people enjoying themselves down below. It's an attractive hotel in a fantastic location.. I very much recommend it!", "Date": "October 12, 2005"}], "HotelInfo": {"Name": "Hotel Saint-Louis en l'Isle", "HotelURL": "/ShowUserReviews-g187147-d219996-Reviews-Hotel_Saint_Louis_en_l_Isle-Paris_Ile_de_France.html", "Price": "$225 - $319*", "Address": "<address class=\"addressReset\"> <span rel=\"v:address\"> <span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">75 rue Saint-Louis en l'Ile</span>, <span class=\"locality\"><span property=\"v:postal-code\">75004</span> <span property=\"v:locality\">Paris</span></span>, <span class=\"country-name\" property=\"v:country-name\">France</span> </span> </span> </address>", "HotelID": "2514925", "ImgURL": "http://media-cdn.tripadvisor.com/media/photo-s/01/f3/c5/97/chambre-room.jpg"}}