{"Reviews": [{"Ratings": {"Cleanliness": "2", "Overall": "2.0", "Value": "1", "Service": "1", "Rooms": "2"}, "AuthorLocation": "Virginia", "Title": "“Questionable, not terrible, but not great either”", "Author": "A TripAdvisor Member", "ReviewID": "UR5380507", "Content": "Check in was terrible. The front \"deskman\" was unprofessional and some other random person (who acted like he owned the hotel) was rude and quick tempered. We had to wait an hour for us to get our keys. Also, when I complained about the late check in, the random guy quickly replied, \"FINE, you want another hour to check out?\" and that was that. How rude and ghetto, nothing seemed \"official\" I didn't sign anything... The room was okay. Small, but good (it was just the 2 of us). Everything worked and was clean (I guess). Some problems getting towels... what's up with this hotel and their towel issues? Eventually, I just \"stole\" some from the dryers from the maids room/ janitors closet? Another weird thing was that the hotel was a hotel/apartment. We encountered tenants on the ride up (elevator). And the pictures online didn't really justify the room... it was better than the room. Overall, it would be okay if we got the same room. But reading the other reviews, I'm nervous. Oh, and it's a GREAT location.", "Date": "June 25, 2006"}, {"Ratings": {"Cleanliness": "2", "Overall": "1.0", "Value": "2", "Service": "1", "Rooms": "2"}, "AuthorLocation": "clearwater, fl", "Title": "“absolutely no service”", "Author": "A TripAdvisor Member", "ReviewID": "UR3994782", "Content": "I would not recommend this hotel to anyone. Service was unavailable. The attitude when a question was asked was inappropriate. There were not enough towels, soap, toilet paper or sheets. The pullout couch was so lumpy you could not sleep on it. The alarm clock and microwave did not work properly. There was no dishsoap, sink in bathroom leaked. We never received a receipt to show what we paid and when we left the office was locked and there was no place to leave a key. The phone number on the website is incorrect and when the office was told they were unable to locate the website to check this out. The phone in the room kept getting calls for people other than us and they continued to leave messages. If we had been able to get a refund we would have checked into another hotel where there were services.", "Date": "October 5, 2005"}, {"Ratings": {"Cleanliness": "2", "Overall": "1.0", "Value": "3", "Service": "1", "Rooms": "4"}, "AuthorLocation": "Washington, DC", "Title": "“Lousy customer service”", "Author": "A TripAdvisor Member", "ReviewID": "UR3901023", "Content": "While this is a lovely location, beware of the nonexistent customer service. God forbid you ask for an extra towel or a clean sheet for your room--the front desk people will look as if they've never heard such a crazy request. Our room wasn't ready when we arrived at 3 pm & we had to wait 1/2 an hour for it. Our kitchenette had roaches as well. To top it off, the blinds in the room weren't anchored & fell on my head! Needless to say, there was no sympathy for my bloodied head from the front desk or the national \"customer care\" number. Only the hardiest travelers should attempt this location . . .", "Date": "September 14, 2005"}, {"Ratings": {"Cleanliness": "4", "Overall": "4.0", "Value": "4", "Service": "3", "Rooms": "4"}, "AuthorLocation": "Toronto, Ontario", "Title": "“Also apprehensive but we had a good experience.”", "Author": "A TripAdvisor Member", "ReviewID": "UR3810723", "Content": "reading mixed reviews about this apartment/hotel, we were concerned about potential problems. When we arrived and saw the room, all was well. A large studio, modern decorations. Comfortable bed and pull out couch with comfortable and clean sheets and pillows. Basic but clean washroom and decent kitchen, also very clean with modern appliances. The studio room was very large and it easily accommodated us (3 good friends who were interested in shopping, gallery going etc. I think that it would be perfect for a family of four (but no larger). We may have lucked out and been assigned one of the better rooms (it was on the top floor of the apartment building). The check-in on the 2nd floor of the Herald Towers apartment building is a bit dodgy, but with the savings, if you're a relatively self sufficient person, that should not concern. The Herald Towers apartment building itself is quite decent and you feel like you're staying in a relatively upscale NYC apartment building (there is security at the entrance). All in all, a good experience. I would stay here in future but would still have reservations about getting a substandard room on another floor, (from reading the reviews).", "Date": "August 27, 2005"}, {"Ratings": {"Cleanliness": "4", "Overall": "4.0", "Rooms": "4", "Value": "3"}, "AuthorLocation": "Belfast, N.I.", "Title": "“Great Stay at Yourstay apartments Broadway”", "Author": "cmoo", "ReviewID": "UR3708218", "Content": "Had some reservations about staying here from other reviews, however all such reservations evaporated the minute we entered the apartment. (19th floor) All clean and very acceptable, kitchenette with fridge, cooker and microwave, fully equipped. Lounge area great with tv/dvd. Seperate bathroom.We had two kids with us and got on just fine. Location unbeatable, would definitely stay again", "Date": "July 28, 2005"}, {"Ratings": {"Cleanliness": "3", "Overall": "4.0", "Value": "3", "Service": "3", "Rooms": "2"}, "AuthorLocation": "California", "Title": "“It was a great stay”", "Author": "A TripAdvisor Member", "ReviewID": "UR3644365", "Content": "Before i left for my trip I didnt know what to expect by reading some of the reviews on here. I was actually rather scared. When we arrived we came across the fact that the check in desk isnt on the first floor its on some other floor. The hall ways were also stuffy. But when we got to our room it was nice and cool. We rented a one bedroom with living room and kitchen. It was nice. Its not a hotel but nice. It had dishes and silverware, a tv with dvd and vhs, and a radio. The bedroom bed was a bit hard but tolerable. But on the other hand the sofa bed was really uncomfortable. We even took out the matress and put it on the floor but the matress is uncomfortable. The locations is also very great! literally steps from the metro. I enjoyed to the place. Hope you do to!", "Date": "July 6, 2005"}, {"Ratings": {"Cleanliness": "1", "Overall": "1.0", "Value": "1", "Service": "3", "Rooms": "1"}, "AuthorLocation": "NY, NY", "Title": "“Dump”", "Author": "A TripAdvisor Member", "ReviewID": "UR3605113", "Content": "We were forced to stay here during an emergency housing situation -- so we weren't tourists, and therefore thought we could put up with some of the items brought up in the lackluster reviews. BIG MISTAKE The place smelled of smoke, and everything had a slightly funky film on it. By the second night we were sleeping on top of the covers and using our own towels. You know when you were 21 and didn't care where you passed out at 4AM? This is one of those places. Except here you are out $200 and you aren't heading back to the dorm the next day. All of this would have been acceptable if the place was sold at \"flop house pricing\" -- but it isn't, and as its marketed, it's truly deceptive. We ended leaving early and dropping another $250 a night for a CLEAN room. If we were here on a trip we would be incensed, but as we were locals we shrugged it off. Unless I was planning on jamming 5 frat brothers into a room and being blurry eyed all week (which from the looks of the other guests thats who stays here) I would avoid. NOT WORTH IT. SMELLY AND UNKEMPT. One good thing -- staff guys were pretty cool, and they kept and held our reservation as requested.", "Date": "June 22, 2005"}, {"Ratings": {"Cleanliness": "5", "Overall": "5.0", "Value": "5", "Service": "3", "Rooms": "5"}, "AuthorLocation": "North Carolina", "Title": "“Awesome Stay”", "Author": "A TripAdvisor Member", "ReviewID": "UR3506249", "Content": "I must admit that I was a little skeptical checking in, as the check-in office was just two guys with a cell phone and a bunch of keys sitting in a room. Otherwise, this was a really great hotel. The studio apartment was HUGE (for NYC standards) with a really nice cable TV, DVD, CD player. The linens were clean as was the entire apartment. Great location with very little street noise at night.", "Date": "May 28, 2005"}, {"Ratings": {"Cleanliness": "1", "Overall": "2.0", "Value": "1", "Service": "3", "Rooms": "1"}, "AuthorLocation": "Florida", "Title": "“Bathrooms DESPERATELY Need CLEANING.....”", "Author": "A TripAdvisor Member", "ReviewID": "UR3498210", "Content": "I recently returned from a Mother/Daughter shopping weekend in NY, May 12-15th. It was my mother and younger sisters first visit to the Big Apple, so I reserved two adjoining studio apartments for a party of 6 across from Macys. Upon checking in, I was informed that adjoining rooms are not guaranteed. I wasnt happy but accepted two rooms on the 20th floor, separate wings. We quickly inspected the rooms and hit the streets. My mother, daughter and I returned to our room to rest up for another exciting day. The three of us immediately became very congested, developed a headache and found it hard to breathe. To make a long story short, the next morning we discovered the bathroom was infested with mold and mildew. The shower curtain had mildew, mold and dried soap scum, the ceiling was black from mildew, the tile and tub had mildew. I immediately contacted reservations to report the rooms condition, our illness and request another room. I was told that they were completely booked and to inform the office of the room's condition. The gentleman in the office apologized and told me no other rooms were available at that time, but to come back later. I handed him the key and let him know that we were checking out of that apartment. We moved our things to the 2nd apartment and set out to enjoy our day. The 2nd apartment's bath also showed lack of cleaning, but at least we could breathe. That evening @ 6, I checked with the office and was informed that a guest had not checked in yet, therefore another room became available on the 8th floor. That bathroom also showed signs of mildew in the tub/tile and shower curtain. He offered to personally clean it, but I declined the room and the 6 of bunked in the 2nd studio for the remaining 2 nites. The following Monday, I contacted Customer Care to follow-up on my complaint and request a credit card adjustment for 2 nights. I was instructed to send an email along with a doctors notice for our illness. Fearing this issue may take sometime to resolve, if at all, I notified my credit card company of the incident and my dispute with Your Stay. Despite the inconvenience and the filthy bathrooms, we still enjoyed our first Mother/Daughter Weekend. Depending on your level of comfort, the location makes it worth chancing.", "Date": "May 24, 2005"}, {"Ratings": {"Cleanliness": "5", "Overall": "5.0", "Value": "5", "Service": "3", "Rooms": "5"}, "AuthorLocation": "Co. Kerry, Ireland", "Title": "“Great Apartment”", "Author": "Ellie56", "ReviewID": "UR3479979", "Content": "Was a bit nervous considering some of the reviews on this site, but I can honestly say the Broadway apartments were great. Fantastic location, clean, modern and safe. Macys across the road, Empire State Building next door... couldn't ask for more. And the guys in the office were great - looked after our bags after we checked out. I'd definitely stay here again, very reasonable.", "Date": "May 17, 2005"}, {"Ratings": {"Cleanliness": "4", "Overall": "4.0", "Value": "5", "Service": "3", "Rooms": "4"}, "AuthorLocation": "uk", "Title": "“Highly recommended”", "Author": "broadway", "ReviewID": "UR3458406", "Content": "Just returned today from The Herald Towers and what an excellent choice of apartment in NYC. Brilliant location, central to everywhere, especially 5th Ave & Macy's and in walking distance to the hustle and bustle of Times Square. Apartment was very clean, spacious and affordable for such a great location. CD player, Cable TV & DVD player. No maid service in 7 nights but a very small price to pay for living next door to the Empire State Building & did not spoil our fabulous time in NY. Would definitely stay there again!!!", "Date": "May 10, 2005"}, {"Ratings": {"Cleanliness": "3", "Overall": "4.0", "Value": "3", "Service": "3", "Rooms": "4"}, "AuthorLocation": "Australia", "Title": "“Great place to stay if traving with 4 people”", "Author": "rohanlee", "ReviewID": "UR3450527", "Content": "We were traveling around the world last September and stopped off in New York for 5 night. We were 3 Adults traveling so we were after something that had a bit of room. We found this place great as it's a fantasic location next to Empire State building and across the road from Macys. At night we would walk upto Times Sqare (15 minutes) where there was something always happening. The thing to remember that this is not a hotel or serviced apartment so no one will come clean the room or offer assistance. The Queen bed and fold out sofa were comfortable with a kitchettte fantastic for having meals in the room should you want to. If was coming back again this is a place l would check out.", "Date": "May 9, 2005"}, {"Ratings": {"Cleanliness": "2", "Overall": "1.0", "Value": "2", "Service": "2", "Rooms": "2"}, "AuthorLocation": "London, UK", "Title": "“Not to be recommended”", "Author": "A TripAdvisor Member", "ReviewID": "UR3368997", "Content": "When we found the \"reception\" (no directions/signage) we were not very impressed and we did not find the staff either very professional or helpful. Got to our studio to find it in an utter state - rubbish everywhere, dirty linen etc. We immediately complained and were told that a large group of students had been allowed into the room to store their luggage! Moreover, the cleaners had gone home for the day, there no other rooms available to transfer us into and nothing could be done! A few irate phone calls later we were eventually upgraded to a one bedroom apartment - although it had not been cleaned properly... A central location but a pricey and on the whole unpleasant experience.", "Date": "April 17, 2005"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "London, United Kingdom", "Title": "“excellent location and value for money!!”", "Author": "wenitta", "ReviewID": "UR3352432", "Content": "we stayed here 22 feb for 5 nights after getting a really good deal. i did read some of the reviews on here before booking and i was a little hesitant but i thought what the hell. when we arrived i was so shocked at how close we were to macys and all the other big stores. we walked into the lobby and had to sign in to a guest book. the receptionist was very friendly and told us what floor to collect our keys from. we were too early so they kept our luggage in a store room sow e could explore the city for a couple of hours. when we came back they had our key ready for us. we walked into our apartment and i loved it straigt away. the bed was huge with white sheets and blanket making the whole place look really modern. there was a glass table in the middle and a huge double sofa bed which was very comfortable. the bathroom was small but was clean and shower was not very powerfull but it would do. the kitchen ws nice but we didnt need it as we we ate out everyday. there as a huge space for all your clothes as well. the receptionist was good with getting us telephone numbers for different places and giving directions. they also helped us to find good nightclubs and i would recommend websters which had about 6 rooms to cater for everyone. the apartments were so conveniently placed it only took 15 minutes to walk to times square sow e were happy after a hard days shopping. when i go new york again i ma definitely going to stay her and you should too.", "Date": "April 12, 2005"}, {"Ratings": {"Cleanliness": "1", "Overall": "1.0", "Value": "1", "Service": "1", "Rooms": "1"}, "AuthorLocation": "Milwaukee, WI", "Title": "“Yourstay is awful”", "Author": "LadyTraveler", "ReviewID": "UR3342836", "Content": "I do not know how this place could get so many positive reviews -- unless the owners of Yourstay are writing these. Our experience is much like I found others had posted. Apartment was not as advertised, both in terms of features and size. There was not enough bedding for the four of us. There were only two bath towels. The place needed a good cleaning. The bathroom was FILTHY. And Yourstay refused to send anyone over to clean it. The representatives of Yourstay who we spoke with were very, very rude. And refused to take the blame for any short-comings in their \"Five Star\" apartment. We left after two days and are now fighting it out with our credit card. There must be a good reason that an entire web site is dedicated to the fradulent practices of this apartment business. If you need more warnings check out, (---) I wish I had seen the site before we left on our trip.", "Date": "April 7, 2005"}, {"Ratings": {"Cleanliness": "4", "Overall": "4.0", "Value": "4", "Service": "3", "Rooms": "3"}, "AuthorLocation": "York, UK", "Title": "“Don't worry about a thing!”", "Author": "A TripAdvisor Member", "ReviewID": "UR3303477", "Content": "Having read some of the more negative reviews we were worried - but don't be. Just got back from staying in Herald Towers 5 nights with family of four. It is definitely self-catering accommodation not an hotel - so don't expect hotel services. You collect your key not from a receptionist but from a tenant of one of the other apartments who is clearly retained by the company. He was fine - friendly and helpful within his limited brief. The block also has 24 hour security (not supplied by Yourstay) - who were also friendly and helpful with local directions. Our apartment was very large and very clean and furnished comfortably in a minimal modern style. It was missing some essentials (1 fork for 4 people for example) - but all the local delis supply free cutlery with their food (we never cooked as such) - and the local Duane Reade pharmacy can supply all other kitchen and bathroom necessities very cheaply. Our apartment came with the added bonus of a small furry (a mouse) - but friends living in Manhatten laughed at this - all apartments have them apparently. The central location, right next to the subway, helped us explore the whole city - and our 2 teenagers had the holiday of a lifetime at a great price. On our last day we checked our luggage at nearby Penn Station - this cost 4 dollars per item but meant we could be sure of retrieving it exactly when we wanted to.", "Date": "March 26, 2005"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "Miami", "Title": "“Superb Value for Money”", "Author": "A TripAdvisor Member", "ReviewID": "UR3212785", "Content": "My famile of 5 stayed in YourStay Broadway Apartments from 2nd Jan to 10th January 2005. The location and apartment were second to none, excellent value for money for 5 guests. The check in process can be improved. Instructions on how to use the free wireless internet and cable TV would be helpful. The staff was friendly and accommodationg. I've since recommended YourStay to my colleagues who stayed in their property in LA, they had a great stay. I would definitely stay with YourStay again and recommend it.", "Date": "February 20, 2005"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "South West England", "Title": "“Very Apprehensive But ... All worked out Great !!”", "Author": "Shotokan", "ReviewID": "UR3164146", "Content": "Sat on my PC in England I found Yourstay Braodway appartments, I parted with my £600 for 3 nights. We arrived in New York the day before we were due to check into Herald Towers and stayed at the Crowne Plaza on times square ( that was very nice ). The Freedom or your own New York apartment was \"yourstays\" appeal. The day of check in we left our luggage at the crowne Plaza and walked down Broadway to Maceys and over the road to Herald towers. The entrance is quite nice not overley impressive but pleasant enough, we asked at the reception desk wether we were too early to check for our Yourstay appartment and was told to go up to an appartment B10. When we arrived at a apparment door on the 9th floor it was just the same as all the other apartment doors, we knocked and entered to fined an empty apartment but for a guy casually dressed in his late 20's in the kitchen area with a brief case and a lap top ( if he would of asked if we wanted to score drugs I would not have been surprised +_+ ). He was very friendly ask our name and pulled out an evnvelope form his case with our reservation printed in it and Key to an apartment , hugh sigh of relief , we completed a regestration form on the kitchen top and left with our keys ( we never saw the young man again , he is probobly floating in the river hehe ). Once we had worked out how to open the door the apartment was minimal in furniture but very \"chic\" the views across Broadway were fantastic, the were 2 bed rooms one ensuite a kitchen area a lounge area with very expensive plasma TV and Hi Fi set up and we had a great time coming and going as we pleased. If only the first part not looked so Dodgey and Seedy we would of been able to mark this an Excellent. Guys5", "Date": "February 5, 2005"}, {"Ratings": {"Overall": "1.0"}, "AuthorLocation": "London, UK", "Title": "“At your own risk!”", "Author": "A TripAdvisor Member", "ReviewID": "UR3161105", "Content": "Having made a reservation for one-month stay in yourstay's NY location last year, I was surprised when arriving in NY to be left with a message at the reception indicating that my appartment was not ready for another 3 days. The replacing hotel was nothing near the expected standard. Worse, they have overcharged me for several hundred dollars. Since this happening in summer last year, I have complained at least 10 times, and send them a letter. They have been ignoring all my complaints. If you make a search for yourstay on google, you will see that my case is not isolated.", "Date": "February 4, 2005"}, {"Ratings": {"Overall": "3.0"}, "AuthorLocation": "Great Britain", "Title": "“Good location, clean & well appointed but expensive”", "Author": "pablo_stays", "ReviewID": "UR3101000", "Content": "My sister and I stayed in the apartments between Christmas 04 and New Years 05 and found it well located (although being so close to the Empire State and Macy's made the local area very busy during the holidays), Macy's across the street, 34th St Subway 50ft from the entrance. I would recommend this location only outside of the holiday season if you dislike crowds! The information in the room provided details of the nearest supermarkets, etc. but Little Korea is a stones throw and there are good deli's very close as well as a FedEx Internet Cafe/Printers an avenue uptown. The studio apartment itself was clean, somewhat cramped (but this is NYC), sufficiently well equipped for our needs. The kitchenette had a large Fridge/Freezer, small oven, grill and hob, crockery, tablewear and glasswear sufficient for the two of us. The main room of the apartment had one large double bed, a bedside table with phone (free for local calls-use a calling card for long distance/international) and alarm clock, a sofa bed, sideboard (with TV, DVD Player and Radio/CD player on top) and a glass table and chairs for two people. The bathroom was clean and in good condition with a 3/4 length bath with shower over the bath. There was also a built in wardrobe in the hallway and a small box room (we filled this with shopping!). As the room looked across to one of the other wings of the building it was a little dark and on overcast days we did notice this. Also with the sofa bed out it was impossible to use the small table and chairs-a minor point really. The price was expensive, but it was the holidays and we were less concerned with the costs than getting somewhere to stay and preferred not to be in a hotel. The reception staff in the apartment building were friendly, helpful and informative (found us town car details for the trip out to Newark, pointed us at the nearest deli when we arrived at 2am, etc.). I'd recommend this to people who want to stay away from a hotel, have the location for shopping, etc. and are less concerned about the costs. Also if you plan to use the double bed and sofa bed it will make the room quite cramped. There were only sheets and a blanket for the sofa bed (rather than the duvet I had) and my sister did find it a little cold at night.", "Date": "January 31, 2005"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Washington, DC", "Title": "“Enjoyed the Experience”", "Author": "A TripAdvisor Member", "ReviewID": "UR3014434", "Content": "On New Year's Day, my 3 children and I were guest at this establilshment. We arrived in the morning and were allowed to leave our luggage at the 3rd floor office until the 3 PM check-in time. This allowed us to shop around and look and the holiday window decorations that are done each year. We got our key and went to our room at check-in time and were amazed at how clean and spacious the 1 BR apartment was. We decided to go grocery shopping for dinner and rent movies rather than go out and brave the cold temperature of the evening at a restaurant. It was perfect for us. We look forward to staying there again in the future. There wasn't a great view of the city from our apartment, but we weren't looking for a view late at night. When we checked out, again we were allowed to keep our luggage in the office until later in the day before catching our train for Washington, DC. All in all, we thoroughly enjoyed the experience. The staff was very accommodating to our needs. Thanks to hotels for the listing.", "Date": "January 18, 2005"}, {"Ratings": {"Overall": "1.0"}, "AuthorLocation": "New York", "Title": "“terrible, terrible place”", "Author": "A TripAdvisor Member", "ReviewID": "UR2976688", "Content": "We chose this place as a last minute stay for my mother (!!) we live near by. It allseems fine when you walk into the lobby of the building until you are sent up to the 3rd floor. One of the rooms, propped open by you and the 30 others who were waiting in line to get keys at the 3pm check in. Seated behind a Cheap office desk sat a guy with a pile of keys and for every person they had to scan down the 5 pages of names, trying to find the name then sift through the pile of keys to find which one belonged to you. (ONE KEY PER FLAT< NO EXTRA KEYS) the man ahead of me was told you had to ask for extra keys at the time of booking, which was not true adn the argued quiet a long time about it. The room was hot, and piled with luggage and loads of angry people. The two guys helping him sift through the keys, had \"hood\" street clothes on and spoke to you with no finesse. After they did not find my mothers name on the list of reservations after I had waited an hour.... I asked for the manager name, he wrote down a first name on a scrap of paper, with a cell phone number. I asked for the last name, and their names, and he said, Well, I am not giving it to you. There was no telephone for these guys to find any info out. they all had cell phones, and a fax machine sat on the desk. that's it. Awful, sketchy, place. they would have a gold mine with that location. but instead it's a real dump. Thank goodness they lost or reservation!", "Date": "January 4, 2005"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "New York City", "Title": "“GREAT!”", "Author": "A TripAdvisor Member", "ReviewID": "UR2972863", "Content": "after reading all these bad reviews, i was really scared of how the place might be. but overall, it was actually pretty awesome. first we got there around 3:05, so i thought we would be able to check in right away, but the people there said that our room was getting cleaned so we had to wait a while. after about 10 or 15 minutes of waiting, we finally got the keys to go up to our room. my room was the director's 1-2 people studio room. when we got up there, the cleaning person, who is actually really very nice, was just finishing up. the moment i stepped inside the room, my first reaction was \"WOW\". there was a bathroom to the side, a bed, a tv with dvd player, stereo with greaT sound quality, a cable connection, and a kitchen. i think the kitchen was one of the greatest parts that made yourstay better than a regular hotel room. it came with a fridge, stove, dishwasher, sink, toaster, coffee maker, microwave, just about everything there is to a kitchen, even plates, cups, wine glasses, eating utensils, cooking utensils, napkins, dishwasher detergent, cooking pots and pans, can opener, everything!! it wasn't cold or anything like a previous review said. and the towels were just fine. some things i didn't like was that the yourstay \"office\" people (since their office is in one of the apartments) were slow. they took a long time to give us our keys. also, another major complaint actually, was that our tv did not really have cable. we weren't sure because we had the tv guide for cable and sometimes the cable channels worked but they came out in either negative color, or just fuzzy waves. the sound came out and everything, but it was just the screen on a lot of the channels. we didn't watch too much tv anyways. we had brought dvds so we just watched those and besides, there's sO much to do around there. herald sq has macy's, herald center, manhattan mall, victoria's secret right across the street, and the subway station is right outside the apt so it was just an awesome place to stay. i think yourstay is really awesome if you are planning to stay for more than two nights, or if you're going to stay in your room and cook a lot. it's a bit expensive if it's only for one night. i stayed for two nights and we ate in our room a lot so it was worth it.", "Date": "January 3, 2005"}, {"Ratings": {"Overall": "1.0"}, "AuthorLocation": "DC", "Title": "“Horrible!”", "Author": "vj627", "ReviewID": "UR2971664", "Content": "This was not what we expected. We expected a lot more from a three star rated apart/hotel. No blankets (and everytime I asked for some, I was told everyone had left for the day), no decor, old furniture, cockroaches in the bathroom, non-functioning phone and just plain ugly. Only pluses: the location is good and the lobby is beautiful.", "Date": "January 3, 2005"}], "HotelInfo": {"Name": "YourStay MidTown Apartments", "HotelURL": "/ShowUserReviews-g60763-d320562-Reviews-YourStay_MidTown_Apartments-New_York_City_New_York.html", "Price": "$100 - $330*", "Address": "<address class=\"addressReset\"> <span rel=\"v:address\"> <span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">50 West 34th Street</span>, <span class=\"locality\"><span property=\"v:locality\">New York City</span>, <span property=\"v:region\">NY</span> <span property=\"v:postal-code\">10001</span></span> </span> </span> </address>", "HotelID": "2514210", "ImgURL": "http://media-cdn.tripadvisor.com/media/ProviderThumbnails/dirs/0a/13/0a13c683feb95f2694db85ed1a7d28811large.jpg"}}