{"Reviews": [{"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "1"}, "AuthorLocation": "southport", "Title": "“IF YOU HATE YOURSELF STAY HERE!”", "Author": "grantleySouthport", "ReviewID": "UR121746261", "Content": "Who-ever you are, whyever you are going to London, where-ever you are coming from. DON'T STAY AT THIS PLACE. It is truly awful! Torture yourself in some other more humane way if you must, perhaps by skinning youreself alive and pouring boiling fat over yourself.", "Date": "December 14, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "3"}, "AuthorLocation": "London, United Kingdom", "Title": "“Wouldn't even give it 1, DISGUSTING AND UNSAFE!!”", "Author": "sam_and_nina", "ReviewID": "UR119868032", "Content": "This is the worst hotel I've ever stayed in. Last year 2 friends and I decided to have a weekend get together in London and I'd been meaning to review this ever since. When my friend got their the guy on reception actually made a pass at her and grabbed her hand when he gave her the room key. She was on edge until we arrived and told us how sleezy he was coming on to her. The room - a triple was tiny - one double bed with no room on either side of it against the back wall and a single. We had to climb over the single to get to the double. The rooms stunk and the hotel had a strong smell of animal fat/ lard. We had a shared bathroom, two floors down. The bathroom was occupied almost everytime we went to use it and one of us got up in the night to use the bathroom to find some very dodgey looking guys hanging around on the stair case outside the bathroom door. The generally decor was run down, shoddy and frankly gross. I've honestly stayed in better hotels in the 3rd world. We couldn't get away quick enough. I wouldn't stay another night even if I was paid to! there are other hotels in the same price bracket in central London, that are ensuite, clean and safe. Honestly it wouldn't surprise me if someone had complained about being jumped on or attacked during the night using the bathroom. REALLY BAD!!", "Date": "October 29, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "2", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "4"}, "AuthorLocation": "Denmark", "Title": "“Decent breakfast, horrible rooms”", "Author": "milledyn", "ReviewID": "UR119624718", "Content": "much to our regret we had booked without first consulting tripadvisor. so, we arrived very nervous, especially nervous that there would be bed bugs. Thank God, no bed bugs. at least not in our room which was on the ground floor. We could however only sleep with ear plugs because the noise from the traffic and the sink was very loud. they have free wifi, but we both experienced that our email accounts have been hacked during our stay. It was the smallest ever double bed. breakfast was okay. room very small. bathroom on ground floor was always terribly cold, floors of bathrooms were extremely slippery when wet, because you are only given ONE towel per person, so no bathmath or such like to soak up the water from the floor. the only thing the hotel has going for it is its excellent location, but we would under no circumstances recommend anyone to stay at this hotel. stanfard worse than hostel", "Date": "October 23, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "5"}, "AuthorLocation": "Santa Barbara, California", "Title": "“Stayed only because everything else was full!”", "Author": "SantaBarbarian_11", "ReviewID": "UR119256949", "Content": "We had booked an apt. but my 81 year old couldn't get up the stairs, so we found this down the block. They quoted us 120 pounds, but said if we stayed longer, it would go down to 110 pounds. After paying for 2 nights they then told me it was 125 for 3 nights and 135 for the last two nights! What! And it was so gross! But we didn't have a choice as London was all full. There are some nicer B & B's on Gower up the street...I did like the location for the buses. Hope this helps.", "Date": "October 13, 2011"}, {"Ratings": {"Location": "2", "Overall": "1.0", "Value": "1", "Service": "1", "Rooms": "1"}, "AuthorLocation": "Colombo, Sri Lanka", "Title": "“Just Don't!!”", "Author": "Nishantha J", "ReviewID": "UR118323837", "Content": "I feel the same way as everyone feels. Its horrible. Don't stay. I spent 3 days. If i wasn't there for business I would have definitely move out to another place.", "Date": "September 19, 2011"}, {"Ratings": {"Location": "3", "Overall": "1.0", "Value": "1", "Service": "1", "Rooms": "1"}, "AuthorLocation": "Prudhoe", "Title": "“Shockingly Awful!”", "Author": "GinnyMinnie", "ReviewID": "UR118101072", "Content": "The rooms are dirty, dark and cramped. No shower, no toilet just a small sink next to the bed. The rooms are very very over priced. £65 for a twin room with no bathroom, if we had to stay more than one night I would not have stayed. The staff are un helpful and dont speak very good english.Dont stay her, I wish i had read the reviews before I had!", "Date": "September 14, 2011"}, {"Ratings": {"Cleanliness": "1", "Sleep Quality": "1", "Overall": "1.0", "Value": "1", "Service": "1"}, "AuthorLocation": "Frankfurt, Germany", "Title": "“STAY AWAY”", "Author": "J W", "ReviewID": "UR117628013", "Content": "This is the filthiest hotel I have ever had the misfortune of staying at. It is a terrible place, encrusted in dirt everywhere. The bathrooms are far from hygeinic, and not fit for purpose. The rooms are tiny, the bedding old. I had paint stains on the duvet. I asked for an ironing board and was told to iron on the bed... The duty receptionist is not bothered about anything as long as you pay... Stay away from the dump at all cost!", "Date": "September 3, 2011"}, {"Ratings": {"Cleanliness": "1", "Sleep Quality": "1", "Overall": "1.0", "Value": "1", "Service": "1"}, "AuthorLocation": "Liverpool, United Kingdom", "Title": "“Would not let a dog stay at this hotel !!!”", "Author": "lee H", "ReviewID": "UR117134187", "Content": "On arrival we were asked to wait in the 'living room' (which to be fair was an appropriate name for a room infested with insects), while our bed room was being 'cleaned'. We had booked to stay at the Langland for 4 nights, however after 5 minutes sat in the 'living room' (next to a ladies sanitary bin) we were already looking on our iphone for alternative accommodation. I informed the receptionist that we were not prepared to spend four nights as the level of cleanliness was far from hygienic, however we were pessimistic that we would find alternative accommodation at such short notice, we were assured that we would 'love' the room therefore agreed to pay for one night @ £135 (please bear in mind that we had not seen the room at this point). The room was disgusting, unhygienic and inhabitable!! The beds where covered in hair (i assume human hair, however the room smelt like wet dogs therefore i could not be certain), the once red carpet was soiled with suspicious white stains, which were also found on the bedding. For £135 per night one would expect at least a toilet in the room, however what we got was a filthy sink basin positioned millimetres from the head board of one of the rock hard beds. The furniture in the room appeared to have been bought from a car boot sale over 50 years ago, with wear and tear to reflect that. After 10 minutes of itching and coughing (i am asthmatic and the inch deep dust set about a large coughing bout), we made a unanimous decision that we couldn’t spend another second in the room. Due the cleanness of the hotel and condition of the room we demanded a refund. After a good 20minute heated debate with the stubborn receptionist, we were still no closer to seeing our £135. At one stage i asked the employee if he would stay in the room with his family, to which he replied \" NO \". He refused to get anybody senior to the hotel for me to speak to and was adamant that we would not get our money back. Please take this advice and avoid this hotel like the Plague!!!!!!!!!", "Date": "August 23, 2011"}, {"Ratings": {"Cleanliness": "1", "Sleep Quality": "1", "Overall": "1.0", "Value": "1", "Service": "1"}, "AuthorLocation": "Cincinnati, Ohio", "Title": "“Caveat Bed Bugs”", "Author": "none054", "ReviewID": "UR115619416", "Content": "As detailed in earlier reviews, the bed bugs in Langland Hotel are everywhere. Obviously, nothing has been done to change the situation by management since we have were in London early last week and bed bug warnings have been posted on tripadvisor for quite a while (obviously our fault for not doing our homework beforehand on sites such as this to avoid this dump). We had to flee this fleabag hotel after one night and ended up taking an incredibly expensive hotel at Hyde Park. AVOID THIS HOTEL AT ALL COST!", "Date": "July 21, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Location": "1", "Rooms": "1"}, "AuthorLocation": "", "Title": "“Do not stay here”", "Author": "IGLogan", "ReviewID": "UR112562152", "Content": "It is appalling. Awful. A joke. A rip off. Unsafe. Noisy. Expensive. Third world.Get the picture?", "Date": "June 10, 2011"}, {"Ratings": {"Service": "2", "Cleanliness": "1", "Overall": "2.0", "Value": "2", "Sleep Quality": "1", "Rooms": "1", "Location": "5"}, "AuthorLocation": "lancs", "Title": "“Spoilt Weekend”", "Author": "tripoutlancs", "ReviewID": "UR108628413", "Content": "Handy for Euston Station & Theatre Land that was the only good point. Hotel said they couldn't find our booking which was done through ' bookings.com' , so we ended up in the basement it was grotty, filthy net curtains, dirty windows, grafiti on the inside of wardrobe doors,water stains down the wall, stains on the edge of mattress,and the duvet I wouldn't have given to my dog. The noise from the road outside kept us awake most of the night. There was only a toilet on our floor, the nearest shower was up 2 flights of stairs. I am not a fussy person but I've never had such a bad hotel. .", "Date": "May 17, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "4"}, "AuthorLocation": "Bath, United Kingdom", "Title": "“STAY AWAY FROM BUG BITES !!!”", "Author": "dine_paradizz", "ReviewID": "UR103011590", "Content": "I've slept two nights in this hostel last week-end. Althought the location was pretty good, I've noticed that the sheets were very dirty. The day I came back from London, I started strachting my skin. The day after I had spots everywhere on my body ! I only decided to go to the doctor after five days, because the spots were becoming massive. And now I am under antibiotics during one week because I did a massive allergy due to BUG BITES ! So for your own safety, I advise you to NEVER GO TO LANGLAND HOSTEL. Because bug bites is soooo annoying !", "Date": "April 6, 2011"}, {"Ratings": {"Service": "2", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "5"}, "AuthorLocation": "Aarhus, Denmark", "Title": "“NEVER STAY AT LANGLAND”", "Author": "kristoffervest", "ReviewID": "UR101612847", "Content": "Never stay at Langland. Sure its cheap, but thats for a reason. The rooms are small, dirty and shabby. The toilets and showers are the same. The breakfast is crap. We arrived very late a thursday evening and could not change hotel. Our room was so small that we could not walk around 2 people. Everything was dirty and filty. Old towels was laying inside the wardrobe and on the floor. They had for sure not change the beedsheets since the last guest and there was dust and Spider web everywhere. The walls are papir thin, the same goes for the doors and windows. We did not sleep at all. We tried getting our money back so we could change hotel, but that was not possible. The staff are actually quite nice and helpfull but its obvious that their hands are tied. NEVER STAY AT LANGLAND. Filty and shabby crap hotel.", "Date": "March 26, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "5"}, "AuthorLocation": "shrewsbury", "Title": "“DO NOT EVER, EVER STAY HERE”", "Author": "vick3uk", "ReviewID": "UR97789016", "Content": "Seriously, there is no reason to ever stay here under any circumstance. Just don't do it. It's the worst hotel i have ever seen in my entire life and we walked out immediately. I only wish i had checked reviews before we booked. You have been warned!!", "Date": "February 24, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "3"}, "AuthorLocation": "Auckland, New Zealand", "Title": "“Bed Bugs!!!!”", "Author": "Melons1234", "ReviewID": "UR95755024", "Content": "At first the impression that was given 'How would you like to pay?', he may as well asked 'How would you like to pay for each disgusting bite the bugs in your bed will give you'.. It was sick! I thought it was all in my head. after reading these reviews and the bites starting to heal after I returned home I realised it was this disgusting hotel! Run by money hungry indians that bring shame to all hotel businesses!! I got home and the first thing i did was wash all the clothes i had with me and hot tuble dry and ironed them! i showered immediately and flat ironed my hair! Shame on you langland!", "Date": "February 7, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "1"}, "AuthorLocation": "Manchester, United Kingdom", "Title": "“WOKE UP WITH A RAT IN MY ROOM...NEVER GO TO LANGLAND HOTEL!!!”", "Author": "AJN15", "ReviewID": "UR93408292", "Content": "I had last minute work in London and had to travel down from Manchester the night before, the Langland Hotel seem a adverage, basic but a clean place to spend my 2 nights in Convent Garden. When i arrived i wasnt welcomed at all, the first thing that got said to me was 'how would you like to pay, cash or card'?when i paid the man just gave me a key and said my room number then watched me struggle two lots of stairs with a suitcase and a bag!! My room was DISGUSTING, FILTHY, SMELLY and the door didnt even have a safty lock!!As a 22 year old woman i was terrified, on my first night i was constantly woken by drunk men in and out of there rooms then a argument broke out next door to my room, i must of had 3 hours sleep that night and that was only because i manage to wedge the bed behind my door to make me feel more safe!! On my second night i was finally nodding off after trying to ignore all the noise wen i heard a rattling in my bag, when i turned on the light a rat ran out of it and under my bed, i was nearly sick...i then seen little bugs in the carpet!!I ran downstair to geth the receptionist to chane my room and he said 'Have you never seen a rat before'!! He then got me another room and once i was in it he started stroking my back and asking me if i was married!!IT WAS HORRIBLE!!!!I I ended up leaving the rotton place a 6.30am because i was so scared to even go to sleep at the thought of more rats, bugs or creepy men coming into my room!! Now im really ill in bed and i have no doubt tht i have caught something for the filthy germ ridden place!!! WOULDN'T WISH IT ON ANYONE!!!!", "Date": "January 17, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "3"}, "AuthorLocation": "London, United Kingdom", "Title": "“Bed Bugs! Stay away!”", "Author": "melmel17", "ReviewID": "UR85325070", "Content": "This place has bed bugs. Woke up with terrible bites and actually found two bedbugs on my pillow. Absolutely disgusting.", "Date": "October 30, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "2"}, "AuthorLocation": "Westminster, Vermont", "Title": "“bedbugs and peepholes”", "Author": "gu3", "ReviewID": "UR83963039", "Content": "If you want bedbugs and couldn't find them any where else this is the place for you. 2 people in our small group had to go to the emergency room and we all had to throw away our luggage even after we sprayed it with pesticide. Also look out!! There are peepholes in some of the rooms. p.s. bedbug infestations have a smell", "Date": "October 18, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "2"}, "AuthorLocation": "Cardiff, United Kingdom", "Title": "“BED BUGS”", "Author": "jmaria61", "ReviewID": "UR83832371", "Content": "Booked a last minute trip to London for my husbands birthday, hotel looked nice on the internet, but when we arrived we were asked to pay for the room straight away. When we saw the room, the floor was on a slant, picture and dado rail were dusty, no plug in the sink, we did think of leaving there and them but thought It's only for one night, when we came back to sleep after our evening out, I woke in the early hours to find bed bugs in the bed, I was horrified and spent the rest of the night in the chair, as soon as it was light outside we packed are things and left, not even staying for the breakfast, had to get out of that place. Only wish that we read the reviews on this hotel before we went, this is the worst place we have ever stayed", "Date": "October 17, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1"}, "AuthorLocation": "dundee", "Title": "“Worst hotel i have ever stayed in.”", "Author": "lesleyDundee", "ReviewID": "UR77329301", "Content": "My sister and i and both our daughters aged 10 and 11 stayed at this hotel for 2 nights. When we arrived at the hotel we were greeted by a man from an office down a couple of stairs. He didnt come to meet us and he immediately asked for payment for the room. He put us in room #1, which we assumed was near at hand but was actually the top of the building. He gave us a room key and told us to climb the stairs to the room. There were no porters and no assistance with the luggage. Between each landing was either a toilet or a shower room, all shared by the guests. Our toilet consisted of a cupboard sized room which you had to step up into, and which was filthy with no toilet paper. We reported this twice to the office and were told twice it would be sorted, only it wasnt. Our bedroom was a small room with a built in sink, a tv, two single beds, a double bed, a chair, a standing fan and a wardrobe. You couldnt open the door for the chair, and the kettle which they had in the room could only be plugged in if you sat it on the floor! An accident waiting to happen. The room was cramped and the carpet and furnishings filthy. Breakfast was included in the price of our room but we only attempted to eat it on the first morning. We had several hairs in all of our breakfasts and despite reporting this to the waitress nothing was said. We didnt eat there the next morning. The kids couldnt wait to leave this hotel, unfortunately this was their first time in London and not a very good start for them. We wont be going back there any time soon. The staff were unhelpful and the hotel disgusting and filthy. Dont go there!!!!", "Date": "August 29, 2010"}, {"Ratings": {"Overall": "1.0"}, "AuthorLocation": "NYC", "Title": "“Bed Bugs and Rude Service”", "Author": "jpl143Nyc", "ReviewID": "UR74894466", "Content": "I stayed at the Langland Hotel at 29-31 Gower Street in London with a group of 10 people from July 22nd- July 25th. Six members of our group were nearly eaten alive by bed-bugs during our stay. And we were lucky enough to bring them along with us on our continued travel across the UK. It is so bad that two of the girls on the trip had to spend the night in the emergency room last night and the staff said it was the worst infestation they had ever seen. I contacted the Langland to inform them of this (and also be aware that their demeanor toward us throughout our entire stay was nothing but rude and apathetic-- including charging us for double rooms when they only gave us single rooms for the first couple nights, putting us in rooms with dirty sheets and towels and unmade beds from the last customers, and making us carry the roll-away bed they promised to put in the room up 4 flights of stairs on our own). They told me that \"it was not their problem\", that they weren't \"going to do anything about it\", and that it was \"our fault for notifying them after we left\". We weren't aware at the time what was happening, but three of the girls broke out in red bites after the first night there-- it initially seemed like an allergic reaction, but after research and consulting with doctors in the emergency room we realized what was happening and even found one of the bed bugs inside a piece of luggage that we had taken to the Langland. The clerk at the Langland refused to talk to me about it, telling me to call back \"another day\" and when I began to tell him how upsetting and inappropriate his response was he hung up the phone on me and refused to answer the phone when I called back.", "Date": "August 12, 2010"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Overall": "2.0", "Value": "3", "Sleep Quality": "2", "Rooms": "2", "Location": "3"}, "AuthorLocation": "norfolk", "Title": "“Tried it once-not again though!”", "Author": "thealicat", "ReviewID": "UR73279275", "Content": "Checked in after eventually finding the hotel, no desk just a couple of steps to the reception office which felt like intrusion, money was taken and we were told which room we had, afteer climbing numerous stairs we found it and were disappointed with the size and effort gone into it, tv didnt work and we reported it and they said it would be fixed/replaced for when we came back which it wasnty, no ensuite other than a sink for a wash/shave, the shared bathrooms were, small dated and just felt like a shower room in a prison or something.plug sockets right near door rather than the kettle on the desk, room was boiling hot even with window wide open, we went out before tea time and didnt get back till gone half nine to settle, bed was very creaky and constant noise traffic but that is london and something to be dealt with, paid for the room on the 30th and still waiting for it to come out on the 1st despite it being through debit card, breakfast was disappointing, the room was tiny and nowhere near enough space for all guests, one girl serving assuming everyone wanted full english, sausages were tiny and lukewarm, toast was floppy and harly toasted and tea was as pale as a ghost and tasteless, we skipped this after 10 mins as it was so hot in there. all in all it was one night so it was a bed and a roof but there wont be any return journey for us.", "Date": "August 1, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "1"}, "AuthorLocation": "DK_ V._Skerninge", "Title": "“Dont pay any money before stay - if you choose this hotel”", "Author": "Boilerehauge", "ReviewID": "UR72836277", "Content": "We booked at 25. January. Friends told us later dont do it. We canselled many times in May. Hotel Langland never send a mail back. But I have a lots af documents. I payed in Januar deposit on internetbooking. This is gone away - ok. But Hotel Langland have gone rubberi. They have 6. July stolen 123 GBP from my account - they used my visacard again!!! I have canselled 1,5 month early! I have now contact to interbooking, police in London and my bank in Denmark. I want my money back. I tell you here when I get it back. I have also call telephone in July, a man called John promissed to find out, I give him 10 days, and they are gone for many days ago. Torben Boilerehauge Poulsen, telephone +45 2554 1386.", "Date": "July 29, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "2"}, "AuthorLocation": "New York City, New York", "Title": "“BED BUGS!! THIS PLACE IS AWFUL!!”", "Author": "jpl143", "ReviewID": "UR72688950", "Content": "I cannot even begin to explain what a nightmare this place it. The people who work here are rude, apathetic, sexist, obnoxious, uncaring people. I traveled with a group of 10 people-- the company I work for has put us here three years in a row and each time has been a horrible experience. The rooms are dirty, the walls are PAPER THIN (I was able to have a full conversation with my neighbor without raising my voice), the bathrooms are moldy and clogged up and constantly without toilet paper or towels, the breakfast (if you can get them to actually bring you any) is disgusting. When I checked in, they gave me a room that hadn't been made up after the previous guest. When I told them this, they tried to give me a stack of sheets to make up the room myself. We reserved a room with two beds, and when they gave us a single they promised to bring up a roll-away bed for the second person. Not only did they not do this, but we had to drag it out from the basement and up 5 flights of stairs on our own because they refused to help. There are dozens of small complaints like this that have made our stays the worst EVER IN OUR LIVES AT ANY HOTEL ANYWHERE. BUT-- the worst came when 4 of our group staying in room numbers 2 and 3 got the most voracious case of bedbugs I have ever heard about. Their arms, legs, backs, necks, and faces are absolutely covered in bed bug bites. It was so bad that 2 of them had to spend the night in the emergency room. The staff said they had never seen a case of bedbugs this terrible. Now we are faced with having to launder every piece of clothings, throw things out, boil sheets, etc. I hope the NHS shuts this hotel down. (picture attached to give you an idea of what these girls are dealing with all over their bodies.)", "Date": "July 28, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "5"}, "AuthorLocation": "southport", "Title": "“Don't stay here, whatever you do, don't stay here!!!!!!!!!!!”", "Author": "grantleySouthport", "ReviewID": "UR56469855", "Content": "My family (wife, and three young children) arrived here on 16/02/10. We had driven from Southport and struggled to get to the 'Hotel' (slum). I dropped my wife and children off outside the building with our luggage and went to park the car. On parking our car, my wife rang me on my mobile, she was almost in tears saying that the room was a tip, and that she had been offered no assistance in carrying our luggage up three flights of stairs, while having to manage our three young children. when I finally arrived at our room I was equally devastated. the room was filthy, dirt and grime on every surface and the carpet didn't look like it had been vacuumed for months. One of the window panes was broken and taped up with 'selotape', the plastic uht milk cartons had green mould on them. At least, thank God, we didn't see or experience any bed bugs, but the only clean things in the room were the bed sheets. The tv only worked on channel 5. The next day we tried to find somewhere else to stay, but found everywhere full, and there ARE quite a lot of other places that look and smell cleaner. We had to go back to the 'Hotel', but since we had already checked out, we were offered a room with an 'en suite'. This room was, at least, clean with no bed bugs. The tv still only worked on channel 5, and the 'en suite' shower was blocked, and flooded over the bedroom floor every time we used it. Since we were only there one night we 'used' the shower a lot. Summary: DON'T STAY AT THE LANGLAND HOTEL ON GOWER STREET AT ANY COST FOR ANY REASON- IT IS CRAP!!!!!! YOU HAVE BEEN WARNED< DON'T SAY I DIDN'T TELL YOU>", "Date": "February 19, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Location": "4", "Rooms": "1"}, "AuthorLocation": "Amsterdam", "Title": "“Freebies: Bed buggs and Flees are included”", "Author": "Bugged123", "ReviewID": "UR54331350", "Content": "I should have checked the reviews online first. My body is completely full with bites from flees / bet bugs. I think this is unacceptable and your hotel needs a big complete clean! I really feel badly treated, it is a shame that these kind of hotels spoil the industry. I dont think the owner sees the importance of hygiene, because this has happened many times reading the reviews listed on this site. No refunding, with the lame excuse of ‘’I have given you another room’’ is also unacceptable! I must say; staff was willing and understanding in a way! they are not the one to blame. I only hold the owner responsible for the bad hygienic situation. Enquieries have already been made with the London Town hall. Regards, Willem van Putten, Room # 12", "Date": "January 25, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Location": "3", "Rooms": "1"}, "AuthorLocation": "Southampton", "Title": "“Worst Nightmare ever”", "Author": "Haydn121", "ReviewID": "UR53684987", "Content": "Well unsure where to start really, We always stay at youth hostels when we visit london cheap and clean and a bed to sleep in so from that you will see we are not the type of people that expect a lot from a cheap place. The beds were crawling with bed bugs and we were bitten the net curtains were black with dirt sheets were stained and all electrical appliances PAT Test had expired in 2008 not that we would use the kettle the state of it inside to stress again how bad this room was we left after no apology off the satff they did not care or show interest in our discomfort so we ended up walking the streets at 2am in the morning searching for a hotel which we found at 430am in Victoria walking past the homeless people in doorshelters they had it cleaner and better than us so that says it all, so please please avoid this place like we say we do not complain and we just like a cheap and clean and this was far from it and no Refund was givien to us YET. I have plenty of photos to share.", "Date": "January 17, 2010"}, {"Ratings": {"Overall": "1.0"}, "AuthorLocation": "manchester", "Title": "“PLEASE DONT DO IT!!!!”", "Author": "kepetty", "ReviewID": "UR53669226", "Content": "What a filthy disgusting place. I could`nt even put my bags down on the floor. Bed bugs all over the pillows and bedding. \"white net curtains\" literally black. I will be contacting environmental health about this and hope it gets closed down. I cant believe this day and age this \"FILTH\" is allowed", "Date": "January 17, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Location": "3", "Rooms": "1"}, "AuthorLocation": "Manchester", "Title": "“Would not let a dog stay here!”", "Author": "MissKManchester", "ReviewID": "UR53630659", "Content": "We arrived on a Friday with a meal and theatre booked and we could not have stayed here. I am not fussy when it comes to hotels and believe that as long as a hotel is clean you get what you pay for. For the first time in my life I left the hotel with my family and we demanded a refund. We paid on arrival and then went to the room. The room was not en-suite but we knew this. We found we were not the only inhabitants of this room from only one step inside. All of the 3 beds were covered in bugs crawling around. We all started itching with the thought and daren't even put anything down on the floor. The decor was shabby but we could have lived with that. But the whole room was unclean - dirty net curtains, carpets. The bedding was clean...just covered in bugs and not just small ones! We were offered another room but this was equally as unclean. Please do not put yourselves in the position we ended up, with luggage, nowhere to stay and the theatre to get to. We ended up getting another hotel a little bit further out of town and paying a bit more but it was worth it 100 times over. This hotel needs reporting to environmental health. I promise I am not usually one to complain and fussing is not usually in my nature BUT i would not want anyone to be in the position we were in!", "Date": "January 16, 2010"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Overall": "2.0", "Value": "1", "Location": "4", "Rooms": "1"}, "AuthorLocation": "Australia", "Title": "“Poor value but good location”", "Author": "aikoko", "ReviewID": "UR49219018", "Content": "Much like other reviews I've seen here, I'll reiterate the same messages: Negatives 1) Poor value for money 2) Better rooms in London for cheaper 3) Very thin walls between rooms 4) Loud traffic noise if your room faces the street 5) Demanding and unfriendly reception and breakfast staff 6) Don't believe the website photos (too good to be true) 7) Poor shower facilities - damp and unclean Positives 1) Great location - Close to transport and Central London 2) Showers were hot Recommendation during summer months: The much cheaper, cleaner and friendlier University College London accommodation residences nearby, but they are only open during the holidays.", "Date": "November 14, 2009"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Location": "2", "Rooms": "1"}, "AuthorLocation": "New York, NY", "Title": "“BED BUGS! There are better hostels out there!”", "Author": "IheartSugar", "ReviewID": "UR36350351", "Content": "Langland Hotel (aka Bed Bug Hotel) was disgusting! I have never stayed in a worse place. I went with my sister and a friend; we and stayed in a triple room with a private bathroom on the first floor. The bathroom smelled like a porter potty and we had to leave the fan on constantly to filter out the urine smell. Their bed had BED BUGS and I was the unfortunate recipient of numerous bug bites all over my arms, back and shoulders. It horrified me and when we notified the staff, we were NOT moved immediately. Instead we had to wait another day for a vacancy and slept on a cot instead. When we asked about compensation, we were given the run around. Our money has never refunded, not even for the night we slept on a cot. I've stayed at hostels half the price that were nicer. I can't find enough words to describe how horrible our experience was!", "Date": "July 31, 2009"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Location": "4", "Rooms": "1"}, "AuthorLocation": "dunfermline", "Title": "“DO NOT STAY HERE”", "Author": "laurenandgraeme", "ReviewID": "UR31718662", "Content": "My partner and i spent two nights at this hotel and were disgusted by alnost every aspect. The staff were very unwelcoming and the room was a disgrace. the wallpaper was hanging off the wall. It was very hot and noisy as there was no double glazing or air con. The bathroom, which was shared by the whole floor, was so appallingly dirty my partner couldn't bring herself to wash in it. Overall a very bad experience.", "Date": "June 6, 2009"}, {"Ratings": {"Service": "2", "Cleanliness": "2", "Overall": "2.0", "Value": "2", "Location": "4", "Rooms": "1"}, "AuthorLocation": "Blackpool", "Title": "“Don't stay at this hotel, pay more & go to a decent one.”", "Author": "scaryscouse09", "ReviewID": "UR30248465", "Content": "I chose this hotel because it was very close to the venue I was going to on the Saturday. Big mistake. I had to pay the full amount for the room as soon as I got there without even seeing the room. When I got there it was nothing like the picture on the website. I was down in the basement with the tiniest window which had next to no light. The walls were brick painted over but the paint was chipping off & bubbling. There was a double bed & although the sheets were clean there was a feeling of dirtyness about the room. I was next to the communal toilet-nice.There was a bathroom with bath & sink-no plug. The wardrobe area was just partof the brick room, so I left my clothes in my case. There was tea & coffee making facilities & a small TV, but the reception was poor. The breakfast was ok but as I never have much breakfast I paid for a cooked breakfast which I didn't want... Its too late for me, I only stayed 2 days & couldn't wait to go home..but don't go there unless you are desperate or at least check the room BEFORE parting with your money", "Date": "May 18, 2009"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Location": "3", "Rooms": "1"}, "AuthorLocation": "Canada", "Title": "“Not worth any price to stay here”", "Author": "retiree55", "ReviewID": "UR29474758", "Content": "Extremely DIRTY hotel. Sheets were not changed in the 3 days we stayed there. The bathroom was not cleaned the entire 3 days either. Carpets were not vacuumed. Beds were made and that was all. Price included an English breakfast which was not worth it. The same people who cook breakfast are the same people who suppoosedly clean the rooms. HORRIBLE 3 day experience.", "Date": "May 6, 2009"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Location": "4", "Rooms": "1"}, "AuthorLocation": "Cheshire", "Title": "“Dirty, poor value, no facilities - avoid at all costs”", "Author": "flowersgirlCheshire", "ReviewID": "UR27078955", "Content": "This is the dirtiest hotel I have ever stayed in, and that includes several youth and backpackers' hostels in south east asia. The room clearly hadn't been vacuumed for several months, and we kept our shoes on at all times, even in the bedroom. The towel that I took out of the wardrobe to use was wet, and the room also stank of cigarette smoke. There is one toilet on every other floor, and the bathrooms were also dirty. The owners were not friendly, and we felt that we were being watched all the time. The location is good, but this in no way makes up for the cost (£40 each, with 3 in a room) or the dirt. We didn't risk the breakfast, preferring to take our chances on Euston station. I like to support independent businesses where I can, but a Travelodge would have been infinitely better - do not stay here!", "Date": "March 30, 2009"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Location": "3", "Rooms": "1"}, "AuthorLocation": "Cheshire", "Title": "“Don't Take Your Shoes Off”", "Author": "CheshireMuminlaw", "ReviewID": "UR26658590", "Content": "Truly dire. So filthy you wouldn't want to put your feet on the carpets. I suspect 'pets' were provided judging by the mouse traps on view. 1 toilet for 2 floors of rooms - an absolute disgrace", "Date": "March 23, 2009"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Business service (e.g., internet access)": "1", "Check in / front desk": "1", "Overall": "1.0", "Value": "2", "Rooms": "1", "Location": "3"}, "AuthorLocation": "Manchester, United Kingdom", "Title": "“Dismal”", "Author": "absintheur", "ReviewID": "UR21933443", "Content": "I'm afraid I had an entirley underwhelming experience at the Langland. I stayed for one night and will not be staying there again. The sole good point is that the hotel is conveniently located on Gower Street. Sadly the place is run-down and shabby; in dire need of a complete overhaul. The first room I was given had a double and single bed crammed into it with virtually no spare floor space. The room was damp, the single glazed window overlooking the busy main road was filthy, as was the sink in the room. The en-suite I had ordered was not available, and the unconcerned shrug of the receptionist when I pointed this out was disappointing. My alternative room was in the basement and was again bleakly appointed and shabby, but at least was quiet. Breakfast was edible but with limited choice and quality. I payed £75 for my experience, which admittedly is cheap for London, however, there are so many more similar places that do this type of lodgings much better, and as such, I can not possibly recommend this hotel to anyone.", "Date": "November 17, 2008"}, {"Ratings": {"Service": "1", "Cleanliness": "2", "Check in / front desk": "2", "Overall": "1.0", "Value": "1", "Rooms": "2", "Location": "4"}, "AuthorLocation": "essex", "Title": "“Total Rip Off”", "Author": "leb1984", "ReviewID": "UR20805295", "Content": "Made reservation over the phone for a double en suite for a set price, when we arrived we were given a shared bathroom double room and told if we wanted an en suite it would be an extra £20 even though I had an email with a confirmed price! We were basically forced to hand over the extra money as the room and shared bathroom we were given was appauling.", "Date": "October 11, 2008"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "bognor regis", "Title": "“basic but great..”", "Author": "baldieman", "ReviewID": "UR20267932", "Content": "Stayed here in september 08.If you want a hotel to just use as a homebase then this is the hotel for you.Basic but good.Freindly staff,always happy to help.Breakfast good and had plenty of it. I will use this hotel again as it was priced in my range and very close to all the sights.", "Date": "September 22, 2008"}, {"Ratings": {"Service": "2", "Cleanliness": "2", "Business service (e.g., internet access)": "2", "Check in / front desk": "2", "Overall": "2.0", "Value": "2", "Rooms": "2", "Location": "4"}, "AuthorLocation": "Gloucester", "Title": "“Basic”", "Author": "Amulet23", "ReviewID": "UR19369880", "Content": "I stayed with one other friend and as we are both mid 20's females, found the staff to be a little creepy. Room was very basic, located in basement with large window and damp on walls. Beds comfy and clean, but would only recommend to people staying 2-3 nights at most. Location good and would stay here again for weekend break.", "Date": "August 26, 2008"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Check in / front desk": "3", "Overall": "2.0", "Value": "2", "Rooms": "1", "Location": "2"}, "AuthorLocation": "CheshireBoy", "Title": "“Did not enjoy this”", "Author": "HillbillyCheshireBoy", "ReviewID": "UR17099624", "Content": "For the price I suppose it was ok, but we should have paid more for something better. Rooms too small, walls very thin, not an enjoyable experience. Glad it was only one night.", "Date": "June 21, 2008"}, {"Ratings": {"Overall": "1.0"}, "AuthorLocation": "Edinburgh", "Title": "“Don't stay here”", "Author": "RustyEdinburgh", "ReviewID": "UR16368138", "Content": "I booked in the Langland because of a last minute trip to London. I arrived after 10.00 pm and it was only because of the lateness of the day that I decided to stay. The room was dirty and smelly, as were the shared facities. Never the less I put my head down and got to sleep. The following morning the breakfast continued to attain the previous standards. Sour milk and mouldy bread bread were on offer as an integral part of the breakfast. I was glad to get out - never to return.", "Date": "May 24, 2008"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Business service (e.g., internet access)": "1", "Check in / front desk": "1", "Overall": "1.0", "Value": "1", "Rooms": "1", "Location": "4"}, "AuthorLocation": "hartford", "Title": "“Dirtiest hotel I've ever stayed in”", "Author": "teacher050", "ReviewID": "UR16240314", "Content": "This is the filthiest hotel I have ever seen. When we walked through the front door, an enormous mountain of dirty laundry faced us. Our room, which was directly off of the \"reception area,\" was unspeakably revolting. The bedspread had numerous stains (some still damp), the glass next to the coffee maker was cloudy and spotty, and there was a large, round hole in the wall under the window. The bathroom was a tiny cell that contained some kind of makeshift shower. No phone room; in fact, the only phone available for guests' use was in a corridor on the first floor. It, too, was filthy. Breakfast is served in a cheerless basement room. Filthy tables, filthy plates, filthy cutlery. Our meal consisted of undercooked bacon, undertoasted white bread, and pale beans. The staff was even worse than the accommodations. Rude, unaccommodating, and thoroughly disinterested in the business of running a hotel. The only thing in this hotel's favor is its proximity to the British Museum.", "Date": "May 20, 2008"}, {"Ratings": {"Service": "2", "Cleanliness": "2", "Check in / front desk": "3", "Overall": "1.0", "Value": "2", "Rooms": "1", "Location": "4"}, "AuthorLocation": "England", "Title": "“really run down”", "Author": "stephentwist", "ReviewID": "UR15815780", "Content": "What a shame the owners have chosen to make no investment in this hotel. It is tired, shabby and run down. It needs a make-over. If all you want is a bed and you like a trip down the corridor to the loo and to use a rusting shower, this will be your bag. But not for me. The only things going for it are its location (very central) and price: although you will find other comparables in Gower Street which offer clean, well appointed rooms.", "Date": "May 8, 2008"}, {"Ratings": {"Service": "2", "Cleanliness": "1", "Check in / front desk": "3", "Overall": "1.0", "Value": "1", "Rooms": "1", "Location": "5"}, "AuthorLocation": "West Country", "Title": "“Avoid at ALL costs.”", "Author": "TC1WestCountry", "ReviewID": "UR14342371", "Content": "Have just come back from a couple of days in London & I so wish I had taken the time to research this slum on here first. Anyone checking this place out should REALLY take heed of the reviews on here. Looked ok on the website; reasonably priced budget hotel I thought. On arrival we discovered it was anything but. All the complaints that are listed on here are true: Curtains (not laundered in years) hanging off rails, mouldy rotten surrounds in bathroom, breakfast cold and tasteless, radiators on full with no controls, housekeeping standards that are extremely lax. It is places like this that make foreign visitors think that we live in squalor and still eat rubbish. Find the extra few pounds for somewhere else because this hotel (I use the word hotel VERY loosely) is a false economy. I will NEVER mention this estalishment to anyone in a positive light.", "Date": "March 17, 2008"}, {"Ratings": {"Service": "1", "Cleanliness": "2", "Business service (e.g., internet access)": "1", "Check in / front desk": "1", "Overall": "1.0", "Value": "1", "Rooms": "2", "Location": "5"}, "AuthorLocation": "leedsgal22", "Title": "“gud location but bad hotel”", "Author": "leedsgal22", "ReviewID": "UR13559732", "Content": "We stayed in this hotel for night and i am so glad we hadnt booked for longer! We were given a room at the front of the hotel which seemed ok resonbaly clean! Must admit they need to change the curtains they were nearly falling off! The room was very warm and we couldnt open the window ! my partner had to be up early due to being there for business but it was the main road the buses were none stop and even the windows rattled when they went past! In the ned we only had very little sleep! we thought a gud breakfast we perk us up havent not been able to sleep how wrong we was! it was stone cold in the end we just had coffee! this hotel has great location very close to tube station and local shops ! But if ur looking 4 a decent night sleep to view the city dont go!", "Date": "February 14, 2008"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Check in / front desk": "1", "Overall": "1.0", "Value": "1", "Rooms": "1", "Location": "2"}, "AuthorLocation": "Bilbao", "Title": "“Don´t go”", "Author": "sece59", "ReviewID": "UR12949282", "Content": "The place is dirty and shabby. Very few bathrooms for too many rooms. Breakfast room is too small, and service is so so slowly. And be careful with your credit card: We had made a reservation for two rooms, for four nights (5 people). One of us could only arrive the next day of our arrival, so we asked on our arrival if it was possible to take just one room for the first day. The man at the reception told us there was no problem, and so we did. But when we checked out, they wanted to charge two rooms since the first night. After arguing a little bit with the receptionist, he accepted to reduce the bill. But then, surprise: they have charged the rest on my credit card. --I can´t believe it--.", "Date": "January 24, 2008"}, {"Ratings": {"Service": "3", "Cleanliness": "1", "Check in / front desk": "3", "Overall": "1.0", "Value": "5", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Flitwick", "Title": "“Left a bad taste in the mouth”", "Author": "WalterTrout", "ReviewID": "UR12600311", "Content": "I'll start with a positive, because it's downhill from here on - very good location. 3 tube stations very nearby, and a short walk to Oxford St and Soho. My experience at the Langland was fine until the morning where I used one of the shared bathrooms. What followed was one of the most horrific experiences I can think of. I brushed my teeth in the basin and reached for the hand towel to dry my mouth and hands only to discover that the towel had been soiled with human waste. One can only imagine the kind of animal that had done this and I still feel sick at the thought of it. STAY AWAY FROM THIS HOTEL!!!!", "Date": "January 14, 2008"}, {"Ratings": {"Service": "2", "Cleanliness": "1", "Check in / front desk": "1", "Overall": "1.0", "Value": "1", "Rooms": "1", "Location": "5"}, "AuthorLocation": "edinburgh", "Title": "“Pick another hotel!!”", "Author": "taite12345", "ReviewID": "UR11006603", "Content": "The positives: 1. Great London location (just pick another hotel there!) 2. Subway stop located nearby The negatives: 1. DIRTY DIRTY DIRTY 2. Dirty bathroom (mold) 3. Our reservation was \"lost\" 4. Underneath the carpet, the floorboards were rotting.", "Date": "November 23, 2007"}, {"Ratings": {"Service": "1", "Cleanliness": "2", "Check in / front desk": "2", "Overall": "1.0", "Value": "1", "Rooms": "1", "Location": "4"}, "AuthorLocation": "Yorkshire", "Title": "“Cheap but definately not cheerful.”", "Author": "RosieYorkshire", "ReviewID": "UR10204749", "Content": "Stayed here for 2 nights in October. I booked a triple room with what appeared to be very reasonable rates for a London hotel. However , I was to discover why this hotel was cheap. We were allocated a room at the front of the hotel which was supposed to be a triple room, I've never seen a room so small for three people it whould have been barely adequate as a single room. The doulble bed and single bed were squashed up against the wall leaving approximately 1.5 feet of floor space between the wardrobe, dressing table and sink, impossible for more than one person at a time to stand. The room was very hot so had to leave the window open all the time but because of this the room was very noisy as Gower Street is very busy day and night. A fan was provided but this kind of defeated the object as this was also noisy. The room was reasonably clean apart from the net curtains which were filthy and the main curtains were torn and did not close properly, one fell down on our last day. The double bed was not actually a double but was a three quarter bed. I asked for another room but was informed that no other room was available. Breakfast on the first day was okay but on the second day it was a complete shambles. No table was available so we had to wait a long time for one. When we eventually did get seated there were no cups, glasses, cutlery, fruit juice, coffee or tea. Although poached eggs were on the menu they said they where unavailable I think they just couldn't be bothered to make them. Had the english breakfast but it wasn't very good. Badly presented, not much of it and not cooked very well. My opinion is that this hotel is cheap because it is so bad. I would advise anybody to either pay a bit more or look else where as there has got to be better hotels than this. I speak from experience as I have stayed in many hotels and worked in hotels for many years and believe that they could do much better than this.I don't know how they managed to be awarded two stars, I've stayed in hotels that had no stars that were better than the Langland. The only good thing I can say about this hotel is that the location is good but there are other budget hotels in this area and hopefully they are better.", "Date": "October 21, 2007"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Business service (e.g., internet access)": "4", "Check in / front desk": "4", "Overall": "4.0", "Value": "4", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Washington DC, District of Columbia", "Title": "“Enjoyed the Langland”", "Author": "Mark M", "ReviewID": "UR10087284", "Content": "My partner and I selected the Langland Hotel for our stay in London, partially because many other hotels were already booked and partially because the room charge was a bargain. We booked our room through the hotel's website and selected a double ensuite. Our reservation was accepted and guaranteed within about one hour. The hotel's location is great: It's near the British Museum, Soho, public transit, and the Euston train station. The neighborhood is pleasant and quiet. The room was fairly basic--a little worn--but clean. The bathroom was small, but functional and modern. The hotel provided daily turnover service with fresh towels and general cleaning. Hotel staff were very pleasant and friendly. Breakfasts in the dining room (included) were excellent and the servers were friendly. We'll definitely stay there again.", "Date": "October 16, 2007"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Business service (e.g., internet access)": "4", "Check in / front desk": "3", "Overall": "3.0", "Value": "4", "Rooms": "2", "Location": "4"}, "AuthorLocation": "Calgary", "Title": "“Price was ok, but extremely noisy”", "Author": "CalgaryCanuck", "ReviewID": "UR10083541", "Content": "My only real complaint is how noisy the hotel is. If you get a room by Gower Street you will hear traffic all night and it is loud. The fight night I stayed here I slept through my alarm (presumably drowned out by traffic), and the second night I was scared of missing my early flight next morning so I didn't even sleep. Front desk did not place a wake-up call even though I asked and confirmed it separately. Otherwise, the staff is courteous and the rooms are reasonably clean. The rooms are small, but this is London after all. The hotel is located a couple minutes from the Goode St Tube station which was convenient. There are an assortment of cafes and stores nearby and it is a reasonably busy area so I felt safe walking around at night. Basically, I would recommend this place if you are just looking for a place to sleep. It is not romantic and no in-suite bathroom would be a pain otherwise. However, as long as you get a room that does not face the main street I believe that it is pretty good value to stay in such a central location.", "Date": "October 15, 2007"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Check in / front desk": "4", "Overall": "3.0", "Value": "3", "Rooms": "2", "Location": "4"}, "AuthorLocation": "Dublin", "Title": "“Quiet small rooms but central”", "Author": "150782", "ReviewID": "UR8484939", "Content": "Myself and 2 friends stayed at Langlands Hotel. We got a triple room which was very small but was clean enough. We were situated at the front of the hotel which was very noisy because of the traffic on the street infront of the hotel. So if you are staying there it would be advisable to request a room at the back of the hotel. We got a lovely breakfast each morning which was included in the price. The hotel itself is very central and it is near a few tube stations. We had to share a bathroom which I didn't realise at the time when booking but this was fine as the bathroom was clean enough. A couple of times we were waiting a while to use the bathroom but that was to be expected. We found the staff very friendly also.", "Date": "August 23, 2007"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Check in / front desk": "4", "Overall": "4.0", "Value": "5", "Rooms": "3", "Location": "5"}, "AuthorLocation": "saskatchewan, canada", "Title": "“Tiny rooms but the helpful staff made up for it”", "Author": "happy_travelsin2007", "ReviewID": "UR8234324", "Content": "Although the rooms were small, the friendly and helpful staff made up for it. They helped us find laundry facilities in the neighborhood, arranged transportation to Victoria Station for us and were always smiling. You can't get much better for the money!!", "Date": "July 25, 2007"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Business service (e.g., internet access)": "1", "Check in / front desk": "1", "Overall": "1.0", "Value": "1", "Rooms": "1", "Location": "4"}, "AuthorLocation": "Viby", "Title": "“Stay away from this hotel !!!”", "Author": "Svendsen", "ReviewID": "UR8073329", "Content": "If you want to have a nice stay in London, keep away from this hotel. I have stayed in many hotels all over the world, this is one of the worst ever experienced - including during my packpacker time. The rooms are dirty, and the sanitary facilities doesn't function, and are so dirty you hardly want to take a shower. The wallpaper in the rooms are hanging down and are yellow with dirt, and there were big holes in the bed linen. The so called breakfast was so bad it was difficult to swallow, and the service stopped before annonced time because the staff was having private conversations, so several guests had to leave in anger without having got any breakfast at all. The staff was in general quite impolite. This hotel should change its manager. My wife and I have had good experinces in other low cost hotels in Gower street before, but this one was terrible. So, if you want to visit London and have nice memories of this wonderful city, stay away from Langland Hotel on Gower street.", "Date": "July 7, 2007"}, {"Ratings": {"Service": "1", "Cleanliness": "2", "Business service (e.g., internet access)": "2", "Check in / front desk": "1", "Overall": "2.0", "Value": "2", "Rooms": "1", "Location": "5"}, "AuthorLocation": "los angeles", "Title": "“May want to go somewhere else”", "Author": "kdav", "ReviewID": "UR7999743", "Content": "Some serious issues with this hotel which is unfortunate due to its prime location. I am 5 1/2 months pregnant and reserved a room at Langland Hotel with a good bed for my back well in advance. When I showed up, they gave me a room with a mattress thinner than a mattress pad. They would not provide an additional mattress or switch rooms, despite the horrible condition my back was in after 1 night of sleeping there. In addition, they never responded to email, which is costly when you have to make reservations by phone from the US.", "Date": "June 26, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Business service (e.g., internet access)": "5", "Check in / front desk": "4", "Overall": "4.0", "Value": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "San Diego", "Title": "“Inexpensive good location nice people”", "Author": "AuntieSue", "ReviewID": "UR7479504", "Content": "My first stay at the Langland was in October, 2004. I found it by chance after the hotel I had booked was a dissapointmen. The Langland was and is just what I needed. I got a small room on the ground floor, facing Gower Street. Yes, there is a lot of traffic but for the price, that didn't matter. Since then I have stayed there in 2005, October, 2006 and just this last April, 2007. Since my October, 2006 and my April stay, the ownership changed and my reservation for April was lost,. However, Sam the new manager, gave me my same room, #13, at the same rate even though it is now a double. I use the bathroom on the landing, which like the room is always clean. Breakfast was filling and well prepared. To get to anywhere all you have to to is walk across the street where several buses stop and go to almost everywhere in London. (Get an \"Oyster\" card to save on buses and the Underground\") For me, the budget senior traveler,the Langland is the only place to stay in London.", "Date": "April 28, 2007"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Business service (e.g., internet access)": "1", "Check in / front desk": "1", "Overall": "1.0", "Value": "1", "Rooms": "1", "Location": "4"}, "AuthorLocation": "New York City, New York", "Title": "“They should have paid me for my stay And I wouldn't stay there again if they did”", "Author": "spinach", "ReviewID": "UR7349809", "Content": "Where do I begin....The staff said yes to everything, but did/knew nothing, when we complained about the toilet running in our room, they said they would fix it. When we came back to our room after a day of sightseeing, it was still broken. When I enquired as to why it wasn't fixed they said they are not allowed to enter the room when we are not there. When you ran the sink faucet, the water bubbled up from the shower drain. The second night after a full day of sight seeing we came back at nine pm to a gas smell in the room. We told the staff. They first said yes they smelled something, changed our room, not ensuite, then when the smell started to permeate the entire ground floor of the hotel, the staff said that there was no smell. Then the staff opened the doors to the hotel, when I confronted him about this so that he would acknowledge the smell he said \"there is no smell, I just want some fresh air\". We were not sure if it was sewage or kitchen gas so we left the hotel and travelled up and down Gower St. looking for other accommodations. The Stauton Hotel just down the road saved us.", "Date": "April 14, 2007"}, {"Ratings": {"Service": "2", "Cleanliness": "2", "Business service (e.g., internet access)": "3", "Check in / front desk": "2", "Overall": "1.0", "Value": "2", "Rooms": "1", "Location": "4"}, "AuthorLocation": "Birstol", "Title": "“Be Warned”", "Author": "DisgruntledBirstol", "ReviewID": "UR7196498", "Content": "Having read the other reviews on this website, I was extremely dissapointed with this hotel. I did make a very large error of paying for the room up front, before I'd even seen it, and instantly realised the mistake I'd made. The whole place appears to be rotting, despite looking quite nice from the outside. The rooms are shabby, very noisey, and the matress was very lumpy. Also during the night I suffered itching from the sheets. I'd have probably got a better night's sleep in my car! I have stayed in many budget hotels, including some fairly ropey ones in Eastern Europe. However, this is by far and away the worst I have ever stayed in. Only plus point was the location. One to be avoided!!", "Date": "March 21, 2007"}], "HotelInfo": {"Name": "Langland Hotel", "HotelURL": "/ShowUserReviews-g186338-d504487-Reviews-Langland_Hotel-London_England.html", "Price": "$79 - $127*", "Address": "<address class=\"addressReset\"> <span rel=\"v:address\"> <span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">29 - 31 Gower Street</span>, <span class=\"locality\"><span property=\"v:locality\">London</span> <span property=\"v:postal-code\">W1CE 6HG</span></span>, <span class=\"country-name\" property=\"v:country-name\">England</span> </span> </span> </address>", "HotelID": "2514296", "ImgURL": "http://media-cdn.tripadvisor.com/media/ProviderThumbnails/dirs/41/b9/41b9145bd40b0a18def3a106c0e5aefa3large.jpg"}}