{"Reviews": [{"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Long Beach, California", "Title": "“very nice Hotel parking no so much”", "Author": "Richard R", "ReviewID": "UR128553363", "Content": "This is a very nice hotel, with a friendly and helpful staff. I especially liked the bed. As soon as I layed down it felt very comfortable. There is plenty of food in walking distance. (That will be in another review.) I really didn't care for the parking. There are two hotels on this property and in my opinion there is not enough parking for both. Heading north towards the hotel on I-15 proves difficult with traffic and going a block to make a u-turn at the light.", "Date": "April 24, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Lancaster, PA", "Title": "“Excellent Value”", "Author": "HoytMan", "ReviewID": "UR127740317", "Content": "I am currently staying here while on business. The hotel features outside access around a very nice pool and hot tub area. I realize that some people don't like outside access but this is different - kind of like \"outside-inside\". The breakfast is very nice and the area is conducive to taking walks. There is a little bit of traffic noise from I-15 but, then again, being next to the highway is a very nice feature if you need to get out and go someplace. This is a very good value for the price paid.", "Date": "April 12, 2012"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "1"}, "AuthorLocation": "San Francisco, California", "Title": "“1st, 2nd, 3rd time stay...got to read to believe”", "Author": "ChefJen", "ReviewID": "UR127329482", "Content": "Where to begin.... I have stayed here 3 times and ALL 3 times there was an issue. 1st stay during a heat wave....A/C didn't work, but the heater did and was baking us in our first floor room during our 3 day stay. The advice given: sleep with your windows open....they have \"security\". 2 ladies staying on a bottom floor room that faced the back parking lot, I think not. The manager did end up comp the room but not after having to track him down at the hotel next door since his staff couldn't reach him cause he was \"off the property\" (next door sitting on the couch talking on his cell phone). The hotel changed names from a Quality Suites to Comfort Suites after the 1st stay. I figured it might be going under new management, which I was told it would be. Giving it a 2nd chance, I booked again. 2nd stay: 3 rooms. Booked well in advance and requested first floor rooms next to each other. Specifically stated I didn't want any room(s) in the corner by the back parking lot door or staircase. Called back a month before to verify our reservation was good to go. She gave me the room #'s; one was the corner room. I said, no, that they would need to change that she then gave me a new room # to replace it. We arrived to check in and to my surprise, the corner room was never changed. Forced to spend the night in the room cause they didn't have any others rooms unless I was willing to pay more $$. :/ Next day/night they were to move me...which they did but to the 2nd floor away from my family. At that point, I wasn't going to deal with the staff anymore and was going to enjoy my time with my family. I called upon my return home and spoke with the mngr. Erika for over 2 hours. She was very understanding (at least I thought so) and stated she was making notes in my file; was going to credit me back for half of my stay and give me points to cover a 1 night stay. I was told to contact her if we decided to ever come back. I felt good after our conversation. 3rd stay: Stayed last weekend for 2 days. Called to speak with Erika and from Dec. 2011 to March 2012 not one note was placed under my name. I had to remind her of our 2 plus hour conversation;red flag went up. Once that was figured out and I calmed down I called her back to book the room. We checked in on a Sat. -- came back to our room that night at 8pm and had to deal with a party in the room next door. 11:30pm: Called front desk and was told it's still early for a Sat. night and that the hotel doesn't have a policy against parties. RED FLAG. But that security would address the noise. Noise only got worse - people coming and going from the back parking lot door...front desk had no clue as to how many people were in that room or who was coming and going. RED FLAG. 1:30am: called front desk again, told they would have to call the cops. 2am: Cops show up and clear out the \"extra\" guest. Finally silence and maybe some sleep. :/ Phone in bedroom didn't work; light bulb missing in lamp on night stand in bedroom; water damage to the ceiling/wall/wallpaper peeling off in bedroom; refridge was turned off so all our food went to waste. One can only hope this hotel will change it's policy on parties and having the 2 back door entrances just open for people to go in and out of without a key. Security is a BIG ISSUE...guest safety is not a top priority at this location or to the staff. Plenty of hotels in and around the area...may have to pay more, but if it's for your safety or the safety of your family...won't you spend it? I will.", "Date": "April 5, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Columbia, MD", "Title": "“Nice hotel but bad Internet availability”", "Author": "Steph9732", "ReviewID": "UR126756743", "Content": "This was an attractive hotel in a good location. the room was attractive and comfortable, except for the small pillows which seems to be a chain-wide problem. The one thing that keeps me from giving this hotel a better rating is the problems we had with the Internet. The hotel advertises free wifi, but we had constant trouble connecting in our room eventhough we had the router right next to the conputer. We called for help and they came and said that is just the way it is and even the desk has trouble off and on. I was able to get our boarding passes using the computer in the lobby, though it had connection problems as well. So, if you are depending on Internet access, I would not stay at this hotel. Otherwise, it is nice room with a pool and nearby shopping and restaurants and a movie theater. We would not return unless we knew they had upgraded their internet service.", "Date": "March 27, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Location": "2", "Rooms": "4"}, "AuthorLocation": "Placentia, California", "Title": "“Would come back”", "Author": "Rosalie P", "ReviewID": "UR125128046", "Content": "Nice room, liked having the bedroom in a seperate room. TV in both rooms. Only stayrd one night but a very comfortable stay. Only negative was we were going to sea world and it was a bit of a distance away.", "Date": "February 24, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Chicago Area", "Title": "“Good Value”", "Author": "GrandmaLChicagoArea", "ReviewID": "UR120598310", "Content": "Stayed at this hotel November 3 to November 8 2011. Very clean and comfortable. Got a great rate booking direct through Choice Hotels using AAA card. We had a 2 Bedroom, 2 Bath Suite that was great for visiting grandchildren. Beds and pillows were comfy. Our TV stopped working in one of the bedrooms, but they fixed it right away. We had no parking problems during our stay, but they do not charge to park like the residence inn we almost stayed at so if it gets crowded I will accept that as part of the bargain. Good hotel for the price and the area.", "Date": "November 14, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "3.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "3"}, "AuthorLocation": "St. George, Utah", "Title": "“Nice hotel, terrible parking”", "Author": "BowlingGrandma2", "ReviewID": "UR120429623", "Content": "This is a very nice well maintained hotel. The rooms are clean and spacious and everything was in good working order. We enjoyed the breakfast that included eggs and bacon or sausage along with all the usual breakfast items. The big drawback to this hotel is the parking. The not very large parking lot is shared with another hotel. The other hotel rents out a room for parties on the weekend. The party guests take up all of the parking spaces. We returned to the hotel at about 8:30pm on a Saturday night to find no parking spaces. We even checked the lot behind the hotel but there were only a couple of spaces at the dark far end. We might have parked there but people were loitering back there in the dark. We ended up parking in a strip mall with \"Towing for non-customer\" signs everywhere. When we entered the hotel, there was no one at the front desk. We were very un-comfortable about where we had parked and went back down to the front desk after about 20-30 minutes. There were 3 people at the desk and they told us that there would be parking after 11:00 pm when the party had to legally break up. We stayed up to after 11:00 pm and found that party goers were leaving. We then moved our car. The next morning we complained to the front desk when we checked out. We were given a 15% discount on the Saturday night stay. Everything else about this hotel was very good but I don't think that we would want to stay there again.", "Date": "November 10, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "cochise county", "Title": "“Good Value”", "Author": "retdeltee", "ReviewID": "UR120305461", "Content": "Very EZ on/off the I 15. Easy access to shops and restaurants. Not a bad breakfast, for free. Comfortable room, clean, everything in order except the bedroom TV; but the bedroom is meant to sleep!! Comfortable bed with great pillows!!!! The living room onne worked. Quiet despite the highway nearby.", "Date": "November 7, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Sacramento, California", "Title": "“Excellent Stay during my Family Vacation”", "Author": "Nancy V", "ReviewID": "UR119416746", "Content": "I stayed in the Master suite during my Family Vacation and it was nice and quiet. The rooms were spacious, beds were comfortable, bathrooms were clean, and the fridge worked well. The staffs were very nice and gave us a speedy check in/out. The Pool heater was broken so the pool was very cold but the jacuzzi was nice. Parking was good for us since we parked in the back where there were lots of room. Location is right off the freeway and easy to enter. Close to Pizza Hut, Dennys, other restaurants, and a shopping center. I would definitely recommend and stay here again.", "Date": "October 17, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Colorado Springs, Colorado", "Title": "“Clean, Safe, Excellent for the money. A good find for a family”", "Author": "jabawaki", "ReviewID": "UR117053324", "Content": "I was weary about a hotel that cost 1/2 of the ones a long the harbor but I was pleasantly surprised. If you are the kind of person that expects a luxury spa hotel, don’t stay here go to the Hotel Del Cornado and pay 5 times more. If you want a clean, safe place with plenty of FREE parking in San Diego, I recommend this hotel. It is 15 minutes away from the zoo, down town, sea world and most everything you want to do on S. D. Lego land is 18 miles away and about 30 to 40 minutes. The staff is nice and the rooms are good. The hotel pool and hot tub is kept nicely. The FREE breakfast was a little better than your standard continental breakfast. Every morning there is at least some form of hot meat and eggs. The coffee is fresh and there is an attendant that takes care of everything. The most disappointing part was the happy hour. Yes, there is free beer and wine, but the ‘so called’ light dinner consists of chips and salsa. You’d be better off stopping at the many liquor stores or grocery stores and get your own beer or wine because the stuff was CHEAP. This was the ONLY complaint. In the immediate area there are plenty of places to eat and shop – even an In and Out burger within ½ mile. It shares the parking lot with a Holiday Inn and a Dennys. I’m not a fan of Dennys so I wished it was something else, but that really has nothing to do with the hotel. This is a great find in San Diego, particually for a family on vacation looking to keep hotel cost down. Seven days cost us $850, including taxes and fees.", "Date": "August 21, 2011"}, {"Ratings": {"Cleanliness": "2", "Sleep Quality": "2", "Overall": "3.0", "Value": "3", "Service": "3"}, "AuthorLocation": "Southwest USA", "Title": "“So So”", "Author": "TRMSouthwestUSA", "ReviewID": "UR116265797", "Content": "Hotel is in need of renovation, problems with internet, ice machine not working, lumpy bed etc. That said, they seem to be pricing accordingly. With location, good breakfast and room size, definitely worth a look. It worked for us on our trip. Just take the above into account.", "Date": "August 4, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "4.0", "Value": "5", "Service": "4"}, "AuthorLocation": "Columbus, Ohio", "Title": "“Relaxed Location, Needs Some Polish”", "Author": "drifter33", "ReviewID": "UR116080903", "Content": "First glance, this hotel needs some work. Some renovations have been done and seems to be improving. The front desk staffwas friendly and always enthusiastic to help. The rooms all face a courtyard with pool and sauna that was never loud or disturbing in the evening. The rooms are worn, but well equipped with fridge and microwave and decent amount of space. It was clean throughout, especially the bathroom area. The breakfast area was adequate with at least 2 hot items per morning. The breakfast manager also kept the area clean. She took over the waffle irons one morning as some smaller children were there unattended and kept pouring batter on the outside of the machine. She cleaned it and started making waffles for those who wanted them while basically watching some unruly children. Checkout was a breeze. Its easy to get to San Diego, the beach, and Legoland without parking fees and congestion. Its more of a budget motel, but definitel a value for families.", "Date": "July 31, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Fremont, Ohio", "Title": "“Great Place”", "Author": "bmski", "ReviewID": "UR114689842", "Content": "Excellent stay. Breakfast was great, bed was great, room was great. What more can I say. Parking might be a problem but we had no problem. We paid $90.11 total senior rate. Would stay here again at that rate in a heartbeat.", "Date": "June 23, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Layton, Utah", "Title": "“Good Location -”", "Author": "Go2theZoo", "ReviewID": "UR100338464", "Content": "This was our third time staying at this hotel. It's a little dated, but very comfortable and clean. We love it because there is a bedroom with a door and a sitting area with a fold out bed. The kids can sleep and the adults can watch TV without interrupting. All the rooms have a fridge and microwave. It is right off the I-15 freeway at the northern end of San Diego. We originally chose it for it's central location between The Zoo/Sea World and The Wild Animal Park, however we have chosen to stay there again even when not visiting the Wild Animal Park. However since it is right off the freeway, we request a room facing the parking lot so as to avoid the freeway noise. The parking is a little tight as it is shared with another property. There is not a washer/dryer in the hotel, it is next door at the Holiday Inn. That's a little annoying, but not too bad if you know and plan ahead. The staff has always been very friendly and helpful. They have always taken care of the minor problems we've had in a timely manner. The breakfast is very good. They have boiled eggs, waffles, biscuits and gravy, yogurt, cereals, fruit and pastries. There is a Denny's, a Pizza Hut , a Japanese place, an Italian place and a sub shop all within walking distance. Under the freeway (on Mira Mesa Blvd) there are lots of eating options, grocery stores, shopping areas, and movie theaters all within a couple of miles. (Buca de Beppo, Rubio's, In n Out, to name a few)", "Date": "March 16, 2011"}, {"Ratings": {"Service": "2", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Ventura, California", "Title": "“Not a bad place for the price”", "Author": "RetNavy", "ReviewID": "UR93975021", "Content": "I was there for an overnighter, checked in at 7:30pm and left at 6:30am so I had no time to enjoy the pool or jacuzzi which looked very inviting. The rooms were immaculate and spacious. The bed was the best I have experienced yet. Only one complaint that I had was I asked for a wake up call at 4:40am and did not get it until 5:58am. I had my cell alarm on so this did not affect me but I found it very unprofessional whomever it was at the desk that set up my wake up, and reported this when I checked out.", "Date": "January 21, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Davis, California", "Title": "“Right Location for us; Nice Place”", "Author": "HOnestABE18", "ReviewID": "UR93576100", "Content": "I've stayed here twice, so I'll try to talk about both stays. The Holiday Inn Express is closed for renovations right now (January of 2011), so the parking was ample this time. Last time I stayed here, the parking lot was very crowded with tiny parking spaces. I was coming in late this time (around midnight), so I expected the worse in trying to park a big car. I was pleasantly surprised, but found out in the morning what the reason was. The rooms are nice for kids or individuals that don't go to bed at the same time. There is a door to the bedroom, so one can be asleep and the other person can read/watch TV to their heart's delight. We had the potential for a triple whammy in January as we had a 1st floor location right next to the pool on the inside, next to the fitness room on another side, and right across from the reception/party room of Holiday Inn Express. Yikes. However, it was too cold for the pool, the fitnesss center was vacant most of the time and walls were sufficient anyway, and with the Holiday Inn Express not open, no parties. Stay was excellent. Internet worked great--no problems. Breakfast was great--I always like places that have make your own waffles and this one did. The location is the nearest hotel to where my son lives, so that is why we stay here. We'll stay here again. It meets our needs and works out quite nicely for us. As a sidenote, It is a bit far from Sea World, Old Town, etc. (maybe 15 to 20 minutes), so if I was going there to vacation, I'd probably stay somewhere in Hotel Circle area.", "Date": "January 18, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Minneapolis, Minnesota", "Title": "“Brand new suites, huge clean, saved $50 over similar suite hotel, this is better!”", "Author": "MorrisJamesE", "ReviewID": "UR85802662", "Content": "I was concerned about booking here, but I should not have been. Great location to freeways and businesses. Still some renovations in progress but most suites are fully upgaded and brand new! Beautiful courtyard with pool and sauna. This hotel beats all the other suite hotels I have stayed at in San Diego and the savings are huge. Absolutely the best deal I have seen in the San Diego area.", "Date": "November 3, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Toronto, Ontario", "Title": "“Great Value Hotel”", "Author": "Squidster", "ReviewID": "UR77166787", "Content": "Stayed for 4 nights in August. Good location about 20 minutes from all tourist attractions in San Diego. Staff very friendly and very accommodating. Complementary breakfast more than ample. Room nice, clean and quiet. Pull-out sofa in living area needs updating, my daughter found it very uncomfortable (however she did manage to sleep on it). Parking area was shared with Holiday Inn next door and could pose a problem if both hotels were full. However, we did always found a spot. For what we paid for the room and the prices for suite hotels in San Diego, this place can't be beat!!!!", "Date": "August 27, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Provo, Utah", "Title": "“Surprisingly nice, with very helpful staff”", "Author": "Docendee", "ReviewID": "UR72643451", "Content": "My husband and I shared a room with adult daughters for a short family reunion around Comic Con. We found the location convenient, right off I-15, with an easy 15 minute ride downtown. The hotel is landscaped very nicely, setting off the pool and hot tub and lending a peaceful atmosphere. Our bedroom/front room suite was average size, but very clean equipped with a small fridge and microwave – unlike others we’ve used, the refrigerator was quiet and got really cold.. What really stood out was the staff – our daughter only mentioned on the phone when checking reservations far in advance that we would need a cot. One showed up in front of our door the first evening. The cleaning crew were unobtrusively thorough. How they managed to clean so well around all our con costumes I’ll never know. Only one complaint – the hide-a-bed mattress was dreadful. Despite that, we would certainly stay at this location again. Oh, one warning. The hotel must be near an emergency medical facility, as we did hear a number of ambulances -- but not loud enough to bother us. Overall, it was an excellent base for our adventures about town.", "Date": "July 27, 2010"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Overall": "2.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "2"}, "AuthorLocation": "Colorado Springs, Colorado, USA", "Title": "“Not quite what I was expecting”", "Author": "trust360", "ReviewID": "UR71808448", "Content": "We first showed up to the hotel 15 minutes before the \"guaranteed check in time\" and were told our rooms were not ready, and that they would be ready in 15 minutes. We waited 30 minutes in the lobby and were told that they still were not ready. We asked if we could place our bags in our rooms and come back after they were cleaned, which they allowed us to do, but it took another 15-20 minutes to assign us a room. We asked for non-smoking but were given smoking rooms. When we asked to be changed to non-smoking rooms we waited another 20-25 minutes for another room assignment. When they finally gave us the room assignment we went to the new room and walked in on another guest who was already occupying the room. We again asked them to change rooms and it took another 20-25 minutes to be reassigned. The air conditioning in this room was not working and we were hot all night. We asked for rooms with double queens but we were told that we could not change from a single king to a double queen room. The breakfast the following day was average. Overall the room was nice except for the air conditioning problem, it just took was too long to get the room. Also, while I was staying at this location there was construction on the road to the hotel which made accessing the hotel a little difficult, not really the hotel's fault, but something to take into consideration.", "Date": "July 21, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "mountain view, ca", "Title": "“Great Hotel and a great location”", "Author": "traveler10111", "ReviewID": "UR70228009", "Content": "I stayed here and was pleasantly surprised. The location of the hotel was great. Little north of downtown San Diego but stil accessable to all the tourist spots in San Diego, i.e San Diego Zoo, Balboa Park, Wild Animal Park, Legoland and Sea World. If you are visiting friends and family at Camp Pendleton it is a great place to stay as well for that. The rooms are nice, clean and very roomy. They renovated some rooms recently so the furniture looks nice and the beds are just heavenly. The hotel has a modest pool and fitness area, both of which worked out perfect for me. They have a Denny's right next door, within walking distance so you can get your fill of food 24/7. The is also a strip mall across the street with many different eating choices such as Mimi's Cafe, Buca de Beppo, Island's Burger, Pat and Oscar's and there is a big Border's book store and huge Edward's Cinema if you want to catch a movie at night, one of the best movie theaters in San Diego. The front desk and staff was very friendly and helpfull for all my needs and questions about San Diego. Overall I throughly enjoyed my stay here and highly recommend this place especially if you are on a budget.", "Date": "July 9, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "3.0", "Value": "4", "Location": "3", "Rooms": "4"}, "AuthorLocation": "Sydney, Australia", "Title": "“Good option near the edge of San Diego”", "Author": "dooragan", "ReviewID": "UR53973076", "Content": "Very convenient location immediately adjacent to an exit off I-15. We enjoyed our stay in what is an attractive yet basic hotel. Good size rooms, reasonably quiet and comfortable. Complementary happy hour between 1730-1930 offered Bud, Budlight or wine with spicy snacks as well. Had no issues with smokers as reported in other reviews although chimneys readily available for those who need them. Noise from people enjoying the pool could be an issue in summer as most rooms face the central pool area. Breakfast had a good range of options, although no hot food in a large, light and airy dining room. Parking was OK while we were there but the adjoining Holiday Inn seemed to be in the midst of renovation and may have even been closed - could be tight when both hotels are at capacity. Free wifi was good and gym was well equipped. Very close to several large malls and food options such as Applebees etc. In summary a reasonably quiet, comfortable 'no surprises' hotel with a nice atmosphere, good location and facilities - recommended for anyone. Make sure to visit USS Midway if you haven't already. One of the best 'living' museums in the USA.", "Date": "January 20, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "San Francisco, California", "Title": "“Didn't stay here but wish I had!”", "Author": "ChefJen", "ReviewID": "UR50603048", "Content": "We were visiting family for 4 days over Thanksgiving and this hotel would of cost us $100.00 less than where we stayed. But because of reviews on here about smoking; etc. we decided to stick with the non-smoking hotel we did stay at only an exit away. We decided to go check out the hotel on Thanksgiving Day; the lobby was very clean, bright and inviting. The lady at the front desk was very helpful and allowed us to take a look at one of their King Suite rooms...and when they say suite they mean suite! :) It was what I call and outdoor entrance to the room; you walked into a big space where the sofa bed, TV, desk, wet bar with sink, refridge and microwave were. Then you walked down a short hallway; to the right was the bathroom sink and then another door to the actual bathroom. As you cont. walking into the next room it opens up into another large room with a King bed, another TV and closet space. The rooms could use some updating, but over all looked clean, and the best part was you could move around and not feel enclosed in. I must say we were kicking ourselves after seeing the room because where we stayed was nice, but the kind suite rooms were small and made you feel closed in. The other nice part was the inside outdoor courtyard with Palm Trees and water fountains...very inviting if you just wanted to sit or walk around. The pool & hot tub were nice too. I could see parking would become an issue since the Holiday Inn is literally right next door. Shopping centers, freeway access...everything is very close by. 20 min to Sea World or to the beach at Del Mar. You can't go wrong with this area. When we do return, we will be trying this hotel out next time. We had a nice stay at the other place, but think this is worth a try as well.", "Date": "December 4, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Sayre, PA", "Title": "“Exceptional place to stay!”", "Author": "2seniorcitizens", "ReviewID": "UR50015986", "Content": "When they say suites, they mean suites! There was a separate bedroom with its own tv and a sitting room with a sleeper sofa, tv, microwave, fridge, and even a sink. Clean and nice and for $72 best place we stayed on a 2-week trip-ask for the senior rate if you qualify. We would stay there again in a heartbeat!", "Date": "November 24, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "2", "Location": "4", "Rooms": "3"}, "AuthorLocation": "california", "Title": "“Just ok, not worth $90.00 or more”", "Author": "mcnba87", "ReviewID": "UR45746397", "Content": "Stayed for one night. Closet door had 3 foot chunk missing from it with wood exposed underneath. You would think this would be an easy replacement. View outside window (ground floor) was dead grass and brush. Room had two TV with no remotes, we never found them. Good points: Bed very comfortable, plenty of pillows. AC worked well was cold. Overall just ok not worth $90.00", "Date": "October 3, 2009"}, {"Ratings": {"Service": "1", "Cleanliness": "3", "Overall": "1.0", "Value": "1", "Location": "2", "Rooms": "2"}, "AuthorLocation": "Manteca, CA", "Title": "“Don't stay here on a busy weekend unless you like an Animal House atmosphere and smokers!”", "Author": "orrteach", "ReviewID": "UR30761495", "Content": "We stayed here over the Memorial Day weekend. Check-in was quick. We went with my in-laws who requested 2 non-smoking rooms. They were given a smoking room. We took our 2 teenagers and we had a 2-bedroom suite. The room was nothing special but it was nice to have 2 bedrooms and 2 bathrooms. There is also a microwave, coffee maker and refrigerator. If you do not like smokers, DON'T STAY HERE!!!!!!! They have these weird smoking chimney pots like every 10 yards along the hallways. The rooms are set up facing an inner courtyard where there is a pool and jacuzzi. These smoking chimney pots were everywhere! They certainly encourage smoking at this hotel. It was totally nasty! The pool area was extremely noise, the jacuzzi looked green, and they had little or no security. There were kids running around everywhere! The walls of the room are thick enough not to hear your neighbors, but you can hear footsteps from the room directly above you. The rooms were tired looking. The door jamb that holds one of the security locks was coming loose. My in-laws had white flakes (I guess it was paint) all over their floor. They asked and were moved to a non-smoking room. They were told that one would be available in the afternoon. We came back to the hotel in the evening, and the hotel had moved their stuff and had already checked out their old room. There was a lack of parking. The Holiday Inn Express and the Quality Suites are RIGHT NEXT TO EACH OTHER. There was little or no parking available at night. It was so disgusting to my in-laws, that they checked out early and didn't even care if they got a refund on their last night! THE ABSOLUTE WORST PART WAS ALL OF THE SMOKERS AND THE DISGUSTING CHIMNEY POTS EVERYWHERE! If you hate smoking, DON'T STAY HERE!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!! In addition, this hotel allowed PETS!", "Date": "May 25, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Tucson, AZ", "Title": "“I liked it!”", "Author": "Suehm", "ReviewID": "UR28234418", "Content": "First and foremost all of the staff there were terrific. Friendly, helpful and very polite. (oh ok, with the exception of the bartender but he was non essential anyway) The rooms were spacious and great for family. We traveled with my Mom and they put her close by. A few minor repair issues in the rooms, i.e. the remotes kinda sucked, the refrigerator didn't cool very well...but overall for what we paid and what we got it was a GREAT deal. I found the rooms clean and the housekeeping was always done daily. The free breakfast was more than adequate and they have a nice sized room to eat in with plenty of seating. They served til 10 am. Like i said the free happy hour - well, we had our older kids with us and the bartender growled at us that they couldn't stay in there - (there was only like one other person in the place) but whatever, we left and had our own happy hour in the room. It was RIGHT off I-15 and so very convenient to everywhere we traveled. Found a shopping center with Albertsons etc down the road to the west so we were set. Again, the staff there - the front desk and housekeeping and brkfast people - were all SO Great. They made sure we were happy and asked if there was anything else they could do for us. It was well worth the money (compared to other places in San Diego that charge ridiculous amounts just becoz it's \"San Diego.\"", "Date": "April 17, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "4", "Rooms": "5"}, "AuthorLocation": "Corona", "Title": "“I had a fun and relaxing stay.”", "Author": "mrsupercat", "ReviewID": "UR26834358", "Content": "When I check-in at the quality suites, I was greeted with a warm and friendly smile. The staff was very helpful and knowledgeable of the different restaurants and things to do in the area.The beds were very comfortable, it felt like i was in my own bed. I would come back again and would recommend my friends to stay here too.", "Date": "March 25, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Business service (e.g., internet access)": "3", "Check in / front desk": "3", "Overall": "3.0", "Value": "3", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Los Angeles, California", "Title": "“Good enough”", "Author": "Mel0dy2007", "ReviewID": "UR23324559", "Content": "This hotel is in a good location with Denny’s restaurant and Holiday Inn Express in the same lot. All the rooms are facing the pool so you kind of hear the noise of the people swimming and having fun even late at night. We stayed in a one bedroom suite with a door and the bathroom is separating the bedroom from the living room; very good for a big family like us. The breakfast consists of hard boiled eggs, gravy, muffins, toasts, cereals, fruits, milk, juice. It was a little uncomfortable when we arrived in the breakfast room and the room is filled with guys in AT&T uniforms with a guy speaking to all of them. A young lady was kind enough to tell us that we can use the bar area with some tables next door.", "Date": "January 6, 2009"}, {"Ratings": {"Overall": "1.0"}, "AuthorLocation": "FuntoTrvl", "Title": "“Not worth it”", "Author": "FuntoTrvl", "ReviewID": "UR14685989", "Content": "When we arrived the hotel from the outside looked very promising, but once we entered the room it was aweful. The furniture was very old and dirty. The floors had stains everywhere. The cabinet where the sink and mini refrig are, was all torn up and disgusting. The bathroom was very old looking and not comforting. The carpet in front of the sink was dirty. I wouldn't let any of my kids walk on the floor without any socks(that is how uncomforting it was). The beds were just full size when we were told they were queens, and I was told there were 2 bedrooms and there was only 1. Just completely dissappointed and would not recommend.", "Date": "March 31, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "2"}, "AuthorLocation": "southern California", "Title": "“Nice bed!!!”", "Author": "rocnrlr", "ReviewID": "UR11674035", "Content": "We had a reservation next door at the Holiday Inn Express, but when we arrived we were told we'd been \"upgraded\" to a suite next door at the Quality Suites! Who could argue? The reception area decor/cleanliness was impressive, and the front desk clerk was very nice. Our suite was in the back on the top floor away from the freeway noise. Very lovely. The bed was heavenly: high quality sheets, quilt, and pillows, and a pillowtop mattress! We were very happy for our two-day stay. The only few things I didn't like were the low water pressure in the shower, the TV stations didn't all come in clearly,and I could hear the people in the room next to ours through the wall (not word-for-word; just muffled voices). I would stay here again, definitely!", "Date": "December 18, 2007"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Check in / front desk": "4", "Overall": "4.0", "Value": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Phoenix AZ", "Title": "“Great Stay for the Money”", "Author": "CynthiasBoys", "ReviewID": "UR8265845", "Content": "Stayed at this hotel for 4 nights in July. Had a great stay overall. Went with my mom and my 3 boys. The housekeeping did a great job at keeping our room nice, even when we left late in the day. They did, however, take my Cream colored Tommy Hilfiger bath sheet. They were able to retrieve it after a few days. The beds are comfy once you're settled and in them. They seem a bit wobbly while you're moving around. One downside, not the hotel's fault. The pool was always PACKED! Then at the end of the day it looked very cloudy. I hope they had someone cleaning and testing it daily with that amount of useage. Needless to say, we never had a chance to get it in, and on our last day I requested a little later check out so we could swim for a little bit and was rudely told by the front desk manager that \"check out is at noon!\". After I just spent 600 bucks for our stay at this hotel, I would have hoped for her to be a little more accomadating. Another thing, beware if you are tall! The shower heads are very short!! Never got to the continential breakfast, we were out so late each night, we didn't get up in time to catch it. Would be nice for them to have it available a little later in the morning. Nice hotel, good location, better value than some of the hotels in the middle of San Diego.", "Date": "July 31, 2007"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "oakland, ca", "Title": "“good value, don't expect luxury”", "Author": "CaVacationeer", "ReviewID": "UR6842891", "Content": "if you want a luxory hotel, go somewhere else. if you want a more than decent place to sleep and get a free breakfast, give this a try. PRO: free wi-fi worked just fine...no password needed, although the site does say it's for hotel guests only. our suite was spacious -- had two rooms & two TVs. the bathroom & a door separate the rooms, so some can watch TV while others sleep. refrigerator is counter-high. breakfast room is large and clean - 11 tables for 4. many food choices. 3-4 cold cereal, instant oatmeal, 3 kinds of whole fruit, variety of breads/pastry, coffee, several kinds of tea including herbal, 3 kinds of juice. one day they had hard boiled eggs. plenty of nearby stores & restuarants, including local/ethnic establishments beyond the typical chains. close to the freeway...had to make a u-turn to get into the parking lot, but never experienced any traffic problems. CON: bathroom had a noisy fan & small rust/stain on the tub drain. paper garbage in the exterior hallway was not picked up after 24 hours. We were missing a remote for 1 of the TVs, and when I got one, the battery in it was dead....we tried our own fresh battery & it worked fine. Plastic cups in the rooms...not luxurios, but at least I knew they were clean.", "Date": "February 26, 2007"}, {"Ratings": {"Cleanliness": "1", "Overall": "2.0", "Value": "1", "Service": "4", "Rooms": "2"}, "AuthorLocation": "Nipomo, CA", "Title": "“Not a bargain”", "Author": "cageytoo", "ReviewID": "UR5455938", "Content": "We stayed at this hotel for three days and switched rooms on the last day so we had the opportunity to see a couple of rooms and, to be honest, I was not impressed. Pros: Good breakfast (runs only 6-9:00am), helpful and cheerful staff very good insulation between rooms all rooms are suites (helpful for those with children) and have refrigerators, kitchen-type sinks (no disposal)and counters and microwaves. One of our rooms had a TV in each of the main rooms. Close to the I-15 freeway that will get you to most popular San Diego destinations in under 30 mins. Cons: This hotel is in need of renovation. The sheets were worn very thin and had stains Bedspreads were grimy and the underlayer had holes. The shower in one room leaked a black substance from the tap The shower in the other room had black substances in the tiles and a peeling (once glued on) mat that put a gelationous substance into my daughter's bath water. The rooms face a central courtyard with a pool that is very noisy at night (until 10:00 pm) while kids are playing. The pool was very cloudy and had multiple dark pieces of matter on the bottom. The water is very hard and left a residue on everything it touched. The internet was not working for all four days we were there. The freeway offramp is very busy and sometimes it took us 20 minutes to get from the beginning of the exit to our hotel (it was across the street from the hotel)", "Date": "July 11, 2006"}, {"Ratings": {"Cleanliness": "3", "Overall": "3.0", "Value": "3", "Service": "2", "Rooms": "3"}, "AuthorLocation": "San Francisco, CA", "Title": "“Bad Service, average hotel”", "Author": "writerevie", "ReviewID": "UR5368782", "Content": "The hotel was cleaner than I expected, although the pool was so murky, you could not see all the way to the bottom. I avoided using the pool the entire time I was there, which was four days. Housekeeping did a good job keeping the rooms neat, although the sheets did not feel entirely clean. My mom got a rash from the sheets, which she only gets when sheets are less than clean. I smelled cologne on one of the pillowcases one night, and since I'm female, I don't wear cologne. The worst service I experienced at the hotel was at check-in, when a woman (I think her name was Diane) was working the front desk. I walked in and waited while she finished her conversation with a coworker, before she turned to me reluctantly and asked what I needed. I told her I was there to check in, and she interrupted me midsentence to shout a response to the very same person she was joking around with earlier. She then proceeded to put me in a room with a king bed, when I had requested a room with two double beds when I booked four months ago. Best part was, she neglected to inform me. My parents, cousin, and I went up to the room, walked in, and realized we were given the wrong room type. I went back downstairs, had to wait for her AGAIN, then informed her that I had booked a different room. THEN, she decides to tell me that none were available, but that she would make a note in the computer now and make the changes tomorrow. Shouldn't she have made the notation in the computer when I checked in? And shouldn't common sense and courtesy require her to inform me of the change in rooms and offer an apology for the inconvenience? I didn't get any of that. Instead, I was made to feel that I was inconveniencing her for making her do her job. The next day, I called to request a room change, and someone else was working the front desk. She was great and made the change immediately and with politeness. Management should take a closer look at who they choose to staff the front desk. First impressions are lasting, and because of this experience when I first checked in, I probably wouldn't stay here again.", "Date": "June 21, 2006"}, {"Ratings": {"Cleanliness": "3", "Overall": "3.0", "Value": "4", "Service": "3", "Rooms": "3"}, "AuthorLocation": "los angeles, ca", "Title": "“medium quality with some issues”", "Author": "quickjaunt", "ReviewID": "UR5017019", "Content": "Stayed there April 2006 for 72.00/night after I found a lower price on hotels.com. Also got the 10% off lowest rate which was pretty nice. However, when I checked in, they had no record of the updated lower price. Make sure you print out the email or else you will be out of luck. After that was straightened out the next morning, things went ok. Room was like a budget Embassy, with a refrigerator, sink and microwave in the living area. King size bed was nice, bathroom was small. There was a lot of noise from the swimming pool and kids running around. Apparently, many people complained when I called the front desk and said they were taking care of it. Breakfast is free- muffins, cereal, toast juice- Nothing special but its free. I am trying the Holiday Inn Express next month since it is in the same parking lot and will report back.", "Date": "April 28, 2006"}, {"Ratings": {"Cleanliness": "3", "Overall": "1.0", "Value": "1", "Service": "1", "Rooms": "3"}, "AuthorLocation": "Los Angeles, Ca.", "Title": "“Is this a joke?”", "Author": "A TripAdvisor Member", "ReviewID": "UR4970708", "Content": "Great looking hotel which masks the hell inside. Upon arrival, an attendant at the front counter asks me if she could help me with a mouthful of food. This not being the end of all things, I proceeded to check into the hotel. As my wife and I were walking down the hall to the elevator, kids were running rampant in the halls, yelling and screaming. OK, this probably will end at a decent time tonight. As we are trying to get out of the elevator, 5 kids nearly bowl my wife over, block the exit from the elevator and have to be told to move aside for our exit. ( Is there no control over the hotel's occupants?) We decide to go out and let things die down. When we get back, things seem quiet until about 3:00am. There is a huge commotion next door with banging, yelling, screaming about b*tch, w*ore, get out. I have to call the front desk who states the polic are on the way. Eventually, after an hour this dies down about 4:30am. My wife gets up to use the bathroom and the toilet overflows. I call the front desk who says they will send up a maintenance man to fix it. A few minutes later, a security guard shows up, hands me a plunger and walks off. This situation had gotten ridiculous. My wife wants to sleep in the car now. I convince her to stay until the morning and we get about 3.5 hours sleep as we are awoken by the loud noises next door again of which the police are called again on the same people. As we check out I inform the front desk of my opinion of our stay. They state they are really sorry, but some of the things are out of their control and they can't do anything about the pricing as we booked the stay through the internet. What a joke. I call the Director of Sales that day without a call back. I call again on the next day and finally get a call back the next day. I chat with the Director of Sales who states he will do whatever he can to make it up to me and will call me the next day. That call never comes. I am in the process of contacting him again......this place and this establishment obviously doesn't care one bit about the customer.", "Date": "April 13, 2006"}, {"Ratings": {"Cleanliness": "5", "Overall": "5.0", "Value": "5", "Service": "5", "Rooms": "5"}, "AuthorLocation": "Centralia, Wa", "Title": "“GREAT Overall”", "Author": "A TripAdvisor Member", "ReviewID": "UR4298692", "Content": "Recently stayed here with my family and found it super from the Location to the Amenities. Just North of San Diego we were able to get in and out of town missing a lot of the headaches and higher prices by staying closer. From I-15 we went down 163 to the Zoo and into Downtown San Diego. It was about a 15 minute ride to Sea World and then heading down Miramar Rd (South of the Hotel) it was about a 20 minute ride to the Beach at Torrey Pines. Shopping was easy to get to whether downtown at Horton Plaza or The Fashion Valley Mall at Friars Ave in Mission Valley. Being North we were also able to sneak out to Carlsbad to the Premium Outlets and Legoland!! Just across I-15 from the Hotel were shopping areas with Grocery store, Drug Store, Restaurants and a Movie Theater. We also saved quite a bit there in Mira Mesa as opposed to being closer in. Also available in the area were Subway, Starbucks and Coldstone. What a perfect place for a family to marshall from for forays into the area. We will be back. The Hotel was quiet and the pool and hot tub was clean. Great job great stay!! People had talked about the freeway noise but we were able to get an inside suite. The noise I heard when I listened for it actually sounded like ocean waves crashing (kinda weird but we've stayed at the beach many times and really the ocean isn't all that quiet). The breakfast was good and I enjoyed the quiet courtyard to read the paper and snack. Thanks and will stay here again!!!", "Date": "December 23, 2005"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "hesperia", "Title": "“A Bargain of a Price”", "Author": "caprincess11", "ReviewID": "UR4124288", "Content": "This is one of the best suites for the price that I have ever stayed at. The staff is pleasent and easy to work with.O and it is always very clean, which is HUGE for me! It is close to the freeway for easy access and so many places such as restaurants, movies, shopping almost across the street. You will not be dissappointed!!", "Date": "November 17, 2005"}, {"Ratings": {"Cleanliness": "5", "Overall": "5.0", "Value": "5", "Service": "5", "Rooms": "5"}, "AuthorLocation": "Montreal, Canada", "Title": "“Nice clean suites”", "Author": "Mist59", "ReviewID": "UR3808802", "Content": "We were very pleased by this hotel. We arrived at noon and our room was ready. The staff were professionnal, very helpful and resourceful. The room (which are all suites) was impeccable and very nicely decorated. The hotel looks new from the building to the furniture. It consist of a seperate bedroom with 2 double beds and a large TV and a living room with a sofabed, another TV, microwave and a very small fridge (with a tiny freezer compartment). Hotel has a beautifuly landscaped area where you'll find the pool and spa and tables and chairs. The hotel also has a small fitness Center. True that the hotel is very close to the Freeway, you must ask for a room away from the freeway and you'll enjoy this hotel as much as we did. We got the room at $90/night with their best rate garanteed (we had found it at $100 in another travel website so they lowered the rate by 10%). The only negative is the distance from the Hotel to San Diego or the beach (about 15 minutes drive) and it's only a continental breakfast (no eggs or waffles)", "Date": "August 26, 2005"}, {"Ratings": {"Cleanliness": "4", "Overall": "5.0", "Value": "5", "Service": "4", "Rooms": "5"}, "AuthorLocation": "San Francisco BayArea", "Title": "“Great place, we’ll be back”", "Author": "BioTek", "ReviewID": "UR3650628", "Content": "We had wonderful time at Quality Suites. Family of 4, 2 adults and 2 kids stayed for 5 nights during 4 of July weekend. Freeway noise did not bother us at all. Free parking, lots of stores and restaurants nearby. Breakfast was very good with lots of selections. Pool and Jacuzzi were refreshing at the end of the day. About 20 minutes to Downtown attractions, Legoland, La Jolla beach.", "Date": "July 9, 2005"}, {"Ratings": {"Overall": "1.0"}, "AuthorLocation": "Seattle, WA", "Title": "“No Quality at Quality Suites”", "Author": "scbsee88", "ReviewID": "UR3493572", "Content": "After reading the glorious reviews of Quality Suites in TripAdvisor.com we were looking forward to a wonderful stay. One walk through the lobby and we could tell something was amiss. The lobby's wallpaper was coming apart and showing some mold problem that the hotel was trying to remedy by blowing a fan on it. The rest of the property, although clean, was in desperate need of updating. When we entered the room, it smelled musty and was just not much of a welcome from Disneyland. The bathroom towel rack was broken and the best thing about the room was the hot water coming out of the shower and the fast, free wireless internet. Even the clientele, mostly single men associated with the military did not make the hotel seem family friendly. Our friends also checked-in later and commented that one of the rooms they passed through had an open door where men could be seen drinking. We checked out the next day and went to the Staybridge Suites down the road instead. That was more our cup of tea.", "Date": "May 23, 2005"}, {"Ratings": {"Cleanliness": "5", "Overall": "5.0", "Value": "5", "Service": "4", "Rooms": "4"}, "AuthorLocation": "Appleton, Wisconsin", "Title": "“Pleasantly Surprised”", "Author": "A TripAdvisor Member", "ReviewID": "UR3477191", "Content": "My husband and I just stayed at the Quality Suites Mira Mesa for 9 nights with our two young kids (under 5) and were pleasantly surprised. We found a rate through tripadviser of $70 per night with one night free, and expected a very basic hotel. The heated outdoor pool and hot tub were clean and in a private center courtyard, and the kitchenette suite was clean and roomy enough for 4 people. Location is excellent - easy access to I15 and a large shopping district is just blocks away with lots of family-friendly dining and shopping. We avoided rush hour and had no problems with traffic in any direction - 15 to 20 minutes to sites - zoo, Legoland, beaches, etc. Breakfast was basic (bagels, pastries, bananas, toast, juice and milk) but enough to feed the kids before heading out, and was better during the week than on the weekends. Traffic could be heard a little from our room, but it was not enough to wake up the baby or keep us awake at night. Would definitely recommend for families with kids - a real deal!", "Date": "May 16, 2005"}, {"Ratings": {"Cleanliness": "5", "Overall": "5.0", "Value": "5", "Service": "5", "Rooms": "4"}, "AuthorLocation": "Oregon", "Title": "“Great hotel for families”", "Author": "diveborg", "ReviewID": "UR3305059", "Content": "My family of 4, 2 parents and 2 kids, stayed here 3-21 to 3-24. The hotel didn't seem crowded even though it was Oregon's and Washington state's spring break. The good: All the rooms are real Suites. That means that the bed room is separated from the rest of the suite by a door. This is great for privacy. Each suite had a microwave, mini-refrigerator, and wet bar. Suite was kept very clean by housekeeping staff. Complimentary breakfast was quite good for a \"continental\" breakfast. Complimentary high-speed wireless internet access. Super easy to use if your laptop has Wi-Fi. Free parking (unlike most of the hotels in downtown San Diego) Good location for visiting both Legoland and San Diego attractions. Close to lots of family restaurants and shopping. Friendly staff Shower had good water pressure and lots of hot water. 2 double beds and a pullout sofabed meant that we got to sleep together while each kid got their own bed. Complimentary Happy Hour which included free beer, mixed drinks and wine. The EXCELLENT price I got using the \"Quick Check\" feature here on tripadvisor. It found me the great price on hotels.com even though I couldn't find it when I looked there. The not so good: Close proximity to the freeway meant that suites on one side of the property were a bit noisy in the bed room. We had such a suite and while the noise didn't bother me because I always wear earplug at night when I travel, it might bother some people. Ask for a room that doesn't back up to the freeway and it should be quieter. This isn't a luxury resort like a Hyatt or Marriot, but it is definitely a big step above a basic double bed room at most motels. I can easily recommend this hotel, especially for families with kids.", "Date": "March 27, 2005"}, {"Ratings": {"Cleanliness": "5", "Overall": "5.0", "Value": "5", "Service": "5", "Rooms": "5"}, "AuthorLocation": "San Jose, California", "Title": "“Best Hotel Bed We Ever Slept In!”", "Author": "A TripAdvisor Member", "ReviewID": "UR3193105", "Content": "We just spent a week in San Diego and chose this property because it was near where our relatives live. While in the north end of town, it only took us 15 minutes to get to Balboa Park. We had a one bedroom suite which had the most comfortable pillow top bed we've ever found at any hotel. The bedroom was comfortably snug and had an armoire which housed a TV, dresser drawers and place to hang up clothes (I recommend you bring your own hangers if you have a lot of clothes.) The living room had another large TV, wet bar, fridge, microwave, couch and arm chair with a desk and two chairs. The hotel is next to the highway but we didn't hear any highway noise. There are neighborhood restaurants a few steps from the parking lot, and across the highway is miles of shopping with lots of larger chain restaurants. I was also pleased to find Kinko's nearby as the wireless network cards were all given out and I didn't want to use the dial up in the room. This property is not exactly a destination resort, but is just perfect for a budget minded family vacation.", "Date": "February 15, 2005"}], "HotelInfo": {"Name": "Comfort Suites I-15 Miramar", "HotelURL": "/ShowUserReviews-g60750-d83895-Reviews-Comfort_Suites_I_15_Miramar-San_Diego_California.html", "Price": "$88 - $138*", "Address": "<address> <span rel=\"v:address\"> <span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">9880 Mira Mesa Blvd</span>, <span class=\"locality\"><span property=\"v:locality\">San Diego</span>, <span property=\"v:region\">CA</span> <span property=\"v:postal-code\">92131</span></span> (Formerly Quality Suites)</span> </span> </address>", "HotelID": "2515534", "ImgURL": "http://media-cdn.tripadvisor.com/media/ProviderThumbnails/dirs/ca/90/ca90e4d2e813f8b30a691f7eac1b5a955large.jpg"}}