{"Reviews": [{"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "2", "Sleep Quality": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "USA", "Title": "“Fine enough, but have had better in Paris.”", "Author": "caringmom", "ReviewID": "UR127100331", "Content": "This hotel was lovely - well appointed - but for how our visit went, I would not rate it above a three star and would say it was highly overpriced. First, many will say the rooms are small. Normally this does not bother me at all. Rooms in Europe are small. You deal with it. Also, these rooms are decorated in a lovely way and very modern and as efficient as they can be. However - I don't like having the toilet in a closet on one side of the room and the shower and sink in a closet on the other side. When going to the bathroom, you have to then open the one door, cross the room, and go wash your hands in the other closet. ICK. The beds were very comfortable. Breakfast was fine but NOT included and priced at an extremely hefty 20 Euros. Do yourself a favor and walk a block and grab coffee and croissants around the corner for 3 Euros. Delicious. What really brought the star rating down was the technical service. First the wifi is completely horrible and totally unreliable. It was always going out - and I see this is a regular problem from other posts. We were there for business - and they cater to business travelers. A hotel like that MUST have reliable wifi and these folks just don't. They were very unsympathetic to the issues. Further, our safe broke twice. It just would not open. They seemed to imply at first that we broke it. Um. No. Then, after the second time I was told that I had to be present for them to open it, and it could only be done by one person in the afternoon, but before 5. So - on my one tour day in Paris, I had to come back to the hotel in the middle of the afternoon so they could open the safe to get my passports etc. Then I was told to not close it/use it again and was offered no alternative on where to store my valuables. Such a shame their service was so lacking there. The folks that work there are nice enough. The area is very convenient (though many many students as directly across from Sorbonne). A very short stroll to the wonderful Luxembourg gardens and an easy distance to the Seine, St. Germaine, and a number of metro stops (bonus- the train from the airport stops a block from the hotel without any station changes). In short - for what it costs, I suppose you are really paying for location, because other than a very comfy bed, and generally nice fixtures - nothing else (like breakfast, security, internet) really seemed to live up to the price.", "Date": "April 1, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Malta", "Title": "“Paris”", "Author": "ozzyMalta", "ReviewID": "UR126590152", "Content": "Excellent service. staff and location. Rooms were also very good and breakfast was included in the price which is rare in Paris", "Date": "March 24, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Cape Town Central, South Africa", "Title": "“We will certainly stay there again”", "Author": "MizzTiff", "ReviewID": "UR126137358", "Content": "My husband and I did a brief 3 day trip to Paris in September 2011, we found the GHSM online and alreayd online we knew it was going to be better than most hotels we had looked at. It was a 4 star that actually had a shower! Which from research I had found to be rare in Paris. The hotel staff were very efficient and super friendly. There was not a request made that could not be answered, their understanding of English was fantastic. We stayed in a Classic room, they were the cheapest, and they were small yes, cramped, I would not say so much, but we have never really minded small spaces, but let's face it... it's Paris. The days are spent out in the sun, walking around and sight seeing. The size of the room was not a problem for us. The bathrooms were super funky and comfortable and the hotel is clean, the reception is beautifully decorated. As far as location is concerned, this hotel is perfect, in the heart of the Latin Quarter, and very close to the Notre Dam, about a 10min walk, and also to the Louvre (stunning) about a 15min walk. And from there cabs are easy to get, or you can just walk everywhere, like we did. I can also highly recommend the \"Gratinated Onion Soup\" on their room service menu! We actually had it both nights we were there, it was that good!", "Date": "March 15, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Fujairah, United Arab Emirates", "Title": "“Lovely Stay with Personal Touch”", "Author": "fuj13", "ReviewID": "UR124374378", "Content": "Coming to Paris for the first time, this hotel (and the welcoming staff) make my visit as lovely as it can be. Beautiful neighborhood, welcoming attentive staff, warm decorated rooms are what I have encountered during my stay. Don't miss the opportunity to stay in this hotel.", "Date": "February 10, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Barcelona, Spain", "Title": "“Best of the best”", "Author": "Martinez M", "ReviewID": "UR124311759", "Content": "I came to Paris for 4 days with my boyfriend. And the only thing I can say about this hotel is that it is one of the best hotels ever. The staff was really very helpful. Especially those from the reception with shuttle bookings for airport, tickets for lido, moulin rouge, information about the city and so on... The room was quite small but with nice decorations. We also enjoy the fitness and the steam-bath which are private use and free of charge. We definitely recommend this hotel to everyone who want to be treat well !", "Date": "February 8, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "3", "Sleep Quality": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "London, UK", "Title": "“Modern hotel in great location; helpful staff”", "Author": "JakobLHR", "ReviewID": "UR123956206", "Content": "I was at this hotel for a short weekend break, meeting up with some family/friends. A very typical French hotel with all amenities, though rooms were on the small side. The hotel looks like it is in quite an old building - but rooms very modern and stylish. Hotel breakfast was very good, and the check-in staff extremely helpful in terms of restaurant recommendations, ordering an airport taxi, etc. I think this hotel is fairly expensive, however the location makes up for it (and hotels in Paris are, on the whole, very overpriced in my experience!). If you enjoy exploring Paris on foot, this hotel will make a perfect base. Also, please ask the hotel staff for local restaurant recommendations - they were very helpful in this regard. Location tip: make sure to visit the Patheon (maximum 5 minutes' walk from hotel). A surprising and interesting 'national monument' that everyone should visit.", "Date": "February 1, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "3", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Chester, United Kingdom", "Title": "“Paris Weekend Break”", "Author": "Gordon C", "ReviewID": "UR123933029", "Content": "Hotel was really good with helpful staff, well appointed room - rooms are small, we had booked a superior room, but this is typical of Paris. The hotel is in an excellent location, easy walking distance to Notre Dame, also very close to the RER train stop Luxembourg for the Airport. Breakfast was lovely. No hotel bar or restaurant but plenty of local Bistro's. Hotel staff recommended a local restaurant called Corsi - you need to book for a saturday night. Due to the exchange rate £/€ Paris is pricy but still one of the best cities in the world.", "Date": "January 31, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Jersey City, New Jersey", "Title": "“Clean, Modern, Comfy hotel”", "Author": "romcat1106", "ReviewID": "UR122541482", "Content": "We stayed at the Grand Hotel from 12/25 - 12/31 in room 504. For our first trip to Paris in 2009 we stayed in the Marais at the Hotel Caron de Beaumarchais which was great for the location but our hotel room was super small. In that hotel room our suitcase took up valuable floor space and we were constantly tripping over each other. For the most part hotel rooms are small in Paris, but for our 2nd trip we wanted a bed at least the size we normally sleep in. At the Saint-Michel the room was also small but we got an actual Queen sized bed which was very important to us. Being from NYC the room size was do-able and we could fit one suitcase in the closet and another in a corner so it wasn't so cramped. ***PROS*** -Location. You're close to Luxemborg gardens and the Metro -Large and Comfy Bed. We slept really well here. -Closet Storage -Flat Screen TV -Small Balcony -Nice friendly front desk service ***CONS*** -The tub was a bit high to step in to and the glass panel tricky to open and close. *Tip - I was unaccustomed to the shower/faucet option, you have to pull on the hose to change it. -We did have a problem with the key card for 3 days of our stay, it seemed to be after the maid serviced the room. -Around 1-2pm they restock the fridges and if you're taking a siesta you'll hear slamming doors. All and all nothing major to complain about and we had a great stay. I'd definitely recommend this hotel and stay here again.", "Date": "January 4, 2012"}, {"Ratings": {"Service": "1", "Cleanliness": "5", "Overall": "1.0", "Value": "1", "Sleep Quality": "5", "Rooms": "4", "Location": "3"}, "AuthorLocation": "New York City, New York", "Title": "“theft from my room”", "Author": "Robert C", "ReviewID": "UR122472709", "Content": "While the staff was helpful and friendly, I purchased three ties from Hermes in the beginning of my trip. When I packed to leave, the ties were not to be found in the room. I immediately went to the desk to alert them. Given the time at night, they could not contact the cleaning staff, whichh was understandable. In the morning when I left the hotel, I reminded the desk and i gave them all of my contact information. i was told they were going to get to the bottom of it and email me to follow-up. After three days, I did not hear from the hotel. I called and they told me they knew nothing about the ties. They were expensive--$600. They did not leave the hotel room. They were in bright Hermes packaging. they could not have been accidently disposed. They were stolen by the cleaning staff. There is no other explanation. i would caution anyone from staying at this hotel.", "Date": "January 3, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Montreal, Canada", "Title": "“Beautiful, chic, clean hotel in amazing location”", "Author": "goodthingsinlife5", "ReviewID": "UR121319033", "Content": "My husband took me to Paris for a surprise birthday trip. He agonized for weeks over choosing a hotel/location to stay in the huge city of Paris. What a great choice he made. The Grand Hotel Saint-Michel was perfect...absolutely perfect. The front desk staff were fabulous, so helpful, so friendly. Although we could speak French, we saw them talking with dozens of other guests in English...and always with a smile, a map...a written note to help. They helped us navigate the subway and busses as we went to some rather off-the-beaten path restaurants and on one day...a huge Parisian flea market! The room was chic and elegant. All black, grey, white and trendy. Big comfy bed with pristine white linens and duvet. The bathroom was ultra modern with a stunning shower and sink. Overall the room was very small but hey, its Paris!! The street was quiet, no noise at all. The room was spotless...and this is a comment from a neat freak! The location was superb. It is located a block from the Pantheon, two blocks from the Luxembourg gardens and a 5 min walk from the university of Paris and all the awesome cafes, bars and restaurantsthat go along with that cool vibe. A 10 to 15 minutes walk and you're standing on the bridge crossing over to the Notre Dame church. The free Wifi allowed us to surf the net between afternoons of sightseeing and evening at cool restuarants and bars...Google maps was our friend!! When we left to come home, we discovered at the airport that we forgot a few teratsures in our room (unique ones that we had bought at the flea market). We contacted the hotel and within no time at all...they mailed our beloved treasures to our home in Canada!! By far one of (if not the best) hotel experience we've ever had.", "Date": "December 2, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Chicago, Illinois", "Title": "“Very clean, convenient location, excellent value for your money”", "Author": "RiseAndFly", "ReviewID": "UR121210714", "Content": "Very clean. Quiet street. Convenient location. Saint Michel Blvd just around the corner. 5 mins walk from Metro. Apprx 10 mins walk to the Latin Quarter and Saint-Germain-des-Prés. We actually did walk to Notre Dame and Louvre as well. Very comfortable beds. Nice breakfast buffet. Hallways and rooms are rather small, but quite acceptable for older European buildings. Excellent value for your money. We would definitely stay here again.", "Date": "November 29, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Vancouver, Canada", "Title": "“Super, small hotel near Pantheon”", "Author": "Carol_Siriusb", "ReviewID": "UR120939921", "Content": "This is a recently refurbished hotel on the Rive Gauche. We usually stay on the Rive Droit and wanted to try a different neighborhood. The room is a decent size for this price range in Paris. The bed was particularly nice - thanks to the full refit on an old hotel. A very good, new mattress and a great night’s sleep. There are some really hard, old, or super squeaky beds in this town and I have slept (or not) on a number of them. The memorable hotels are the ones with decent sleeping. The neighborhood is fine.. two blocks from the Pantheon, nice normal neighborhood shops, boulangerie etc. as well as decent restaurants. (see reviews for the Cafe Malongo and Pub Saint-Germain) There are a number of OK restaurants right around the corner on Place de la Sorbonne. We did not eat breakfast at the hotel but can add that the staff was helpful and fun to talk to. The furnishings in the rooms are cool colors and simple lines... large flowers are painted on a scrim hanging in front of the wall - created a light, airy feel - quite different. The bathroom was Italian modern - always a good thing! A nice tub and a full shower with some glass wall. Room temperature control worked well and the room was pretty dark and very quiet at night. The window opens on to Rue Cujas which is a nice quiet side street off Boul St Michel. We thought this hotel was well priced at E225 and a good deal and would stay here again.", "Date": "November 23, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Cambridge, United Kingdom", "Title": "“Fabulous boutique hotel”", "Author": "Greg B", "ReviewID": "UR120347586", "Content": "We spent a long weekend in Paris with friends and loved the hotel. The room was stylishly decorated with an amazingly comfortable bed, an ultra modern spotless bathroom and flatscreen TV. The breakfast was fantastic with a huge selection on offer and amazing wall mural. All in all we thought the hotel was excellent and would definitely stay there again.", "Date": "November 8, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "5.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Manhattan", "Title": "“Continued Delight”", "Author": "Vagabond_Pilgrim", "ReviewID": "UR119959011", "Content": "After spending a night at this hotel, we decided to return for a weeks stay in Paris during mid-June 2011. This time we booked a room with a small terrace, which was very servicable for cocktails overlooking de l'Université Paris-Sorbonne. Due to its central location the hotel was convenient to almost all parts of the city. We walked just about everywhere including Tour d'Eiffel. The bathroom was generous (compared to the bathrooms of the smaller rooms). It contained a whirlpool tub overlooking the mansour roof de l'Université Paris-Sorbonne. The water closet was in a separated room from the bathroom, which was very convenient. There was one draw back, the air-conditioning. One evening it was extremely hot and the air-conditioner for the room could not cool the room sufficiently. The staff was extremely nice and helpful. By the by, if you opt for a more expensive room; bargain with the reservationist. I was able to get a reduced price and the breakfast on a daily basis.", "Date": "October 31, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "3", "Location": "4"}, "AuthorLocation": "New York City, New York", "Title": "“very good hotel in the Latin Quarter”", "Author": "photraveler7", "ReviewID": "UR119691331", "Content": "My wife and I stayed here for 7 nights in September, 2011. I would recommend this hotel, but would suggest getting a room that's larger than the basic one. The bed was very comfortable, but there was not enough space for 2 people to navigate the room. We were lucky enough to get a balcony on a higher floor with great views of The Sorbonne. We had to ask to borrow an iron from the front desk, which should not be necessary in a hotel at this price level. The hotel is conveniently located, but not right near a metro stop. It was nice being 3 minutes from Luxembourg Garden. The staff was always helpful when we needed anything, and suggested as well as booked a shuttle bus to the airport.", "Date": "October 24, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "", "Title": "“Nice boutique hotel”", "Author": "trinab281", "ReviewID": "UR118912338", "Content": "The hotel was very clean and modern with nice bathrooms. The beds were super comfortable. The rooms are tiny but we did not come to Paris to spend time in the room. I thought the breakfast was overpriced and disappointing in quality. The hotel is about a ten minute walk from the Luxembourg RER stop which is on the direct line from Charles de Gaulle airport.", "Date": "October 3, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Sydney, Australia", "Title": "“Lovely hotel in great location”", "Author": "SJandKK", "ReviewID": "UR118807266", "Content": "We stayed here for 4 nights and loved it. The staff were incredibly helpful and friendly and the room - although TINY - was very well designed and well presented. It was my husband's first time in Paris and this hotel was the icing on the cake of a great trip. The location is brilliant - well within walking distance of some great restaurants, bars and attractions and there is a fabulous restaurant a few doors down - Le Cosi. Thoroughly enjoyed everything about our stay here and would definitely recommend!", "Date": "October 1, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Melbourne, Australia", "Title": "“Great Hotel”", "Author": "Jay W", "ReviewID": "UR118736502", "Content": "this was a great hotel, lovely staff and nice and central close to the Louvre and Eiffel Tower. Rooms are beautiful, pillows are soo comfortable, had the best nights slight.", "Date": "September 29, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Tucson, Arizona", "Title": "“Modern Elegance”", "Author": "suzieintheoldpueblo", "ReviewID": "UR118375390", "Content": "This hotel does Paris justice, with its modern decor, comfortable beds, and a location close to everything. We especially enjoyed the buffet breakfast, which was expansive and delicious. They had FRESH orange juice, smoked salmon, eggs, an array of baked goodies, and the server brought your tea, coffee or fresh breakfast. It was a gourmet feast. Unfortunately, it was expensive, so if you can get a deal with breakfast included, go for it. The front desk staff was also quite helpful. This was my first trip to Paris, and if I get to return I would stay here. One caveat is to make sure the folding glass shower door is closed, or water will leak all over the place. If there is rain and you don't want to go far to eat, there is a Chinese restaurant across the street with excellent food and around the corner is a bistro with excellent pizza and burgers.", "Date": "September 20, 2011"}, {"Ratings": {"Location": "5", "Overall": "5.0", "Value": "5", "Service": "4", "Rooms": "3"}, "AuthorLocation": "Liege, Belgium", "Title": "“Great place to be !”", "Author": "Cecile1965", "ReviewID": "UR118100991", "Content": "A wonderful hotel ideally located in the wonderful \"Quartier Latin\".The rooms are very small but clean and nicely decorated, the staff is helpful and friendly, and our stay was really pleasant. I really recommand this hotel!", "Date": "September 14, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Houston, TX", "Title": "“Great Hotel -- Great Experience”", "Author": "MWN", "ReviewID": "UR117679472", "Content": "We stayed here (along with 3 other friends), unfortunately just for one night as we were returning from a cruise in another part of France and headed back to the US. All 5 of us loved the hotel. The staff was extremely helpful, friendly and spoke excellent English. They recommended a great restaurant for dinner around the corner and made the reservations for us. They also arranged for a taxi to the airport to accommodate all of us very early the next morning. They also responded immediately to an e-mail I sent upon our return inquiring about some sunglasses we were missing. We thought the area was great and enjoyed a nice afternoon walk. The rooms were quirky with very modern decor and very comfortable and basically just FUN! We had an upgraded room on the 1st floor that included a great bathroom. We will definitely stay there when we return to Paris again, which we do several times a year. This is a \"gem\"!", "Date": "September 4, 2011"}, {"Ratings": {"Cleanliness": "3", "Sleep Quality": "2", "Overall": "3.0", "Value": "3", "Service": "3"}, "AuthorLocation": "Toronto, Canada", "Title": "“The location was good.”", "Author": "Karen E", "ReviewID": "UR116471643", "Content": "We stayed at the hotel for 5 nights with our teenage son. We enjoyed the location and the front desk staff were courteous and helpful. The rooms were small and in particular the bathrooms were very small. There was a particular musty scent in our room. The maintenance person said that it was from the air conditioning unit, however we are wondering if it is from water seepage under the front hallway carpet. We discovered that on one occasion, the water from the shower head had spilled out of the shower onto the bathroom floor and out into the hallway carpet. The restaurant was nice for breakfast. Not sure we'd stay here again.", "Date": "August 9, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "3", "Service": "5"}, "AuthorLocation": "Rosemead", "Title": "“A great location”", "Author": "Ellen085", "ReviewID": "UR116126857", "Content": "This hotel in the Latin Quarter was a perfect location for us, across from the Sorbonne and walking distance to Notre Dame, the Pantheon, the Luxembourg Gardens, the Louvre and Orsay museums. We stayed a week and thought the room was very expensive for such a very tiny room, but that seemed to be typical in Paris. The bathroom fixtures were very clean and modern, the T.V. was flatscreen and we had a nice view of the top of the Pantheon and the Sorbonne. Service was great and we had lots of help making dinner reservations and getting advice. Breakfast had a lot of choices, including smoked salmon, but gets expensive if you have more than a croissant and alas, there was no brewed decafe coffee.", "Date": "August 1, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "4.0", "Value": "4", "Service": "5"}, "AuthorLocation": "FL", "Title": "“An excellent choice for us.”", "Author": "kdscarboro", "ReviewID": "UR115685263", "Content": "I found this hotel on Trip Advisor site and we were not disappointed. It is a lovely small hotel, located on the Left Bank about two blocks from Luxembourg Gardens. Although the room was very small, the bed was large and very comfortable. The hotel is very modern and very clean. The staff quite friendly and helpful. We opted to have the continental breakfast at the hotel most mornings for the convenience, and enjoyed the lovely little breakfast room.", "Date": "July 23, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "", "Title": "“Phenominal”", "Author": "TanaLeah", "ReviewID": "UR115561688", "Content": "Absolutely exquisite experience at this boutique hotel. Within walking distance to everything, we enjoyed every moment of it's services and it's geographical location. As a commercial interior designer, I am most particular regarding ergonomics and design of hotels and found this one nothing short of spectacular. The staff went over and above what was required of them to aid us in enjoying our stay. Not a singular thing to say in a negative light about this beautiful place. And the bonus was it was so much less money than the majority of hotels within the popular neighbourhood.", "Date": "July 20, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "5", "Overall": "4.0", "Value": "4", "Service": "4"}, "AuthorLocation": "Dunfermline, United Kingdom", "Title": "“Lovely hotel, excellent location, helpful staff”", "Author": "FeeFeeJ", "ReviewID": "UR113199536", "Content": "Enjoyed a long weekend at this hotel in a triple room which was surprisingly spacious, bed was very comfortable and room facilities were good (except there could have been a large mirror within the bedroom above the vanity unit - 3 women and 1 mirror in bathroom not great). Good choice at Continental breakfast plus some hot dishes, staff on reception were very friendly and helpful, they booked us a show at the Moulin Rouge and we got front row seats. Location if fab, only a 10 min walk to Notre Dame through some lovely streets packed with shops and restaurants - would definitely return to this hotel next time I am in Paris", "Date": "June 13, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Service": "5"}, "AuthorLocation": "canada", "Title": "“Wonderful boutique hotel”", "Author": "alpenmicho", "ReviewID": "UR112257027", "Content": "We stayed at Grand Hotel Saint Michel for 4 nights in May. We payed 215E per night for the basic room and were upgraded to a beautiful deluxe room upon arrival. I think for the price we paid the room was wonderful, but I don't think I could pay the 400E it is priced at, but you know...upgrades make for very happy customers! We had a 6th floor room quite spacious for Paris standards, with a bit of a entry/hallway and it looked like it had been recently renovated. The shower/sink room was modern and shower spacious. The water closet/bathroom was just across that little hall. My primary concern in a hotel, the bed, was really comfortable....firm but soft. Hotel had a fairly large elevator which could easily fit 4-5 people, again for Paris standards big! Decor is really cute...modern but cosy and warm still. Each room has a mural. Ours had a giant beautiful flower, not too overpowering. We had lots of big bright windows. Staff was very proficient and someone was always at the desk for help with questions. The hotel was very quiet. It felt like we were the only ones there at times. I think I saw 2 other couples the whole time I was there. Room was always clean. Free wi-fi was greatly appreciated. No complaints really! Luxembourg RER stop was very close but please be aware RER service stops earlier, like 11 or 12am, than the metro. We took the RER back to the airport on a Sunday morning and it was pretty effortless and cheap! If you are arriving with luggage, one of the Luxembourg exits has an escalator up...not sure which one...but if you have luggage you might want to locate it. The hotel is in a great location around the latin quarter and St. Germain. It itself is on a quiet side street. There are tons of restaurants around and the area by the Seine, about a 10 minute walk, is very lively late into the night. It is up or down, depending on which way you are going, a bit of a hill...let's say compared to the 1st arrondisment/ Louvre area which is very flat. We walked to the Louvre in about 25 minutes.....and I'm seriously not fit. The farthest part of Ile Saint Louis is also probably a 20-25 mins walk. There is a great restaurant we tried out on our last night...just down the street called \"Le Cosi\". Best meal we had of our trip!", "Date": "June 8, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Cambridge, MA", "Title": "“Modern, clean, convenient, and roomier than expected.”", "Author": "A C", "ReviewID": "UR108983521", "Content": "In late September-early October we stayed for 7 nights at the Grand Hôtel Saint Michel. We did our research here on Tripadvisor and were pleased that the positive reviews were accurate. This is a sweet little hotel, well appointed in a terrific location. We had a “Classic” double room, on the corner the 4th floor with a lovely view. The bed was extremely comfortable and the bath was spotless. We were especially happy that the shower had excellent water pressure and plenty of hot water. Our room did not have a bath tub (which was fine with us). The rooms are modern and stylish and include some clever storage. I found the size of the room to be generous for European standards. This was our first trip to Paris and we found the location to be terrific for our needs. It’s quite close to the RER Luxemburg station. We took the train from the airport and had no issue rolling our luggage to the hotel from that stop. We are very active and found this location to be a great hub for our day tripping needs. While the train is convenient to the hotel we chose to walk. We walked *everywhere* from here- the Eiffel Tower, Rue Mouftard, The Louvre, Champs Elysées, etc. The nearby parks are excellent for people watching and picnics. The hotel staff was pleasant and very helpful. They arranged our taxi for the return to the airport. Check-in and out was easy. At some point in the night the hotel entrance is locked. If you’re out very late you’ll need to ring a bell to be let back in. We didn’t realize this and were slightly panicked on Nuit Blanche, an all-night arts and cultural festival, but the manager on duty came to the door in less than a minute. We had a wonderful trip and this Grand Hotel Saint-Michel really worked for us. We wouldn't hesitate to stay here again. One caveat for light sleepers: The hotel is in a neighborhood with a vibrant student life. And these students occasionally stay out late, drink a lot, and make a racket when the bars close. We live in a city and didn’t find the noise level bothersome and even left the windows open overnight. I’m certain people accustomed to a serenely quiet sleeping environment would be highly stressed managing the noise.", "Date": "May 19, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "London", "Title": "“Ideal location & very pleasant stay”", "Author": "jagzy_78", "ReviewID": "UR93314050", "Content": "I booked this hotel (for 1 night) as part of a surprise birthday treat for my wife. Luckily I found a good deal for a superior room via www.booking.com I always use Trip Advisor to insure hotels are worth selecting. Saw a couple of negative reviews on here, so I wasnt 100%. However, when we got to the hotel I was certainly reassured. At the time of checking in, i request the room with a queen bed instead of the other option (twin beds) and they gave us a complimentary upgrade. Breakfast wasnt included, however on the Tripadvisor page for the hotel, there is a link to a free breakfast. I submitted my two vouchers, and the two ladies at reception were happy to accomodate. The only reason i have rated this hotel very good instead of excellant and 4 out of 5 stars for value is because the breakfast wasn't a great deal of choice as so in my opinion it should really be included and secondly the wireless internet connection speed wasnt that quick. Otherwise, its perfect!!", "Date": "January 17, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "3", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Leesburg, Virginia", "Title": "“great location; very large and comfortable bed; extremely clean”", "Author": "JES_Leesburg", "ReviewID": "UR89776949", "Content": "Wife and I stayed here for five nights while I was on a business trip. Hotel is two blocks from RER B line's Luxemborg stop; which is the line direct to / from CDG. As described elsewhere, rooms are small, but very neat and clean. Bed was WONDERFUL and king-sized. We were in the next to lowest room level. Many informal restaurants nearby; nice 1/4 mile walk down to the Sein and Nortre Dame and all of the shops / restaurants in the Latin Quarter.", "Date": "December 13, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Mexico City, Mexico", "Title": "“great stay”", "Author": "marsanmuj9", "ReviewID": "UR85856142", "Content": "the location is fabolous, the rooms are modern, very clean and confy, the staff is very helpful..", "Date": "November 3, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Toronto, Canada", "Title": "“Cozy room in a great location”", "Author": "Tashathecat", "ReviewID": "UR84013001", "Content": "Just returned home from a 5-night stay at The Grand Hotel Saint Michel. The size of the room was very small, but having been to Paris twice before, it's pretty typical for this area. The bed was exceptionally comfortable (I think there was some kind of memory foam topper on it) which was a welcome surprise. The shower was great, too, as our room had a giant \"rain\" shower head. The room was clean and the linens were modern and boutique-like. The hotel is located around the corner from both the Pantheon and the Jardin de Luxembourg (a gorgeous park). It's easy walking distance to Notre Dame and the Louvre (we walked it daily). There is also lots of shopping and tonnes of restaurants in the area. After reading other reviews we did not try the hotel's (reportedly expensive) restaurant. there are so many great places to grab a bite close by, there was no point staying in! The only small disappointment was that the mini-bar was not included in our room price (although it stated that it was on the web site--we checked). Apparently that policy was recently changed, but they have not updated their site. Overall, I would recommend this hotel as a good place to stay.", "Date": "October 18, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "3.0", "Value": "3", "Sleep Quality": "4", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Seattle, Washington", "Title": "“Good Location, very tiny rooms, with expensive breakfast”", "Author": "justoneraj", "ReviewID": "UR83606778", "Content": "PROs: This was a good hotel in terms of location, and boasts a very modern interior design. The rooms were clean and well maintained. The front desk was very pleasant and gave us good information and recommendations for activities in the surrounding area. We walked to many restaurants and attractions frequently, and felt quite safe doing so. CONS: The room we were in was VERY small. There was only about 3 feet of clearance between the bed and the walls. The sink and shower were in the main bathroom, while the toilet was in a smaller bathroom across the room. This would have been ok if there was a sink with the toilet. Nothing serious, just awkward to walk across the room to wash up. The breakfast is divided into two options. the 10 Eu continental, which comprises of only some baked bread, croissant, cup of juice and cup of coffee. Then there is 20 eu buffet which is much better, with meats etc... However, in our entire trip to Europe this was the most expensive breakfast by far. Better breakfasts than their continental were free in many places, else, the buffet level breakfast was about 10-14 Euros.", "Date": "October 15, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "3", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Manchester", "Title": "“As promised, an excellent stay....”", "Author": "stash212", "ReviewID": "UR80981597", "Content": "Just returned from a lovely three night stay at The Grand Hotel Saint Michel, everything the reviews promised were correct. Obviously the size of rooms at any hotel within historic Paris are a concern but this was fine, the weather was excellent over our three days so the mini bar and air conditioning definately came in handy. We booked a superior room with a very large king size bed, the room came with a nicely decorated bathroom and all modern amenities. The purple and white colour decor can get a little getting used to but other than that our stay was perfect. The hotel is located literally 30 seconds from jardin de Luxembourg a famous park located in the Latin Quarter of the city. The hotel is easily located from the aforementioned Luxembourg RER station and only three stops away from Gare Du Nord. It was our first stay in Paris and the Grand Hotel Saint Michel certainly helped to make it a trip to remember.", "Date": "September 25, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Perth, Australia", "Title": "“Fantastic Location and excellent Rooms and Staff”", "Author": "BarefootTraveller2", "ReviewID": "UR79204724", "Content": "After much searching for a hotel that was well located but just off the tourist track so as to be quiet, we found Grand Hotel St Michel. This hotel was fantatsic! It was well located near Sorbonne University and only a short 5 minute walk to St Michel Metro and Boulevard Saint Germain. The staff were very friendly and helpful and nothing was any problem for them. They will book restaurants, tours, taxis for you. The rooms were very clean and tidy andnew and modern with funky showers and bathrooms!! Our room was not overly huge but the bed was comfortable and we had a plasma TV an small desk as well. We would definatley stay here again!!", "Date": "September 12, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Sleep Quality": "4", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Houston, Texas", "Title": "“Lovely gem”", "Author": "TLWhite", "ReviewID": "UR76694608", "Content": "My husband and I brought our 6 year old daughter to Paris the first week of August. We stayed 3 nights at the Grand Hotel St Michel and were overall pleased with our stay. The location was great, just a 5 minute walk to the metro and a 10 minute walk to the Seine and Notre Dame. There are plenty of great restaurants (Chinese restaurant directly across St from hotel was delicious) within a short distance from the hotel and lots of fun shops nearby. Luxembourg gardens was a 5 minute walk away as well. Our room on the second floor was well appointed, the bed was quite comfy, the roll away brought in for my daughter worked out well, and the wi-fi worked fine. The Thierry Mugler bath products were a treat. Quirks about the room: hair dryer attached to wall in closet with no mirror, toilet in tiny closet across room from bathroom, shower/tub door was tricky and I ended up flooding the bathroom on day one, no iron in room. I only wish we'd had a room facing the street instead of the courtyard out back. The staff was courteous and upon check-in offered us an upgrade to the junior suite. Before we could answer they offered to show us first (I'd already read comments about this funny room so I was quite apprehensive from the start). It was through an unmarked door just up a few steps off the lobby. While the jr suite was large, it was on the bottom floor and the only window looked out onto a tiny, dark patio. It was quite awkard and I immediately felt claustrophobic and had to get out of there. We opted for the smaller room upstairs and waited just an hour for them to clean it. We were able to access our room before noon which was greatly appreciated after coming in from the all night flight. We didn't eat in the hotel restaurant but it was pretty and the lobby is beautiful.", "Date": "August 24, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "3", "Sleep Quality": "5", "Rooms": "2", "Location": "5"}, "AuthorLocation": "Belfast, United Kingdom", "Title": "“Lovely location.....impractical room design”", "Author": "Hols3", "ReviewID": "UR72784293", "Content": "Firstly I researched our hotel choices widely. We have been in Paris a few times before and the choice was narrowed because we needed a triple room and we booked later than usual. The hotel is in an absolutely fantastic location! The foyer and room was spotless....felt I could take my shoes off and feel comfortable as soon as I arrived. No problem with check in-all correct and dealt with in a quiet efficient manner:) Our room was on the first floor overlooking the \"courtyard\" which is really just the back of the hotel with no view at all. It is private and very quiet but could feel a bit oppressive if you were so inclined. The decoration is boutique which may be ok on the brighter upper floors but deep red is not so good when there is not a lot of light. The rooms are VERY small but I honestly think if some things were changed with design it would help. There should be a seperate light in the small foyer area at the wardrobes so that all the room lights dont have to be on when trying to find your clothes. The wardrobe hangers should be side to side and it would make it a lot easier for three adults to find things. The bath needs some sort of rail/bar as the sides are very high on the bath and this could be a safety issue. Bottled water should be provided free in a four star hotel and tea and coffee making facilities should be in the room. The plugs for use above the desk desperately need a mirror as there is nowhere in the room to apply makeup or use hair staighteners that you can see yourself except the bathroom and this is not good when getting ready to get out in the morning. We had to ask for the sheets to be changed on the sofa bed after the third day and this was dealt with promptly. We did not have breakfast in the hotel as we thought 20euros each was too expensive...lots of little cafes in the area to have breakfast,lunch and dinner. I will appear to contradict myself here and say that we did have a great time in Paris and did look forward to getting back to a lovely warm shower with gorgeous gels,lotions etc but a few little tweaks would make things even better.", "Date": "July 28, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "mandevillle", "Title": "“Great Location, Excellent Staff, really good Paris Hotel”", "Author": "ketel_always", "ReviewID": "UR71166393", "Content": "I go to the Paris area once per year for meetings and always like to stay in the center to... well... be in Paris!! Anyway I always stay in the St, Michel, St Germain area because it's so central easy to walk to most of the places you want to see in Paris. Normally, I'd stay at the Grands Hommes but I had my wife and fourteen year old son with me so I needed a room that could handle 3 people. The Saint-Michel was very nice, really clean modern. They had a free mini bar policy but that ended July 1st. They offered gratis DVDs for the room, the staff was super friendly and very accommodating. They minded our bags for us on both the front and back end of the stay and when it was raining a bit on Saturday morning, they were there at the door offering the use of umbrellas for the day. Called for a cab by sending in an online request and reported back it would be there in 5 minutes and it was right on time. The décor seemed brand new. Quite modern but right in line with Paris. Of course the room was tight for three but we managed. Honestly anyone that complains about that is going to be disappointed practically anywhere in Paris. Most of the architecture is from the 18th 19th centuries, and that’s a piece of what you go there to be a part of. I was able to catch the RER-B right there at Luxembourg which was only a 3 minute walk away. 20 minutes later on the train and I was in Massy for my meetings. The RER-C and Cluny Metro stop were down the hill towards Notre Dame less than 8 minutes walk which made it easy to get anywhere. We took the RER-C to Versailles on Saturday, with no issues. Really, it couldn’t have gone better for what we needed. Oh and it was hotter than normal that week in Paris and the air condition was great. Don’t ever underestimate that in Paris in the summer. My colleagues who stayed other places out in the suburbs were very jealous.", "Date": "July 16, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "3", "Overall": "2.0", "Value": "2", "Sleep Quality": "2", "Rooms": "3", "Location": "4"}, "AuthorLocation": "San Clemente, California", "Title": "“Lovely location, but VERY poor staff!”", "Author": "AlainnSolas", "ReviewID": "UR70929671", "Content": "My fiance booked four nights in their only listed suite (which was touted as having a view and a jacuzzi) several weeks in advance, as a special treat for us at the end of a two week European tour. We both hesitated in booking the hotel, having read other reviews complaining of lost reservations or unavailable rooms, but figured that since they only had the one suite and it was significantly more expensive, they certainly wouldn't lose or overbook that. Upon arrival it took several minutes for the desk clerk to find the reservation, but when she did, her demeanour immediately changed (she became friendly) and she offered to escort us to our room. She walked us passed the elevator and up a couple stairs and through an unmarked door, which led into a TINY corridor (could barely fit one person with their suitcase) which had two doors off of it - another unmarked one and one with a sign designating it for staff. She opened the second unmarked door and ushered us through it. Inside we found a dark \"suite\" boasting no view (just walls), no jacuzzi, and only a shower. When we objected and produced our reservation, clearly stating that we had reserved the suite with the jacuzzi/view (mind you, the only one that was listed!), she said that it was booked until Monday (conveniently) the day we were leaving. When we said the basement room was unacceptable, she offered to show us a Superior Room \"with a view\" and took us up to the fifth floor to a room with barely any room to move around in (standard fair in most of Europe, yes, but unacceptable when you booked a suite), and that so-called view? It was of \"the charming rooftops of Paris\" (her words when she took us to the balcony to show it to us). My fiance and I decided to keep the basement \"suite\" (which we came to call our basement prison), but insisted they give us a better rate for the obvious downgrade. They resisted for a while, then offered 100 Euro off a night (an absolute joke!). When we gathered our things to leave they said that we could talk to the manager on another day, and that they would leave a message for him (why one was unavailable at 2pm on a Thursday is beyond me). We decided to stay the night, and deal with it again in the morning. One of our room keys wasn't working and they promised to have one waiting for us when we left to go out for the night. We emerged after refreshing a bit only to discover a new desk staff, with no idea of our problems, forcing us to wait while they tried to sort out where we were staying so they could make us a new key (as our room didn't even have a number on it!). We were eventually able to work out an agreeable deal with the manager the next day (mostly because we didn't want to deal with the hassle of tracking down a new hotel when we just wanted to enjoy ourselves), but he never offered an apology or any additional compensation. Our room wasn't made up twice, and on one of the days it was, the maid merely folded our wet towels instead of replacing them (causing them to not dry properly and stink). Several of the items we used in the bathroom we never replaced. The shower doors allowed water to leak all over the bathroom, and the hair dryer was latched into the wardrobe, which was right against the door leading out. The \"free mini bar\", which some people mentioned, no longer exists, as of July 4. Also, the room was quite noisy being right next to the main staircase (which, apparently, lots of people use, as the elevator frequently does not work). Breakfast was good, but overpriced for what was available. Other than that, the hotel was in a very convenient location for getting to many of the major Paris attractions.", "Date": "July 14, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "3", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Manhattan", "Title": "“Delightful Property”", "Author": "Vagabond_Pilgrim", "ReviewID": "UR69443067", "Content": "On our way back from Greece we decided to spend a night in Paris. We selected this hotel because they are located near some of the most wonderful spots in Paris. The room, albeit small was exteremly comfortable. The bed was welcoming with the soft sheets and pliable pillows. The desk staff were extremely helpful and accommodating. We are planning on returning to Paris next year for a full week and will make this hotel our home base.", "Date": "July 2, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Dallas, Texas", "Title": "“Great location and quality accomodation!”", "Author": "rendallas", "ReviewID": "UR68352353", "Content": "My husband, my children, my mom and brother were in Paris for a week and stayed at this hotel. It is wonderfully located - easy access to Metro, Blvd St Germain, wonderful restaurants. The staff was excellent and very helpful with anything we needed. There was a day or 2 of some wireless access issues but we're not sure if it was us or them. The hotel room is small, as expected, but enough room to accomodate 2 adults in the Deluxe room - you can choose to have 2 single beds or put together for a larger bed. We had one of the largest room, with 2 singles and a sofa bed for the kids. These were tight quarters but we expected that. It will work with parents and two small children. The kids are 13 and 9 and this would probably be the limit as far as them being small enough to share the sofa bed. It's probably a little smaller than a \"full size\" bed. The breakfast at the hotel was a little pricey so we had croissants every morning at a chain - La Croissanterie which is a 4 minute walk from the hotel and had very good coffee and most baked items as well as fruit and yogurt - which was perfect for us. Just about 9-10 minutes away is a laundry place. This was very convenient since we were there for a week and the hotel charges so much to do the washing. I spent maybe 90 minutes out of my week to do some laundry and that was it. It was so convenient. The bars that are very close, like Les Patios, were pricey. We did a little bit of homework and experienced some mind blowing food at Le Petite Pointoise - GO HERE. I could go on further but generally, this is a VERY GOOD HOTEL and very well priced. The staff was so great. We are definitely going back and will stay here again next time.", "Date": "June 22, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "3", "Sleep Quality": "3", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Saint Louis, Missouri", "Title": "“Loved it . . . nearly perfect”", "Author": "KponyTravels", "ReviewID": "UR67620426", "Content": "Quick Breakdown: Overall: Clean, stylish hotel in the latin quarter Room: Clean and totally modern and stylish (no details forgotten). Everything from the light fixtures to the bed linens was quite chic. Toliette room and bathroom- PERFECT! This was very nice considering that halfway decent bathrooms are nearly impossible to find in Paris. Courtyard- cute/tidy. I believe that the otherside of the building may be a school- I heard children playing- nothing intrusive. Lobby- totally chic and had various vases of fresh flowers Staff- Great English-Speaking staff but not the warmest bunch of people. \"free wifi\" . . . we called it \"Lowfi\" because it was so slow- we didn't bother using it.", "Date": "June 15, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "3", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Hell's Kitchen, New York City", "Title": "“Merveilleux”", "Author": "cybersharque", "ReviewID": "UR66868269", "Content": "The location is ideal, situated next to the Sorbonne and within easy walking distance of the Ile de la Cite. The desk staff was uniformly helpful and caring. In short, tout va bien at this gem of a hotel...and no trouble at all with the reservation.", "Date": "June 8, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Auckland, New Zealand", "Title": "“A little gem is St Germain”", "Author": "AmazingChan", "ReviewID": "UR66668424", "Content": "We'd decided to take a relaxing break in Paris and stayed at the Grand Hotel St Michel for nine nights with our baby daughter. We got a great re-opening rate online and liked the sound of all the positive reviews the hotel had on TripAdvisor. The hotel is located in rue Cujas, a charming, quiet street running between Blvd St Michel and the Pantheon. The hotel had just been refurbished and combines hip hotel style with the quirky charm of a traditional Paris hotel. The room we booked was nice but cosy, so we decided to upgrade to a larger room. This was a good idea as travelling with a baby means you spend a lot more time in the room. The new room was very spacious had a beautiful new bathroom and had large windows opening onto the sunny central courtyard. The hotel adjoins a city daycare so during the day you can hear children running about but they are not intrusive. The hotel offers free wireless internet, but despite having the latest hp netbook, I couldn't get it to work and nor could the hotel staff, who were helpful and friendly, despite our inability to speak French. Our package included breakfast for the first night, which is served in a beautifully restored, barrel-vaulted cellar beneath the hotel. It's a great experience and if our budget allowed, we would have been there every morning. Instead, we found several great spots in Blvd St Michel and saved a small fortune. Finally, my advice to tourists whose French is as bad as mine is to visit Paris with a small baby. The locals instantly fall in love with it and treat you like gold.", "Date": "June 6, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Santa Monica, California", "Title": "“Excellent caring staff and gorgeous decor and amenities”", "Author": "Marlu17", "ReviewID": "UR64792909", "Content": "Although I'm writing this a year later, my 14 y.o. son and I LOVED this hotel. The staff, particularly Marie, was helpful and kind. The free minibar was delightful with a teenager and whenever he asked her for a soda at the desk, she promptly fetched one. The decor was impressive, the a/c worked perfectly. There were lovely flowering plants on the balcony outside the window. Quiet street, sandwich shops nearby wonderful and Luxembourg Gardens but a 5 minute walk away. The shower leaked a bit but they fixed it immediately. When the internet didn't work they kept finding a new cable until it worked perfectly. We had a marvelous reopening special which included breakfast at 125 Euros. This year it is double that and no breakfast included. We got a great deal and we always wanted to write a review. Marie scheduled an evening tour for us and arranged transportation upon leaving. We were sad to leave. Such a lovely experience and wonderful area. Explore Mouffetard which is so close by. Thank you so much for a wonderful stay!", "Date": "May 20, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "London", "Title": "“Fantastic hotel - would highly recommend.”", "Author": "I_love_holidays48", "ReviewID": "UR62614252", "Content": "We had a wonderful stay at Grand Hotel Saint-Michel for a long weekend. The staff were delightful, and incredibly helpful. The location is perfect, with lots to do in walking distance. Rooms were lovely and very stylish. Would highly recommend this hotel for your stay in Paris - could not fault it.", "Date": "April 27, 2010"}, {"Ratings": {"Overall": "2.0"}, "AuthorLocation": "mbk4380", "Title": "“Terrible Hotel; Lost my Reservation!”", "Author": "mbk4380", "ReviewID": "UR60467044", "Content": "Made a reservation 3 weeks ahead of time through the hotel's website, only to arrive at 6:30 pm and be told that they had no record of it! I pulled out my printed confirmation and they said that the hotel was full! The woman at the counter said I was the fifth person that today with such an experience. Personally, I'd rather stay at a lesser hotel that doesn't have these problems. There seems to be some shenanigans going on with their \"sister\" hotel a few blocks away, where we ended up staying, but the hassle and last-minute surprises made for a stressful experience and I would NOT recommend to others.", "Date": "April 5, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "2", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Austria", "Title": "“Great Hotel, extremely central, super rooms.”", "Author": "lmbranco", "ReviewID": "UR60349079", "Content": "Just stayed in this Hotel, and i have to say that the expectations were more than met and definitely exceeded. The room was quite good, with a window to the street (a quiet one), with a comfortable bed and a nice bathroom. The room decoration is quite modern and fits quite perfectly with the modern looks of the boutique hotels. We did not try the breakfast, since there are a lot of places in the neighborhood that offer great breakfast experiences. The only negative point we had was that there was a group of people staying in the hotel that were extremely loud and that woke us up at 3:30 in one of the days. On the other day they were just talking extremely loud at around midnight. However this does not damage the hotel image and surely we will strongly consider this hotel whenever we come back to Paris. Great access to Louvre and Notre Dame by foot.", "Date": "April 4, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Columbia County,PA", "Title": "“Chic, Cheerful, Convenient, Comfortable”", "Author": "JFWalters", "ReviewID": "UR58882490", "Content": "Our recent stay in the Latin Quarter was enhanced greatly by outstanding accommodations at the Grand Hotel St.Michel. The newly completed decor is modern Parisian-----urban charm with a luxurious touches of crystal and leather textures. Our host was just as charming. He and his front desk staff could not have been more helpful in addressing the needs of our little tour group of 14, from mailing letters to assisting with concerns about our airport ground transportation. Most important, our host dispatched these services personally and cheerfully. The location of the hotel is convenient to all highlights of the Latin Quarter , very close to the Sorbonne and a short walk to Notre Dame. The rooms and especially the beds are very comfortable as well as attractive.Finally, the breakfasts in the boutique- styled breakfast area satisfied every expectation of our group members. In short, a return to Paris for us will certainly mean a return to the Grand Hotel St. Michel!", "Date": "March 18, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "3"}, "AuthorLocation": "London", "Title": "“\"Magnifique and Unforgettable\"”", "Author": "SwettyLondon", "ReviewID": "UR58756938", "Content": "I just want to say thank you to all of the staff for their availability and for the excellent service they provide to their guest ( I saw many excellent attitudes & heard discussions), I gave attention to this cause I'm working in the hospitality industry in Dubai and I really know what is an excellent service ! The buffet breakfast was delicious, it was 20 eur and not 17 eur as someone said before, we woke up late (noon) due to a fantastic jazz party, and we ask if it was possible to get our breakfast, and they did it without any problem! This hotel is very charming, the only bad opinion i got, is that they should work on their promotion through web sites, cause the hotel is located close to Saint michel but in a really small street, so if you haven't heard about this hotel, it is very difficult to find it. For sure next time, i'll stay in this hotel. MERCI BAUCOUP ° Sweety", "Date": "March 16, 2010"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Miami, Florida", "Title": "“Very Nice Hotel! But save money by skipping the breakfast there...”", "Author": "travellerama", "ReviewID": "UR52175098", "Content": "We enjoyed our 6 nite stay, the location was great, the hotel clean and the staff friendly. The room was acceptably small, per european standards, but the bath was quite nice, and we had a inside courtyard view... not exceptionally pretty but very quiet. The Internet booking rate included free first nite's breakfast which was wonderful... a european and western style breakfast buffet with both hot and cold items. Would have loved to have breakfast there every day, but the stiff charge (20 Euros per person) was a bit much... I mean come on, $60 for two people to have some eggs and toast? Even if you ate all the offerings the price would still be too steep. I suggest they lower the price to a more reasonable 10 Euros, as there are several cafe's just a block or two away where you can get a very nice petit dejuner for between 6 and 10 Euros, depending if you just want coffee, OJ and breads, or want the whole egg thing. I recomment the Souflot Cafe one block up and over on St. Michel, very nice folks there!", "Date": "December 30, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Amsterdam", "Title": "“fine hotel”", "Author": "PaulAmsterdam", "ReviewID": "UR50927816", "Content": "Good hotel, small but fresh room, relatively quiet, 2cnd day they forgot to clean the room, after a call to reception, we got an apologie and imediatly some one took care of the room. Coffee and tea maker in the room. Free internet wifi.", "Date": "December 9, 2009"}, {"Ratings": {"Overall": "3.0"}, "AuthorLocation": "Vigo, Spain", "Title": "“Nice hotel”", "Author": "iaa_13", "ReviewID": "UR50290433", "Content": "Nice hotel not very expencive, centric, and one of the girls at the reception desk is spanish ;-)", "Date": "November 29, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "2.0", "Value": "4", "Location": "5", "Rooms": "5"}, "AuthorLocation": "cork", "Title": "“A pleasant stay.”", "Author": "marley20", "ReviewID": "UR50048251", "Content": "We stayed here for a three night stay with our four month old baby. We found them at the reception not the most helpfull. That was the only fault. The location is excellant,the room was pefect very modern and clean,with lovley touches and i would recommed this hotel.", "Date": "November 25, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Gloucestershire", "Title": "“Great little find and a lovely area”", "Author": "CurlyWhirly2", "ReviewID": "UR49900842", "Content": "a very modern parisian hotel on a side street, slightly noisy first thing in the morning with the bin men!! Generally really nice hotel, rooms were quite a good size (for Paris), very clean and tidy, bed very comfy. Staff not overly friendly but adequate. would definitely recommend staying there, much nicer than the chain hotels and far cheaper.", "Date": "November 23, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "3.0", "Value": "3", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Bradford, United Kingdom", "Title": "“Great location, indifferent front desk, lovely breakfast”", "Author": "tonyemha", "ReviewID": "UR48161978", "Content": "Very happy with location, smartness of hotel and breakfast service. Air con not working (and front desk not willing to over-ride the central controls) so had to sleep with windows open - not so easy in busy Paris!! Had great time though, but would not return without some reassurance about air con. There are other hotels in the area. Would I recommend it? Yes, to a friend who could cope with over-heated rooms or open windows.", "Date": "October 31, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Location": "4", "Rooms": "4"}, "AuthorLocation": "pittsburgh, pa", "Title": "“Very good location in the Latin Quarter.”", "Author": "nhspittsburghpa", "ReviewID": "UR46821025", "Content": "Ask for corner rooms which are larger, with french windows in the bathroom. The street side has beautiful views of the Sorbonne, but is very noisy and you must sleep with the windows closed. The room is very clean, updated and comfortable. Odd smell (musty?) in the halls.", "Date": "October 14, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Location": "4", "Rooms": "5"}, "AuthorLocation": "Vancouver", "Title": "“Nearly perfect, but slightly flawed stay.”", "Author": "dear2u", "ReviewID": "UR46416800", "Content": "Our room was unusually spacious and on the trendy side with plenty of lighting, seating and storage. Everything worked perfectly and the windows opened for fresh air. Plenty of pillows too and a great throw at the foot of the bed. The breakfast was outstanding, although we had to prove with our email confirmation that in our case it was included. We paid far less than rack rate using an online special. The flaws: there was a mildew smell in the halls. We looked at other floors and the situation was the same. We had to open our windows each time we entered our room and the smell would dissipate immediately. Seemed to be confined to the halls. The staff was very helpful, although one of the front desk people was brusque. The breakfast room staff were cheerful and attentive. The location was great, on a quiet street between the Sorbonne, the Luxembourg Gardens and the Pantheon. Lots of eating around, but little \"dining,\" but it is available if you leave the immediate vicinity. Notre Dame and the Marais are close by and the metro is steps away, including the RER line to Charles de Gaul. A special experience was visiting the Quai Branly ethnographic museum with a powerful collection of African and some Asian material culture. It is a close neighbour to the Tour Eiffel. Because of the mouldy smell in the halls, I would have reservations about recommending this hotel to friends. We were willing to freshen our room by opening the windows briefly, but I see this issue as off-putting to most.", "Date": "October 9, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "4", "Rooms": "5"}, "AuthorLocation": "Denmark", "Title": "“Very romantic hotel in Paris”", "Author": "torbenDenmark", "ReviewID": "UR46056855", "Content": "We stayed 3 days in the hotels only suite on the 5th floor. The suite is quite small but has a wonderful view over the roofs of Paris - from the great double bed and the jacuzzi. Perfect for a couple wanting to relax in each others company. Excellent value for money - if you do not pay the full price (650 EUR/night!). We only payed half. Torben Goldin Denmark", "Date": "October 7, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "3", "Overall": "4.0", "Value": "4", "Location": "4", "Rooms": "4"}, "AuthorLocation": "Philadelphia", "Title": "“Great staff and location it is next to a beautiful park, the Pantheon and Notre Dame!”", "Author": "Ktitus02", "ReviewID": "UR45489276", "Content": "I love this hotel for its location next to Garden Luxemborg. It is close to 2 metro stations and the main rail station. Once block from the Pantheon and a few blocks from Notre Dame. I love this location as it is not as crowded as other districts in Paris. There are great restaurants around the hotel as well as shopping, without the mass crowds. The Vibe bike rentals are outside the hotel. The hotel staff is bi-lingual and the front desk staff are fantastic. Rooms are small, but they do have mimi refigerators the have complimentarty juice and water. The rooms could be vacumed more but the carpets are dark. Comfy beds, windows open is a plus, but also semi noisey at night. Great breakfast buffet but at hefty cost of $20Euros. Free Wi-fi. No fitness room, although their brochure states there is one, it has been coming for 2 years. Good thing the park is next door.", "Date": "September 30, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "3", "Location": "5", "Rooms": "3"}, "AuthorLocation": "san Francisco", "Title": "“Modern Rooms, Great Location, Clean, Small rooms”", "Author": "travler0001", "ReviewID": "UR43093812", "Content": "We stayed here during the final leg of out two week trip to Europe and were very much interested in returning to the US due to traveler fatigue. I have to say that this hotels location and cleanliness did a great job of reviving our spirits. there was a exceptionally knowledgeable concierge that pointed us in the direction of a great restaurant. There is a new modern look that in some ways is impractical, however clean. the rooms are small, of course and it is somewhat pricey. I believe this is the norm in the area and for a short stay is worth it.", "Date": "September 20, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "USA", "Title": "“Fabulous little place in the heart of the Left Bank!”", "Author": "SueR55", "ReviewID": "UR39328284", "Content": "We just returned from Paris and 5 nights at the Grand Hotel St. Michel. Everything about thiis hotel was great! A beautiful, deluxe room with plenty of space and spotlessly clean. Daytime desk service was friendly, helpful. Did not use nighttime desk service. Great location. Breakfast was good - many selections but expensive. You won't be sorry if you stay here!! Sue - USA", "Date": "August 31, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Location": "4", "Rooms": "4"}, "AuthorLocation": "London, United Kingdom", "Title": "“A good hotel”", "Author": "Reader", "ReviewID": "UR39234064", "Content": "We recently spent 2 nights in the Grand Hotel Saint Michel. The quiet location of the hotel is very good - next to the Sorbonne and across the road from the beautiful Luxembourg Gardens. It's a 5 minute walk to all the busy touristy places in Saint Michel/Notre Dame. The Grand Hotel Saint Michel is a comfortable base for a long weekend in Paris. I would say it's more like a 3* plus rather than a 4* star hotel. It's all very modern and very clean. The rooms and bathrooms are small but I didn't mind that. The rooms have a safe, a free mini bar (alcohol free), flat screen TVs... The hallways are very dark. The reception area is small and lacks atmosphere. We didn't have breakfast at the hotel because we would go across the road for crepes and coffee in the morning. The staff at the hotel were polite but unfriendly. We paid about £125 a night through Expedia which was a fair price. Be warned - Paris is a VERY expensive city. We bought a day pass for the HOP ON HOP OFF boat trip on the Seine. It is a really good way to see Paris at your own pace. I would stay at this hotel again - it was comfortable, clean and safe. However, I think we'll stay in the Marais district next time we go to Paris. The Marais is a great area, full of interesting cafes and shops.", "Date": "August 30, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Singapore", "Title": "“Excellent in terms of rooms, stay and location, value for money”", "Author": "ynchia", "ReviewID": "UR38587091", "Content": "highly recommended. Excellent in terms of rooms, stay and location, value for money. Will definately come back to stay if in Paris", "Date": "August 23, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "singapore", "Title": "“perfectly located hotel!”", "Author": "meera68", "ReviewID": "UR38421274", "Content": "the grand saint michel was such a great find, within very easy walking distance to all the key attractions, an excellent staff helmed by the charming monsieur madjid, a clean modern design with touches of luxury, and a daily replenished stock of free cold drinks. i will definitely be staying here again.", "Date": "August 22, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Warrington, Cheshire", "Title": "“Superb Hotel”", "Author": "RobertHanley", "ReviewID": "UR37894124", "Content": "Selected this hotel after reading previous reviews and was not disappointed. Had room on 5th floor with balcony which was excellently decorated in a modern way but still reatined a 'Parisian' feel. The hotel room was clean and tidy and room service entered daily (5 day stay). The room had TV and DVD player and fridge that was replenished daily with 10 free soft drinks (2 coke, 2 Evian, 2 Fizzy Water, 2 Orangina, 2 Fresh orange) which was brilliant. The location of the hotel is the best thing. It is 5 minutes from Notre Dam cathedral and the in walking distance of a huge array of restaurants, bistros and coffee shops. Ideal for exploring the city. I would definitely recommend this hotel and stay here again without a second thought.", "Date": "August 17, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Location": "4", "Rooms": "4"}, "AuthorLocation": "Manila", "Title": "“Worth every euro”", "Author": "JLKLMJ", "ReviewID": "UR37740983", "Content": "Newly renovated hotel. Clean, modern and enough space. We booked a deluxe room. We've been to Paris several times before, and we were expecting a reasonably small room as with most other hotels in Paris. However, this one was better than expected. Our amenities included a free mini-bar (Evian bottled water, soda, and juice beverages) free breakfast (eggs, cold cuts, freshly squeezed orange juice, good coffee and fantastic yogurt), and free WiFi in the room. The night-shift person, Bernard, was excellent! He gave us all the services we could imagine: restaurant recommendations, personally bringing ice cubes up to the room and booking transportation services. The daytime person, Marie, was also very helpful. We would definitely come back to this nice, comfortable, boutique hotel soon.", "Date": "August 15, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Location": "5", "Rooms": "4"}, "AuthorLocation": "New York NY", "Title": "“Great boutique hotel in fantastic location”", "Author": "bmatraveler", "ReviewID": "UR37522208", "Content": "My endless hours of research on Tripadvisor and elsewhere on the internet were well rewarded. This is a freshly renovated hotel in a great location in the Latin Quarter. It is two blocks from Jardin Luxembourg, which alone makes it a great location, but it is also half a block from the open square in front of La Sorbonne, which makes it a phenomenal place to stay. There are a couple of restaurants in the square. We went to Brasserie les Patios for a lunch and a dinner. The food was pretty good, although the service was unfriendly. They actually also had a kid's menu, which made life a bit easier for us. The front desk was very helpful throughout our stay. The breakfast was unusually varied, with both scrambled and hardboiled eggs, a varied cheese plate, plenty of plain and chocolate croissants, juices, hot drinks and an extremely helpful and friendly staff, all in a very nicely renovated basement seating area. We were with 3 small children, so we had a triple room with a double room directly across the hallway. The rooms were not big, but were recently done so they were well thought out, had very modern bathrooms, good closets, a safe and a refrigerator. The central AC worked perfectly. Our deal actually included free juices and sodas from the minibar and free WiFi, which also worked perfectly. This was my 6th trip to Paris, but after spending an absurd amount of time researching where to stay this time, I won't have to give my next stay a second thought. This is a great hotel.", "Date": "August 12, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Stratford upon Avon", "Title": "“An excellent choice - stylish and comfortable with excellent service and a superb breakfast”", "Author": "Mabel09", "ReviewID": "UR36877656", "Content": "Ideal location, great value for money, fabulous rooms with unique decor, great public areas and superb buffet breakfast. We will return.", "Date": "August 6, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Location": "5", "Rooms": "4"}, "AuthorLocation": "London", "Title": "“Generally good but a couple of annoyances”", "Author": "travelfan81_9", "ReviewID": "UR36766295", "Content": "Stayed in August 2009 for 2 nights. Good points: 1) Very nice hotel and well located. Central enough to explore all of Paris on foot 2) Free minibar and wifi are really useful and a nice touch 3) Quiet at night 4) Lots of bars / restaurants / shops around Slight annoyances: 1) The minibar / 'fridge' in our room did not keep drinks cool, they were room temperature. we tried a couple of times to get the fridge fixed but to no avail. 2) At check in we were asked if we wanted one bed or two which I thought was odd since when I made the booking I specifically asked for one bed in a superior room. I said I wanted one bed and we were given directions to our room which turned out to be a tiny classic room instead! I thought that was quite cheeky considering I had booked a superior room, which costs more. When I asked at reception no offer of moving us was made, which i thought was unfair. At check out I felt I was within my rights to ask for a lower rate since we were not given the room we booked. The lady at reception very grudgingly took 20 euros off our total bill, which was not really enough but it had been such a struggle to get any discount I could not be bothered to argue more with her. All in all, a good trup, but the service could really have been better.", "Date": "August 5, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Location": "4", "Rooms": "4"}, "AuthorLocation": "London", "Title": "“Excellent hotel - very friendly - very modern and clean. Would recommend and use again!”", "Author": "Rand0007", "ReviewID": "UR36675554", "Content": "Hi all - going to keep this brief with salient points only. Staff: Very friendly - multi-lingual and will not be annoyed at you for not speaking French. They are very approachable and have good knowledge of surrounding areas and recommended 2 excellent restaurants, whci I'd definitely go back to. Rooms: Usual Paris issue with size - slightly smaller than you'd hope for but very good use of space. Free safe in room. Very modern e.g. automatic \"Do not disturb\" system, which activates when you're in the room. We had a free minibar - soft drinks only - but these were refilled daily. Rooms and towels changed daily. Free toiletries, although nothing to write home about. Views basic but to be honest this matters little as you won't be in there long. Free DVD player so worth bring some of your own to watch if you fancy a night - especially because only 1 of the 30 channels were English speaking and this was BBC World. Oh and free Wireless internet for your phone/laptop! Area: Pretty close to a couple of Metro stations and lots going on nearby. Cafes close by and lots of eateries. We travelled around Paris a lot to see things and most things are easily accessible. Basically the metro serves the city well and you're near to one of the stations so it's fine. The Eurostar station, Gard De Nord, can be taken directly to one of the nearby metro stations, leaving a short walk to the hotel. Area, and most of Paris in fact, is very safe - even at night. Food: Excellent in Paris generally and the breakfast in the hotel is fab. Eat as much as you like buffet - same everyday but a good variety. Free fresh Orange Juice machine, cheeses, breads, croissants, cooked meats etc.... Friendly service. Would definitely go again - one thing I would say is call a couple of days before to gurantee an online booking. We showed up and they had us down to arrive one day later by mistake - so they arranged for us to stay in a nearby hotel, which we paid for, and they gave us a 2-tier upgrade to compensate! Enjoy!", "Date": "August 4, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Location": "4", "Rooms": "4"}, "AuthorLocation": "Paris", "Title": "“Great location, professional service”", "Author": "jcoquet", "ReviewID": "UR35894148", "Content": "Conveniently located in the Pantheon / Sorbonne area of Paris, the Grand Hotel Saint Michel is also a couple blocks away from a major transportation hub, the Saint Michel RER/Metro station.", "Date": "July 27, 2009"}, {"Ratings": {"Service": "2", "Cleanliness": "4", "Overall": "2.0", "Value": "4", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Stockholm, Sweden", "Title": "“Beware about the minibar and check your bill”", "Author": "Swedish_Traveller", "ReviewID": "UR35688293", "Content": "This could have been a wonderful stay and a review with high ratings. But too many things went wrong during our stay. This is a medium sized newly renovated hotel with a boutique hotel feeling. The location is excellent on a calm sidestreet close to Luxembourg RER train station, walking distance to all attractions in Latin quarters and even Notre dame. Its an area not that full of tourists and not only tourist oriented restaurants so you get a more real Paris feeling. Its also close to the lovely Luxembourg gardens. The reception staff dont seem to be that attentive you pass and enter without any greetings. We had an internet booking for a classic double for 160 Euros per night including taxes and breakfast a very good deal we thought. Breakfast is served in the cellar and was truly amazing when it comes to what was included. They had a machine that made fresh pressed orange juice. You had pastries, different kinds of cheese, yoghurt, scrambled eggs, fruit salad among other things. Coffee was brought to you at your table. Somewhy we were all squeezed to one of the two rooms down there and there was really very little space for every table it spoiled a bit of the experience. Up on arrival at the hotel our room wasnt ready so we were lucky to be upgraded to a superior room on the 6th floor, a bit larger and with great view over the rooftops of Paris. The room was beautiful normalsized in a modern design. Very clean and had a flower theme. The bathroom was a very modern design but extremely unpractical it was totally impossible to use the washing basin without getting water all over the mirror. The bathtub with the shower was the smallest I ve seen. It was impossible to stand straight in the shower and still Im only 179 centimeters. The room was equipped with a LCD television with cable channels, free wireless internet that worked, a safe and coffee making facilities. There is nothing in the room telling you about the facilities of the hotel, there is totally no information about the hotel to be found. We knew beforehand that wifi was free for instance and could ask for it at the reception. Then there is the minibar with soft drinks. Also about this no information. The website tells the soft drinks are free. To be sure we asked the reception and got an asurance that this was the fact. We stayed two nights. After one night the next day when we came back to the room there was suddenly a list in the room were we were told to write down how many bottles we have used each day, a line for a signature and a line to enter the room number. All items softdrinks also had a price on the list. ofcourse we were confused and went down to the reception. He told us that this must be something new that he hadnt seen the list before and that he would ask his colleague next day. We didnt have any more soft drinks not because the paymenyt would be a problem but because we got angry about having got wrong information. Well next day when checking out we again asked about the list and the minibar. She told us that it was for free and that the list was only for them to know how many bottles to refill. I wonder...there was no list the first night we stayed and why did it have prices and a line where to sign. I strongly think that they charge for the minibar if you arent aware of that its supposed to be free. Then came the next problem our bill. Suddenly they wanted to charge 169 Euros instead of 160 per night. Luckily we had a print out of the confirmation this was the way to convince that this was the price agreed. So Im sorry I would have liked to give this place a good review but no its more of a warning to keep your eyes open and check what is included in your deal with the hotel. There are many other boutique hotels in the same neighbourhood these may be an alternative.", "Date": "July 24, 2009"}, {"Ratings": {"Service": "2", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Location": "5", "Rooms": "2"}, "AuthorLocation": "UK", "Title": "“It was okay.......”", "Author": "Tricker74", "ReviewID": "UR35331374", "Content": "I'm a bit stumped by all the brilliant reviews this hotel has got. The refurbishment is nice, but the rooms are absolutely minute. Not enough floor space for 2 people to move around - I had to move round the bed each time my husband wanted to walk past, and we couldn't both fit into the bathroom at the same time. It was clean enough, but the maid service was poor. On arrival there was an empty box with no shower cap in it, so I binned that, but we were there for 3 nights and it was never replaced. They also didn't clean used tea cups, but left them by the bed. The linen wasn't changed, although the bed was made. The rooms aren't very well soundproofed, so as well as hearing noise from the street, you could also hear when your neighbours got back to their rooms, brushed their teeth, walked around, flushed the loo etc etc. Can't comment about breakfasts as we chose to eat ours at local cafes instead. Location wise, yes it was great, but if I visit Paris again I would choose an area a bit further out to get a room bigger than a cupboard with paper thin walls!", "Date": "July 21, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Connecticut", "Title": "“An excellent spot to start & end your day in Paris”", "Author": "CTProfessional", "ReviewID": "UR34568806", "Content": "My boyfriend and I stayed at the Grand Hotel Saint-Michel for a week in July 2009. Neither of us had been to Paris before so we did a fair amount of research before deciding on this hotel, which had more positive reviews than most. Although we wanted a safe, comfortable place to stay, we knew we'd be gone sightseeing each day. We were able to stay at the Grand Hotel Saint-Michel for seven nights, in a classic room with a queen bed, for approximately 1,230 Euros by booking the room on the hotel's website (a better deal than anything posted elsewhere (on Expedia, etc.), particularly since this rate included free WI-FI for the week, mini-bar, and breakfast each day). The breakfast included everything from coffee, fresh squeezed OJ, pastries, fruit, cheese, yogurt, eggs and cereal. The hotel is quite modern--lots of black marble--which isn't exactly my taste, but it was tasteful and clean and the outside of the hotel is attractive. Our classic room was small--as all rooms apparently are in Paris--but it wasn't uncomfortably small. The bed was comfortable and a true queen (instead of two twins pushed together like you often see in Europe). Beyond the breakfast offerings, there is no restaurant or bar in the hotel, but that's not a problem as there are a number of fun cafes within a block in any direction. The hotel is situated on a quiet street but is otherwise located in the heart of the Latin Quarter...with the Sorbonne, young students, and a five minute walk to Notre Dame. We walked almost everywhere we wanted to go that week, including the Eiffel Tower. Perhaps in this regard, the location is better for younger people (or those willing to walk around and explore a bit). If you're not interested in walking or taking the metro to the major sites, you may want to look elsewhere.", "Date": "July 12, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Location": "5", "Rooms": "4"}, "AuthorLocation": "madrid", "Title": "“Fantastic”", "Author": "jebb2000", "ReviewID": "UR34449481", "Content": "Staff very friendly, the hotel is expensive but it´s Paris....the room was clean, BIG, new, quiet, confortable, very good location, three minutes walking from a tube-rgr station (luxemburg), ten minutes walking from Notre-Dame.", "Date": "July 11, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Brooklyn, NY", "Title": "“Ideal location in Latin Quarter.”", "Author": "IkeGNY", "ReviewID": "UR34336563", "Content": "My wife and I spent the last couple of days of our honeymoon at the Grand Hotel Saint-Michel. The location is ideal. Steps away from the Pantheon & the Sorbonne. Room was clean and features free soft drinks. There was free wireless internet and a flat screen TV. The staff was very helpful in arranging transportation for us to the airport.", "Date": "July 9, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "new york", "Title": "“highly recommend this hotel”", "Author": "NewYorkMandJ", "ReviewID": "UR34027002", "Content": "Very clean. Staff very friendly and was able to answer any question we had. Perfect area in Latin Quarter for sightseeing. Near subway, public ferry and attractions. Too many restaurants to choose from. American diner nearby for those wishing for free coffee refills. Rooms can be small but have been refurbished and refridgerator in each room with complimentary drinks. Would recommend this hotel to anyone.", "Date": "July 6, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Michigan", "Title": "“Would return”", "Author": "chicotraveler52", "ReviewID": "UR33943942", "Content": "This hotel, was in a great section of the Latin Quarter, Very modern, yet typically small rooms. The front desk was very helpful and this is definitely where we will stay again. We slept 5 nights.", "Date": "July 5, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "ohio", "Title": "“Beautiful Hotel Helpful Staff”", "Author": "bmorrette", "ReviewID": "UR33766475", "Content": "This was a great stay in a perfect location! The staff was very helpful and the room spotlessly clean! I would go back again and again!", "Date": "July 2, 2009"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Finland", "Title": "“Such an elegant place!”", "Author": "WhitePiony", "ReviewID": "UR33522385", "Content": "Wonderful hotel, with great design - and superb location! We stayed in a room (602) facing the Pantheon - ah! The breakfest is pricy (15 euros) but worth it: freshly squeezed juice, macarones, strawberries... We will surely return!", "Date": "June 30, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Cologne", "Title": "“Very good hotel with modern interior design next to Sorbonne/Jardin du Luxembourg”", "Author": "THEONE79", "ReviewID": "UR32505883", "Content": "Very good hotel, good service, good breakfast, very nice rooms in modern style, freshly renovated in 2009, located in quartier latin next to Sorbonne (10m) / Jardin du Luxembourg (500m). Rather expensive but worth the money.", "Date": "June 17, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Location": "4", "Rooms": "4"}, "AuthorLocation": "Melbourne", "Title": "“Small but modern, in good location.”", "Author": "FussyGlobeTrotter", "ReviewID": "UR32479505", "Content": "We stayed in room 501 deluxe chambre. The door opened directly onto the bedroom so the room felt smaller than it actually was. There was enough room to walk around and store our luggage so we were happy. It's been recently renovated, so it felt clean. The room itself isn't new, so you can tell it was an old style hotel with a makeover. For example, the bar fridage and cabinetry isn't overly expensive looking / upmarket. It's been renovated but not completely replaced if you know what I mean. There are big glass mirrors on the wardrobe doors which make the room feel bigger too. The bathroom was modern, but it had a bath/shower which I'm not a huge fan of. But it was clean and new. The shower head had great pressure for washing my hair. The queen sized bed was quite hard, but comfortable. They provided a europe pillow and single feather pillow - and a comfy doona. There was a flat screen TV above the coffee facilities/bar fridge (but no sleepmtimer function) and they had a good range of TV channels. The minibar was drinks and free. water oj, coke. (no food, or milk at all for coffee) The room we were in looked in to a central courtyard / void, so no views over Paris, but there were flowers in the window sills which was nice. The location was good and I'd stay there again, but make sure you get a deal on expedia or similar, as the rack rate is insane. You should be able to get a good discount most of the time.", "Date": "June 16, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Dordrecht", "Title": "“Perfect hotel”", "Author": "DennisBa", "ReviewID": "UR32040631", "Content": "No matter how hard i think i cant think of anything negative to say about Grand Hotel saint-Michel. Our stay in the hotel was great, very friendly staff, nicely decorated rooms for a decent price. The location is perfect, especially if you like Parc du Luxembourg because it's literally around the corner from the hotel.", "Date": "June 10, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Location": "5", "Rooms": "5"}, "AuthorLocation": "UK", "Title": "“Excellent Hotel in Paris if you have Non standard European tastes”", "Author": "livingabroaduk", "ReviewID": "UR31431140", "Content": "They offered a good size room (for Paris standards) In addition to the bed there was room for our suitcases and you could even still walk around. Bed was actually comfortable. Which for us I think was a first for Europe. Usually they are very hard or you have springs poking you. This was neither, just like home. Location was excellent as its right next to the RER line so you have direct metro access to the airport or the rest of the city. Close walking distance to lots of food options. Our favorite was Breakfast In America on 17, rue des Ecoles (not far from Notre-Dame) American type breakfast with a French flair. Everything was clean and the hotel provided pretty much everything you would need. Mini-bar was free and included (in included juice, water, and some soda) Staff was friendly and spoke English well. They were helpfull with answering questions and giving directions. Breakfast is or wasn't included in our rate. To add it was 15 euros/person. I don't know how good it was but for 30 euros you can eat at a lot of other great places for less. We got a great deal on venere [----] and couldn't be happer with our trip. I think the only gripes we might have was the drain in the tub was slow. It was such a great stay so there really isn't anything to complain about.", "Date": "June 2, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Berlin, Germany", "Title": "“An affordable Grand hotel in Paris”", "Author": "Batta83", "ReviewID": "UR30661757", "Content": "Finally, finally, an affordable yet stylish hotel in the heart of the Saint Germain de Prë district. Rooms are modern and very well decorated, staff is frienly and it\"s not the usual cut throatbusiness in Parisian hotels. The minibar (soft drinks) and free WiFi were included in the room rate. Breakfast is served in a very cosy room in the cellar. Compared to what you usually get in Paris a great breakfast with freshly squeezed orange juice and delightful offerings. This place is a gem!", "Date": "May 24, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Calif.", "Title": "“All around awesome hotel!”", "Author": "Pescabilia", "ReviewID": "UR30570328", "Content": "This was my third stay at Grand Hotel St. Michel. The service is great, the rooms are clean and modern, and the price is value for money. My biggest recommendation is to make sure to take advantage of the breakfast! For the price, the breakfast is amazing. If I ate breakfast in the hotel, I did not need to eat again until dinner. This hotel has quickly become one of my favorite hotels in the world. It is a total package hotel; location, price, cleanliness, service. Highly recommended!", "Date": "May 23, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Gravelines, France", "Title": "“wonderful hotel good location”", "Author": "GodisGoood", "ReviewID": "UR29909653", "Content": "great location. located near a tube stop. quiet clean beautiful hotel. would stay here again. there are lots of places to eat. close to popular sites. big rooms the safe was so helpful. good deal we booked through hotels.com and paid $164 per night. comfy bed and very modern", "Date": "May 13, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Bristol, England", "Title": "“Lovely room, great location, good internet price”", "Author": "Blackbird08", "ReviewID": "UR29598577", "Content": "The room was excellent, very modern and clean. The location was excellent, only a short walk to the Metro, left bank etc. The internet price (direct with the hotel) at €159 was much better than the advertised €320. Did not bother to have breakfast here as loads of local cafes for a much cheaper croissant and cup of coffee. Would definately recommend this and glady stay there again.", "Date": "May 8, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "3", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Becky0032", "Title": "“Lovely Hotel But Pricey”", "Author": "Becky0032", "ReviewID": "UR29408371", "Content": "Warm welcome at the hotel and we were upgraded to a deluxe room, still fairly small, but beautifully decorated and with lovely bathroom. However we found the hotel services a bit limited - there was no hotel guide in the room explaining hotel facilities (phone, internet connetion, breakfast etc) which was a shame, and there were no tea/coffee facilities (nor complementary water) in the room. Other than that, we really enjoyed our stay. The staff were very helpful, even let me go behind their desk to check-in online for my flight home! Also, now with the Euro being what it is, we paid approx £200 per night, which, given the limited in-room facilities and no breakfast included, was a bit pricey really.", "Date": "May 5, 2009"}, {"Ratings": {"Service": "2", "Cleanliness": "5", "Overall": "4.0", "Value": "3", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Holyhead, Wales", "Title": "“Ideal location, very stylish decor in this comfortable and clean hotel”", "Author": "nia4334", "ReviewID": "UR28237364", "Content": "Lovely hotel in an ideal location, close to bus and train route. Many restaurants and cafes in close proximity. Open-top tour bus stops very close to hotel , which was extremely convenient. Bus number 21 from the end of the road will get you directly to Galleries Lafayette for under 2 euros! Reception staff were welcoming - however I felt that they could have shared information about the hotel, local transport routes and surrounding area. On arrival we were simply given the key to our room, no mention whatsoever of the hotel facilities, Jardin de Luxembourg or the Pantheon which are only a few minutes walk from the hotel. Place de la Sorbonne was a lovely place to spend an evening. My tip for future visits: Stay at this hotel and if we fly easyjet to Paris again I would certainly opt for the minibus transfer from CDG rather than take the train. It's about 5 euros more expensive than the train ticket but well worth it ,as the station is a fair walk from terminal 2B. The minibus transfer is door to door. We had a very enjoyable stay at this hotel and look forward to a return visit.", "Date": "April 17, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "3", "Overall": "4.0", "Value": "4", "Location": "4", "Rooms": "3"}, "AuthorLocation": "Karachi, Pakistan", "Title": "“Excellent location and wonderful staff”", "Author": "yudesi", "ReviewID": "UR27739930", "Content": "I spent a week in St. Michel area in this hotel and can't say much about the wonderful staff. Especially the lady at the reception Lena has been superb in facilitating guests to restaurants and other venues. Overall i had a wonderful stay in this area.", "Date": "April 10, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Central Scotland", "Title": "“A pleasurable stay I would be happy to repeat.”", "Author": "Alex81261", "ReviewID": "UR27671379", "Content": "The staff were very helpful with all our inquiries. They provided us with guidance to an excellent restaurant which just happened to be a little further up the street. Breakfast was provided in the room at no extra cost. The room was kept clean and tidy to a very high standard. We were never disturbed by the staff even though we were late going out sometimes. The inner courtyard is no view however it was quiet. There is a preliminary school nearby and the sound of this can be heard from time to time. A health/fitness area is in the process of being constructed.", "Date": "April 8, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Wellington, Florida", "Title": "“Updated and comfortable hotel in the best area if you are on vacation!”", "Author": "Kozzy50", "ReviewID": "UR27133540", "Content": "We found this hotel after searching though almost 50 other hotels in Paris. If you are on vacation and have not been to Paris before, this area is excellent to stay in. Saint Germain is close enough to all the tourist sites while still being among locals. This hotel was completely renovated and opened in 2009. We got a great deal through their website. Located on a great side street and about 5 min walk to metro and a ton on restaurants and shopping, this small out of the way boutique hotel made us feel right at home in Paris. Service was excellent from each person at the front desk. We had reservations for two separate rooms. Two days in a classic least expensive room, and two days in the suite. The rooms are small but honestly, no matter where you go in Paris, the room will be small unless you are at a major hotel chain. Just be prepared for that. These buildings are hundreds of years old. But the room itself. Modern, comfortable and the beds are awesome. Another hard to come by item in Paris. A good bed and pillow. These were great. We lucked out and got the smallest, cheapest room but on the 5th floor with a balcony. Some don't have this. I'd request it on the 5th floor at checkin. We then transfered to the suite. Still small for a suite but an exceptional room at that. Separate living room, bathroom with jacuzzi, separate toilet, and separate bedroom. On the 5th floor with wrap around balcony because it's a corner suite. Wow. If you can upgrade, I'd recommend it. One last thing to mention. Free WiFi and each room has fridge with free drinks inside. We had waters, coke, juices, ect. No alcohol. How great is that. Other hotels charge an arm and a leg for these. When we're back in Paris, I'll be back at this hotel.", "Date": "March 30, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Location": "5", "Rooms": "4"}, "AuthorLocation": "United Kingdom", "Title": "“NIce Hotel”", "Author": "kean2travel", "ReviewID": "UR26724476", "Content": "A very nice hotel in a prime location in the heart of Paris. The rooms were a little on the small size but you soon get use to that. The staff are very friendly. the only downside would be the price, breakfast wasn't included.", "Date": "March 24, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Antwerp", "Title": "“little gem”", "Author": "castewil", "ReviewID": "UR26237597", "Content": "recently renewed with taste , this little hotel has all you may wish for in a hotel: central location (walking distance to Notre Dame, Luxembourg gardens, Pantheon, St Michel restaurant area etc), friendly staff, nice breakfast buffet in an antique vaulted cellar. And it's quiet (a rare thing in Paris). Okay the rooms are not huge but all you can wish for is there, wrapped up in a modern design. Bed is great. What more can I say? (fitness stuff is there but workout room is being finished; march 13th 09). Public parking (25EUR/night) round the corner.", "Date": "March 16, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Athens", "Title": "“Very nice modern rooms in great area”", "Author": "GasparK", "ReviewID": "UR26188648", "Content": "The rooms are very modern which is not usual in Paris as all hotels have decoration from the 1900's. They are very small though and you can hardly find a space to leave your luggage. The bathroom is perfect and modern. The staff are very polite and helpfull (especially the men). We didnt have breakfast so i cannot commend on that. I think it is too expensive 15Euro per person. You can have coffee from Starbucks which is 3 minutes walking from the hotel and have a nice crepe with chocolate on Boulevard Saint Michel.The beds are probably the best beds i have ever slept on vacation. The rooms are very quiet and there is also wireless internet (no charge). The Luxembourg station is 5 minutes walking distance from the hotel and has direct trains to the airport.", "Date": "March 15, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Location": "3", "Rooms": "4"}, "AuthorLocation": "west kilbride, scotland", "Title": "“great price (hope it lasts!)”", "Author": "blissapp", "ReviewID": "UR25404834", "Content": "The hotel overlooks the sorbonne uni. in a very good bit of paris for restaurants and a 5 minute walk from Notre Dame. Also a 5 minute walk to the nearest Metro/RER station, so the whole of paris is available. Travelling into Beauvais, I got the coach and then a taxi to the hotel which only cost 5 euros, not too bad at all. Breakfast was a bit overpriced and there is still a little ongoing work in the basement where the dining room is, but overall a very pleasant experience and fantastic staff were very helpful. Rate was their \"Internet Special\" - well worth the money - book from their own website for the best rate. Don't think their published tariff will really stand up to other hotels though, it's a small hotel with no facilities above the breakfasts... Maybe normal in paris though. Nice touches like free wifi (a must these days) and a free minibar (free as in price and free as in alcohol-free, it was soft drinks only). Very pretty decorations in the room.", "Date": "March 1, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Paris", "Title": "“excellent service at a great discount”", "Author": "frenchtrotter2", "ReviewID": "UR24496130", "Content": "excellent service and very friendly staff - the hotel gave amazing discount for their relaunch (after extensive refurbishment)", "Date": "February 12, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "4", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Cheshire", "Title": "“Fantastic hotel”", "Author": "Mckean2", "ReviewID": "UR24219191", "Content": "After trawling through lots of Paris hotels i decided to go with this one. What a fantastic decision, it has a great location near Luxembourg metro (which you can access on the direct line from the airport) there is a great cafe opposite the Jardin du Luxembourg, and the Jardin du Luxembourg itself is beautiful. Its a 10 mins walk to Note Dame and there are lots of restaurants within a 10/15mins walk away. The rooms were lovely, perfectly clean, with a great bathroom with a double shower, a free minibar with soft drinks which were topped up each day. Would recommend to family and friends. Am planning my trip back to Paris in the summer and will definitely be staying here!", "Date": "February 4, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Bristol", "Title": "“Perfect Paris Getaway!!”", "Author": "Haz86", "ReviewID": "UR24207908", "Content": "I can't recommend this hotel highly enough. Modern, lovely decor, very friendly staff, spotless rooms, excellent location....a fantastic hotel!! Located on a quiet side street, you are no more than 1 minute away from the shops, restaurants and bars of St Michel Boulevard without any of the noise that staying on the main street brings. The room was large for Paris, with a fantastic bed, lovely decor and brand new bathroom. The reception area is beautiful and the lady on repception spoke excellent english and was very welcoming. On top of this, notre dame, the beautiful banks of the seine and subway stops are no more than 5 mins walk down the road. In all a wonderful hotel hard to find any faults with it at all!", "Date": "February 4, 2009"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "Tampa, Florida", "Title": "“Excellent hotel in the heart of Paris”", "Author": "sulimans", "ReviewID": "UR24046300", "Content": "An excellent “boutique” hotel in the heart of Paris. The rooms are so elegantly furnished with modern touch and updated bathrooms. The hotel is very clean and the staff is very friendly. The hotel has a free wireless high-speed internet service and a complementary mini bar stuffed with soft drinks, ojs and mineral water. The breakfast buffet costs 15 Euros but definitely worth it. This hotel is the best in Paris for its price, its quality and its location. I highly recommend it.", "Date": "January 31, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "2", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Minneapolis", "Title": "“Loved the Saint-Michel”", "Author": "pjhaak612", "ReviewID": "UR23486346", "Content": "Our family with teenage kids stayed 4 nights just after Christmas 2008. Great location within walking distance to the Notre Dame. Rooms smallish, but very clean, the front desk helpful and friendly. Bathrooms amazing. Free juices and bottled waters in the fridge. We definitely hope to be back again soon.", "Date": "January 12, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Check in / front desk": "5", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Valencia", "Title": "“Loved the Grand Hotel Sanint-Michel”", "Author": "jbenajes", "ReviewID": "UR22932662", "Content": "Very well located hotel, in a quite street. Furniture and decoration is new and modern style, and of good quality. The girl at the reception desk was extremely nice and helpful, as was the staff during breakfast. The standard room is not very large, but everything was new and modern. Heating did not work at some moment, but it was fixed in ten minutes after complaining. There were no information leaflets at all in the room, to the extreme that at a certain moment we did not know how to contact the reception desk by the internal phone. Breakfast buffet (15 euro) is not cheap, but the ratio price/quality is not bad, for Paris . In all, at the price we paid for the room (less than half the indicated list price), the hotel is a very good choice.", "Date": "December 23, 2008"}, {"Ratings": {"Cleanliness": "4", "Business service (e.g., internet access)": "4", "Check in / front desk": "4", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Helsinki, Finland", "Title": "“Good hotel near Sorbonne”", "Author": "kauris", "ReviewID": "UR22643612", "Content": "The hotel is recently refurbished and very modern. In the room everything was new, nice and modern. Room was small but so they are in Paris, so this was not a problem. My room was very cold. Every time I entered the room I thought maybe a window was open but wasn't. Breakfast would have been ok but the problem was that if you weren't there quite early, there wasn't much left. And this was the same every day. Even bread ran out. Not to speak of cheese and cold cuts. The hotel is very close to Sorbonne, all in all a nice area. Despite the recent refurbishment, windows weren't double to prevent sounds from the street. As the area is lively and there a restaurant with a terrace you may hear some noise very late.", "Date": "December 11, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "marbella", "Title": "“fab boutique hotel, small but perfectly formed rooms!”", "Author": "kathybarlow", "ReviewID": "UR22406264", "Content": "Me and my husband stayed for 3 nights, we had a room on the 5th floor, which was lovely, mirrored wardrobes, comfy bed, shame about the pillows, they were too hard. The bathroom was lovely, compact but everything you could need and a shower that was quite powerful. The room was clean and the soap/towels changed every day. The location is excellent; Notre Dame is only a 10 minute walk and all the bars/restaurants also within walking distance. The hotel has only just been renovated and was having a spa installed in the next building which we were told would be ready early next year, when we return to Paris we will definitely be stopping there again.", "Date": "December 3, 2008"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "London", "Title": "“Great holiday in excellent location”", "Author": "Hjamus", "ReviewID": "UR22405892", "Content": "I've been to Paris several times and always been disappointed with accommodation, but the St Michel was beautifully designed with extremely helpful staff. The rooms are small (as usual for Paris) but really well decorated with a modern bathroom and power shower. Only complaint is the noise levels at night from outside (there is a pub on the same street) but I would definitely stay again. Location wise it is walking distance to St Germain des Pres, and The Leovre/ Notre Dam/ Musee D'Orsay. Only 15 mins in a taxi from Gare du Nord for the eurostar. Would recommmend!", "Date": "December 3, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Business service (e.g., internet access)": "4", "Check in / front desk": "4", "Overall": "4.0", "Value": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "North Carolina", "Title": "“almost ready”", "Author": "aubonheur", "ReviewID": "UR21837933", "Content": "The hotel itself has just been renovated, the room i stayed in was ultra-modern and beautiful--lots of glass--with a small balcony. However, perhaps because everything is new, it isn't all working properly yet--a fuse blew at one point, and the bathtub (bubble-jets!) didn't always work. The staff was unfailingly friendly and obliging (spoke english as well), but also seemed to be inexperienced, and not always to know what was going on. Both these problems, I think, will go away as the technical kinks are worked out and the staff is seasoned a bit. the location of the hotel is perfect. arriving in CDG, the RER lets you out a block from the hotel. the neighborhood is buzzing with students and activity during the day, but since the hotel faces away from the main streets, it is relatively peaceful at night. walking distance to many major tourist destinations, and plenty of dining in the vicinity off of rue mont-st-genevieve, descartes, and up to mouffetard. all in all, highly recommended at a base-camp for paris. once the technical problems are worked out, five of five.", "Date": "November 14, 2008"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Business service (e.g., internet access)": "4", "Check in / front desk": "3", "Overall": "4.0", "Value": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Paris - London", "Title": "“Great Suite!”", "Author": "Rami-Archi", "ReviewID": "UR21688416", "Content": "I offered my fiancee a night there for her birthday, and we were very pleased by the room, we stayed in the suite The room is slightly small for a suite, but very well divided, the bathroom is surrounded by glass that give on the living room as well as the bedroom which is fun, you can also, if you don't mind, open the curtains and look at the roofs of Paris from your bathtub We also took the breakfast the next morning, it's 15 euros head, the choice is fine, but if you're passing by Paris on holiday, you can walk around, the hotel being between Luxembourg and Saint Michel, and find nice/cheaper spots for breakfast In a nutshell, for it's 3 stars, the hotel offers an above average suite, with a very nice view on Paris as well as a great location Single problem I had, one of the staff opened the room while I was changing, probably to show the Suite to other clients", "Date": "November 10, 2008"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Steven Ullman", "Title": "“I would return”", "Author": "stevenullman", "ReviewID": "UR20707998", "Content": "The room was small (as are most rooms in Paris) but quite nice. The location is wonderful; we walked everywhere we went, including the Louvre and other Right Bank locations. The hotel staff are wonderful and very helpful. I would return to the Grand Hotel Saint-Michel without a second thought.", "Date": "October 7, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "4.0", "Value": "3", "Rooms": "4", "Location": "4"}, "AuthorLocation": "yorkshire", "Title": "“Good location”", "Author": "coyd", "ReviewID": "UR20373000", "Content": "Pleasant small boutique style hotel in a handy location for Latin Quarter, Notre Dame and St Germain area. NB; I don't think the website is up to date as the hotel is very contemporary in style,no longer having period furnishings and has no lounges or bar as stated on the hotel website. We stayed for 3 nights and booked a superior double room. Rooms small but with contemporary furnishings. Very clean. Try to avoid room 604...which is on top floor. Rather cramped and only has a half size wardrobe due to the alcove, and shock horror, no bathroom mirror other than a shaving mirror which is magnified! This wouldn't be too bad if there was another accessible mirror in the bedroom...but there isn't! Not good for us ladies. We slept for 1 night in the room and then mentioned the probs to reception the next morning...they immediately offered us an alternative room and we moved in within 15 minutes...excellent service! Reception staff extremely helpful with this and also with general info about Paris. Speak good English. We didn't have breakfast, so cannot comment other than it was 15 Euros each. Both rooms we stayed in had flat screen TV, DVD and were very nicely furnished. Bathrooms lovely...great trendy sinks and lovely power showers. Our second room had a seperate toilet, which is always welcome. There is no bar at this hotel and no hotel info booklet in the room, so am unsure whether they have room service. This wasn't a huge prob as there are so many bars, cafes close by. Minibar...but only soft drinks. Hotel within 10 mins walk of RER-Luxembourg station and close to shops etc. Also about 10 mins walk to river! Water bus is a good way to see Paris...about 11 Euros and can jump on and off at various points of interest. Open top bus more expensive. Quiet location...not woken by street noise.Generally speaking was a nice hotel, moderately priced and we had a great stay.", "Date": "September 25, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Business service (e.g., internet access)": "3", "Check in / front desk": "4", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Rehovot", "Title": "“Absoulutly wonderfull!!!”", "Author": "Z1985", "ReviewID": "UR15982054", "Content": "Great location, clean and spacious rooms, friendly staff, nicely decorated, great view from the balcony. I just can't complain about anything! i\\It was the best vacation I've ever had and I would recommend this hotel to everyone.", "Date": "May 13, 2008"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Check in / front desk": "3", "Overall": "3.0", "Value": "3", "Rooms": "2", "Location": "3"}, "AuthorLocation": "Stratford-upon-Avon, United Kingdom", "Title": "“Good location, average rooms”", "Author": "Anita1967", "ReviewID": "UR12566576", "Content": "The hotel was in a good location, about a 10 minute walk from the RER station and the same distance to the Latin Quarter which was great for restaurants in the evening. Hotel was very average, nothing special but wasn't expecting much of a Paris 3 star. Bathroom tiny, with paint peeling off door and the bath/shower had definitely seen better days, although shower was actually quite powerful. No problems re heating issues as in previous reviews. We were on the 3rd floor and if you leant out your window you could see the top of the Pantheon! Ok for a short stay but have stayed in a better 2 star in Lisbon in October. Can't comment on breakfast as we went to nearby cafes.", "Date": "January 13, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Check in / front desk": "4", "Overall": "3.0", "Value": "3", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Colorado, USA", "Title": "“Great location, fair room”", "Author": "alagnak", "ReviewID": "UR6231672", "Content": "Stayed 4 nights over Thanksgiving. I'd been in Paris before, and have always stayed in the 5th. This was the first time for my wife in the city, and wanted to show her the neighborhood I've 'adopted' near the Sorbonne, and you can't get much closer than this. The hotel was fine in nearly all respects. THe location is fantastic, overlooking the Sorbonne and a block from the Pantheon. A block and a half from the Luxembourg RER stop, so convenient from the airport, and 3 blocks to the Cluny Metro. It's a short walk to the Rue de Baci marketplace, a lot of nice small restaurants, Notre Dame, and maybe 10 minutes walk to the Pont Neuf and then the Louvre. The rooms are pretty standard central Paris. Smallish (I've been in smaller roomks in this neighborhood, but expected a little more room in a 3-star), no-frills, clean. The bathroom is quite large and nice by 5th standards, and likely the reason it warrants the extra star. Breakfast was included in our rate and we did it twice (although both times, we got our coffee elsewhere). I'd highly recommend NOT including breakfast (average-at-best food, terrible coffee) and heading around the corner (literally) to one of the cafes on Place de la Sorbonne for a cafe' and baguette. The staff were friendly and helpful and we really were never unsatisfied, just merely 'satisfied'. If you can, try and get a 5th floor room with a balcony. In short, nothing was actually bad, and, outside of the location, nothing was 'great', but I think you can get better value for your money in this area. Spend a little less for a similar location, similar room and a smaller bathroom, or a little more for a larger/newer room. In the end, Paris, and the 5th/6th in particular, have so much to offer, it's hard to fixate on the room very much.", "Date": "November 28, 2006"}], "HotelInfo": {"Name": "Grand Hotel Saint-Michel", "HotelURL": "/ShowUserReviews-g187147-d194274-Reviews-Grand_Hotel_Saint_Michel-Paris_Ile_de_France.html", "Price": "$235 - $401*", "Address": "<address class=\"addressReset\"> <span rel=\"v:address\"> <span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">19 rue Cujas</span> | <span class=\"extended-address\">5th Arr.</span>, <span class=\"locality\"><span property=\"v:postal-code\">75005</span> <span property=\"v:locality\">Paris</span></span>, <span class=\"country-name\" property=\"v:country-name\">France</span> </span> </span> </address>", "HotelID": "2515085", "ImgURL": "http://media-cdn.tripadvisor.com/media/ProviderThumbnails/dirs/83/ea/83eab3b09ac2162531ffeb32b00f1ce97large.jpg"}}