{"Reviews": [{"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "San Diego, California, United States", "Title": "“Comfortable and ideally located”", "Author": "mimhope", "ReviewID": "UR126459254", "Content": "My husband and I stayed here for four nights in March 2012 and had a great experience. The staff all spoke excellent English and were very welcoming and helpful. The room was very clean and, although small, quite comfortable. Free wifi was a little weak but generally not a problem. The location, of course, is impossible to beat. We loved our view and it was so convenient to the RER station that goes directly to the airport! A couple tips: - You must climb a long flight of stairs to enter the hotel. If you have a lot of luggage or have difficulty with steps, consider staying elsewhere. The lift from the lobby to the rooms was broken for one day as well, and since there's only one elevator, stairs were the only option. - If you like to stand up in your bathroom and/or not knock your head against the ceiling regularly, don't ask for a room on the sixth floor. We LOVED our room on the sixth floor, but had to figure out how to shower without a stand-up shower (the ceiling is sloped in the bathroom) or shower curtain, which my husband (kind of a big guy) found problematic. Other floors will likely have a similar view but no sloped ceilings. - That said, our room was AMAZING. There was a little loft you accessed with a wooden staircase inside the room, with a skylight in the ceiling that we opened to gaze out onto Notre Dame and the river. It was truly delightful, if a little cramped. Overall, we recommend!", "Date": "March 21, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "London", "Title": "“BIJOU AND LOVELY”", "Author": "KateALondon", "ReviewID": "UR126437484", "Content": "Hotel Notre Dame is a beautiful, bijou boutique hotel in the heart of Paris. It I very well located for bars and restaurants, shopping and sights, many of which are walk able. We stayed in Seine view rooms with glorious views over Notre Dame. I would recommend room 32 if you can get it, whilst small its perfectly formed and has double aspect windows looking over Notre Dame. 31 or 21 are both great rooms as well. There are limited facilities at the hotel, but really it doesn’t matter with so much around it. The staff were delightful and super helpful, they helped me arrange a cab for 5 from the station on arrival (this was expensive though almost double the cost of normal cabs), to restaurant recommendations. Do be aware that the rooms are very very small and have a slight musty smell, and with the windows open if you are a light sleeper you might toss and turn due to the noise. Well worth a visit and I will certainly be back.", "Date": "March 21, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "London, United Kingdom", "Title": "“A very nice stay”", "Author": "GeorgeA_UK", "ReviewID": "UR126340131", "Content": "A very nice hotel in a great location overlooking Notre Dame. There are tons of bars and restaurants within seconds of the hotel and it is a couple of minutes walk from the Metro. The staff is friendly and efficient. The rooms are small but nicely decorated (in a fairly unique way) and the furious traffic outside can't be heard if the windows are shut. Overall, if you are on a short break this would be a very nice choice even though it is a touch pricey for what you get. You are paying a bit of a premium for being in a great location.", "Date": "March 19, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Los Angeles, California", "Title": "“A surprising little delight!”", "Author": "JPolancoCard", "ReviewID": "UR125266508", "Content": "My husband and I stayed at this cute little hotel last week and absolutely loved it. The location is amazing, the staff is friendly and helpful and the hotel itself is cute and charming. When we arrived at the hotel at 9am, the room was ready and we were allowed to check in early which was awesome considering we had just endured a 12 hour direct flight. However we waited for an hour because I requested to be moved to a room with a better view of the Notre Dame Cathedral and that room wasn't quite ready yet. It wasn't a big deal, we just waited in the lobby and had breakfast while they prepared the room for us. About the breakfast...it's 9 euros per person for a baguette, two croissants, coffee and orange juice. At first I thought this was pretty steep for bread, coffee and o.j. so the following day we went out to have breakfast elsewhere and it turns out breakfast is the same in all of Paris. Bread, coffee and oj. This was a little hard for us big American breakfast eaters, but we adapted! After realizing the breakfast situation, we ordered breakfast in our room every morning and ate while we got ready to go out and venture the city. Plus it was a delight having breakfast with the curtains open and admiring the beautiful view of the cathedral and the city from our room. The receptionist during the day was so awesome and helpful. She helped us book dinner and show reservations. She also had a lot of recommendations which were greatly appreciated. The hotel itself is nice. If you're expecting the Ritz Carlton, this isn't the hotel for you. However if you want a feel of what real Paris feels like and want a great central location, stay here. Behind the hotel there's a ton of cute little sidewalk cafes, shops and bars. It was fun just walking around and absorbing the scenery. Make sure to get a room with a view. It's a little extra than a room without a view but so worth it! The view makes this hotel worth the price. The room is small, which is expected from Paris, so having the view definitely helped us from getting claustrophobic. Overall we had a great time! I mean it's Paris for Gods sake! My husband and I absolutely loved the city and can't wait to be back!!", "Date": "February 27, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Sydney, Australia", "Title": "“Great location, funky decor”", "Author": "Br1g3tt3", "ReviewID": "UR125258858", "Content": "The location of this hotel is fabulous - the window of our room looked out onto Notre Dame Cathedral. The staff were very helpful and we were grateful for their assistance when we arrived before check-in time. The interior, designed by Christian Lacroix, was funky without going over the top. Everything about this hotel was wonderful!", "Date": "February 26, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Sleep Quality": "2", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Napa, California", "Title": "“Great Place to stay”", "Author": "napamike", "ReviewID": "UR124879278", "Content": "This is as close to Notre Dame Cathedral as you can get without being in the bell tower... Right across the river and in the heart of the Latin Quarter. Our room was nice sized compared to others we've had in French hotels that are closer to large closets. Breakfast was typical Petit Dejeuner but very filling. Bathroom en suite was great and bed was comfortable. Most of our time was spent out of the room as it should be. Only complaint: we were there in July, height of tourist and students on break season. There is a very active musical scene on the banks of the Seine river, right outside the window of our 3rd floor room. Also the Bateaux Mouches, riverboats, run till early AM and the parties on board tend to overflow off the boat to the shore. My point is, that it was noisy till 5am, then the traffic started up at 6am. If you are there in the summer and are a light sleeper, I'd ask for a room not on the street. Other than that, I'd stay here again no problem.", "Date": "February 20, 2012"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "Sevenoaks, United Kingdom", "Title": "“Great Location”", "Author": "MarshallsMania", "ReviewID": "UR124673233", "Content": "You cant beat the location. We had the room pictured on the web site and the view is sensational. then, when you step outside everything is right there - the Latin Quarter, Metro/RER, good choice of restaurants and romantic walks. Back inside the staff are incredibly helpful and friendly, nothing was too much trouble. Yes as mentioned the rooms are small but not ridiculously so and they are nicely and individually decorated. Yes there is some traffic noise at night (so not for the very light sleeper) but its not too bad and when you wake up pull back the curtain - et voila!", "Date": "February 16, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "UK", "Title": "“Great boutique hotel”", "Author": "jonpower", "ReviewID": "UR124672137", "Content": "A really great find in Paris! Situated literally across the road from the B line of the RER so you are on the line for CDG airport and Gard du Nord. The rooms are average size for Paris, well, individually decorated ,with a decent shower and good towelling robes. I'm sure the higher floors have the better views I stayed on the 5th floor, with a great view over Notre Dame and the Seine. Charming receptionist was very helpful. The offered breakfast at 9 euros is adequate with fresh orange juice, bread, croissant and preserves and piping hot coffee.And you can have it delivered to your room! Drinks are available 24 hours a day in the lobby and the reception desk is also manned round-the-clock. I will return - absolutely!", "Date": "February 16, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "3", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "London, United Kingdom", "Title": "“Great location and lovely view”", "Author": "RLS1", "ReviewID": "UR124573658", "Content": "I stayed at the Hotel le Notre Dame during a weekend in Paris with my boyfriend. The hotel is stylish with unusual decor, which I loved. We had requested a room with a view and were allocated a room in the loft conversion, which was very cosy! The room was perhaps a bit too small, with very limited storage space and a bathroom with a sloping roof (which meant you couldn't stand up and use the shower). We had a great view of the Notre Dame from our window though. The location of the hotel was great and we walked to most places, but also made use of the Metro - the station was a couple of minutes' walk away. It was nice to escape to the peace and quiet of our hotel room as the streets outside were so busy. I would definitely recommend requesting a high level room as the traffic noise was deafening at ground level. The staff were friendly and helped us with making a restaurant reservation. All in all, I would recommend this hotel but it is on the expensive side considering the size of the rooms. You're paying for the view! It's romantic though, so worth it for a special occasion.", "Date": "February 14, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "3", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "London, United Kingdom", "Title": "“Romantic and just what we were looking for”", "Author": "Jena377", "ReviewID": "UR124351025", "Content": "We loved this hotel. It was quirky, clean, romantic with great views. The rooms were small but the view of the cathedral made our stay! We asked for a view on the cathedral and a room higher up. It is a boutique style hotel and as it was for a special occasion the price was worth it! Location was good and there are a good few cafes near by. A little book shop nearby too was just lovely and it made it a little more fun as well as romantic. I would definitely recommend this hotel even though it was a little pricey.", "Date": "February 9, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "", "Title": "“Quirky, cosy and perfectly placed”", "Author": "Bun9le", "ReviewID": "UR122968193", "Content": "This is a great hotel for couples who want to explore the city from a small boutique style hotel. It is a very busy corner, but we went in december so we didn't need to have the windows open so no problems with noise. The view of the cathedral and the river is fantastic, especially with the big Christmas tree outside. The metro station is right outside so exploring was easy. The only negative was that the decor needs a little bit of a retouch in places, but only a minor issue. There are some really nice restaurants within easy walking distance - just ask for the list on reception.", "Date": "January 12, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Istanbul", "Title": "“Great View and Location”", "Author": "semrichistanbul", "ReviewID": "UR122705102", "Content": "We spent 6 nights here over the Christmas holiday, its location was so easy to get to from from the airport, just take the RER blue line and get off at the St. Michael/Notre Dame stop take the elevator to the street, turn right go 50 meters and you're at the door. It was the easiest getting from the airport to a hotel we've experienced. The rooms are on the small side but the views and the bed (that was more comfortable than most hotels we've stayed at) more than made up for that. The staff was wonderful, they cheerfully helped us with information and choices for our daily forays around the city and made calls to learn if places were open during the holiday.", "Date": "January 7, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Singapore", "Title": "“Great location and best view”", "Author": "RachLZ", "ReviewID": "UR122210018", "Content": "My husband and I visited Paris in March 2011 for our honeymoon and we loved this hotel. The hotel is located conveniently across from Notre Dame Cathedral, and our room had views of the cathedral. The room was a little small but it was good enough for the 2 of us. The room was beautiful and comfortable, and I love the painting on the wall. Located very near to cafes, restaurants and train station. We even walked to the Louvre! Can't get a better location than this.", "Date": "December 29, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Sleep Quality": "4", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Dallas, Texas", "Title": "“View of Notre Dame Cathedral and Seine River is Fabulous”", "Author": "ArtHistoryTeacher", "ReviewID": "UR121610943", "Content": "This hotel is unique. It is located conveniently on the Seine River just across from Notre Dame Cathedral. The cost is worth the view alone, but be sure to ask for a room with a view on a high floor. You will have to carry your suitcases up one flight of stairs to the reception area. The hotel is situated above stores that are on the street level of a bustling intersection. I think the cafe across the street stays open all night long. My room was small, but had two windows, so it seemed larger when the curtains and windows were open. The tile shower was large. The furnishings in my room were becoming a bit dilapidated...could use some updating and refurbishing. The bed was very comfortable. With the windows closed, the street noise was not too much of a problem. (The location is at a very busy intersection with motorcycles, emergency vehicle sirens, police whistles, etc.) The walls between the rooms are not well insulated, so I heard everything going on in the room next door (Ooo la la!). Guests might also be disturbed by the vacuum cleaner noise and cleaning, which began quite early in the morning. The housekeeper left cleaning equipment and trash in the narrow hallway. It is a small boutique hotel, so there were few people on staff, but the ones I encountered were extremely pleasant and helpful. The simple breakfast (croissant, baguette, butter, jelly, juice and coffee) was served in a delightful breakfast room with beautiful views of the river and cathedral. Personally, I prefer other areas of Paris over the Latin Quarter, so I would probably recommend a different hotel to my friends—especially if they are staying for any length of time. In the Latin Quarter, the restaurants are over-priced for \"so-so\" food, and it is overrun with tourists (most of them drunk). But the Hotel le Notre Dame is a great choice if the Latin Quarter is the location one prefers.", "Date": "December 11, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Millom, United Kingdom", "Title": "“Honeymoon in Paris May 2011”", "Author": "stevenrpark", "ReviewID": "UR119976587", "Content": "Excellent hotel, excellent views. Very clean and very helpful. Breakfast was lovely Great bars and restaurants near by We enjoyed our 3 night stay greatly. Highly recommended", "Date": "October 31, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "3", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Salt Lake City, Utah", "Title": "“Heart of the action”", "Author": "auntinutah", "ReviewID": "UR119682055", "Content": "We spent five nights here at the end of September and really enjoyed it. The location is fabulous and the hotel is unique, kind of funky, has a beautiful breakfast room and the views are wonderful. There are plenty of excellent restaurants nearby. This is a city with 24-7 action and so be warned that with an incredible view also comes the 24-7 sounds and noise of a big city. We liked it because of that.....there is always something happening just outside the window and for us it just added to our experience but if you are a light sleeper you may not think it is as entertaining as we did.", "Date": "October 24, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Brampton, Canada", "Title": "“When I stay here I KNOW I'm in Paris”", "Author": "Christine M", "ReviewID": "UR118864447", "Content": "This is a little gem with a million dollar view overlooking the Seine and the Notre Dame Cathedral. Walking distance to everything - the Quartier Latin, Musee D'Orsay, the Louvre, the Beaubourg, Samaritaine. I walk everywhere from here, but the RER blue line is just across the river and the St Michel station is a block away. I love the rooms - small but very modern and comfortable, with beautiful bathrooms. Tip: skip the breakfast in the lounge and go downstairs to the brasserie, or back into the Quartier Latin.", "Date": "October 2, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "3", "Sleep Quality": "5", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Atlanta, Georgia", "Title": "“Great location and service”", "Author": "Michele L", "ReviewID": "UR118738524", "Content": "You pay for the view and the location at Hotel le Notre Dame but it is most certainly worth it. The views of the Seine and Notre Dame are amazing and being so centrally located and near metro/RER stations/taxi stands was helpful since this was our first visit to Paris. The staff was incredibly helpful when it came to our request for an early check in (we arrived exhausted after traveling all night and appreciated being able to get into our room so early in the day), making reservations and giving directions. We don't speak much French at all so it was helpful to stay somewhere where the staff was bilingual in French and English (and was happy to speak with us in English). The rooms are small - but no smaller than other hotels I'd stayed at around Europe. They are updated and the whole property is very, very clean. Some reviewers had complained about the traffic/street noise, but it didn't bother us one bit. I'd also read reviews about the showers/bathrooms being small and prone to flooding when you used the shower and we did experience that. For us it was a minor frustration in comparison to all the benefits of staying at this hotel. Likewise, as other reviewers have mentioned, we did find getting our luggage up the the hotel's front stairs and in the tiny elevator a bit of a challenge but that was far out weighed by the other great attributes of this property.", "Date": "September 29, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "3", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Sacramento, California", "Title": "“Wonderful location, clean rooms and helpful staff!”", "Author": "mollyparnell", "ReviewID": "UR118590301", "Content": "We had a wonderful experience at Hotel le Notre Dame. First and foremost, the location is fantastic. We walked everywhere in Paris and felt that our hotel was a perfect central location. Notre Dame and Isle de la Cite is right across the Seine river. The Louvre was a 10 minute walk. At night, we would explore the shops, restaurants and bars in the alleys of the Latin Quarter or wander to the St. Germain neighborhood for live music and great food. So...location was perfect. On top of that, the hotel itself was charming, clean and comfortable. Our room was a good size for Paris, had a comfortable bed, lots of plugs and a very nice bathroom. The free internet was a huge plus. The A/C worked well and was essential. The staff were incredibly helpful and were happy to help us with lots of recommendations. We loved this hotel and will definitely be back on our next trip to Paris.", "Date": "September 26, 2011"}, {"Ratings": {"Location": "5", "Overall": "3.0", "Value": "2", "Service": "4", "Rooms": "3"}, "AuthorLocation": "New Jersey", "Title": "“A failed renovation”", "Author": "drbobgold", "ReviewID": "UR118116860", "Content": "We have been guests at le Notre Dame many times in the past decades. The location is unbeatable and the staff unfailingly helpful We have known Simone for 11 years now. The cleaning help gets in the way, opens doors while you are still in bed, and ignores obviously damaged fittings that need repair. The deodorant spray that they use is overwhelming.. However, after spending millions of Euros \"renovating\" there is a startling, in fact somewhat unsettling, new appearance to the decor, not to the liking of these old fogies, and a more regrettable decline in the amenities. Let's start with something as simple as the safe - it is so low to the floor that you need to get on your knees to read the instructions. The hotel has always had a majority of English speaking guests, and Before Renovation (BR) there were a number of copies of the International Herald Tribune in the lobby each morning. After Renovation (AR) there are five copies of \"FIGARO\", and no English journals at all. BR the tv had CNN. Now there is no CNN, and although AR there is BBC and CNET you stumble on them only by chance, as they do not appear on the guide (HINT - push the channel down button a few times from the welcome screen). AR there is no door on the shower, and an awkwardly aimed shower head (ours rotated freely and couldn't be tightened in any position) allows the entire bathroom floor to become wet. No soap dish in the shower. A single towel rack (over the toilet) so that there is no place to hang a wet towel. A sink that has a spigot that is far too long, spilling water too close to the front edge, and that is set into a wooden top that is already showing signs of breakage and rot, although the renovation is less than a year old. Not a single place to open even one suitcase. A useless desk, with no hotel info and no TV channel listing. The new flat screens did not appear to be giving an HD picture, at least in our room (#22, which like 32 and 42 has the corner view, to the Seine and bookstalls to the North and an unobstructed view of the Notre Dame to the East. Still, at Euro 250, or $345 I expect quite a bit more from a *** hotel in Paris, particularly one that is boasting of its renovation.", "Date": "September 14, 2011"}, {"Ratings": {"Location": "5", "Overall": "3.0", "Value": "3", "Service": "3", "Rooms": "3"}, "AuthorLocation": "northbrook, il.", "Title": "“Great location, has some style”", "Author": "starb", "ReviewID": "UR118076882", "Content": "Just needed one night in Paris and wanted something inexpensive but with character and left bank location. This fit. Very small, hallways blocked by cleaning equipment which made it hard to negotiate the area. Staff not very friendly, but that's the French. Receptionist spoke English well which is always appreciated. Rooms small but well decorated, kind of funky design. Small but clean and stylish bathrooms great tubs!! Can't beat the location, right across from Notre Dame Cathedral. We were two older ladies who travel alot, This was acceptable accommodations for us for one night. Just make sure your taxi driver takes you to the correct hotel. There are two with similiar names.", "Date": "September 13, 2011"}, {"Ratings": {"Location": "5", "Overall": "5.0", "Value": "4", "Service": "5", "Rooms": "4"}, "AuthorLocation": "Asheville", "Title": "“Great location, wonderful staff”", "Author": "Ashley28806", "ReviewID": "UR118037991", "Content": "My husband and I spent 4 nights here and thought it was great boutique hotel. You can't beat the location and the staff were very nice. There was noise from the street traffic but we didn't hear any noise from inside the hotel. Will definitely stay here on our next trip to Paris.", "Date": "September 12, 2011"}, {"Ratings": {"Cleanliness": "2", "Sleep Quality": "3", "Overall": "3.0", "Value": "1", "Service": "1"}, "AuthorLocation": "London", "Title": "“Disappointing”", "Author": "0b1", "ReviewID": "UR117898994", "Content": "We came here on honeymoon after staying a night in the Landmark in London. Perhaps staying in the luxurious and wonderful Landmark beforehand made this hotel more of a disappointment for us. This hotel is very pricey considering the size of the rooms and the hostel style service. When we arrived we were not offered assistance with our bags even though it was clear we were struggling. The hotel is TINY and we could barely squeeze down the corridors with our bags (and I am only 110 lbs!). When we went into our room the carpet was soaking wet and you could not walk around the room barefoot or in socks as a result. When I informed reception they said it was because the shower leaked but did not offer to fix it, offer us a new room or apologise for the inconvenience. The shower was a truly dreadful experience. It was blocked (hence the spillage onto the carpet) and so after a couple of minutes we were standing in cold water up to our shins. And the bathroom was also incredibly small. You cannot fit two people in there comfortably. The hotel is in a lovely location but I would not recommend staying here because I do not think that you get what you pay for here. The price does not reflect the service or the rooms. This hotel feels more like an up-market hostel than a four star hotel. A really disappointing element to our honeymoon unfortunately.", "Date": "September 10, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "5", "Overall": "5.0", "Value": "4", "Service": "5"}, "AuthorLocation": "Leicester, United Kingdom", "Title": "“Funky bolt-hole in the centre of the action”", "Author": "Ade010", "ReviewID": "UR117784618", "Content": "Spent my 50th there with close friends. Loved the decor and the location. A real antidote to the hotel chains. Concierge wonderfully helpful. Breakfasts simple but fab eaten overlooking Notre dame. Explore the bars and cafes in the surrounding area.", "Date": "September 7, 2011"}, {"Ratings": {"Cleanliness": "5", "Overall": "4.0", "Value": "5", "Service": "3"}, "AuthorLocation": "", "Title": "“a hotel designed by Christian Lacroix, situated at a very convenient location with a great view of the Notre Dame!”", "Author": "8DolceBaby8", "ReviewID": "UR117481641", "Content": "The hotel itself screamed Christian Lacroix. Its wallpapers, its velvet chairs and tables, even the doors to its rooms. We booked a room with view to the Notre Dame and/or the Seine, so I was expecting something more than the ordinary Parisian streets. But can I just say, oh wow! The Notre Dame is just there for you to stare and admire. I can’t emphasis enough on how convenient the hotel is. Both metro and RER are literally just around the corner, the Notre Dame is across the street, Shakespeare & Company is across the street (for all you book lovers out there!) and there are just about a million cafes downstairs. The hotel offers breakfast at 9 euro per person. But we decided against it for the obvious reason. Our room was clean and big enough for us to jump around with excitements when we saw the view. So if you are thinking about staying somewhere close to everything in the arty area of the town, I’d recommend this hotel for sure. For more photos of this hotel, please visit my blog post: http://dolcebunnie.blogspot.com/2011/08/hotel-le-notre-dame-paris.html", "Date": "August 31, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "2", "Overall": "3.0", "Value": "2", "Service": "3"}, "AuthorLocation": "Marlborough, United Kingdom", "Title": "“Location Location Location”", "Author": "Jules0703", "ReviewID": "UR117216891", "Content": "That's what this hotel has going for it. Right opposite Notre Dame and a short stroll from the Louvre and Bld Saint Germaine. Thats why it can charge 200 Euros for the night. Its about location not the luxury or ambience of the hotel. The hotel, designed by Christian Lacroix is bijoux (small - all of it including your room) and up a set of stairs next to a bar. And on a main road so the traffic noise is deafening at times with the windows open. Or closed. |Revellers enjoyed themselves to the very late early hours of the morning below in the bar and street. But that adds to the ambience and feeling of being in the heart of Paris! That said, it was OK. Shower no bath, and nowhere to put your soap or shampoo when there. A major oversight on behalf of Monsieur Lacroix - but we were told thats how he had designed all the rooms. Minor but irritating - along with the towels gettign wet when you were in the shower as the are stored on the back of the wall in there. The roooms were small. The lounge area was OK, great views were its saving point alongside the hotel was very clean and tidy. The lady on reception was pleasant but we commented probably a little tired of working on reception in the hotel. Responses were pleasant but a bit automated and dismissive - one had to probe to find things out rather than information volunteered- If you dont ask the right question - you will probably miss out on important - or informative - information. Also you HAD to give your key to her if you went out. Very stern about that! On a good point - as I feel I should say something is that when we asked about parking Madame did point out a road where we could park for free. We later found out that all parking is free during August - inthe legitmiate parking spaces that is. Worth knowing! Generally nice clientele. Hotel never busy which was nice. But as we discovered on our second night we could have a fantastic hotel for 70 euro more (August is cheap so book direct with the hotels to get the discount) We booked Notre Dame through Mr and Mrs Smith but L'hotel direct. And instead of it being 400 euro (as on Mr and MRs Smith web) we paid 270 Euro. Go there instead. Its lovely. Brilliant location, decor, service and its quiet and in the heart of things. What more could you ask?", "Date": "August 25, 2011"}, {"Ratings": {"Cleanliness": "3", "Sleep Quality": "4", "Overall": "3.0", "Value": "3", "Service": "3"}, "AuthorLocation": "Tampa, Florida", "Title": "“This is prime real estate with an unbelieveable view of the famous cathedral and the Seine”", "Author": "ccbuzzbuzz", "ReviewID": "UR116807506", "Content": "The hotel is small - rooms are small as in most of Paris...the front desk can be very helpful. Not much in the way of assistance or normal hotel services; but the rooms have been recently remodeled...and the location is dreamy. This is typically Parisian in many regards...don't expect too much with regard to knowledgeable assistance. You stay here for one reason only and that is to have a glorious eye-popping view of the river, the quay and the cathedral.", "Date": "August 16, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "4", "Overall": "4.0", "Value": "3", "Service": "4"}, "AuthorLocation": "Santo Domingo, Dominican Republic", "Title": "“We really recommend this hotel”", "Author": "Miguel T", "ReviewID": "UR116559370", "Content": "Very nice hotel, the rooms are perfect, the location are very convinient and the service was very good.", "Date": "August 11, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "4.0", "Value": "4", "Service": "4"}, "AuthorLocation": "Adelaide, Australia", "Title": "“Quirky, boutique”", "Author": "sue m", "ReviewID": "UR116511664", "Content": "Great location opposite the Notre Dame and the River Seine in the latin quarter, with access to good restaurants and the metro. Friendly, helpful staff ,clean, quirky, reasonable sized rooms.", "Date": "August 10, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Service": "5"}, "AuthorLocation": "Atlanta, Georgia", "Title": "“My first experience in Europe”", "Author": "Mark_25_25", "ReviewID": "UR116405931", "Content": "The hotel isn't very well marked and after searching for a little while we realized it was a glass door to the right of the cafe on the corner. There is a staircase that is right inside the front door and at the top of the stairs is the check in desk. The staff was pleasant and spoke English well enough to communicate anything that was necessary. The elevator was tiny and there was only enough room for one person and baggage at a time. The hallways and the room were also very small. However, after traveling through Europe I have come to expect that places are not marked well and rooms are tiny. The room had a great view of the river and Notre Dame. It is directly over a very busy intersection but surprisingly it was pretty quiet with the window closed. However, there ambulance sirens in Europe are very obnoxious and that sound will definitely penetrate even the thickest walls. Fortunately, I'm not a light sleeper so I did not notice any noise. The bed was not the most luxurious but I now realize that is standard in Europe too. The hotel and room were decorated nicely and it was generally a comfortable stay. The location was excellent for our needs because of the proximity to Notre Dame and the Metro station is directly across the street. The Metro was a little intimidating but with a little help and a map from the front desk it was the easiest way to get around Paris and see all the sights. The hotel breakfast was light but substantial enough to get the day jumpstarted right. The hotel also sold bottled water that I could take with me on the town. It probably cost a little more than I could have paid elsewhere but the convenience was more important to me. Overall, satisfied.", "Date": "August 7, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "3", "Overall": "3.0", "Value": "3", "Service": "3"}, "AuthorLocation": "MANHATTAN, NY", "Title": "“Great Location, A lot of ACTION”", "Author": "ntm4", "ReviewID": "UR116159447", "Content": "The location of the hotel is excellent..we were able to walk everywhere. There is A LOT of noise at night if you are overlooking Notre Dame side. (This is coming from people that live in NYC) The view is just amazing. Outside the hotel, it is a high energy vibe as soon as you step outside the doors- a lot of people, tons of cars on a very busy blvd, souvenir and tshirt shops all around you, hustle and bustle..it reminded me of Times Square in NYC. This was all day and into the night! The rooms were clean and well appointed, the staff were very helpful. We stayed at a quieter hotel in an excellent location on our way back through Paris and enjoyed it a little more for the relaxing, quieter vibe.", "Date": "August 2, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Kilmaley", "Title": "“Personal service coupled with fantastic views has us coming back.....”", "Author": "Niamhaine", "ReviewID": "UR116109836", "Content": "This was the second time that we have stayed at Hotel le Notre Dame in the past two years. The service remains excellent, the bedroom was beautifully decorated and immaculate. We reserved the corner bedroom on the third floor which gives a stunning view of Notre Dame directly across the Seine. We opened the drapes at night and went to sleep gazing up at the gargoyles. A Continental breakfast was available each morning in the breakfast room that overlooked Paris coming to life on St. Michel Blvd. The staff was very friendly and informative.", "Date": "August 1, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "3", "Overall": "2.0", "Value": "1", "Service": "3"}, "AuthorLocation": "Sydney, Australia", "Title": "“Umm.... Amazing location, hotel needs to be gutted and renovated”", "Author": "Transient-friend", "ReviewID": "UR115920368", "Content": "We had a small room, that smelt, had an uneven floor that creaked, barely any closet space, barely any space around the bed at all, teeny tiny bathroom with inadequate shower screen (so you flood the bathroom each time you shower). Although recently renovated by Christian Lacroix (?!) it just seems like a dingy pub covered in pretty colourful wrapping paper. It was not worth €250/night for a room with a view. They simply capitalized on the fact that behind the tree outside my window was the Notre Dame. Yes! The location is fabulous. Right at Notre Dame in the Latin quarter, with a great variety of restaurants, boulangeries (bakeries) and creperies in the area. Unfortunately this also means relatively high noise level till 4am. We usually sleep late so it wasn’t a huge problem but rooms facing Notre Dame or Seine are not for people who want some peace and quiet. Staff was generally pleasant but when they heard we decided to leave early to find alternative accommodation, they almost seemed impatient and irate. They did ask us why we were leaving but their recent change in demeanour made them rather unapproachable.", "Date": "July 28, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "4", "Service": "5"}, "AuthorLocation": "Berryville, Arkansas", "Title": "“The best location in Paris.”", "Author": "McKinney01", "ReviewID": "UR115818322", "Content": "I had been to Paris a few months earlier for a few days alone, and thought my wife would enjoy it as well....so we booked a flight and a room at le Norte Dame, and we could not have picked a better place to stay! Staff was VERY helpful, and no problem what so ever with the cleanliness of the rooms. The breakfast might lack a little to be desired, but if you don't want to get out of the room to go eat it is perfect. The view from our room was unbelievable at night. The best part was....did I mention the LOCATION....we did not realize until a day into the trip there was another world right behind the Hotel! Places to eat one right after another 25 steps from the front door. The long and the short of this Hotel is it is Amazing, you will not find a better place to stay for the money! WE WILL RETURN", "Date": "July 26, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "2", "Rooms": "5"}, "AuthorLocation": "Perth, Australia", "Title": "“My favorite hotel of all- just a shame about the noisy location.”", "Author": "Spreadthelove", "ReviewID": "UR115358700", "Content": "Loved this hotel- the rooms are divine- bathrooms larger than expected. Staff fantastic. For a 3 star I was thrilled- I am usually a 5 star tossed but wanted to stay somewhere a little quirky for my daughter. Not suitable for older people as you have to lug your cases up the stairs - no porter etc. The concierges were a one woman/man miracle. Would have loved room service. As a 50 year old the location was a bit full on and busy - if I could have picked the hotel up and move it 3 blocks back into a quiet street I would give it 100%:)", "Date": "July 14, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "4.0", "Value": "4", "Service": "3"}, "AuthorLocation": "Glenmoore, PA", "Title": "“PERFECT Location”", "Author": "mcdhj1980", "ReviewID": "UR113177811", "Content": "This hotel was perfectly located!!!! We could see Notre Dame from our window! There is a subway stop across the street. And there are plenty of restaurants within walking distance. The hotel was recently renovated and is beautiful (the only negative is the extremely small elevator...with luggage you can really only use it one at a time). The staff is friendly and speaks perfect English. The breakfast is ok; you are better off going to a cafe on your own, unless you are pressed for time. The location is really the reason to stay here, you will not be disappointed!!!", "Date": "June 13, 2011"}, {"Ratings": {"Overall": "3.0", "Service": "4"}, "AuthorLocation": "Leicester, United Kingdom", "Title": "“Fab hotel but final night ruined”", "Author": "CarlandSuzanne", "ReviewID": "UR112744319", "Content": "Amazing location, and although it was noisy like some of the reviewers have stated it is in the heart of an amazing district with views over the Seine and of Notre Dame. Room was fine, funky decoration which we thought was really cool but a fridge and kettle would have been good. Probably not a good hotel if you can't carry your bags as the lobby is up a flight of stairs from the street. Reason for only three stars is that on our last night there was loud banging below us from ten until eleven-thirty and smoke rising through the floor, followed by a really unpleasant smell of chemicals - went down to reception and found them welding one of the beams in the ceiling below us. Our complaint was met with a \"sorry, but we had to do it\" - it should have been done in the daytime, or we should have been warned and offered a move to another room. Poor ending to a great stay.", "Date": "June 11, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "4", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "London, United Kingdom", "Title": "“Fabulous location and wonderful staff”", "Author": "TheWilds42", "ReviewID": "UR112687156", "Content": "I have just returned from a three day stay with my daughter. It was my daughter's first trip to Paris so I asked the hotel to give us a room with the best view. We had a corner room on the fourth floor and we could see Notre Dame , lit up at night, from our bed!! The area is lively and exciting and within a short walk from many of the major attractions. The hotel staff could not have been more helpful - any questions we had were answered or researched immediately. Cant wait to go back ! On the first morning we had breakfast at a local restaurant but found it to be expensicve. The second morning we had breakfast within the hotel ( with the same views) it was very good and excellent value.", "Date": "June 11, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "3", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Nashville, Tennessee", "Title": "“Best Hotel of Our Trip”", "Author": "KESW", "ReviewID": "UR110728450", "Content": "My husband and I stayed here for 4 nights on our honeymoon. It was by far the best hotel we stayed in during our European travel. The room was very clean, the staff was very nice and accommodating. They went out of their way to make us happy, gave us directions, advice, and even helped us with our terrible French. We stayed for three nights in the corner room, which was large, with a view of Notre Dame and a bathtub. We liked our stay so much that upon our return from Normandy we booked another room. This room didn't have a bathtub (other rooms with bathtubs were booked), so the room was smaller, but we could lay in bed and view the Cathedral. I didn't give five stars for value considering the current USD to Euro. At the time it was $1.51 per Euro, which meant we were shelling out 50% more to stay here. If you want to spend a little more in order to stay here, I recommend spending the extra for a bathtub and view of Notre Dame. These two insure you are given a larger room. Otherwise, I don't think this hotel would be worth the price. Taking a bath in a very clean room over looking Notre Dame with a glass of wine is about as good as it gets. I think. Also, the best ice cream of my life is located in the alleyway behind this hotel. Amorinos. May sure you stop by.", "Date": "May 31, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Melbourne, Australia", "Title": "“Book this for a special Paris experience!”", "Author": "JWKD", "ReviewID": "UR107169575", "Content": "I have been to Paris several times previously, but this trip was a highlight, partially due to thus fantastic hotel. Situated directly opposite the Seine and Notre Dame, with a Metro station 1 minute away, this location is hard to beat. The hotel itself is delightfully quirky, and all rooms have been uniquely styled by Christian Lacroix. Our room had some delightful touches like plush carpet that looks like tiles/paving, a stone sink and a fabulous deep bath. Also, we couldn't afford a room with a view ( we had a courtyard view which was actually no view at all) but they had helpfully fed in live web cam wirh a view of Notre Dame cathedral onto a huge flat screen plasma tv. Breakfast was wonderful, 9 euros fir some lovely croissants, coffee, juice, baguettes and hot chocolate, with a perfect view of notre dame through the breakfast window. Staff were consistently friendly and helpful, although there is no room service. If you are looking for a charming, clean hotel that is well located and a change from bland, predictable hotels, book this hotel!", "Date": "May 6, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "1", "Overall": "2.0", "Value": "3", "Sleep Quality": "1", "Rooms": "1", "Location": "5"}, "AuthorLocation": "Vladivostok, Russia", "Title": "“Great location and staff, but very dusty, cramped and rickety”", "Author": "Kseniya_LadyRider", "ReviewID": "UR106632692", "Content": "First I want to appologize for the negative review. I rarely express my unfavourable opinion in public, but... it was really the worst hotel I've ever stayed at. The most unpleasant point was a lot of dust all over the hotel that we could clearly see in the air. There were those carpets powdered with dust everywhere. I understand that the building is old, but therefore carpets are definitely not an interior decoration material in the present case. You can smell the stagnant air just having entered the building and imagine if you spend there all the night... The room was ridiculously small even for Paris and it was obviously tilted to one side. Furniture was old and rickety. I'm sorry, but it is evidently not a 3-star hotel. But yes, I admit that the location is really great - a tourist hot spot. RER/metro station is just overby as well. And the staff was very friendly and helpful, thanks to the girl on reception who was so kind to print a map for me to find one place I wanted to visit. So, I'm sorry, but with all your hospitality and great location rooms and building itself are unacceptable for a good stay in Paris.", "Date": "May 3, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "West Sussex, UK", "Title": "“Amazing view, relaxing hotel”", "Author": "MissHoolie", "ReviewID": "UR104921127", "Content": "This hotel has the most amazing view of Notre Dame Cathedral - we had room 52 which was on the corner of the street, giving us views along the Seine as well as the cathedral. Our room was a decent size (for Paris!), the bed very comfortable and we found the hotel to be pretty quiet, apart from the traffic hum outside which was a constant feature. This added to the feeling that we were right at the heart of Paris and we enjoyed watching the crowds of people moving around the area outside. The room was clean and well equipped although we would have liked a mirror in the room itself and not just the bathroom and a shelf in the bathroom would have made things easier - but these are minor niggles The staff on reception were welcoming and spoke perfect English. The hotel has a very laid-back feeling about it in terms of atmosphere. Breakfast was fine and served in the lovely lobby overlooking the cathedral. The hotel is very close to many reasonably-priced restaurants but we would recommend Le Petit Chatelet (which is practically next-door!) for a wonderful meal and friendly service in non-touristy surroundings. We really enjoyed staying here and would readily return!", "Date": "April 21, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Exeter, United Kingdom", "Title": "“The best location you could possibly have for exploring Paris”", "Author": "4hindstrete", "ReviewID": "UR102402352", "Content": "We arrived at the Hotel in the afternoon and within a few moments of checking in we were able to explore the area surrounding the hotel. We were in the centre for everything we wanted - bars and restaurants galore! The view from our room was spectacular as we could see the Notre Dame Cathedral. A wonderful sight, especially at night.. It was so easy to access the Metro and when we went back to the Airport it was effortless. We thought Paris was extremely expensive even for a beer and a glass of wine in one of the bars, but it is such a wonderful city.", "Date": "April 1, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Punta Cana, Dominican Republic", "Title": "“Great value and location.”", "Author": "SantiRoca", "ReviewID": "UR101838421", "Content": "We were two couples and one child. The reception staff was very pleasant and helpful. The underground and RER is right crossing the street and we could see Notre Dame from our room. The rooms are very comfortable. I really recommend this hotel.", "Date": "March 28, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Thunder Bay, Canada", "Title": "“What a view!”", "Author": "butterflycats", "ReviewID": "UR101610839", "Content": "My teen and I stayed here last July for three days, but it was not long enough! We had a corner room, and could see Notre Dame Cathedral right out our window on the fifth floor. As usual, rooms in Paris are small, but this one was beautifully decorated, as it was just redone by Christian LaCroix. The room was quiet until you opened any of the one of three windows and then the neverending Paris traffic was quite loud, but I loved to hear the noises of this so beautiful city! There is a great restaurant across the street that is o pen 24 hours a day and a fun place to sit and people watch. Also, around the corner is a little laneway that is full of restaurants and shops. It is a very good location to the usual sites and about two blocks to the Metro. The staff was very friendly and accomodating, and were happy to arrange cabs for us when needed (Paris is known for not having enough taxis)I would return here again, but remember, rooms are small, but who cares? You are in Paris!! and have a the most wonderful view of a true part of history.", "Date": "March 26, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "4.0", "Value": "3", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "latina", "Title": "“it's a kind of magic”", "Author": "travellinaRM", "ReviewID": "UR101339328", "Content": "this hotel is a little expansive, but it's situated in the mmiddle of the town, next to the most beautiful places of the city and that it's why it's so expansive...i think so!!our room was full of colours and decoration, maybe too much, nice but i don't like this kind of decor!cleanness coul be better, the stuff is very professional!! however a wonderful week end very romantic moments, paris it's paris!!!", "Date": "March 24, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "3.0", "Value": "3", "Sleep Quality": "1", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Krakow, Poland", "Title": "“Noisy rooms”", "Author": "PawelL", "ReviewID": "UR96576834", "Content": "Well, I was disappointed. We had room no. 62 and it was a mistake. The room was extremely noisy - you could hear not only the street outside, but your neighbours as well. We could barely sleep. The bathroom was very tiny, almost impossible to use. No closet in the room. The breakfast was just average, nothing special. Only positive was the location and the view - fabulous.", "Date": "February 14, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Tokyo, Japan", "Title": "“Funky-awesome rooms. Fabulous views. Great hotel!”", "Author": "WOPDingo", "ReviewID": "UR95496114", "Content": "My partner and I are currently staying here for a quick 4-day trip down to Paris from our place in the Netherlands. We didn't really know what to expect as neither of us has stayed here previously, nor had any of our friends. Consequently, we had to rely mainly on the location and the reviews here on TripAdvisor. We found the hotel through tablet.com, though, which has a pretty great track-record with me. Regardless, the place was wonderful. There were a few small issues, but I can be kind of picky, and these small complaints were more just my own pet-peeves. The location is unbeatable for Parisian sights. Our room, 31, had an unfettered view of the cathedral and the picturesque traffic intersection below. At night, the lights are beautiful. Plus, it's literally across the street from the RER and Metropolitain station. Or, if you're a walker like I am, there's lots of restaurants and bars (gay and gay-friendly, though) just north, across the Isle de Cite near Hotel de Ville. Or just hop the trains and head to other areas of the city. The building itself if typical of Parisian architectural charm, which I think lends to some of the small complaints I had. The rooms are on the small side, so if you're traveling for an extended period of time with large suitcases, it'd be best to avoid this hotel. Also, there's no elevator from the street level to the lobby. And the elevator from the 1st floor and up is kind of tiny. The rooms are funky and oddly decorated, but in a really great way. For instance, our room has carpet that looks like hardwood flooring. The Renaissance tapestry that is our bed's headboard is quirky - and the bed is VERY comfortable. I can guess most/all of the rooms are likewise kitschy. But it gives a really upbeat and modern feel. However you want to describe it, they pull it off well. The bathroom is small, but very well appointed and functional. If you've ever been to Japan, then you should be fine with this. In the shower, however, the hotel has decided to use a glass partition to keep water in the shower \"area\" instead of doors or a shower curtain. I'm sure this is a space-saving feature. However, the partition is probably 10-15 cm too short, and there was a fair amount of water on the floor after the shower. Not a lot, mind you, but enough that about 1/4 of the bathmat was completely soaked. There was also not a lot of ventilation in the bathroom itself, so steam could be an issue. Finally, and I'm sure these are due to the age of the building, but water pressure was iffy and the temperature was highly susceptible to the toilet-flushings and shower usage of other guests. Neither was a huge problem, but I did get a few jolts of cool water during my shower. But in all, not a huge deal by any means. The location is great, but presents its own set of concerns. The intersection and the view of Notre-Dame are great, but the intersection itself is apparently a hotbed of activity until about 2 am. Thin walls (I presume) and tall windows mean that we could hear a few shouts of good-natured revelry really early in the morning, every morning, as well as sirens from an ambulance/police car or two. Our room came with breakfast and WiFi included. The breakfast is continental and includes pain de chocolate, a baguette, and a croissant for each person. Coffee and orange juice are pretty much automatic. The food was great and the service was quick. Both of us really appreciate the free WiFi, which is so uncommon in American hotels (many of which tout themselves as having 4 or 5 stars) that it's almost ridiculous. Overall, great place. I would definitely stay here again and I've already recommended it to friends.", "Date": "February 4, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "3", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "London", "Title": "“Great location and lovely rooms!”", "Author": "citiygirl", "ReviewID": "UR94735105", "Content": "The Hotel Notre Dame is conveniently located on the quay facing the Notre Dame and our room had a brilliant view over the river to the cathedral. Step off the busy street and into the calm of this great hotel. Our room was beautifully decorated, extremely clean and had comfy beds. I had requested a bath and the staff had ensured that the room had a bathtub (which also had a shower attachment). The hotel is only a minutes walk from the Metro station and the RER so you can get straight here from Paris CGD airport without changing trains. The bar is open 24 hours and the prices are similar if not a little cheaper than the touristy places in the Latin Quarter so you can end the day with a drink, while admiring the view. The staff are very helpful and suggested a restaurant about 10 minutes away which was full of locals and served great food. Overall, the hotel is good and although it is quite pricey, you do get what you pay for!", "Date": "January 28, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Location": "5", "Rooms": "5"}, "AuthorLocation": "London", "Title": "“Stay here! You won't regret it.”", "Author": "narnis", "ReviewID": "UR92251058", "Content": "Writing this from our room! Location is perfect, views of notre dame and close to the buzzing restaurants and bars of the Latin quarter. The room (33) is spacious by parisian standards! We have stayed in smaller more expensive hotels. The staff were more than helpful with restaurant reservations. This boutique hotel is a great find and we will return!", "Date": "January 9, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Sleep Quality": "4", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Malmo, Sweden", "Title": "“This is a pretty charming hotel w psychedelic rooms”", "Author": "handelsson", "ReviewID": "UR90970179", "Content": "I liked staying a night at this hotel, since it was well situated and the staff friendly. Room access was a little bit difficult, since everything was so cramped in the elevator and stairs, but not a big problem. Staff is friendly! Avoid staying in the room on the same floor as the reception, since you will feel/hear the subway and all arriving guests in the stairs. A colleague of min experienced this.", "Date": "December 29, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Davis, California", "Title": "“Great location and staff”", "Author": "Fred32283", "ReviewID": "UR89077103", "Content": "We spent three nights int his hotel. Was my first time in Paris and I loved the view of NOtre Dame from the room. I hotel is right on the Seine and the amazing subway and rail system is immediately accessible. We loved walking around the streets in the area and found many gems for shopping and eating. We discovered and attended a concert in the nearby 12th century church. What a treat. The hotel was comfortable, the staff very helpful and freindly. Although the traffic was nosiy with the windows open, the closed windows made for a quiet night. My only complaint was the lack of a true shower: the bathtub shower is a bit tricky and requires practice so as not to soak the entire bathroom from a poorly aimed shower nozzle.", "Date": "December 5, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "BC", "Title": "“Charming and artful hotel”", "Author": "sjfBc", "ReviewID": "UR88765275", "Content": "I stayed at the hotel for 2 nights in November with my husband for a work trip. The rooms are beautifully decorated. If you like unique and artistic decor, this is a great place to stay. The location is also incredible with views of the Seine and the cathedral. For a very reasonable price, you get an amazing paris hotel experience and can discover most of the city by foot when you walk out the door. The only problem would be accessibility for people as there is no elevator to the first floor and only a tiny one to get up to the rooms. Also, the view of the \"courtyard\" is really not a view at all.", "Date": "December 1, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Kent, England", "Title": "“Fantastic location - small and funky”", "Author": "MikeyB63", "ReviewID": "UR87748619", "Content": "If location is everything then hotel has everything and more. Easy to get to by metro, surrounded by an amazing array of great restaurants, Notre Dame and Saint Chappell just across the bridge, a Batobus stop 5 minutes away. Staff were keen to help, relaxed and polite. Our room was small, eccentrically deocrated but thats in a really good way and clean, warm and well appointed. My wife and I will return and we're very happy to recommend this hotel to anyone that wants something good and a bit different.", "Date": "November 21, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "3", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Denton, Texas", "Title": "“Very nice little hotel on the canal”", "Author": "doubleC96", "ReviewID": "UR86521699", "Content": "This hotel was recommended to us and I am glad it was. I would not have picked it out on my own, but now recommend this to others. It appears recently redecorated or something as everything was nice and clean and new looking. It is small feeling especially for someone from USA. Try to bring small sized luggage so it is easy to carry up the stairs to 2nd level where reception is. There is a small elevator from there to all other floors. There is a small breakfast and bar area but we did not try this out due to our one night stay. Our room was on 6th floor facing the canal and had plenty of room but was an interesting loft arrangement where the sleeping area was up a fairly steep and narrow stair case. I think only the 6th floor rooms were like this. These stairs were no problem unless you tried to go to the restroom during the night in the dark. It is a noisy area of town with lots of activity and busy streets...but with the windows shut we had no problems sleeping. Excellent view out the window to see Notre Dame and the canal. Very close to RER B rail stop with elevator access to below street level where train stop is. What I would call the alley behind the building is packed with shops, bars, cafe's, and on the evening we were there had lots of people. I highly recommend the crepes made there in front of you at the end of the alley...can't remember the store name. We were there the day before the various worker strikes at the time really started to take effect so that was the only negative part of our travel was the time it took to travel by train from there to CDG airport (1.5 hours for us)...and the train was packed until we reached the Nord Station and had to switch over...then not so bad. There are plenty of places to eat, gift shop, and the canal tour starting points are within 5-10min walk (at Pont Neuf). The two different hotel staff people we spoke with were very helpful and spoke good english. Again, highly recommend this hotel...especially given the price per night we paid compared to some other options that we were originally looking at.", "Date": "November 9, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "London, United Kingdom", "Title": "“Made proposing so much better then it already was”", "Author": "Marek1982", "ReviewID": "UR86040596", "Content": "I wanted to take my girlfriend to Paris to propose to her because she has an infatuation with the city. I wanted to surprise her so I told her I would book the hotel and knowing that she always wanted to stay near the river Seine and to have an amazing view. The hotel Notre Dame was the only one I found that fitted the bill and although I was worried about the crazy decor I still booked it and I am very glad I did. My now fiancée told me that the location was amazing. It felt safe and there where so many cafe's that we where spoilt for choice and you never get bored of looking at the Notre Dame day or night. We where only staying there for 32 nights and the hotel suited us perfectly. I kind of feel that if you where going to stay a week or so you might get a bit frustrated but I would recommend this hotel to anyone. Very happy memories.", "Date": "November 5, 2010"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "California, USA", "Title": "“Great Location, Great View”", "Author": "atk1031", "ReviewID": "UR84532611", "Content": "We booked this room as an end-of-trip splurge for its view of Notre Dame (and also because it's all no-smoking). We had a corner room (41), which has a stunning view of Notre Dame and a good part of the Seine. The location is excellent from the standpoint of being close to transportation, restaurants, and sights, not so good from the standpoint of LOUD street noise (horns, sirens, discos) and a gauntlet of tacky souvenir shops occupying most of the sidewalk between it and the RER and metro stations. However, Rue de la Huchette, behind the building, is surprisingly quiet and contains dozens of restaurants with good food, and reasonable prices in many cases. Like other reviewers, we were not happy to be greeted by a narrow and fairly long set of stairs that we had to climb with our luggage. The desk clerk was friendly and efficient, but disappointingly could not provide two (punch card) room keys (when multiple keys are available even in Thimpu, Bhutan!). She did offer the option of a dummy key that would turn on the lights, however. The elevator is good for a maximum of two people, or one person plus luggage. Still, fitting a lift at all into this ancient building must have been a trial. The room had been modernized to the maximum possible extent to provide modern conveniences without destroying the character of the ancient building. The bed was comfortable and featured the best pillows I've found in any hotel. For antiquarians, the view straight up while lying supine on the bed is a trip into the middle ages. Don’t be put off by the uneven floor under the new carpet; it’s been there for hundreds of years and isn’t going to break under you. The completely modernized includes large, fluffy towels and two terrycloth robes. However, the shower has perhaps the worst thought-out design I've ever encountered. There is no ledge or dish for soap, shampoo, etc. -- nowhere to put the stuff except on the shower floor (not a good place!). The door runs only half the length of the shower (usual for Europe). This would not be such a problem, except that the bottom lip of the shower stall is only about 2.5 cm high, so that water runs freely over it and onto the floor. Both problems could and should be fixed easily. The breakfast was not a bad buy, in that it included fresh-squeezed orange juice and excellent breads, but it would have benefited from the addition of a little protein, like cheese or yogurt. Bottom line, this is a good hotel, but next trip to Paris I would be far likelier to stay at another hotel, primarily because of the wide, busy boulevard itself and the tourist junk shops intruding into the sidewalk – annoyances that did not exist when the building was new.", "Date": "October 23, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "New York City, New York", "Title": "“Great location”", "Author": "Halkis", "ReviewID": "UR84260437", "Content": "The location is great. Apart from the obvious Notre Dame staff the hotel is literaly on top of a subway station. If you fly to CDG you just have to take the RER and in 30 minutes you are at the hotel. The room was very big for Paris. The internet connection was decent. The only negative was that there was no refrigerator in the room, and a small bottle of cold water in Paris costs $5, completely ridicilous.", "Date": "October 20, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "2", "Sleep Quality": "4", "Rooms": "2", "Location": "4"}, "AuthorLocation": "Guernsey", "Title": "“Time for Mr & Mrs Smith to knock this off the list!”", "Author": "RMHH", "ReviewID": "UR83721538", "Content": "Good location but dated quirky, weird angular rooms and impossibly small bathrooms with impractical shower. Also poor value compared to other hotels we have stayed in. It's disturbing that this is on the Mr & Mrs Smith list!", "Date": "October 16, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "3.0", "Value": "4", "Sleep Quality": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Tasmania", "Title": "“Quirky and Great Location”", "Author": "tassiefoodie", "ReviewID": "UR83244081", "Content": "We stayed for two nights at Hotel Le Notre Dame at the end of our holiday. We had a corner room with a fantastic view of the Notre Dame cathedral, even from the bathroom! The rooms are small but the wow factor is the way it is decorated and of course, the view. We did not have any problems with noise. The breakfast and bar area on the first floor is comfortable and we took advantage of the amazing decor again by having breakfast on both days and a few glasses oc champagne. Overall, a nice place to stay for a few days, with friendly staff, but would recommend an apartment if you wanted to stay for a week or longer.", "Date": "October 12, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Moscow, Russia", "Title": "“very nice hotel in the middle of Paris”", "Author": "Dima070", "ReviewID": "UR81599333", "Content": "My stay in this hotel was comfortable.The staff was kind and professional,I felt myself like at home.The room I was staying was realy cosy and had incredible view on Notre-Dame.", "Date": "September 30, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Adelaide, Australia", "Title": "“WOW, WOW, WOW!!!!”", "Author": "wendy1461", "ReviewID": "UR80513648", "Content": "I spent 4 nights at this Hotel & was blown away by it's location, staff & quality. It is diagonally across the road from Notre Dame, walking distance from The Louvre and has a subway (Metro) train station across the road. Located around the Hotel are restaurants and shops. The best restaurant we ate at, recommended by the night manager was the Petite Chateleau, a little brown coloured restaurant....fantastic food minus massive taxes etc that other restaurants charged (totaling up to approx 50%) The Hotel interior was designed by Lecriox (I thinks that's the spelling) very very cute...chic!!! Breakfast at $E 8 was ample and there is a little bar where the prices look expensive but is good value after drinking outside in cafes & bars....this includes water, coffee & alcoholic drinks. I recommend this Hotel with it's fantastic air conditioning, clean comfortable rooms, great friendly staff and an amazing location.", "Date": "September 21, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "3", "Sleep Quality": "2", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Bangor, United Kingdom", "Title": "“Superb location, pretty rooms, great views”", "Author": "43people", "ReviewID": "UR79888076", "Content": "Hotel Notre Dame is 10 ft from the nearest metro / RER station, which is a main interchange station. Travelling to and fro CDG airport is easy. The sight-seeing buses stop 100 yards away too. We found that handier than we might have thought. English is spoken (good English, friendly too) and bar area is very quiet and relaxing. No great range of drinks though, more of a minibar with service really. Fine with us- an oasis of air-con and quiet for coffees and white wine, after the mania of tourist Paris. The lift doesn't go to the ground floor which is common in Paris but a bit irksome on arrival after a long trip. The area is superb, right on the Left Bank but is DOES get noisy at night. I slept fine but my wife was woken by entertainment from the cafes across the little square. It goes on late too - try and get a high floor if possible, I guess. Or stay facing the back rather than the front. The views are superb. Both our room and the bar overlook the river and are shadowed by Notre Dame cathedral. Fabulous. The rooms are small but this is an ancient building and its Europe. They are very prettily decorated and come with free WIFI. Bathroom was great. Recommend breakfast too. It's €9...which is CHEAP in Paris for croissants and bread and coffee and fresh orange juice. We used it each morning, when normally we venture out for breakfast in city breaks. Would stay here again, great base.", "Date": "September 17, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "3.0", "Value": "1", "Sleep Quality": "3", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Istanbul", "Title": "“Bad Value for Money”", "Author": "caydiner", "ReviewID": "UR79324596", "Content": "I decided to book a room with a view of the Notre Dame after reading the reviews and seeing the pictures of the rooms. We arrived at the hotel and immediately saw stairs welcoming us instead of a reception desk. Carrying our suitcases ourselves, we got to the reception. When I saw the tiny (even for European standars) reception, I told my wife that the rooms should be extraordinary for this price range . We were informed that the rooms did not have minibars (but there was a fridge on the reception floor and we could use it) and we were given our room punch-card keys (which I thought was extinct). We got up to our room barely fitting into the small elevator. Our room was small and did not even have a flat/level floor underneath the carpet. The bathroom was small and included a shower instead of a tub but it was clean and neat. The bed was comfortable and decent sized. The room featured a high definition LCD TV and a ipod dock which was nice. The decor of the rooms and hotel in general are created by Christian Lacroix. The traffic noise starts early in the morning even though staying on the 5th floor. The staff was polite and helpful. Wi-fi internet is also complementary. Unfortunately, 250€/night should buy you more the a pretty view and central location and the hotel comes short on that.", "Date": "September 13, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Cookeville, Tennessee", "Title": "“Outstanding”", "Author": "DrZagumny", "ReviewID": "UR78918402", "Content": "Location, location, location! The steps that others have mentioned are typical of Europe (especially Ile de France region) but are ok. Just ask for help! The location is outstanding since it's just down the street from the Metro. The views from the rooms (Seine view) are iconic. Great cafe surround the are (of course)-we skipped the breakfast to save the money and glad we did after see it! You should eat somewhere else anyways because there are hundreds of choices within blocks of the hotel. Staf is outstanding! Helpful and knowledgable about the typical tourist stuff and if they don't know they'll look it up on the web for you. It's by far one of the best hotel stays that I have had in Europe (we travel to Europe about twice a year). Highly, highly recommend! Better for the price than a lot of other Paris hotels I've stayed in over the years. Worth it!", "Date": "September 9, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Northants, UK", "Title": "“Our new favourite hotel”", "Author": "kitbag", "ReviewID": "UR78324438", "Content": "Yep, you have to climb 20 steps just to get to reception, the rooms are not much bigger than the beds that they've somehow managed to squeeze in, the elevator is so small it barely fits 1 person, there's no fridge or mini-bar in the rooms, it can be a little noisy outside at night, but this hotel is absolutely fabulous. Recently refurbished by Christian Lacroix, the interior is, well... oddly unique. Each room is different. We had room 52, which has a copy of Jan van Eyk's Arnolfini Portrait on the wall behind the bed, mixed with a few strange photo mash-ups for good measure. The building is 400 years old and you can tell. The floor (covered in a carpet designed to look like a wooden floor) is spectacularly uneven. The handful of steps from bed to bathroom were down hill all the way. Right outside the window is the Seine (at it's narrowest point), the Ile de la Cite and Notre Dame. All around you is the Latin Quarter, an area of Paris that I love and a good base i think for first time visitors. Plenty of cafes, bars and bistros right on your doorstep. It's an area that stays up late some nights, so you'll find it to be a safe place to walk to and from a restaurant. The ground floor is Le Notre Dame cafe. We spent a late night there watching people hurry through the rain and amusing the waiters with our poor attempts to speak French. They deliberately brought us the wrong drinks, with the right drinks just hidden out of our view. We've stayed in plusher places than Le Notre Dame, but this place really made us feel at home and put a massive smile on our faces. We can't wait to go back.", "Date": "September 5, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "London", "Title": "“Wake up to view of Notre Dame and the Seine - wonderful!”", "Author": "lottie75", "ReviewID": "UR78024830", "Content": "We found this hotel through Mr and Mrs Smith and thought we'd try it out. Usually we stay in the Marais but wanted to try somewhere different. Great welcome, gorgeous room with that amazing view of Notre Dame and the Seine. Super comfortable bed, compact but perfect bathroom and slept really well. We'll definitely return.", "Date": "September 2, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Basel, Switzerland", "Title": "“best hotel in Paris”", "Author": "sadpoet", "ReviewID": "UR77927188", "Content": "The rooms are just beautiful, decorated with so much detail. The sight (in the rooms with view on Notre-Dame) is simply awe-inspiring. Also, the hotel is really close to the metro and it' in the heart of Paris. The best hotel (and the only one I'll ever go to) in Paris!", "Date": "September 2, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Sydney, Australia", "Title": "“Nice Hotel with Great Views”", "Author": "MattnSydney", "ReviewID": "UR76721021", "Content": "Hotel Le Norte Dame is a newly refurbished hotel in a good location but be weary it's right in the mecha of tourist area. If you're trying to avoid the tourist, I would not recommend this area. Also, if you're expecting a full service hotel or even any service, I would not recommend Hotel Le Norte Dame. We had a room with a view of Notre Dame and the scene. The room was a descent size for Paris, was modern, funky, and had great views. I would recommend this hotel if you're looking for a clean modern hotel and don't expect any hotel services.", "Date": "August 24, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "5"}, "AuthorLocation": "San Francisco, California", "Title": "“Noisy but fun location”", "Author": "Lovemyiphone", "ReviewID": "UR73141097", "Content": "We were at the hotel July 12-15 and since we hit the heatwave in Paris the fabulous a/c in the room gets 5 stars. The wireless in our room was great, too. We loved the location but even with double paned windows and ear plugs was awaken every morning around 4am by the people noise in the streets. Granted it was high summer and after the World Cup, but the street noise was crazy. Can't imagine what it is like on weekends since we were there Monday-Thursday. I would likely stay here again, just not in the high tourist summer time. The two really annoying things were no mini-bar or fridge. When it's 95 degrees outside you really want access to cold bottled water and there was no way to do this. Also, the water did get all over the floor from the shower no matter what we did!", "Date": "July 31, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "3", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "London, United Kingdom", "Title": "“Great anniversary in Paris”", "Author": "Wombatin", "ReviewID": "UR72874553", "Content": "Gorgeous little hotel, but definitely over priced. Location is PERFECT and rooms are well appointed and comfortable (although small, but that's Paris!). Would stay again if we could get a better room rate. Breakfast was great and delivered to the room!", "Date": "July 29, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Sleep Quality": "3", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Redmond, Washington", "Title": "“Perfect location...for 2 or 3 nights”", "Author": "Shelley022", "ReviewID": "UR72576846", "Content": "First, you cannot beat the location. Depending on the room, you may have to turn your head to see Notre Dame but you can also see the Seine, the nightlife and people watch from the comfort of your room. It is the perfect location to eat ice cream at 11 every night, wander the Latin Quarter, catch a cab to the Lourve and it's right across the street from where you can grab the open top bus - perfect if you only have a few days and small children to tote around the city. Metro and RER are also within a block. Second, we loved the rooms. They were quaint and quirky and I have had endless e-mails from people asking me where my boys were tucked into fuzzy striped beds wtih a mural above their head. We stayed here with our 8 and 9 year old boys, knowing the typical size of EU rooms, we booked two. This worked perfectly since there are only four rooms per floor, we were able to leave our doors ajar most of the time - our boys had their own room and thought it was pretty cool. That said, it is not a quiet stay. While much quieter than expected there was still quite a bit of noise - traffic and the incessent party boat cruises which encourage drunk passengers to scream under every bridge would stop being \"part of the experience\" after the third night. The elevator is small but is only necessary for check in and out (unless you have physical limitations) - we were on the fourth floor and didn't take the elevator at all.. It is pricey, especially with two rooms, but absolutely worth it for a few nights. If we were staying longer I would select something different.", "Date": "July 27, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Leamington Spa, United Kingdom", "Title": "“A rare treat in Paris”", "Author": "JamieLansdell", "ReviewID": "UR72557255", "Content": "I am a frequent traveller to Paris and i have the highest expectations, my usual haunt tends to be the the old fashioned over priced grandiose hotels scattered around Paris, so reticently i was dragged to this hotel, worrying about the usual horror stories that accompany hotels in the \"tourist trap\" locations of over priced european destinations.....and here comes the sigh of relief, the hotel was a charm!! The hotel itself is \"cosy\" and welcoming, dont come expecting chandeliers and gold leaf, come expecting a warm welcome and enchanting style. the rooms are typically Parissiene (i.e. small) but yet perfectly suited to weary traveller. On a warm summers evening watching the sunset over Notre Dame from the comfort of your hotel room is like no other. then, on an evening go and hit the town and everything is on your door step, talented buskers entertaining on the Seine, the somewhat raucous Latin Quarter is just behind the hotel. but it was simply outstanding for the price. I stayed for one night only before jetting off to Venice and Marbella, so i do offer this view with the caveat that i was here for one night and to party in the latin quarter. In my mind this is the sort of hotel that Trip Advisor was designed for, families and couples trying to find hotels like this, a little treat in the heart of a city and not paying over the odds.", "Date": "July 27, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Houston", "Title": "“Location, location, location”", "Author": "Want_What_I_Want", "ReviewID": "UR70450506", "Content": "I hesitate to review this hotel as I am afraid every Paris traveler will book here and then there won't be a room for me! Though it's recent redo has upped the price, this is a great place to stay in Paris. Views of the Notre Dame, mere steps to the RER and a short walk to the Metro - who could ask for more. But more there is - friendly staff, especially Simone and Julie; rooms fabulously decorated by Christian Lacroix, wifi, great cafes all around and breakfast available on site.. Some of the bathrooms are small and this is a Paris hotel, not an American one so the rooms also trend toward small. But the rooms are well designed, comfortable and you can't beat this view. We have stayed here many times and hope to stay many more!", "Date": "July 11, 2010"}, {"Ratings": {"Service": "2", "Cleanliness": "2", "Overall": "3.0", "Value": "1", "Sleep Quality": "1", "Rooms": "2", "Location": "3"}, "AuthorLocation": "Surrey", "Title": "“Over priced”", "Author": "Riobaj", "ReviewID": "UR70299619", "Content": "For the price I paid, I was expecting a great room with an amazing view. What I got was a tiny room in the attic with a tiny window with no view of the cathedral whatsoever. There's no mini bar, no room service, and the noise outside makes sleeping impossible! All in all, not a great hotel for the price.", "Date": "July 9, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "3", "Sleep Quality": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "North Carolina", "Title": "“Better Than Typical Paris”", "Author": "sv336", "ReviewID": "UR69971157", "Content": "Traveling to Paris from the US you expect staff's lack of English, sky high prices for tiny rooms, great views and mix up with reservations and bills. Well, I have to admit, Hotel Notre Dame exceeded my expectations in a good way. We initially booked 1 city view and 1 court view room. Upon arrival, we found the court view room being virtually a dark closet with beds and shower. The staff was glad to show over available rooms. As I stayed there a few years ago I recalled the interesting 2-level room I had up at the top. Those are called duplexes and cost more. We checked them out and selected #63 with the bed upstairs and large open area below. #61 was also good, but another one with the bed on the level below and useless empty lot upstairs didn't look appealing. Overall, the staff had great English, was very friendly; the hotel was clean, quiet (inside); we enjoyed the breakfast there one morning. The downside (somewhat) was the noise on the street. Our other room was on the 2nd floor and it felt there like being in the middle of the all-day/night street party (which our children enjoyed!). The real, critical for some, downside were the steep stairs and tiny elevator. On the evening of the La Fête de la Musique, on the way out my children got stuck in there. None of the alarm/call buttons worked. My daughter had to call us from he cell (which she luckily had with her). The lone hotel staff person said it would take up to 1 hr for someone to show up. That didn't appear possible with the streets around blocked off with the festival's crowd. If you stepped into that elevator you'd get a heart attack from just a thought of being stuck there for longer than 30 sec. My wife made quite an emotional appeal and firefighters were called in, broke the door and got the children out. You'd think the hotel did anything to acknowledge the situation? Nope. The next morning the manager said it was not allowed for children to ride the elevator alone. Yea - 24 y.o.! But, again, the bill was correct and the spirit of being at the heart of Paris - money can't buy. Speaking of money, I agree with others here that the hotel is overpriced. But it is very reliable, and as long as you're lucky to get a good room and stay away from the elevator: you'll simply love it.", "Date": "July 6, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "New Zealand", "Title": "“Our new favourite in Paris”", "Author": "2travellingkiwis", "ReviewID": "UR67026778", "Content": "This place is just great! OK, yes you have to walk up 20 steps to get to the reception from the road. It's worth every step!! From check in to check out we had a fantastic 4 days here! We were room 52 (the best room in the hotel, it's the one on the website showing Notre Dame http://www.hotelnotredameparis.com/pages/rooms.html ) Great views of Notre Dame and the Seine river. It's on the 5th Floor, so much less traffic noise than you would get at road level. Fantastic views. Funky decor. Yes it's a cozy room...it's Paris! The shower did go from warm to hot and a step would stop the water going onto the mat...but it wasn't that bad, they serviced the room very well every day and changed the damp mat...problem solved! The staff are so great, especially Julie who organised a Moulin Rouge show for us (I wouldn't reccommend that, but I'm sure there are plenty out there who would!). We had champagne in the lounge (they serve Veuve, not the cheap stuff). It was a great place, great location to main attractions and so many restaurants, very trendy hotel, great price, great staff, and a fantastic way to end our tour of Europe. This is where I will stay in Paris from now on (I've had rooms with views of Eiffel Tower, but they are so far away from the action...this is way better!)", "Date": "June 9, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Fort Worth, Texas", "Title": "“Excellent Location--Fabulous Hotel”", "Author": "A_P_GFortWorth_TX", "ReviewID": "UR66330525", "Content": "My husband and I were so pleased with our room at Hotel le Notre Dame. The hotel was renovated in 2009 by Christian Lacroix and are an eclectic mix of textures, images, and materials. The website was offering a \"Rack Rate\" which did not disappoint. It made this exceptionally nice hotel within our price range. The service was welcoming--the staff responded promptly to emails and greeted us in French and English. They were very helpful at recommending activities and restaurants. The bed was very comfortable and we actually did have a view of Notre Dame from our bed! Despite being on a very busy street, in shouting distance from their high level courthouse, where trials went on most of the day, it was relatively quiet and yet so very close to many attractions. For Europe, the room was large, with ample space to store our giant suitcase. The in-room safe, writing desk, and amenities were a nice touch, as was the organic fragrance used throughout the building. There is no minibar in room, but hotel does provide a bar with limited, somewhat expensive drinks. However, there are many cafes nearby to grab a pastry and coffee. Overall, this hotel will not disappoint you. Even though the price may be a little higher than you are considering, it is well worth it due to its central location, friendly and helpful staff, and exceptional comfort and style.", "Date": "June 3, 2010"}, {"Ratings": {"Overall": "3.0"}, "AuthorLocation": "bordeaux", "Title": "“Not bad, but not flawless either”", "Author": "gillesbourdier01", "ReviewID": "UR65502956", "Content": "This hotel has a lot of advantages, but ends up being a bit of a letdown. First of all, I can't think of a better location for someone discovering or visiting Paris. A stone's throw from Notre-Dame and the Seine, a few minutes walk from Saint Germain des Prés and the \"quartier latin\", with its bustling activity and tons of restaurants, bars and theaters, the hotel is located in a small and very quiet street. A big plus! The area is perfectly safe and the train station to the airports is only about 500 metres away.(totally manageable with a rollig suitcase) The hotel is well kept and my room was spotless. There is a big flat screen TV Now the downside: My room (n° 34) was ridiculously small, even by Parisian standards. I couldn't even walk around the bed. The bathroom, though aiming at modern and sober, with its whirlpool bathtub and integrated changing lighting, was unpractical to say the least. There is not a single hook or railing to hang used towels. The smallish shelf over the wash basin was not designed to accomodate more than a toothbrush and a couple of glasses. There is no curtain on the bathtub, so taking a shower will invariably flood the whole bathroom, including, with some skill, your toilet paper. The matress was excessively firm and there is a plastic sheet under the regular sheet (presumably to protect the matress from any unwanted damages). Quite unpleasant. Price wise, I found my room to be anything but cheap at 170 euros a night. A rate of about 140 euros a night would be more appropriate. All in all, not a bad hotel, but I won't return", "Date": "May 27, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Tampa, Florida", "Title": "“Great Location, very clean and friendly staff.”", "Author": "ChadSemans", "ReviewID": "UR63834985", "Content": "My wife and I were extremely pleased with our stay at this hotel. The location was perfect. We had an incredible view of the river Seine and Notre Dame from our hotel window. Shopping and many restaurants were just a short walk away. The staff were very friendly and helpful with all of our travel needs. This was our first stay in Paris and if we return we will stay at this hotel.", "Date": "May 11, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "London", "Title": "“Great hotel”", "Author": "kingbob", "ReviewID": "UR62991770", "Content": "The location was fantastic and the views from the room about as good as it gets in Paris. The staff were friendly and the rooms beautifully decorated. Clean stylish bathrooms too. In terms of style and comfort its 4 star, and in fact almost as good as some 5 star hotels I've stayed in. It had no restaurant, just a lounge area where you have breakfast...but who needs a restaurant in the hotel when you step out the door and have a choice of a hundred restaurants within a few hundred metres.", "Date": "May 2, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Cheshire UK", "Title": "“Great Paris Hotel, location, location location!”", "Author": "CheshirePhill", "ReviewID": "UR62738646", "Content": "I took my wife to Paris as a romantic surprise birthday treat April 24/25th 2010. I choose the hotel based on some of the reviews I saw on Tripadvisor, and was not disappointed. Beware the similarly named hotels in Paris - this one is bang opposite Notre Dame cathedral and has tremendous views of it and over the Seine (Petit Pont bridge). We had a standard room, which had some pretty unique decoration - best see the hotel website, one entire wall had some kind of mural on it, but it was nice, a countryside scene, I think. The room wasn't huge, but the facilities were good and clean. Good shower and ensuite facilities, nice flatscreen TV and clock/radio/iDock, which would have come in handy if I had taken my iPod!! The view was fantastic - the room had three windows, on two sides, looking straight out at Notre Dame cathedral. We loved the location, it was right on the river, very easily within a stones throw....and consequently really easy to walk to lots of major attractions like Saint Chapelle, La Conciergie, The Louvre etc. I would say as a result of the great location, it is very busy. Lots of people and traffic right outside the windows, up until late on. However, with double-glazed windows shut and aircon on (it was 26C when we were there) we had no trouble sleeping right through (pounding the streets all day helps too!). However, we did hear other guests in the hotel at times, some with young children. Great atmosphere around the hotel area, lots of young people (students) enjoying the banks of the Seine, chatting, drinking, playing instruments, right through the evening only a short walk from the hotel. We loved this, it was all really, really nice, not noisy/threatening/irritating in any way at all. Amazingly, there was NO litter left anywhere the following morning - the Parisian refuse collection system is to be congratulated as well as the people themselves! The service was great. The front desk (both lady and gent) were very helpful, recommending local restaurants, calling taxis if required, offering room service, and best of all, no problem at all storing our luggage on the day we checked out for as long as we liked. Oh, and also a plus for location, the RER/St. Michel Notre-Dame metro station has an exit across the road, which means if you travel in from CDG airport with cases, you only have to wheel it about 20m across the street! Very handy! The desk was manned at all times, with a secure exit in/out of the hotel. Slightly tricky to find, it is accessed via a small glass door at the RH side of the brasserie below, and is from first floor upwards. We returned around 2am one night and were immediately let back in with no delay. Breakfast was fine, breads, croissants and jam, tea and coffee at 9 euros each. Great cafe across the street also serves bacon, eggs etc., and our breakfast there was a little more at around 12 euros pp. The hotel has a sauna, but we didn't have time to use that...too busy!! All in all, this is exactly what you need for a sightseeing, walking trip to central Paris, and comes highly recommended!", "Date": "April 29, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Newcastle, Australia", "Title": "“Look no further than this hotel. Brilliant.”", "Author": "lemmingstone", "ReviewID": "UR58686787", "Content": "We booked this hotel as part of a one night Eurostar trip from London. I had no expectations of the hotel other than its proximity to Notre Dame (directly across the street). I have stayed at other Paris hotels and expected something similar. It was fantastic. The location was about as central to main tourist sites as possible. Everything is within close walking distance and Paris is of course a beautiful city to do some walking. The hotel itself is cool. Great interior design and modern facilities. Rooms were very comfortable and our view was of Notre dame and the Seine. The staff were excellent and the overnight staff in particular went to great lengths to help my wife in an emergency. Great place to stay and will definately stay here again when in Paris.", "Date": "March 15, 2010"}], "HotelInfo": {"Name": "Hotel le Notre Dame", "HotelURL": "/ShowUserReviews-g187147-d302993-Reviews-Hotel_le_Notre_Dame-Paris_Ile_de_France.html", "Price": "$293 - $361*", "Address": "<address class=\"addressReset\"> <span rel=\"v:address\"> <span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">1 quai Saint-Michel</span> | <span class=\"extended-address\">5th Arr.</span>, <span class=\"locality\"><span property=\"v:postal-code\">75005</span> <span property=\"v:locality\">Paris</span></span>, <span class=\"country-name\" property=\"v:country-name\">France</span> </span> </span> </address>", "HotelID": "2515104", "ImgURL": "http://media-cdn.tripadvisor.com/media/photo-s/01/66/35/3c/ouverture-21-january.jpg"}}