{"Reviews": [{"Ratings": {"Service": "3", "Cleanliness": "1", "Overall": "2.0", "Value": "3", "Sleep Quality": "2", "Rooms": "2", "Location": "3"}, "AuthorLocation": "Portland, Oregon", "Title": "“Awful.”", "Author": "arveljoffi", "ReviewID": "UR126869504", "Content": "When I travel for business I'm easy to please. A clean room where I can shower, sleep and go to the bathroom is all I need. So it takes a lot for me to give a place a bad review. The good: the guy who checked me in was very, very nice. The toilet, sheets and towels (paper thin) were clean. Free, good wi-fi signal. The bad: The couch smelled so musty that I put a towel over it before sitting on it. I couldn't close the bathroom window because the latch was broken off. The shower was filthy and didn't drain; I stood ankle deep in water. If you're lucky enough to get the loosely-termed \"suite\" you can see the downtown skyline off in the distance, just over the adult video store. All of the other rooms look out on the boarded up motel across the street. The vinyl backing was falling off the curtains, which made for interesting light patterns on them in the morning. And a lampshade had these weird, old water stains. I'm only assured by the fact that the stains went all the way around that it wasn't something more ... bodily oriented. Overall the place was just ratty. I really liked the thick, one inch wide border of ancient dust that circumnavigated the entire room, right where the vacuum cleaner can't reach it. Also, the motel can't be blamed for this, but the traffic noise on Hwy. 99 is terribly loud. This is also the first time I've ever seen what can only be described as wilting plastic flowers. I stayed here once before a couple of years ago in a non-smoking room that smelled like an ashtray. Buzzing refrigerator kept me up all night. Never wanted to stay again, but I didn't make the reservation this time and didn't recognize the name until I drove up to it. At which point my heart sank. The room was cheap. $59 in Seattle awfully low, but you'll get what you pay for. I didn't give it one star because I've stayed in worse. (Nothing will ever beat that awful stay in the thankfully-now-closed Pacific Motor Inn in Springfield, Oregon!)", "Date": "March 28, 2012"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "1"}, "AuthorLocation": "Bothell, Washington", "Title": "“This place is disgusting!”", "Author": "stephanie b", "ReviewID": "UR121674351", "Content": "Avoid this place like the plague! We found about 100 small, black ants all over our room. When we brought this to the attention of the manager we were told that we brought the ants with us and they refused to help us. We were not comped and charged the whole $75. The staff is rude, unhelpful and the rooms are disgusting. There were ants carrying food around and we had not even eaten in the room!!! Worst experience EVER.", "Date": "December 12, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "3"}, "AuthorLocation": "Palo Alto, California", "Title": "“Good cheap clean and friendly”", "Author": "Yvette K", "ReviewID": "UR120596387", "Content": "The room I was given was excellent. It was spacious, clean and comfortable with good amenities. The bathroom was very good. The reception service was helpful and friendly which was important as I was a newcomer. The WiFi service was good. The staff were super-nice, had a chat with you and helped you with anything that you needed. I had to cancel early and Jonathon (staff member) was wonderful in helping me with that. I wished I could have stayed longer as the room was so good and the service excellent.", "Date": "November 14, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "4.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Brookfield, Connecticut", "Title": "“Great Value, A little out of the way”", "Author": "Dan717", "ReviewID": "UR115259628", "Content": "The hotel was a little older, but still clean. They offer coffee and some pastries in the morning. Its about a 5 min walk to the bus which takes about 15 min to get into the city. I had a bicycle with me and made the bike ride from the hotel towards the city which took about 20 or so minutes. If you don't mind taking the bus into the city its a great hotel for the price, if you want to be right in the city I wouldn't stay here.", "Date": "July 11, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "5", "Sleep Quality": "1", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Cairo, Egypt", "Title": "“Cheap and convenient...but super loud”", "Author": "thriftytravelingirl", "ReviewID": "UR104595634", "Content": "This is a difficult one to review because the price and location were both right, but each night we stayed there were parties going on until 3 am and we barely slept. I thought the managers might say something, but nothing. I was a bit surprised they were put next to us since there didn't seem to be many people staying in the hotel. IFFFFF there weren't those parties and I was able to sleep at night, I would give it a much higher rating since the price was great, easy access to downtown, but more importantly easy access to Fremont and RoRo BBQ... ;)", "Date": "April 19, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Portland, Oregon", "Title": "“Low cost and convenient place to stay in Seattle”", "Author": "andrew_cam", "ReviewID": "UR76555484", "Content": "Older motel, probably from 60s, but great place to stay if you're looking for a friendly and convenient place to stay in Seattle. Easy drive to downtown. Within walking distance of Fremont neighborhood. Easy to get to I-5. All in all a great place to stay if you want to be in the city and very good rates.", "Date": "August 23, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Location": "3", "Rooms": "3"}, "AuthorLocation": "", "Title": "“If you're looking for a cheap place to...”", "Author": "lzldmb", "ReviewID": "UR72517004", "Content": "If you're looking for a cheap place to stay within Seattle city limits, this should be on your list. It is a bridge away from downtown Seattle and the universities so while travel time to all the fun things in Seattle is short, you do need to contend with the city's crazy streets. It's located on WA-99 so easy access to the 5 and 405. Plenty of free parking and coffee till 11 so yay for those things. Again, cheap place in Seattle and this should be on your list.", "Date": "July 27, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "2", "Overall": "2.0", "Value": "1", "Sleep Quality": "1", "Rooms": "2", "Location": "1"}, "AuthorLocation": "Regina, Canada", "Title": "“Run away fast from this one boys and girls”", "Author": "CurtKemp", "ReviewID": "UR72023604", "Content": "I searched this one on Trip Advisor and gave it a shot. Bad decision. We pulled in late, after 11. Parked, unloaded and went to bed. Room was very old looking but tidy enough. A strange smell which we never did identify punctuated our stay. I got up early, as i usually do, and went out for a walk to find a coffee and just scout around a bit. Wow. Across the street, almost like a bad movie; very run down motel, old white rag top Caddy in the lot with two other old Caddies parked as well. Two very obvious street walkers were out selling what their momma gave them and a guy came out of one of the rooms and yelled, and I quote\", Get your a#$ back in here right now B*&^h!\". This was 30 seconds into my walk. I was solicited twice in my short, unsuccessful walk to find a coffee, one for sex, the other a soft attempt to try and rob me. I walked back and booked the Space Needle Travellodge for almost the same price at 730 am; when I told them where I was, the lady said,\" OMG, get out of there, we will find you something immediately\". Run, don't walk away from this one.", "Date": "July 23, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Location": "4", "Rooms": "4"}, "AuthorLocation": "Beaverton, Oregon", "Title": "“Friendly staff - low cost”", "Author": "Inscrutable1", "ReviewID": "UR34692725", "Content": "The staff was very helpful and friendly. I was surprised to get two rooms for the price. My TV in the room didn't work, but on my second night they brought in a different one. It was late at night when I discovered that the television didn't work, so that is why they didn't replace it immediately. I wasn't visiting Seattle to watch TV anyway. I wasn't in my room for most of the time I was in town. It was clean and comfortable, however I thought the towels were too scratchy. They should either get better towels or use fabric softener. It is walking distance from Archie McPhee's and several bus stops. I walked to the Fremont area in about 15 minutes. The staff recommended a good restaurant for me too. I would stay here again. I would recommend this place to anyone looking for low cost accommodations.", "Date": "July 14, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "4", "Check in / front desk": "5", "Overall": "4.0", "Value": "4", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Methow Valley WA", "Title": "“Best In imediate area!”", "Author": "tradeshowworker", "ReviewID": "UR21699448", "Content": "We stayed in one of 2 suites first. Was clean, and nice with frig, micro, and couch for $75 plus tax a night. The next time we came they were black topping the parking lot so we stayed at a couple other places in the immediate area. There are some really SCARY, cheaper places on Hwy 99. We were delighted when we could get in the parking lot again!!! This time we got a regular room at a weekly rate of $350 plus tax. It was just as clean, one bed. table w/ chairs, frig, micro, wifi, HBO. The difference from the other \"cheap\" motels is only a few dollars but they treat you like a guest, not afraid to leave your clothes etc. in room, nothing is missing from rooms such as garbage cans, toilet paper holders, door or window knobs/locks, and the towels are thicker than rags. This is the place we'll come when working in Seattle from now on.", "Date": "November 10, 2008"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Business service (e.g., internet access)": "3", "Check in / front desk": "4", "Overall": "4.0", "Value": "4", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Los Angeles", "Title": "“Great stopover value motel minutes from downtown Seattle”", "Author": "DG23", "ReviewID": "UR18547322", "Content": "Stayed there July 18th, a Friday night. The rooms were clean. The decor was spare, as you'd expect for a stopover motel. Had no problems with any noise from any neighbors. Traffic noise was muffled as soon as the doors and windows were closed. The resident hotel manager was particularly helpful. We really liked him. The parking is easy. The buses into downtown and the Space Needle run right by the motel. You have to walk over a bridge and down about 4 blocks, but they're every 15 minutes. The only thing we actually noticed not up to snuff was that the towels were a little threadbare. All and all, this is great stopover value for a motel that is so close to downtown. You can leave your car there all day and take the bus instead of paying 20/day parking downtown.", "Date": "August 2, 2008"}, {"Ratings": {"Cleanliness": "1", "Check in / front desk": "3", "Overall": "2.0", "Value": "2", "Rooms": "1", "Location": "4"}, "AuthorLocation": "Phoenix", "Title": "“refund and left”", "Author": "Phoenix1414", "ReviewID": "UR17848137", "Content": "We stopped in, secured a room, went to the room then re-evaluated and decided to leave. It wasn't very impressive. Signs warning people against using drugs on property and no parties after 11pm. It just didn't seem safe or clean to us at all. The rooms were marred and worn out. They refunded the credit card easily so I appreciated that.", "Date": "July 13, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "missouri", "Title": "“Great Value”", "Author": "caseynolan", "ReviewID": "UR16549756", "Content": "Great Value for the Price! Staff was four star service and very accomodating. Cleans were simple, but clean and cheap. It is also very close to downtown, without having the pay the downtown \"premium\". I would reocmmend this to anyone who is looking for a great deal.", "Date": "June 1, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Business service (e.g., internet access)": "3", "Check in / front desk": "5", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "central NJ", "Title": "“old but clean and cheap”", "Author": "roland65", "ReviewID": "UR5782755", "Content": "It is an older property that shows wear but is clean. We got a room with 2 queen beds and mini-refrigerator for the price of a Motel 6. It is very convenient, about 10 minutes, to the center city - museum, monorail, space needle. It's just south of Green park which is a great place for outdoor activities and families. Further north on Aurora is the bad area, but this owner is very strict. It was as quiet as could be expected since it is on a main road. Would stay there again.", "Date": "September 8, 2006"}, {"Ratings": {"Cleanliness": "4", "Overall": "3.0", "Value": "5", "Service": "3", "Rooms": "3"}, "AuthorLocation": "Vancouver, BC", "Title": "“Good value”", "Author": "mikesc", "ReviewID": "UR3398956", "Content": "It is not a five star hotel, but is a good choice for budget minded travelers. Staff were friendly and rooms were clean. Bathrooms were clean but their towels need replacing; they are fresh, clean, and white, but not very soft. Walking distance to Woodland Park Zoo and a 10 minute drive to downtown attractions. Again a good value for 50 - 60 dollars/night. Will stay there again.", "Date": "April 22, 2005"}], "HotelInfo": {"Name": "Marco Polo Motel", "HotelURL": "/ShowUserReviews-g60878-d123032-Reviews-Marco_Polo_Motel-Seattle_Washington.html", "Price": "$65 - $76*", "Address": "<address class=\"addressReset\"> <span rel=\"v:address\"> <span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">4114 Aurora Ave. N</span>, <span class=\"locality\"><span property=\"v:locality\">Seattle</span>, <span property=\"v:region\">WA</span> <span property=\"v:postal-code\">98103</span></span> </span> </span> </address>", "HotelID": "2515374", "ImgURL": "http://media-cdn.tripadvisor.com/media/photo-o/01/c0/44/48/marco-polo-motel-thumbnail.jpg"}}