{"Reviews": [{"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "4.0", "Rooms": "5", "Service": "5"}, "AuthorLocation": "Washington, DC", "Title": "“Typical Marriott”", "Author": "IntrepidFromDC", "ReviewID": "UR128276706", "Content": "So you pay more for a Holiday Inn than you do for a budget hotel and you can see the difference. You pay more for a Marriott than a Holiday Inn and you can see the difference. You pay more for a Ritz than a Marriott and you can see the difference. Marriott is kind of like McDonald's - no surprises. Rooms always very clean. Rooms at the Suites are larger, with a living room cut out, two tv's...", "Date": "April 21, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "San Diego, California", "Title": "“Beautiful Rooms”", "Author": "Karenrs", "ReviewID": "UR128057501", "Content": "This was the first time we stayed at this hotel. The room was spacious and very clean. The front desk staff was knowledgeable on the area and polite. The hotel is close to the freeway but the rooms seem well insulated and we didn’t hear freeway noise in the room with the windows closed. Our room had a Jacuzzi in it, which was awesome! I would definitely recommend this hotel.", "Date": "April 17, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "2", "Overall": "3.0", "Value": "2", "Sleep Quality": "2", "Rooms": "3", "Location": "2"}, "AuthorLocation": "farmington, arkansas", "Title": "“Have to love traffic noise”", "Author": "dbenish", "ReviewID": "UR127983710", "Content": "this hotel while updated, has TOO much traffice noise, or not enough insulation. breakfast starts at 6:30 so if you have an early meeting, don't plan to eat here. the outdoor pool, hot tub patio area is loveley, but the smell of exhaust from the 15 and the NOISE makes it anything but peaceful. three choices for food within the parking lot, chilis(poor food quality), wendy's (have not eaten at this one, and firehouse grill (good food). room has been updated, bathroom is less than a closet with poor lighting in the vanity area. Bathroom was not clean, nor did it get clean. the faucet in vanity did not produce hot water, but the sink in the sitting area did, but no mirror.good internet, small snack area, and the hot tea water tasted like weak coffee.", "Date": "April 16, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Ludlow, Massachusetts", "Title": "“Great Place, Perfect Location!”", "Author": "PaulZielinski", "ReviewID": "UR121746667", "Content": "This being the first time I had ever been in the San Diego area for a national figure skating competition with my daughter (the skater) and her mother, I did not know what to expect. But, knowing the Marriott name, and SpringHill Suites being one of their brands, I did have some expectations. Marriott did not disappoint. This SpringHill suite is located in the Rancho Bernardo/Poway, a section of San Diego immediately to the north of San Diego's city limits. We arrived at Carlsbad Airport (a less crowded/busy airport just north of the San Diego area...about a 30 minute drive) via LAX. This location is right next to the freeway, the \"I-15\". But, don't let that scare you. Not only was it very convenient to all area points and \"highways\" (as they are known on the east coast, \"freeways\" as they are known on the west coast, and \"motorways\" as they are known in the UK) north, south, east and west in the area, but it was quiet and very well maintained. In fact, the uppermost floor was being renovated at the time of our stay and we hardly ever heard any noise except for one day, but not until it was mid-day. This location has a very friendly staff at the front desk, and a spectacular breakfast room right off the lobby. Complimentary coffee, tea and hot chocolate is available in the lobby 24 hours a day, along with a variety of fresh local fruits like oranges. Anyone who knows me when I travel knows that I prefer to stay at a place with complimentary breakfast. This place had some of the best variety of breakfast buffets to choose from and it rotated daily so you'd never have a repeat of the prior day's breakfast. They had cereals, buns, pastries, bagels, sausages/bangers, make-your-own waffles, milk, juices, eggs, yogurt...and the list goes on. You'd be hard-pressed not to find something you'd eat for breakfast to start your day right. The location had a small, very modest fitness room, and likewise a very small outdoor pool area. Maid service is daily, but one day someone did \"screw-up\" and failed to clean our room. A call to the front desk resulted in a very humble apology and a query of there was anything that may be needed as a result, like clean linens and the like. Linens were quickly and cheerfully delivered to the room by a maintenance/night housekeeping person who likewise apologized for the inconvenience. The room itself was similar to a large hotel room, but had a king bed, sleeper sofa, desk, refrigerator, microwave oven, sink and bath. One thing I did not like was that the king bed was very close proximity to the exterior window and its air conditioning/heating system. When the AC blew, you could really feel it if you were on the bed. A plexiglass deflector shield to blow the airflow upwards would have been good. Restaurants like Chili's, another Marriott branded hotel, a restaurant and a gas station are all interconnected with the property's parking lot. However, other restaurants, churches (St. Gregory the Great Catholic Church is just a few minutes drive east of the hotel and is a beautiful, modern and unique church building to visit!), grocery stores, malls and the like are all within a very short drive...usually less than 5 minutes. All major attractions, like the San Diego Zoo's Safari Park (Escondido just a short drive to the north), Old Town (a State Historic Park a short drive south), beaches (like Torrey Pines State Park/Beach in the LaJolla section of San Diego...a short drive west) are all within a 20 to 30 minute drive. I would highly recommend this location to anyone visiting the San Diego area due to its high quality, value, convenient location and amenities.", "Date": "December 14, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Location": "4", "Rooms": "5"}, "AuthorLocation": "Monterrey, Mexico", "Title": "“Good breakfast, nice service”", "Author": "florenciamartinezs", "ReviewID": "UR120306212", "Content": "Nice hotel, small rooms although they are suites. Very well organized And Good breakfast. Polite service At the lobby, staff tries to help if posible. Free parking, chilis restaurant Just across the street.", "Date": "November 7, 2011"}, {"Ratings": {"Location": "3", "Overall": "4.0", "Value": "5", "Service": "4", "Rooms": "4"}, "AuthorLocation": "Irvine, CA", "Title": "“No frills, but comfortable, safe, and clean.”", "Author": "DrHickenlocher", "ReviewID": "UR118156270", "Content": "Planned a weekend getaway to visit the Safari Park as well as downtown San Diego. I picked this location sight unseen because it was in-between my two destinations and I trust the Marriott/Springhill brand. I was not disappointed. I understand that they're doing some upgrades, and one of the two main elevators was decked out in big cloth drapery to protect the walls. Our second floor room was not yet upgraded, but no big deal. The King-sized bed was comfortable and the furnishings perfectly adequate. Shower pressure was fine, although there's only a single curtain (not double-curtain, no biggie but a style choice). At least the shower rod is curved to provide more room. Toilet and shower are in their own little room apart from the sink, which is good. Didn't use the internet, even though it was free. The mini-fridge kept our drinks cold. And conveniently there's a second little sink in the \"kitchenette\" area. The LG LCD TV worked fine, although I noticed that there's no menu for on-demand programming. No big deal since I was watching the US Open on CBS anyway. The location is what it is. It was convenient for us, but downtown SD is realistically 20-30 minutes away if that's where you're going. There's not much immediately around the hotel except for a Chili's and a Wendy's. Mira Mesa with a big theater, two different supermarkets, and lots of restaurants is exactly one exit south, so that was convenient. Breakfast was typical, although I miss the Jimmy Dean breakfast sandwiches. I still made my own breakfast sandwich out of a bagel, the provided scrambled eggs, sausage, and hash browns. Yummy. Plenty of cereal, juice, and yogurt (both Yoplait and Activia). I also ate like 3 hard-boiled eggs. Nothing blew us away about this hotel stay, but all in all, we were well satisfied and have no complaints.", "Date": "September 15, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "4.0", "Value": "4", "Service": "4"}, "AuthorLocation": "Orlando", "Title": "“Not my preffered style of SpringHill, but still a SpringHill & that's good!”", "Author": "jerrythetraveler", "ReviewID": "UR115900938", "Content": "Stayed here recently while in San Diego, understand that I splurge, but I will never understand why this City (which I like) is so damn expensive for lodging. Every time I go to San Diego Winter, Spring, Summer, Fall, Weekend, Weekday, it don't matter, it is pricey. That said, we were able to get a rate here under a $100, whoo hoo, understand that it was expensive for this type property, I do not like to spend more than $80 for a Springhill, but in this land that is San Diego... it was better than staying in Tijuana. Breakfast was good the staff was great and oh... parking and the area was safe. The room was clean and the area was ok, we had to leave the area to do anything. So if you are not staying on Coronado Island or in the Lamplight District, but you need to get around \"SAM\" Diego!, this is a nice option & that's good!", "Date": "July 28, 2011"}, {"Ratings": {"Overall": "3.0"}, "AuthorLocation": "Portland, Oregon", "Title": "“Decent Springhill”", "Author": "milesandtime", "ReviewID": "UR115546071", "Content": "I haven't spent much time in the Springhill Suites chain of hotels, but I think I like what I've come across here and in.... I think Arlington, Texas. In both locations, I had the exact same room layout. In fact, I wake up in the morning shaking, praying to jeeebus that I'm not back in Arlington. The Springhill around the corner from my company's corporate office is the practical and preferred choice for all business travel into San Diego. Thankfully the hotel staff take pride in what they're doing. The desk staff is very friendly, super helpful... even if you've misplaced your room key... three times... during... four days.. Breakfast is served every morning for a few hours starting at 6:30am. It's hotel breakfast, but it's free and gets you going. The housekeeping staff is on point. My room is sparkling every time I come back. The beds are surprisingly comfortable but the sheets aren't enough for me. This is one of those hotels where no comforter is used (and probably for good reason - I read somewhere that hotels only wash those every few months anyway). It just gets cold in here, or really hot... the wall AC/heating unit is a bit testy... you never know what you're going to get come morning. What feels good at midnight may feel like a total 180 when you wake up. On the plus side, even the cheap rooms have a microwave, mini-fridge and kitchen sink meaning this wouldn't be too bad of a spot for an extended stay. As for businesses immediately around the hotel you've got your typical on-the-road-business fare. A Chili's, Wendy's, USA Gasoline and a slightly over priced seafood restaurant called \"The Firegrill\" occupy the same lot. Do yourself a favor and hop in that rental car and just get out of Poway completely. San Diego is a nice town, the last thing you need to do is work all day then hole up right next to I-15 all pissed off about eating a Chili's night after night. The hotel is legit and I guess the moral of the story is that if you're stuck in Poway for work for a week or longer, this is probably your best bet if your company can't score the corporate rate for the Double Tree Golf up the road a bit. Ours did, but two days after I booked my reservation here. Whatever. Next time.", "Date": "July 19, 2011"}, {"Ratings": {"Sleep Quality": "3", "Overall": "4.0", "Value": "3", "Service": "3"}, "AuthorLocation": "Trabuco Canyon, CA", "Title": "“Nice for Sports Weekend”", "Author": "athomemom", "ReviewID": "UR113115549", "Content": "We were in Scripps Ranch for a softball tournament and stayed at Springhill Suites for two nights. The rooms were spacious for my family of 5 and the breakfast was good for players who were going to be out of the fields all day. We will stay again if we are in town next year for the same tournament. AAA price was much better than the on line best price.", "Date": "June 13, 2011"}, {"Ratings": {"Cleanliness": "2", "Overall": "2.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "3"}, "AuthorLocation": "Aurora, Colorado", "Title": "“True dump!”", "Author": "Healthinformatics_rn", "ReviewID": "UR88795128", "Content": "This place was NOT Marriott quality. It looked and smelled more like a homeless shelter and the mattress on the bed was SO old that it had a fold in the middle of it.", "Date": "December 1, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "3", "Rooms": "3", "Location": "3"}, "AuthorLocation": "NW Chicago Suburbs, IL", "Title": "“20 minutes from just about everything”", "Author": "BK2", "ReviewID": "UR76884047", "Content": "We stayed for 6 nights at this hotel. We liked that we could get 2 beds plus a pullout sofa. It was a bit of a tight squeeze with the sofa out but it was adequate. Staff was friendly and helpful. Breakfast was uninspiring but plentiful. Staff was always restocking the food so even when there were several sports teams in residence there was plenty to eat. The rooms were clean. The pool is fairly small. Internet connectivity was good. We used the business center once and it was fine too. We found that just about everything we wanted to do (SD Zoo, Sea World, LaJolla,Wild Animal Park, etc) was about 20 minutes in one direction or another, with convenient expressway access.", "Date": "August 25, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "schmandar", "Title": "“Great hotel”", "Author": "schmandar", "ReviewID": "UR54940717", "Content": "Excellent location and accommodation. Clean, efficient and great customer service. Highly recommend. We asked for room facing away from I-15 and it was exceptionally quiet.", "Date": "February 1, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Temecula", "Title": "“Has not lost the customer service mentality”", "Author": "MeanieRedhead", "ReviewID": "UR54053371", "Content": "I am the travel arrangement contact person for my office, and I have to say that dealing with SpringHill Suites is both a pleasure and stress free. The business persons I book for often have specific requirements such as local restaurants, near a shipping post stop, right by a freeway, close to the office, downtown, WiFi, Coffee shops, grocery store, mall, I mean, when people travel as often as some do, the creature comforts of home are not too much to ask for at a good price. SpringHills offers wonderful rooms not huge because your having a convention in it, your sleeping or doing paperwork or relaxing after a long death by powerpoint presentation day. The breakfast has always passed muster with my travelers and the rooms are clean, quiet and asking for towels or extra pillows is met with a smile and immediate attention. Late check in, early check in and great rates also a plus. I truly appreciate the personal touch and attention to detail, confirming of reservations and upgrades when possible. Hands down this hotel asked for our business and has kept it, with as much competition and cut backs on travel/expenses for our road warriors, kicking your feet up and working on spreadsheets or making those calls in a comfortble environment can be found here at SpringHill Suites. Keep up the good work we are happy to do business with you.", "Date": "January 21, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Location": "5", "Rooms": "4"}, "AuthorLocation": "San Francisco, California", "Title": "“Nice Hotel; Yet small rooms for a suite & price.”", "Author": "ChefJen", "ReviewID": "UR50390834", "Content": "We recently stayed for 4 nights; hotel is non-smoking which is a big deal to us non-smokers. We were greeted by the front desk daily; always fresh fruit for you to grab in the lobby along with coffee all day. The staff suggested two wonderful spots to eat; Firegrill which is in the same courtyard as the hotel and Sammy's Woodfire Pizza which is just up the road in the shopping center with Von's & CVS. Gas station, Chills and Wendy's also share the courtyard with them. Location was right off of HWY 15 ~ never heard the freeway. Work-out room and pool/hot tub area small & business center has one computer that doesn't connect quickly. Happened to be a busy weekend with lots of teenagers & kids running around the hotel at night. I was a little taken back for the cost of the King size suite just how small it was. The bathroom only had a tub/shower & toilet and the sink was outside the door. The way the walls were in the room really made it feel closed in. The sofa bed was nice to have although we never used it; micro & refrig. worked well; \"wet bar\" and sink were nice options too. Their is a full length mirror behind the bathroom door; didn't know it was there, and a round mirror in the sitting area that was no use at all were it was placed. The bed was comfortable; ceiling fan was nice but not sure if it's needed with A/C in the room. The breakfast was nice and yes, Free! Something there for everyone and the staff kept it well supplied. Overall our stay was nice and the area around was nice as well. We did looking around at other hotels and found a spot we could of gotten more \"room\" in our suite room & only one exit away and offered the same thing for less money. We will probably try the other hotel out next time down. We would however stay here again if the price is right.", "Date": "December 1, 2009"}, {"Ratings": {"Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "4.0", "Value": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Kingwood, Texas", "Title": "“Great Family Hotel”", "Author": "game4travel", "ReviewID": "UR19573323", "Content": "We stayed here three nights with family members. We had a total of three rooms. The rooms were small, but nice enough. Each room had a small living room area with a connecting bedroom and a small bathroom. The toilet and bathtub/shower were in one room, and the sink was outside. Works out well when multiple people are getting ready to go. There were two televisions, which the kids love - no fighting over tv shows. The rooms also had a refrigerator and I think there was a microwave also, but we never used it. Breakfast included a large selection of items - cereals, breads, sweet breads and rolls, fruit, waffles, eggs and sausage. No one went away from breakfast hungry. A computer was available free of charge off the lobby which comes in handy for checking area restaurants and directions. The beds were comfortable, however the bed linen was very wrinkled, worn and tired looking. I would recommend updating the sheets. All in all, a great stay.", "Date": "August 31, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Montana", "Title": "“Very pleased”", "Author": "beenthereb42", "ReviewID": "UR18759390", "Content": "with the Springhill Suites Ranch Bernardo! Our room was not ready when we arrived, but that was our fault as we were much earlier than expected. The commute from downtown San Diego was easy, and the hotel was extremely easy to find off I-15. It was nice having a sit-down restaurant (Chilis) and a fast-food restaurant (Wendy's) across the parking lot. The gas/c-store next to Wendy's was a bonus also. Easy return to I-15 South. When asked for directions to PETCO Park, the staff ahd a map available! All the staff that we encountered were friendly, and extremely helpful. The breakfast room was crowded in the morning with 2 youth soccer teams, but if you are worried about too many people, you shouldn't go to a big city!!!! I am a travel agent, and have high hotel standards for myself and clients--I will stay there again, and will book clients there without hesitation.", "Date": "August 8, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Business service (e.g., internet access)": "4", "Check in / front desk": "4", "Overall": "5.0", "Value": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Fairfax, VA", "Title": "“Very nice hotel, good location, quiet”", "Author": "vcb219", "ReviewID": "UR18137584", "Content": "We stayed 2 nights at this hotel. The location is about 20 minutes from downtown San Diego off of I-15 north. The commute is easy and fast. There is a gas station and 2 restaurants within walking distance, and one exit south on I-15 (Mira Mesa Blvd -west) there are dozens of restarants and stores. Our room was very clean and spacious. The beds were comfortable. We really liked the work area of the room that seemed set aside from the rest of the room. There is a guest laundry, plenty of parking and a complimentary light breakfast. All the staff members were friendly. Overall a very nice Marriott property that we would recommend.", "Date": "July 22, 2008"}, {"Ratings": {"Overall": "3.0"}, "AuthorLocation": "Boston", "Title": "“Good for business travel”", "Author": "BiztravelguyBoston", "ReviewID": "UR13596783", "Content": "I've stayed here many times. The employees are consistently friendly and helpful, the rooms generally clean, and the wireless is solid. Unfortunately, I've never really liked the beds. I may be spoiled from some of the other Marriott and Hilton properties I stay at, but the bedding at this hotel just seems to be a cut below. Location is good, area very safe. Travel to/from downtown can be rough at rush hour - plan accordingly.", "Date": "February 16, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Business service (e.g., internet access)": "3", "Check in / front desk": "5", "Overall": "5.0", "Value": "4", "Rooms": "4", "Location": "3"}, "AuthorLocation": "California", "Title": "“great hotel”", "Author": "CaliforniaEsty", "ReviewID": "UR11274252", "Content": "I stayed at this suite style hotel while on a business trip. The rooms were much better than most of the Embassy Suites that I've stayed at. Bed was very comfortable and the room was clean and updated. The staff was friendly . The breakfast was good but not cooked to order like the Embassy suites. Overall, I would choose this hotel over an embassy suite.", "Date": "December 6, 2007"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Check in / front desk": "4", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "3"}, "AuthorLocation": "chicago", "Title": "“Great Hotel”", "Author": "nguyens", "ReviewID": "UR10291697", "Content": "We stayed here for the Mirmar AirShow and a visit to relatives in San Diego. I pray that the hotel is still ok after the Rancho Bernardo Fires. We had a king bedded suite with a sofa bed room 411. Check in was easy and the staff was very nice. The room was standard in decor and view. They have great weekend rates at right around $120 per night. The room is clean, comfortable and spacious for the price. They offer a good breakfast buffet, but be prepared to eat in the dining area as there are no trays to carry the food back to the room (hint....there is a tray under the coffee maker in your room). The breakfast buffett offered contained cereal, fresh fruit, yogurt, an egg dish, sausage or bacon, make your own waffles, we had sticky rice one morning, hard boiled eggs, cooked oatmeal and a variety of bread and pastry. They are close enough to the Mission Bay area to go to Sea World and far enough North to make the drive easy to LaJolla or Carlsbad (legoland). In the parking area there is a Fish Market restaurant, a Wendy's, a Chili's and a gas station with a convience store. One exit south is a mall with a IMAX theater and multitude of restaurants. We met everyone at Bucco Di Beppos. We also went to the Chuckie Cheese. Granted there were most likely some better choices but that was the best for all the kids in our group. Just East of the hotel was a CVS with a little strip mall around it. I really liked this property. If you are looking to be right downtown San Diego, you are not there. If you are looking for a quiet, suburban location that is close to many activities this is a great place for a great price to stay.", "Date": "October 24, 2007"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Business service (e.g., internet access)": "4", "Check in / front desk": "3", "Overall": "4.0", "Value": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "George Town, Grand Cayman", "Title": "“Provides exactly what was expected”", "Author": "TomCayman", "ReviewID": "UR8251053", "Content": "Unlike a stay in another Springhill Suites where I had a lot of problems on this vacation, the Springhill Suites in Poway was exactly as expected. Small but functional suite allowed family of five to stay in one room, air conditioning worked well, room was clean with full set of linens (except no sheets for sofa bed, had to request from housekeeping). Continental breakfast excellent, location of property excellent for the freeway and access to places I was visiting in the area.", "Date": "July 29, 2007"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Check in / front desk": "4", "Overall": "3.0", "Value": "4", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Connecticut", "Title": "“Good location off I-15”", "Author": "NoOneWillAnswer", "ReviewID": "UR7762231", "Content": "Stayed one night before an early morning visit to San Diego Wild Animal Park; reserved here because the Residence Inn was sold out, chose this area for location only. Park of a complex right off the freeway, including this Springhill Suites, a Chiles, a Wendys, a gas station, the Residence Inn -- maybe some others, but I don't remember. Very convenient, so that if you don't choose to drive somewhere in the evening you can have options to walk to. The property uses the no-party-pledge-form, and though we were staying there over a period of soccer playoffs for elementary/junior high-age school kids (so lots of young people everywhere) we noticed no more nor less noise than we'd expect in any hotel stay, at any price point. Breakfast much simpler than at Residence Inn, but perfectly adequate. Good coffee and juice. Competent and friendly desk staff. Everything clean and in working order.", "Date": "June 4, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "4.0", "Value": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Washington, DC", "Title": "“Great hotel, convenient, great staff!”", "Author": "AntZuzu", "ReviewID": "UR6900858", "Content": "Business travel can be unpleasant, especially when there's not much in the way of choice in close proximity to the meeting. I was not looking forward to staying at the Marriott in SanDiego, but it was one of only two hotels (both Marriott) offered for the trip. See, I am a smoker, and have not 'had to' stay in a Marriott since they went smoke-free; and was anticipating a long week! Well, the staff at SpringHill Suites wonderful, understanding, and gave me a room close to the outside door. I was very pleased with not having to beg for a room close to the exit, as my experience in California hotels in general have not been the best – and especially at Marriott (and I am a Starwood member – with a lot of points!) Comfy beds, quiet, great internet connection, clean and roomy bathroom and dressing area. The kitchen area was tiny – but you don’t need much room for a microwave and a mini-fridge! I have reevaluated my California Marriott experience and am looking forward to my next business trip in October!", "Date": "March 2, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "southfield, mi", "Title": "“Great Stay”", "Author": "johnlh", "ReviewID": "UR5904276", "Content": "I had read negative comments on trip advisor concerning this hotel. But, it fit what my husband and I were looking for (microwave, refrigerator., king size bed and price). We were so delighted with our stay. It was quiet, we did not hear any noise from other guest or the freeway and we were on the freeway side of the hotel. The hotel was very clean and the breakfast was an extra for us. They had plenty of food and it was good. The staff was great, very friendly. We loved it. We would stay there again and would recommend this hotel to our friends. The only comment I will make is the staff should be more knowledgeable about the restaurants in the area. We arrived late and inquired about a place to eat and were told about the fast food places, but not about the restaurants and grocery stores that are south on interstate 15 at the next exit Miramar Rd. After flying cross country you’re not really looking for fast food. johnlh Southfield, MI", "Date": "October 3, 2006"}, {"Ratings": {"Overall": "3.0"}, "AuthorLocation": "Tracy, CA", "Title": "“Okay Place to Sleep but Nothing Else”", "Author": "tripsntraps", "ReviewID": "UR5430320", "Content": "We stayed at this hotel for a baseball tournament and found it suitable for teams and business travellers alike. Although we were given a group discount, I would not have been inclined to pay more than the $119 per day if traveling solo. The location was central to pretty much anywhere in San Diego -- as our team played in various locations and took us no more than 30 minutes to get there. We were there 6/28 - 7/3 and found a clean hotel, decent hot breakfast (but after 5 days the menu really gets old) and small but acceptable business \"center.\" The rooms come equipped with a small refrigerator, sink and microwave and an office nook with free high speed internet service, and nice comfortable beds. There is no view to speak of, except for the freeway--if you keep your air conditioner on, the noise doesn't bother you. The downside to the business \"center\" is that only one person at a time can sit at the lone desk and make use of the printer and computer. There's plenty of room and tables in the breakfast area and with the free wireless connection in the lobby --actually gives you a quiet place to work after breakfast hours. As for the pool and the exercise facilities--think small -- no more than 3 or 4 people at a time. Housekeeping was okay --few spoke English but were very courteous nonetheless. There's a convenience store, gas station, fast-food hamburger joint, a Chili's and higher scale seafood restaurant within walking distance. Mercifully, there's a mall with lots of eateries one freeway exit away. The hotel staff was not overly friendly but they did try their best to accommodate our needs--such as luggage storage and other special requests. Overall, an okay place to sleep but not hang around.", "Date": "July 5, 2006"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Boston, MA", "Title": "“simple, clean, but definitely not quiet”", "Author": "A TripAdvisor Member", "ReviewID": "UR5353965", "Content": "the value was great, the room was clean, they were courteous, attentive, and didn't make a big deal about noise. Which, if you're trying to get away for peace and quiet, may not be up your alley. With breakfast included it was quiet a deal, but be prepared to manuveur the dining room as you would a Chucky Cheese.", "Date": "June 16, 2006"}, {"Ratings": {"Cleanliness": "4", "Overall": "1.0", "Value": "1", "Service": "2", "Rooms": "1"}, "AuthorLocation": "Westlake Village, CA", "Title": "“Noisy and many kids at Sprinhill Suites in Poway”", "Author": "kiwe", "ReviewID": "UR3880104", "Content": "First I want to mention that we are rarely unhappy with hotel stays and tend to be very easy laid back people. On labor day weekend we came to the hotel to check in. I will bullet point the list of events that took place. 1. Walked in and noticed there must be 400, 13 year old soccer girls in the lobby and through out the hotel. 2. Checked in, rang us up $40 dollars cheaper then realized he gave us the soccer discount and started over. 3. Went up to our 4 floor requested non- smoking room, walked in and BAM! smelled like the worst casino in Vegas you have ever smelled. 4. Called down, told to come to the front desk cause they dont know how we got placed in a smoking room. 5. A room opened up in the booked hotel. 6. Went up to the third floor...opened the door to find us standing in an occupied room. Laptop, sunglasses, clothes makeup - whole deal! Called down and they told us to STAY in the room, so they could verify there was someone still there!!! What?? no way, we came back down cause we didnt want to stand in someone elses room. 7. Came back to the lobby, this time we were given a bottle of water and a package of Peppridge Farm Milano cookies for our inconvenience. They found another room for us and booked us on the first floor. 8. Went into our new first floor room - HURRAY! Finally!! All was well with the world and we can finally put our backs down 45 minutes later! 9. Fell asleep... LUMPY uneven mattress but that wasnt really the problem. 400 little soccer girls running up and down the halls all night long! Knocking on doors, slamming doors, running upstairs above us. We maybe got 1 hour of sleep. 10. Next morning went down to breakfeast...ask the front desk lobby if soccer girls would be here the whole labor day weekend. He said yes, we asked if there was any way for us to be moved to our requested \"top floor\" he said now and that there are large groups on every floor of the hotel. 11. Suffer thru another night of zero sleep, backs aching and not very happy with the situation we go to check out. 12. Not one person asked us how our stay was, or how we were doing. I asked for a comment card we got a blank stare... finally someone got a comment card and handing a beat up, poorly folded card! When the card was handing the manager didnt say...\"how was your stay\" or \"how can we assist you\" we took the large, told them to have a nice day and left. $160 bucks a night plus tax for a rickity bed on the first floor with 400 giggling 13 year old soccer girls, a not so hot, Hot breakfeast and the soccer family paid 40 bucks less a night than we did!!! Hopefully for others this wont happen... I am good friends with a manager of the Marriott in downtown she told me this hotel is ALWAYS hosted large parties and is known for not being Marriotts best. Take it with a grain of salt but there are at least three other Marriotts within a few miles that do not have this reputation.", "Date": "September 7, 2005"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "West Haven, Connecticut", "Title": "“A fantastic hotel”", "Author": "A TripAdvisor Member", "ReviewID": "UR3555284", "Content": "This is the best hotel my wife and I have ever stayed at. After too many disappointments on previous vacations, we decided to try Springhill Suites, part of the well-respected Marriott family of hotels, and we couldn't have been happier. THe hotel was modern, clean, and the expanded suite-stule rooms are a huge plus when travelling with children, as we visited San Diego with our 3-year old son. The hotel's location is in a good location, right off I-15 in between the San Diego Zoo, The Wild Animal Park, and Legoland. The breakfast buffet is great, offering a great variety of breakfast foods and the hotel even offers baskets of fresh fruit in the lobby, which is a nice touch when coming back from a long day. Springhill Suites was a top-rated suite-hotel in Consumer Reports, and this hotel definitely proves why. We highly recommend it!", "Date": "June 15, 2005"}, {"Ratings": {"Cleanliness": "5", "Overall": "4.0", "Value": "4", "Service": "5", "Rooms": "4"}, "AuthorLocation": "", "Title": "“Repeat Lodger”", "Author": "howeboyz", "ReviewID": "UR3347457", "Content": "This time stayed with my kids. Knew to ask for the side away from Highway 15 as it can be noisy - however if you do get that side, put on your AC and set it to keep the fan on for white noise. Love the location and convenient stores nearby. Easy to everything. Room size was fine with three kids nad room was clean; breakfast was great, even the eggs and sausage, good selection of muffins, croissants, pastries and cereal. Great coffee. Friendly staff. Once again not one problem.", "Date": "April 10, 2005"}, {"Ratings": {"Overall": "3.0"}, "AuthorLocation": "Orange, California", "Title": "“Good Breakfast Selection”", "Author": "TravelWithRiley", "ReviewID": "UR2883025", "Content": "Spent a few nights at this hotel for business. The only thing I was impressed with was the selection for breakfast, especially the fresh waffle. The dining area has a fireplace & TV, which was a nice touch. Lobby area has hot cocoa & cookies throughout the day, which was also great. The room was a bit smaller than I expect for a \"suite\". There's a walk-in closet, which I could do w/o in exchange for more \"suite\" space. The two TVs in fact block the walk ways. The bathroom toiletries were lacking (there were only shampoo & soap - no lotion or kleenex). The kitchenette has a microwave, sink, coffee maker & mini fridge - no utensils. The desk area has free high-speed Internet, but no computer. I was surprised that the front desk did not have a street map of the area. They do, however, offer to print directions from Mapquest for you, which is not correct all the time.", "Date": "December 15, 2004"}], "HotelInfo": {"Name": "SpringHill Suites San Diego Rancho Bernardo/Scripps Poway", "HotelURL": "/ShowUserReviews-g60750-d268158-Reviews-SpringHill_Suites_San_Diego_Rancho_Bernardo_Scripps_Poway-San_Diego_California.html", "Price": "$135 - $219*", "Address": "<address> <span rel=\"v:address\"> <span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">12032 Scripps Highlands Dr</span>, <span class=\"locality\"><span property=\"v:locality\">San Diego</span>, <span property=\"v:region\">CA</span> <span property=\"v:postal-code\">92131</span></span> </span> </span> </address>", "HotelID": "2515574", "ImgURL": "http://media-cdn.tripadvisor.com/media/ProviderThumbnails/dirs/e6/09/e6090285ac09f89221f03a7a61fbf16b7large.jpg"}}