{"Reviews": [{"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Finland", "Title": "“Very clean, comfortable and friendly”", "Author": "gyr787", "ReviewID": "UR127506438", "Content": "We visited Hotel Donjon in easter weekend and it was a pleasant experience in all aspects: - Very clean and comfortable rooms - Good breakfast buffet with friendly service - Very friendly and helpful service at the reception - Close to Berault metro station, line 1 which connects to all major sights quickly - Quiet and tidy area, there were lots of trees and flowers blossoming - Grocery stores and boulangeries (bakeries) nearby Fully recommended!", "Date": "April 9, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Dublin, Ireland", "Title": "“Great hotel!”", "Author": "Paulamcg3", "ReviewID": "UR123797062", "Content": "We stayed in Hotel Donjon Vincennes for 3 nights and we loved it. Its in a nice quiet area on the metro which was perfect. The room was small but very comfortable. But what really made our stay were the staff. They couldn't have been nicer or more helpful and really went out of their way to make our stay memorable. Would highly recommend it and will be definitely stay there again", "Date": "January 29, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Regina Canada", "Title": "“Hotel DonJon Vincennes”", "Author": "Judy Q", "ReviewID": "UR123776067", "Content": "The room was small but comfy. The hotel was working on renovations during our stay. At times we felt that we may have been the only guests in the hotel, we didnt see anyone else the first day. The staff working when we checked in was friendly and carried my bags to our room. He did not speek english and told us, so that we didnt attempt to ask him questions that he didnt understand. The front desk staff gave us a map and told us where to get on and off to see all of the attractions. The staff told us how to buy train tickets and wrote down the names of the stops that we should get off at. This hotel is near the tube and the line that runs from here goes near all of the paris attractions. This hotel is not near the main train station Nord. Our room had a nice view of a court yard. The tub is quite small and the shower is a bit low. My husband is over 6 ft tall and needed to almost kneel in the tub to shower. The room is very clean and the bed was very comfortable. There is a cafe at the end of the block, a pâtisserie a block away and a lovely grocery shop a black away. The tube is a black away and the hotel is situated on a lovely and quiet street. Staff are friendly and are helpful with reservations, taxi's and info. Note: If you call a taxi you pay a reservation fee, if you just go to the street and hail a taxi you save 15 euros. This is a lovely hotel on a quiet street. The only reason I dont give them 5 stars is because they worked on renovations early in the morning. We also had to be very careful not to touch the walls or the rail on the stairs cause the paint was wet and the floors were covered in drop cloths. Our room was comfy.", "Date": "January 29, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Australia", "Title": "“Perfect for our family stay in Paris”", "Author": "stevejanklm", "ReviewID": "UR122986879", "Content": "The rooms were small (which we were prepared for) and it was a little hard to find when we arrived in Paris but we got there in the end using the metro. Get out at Berault station. The hotel was great value for money, close to the metro and restaurants. The owners/staff were lovely and did everything possible to help make our stay enjoyable. The rooms were really clean and serviced well each day. Handy for catching the train (RER) to Disneyland.", "Date": "January 12, 2012"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Overall": "2.0", "Value": "2", "Sleep Quality": "1", "Rooms": "2", "Location": "4"}, "AuthorLocation": "taillebourg", "Title": "“A no go”", "Author": "rogerrheydt", "ReviewID": "UR121084382", "Content": "Too expensive, bad service, nice view but noisy, just forget about it. Anyhow, there is nothing to do in Vincennes, all restaurants are very expensive and closed on week-ends. I cannot give you an other adress in Vincennes in the same category, sorry for this! Do not try to get a good breakfast in the surroundings.", "Date": "November 27, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Newcastle upon Tyne, United Kingdom", "Title": "“great little hotel”", "Author": "arthur1018", "ReviewID": "UR119835912", "Content": "we stayed for 4 nights and felt very comfortable and at home. great location for the metro. 10/10 for everything", "Date": "October 28, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "3", "Rooms": "5", "Location": "5"}, "AuthorLocation": "London, United Kingdom", "Title": "“very nice”", "Author": "dodozhou", "ReviewID": "UR119793730", "Content": "My sister and I stayed here for three nights, we loved the location, it is in the residential area away from the tourist centre yet it is right next to the Beraut Number 1 Metro station, which does go through the Paris main attractions. The owner and his family is very helpful and does makes you feel all the time welcome. The room is very clean and the bathroom is really spacious, definately recommonded to my friends and family.", "Date": "October 27, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Exeter, NH", "Title": "“The most welcoming and accommodating hotel! We miss them!”", "Author": "susan t", "ReviewID": "UR118717801", "Content": "My husband, son and I enjoyed a lovely stay in Vincennes this August. The hotel family was so very welcoming and gave so much attention to our 2 year old. We miss seeing them all. This trip was for business, but also family fun. Thank you to Jean Mark, Martine and Crystelle for making us feel comfortable and a part of the family. Metro line 1 is so close. The best of both worlds... very quiet neighborhood, but still full of nice eateries and shops and open markets. The best of both worlds... One things to consider: being from the states, we are used to AC...there are no fans in the hotel. It was really hot during the first few days. The rest of the stay was beautiful. I could be just fine, but with a little one, you never know. Also, the rooms are quite small...typical size for overseas, but sooo very clean and the family was extremely accommodating. Thank you!", "Date": "September 28, 2011"}, {"Ratings": {"Location": "4", "Overall": "4.0", "Value": "4", "Service": "5", "Rooms": "4"}, "AuthorLocation": "Stockholm, Sweden", "Title": "“Nice family hotel, perfect location”", "Author": "BoA_Sthlm", "ReviewID": "UR118283035", "Content": "Very nice and helpful staff, run by a family. Stayed there 27th August to 3rd September 2011. Clean and tidy rooms and a calm, quiet and safe area. Rooms have recently been renovated. Surprisingly good location, metro line 1 nearby passes many interesting points in the city, quick access to city centre and Disneyland by RER Vincennes station. By far our best hotel experience in Paris so far. The nearby Vincennes park has a vast area for walking and running. Will be back. The hotel was recommended by a relative of ours.", "Date": "September 18, 2011"}, {"Ratings": {"Location": "4", "Overall": "3.0", "Value": "3", "Service": "5", "Rooms": "2"}, "AuthorLocation": "", "Title": "“OK hotel - but definetly not coming back”", "Author": "lk_9898", "ReviewID": "UR118051357", "Content": "Pros: Very friendly staff, close metro Cons: Small rooms; VERY SMALL baths; no AC; you can hear EVERYTHING from next room", "Date": "September 13, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "4.0", "Value": "5", "Service": "5"}, "AuthorLocation": "", "Title": "“Great location, lovely family hotel, we'll be back!”", "Author": "Crezzer1981", "ReviewID": "UR117933780", "Content": "My husband and I stayed from 12th to 15th August 2011, we chose the hotel due to the trip advisor reviews and we found the reviews very accurate. Good points; excellent location, really lovely family who run the hotel who are so helpful, very clean and comfortable rooms. The point for improvement; dated decor in the rooms. However the family have only recently taken over the hotel and so they are working to renovate the rooms. We would definately return to see the improvements! Must mention a special thank you to Crystalle who tried sooooo hard to book a table for us at 'Frenchies' restaurant prior to our arrival. Sadly the restaurant was closed for the month of August which was a real shame, many of the recommended restaurants we had hoped to visit were closed for the month...a French thing? A Parisian thing? We don't know...but if we return to Paris it won't be in August anyway! Overall thank you to the hotel for a great trip xxx", "Date": "September 11, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "4.0", "Value": "5", "Service": "5"}, "AuthorLocation": "London, United Kingdom", "Title": "“A perfect place to stay for a perfect trip to Paris”", "Author": "emma r", "ReviewID": "UR117581910", "Content": "The hotel is run by a very kind and nice family. The rooms are great and were just the right size for my family and me. The people at the reception are great at helping you with any queries and the hotel in conveniently situated along the metro line 1 which can take you straight to major tourist attractions like the Louvre. Overall, a great place to stay for a short break in Paris.", "Date": "September 2, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Paris, France", "Title": "“Perfect stay and we will definitely be back!”", "Author": "ladyt022", "ReviewID": "UR116263789", "Content": "This hotel is owned by a really nice and caring family. They have gone above and beyond to make our stay here amazing. Located a bit outside the center but really easy access to a nearby metro stop, grocery store and nice restaurants. Would recommend for couples and families. We will stay here next time for sure!", "Date": "August 4, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Heidelberg, Germany", "Title": "“I loved this hotel and would definitely return!”", "Author": "MDewor", "ReviewID": "UR115214691", "Content": "The Hotel Donjon is a small, family run hotel with very friendly staff who were always willing to take the time to provide us with advice on where to eat, directions on where to go, etc. and make our stay as enjoyable as possible. The single rooms are cosy (definitely large enough for one person), modern (most have been recently renovated we were told) and comfortable. The hotel is not located on a main road so all was fairly quiet at night. Also, the hotel is located close to two metro stops (Chateau de Vincennes and Berault) on Line 1, which takes you directly to stops in the center of Paris such as the Louvre, Rue de Rivoli, Etoile,etc. Although some people do not like small hotels such as this in which the rooms are so close to one another that you can hear everything that goes on outside your room, if this does not bother you, I highly recommend this hotel. And the price is right too as I was able to get a special weekend rate through Booking.com of 60 Euros per night plus 9 Euros for breakfast. Not bad for Paris!", "Date": "July 10, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "3", "Overall": "3.0", "Value": "4", "Service": "4"}, "AuthorLocation": "Bern, Switzerland", "Title": "“the modest-budget paris hotel I've been looking for: charming, practical”", "Author": "cchampagne15", "ReviewID": "UR114943867", "Content": "This modestly priced hotel in a quiet, historic location (14th-century royal castle within 100 metres), near metro line heading straight for heart of Paris (five-minute walk to station) is managed by a friendly family eager to please its guests. Currently the hotel is semi-renovated; rooms are clean and well equipped, with attention to detail (e.g. with good reading lamps over bed-head); some re-carpeting, paintwork and insulation still needed - but it won't be long before this is one of the pleasantest hotels within its category. The lobby is a spacious, comfortable place to read a newspaper and sip coffee while waiting for the rain to stop. If you are fortunate enough to have reasonably behaved guests in the neighbouring room - always an unknown factor - then you cannot go wrong by staying here when in Paris on a low budget. Providing you are sensitive to old-world charm (stucco ceilings), don't mind small shower-rooms (I've rarely found a large one in Paris) and creaking floorboards (that too is part of the hotel's history); internet connexions, flat-screen TV, hairdryers all up to date - and anything missing will be provided at the reception desk (where some one is present around the clock). I shall certainly be returning here.", "Date": "July 1, 2011"}, {"Ratings": {"Cleanliness": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Heidelberg, Germany", "Title": "“Great Hotel”", "Author": "barker0826", "ReviewID": "UR114870551", "Content": "This is a wonderful hotel. Great and helpful staff. I was extremely pleased with the cleanliness of the Hotel. Also the location to the metro and center of Paris is good. The location of the hotel is also in a good neighborhood.", "Date": "June 29, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Tauranga, New Zealand", "Title": "“Very friendly family run hotel, went out of their way for us”", "Author": "KIWIROGER", "ReviewID": "UR111702531", "Content": "Very pleased with this hotel, from the moment we arrived with a friendly bonjour to the moment we had to leave :-(( the receptionist was very helpful with all the best places to visit and the best way to get there, the room & bathroom were clean, nice & peaceful at night, the location was good, only a few minutes walk to a major castle & to local town centre that had a local market selling allsorts the day we visited, will be telling all our friends & family good things about this hotel when we get home", "Date": "June 6, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Sleep Quality": "5", "Rooms": "2", "Location": "3"}, "AuthorLocation": "Lausanne, Switzerland", "Title": "“Pleasant staff, nice location, very calm, some inconvieniences though”", "Author": "sanspe14", "ReviewID": "UR110059130", "Content": "First of all, the staff is very pleasant and very helpful. The location is very nice. You are at 2 minutes walk from the \"Donjon de Vincennes\" (a big castle) which is nice to see. The hotel is on a very calm street, you cannot hear any automobile. The ground creaks a little bit so you hear the neighbours. There is not a great variety of food for the breakfast but all the basic stuff is there. The lift is in the middle of the stairs, so if you have a heavy suitcase, be prepared to lift it for a couple stairs. The electrical appliances was difficult to reach for me.", "Date": "May 27, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Paris, France", "Title": "“very pleasant”", "Author": "deltaalpha42", "ReviewID": "UR106120951", "Content": "the staff is very nice and the room are very comfortable", "Date": "April 29, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Oslo, Norway", "Title": "“the perfect place for the perfet seminar”", "Author": "MagnusR1", "ReviewID": "UR104147893", "Content": "What kind of hotel you stay at all depends on the purpose of the trip. In this case it was to attend a seminar with Tissier shihan in Vincennes, which was held in the nearby gym hall. Having less than a minute's walk from practice truly was luxurious! The service of the hotel was great, with polite people and good but simple breakfasts! I want to thank everyone who worked at the hotel for making our lives much easier, and also for the very beautiful receptionist who took care of our laundry ;-) Merci!", "Date": "April 15, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "3", "Location": "4"}, "AuthorLocation": "olsztyn", "Title": "“Nice place”", "Author": "wojtek010265", "ReviewID": "UR73654110", "Content": "Very nice people. Good, flexible service. Good quality/price ratio. Good location, not far form main street, but quiet. Good connection with Paris by metro and noctobus. Excellent choice for someone who doesn't need Ritz to spend few days in Paris. Some drawbacks are forgivable... ;-). In summary, I rate it very good in its class.", "Date": "August 3, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "3", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "1"}, "AuthorLocation": "Melbourne, Australia", "Title": "“Just Don't”", "Author": "wearytraveller43", "ReviewID": "UR73481187", "Content": "Fawlty towers poor plumbing, staff lacking knowledge or advertised language skills or even a basic interest in customer welfare, no vehicular access outside nor within for moving luggage, constant toilet smells, lack of cleanliness, Ventilation non existent without opening bent window onto noisy street. Excessive charge compared to hotels in the area. Does not deserve even 1 star", "Date": "August 2, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Saint Louis, Missouri", "Title": "“Fantastic!”", "Author": "artzart", "ReviewID": "UR69841049", "Content": "I organized a painting vacation for 10 of my artist friends and we stayed at the Hotel du Donjon eight nights. I can't say enough good about the staff, the facilities the location, the atmosphere, it was awesome. The staff went out of their way to make our stay unforgettable. They were helpful in giving directions for our daily visits to Paris on the metro and getting any information that we needed. The rooms are nice and beds are very comfortable. It is convenient for visiting the sites of Paris - a short 1/2 metro trip to the center of Paris. Also, Vincennes is a place to discover as well, the actual dungeon and ruins of the Chateau de Vincennes, great local restaurants and shops. My husband and I lived in France for many years and I have kept the address of this hotel in my address book for over 30 years. It is even better today than it was when we stayed there years ago. I would highly recommend it!", "Date": "July 6, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Puerto Vallarta, Mexico", "Title": "“Beutiful, Safe, Clean, Cheap”", "Author": "ana45", "ReviewID": "UR23701436", "Content": "Its a beutiful, small hotel in the district of Vincennes which is a very nice neiborhood. The line 1 of the Metro is 2 blocks from the hotel and it belongs to a french family so you feel like you are in home actually. Its also 2 blocks from the Castle of Vincennes which is an incredible view when you are walking in the zone. the prices are between 70 and 120 euros. So its not so expensive comparing to other hotels in Paris. Its worth it . I recommend it very much. You can have also a small breakfast for 6 euros. There's also a \"Boulangerie\" in the street before the hotel this is a small shop where you can find cakes, baguettes and coffee. So if your budget its not too high you can have some breakfast for 4 euros", "Date": "January 19, 2009"}], "HotelInfo": {"Name": "Hotel Donjon Vincennes", "HotelURL": "/ShowUserReviews-g187147-d673425-Reviews-Hotel_Donjon_Vincennes-Paris_Ile_de_France.html", "Price": "$113 - $139*", "Address": "<address> <span rel=\"v:address\"> <span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">22, rue du donjon</span>, <span class=\"locality\"><span property=\"v:postal-code\">94300 </span> <span property=\"v:locality\">Paris</span></span>, <span class=\"country-name\" property=\"v:country-name\">France</span> </span> </span> </address>", "HotelID": "2515303", "ImgURL": "http://media-cdn.tripadvisor.com/media/photo-s/02/1b/81/ea/hotel-donjon-vincennes.jpg"}}