{"Reviews": [{"Ratings": {"Service": "2", "Cleanliness": "3", "Overall": "2.0", "Value": "3", "Location": "4", "Rooms": "1"}, "AuthorLocation": "Brno", "Title": "“cheap option - expect nothing special”", "Author": "Reposak", "ReviewID": "UR48166514", "Content": "I would recommend this hotel just to budget travelers that plan to stay overnight and expect nothing more. The hotel and all its facilities seem to be used and old, so the first impression is not very convenient. The staff is friendly except one bored lady at the reception. What you should be prepared for: bad smelling carpets in the corridor, noisy heating (two options – very hot or very cold), stopped up bath, WC that switches regularly all night long because the water is slowly flushing through, missing light bulbs etc. Some pros: everyday newspaper at the door, relatively good breakfast (comparing to the rooms), very good location (walking distance to the downtown and to the Space needle), free slow internet (wi-fi), TV (99 different chanels), car rental and the petrol station next to the hotel, the price. The direct bus no. 194 to and from SEA-TAC airport stops cca 200m from the hotel.", "Date": "October 31, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Location": "1", "Rooms": "3"}, "AuthorLocation": "Victoria, Canada", "Title": "“Poor Location”", "Author": "kris621", "ReviewID": "UR37689484", "Content": "My boyfriend & I booked this hotel for 2 nights when we stayed in Seattle for the Supercross. Overall, I have no complaints about the hotel itself. The rooms where clean, the beds were fairly comfortable, but it is very, very old and outdated. Thin comforters, dim lights, stark white bathrooms and old green carpet. I agree wth another review that said to bring earplugs - the room next to ours had a party going on and people walking in and out, slamming doors. We finally had to call down to the front desk and complain. As far as location goes, in our opinion, it wasn't very good. It was on the outskirts of downtown and there was nothing really close by to walk to to grab a quick bite, aside from McDonalds, and a sketchy looking place across the street. Overall the hotel was what we expected for the money, but I think next time we'll spend the extra cash and get something closer to town.", "Date": "August 14, 2009"}, {"Ratings": {"Service": "2", "Cleanliness": "4", "Overall": "2.0", "Value": "1", "Location": "4", "Rooms": "1"}, "AuthorLocation": "Stockport", "Title": "“Take earplugs”", "Author": "WorldbirderStockport", "ReviewID": "UR33003281", "Content": "For the exhorbitant price we were charged on our return trip (over $25 dollars more than the outward journey per room), you would think that they would be able to fit triple-glazing instead of the wafer thin glass that is in place. This just does not do in the middle of a large, noisy, never sleeps city. Shame on the 'sit back and enjoy the profits whilst not making necessary improvements' owners. Breakfast just about carried some redemption. The thing is, you may not be able to rise in time to eat it after a sleepless night of sirens and garbage collectors.", "Date": "June 23, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Indianapolis", "Title": "“Clean, great location, with great bed, but spartan”", "Author": "smoothjohnk", "ReviewID": "UR29367664", "Content": "The hotel is in a great location for seeing Seattle and offered a sparkling clean room in good repair with no frills. The breakfast was competent. The location can be noisy due to the busy street and single-glazed windows.", "Date": "May 5, 2009"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "4", "Location": "3", "Rooms": "1"}, "AuthorLocation": "Oliver, BC", "Title": "“Hated the rooms bad staff”", "Author": "rajahgomeow", "ReviewID": "UR25670037", "Content": "Room was extremely dirty and bed not made when I entered. staff that had been nice when they first checked me in started arguing with me. they said that they had no rooms left but I was really upset since they didnt even make the bed. they didnt want to listen to me at all so I asked for the manager. they said the manager was on break and I had to wait if I wanted to talk to him. finally (to get me out of their hair) they said a room randomly opened up. they put me in the room and it was horrible! hair everywhere and what looked like urine on the mirror of the bathroom. disgusting.", "Date": "March 5, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Business service (e.g., internet access)": "3", "Check in / front desk": "3", "Overall": "4.0", "Value": "3", "Rooms": "4", "Location": "4"}, "AuthorLocation": "San Jose, California", "Title": "“Save Money for More Interesting Things”", "Author": "lipsticktraces", "ReviewID": "UR23146839", "Content": "I don't spend a lot of time in a motel room -- so there is little point in spending a lot of money on where I stay. In Seattle, I saved a lot of money by staying at this Days Inn -- and I spent the money I saved at all of the great restaurants in the neighborhood! The motel was clean, felt safe, and except for some minor (and typical) city noise, was a good place to rest after seeing Seattle's sights!", "Date": "December 31, 2008"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Business service (e.g., internet access)": "1", "Check in / front desk": "1", "Overall": "1.0", "Value": "1", "Rooms": "1", "Location": "1"}, "AuthorLocation": "Lust4TrentReznor", "Title": "“This DAYS INN is a DUMP and that is a compliment!”", "Author": "Lust4TrentReznor", "ReviewID": "UR20202872", "Content": "This hotel is a dump. The staff at the front desk are BARELY even awake enough to look you in the eye when they are speaking to you. The room I stayed in - there was hair on the bathroom wall, in the shower, and on the floor. The chair to the desk in the room was broken, almost ready to completely fall apart. There was a zip-lock baggie full of old, used make up in one of the dresser drawers. The bed was very uncomfortable, and the bath towells were thread-bare. They charge you 7 bucks a night to park in the parking lot AND the rates are outrageous, over 130.00 a night. It's amazing they can even get away with charging even 1/2 that. The manager is rude and he apparently only hires rude people to work at the front desk. I would NOT recommend this hotel. The Princess Anne ( or something like that) is close, many of my friends stayed there and they were quite happy with that hotel and the price was comperable. I suggest you check out that hotel and pass by Days Inn all together.", "Date": "September 19, 2008"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Business service (e.g., internet access)": "1", "Check in / front desk": "1", "Overall": "1.0", "Value": "1", "Rooms": "1", "Location": "4"}, "AuthorLocation": "San Francisco", "Title": "“Calling it a dump is a compliment”", "Author": "KarelHagel", "ReviewID": "UR19084192", "Content": "From the lobby to the room, the hotel is filthy and smells badly. The ubiquitous carpets - even the elevator walls are carpeted - are old and stained. The noise is deafening, day and night, due to heavy traffic and construction associated with bad insulation. Take your ear plugs with you. The hotel staff is unresponsive, impolite and indifferent, some of them even lie when necessary. Breakfast and high-speed Internet access are charged separately, which makes their price higher than neighboring and far superior hotels. To top it off, the high speed Internet is wired and installed on the night stand, far away from the desk.", "Date": "August 18, 2008"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Check in / front desk": "4", "Overall": "2.0", "Value": "1", "Rooms": "1", "Location": "5"}, "AuthorLocation": "Yorba Linda, California", "Title": "“Bring your own everything”", "Author": "winter_turtle", "ReviewID": "UR18386828", "Content": "I booked a room there because of the reviews I read on this website and its proximity to Key Arena. Boy, was I in for a surprise. The room was old and dirty. Carpet had multiple stains on it. The toilet had strange looking particles in it. The bathtub had hair in it (I used flipflops in the shower). Wall paper was peeling off the wall. The sheets and towels were rough. Worse, I had a room on the 2nd floor and there's a ledge. It was easy access from the top of a car, onto the ledge, and into my room! For what I paid ($150), it was better for me to pay a little more and get a much nicer place.", "Date": "July 29, 2008"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Check in / front desk": "3", "Overall": "3.0", "Value": "5", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Stoneham, Massachusetts", "Title": "“Days Inn Downtown Seattle”", "Author": "B0S0XGirl", "ReviewID": "UR16732682", "Content": "Decent hotel for the price. The bed was unbelievably comfortable! Not a bad walk into town and it's right near a couple of bus lines. Breakfast not included but there is a restaurant next door that serves it. You can also walk to many places from here.", "Date": "June 6, 2008"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Check in / front desk": "3", "Overall": "3.0", "Value": "5", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Vancouver", "Title": "“Good deal”", "Author": "ihearttravelling", "ReviewID": "UR11490756", "Content": "This hotel was exactly what I expected. For $58 a night it was in a good location that was pretty safe at night. Beds were clean, bathroom clean as well except the bath tub seemed a bit worn and one night the fan emitted a smoky smell. Night time was a bit noisy only because we had rowdy hotel guests who were trying to get ice from the ice machine that wouldn't work. Very noisy. The ice machine didn't work. It was going crazy and would spit out a small chunk of ice. Basically it was a good deal if you're just looking for a place to crash. It's old. It's not a Sheraton. So for those people who rag on the hotel, I don't know what you were expecting. It was decent. Staff were friendly. GO SEAHAWKS GO!", "Date": "December 12, 2007"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Check in / front desk": "2", "Overall": "1.0", "Value": "1", "Rooms": "1", "Location": "3"}, "AuthorLocation": "Calgary, Alberta", "Title": "“Yuck!”", "Author": "speedgirl", "ReviewID": "UR10794101", "Content": "I stayed 2 nights with my mother and sister for a girls weekend away. Based on the other fairly decent reviews of this hotel and the fact that my family only wanted to spend under $100/night and be downtown, I figured this seemed like the best choice. This hotel is very run down and dirty. The bed was comfortable and the sheets were clean. The shower curtain was ripped and the bathtub had been painted over on the bottom. The lock on the hotel room door had been ripped (or pushed) off and re-screwed in. This hotel is pretty ghetto and at $79/night it is not worth it, even with the close location to downtown. I have stayed at the Marriott Springhill Suites downtown several times before for about $119/night and it soooo much nicer that the Days Inn. I would not stay at this hotel again. My husband says you should always be wary of a hotel room that has a chalk drawing on the carpet. It felt close to that!!", "Date": "November 13, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Portland, Oregon", "Title": "“For the Price, a Great Deal”", "Author": "knottriel", "ReviewID": "UR8703992", "Content": "For the price I was happy enough with the hotel. I was only planning to go there to see Seattle with a friend, and have a place to sleep. I didn't care at all about having anything fancy, just a clean, secure, conveniently located hotel room. They delivered. The manager was incredibly friendly, and the staff made some good suggestions of things to see and do. The room was clean, and building was reasonably quiet for a downtown hotel and seemed secure. I'll definitely go back as long as I find a good price.", "Date": "September 12, 2007"}, {"Ratings": {"Business service (e.g., internet access)": "5", "Check in / front desk": "2", "Overall": "1.0", "Location": "3", "Value": "1"}, "AuthorLocation": "Seattle", "Title": "“House Keeping Stold From Me”", "Author": "Travel_Often_42", "ReviewID": "UR8695966", "Content": "I came in from Breakfast and my room was 1/2 cleaned. I had change on the desk that was gone! All of the drawers in my room were open and had been gone through. There was garbage cans from another room and dirty sheets that weren't mine. I called the hotel manager and they got the cleaning staff. They said he took his break and thought the money on the table was a tip. He said he didn't open the drawers with my cloths in it. Worst Hotel I've ever stayed in. Dirty, coffe pot still had coffee in it from the previous person. rugs are worn, bathroom is very small and you have to pay 100% up front. No refunds. Now I know why?", "Date": "September 11, 2007"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Check in / front desk": "4", "Overall": "4.0", "Value": "4", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Indiana", "Title": "“Run by Starwood (parent of Westin Hotels)”", "Author": "2Midwest", "ReviewID": "UR8607048", "Content": "A Days Inn owned and operated by Starwood, the parent company of Westin Hotels? You got it.. That's the one sentence review of the Days Inn Town Center in Seattle. Just blocks from the new Whole Foods Market (great for meals) and steps from the new street car which opens next year to Lake Union (and downtown). In short, this property--considering it is a Days Inn -- is a hidden gem.", "Date": "September 2, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Check in / front desk": "5", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "2"}, "AuthorLocation": "Portland, Oregon", "Title": "“Decent value.”", "Author": "alb31362", "ReviewID": "UR8442331", "Content": "This hotel is within walking distance of the Pike Place Market, the Westlake Center mall, and the Monorail. Our room was clean and comfortable, and the staff was friendly and helpful. My only complaint was that the hall smelled very musty. In addition, the surrounding area is mostly deserted at night, with a few unsavory characters roaming around. For this reason, I would not recommend it for single women or families who intend be walking in the area after dark.", "Date": "August 17, 2007"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Check in / front desk": "5", "Overall": "3.0", "Value": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Oakland, CA", "Title": "“Perfectly fine”", "Author": "Leah6381", "ReviewID": "UR8261099", "Content": "Stayed at the Days Inn for 3 nights over this past weekend. The location was good, about a 15-30 min walk to all the touristy attractions. Check-in was easy, room was clean, bed was comfortable, and the shower was hot. That's really all I was expecting, and that's exactly what I received. I would stay here again.", "Date": "July 30, 2007"}, {"Ratings": {"Service": "4", "Cleanliness": "2", "Check in / front desk": "5", "Overall": "3.0", "Value": "3", "Rooms": "3", "Location": "2"}, "AuthorLocation": "Vancouver, Canada", "Title": "“Okay”", "Author": "cow_manx", "ReviewID": "UR7956851", "Content": "I have to say this hotel does not live up to the standards of the Days Inn chain, compared to their Anaheim location for example this falls way short in terms of quality and value. The hotel is centrally located which is nice but despite that isn't very easy to find and it is easy to get lost in the local area. The price seemed a little high for the quality we encountered. The elevators are small and smell, they are somewhat run down. The check-in process was very easy and friendly and the room was okay but nothing to get excited about. It was basically a bed to sleep in and not much more which for the price they charge seems to be a bit of a rip off. If possible I would recommend staying at a Motel 6 outside the city, you the get the same or better quality for a much lower price so if you are travelling by car I would recommend that alternative but if you are taxi and transit bound this is an okay choice, just don't go in with very high expectations. The view isn't anything to get excited about either, I wouldn't stay here more than a day or 2.", "Date": "June 21, 2007"}, {"Ratings": {"Cleanliness": "3", "Business service (e.g., internet access)": "3", "Check in / front desk": "5", "Overall": "3.0", "Value": "4", "Rooms": "3", "Location": "4"}, "AuthorLocation": "new york, ny", "Title": "“not too bad”", "Author": "kcw732", "ReviewID": "UR7940848", "Content": "I recently stayed here for 1 night to take an medical board exam in Seattle. The location is not bad--it's in an area full of other budget hotels and self-park lots--a bit sketchy at night. But it's walkable to the main downtown area including the waterfront, convention center and the Space Needle. The front desk was friendly, and the room itself is what you expect for a budget hotel. The room was pretty quiet, although my room facing Seventh Avenue heard some ambulances, loud cars, etc at night. The water pressure is good in the shower. The bed was fine. The room was adequately cleaned with plenty of towels. Overall, not bad for the price--Downtown Seattle is full of more expensive options. If I was traveling on a budget in Seattle, I would probably stay here again.", "Date": "June 20, 2007"}, {"Ratings": {"Cleanliness": "2", "Check in / front desk": "5", "Overall": "2.0", "Value": "3", "Rooms": "1", "Location": "4"}, "AuthorLocation": "Eugene, Oregon", "Title": "“Not So Much”", "Author": "Nwrainy", "ReviewID": "UR7589991", "Content": "My family and I check-in for one night. Checking in was very easy; show ID and a credit card and you were issued you card key. The girl who checked us in was also very nice. The room on the other hand was not to exciting. It was on one hand close to downtown shops and there was a bus stop right across the street, which in my opinon is the only reason to stay here. But once inside you were reminded that you were in a budget hotel. The room was small, the bed didn't have proper bedding (flat sheet were used instead of fitted), the bathroom was a converted closet, and I was slightly concerned about insects. The location wasn't as scarry as I read on some other reviews. We walked back to our hotel at night with our small child and there were still people out and walking around, normal people. You also have to swipe your card key just to get in the building were the rooms are and then again to of course get in your room. Bottom line.....If you are just there to drop off your bags and stay-out till your ready to crash and pass out, this is a great deal. If your in town for a few nights and have children, I would try somewhere else.", "Date": "May 11, 2007"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Business service (e.g., internet access)": "3", "Check in / front desk": "3", "Overall": "3.0", "Value": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Pennsylvania", "Title": "“not bad for the price”", "Author": "tala75", "ReviewID": "UR7291716", "Content": "The inn has some small problems but considering I got a rate from sidestep.com much cheaper than other area hotels, it was a decent deal. The 6th Ave, 8th Ave and Kings Inn all nearby looked pretty bad from the outside, but they advertise higher rates. Housekeeping skipped my room twice during a 5 night stay and didn't understand English. Still, the bed and bathroom were clean. Elsewhere in the hotel it's average, what you'd expect for the price. It's generally safe day and night, as long as you're sensible about what you're doing. The Holiday Inn Express on Denny is probably the only other place nearby in this price range that I would consider returning to.", "Date": "April 7, 2007"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Check in / front desk": "3", "Overall": "3.0", "Value": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "London, United Kingdom", "Title": "“Bog basic but OK”", "Author": "miss_doyle", "ReviewID": "UR6843972", "Content": "The room was large and reasonably clean, the bathroom was OK too. Not a great deal to note about this place except it is handily located in between the space needle and the shopping area. The area was a bit seedy during the day, but oddly enough at night it seemed less so. I felt perfectly safe walking around here.", "Date": "February 27, 2007"}, {"Ratings": {"Service": "3", "Cleanliness": "2", "Business service (e.g., internet access)": "2", "Check in / front desk": "3", "Overall": "2.0", "Value": "2", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Eugene, Oregon", "Title": "“Wouldn't have paid for this”", "Author": "odesi09", "ReviewID": "UR6805888", "Content": "Stayed here for free due to a cool deal and boy am I glad I didn't have to pay. The place is not terribly clean, the soap is awful, the rooms are tiny, and the views are uninspiring. The location is admittedly rather good, as it is within walking distance of the main downtown shopping center as well as the Space Needle, but that is really its only redeeming factor. And the immediate area around it is pretty dingy and unsafe. To put it bluntly, I wouldn't have paid for this - better to get something nicer on the outskirts for the same amount of money.", "Date": "February 17, 2007"}, {"Ratings": {"Service": "3", "Cleanliness": "2", "Check in / front desk": "4", "Overall": "2.0", "Value": "2", "Rooms": "2", "Location": "2"}, "AuthorLocation": "Tampa Bay, Fl", "Title": "“Days Inn Seattle Downtown”", "Author": "FloridaTraveler77", "ReviewID": "UR5983693", "Content": "A girlfriend and I stayed here while visiting Seattle in October. The staff was very helpful and friendly, and the beds were quite comfortable. That being said, there was much room for improvement. Our room was very stinky!!! It smelled like a mix of cat urine and bleach. I think it was coming from the bathroom wallpaper, because when we closed the bathroom door it was not quite as strong. The area was also a little sketchy for two females who planned on walking everywhere. One particular night on the way back from dinner we had a strange man close on our heels, and we ended up running back. It was probably our imagination, but that is the kind of neighborhood it was. I am planning on visiting again with my husband, and I will definately spend the extra $10+ dollars a night to stay somewhere else. Days Inn please remodel this hotel!!!!!!", "Date": "October 22, 2006"}, {"Ratings": {"Cleanliness": "1", "Check in / front desk": "3", "Overall": "3.0", "Value": "3", "Rooms": "2", "Location": "4"}, "AuthorLocation": "Boston, MA", "Title": "“Good location”", "Author": "MML2006", "ReviewID": "UR5912294", "Content": "I spent 3 nights at the Days Inn Downtown last week and it was adequate. The location was great. We were able to walk to the Space Needle, Pike Place Market and even Safeco Field for a Mariners game (although that was a bit of a hike). We had to book a smoking room because that was all that was available. I've stayed in smoking rooms before and they're usually cleaned well enough that there is only a faint hint of smoke. When we walked into this room we were instantly hit with the smell of cigarettes. The smell was so strong it got into our hair and clothes. We had to keep the windows open the whole time and it only helped a little bit. The bed linens had cigarette burns in them. Other than the horrible smell, the beds were actually fairly comfortable and it was nice that the room had a hairdryer and iron and board. The bathroom didn't look like it had been cleaned before we arrived. There was hair in the sink and the toilet hadn't been flushed. The staff was friendly for the most part. They gave us a map and directions and information on the public transportation. One thing that bothered me is that their website advertises a shuttle from the airport but they don't actually have one. I called the hotel to get information about the cost and how to reserve the shuttle after seeing it advertised on the hotel's website. The woman gave me the price and told me the general area to pick up the shuttle at the airport. When I arrived at the airport, I went to the information desk to get more specific information and the staff told me that none of the downtown hotels have shuttles. I called the hotel again to verify that there was a shuttle and the woman who answered assured me that there was one. She told me where to go to wait for it and then I asked if the shuttle said Days Inn on the side and she said the it was the Shuttle Express (a shuttle that runs to all downtown hotels and is in no way connected with the hotel). I don't understand why neither person at the hotel told me this without me having to ask directly. I would have been standing on the curb waiting for an hour if I hadn't asked. I think it's very misleading to advertise a shuttle when they don't have one.", "Date": "October 5, 2006"}, {"Ratings": {"Cleanliness": "1", "Overall": "1.0", "Value": "1", "Service": "2", "Rooms": "2"}, "AuthorLocation": "Guaynabo Puerto Rico", "Title": "“Phony fee”", "Author": "A TripAdvisor Member", "ReviewID": "UR5381192", "Content": "I visited Seattle last week. I stayed in Days Inn for two nights. According to the their homepage, Days Inn-Downtown Seattle offers a Parking Fee of $5.00 per night, I was charged $10.00 per night for a total of $20.00. Certainly, I will dispute these charges.", "Date": "June 25, 2006"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "USA", "Title": "“Nice place to stay”", "Author": "Tootje", "ReviewID": "UR4991221", "Content": "I found this little Inn to be comfortable and affordable. You can not beat the location or the prices! If you are looking to stay at the Ritz, this is not a hotel for you. If you are looking for a place that has clean comfortable rooms with a friendly staff but no frills, this is your best bet in downtown Seattle. It was walking distance to everything I wanted to see. I'll stay here again.", "Date": "April 20, 2006"}, {"Ratings": {"Overall": "2.0"}, "AuthorLocation": "Chicago, Illinois", "Title": "“so, so”", "Author": "dew02of5", "ReviewID": "UR4989493", "Content": "This Days Inn I've stayed with over the past 2 years. It's becoming ragedy. The bed and bathroom are clean but everything seems wore down. The hotel is usually noisey either because of the single pane windows or rowdy groups staying at the hotel. It's a good price but you do have to \"settle\" for a noisey, not so clean hotel.", "Date": "April 19, 2006"}, {"Ratings": {"Cleanliness": "1", "Overall": "1.0", "Value": "1", "Service": "3", "Rooms": "1"}, "AuthorLocation": "simi valley", "Title": "“a freindly dump”", "Author": "voodoofx", "ReviewID": "UR4003220", "Content": "The room smelled, had many carpet stains and was in dire need of complete renovation. A really horrible hotel!", "Date": "October 9, 2005"}, {"Ratings": {"Overall": "3.0"}, "AuthorLocation": "Washington", "Title": "“So so....for the price”", "Author": "joshkspa", "ReviewID": "UR3987334", "Content": "The room size was fine. Parking was close and easy, and the location of the hotel is great. But if you're into a \"hotel experience\" you will be underwhelmed. Older rooms, kind of a funny smell. If you stay here ask to NOT be placed on the side closest to the street. All night/early morning buses and large trucks rumbled by and stopped outside our window (it's at a stoplight). Other than that, for the price, it's a convenient and fair place compared to the pricier options in downtown.", "Date": "October 3, 2005"}, {"Ratings": {"Overall": "1.0"}, "AuthorLocation": "Wales", "Title": "“over booked! nightmare!”", "Author": "WelshMark", "ReviewID": "UR3907064", "Content": "I arrived over from the UK jet-lagged at around 11pm after my flight was delayed 24 hours. My hotel room was no longer available - as I didn't show the night before and I wouldn't of been able to stay that night anyway because it was overbooked through Expedia.", "Date": "September 15, 2005"}, {"Ratings": {"Cleanliness": "1", "Overall": "1.0", "Value": "1", "Service": "1", "Rooms": "1"}, "AuthorLocation": "Upper Montclair, New Jersey", "Title": "“Worst hotel ever!!!!!!”", "Author": "AdamMS", "ReviewID": "UR3756664", "Content": "This was the worst place I have ever stayed. The bathroom smelled so badly like mold that we could not open the door without the entire room smelling. Also the room was just dirty. The best way for me to tell you how bad this hotel was is to let you know that I joined this site simply to make sure no one else has to stay here.", "Date": "August 12, 2005"}], "HotelInfo": {"Name": "Days Inn Town Center Hotel Seattle", "HotelURL": "/ShowUserReviews-g60878-d224835-Reviews-Days_Inn_Town_Center_Hotel_Seattle-Seattle_Washington.html", "Price": "$72 - $150*", "Address": "<address class=\"addressReset\"> <span rel=\"v:address\"> <span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">2205 7th Ave.</span>, <span class=\"locality\"><span property=\"v:locality\">Seattle</span>, <span property=\"v:region\">WA</span> <span property=\"v:postal-code\">98121</span></span> </span> </span> </address>", "HotelID": "2515373", "ImgURL": "http://media-cdn.tripadvisor.com/media/ProviderThumbnails/dirs/a9/bd/a9bdaa6e631cf1257fda12254d42962f1large.jpg"}}