{"Reviews": [{"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Sleep Quality": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Bremerton, Washington", "Title": "“Mixed review....”", "Author": "fpgirl", "ReviewID": "UR127203034", "Content": "We stayed here the night before our flight due to the threat of snow in the morning, using Marriott Rewards points. When we made our reservation we were told to ask about an upgrade when we checked in. We did that and were upgraded to the 'Suite Level'. Apparently I don't know what 'Suite Level' means since the room we were in was one of the smallest I've ever seen. Also, the 'Suite Level' lounge isn't open on the weekends so whatever is offered in there remains to be seen. We were in a room that faced the pool and as other reviewers have stated, it can be loud at times. We looked at the menu for the restaurant - prices were off-putting so we opted for dinner in the bar. That probably was the best thing about this Marriott - the food was good and reasonably priced. There was some kind of convention being held at this location so the bar was a little louder than one would expect at 6 pm on a Saturday night. There was also a mix-up on the parking charge...we were told when we made the reservation that parking was complimentary for the night you stayed at the hotel. When we checked in, the front desk quoted a parking charge and couldn't be convinced that we were told otherwise. In the morning when we checked out, that front desk clerk asked if everything went alright - I related the parking charge incident and asked it that could be 'comped' - she agreed to do so. We had planned on parking at another lot for the duration of our trip due to the Marriott's high rate to park there - when we asked for our car, the valet asked why we weren't parking there - explanation given - then we were given a MUCH lower daily rate which we took advantage of. The airport shuttle was efficient. Because we are loyal Marriott customers, we'd probably stay here again but request a tower room.", "Date": "April 3, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "5"}, "AuthorLocation": "San Diego CA", "Title": "“Not too bad...a bit noisy”", "Author": "United858", "ReviewID": "UR126886817", "Content": "While the pool is great for families, the accompanying noise can be quite annoying if you are trying to sleep. The shuttle was great and timely! The room was quite average. The location however close to the airport is hard to beat. Worked just fine for me.", "Date": "March 28, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Location": "4", "Rooms": "3"}, "AuthorLocation": "", "Title": "“Ok at normal rates but not at higher than normal rates”", "Author": "section", "ReviewID": "UR126813726", "Content": "Stayed twice due to flight cancellations and it was fine. Then I stayed for one week when every single hotel downtown was booked except the Four Seasons and paid the highest rates I've ever seen listed at this location. A big plus was dining at the bar and room service was very good. The staff was also helpful for getting a package sent and other requests. Overall, food and service compensated for old rooms and noise. At normal rates this is average, but at near full rates, you can't help but feel let down.", "Date": "March 28, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Louisville, Kentucky", "Title": "“An unexpected treat”", "Author": "sixlegsup", "ReviewID": "UR126753042", "Content": "This is an 'airport' hotel, located a stone's throw from the terminal. I was expecting something very average but was pleasantly surprised by the facilities, service and food. We had a room facing the airport but were never disturbed by the planes. Pros: Nice pool in the atrium. Lots of families used it. Cozy yet spacious lobby and bar with a central fire place Very good gym with free weights to 50lbs and lots of cardio machines Better than average restaurant Clean room and very comfortable bed Cons: The bathroom was showing it's age a little Also, I personally like a ceiling exhaust fan in a bathroom which these didn't have Atrium rooms could get a little noisy The parking in the hotel lot can get full quickly The cons are really quibbles. For this style of hotel, it exceeded my expectations. The location is also convenient to gas stations and some decent restaurants, especially Mango if you like Thai food.", "Date": "March 27, 2012"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Overall": "2.0", "Value": "2", "Location": "3", "Rooms": "1"}, "AuthorLocation": "", "Title": "“Don't expect a quiet night's sleep”", "Author": "rstorr", "ReviewID": "UR126338194", "Content": "Stayed here a flight cancellation at SeaTac. Location is good for the airport, close by and they run a regular free shuttle. After spending most of the day at the airport I was very hungry so tried the lobby bar. Had to wait about 10mins for a waiter, despite the bar being quite empty, only about 3 other tables. They claim the food is freshly cooked but my chicken came out in about 5mins so am sure it was pre prepared, otherwise I'm sure I'd be poisoned if it was actually cooked that quickly. Rooms were terrible if you want to get any sleep. The walls were paper thin and I could hear the entire conversation from the next room when they were just speaking at a normal level. They also have a terrible alarm clock which has a bright light on the top (the snooze button) which stays illuminated all night and lights up the room. I had to put mine on the floor and cover with something so could have some darkness. Luckily I hadn't paid for this, as paid by the airline, but if I had I would have been asking for my money back!", "Date": "March 19, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Cleveland, Ohio", "Title": "“Can't gripe for $50 on Priceline”", "Author": "alanglazen", "ReviewID": "UR125789295", "Content": "This is a \"cut above\" airport hotel. Nicer rooms, comfortable bed, soft linens and very professional and friendly front desk. But the very best thing is that you walk across the street to the train station, and can get downtown in expensively and quickly. I've booked this for $50 numerous times by bidding on Priceline, so you can save a bundle too. Just bid for a 3+ star Sea hotel for $50, and you'll either end up here or the slightly lessor Doubletree across the street.", "Date": "March 8, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Silver Spring, Maryland", "Title": "“Great Hotel!”", "Author": "mimiteach", "ReviewID": "UR125674843", "Content": "I stayed at this hotel for a business conference, but the staff and the hotel made it feel like a mini vacation. Great atmosphere, beautiful decor. The food was pretty good for a Marriott and the breakfast buffet is excellent. the staff was helpful and attentive and they have the best shuttle drivers. My only complaint is that we didn't have toilet paper in the bathroom. I called guest services and left for the day. When I returned at midnight I still didn't have toilet paper and had to use my colleagues' bathroom. What I did have was a big bag full of toiletries. They misunderstood. Who can take a huge bag of shampoo and conditioner and lotion on a plane??I called again and this time was given two rolls of toilet paper. It was midnight. I was leaving in the morning. They overcompensated for their mistake. My concern was the fact that housekeeping had cleaned the room and supposedly cleaned the bathroom. They didn't put toilet paper in the bathroom for two days. How'd they miss that? Left a little sore spot for me and I didn't leave them a tip. I bet they didn't miss that!", "Date": "March 5, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Washington State", "Title": "“Great Hotel!”", "Author": "happymcmartin", "ReviewID": "UR125569751", "Content": "We have stayed at the Seattle Airport Marriott many times over the years. However, this most recent stay was our first time in quite a bit. We decided to return because the indoor tropical is fantastic and still is!! Rooms are very nice (a little small but great beds and workable), staff was very helpful and we loved the new lobby! Breakfast was fantastic and parking was easy. Close to the airport and easy access to get downtown. We were very impressed yet again, and we plan on returning!", "Date": "March 3, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "3.0", "Value": "4", "Sleep Quality": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Dallas, Texas", "Title": "“Ok property for early flights”", "Author": "MTCB", "ReviewID": "UR125422012", "Content": "This is an ok property nothing outstanding. Older and showing it's age. Bathroom is small. Beds are comfortable but pillows could be better (tried both feather and foam and both were uncomfortable). Good new and modern gym- had a pool overlooking pool and courtyard..... personally would prefer to look outside. Was a bit noisy from people using pool. All in all a good place to rest but nothing memorable.", "Date": "February 29, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Atlanta, Georgia", "Title": "“A good business class Marriott”", "Author": "4959keeton", "ReviewID": "UR125318972", "Content": "I stayed here for just one night in order to catch a morning flight out of SEA. I found a AAA special rate so it was a good value. As a Marriott Rewards elite member I was given a room on the Concierge floor. The room was standard (good) Marriott in good shape and comfortable. The TV had a good selection of channels and quite a few were in hi-def. The wired internet speed was pretty good. Since I was car-less I ate in the restaurant and it was pretty good. The hotel has a shuttle that runs every 15 minutes to the airport. It is about 2-3 blocks to get to the light rail station that can take you to downtown Seattle. One strange detail is that the pool is in an atrium in the middle of the hotel and as a result the atrium stays very humid. This hotel is a good choice if you need to be near the airport and can get it for a decent rate.", "Date": "February 27, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Augusta, Georgia", "Title": "“Very nice indoor pool”", "Author": "PP81Augusta", "ReviewID": "UR125318125", "Content": "Located about 5 min from Sea-Tac via free shuttle, the hotel has a very nice tropical indoor pool in a large atrium. The room is nice and typical for standard Marriotr room. Room service was decent. It was delivered a bit later than the promised 30 min and I was automatically called by guest service to have the meal for free ( which I declined since I was not in a rush but it was a very nice gesture by the staff). The room is quiet and the bed is confortable. Overall, it is one of the nicest airport hotels that I have stayed in.", "Date": "February 27, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "3.0", "Value": "2", "Sleep Quality": "2", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Anchorage, Alaska", "Title": "“Great staff,poor value”", "Author": "63tracks", "ReviewID": "UR125160549", "Content": "Had better experience on prior stays. Rooms in need of updating. Expected a nicer room for the price($199) at almost double the cost of the majority of airport hotels in the area. Was given a ground floor room adjacent to the parking lot even though there were numerous other options available. Noise from the parking lot was an issue throughout the night. Service has always been very good. The pool is very nice, especially for families. Overall was disappointed for the money spent and will try different hotels in the area on next visit. The staff was attentive to issues but in this price range I expect it to be right the first time.", "Date": "February 24, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "New Westminster, Canada", "Title": "“Very Convenient!”", "Author": "abarbour", "ReviewID": "UR124443674", "Content": "We stayed here one night before flying to Kauai - I have no complaints! We were able to long- stay park right on the Marriot property and it actually ended up being cheaper than the park n'fly lot we were going to use. When we returned home, we were promptly met by the shuttle and I think we maybe waited two minutes for them to pull our car around. We'll be staying here again the next time we fly out of Seattle!", "Date": "February 11, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Irvine, California", "Title": "“Nice enough, convenient”", "Author": "FBernal99", "ReviewID": "UR124374269", "Content": "I thought I'd try this instead of my normal hotel in Federal Way so that I wouldn't have to drive in inclement weather late at night. Seemed nice enough, sort of like an Embassy Suites with a covered atrium and large pool. Nicely appointed rooms. That's all I know since I was only there for about 8 hours!", "Date": "February 10, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Canberra, Australia", "Title": "“OLD BUT BEAUTIFULLY RENOVATED - COMFORT PLUS”", "Author": "madgicsh", "ReviewID": "UR124369334", "Content": "Our first view was not encouraging, but we came to realise very quickly that they had chosen to spend their renovation dollar inside, rather than on externals. That's fine by us, it was superb! The rainforest around the pool and the huge timber-beamed canopy over, gave us our first real taste of Pacific North West style; the food was great at both dinner and breakfast, and the room was luxury plus. When our rental car failed to arrive, they were far more helpful than Hertz in resolving the problem! I would always stay here again after a cross-Pacific flight.", "Date": "February 9, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Alabama", "Title": "“Overnight before early flight”", "Author": "newharp", "ReviewID": "UR124271824", "Content": "We stayed here for one night before an early flight from SEATAC the next morning. Check-in was fine and they have a convenient computer right by the desk where you can print your boarding pass. We were pedestrian passengers on the ferry from Bainbridge Island to Seattle, and there were plenty of cabs to meet the ferry and the ride to the hotel isn't very long. It was just a quick overnight stay, but the property was as you'd expect a Marriott to be: clean, smartly decorated, professional staff, everything functional. The indoor pool was pretty although we didn't use it. The complimentary shuttle to the airport is timely and convenient. I would definitely stay here again.", "Date": "February 7, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "3.0", "Value": "2", "Sleep Quality": "4", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Tacoma, Washington", "Title": "“Nice Hotel”", "Author": "kortkass", "ReviewID": "UR123599769", "Content": "Our room was clean and normal size. The indoor pool area looked great. The staff are friendly. It is quiet, especially for being by the airport.", "Date": "January 25, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "2.0", "Value": "1", "Sleep Quality": "3", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Langley City, Canada", "Title": "“Not so nice”", "Author": "BabsX8", "ReviewID": "UR123321898", "Content": "Have gone to this hotel many, many times, but this time the hot tub smelled like crap, and I mean litterally crap. The price was shockingly high for a king room. used to pay 129.00 for a fri to sat stay and now it was close to 200.00. Definetly won't be going back unless every hotel in Seattle is full, and I had to.", "Date": "January 19, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Location": "5", "Rooms": "3"}, "AuthorLocation": "Hawaii", "Title": "“Stayed here one night and had to switch hotels”", "Author": "MaMa6363", "ReviewID": "UR123280035", "Content": "I don't know if its because i have high expectations when it comes to the Marriott but i was didn't like my room at this place. the staff is great don't get me wrong but when it came to the room well... i didn't feel comfortable. i hate it when my bathroom is dirty at home but can you imagine a hotel bathroom where hundreds of people have used it. their showers are tiled and they don't keep this tile clean. also when i went to close my curtains i got a gust of dust. another thing i didnt like was the shuttle is not 24 hours. i needed to be at the airport at 3am and they didn't have a shuttle running. so now is the day after my stay at the Marriott and Im now at the comfort suites in tukwila. 24 hour shuttle, very clean and large room, great staff and they gave us pizza and salad as an afternoon snack and breakfast in the morning for free. i would not recommend the Marriott but i would the comfort suites", "Date": "January 18, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Palm Beach Gardens, FL", "Title": "“Nice hotel, but problems (& lies) with reservations”", "Author": "so3008", "ReviewID": "UR122603252", "Content": "Pros: This hotel is very clean, nicely decorated, relatively quiet and the food in the restaurant is delicious. It's also minutes from the airport, yet does not have that \"airport hotel\" feel. Staff is friendly. Cons: Pricey compared to nearby airport hotels (we paid $200/night). Rooms are small. Indoor pool is nice, but loaded with chlorine (atrium smells like a hot tub). Our daughters' eyes were burning after their swim. Concierge level cocktail hour is just a cash bar on the 8th floor. Food and drinks are not included in the upgrade. Now for the warnings: Do not trust anything the Marriott reservation agent tells you. I made our reservation by calling the hotel directly and being transferred to Marriott's main reservation center. I normally book online, but wanted to know why the rate was so much higher than the last time we stayed at this property. I was told it was because of the holidays (our stay was Jan. 3) and because the hotel was almost completely booked. I was told there were only a few rooms left and I should book immediately. When I told her I am a Marriott Rewards member, the agent very nicely offered to upgrade us to concierge level and she said she'd put us in a corner room since they're larger. Great! But when we arrived, none of that happened. The desk clerk didn't even have any notes in our reservation about that. We asked if the hotel was booked and he said \"no\" and that it was practically empty!! The reservation agent lied. We asked if he would honor our promise of concierge level and he said he would. We got to our room on the 7th floor, only to find the concierge level is on the 8th floor! The desk clerk lied to our faces. We were not in a corner room and despite the hotel's near emptiness, we were put in a room next to a family with an infant that cried much of the night. We don't chalk this one up to a horrible experience. They were minor problems, but you should be warned that promises made during booking are not taken seriously.", "Date": "January 5, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Gig Harbor, WA", "Title": "“Anniversary Weekend”", "Author": "JMPInstructor", "ReviewID": "UR121635483", "Content": "Stayed Saturday night on the first floor facing the atrium. Wonderful room, clean, high quality bed and linen. This hotel is the best of the Marriott brands that I have visited. The atmosphere and design is great, they've put a lot of thought into this and thankfully haven't done what corporate did to the Courtyard brand and ruin the local flare in favor of some screwed up sense of what the traveller wants. The atrium is beautiful, the spa was nice, but a little too hot. Breakfast at the Aqua Terra was good. The waterfalls and foliage add to a nice brunch. This is a great spot for a couple in the winter looking for a little bit of romance.", "Date": "December 11, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "1", "Overall": "1.0", "Value": "2", "Sleep Quality": "1", "Rooms": "1", "Location": "3"}, "AuthorLocation": "FL", "Title": "“Old bed -- bad night sleep”", "Author": "Radarman123", "ReviewID": "UR121337207", "Content": "Yes I know it an airport hotel. But it is a Marriott. Should be a Motel 8. Rooms are small. They gave me a corner room on the exec floor. HORRIBLE BED. Could not find a comfortable spot (like the mattress had holes in it). Restaurant was down (yes out of service for remodeling). So you are forced to use the Terrace restaurant by the pool. Exec lounge -- tiny. 3 floors of exec rooms and such a small lounge. OK if the lounge was small. But good food -- NOT. The evening snacks were some tired spring rolls and some salad sticks. YECH...", "Date": "December 2, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "2", "Sleep Quality": "4", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Juneau, Alaska", "Title": "“NICE but $$$$”", "Author": "KARAAK", "ReviewID": "UR121336947", "Content": "I must say this is a nice hotel. WE stay here 11/30/2011 just passing through. IT was every $$$$$. But you get what you pay for. Our flight got cancel and we needed something close. The room was small but very cozy. I ask for a crib and it was already there and waiting for our baby. I wish it was a little cheaper but I felt safe and welcomed... GREAT STAFF, CLEAN ROOMS.", "Date": "December 2, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Hampshire, UK", "Title": "“Much nicer than a normal airport hotel”", "Author": "Alan_from_Hampshire", "ReviewID": "UR121122511", "Content": "My wife and I have stayed here a few times in the past and did so again this summer, for one night after a long day's flying from London at the start of a long road trip. What we like - and still liked this year after several years' break - is that although it's a big chain hotel, at an airport, it has a much smaller feel to it than most such hotels. When you enter the Reception area, the style is reminiscent of some of those lodge hotels you find in national parks - all stone and wooden beams - and on a more modest scale than many large hotels. The staff seem helpful and friendly, and the rooms comfortable and well-equipped as you would expect. The rooms are built around a large closed atrium in which there's a pool. We've never tried the pool but we like the fact that it's there. It does mean that about half the rooms face inwards onto this area; we've always had rooms facing outwards, which I think may be better. The restaurant also is not bad for a chain hotel - we've eaten there several times in the past so did so again this time, and again were very happy with it. The restaurant doesn't seem very large but there was no problem getting a table, either for the evening or next morning for breakfast. Breakfast is good - but you have to make a choice between the extensive buffet (including freshly made omelets etc) or a la carte. Both were fine but you can't mix and match the two options, which made the choice harder as some things were only available on one and not the other, and vice versa. You have to pay to park at the hotel - I can't remember how much but it all adds the cost. As there's a Hertz rental office in the hotel, I suppose a good option might be to take the hotel shuttle from the airport, then pick up one's rental car from there the next morning - saving on a day's rental, and the cost of parking. It's just a thought. So - overall - this hotel is perfect for a night after arriving from afar. I'm sure we'll stay here again, the time our travels take us through Seattle.", "Date": "November 28, 2011"}, {"Ratings": {"Service": "2", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Grapevine, Texas", "Title": "“Great Hotel...avoid the restaurant”", "Author": "planeengineer", "ReviewID": "UR119949795", "Content": "Had another great stay at the Seattle Sea-Tac Airport Marriott. However, first time in a while (and probably the last time) I've had dinner in the on-site restaurant. They appeared to be understaffed with servers thus very slow service. Food was mediocre at best and expensive. Also, unless you have a Smart Car, you'll find the self-parking parking stalls to be extremely tight. I could barely get my mid-sized rental car into a spot and still allow for me and my passenger to get in and out of the car.", "Date": "October 31, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Boston, Massachusetts", "Title": "“Much more than an average airport hotel”", "Author": "johnfi", "ReviewID": "UR119946478", "Content": "Often times saying “airport hotel” has a connotation to a certain bare minimum room close to the airport but this hotel is more than that. Overall I would say it’s an average Marriott, well-kept considering it seems like the typical 80’s style layout etc. The northwest feel is nice with public areas with post and beams is nice and more than just a boxy hotel. The pool area would be great for families but not so much for adults traveling alone unless later in the evening but since it’s in the middle of the hotel everyone has to walk by and many rooms overlook the interior courtyard. The rooms are nice, textbook Marriott with furnishings and comfy bed however the bathrooms are tiny and barely room to move around in. Location for the airport is great with shuttles or a short 3 min drive. Hotel parking is fair based on cost and location and valet is a little more and prob worth it for convenience. All in all an average Marriott but I would say a great option for an airport hotel.", "Date": "October 31, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Nine Mile Falls, Washington", "Title": "“Good Location - easy to get to”", "Author": "kcschueler", "ReviewID": "UR119803972", "Content": "Good location to the Sea-Tac Airport with a free shuttle. Try to book a room on the side opposite of the airport for a better night's sleep. The fitness room is a little small for the number of people that were using the room. The hotel is always clean.", "Date": "October 27, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "3", "Overall": "3.0", "Value": "2", "Location": "4", "Rooms": "3"}, "AuthorLocation": "Nashville, Tennessee", "Title": "“Not the best experience..”", "Author": "erdrlady", "ReviewID": "UR119695134", "Content": "We picked this hotel because of its location to the airport and the indoor pool..no one told us at check in that there was a private party at the pool..when we saw signs stating it was closed, we tried to call the front desk for almost 20 min before we got someone to answer and they weren't real apologetic about the fact we couldn't use the pool..we also got charged twice for our room service but they did get that resolved..we also had neighbors who were loud all night but we never could get anyone to answer at the front desk..", "Date": "October 25, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Tahiti, French Polynesia", "Title": "“Very convenient hotel close to airport and mall”", "Author": "Niuhiti", "ReviewID": "UR119281459", "Content": "If you do not have a car , stlll want to do some shopping but are flying tomorrow, this is the convenient hotel for you. We took this hotel after our cruise, paid only 52 usd for the cab on saturday. No need to take the shuttle. We even manage to leave one heavy bagage before the cruise. The hotel accepted it and it was practical. Front staff very helpful. As we were busy shopping , we did not use the hotel facilities so we are unable to comment. The room was large and nice, nice bed.", "Date": "October 14, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "chagrin falls", "Title": "“Good Option for Sea Tac Area”", "Author": "islandjule", "ReviewID": "UR118933088", "Content": "Stayed one night b/c arrived late at Sea Tac Airport. Shuttle very convenient (courtesy phone located at ground transport at airport if you don't see van). Hotel has Pacific Northwest theme. Staff (from shuttle driver to front desk) very friendly. Used Marriott reward points for 1 King room. Very small. If you look on floorplan on back of door, there are just a few of these smaller rooms on each floor - book 2 queens for more room or ask for larger King room. Also, we had interior courtyard view (overlooking indoor pool - no natural light). Fine for one night, but would have been bummed if more than that. Room was clean and looked newly refurbished. Had breakfast at on-site restaurant next day. Pricey, but lots of choices, inc breakfast buffet. Also coffee bar w/pastries, muffins open in am. Took shuttle back to airport in morning to rent car for week-end - so we avoided paying for parking at the hotel which is expensive. As we drove back to airport next day, noticed that Marriott Sea Tac seems like one of nicest options on airport strip of typical chain hotels.", "Date": "October 4, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "1.0", "Value": "3", "Sleep Quality": "2", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Hillsboro, Oregon", "Title": "“Beware - unsafe parking lot”", "Author": "SemiconductorGuy", "ReviewID": "UR118865943", "Content": "We stayed at this Marriott last night, self-parking our car for $19.00 in the gated lot. Our car was broken into during the night and our in-dash GPS/receiver was stolen. We were parked just a few feet away from the southeast entrance, in a well-lit area, directly under a lamp. Evidently this is a high theft area near the Sea-Tac Airport; however, this parking lot has insufficient surveillance. The other disappointment was that we didn't get a good night's rest. When booking we requested a high floor, Concierge level. What we got was ground floor facing the pool. We asked twice to have a quiet room and were told \"all of our deluxe rooms face the pool.\"", "Date": "October 2, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "", "Title": "“Another great stay and successful event!”", "Author": "hatlad", "ReviewID": "UR118799097", "Content": "Back again as host of an evening event put on in this hotel. Though the conference area was under construction all round our meeting room, the staff worked around it very effectively and all came off successfully. Not even sure our attendees were aware of the construction the way it was decorated around in the one hallway just outside. Emily and other banquet staff were terrific! Attentive to every issue of a successful event. Bravo to them. The guest room was wonderful! What is it about Marriott beds? Was clean, very quiet and exquisitely comfortable. Will probably do it again right here next year.", "Date": "September 30, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Liverpool", "Title": "“Pre-Cruise base for 12 hours - handy for airport not close to town.”", "Author": "Chippyqueen", "ReviewID": "UR118351159", "Content": "Stayed here the night before a transfer to Anchorage for a cruise, so was booked by the travel agent. We waited a while for the courtesy bus at the airport as its clearly a popular hotel so it delayed us by an hour getting into the middle of Seattle to see the Space Needle before it closed for the night ----but we made it eventually. Staff were very helpful, the barman a bit over familiar and the food wasnt great (cold and a bit limp) but it was a modern property with huge bedroom over looking a very tropical indoor pool which we sadly didnt get time to use. The airport terminal & light railway stop is at the bottom of the road so not in the middle of nowhere. I liked it - Chippyqueen says yes!", "Date": "September 20, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Prineville", "Title": "“Love the pool!”", "Author": "DubPirate", "ReviewID": "UR118340346", "Content": "The atrium pool is the highlight of this hotel. I've stayed twice and have enjoyed the tropical ambiance of the pool area. I love how close the hotel is to SeaTac airport. If you have to stay near SeaTac and want a great relaxing night, stay at the Mariott. Be aware the Mariott charges 20 dollars a night for parking. I give them a 3 for value because of the parking fee.", "Date": "September 19, 2011"}, {"Ratings": {"Location": "5", "Overall": "5.0", "Value": "5", "Service": "5", "Rooms": "5"}, "AuthorLocation": "Anchorage, Alaska", "Title": "“The most incredible crab bisque, surrounded by a perfect room and hotel.”", "Author": "verymary", "ReviewID": "UR118293255", "Content": "I stayed here during my former life, many years ago. I'm sure the hotel was terrific yet I always remembered the fabulous crab bisque I ordered from the room service menu. It was simply delectable and none I've tasted since can compare. But never one to mix my old life with my new one, I hadn't returned to this Marriott, and for these many years the memory of that crab bisque tortured me during our frequent overnight stops at SeaTac (especially with the bright red MARRIOTT sign atop the hotel beckoning from it's perch on the hill across from the airport.) Finally, I clued in my new life to this old life experience and after all this time we booked a stay here so that I could reunite with my old friend, Best Crab Bisque Ever. Woohoo! The reunion was all I had hoped it would be and more. Plus, we discovered a perfectly lovely hotel! Our beautiful room was exceptionally comfortable - and the indulgent bath amenities were the most fragrant and luxurious I've experienced in a product provided by a hotel. (Even the shuttle driver was well aware of the popularity of the product line and supplied me with ordering info as he delivered us to the light rail stop for a zip into Seattle.) The lobby decor here feels slightly rustic, with post and beam construction, but with an elegant, modern edge. The rooms are modern and good sized with large windows and lavish bedding. There is a nice pool in an atrium and the soaring ceilings and rock fireplace are reminiscent of a contemporary mountain lodge. Due in part to my happy reconnection to BCBE, the experience here was awesome and my new life and I look forward to our next stop at SeaTac and this delicious hotel.", "Date": "September 19, 2011"}, {"Ratings": {"Location": "5", "Overall": "4.0", "Value": "5", "Service": "5", "Rooms": "4"}, "AuthorLocation": "Cleveland", "Title": "“Typical Marriott; good shuttle service to airport.”", "Author": "ClevelandJP", "ReviewID": "UR118270700", "Content": "Comfortable, king bed room with typical Marriott decor & amenities. (love the orange ginger aroma therapy toiletries!). Room was surprisingly quiet even though we were on main floor just around the corner from the lobby, elevator, and bar. Friendly service at front desk. Quick shuttle service to / from airport.", "Date": "September 18, 2011"}, {"Ratings": {"Location": "4", "Overall": "4.0", "Value": "3", "Service": "4", "Rooms": "4"}, "AuthorLocation": "Sycamore, Illinois", "Title": "“comfortable stay”", "Author": "John36758", "ReviewID": "UR118039817", "Content": "Although the room was not large, it was clean and fully equipped as you would expect Marriott to be. The hotel was very close to SeaTac.", "Date": "September 12, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "4", "Service": "5"}, "AuthorLocation": "Longmeadow,MA", "Title": "“Great airport hotel”", "Author": "Luceric", "ReviewID": "UR117917400", "Content": "We spent our last night on the west coast at this Marriott before a morning flight. Really nice hotel & we will stay here again. Rooms were typical Marriott. It has a very large central area with a pool as well a comfortable stuffed chairs. A few things to note: They don't allow roll aways in the rooms with 2 beds. We didn't notice any restaurants within walking distance although you can walk downhill to the light rail & take a train to downtown- its not a long distance but you do need to walk uphill on the way back . The restaurant food was good but pricey for dinner. The airport is very close but we heard no airplane noise. We used the business center to print our boarding passes. Shuttle to the airport was on time and convenient.", "Date": "September 10, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "4", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Washington, DC", "Title": "“Top notch airport hotel!”", "Author": "metrochica", "ReviewID": "UR117772988", "Content": "I stayed at the Marriott Seattle Seatac after reading all of the outstanding reviews on TripAdvisor and now I can add my own gushing review. This is a gem of an airport hotel. Beautiful lobby, atrium and pool. Clean, updated rooms. Tasty food from the restaurant. It's also just a short downhill walk to the light rail that easily takes you to downtown Seattle in 20 minutes. The staff were super helpful and friendly. I had an atrium facing room which was lovely and since I was facing inside I did not hear any planes. I did hear kids in the pool some nights, but not too late. Never loud enough to keep me from sleeping. I ate at the restaurant a few times and if you have the opportunity try their chowder. It is delicious. I also used the light rail multiple times to head into the city and it was easy, clean and fast. Definitely a fun commute. Overall, I really enjoyed my stay. The hotel was a perfect oasis conveniently next to the airport.", "Date": "September 6, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "3", "Rooms": "5"}, "AuthorLocation": "Houston, Texas", "Title": "“Great hotel near airport!”", "Author": "andrizzle", "ReviewID": "UR117627465", "Content": "This hotel was recently updated, vert clean, updated tv, bathroom was very clean and well-lit. For all you germaphobes out there, you will like this hotel. Service was very good, the front desk was approachable and willing to help. We stayed here with points so I'm not sure about the value of it, but our experience was very enjoyable. If we needed to stay near the airport again, we would pick this hotel. It's about 20 minutes from downtown. Ambience is wonderful!", "Date": "September 3, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "4"}, "AuthorLocation": "South Shields", "Title": "“All you can ask for in a Airport hotel.”", "Author": "Ramzzz", "ReviewID": "UR117218831", "Content": "I have stayed at this place twice , the latest being September 2010. The hotel is a very nice place to live and very close to the Airport which makes it very convenient for the regular travelers. It have a very nice and warm feel to it, the staff was courteous and very happy help. Great rooms , good bed, Great Gym, Nice swimming pool. The food was good , specially the lobster sandwich. It was a wow. Free internet in the reception area. Well what can I say , it was great overall.", "Date": "August 25, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "4.0", "Value": "3", "Service": "3"}, "AuthorLocation": "Tennessee", "Title": "“Nice place & close to the airport”", "Author": "4TNTravelers", "ReviewID": "UR117202001", "Content": "We flew into Seattle and caught the shuttle to the hotel. It was a nice place to stay overnight. We didn't have time to enjoy the indoor pool, but it looked very nice! Had breakfast at the hotel and it was good. If we are in the area, we would stay there again.", "Date": "August 24, 2011"}, {"Ratings": {"Overall": "3.0"}, "AuthorLocation": "Nashville, Tennessee", "Title": "“Friendly staff but a little long in the tooth”", "Author": "ctsv157", "ReviewID": "UR116939847", "Content": "Nice enough but in need of an upgrade which is in the works . Once its done , Id be happy to return.", "Date": "August 19, 2011"}, {"Ratings": {"Cleanliness": "1", "Sleep Quality": "1", "Overall": "5.0", "Value": "1", "Service": "1"}, "AuthorLocation": "Kula, Hawaii", "Title": "“One of the best airport hotels!”", "Author": "Mauigal2010", "ReviewID": "UR116823830", "Content": "We had planned to return to Seattle for one last day before heading home and elected to stay at Marriott's Sea-Tac Hotel using points. It was a comfortable place to stay - we were upgraded to the concierge floor so we had plenty of food to eat for our two night stay, and it was quiet enough to rest and for my husband to do some work. The pool area looked very inviting but we had no suits with us and we appreciated the on-time free airport shuttle. We would definitely return here again!", "Date": "August 16, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Florida", "Title": "“Great hotel, didn't even know it was near an airport!”", "Author": "jbags39", "ReviewID": "UR116322160", "Content": "My family spend our last night of vacation at the Marriott since we had an early morning flight out. It was a great choice! Everyone there was helpful, friendly, and worked with us while trying to return a rental car near deadline time. Picked us up promptly and helped with all our baggage including car seats and strollers! We even ate dinner that the hotel restaurant and had wonderful fish and chips!! We never experienced any noise from the airport and had a very restful night. We would definitely stay here again when traveling to Seattle.", "Date": "August 5, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "4", "Overall": "3.0", "Value": "3", "Service": "5"}, "AuthorLocation": "West Chester, Pennsylvania", "Title": "“Great Hotel-Bad Music”", "Author": "duke4bb", "ReviewID": "UR115980471", "Content": "We have been staying at the SeaTac Marriott for several decades. The staff is the best as are the rooms,service and cleanliness. The 'music' environement however in the lobby, resteraunt and entrance is not becoming to this professioanal facility. One would assume they were in a disco bar. We and others [customers] have commented previously with no response from management. This hotel, especially for the prices, can 'do better' since it deserves better. I would have a difficult time recommending the SeaTac Marriott until the business environment improves and that is too bad since the staff is great. Tom Evans", "Date": "July 29, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Saint Louis, Missouri", "Title": "“Exceptional”", "Author": "gmccomy", "ReviewID": "UR115967276", "Content": "I went to Seattle for the first time for business and stayed at this hotel that was directly across from the airport. I was pleasantly surprised that I never once heard any noise from the airport. There customer service was first class. The hotel was extremely clean, updated, bright and airy. There accomodations were perfect. They had a great workout room, a wonderful full free service breakfast each morning, the restaurant food was very tasteful and the openness to the lobby with gift shop, bar/food and pool was very inviting.Best of all the bedding was the most comfortable bed/pillows that I have every had at a hotel. I recommend this hotel to anyone. I will have to say that I was surprised that you had to pay to park their. I am from St Louis and nowhere do we have to pay to park at a hotel. My business partner, however, did say that I should get use to paying to park b/c it is very common.", "Date": "July 29, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "4", "Service": "5"}, "AuthorLocation": "Cheshire, England", "Title": "“Very comfortable”", "Author": "Longtonian", "ReviewID": "UR115949343", "Content": "Stayed here on our way back from a cruise. Considering it is an airport hotel it is outstanding, with a great indoor swimming pool, extremely comfortable beds, nice bar and friendly service.", "Date": "July 29, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "3", "Overall": "3.0", "Value": "4", "Service": "3"}, "AuthorLocation": "Vancouver, Canada", "Title": "“Good Airport Hotel but.....Noisy”", "Author": "Aussiejack1", "ReviewID": "UR115667450", "Content": "We recently had a weekend stay at this hotel. I would say it is a fairly average to good airport hotel. Our room was on level 1 and faced the indoor atrium pool. If you value your sleep and in particular a weekend sleep in you might want to ask not to be on this level. It was particularly noisy on the Sunday morning starting at 7.30am. Way too early for me! On the other hand on the Saturday night my girls loved the chance at being able to go for a swim indoors! So, I suppose I'll put up with the noise. The restaurant was mediocre at best. It is very dark, The menu seems limited. The kids meals are good value both at breakfast and dinner as well as room service. In the restaurant the wait staff seem flusted and busy and don't seem to accommodate your requests. After waiting about 10 min for cream for our coffee one morning we used some of the kids milk from their cereal, and had some \"lovely\" cold coffee. The rooms are clean and adequate but on the small size. There is no fridge in the room, but you can request one. The beds were comfortable. Overall an average airport hotel.", "Date": "July 22, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Corpus Christi, Texas", "Title": "“Very nice hotel, we would recommend to anyone.”", "Author": "barbarapitts", "ReviewID": "UR115403008", "Content": "Everything about this hotel was wonderful. We were on our way to Alaska, and had to overnight in Seattle. The shuttle picked us up right on time, and it was a very short ride from the airport The rooms were great and so was the bar. I would recommend this hotel to anyone and hope to return again myself.", "Date": "July 15, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Santa Barbara, Ca.", "Title": "“Great Service - Would stay here again!”", "Author": "NikitaH", "ReviewID": "UR115106599", "Content": "Great airport hotel. The beds were firm, ample pillows, and an ample breakfast. A call to the hotel sent the shuttle service to pick us up quickly. They volunteered to take us to a nearby restaurant but we selected to walk. Great food at a nearby Dinner. In the morning the hotel shuttle took us back to the airport. An airport shuttle took us to downtown Seattle to pick up our Hertz rental car. We arranged to return the car to Portland. Thus, all the extra fees of renting a car from the airport were avoided. Very friendly staff at the Marriott that made everything convenient.", "Date": "July 6, 2011"}, {"Ratings": {"Sleep Quality": "1", "Overall": "2.0", "Value": "2"}, "AuthorLocation": "Fairbanks, Alaska", "Title": "“Noisy”", "Author": "AAL08", "ReviewID": "UR114646130", "Content": "I chose this hotel because we arrived at SeaTac at 10 pm and didn't want to drive very far at that time of night. The primary reason most people go to a hotel is to sleep, and that was difficult to do at this hotel. Our room faced the atrium, a covered swimming pool area, where sound echoes. There were people out at the pool until at least 2:00 a.m. -- I finally used ear plugs so I could get some sleep. Unfortunately, the early birds were out at the pool at 6:00 a.m., so it was a very short night for me! Very serious design flaw in this hotel! The parking area is also annoying. It was difficult to find my way in to the hotel registration area at night because the signage was inadequate. Then, a key is needed to exit the lot; I had left my key in the room for recycling, so I had to go back and wait for a housekeeping manager to let me in the room so I could get away from this place. Next time I arrive on the 10 p.m. flight I will drive at that time of night to find a place to actually get some sleep.", "Date": "June 22, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Baltimore, Maryland", "Title": "“A River Runs Through It!”", "Author": "kcima", "ReviewID": "UR109814825", "Content": "Don't forget your bathing suit! Each of the rooms located on the 1st floor open to a beautiful, fully landscaped atrium with an inviting pool, hot tub, and a stream running through it. Great for unwinding at the end of a long day. Airport hotels are typically scary places but Marriott has completely renovated this little gem. Staff is great and rooms are clean. Free shuttle leaves from the hotel to the airport every 15 minutes from 4:15 am to 12 am. I had a quick meal that was scrumptious. I am a happy camper.", "Date": "May 25, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Nottingham, United Kingdom", "Title": "“Unwind and de-stress in superb style and comfort”", "Author": "UKBusinesslady292", "ReviewID": "UR109208912", "Content": "After a couple of stressful flights from Alaska, the stress simply melted away from the time the airport shuttle bus picked me up to the time they said goodbye and wished me well. This Marriott is the benchmark by which ALL hotels should be measured. I am a Customer Service training specialist and even I was blown away by their utterly genuine and sincere excellent customer service. When I was told by check-in that it was a pleasure to welcome me to the hotel I actually felt very special. I could not fault them in the slightest. EVERY staff member I came across was charming, polite and superbly attentive. The beds were heavenly, so soft. Such a change from the usual cost-saving lumps of concrete often tolerated these days. My room overlooked the atrium which was absolutely delightful. A kind of indoors/outdoors area with pool well screened by foliage plus several clusters of spacious conservatory style furniture which just begged me to take advantage of. How relaxing it was to sit in comfort reading a book and unwinding. Even though the lobby area was lively with early evening guests enjoying a pre-dinner cocktail, the sense of intrusion normally felt in such hotels was noticeably absent in that the design of each area ensured privacy and intimacy. Superb customer service continued into the restaurant. Again I was blown away by their attentiveness, finely tuned to ensure it is not overdone. Not only would I highly recommend this hotel, I would even go so far as to orchestrate my schedule to necessitate another stay in the very near future. The staff should be congratulated on their service. They obviously work very hard yet are like the proverbial swan - calm and serene on the surface, whilst working harder than ever behind the scenes. A superb example of exemplary customer service. Thank you.", "Date": "May 21, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Saipan, Mariana Islands", "Title": "“Nice & cozy and close to Sea-Tac airport!”", "Author": "PDLGM", "ReviewID": "UR108866349", "Content": "To avoid the long drive from another city in Washington, and to avoid any possible traffic delays, my husband and I stayed here to catch a flight out in the early morning. Service was great and the restaurant had excellent quality food! The room was standard - too small if you ask me - but it was nice and cozy enough for a 1-night stay. I also forgot a peice of jewlery in the restroom and the staff was quick to send it to me. Thank you, Marriott!!!", "Date": "May 18, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "2", "Sleep Quality": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Jupiter, Florida", "Title": "“Lovely hotel, staff needs some education on local area. $13/day wifi!!”", "Author": "TropicalTraveler78", "ReviewID": "UR106728483", "Content": "I really enjoyed staying here. It has a very unique indoor pool. The rooms are very nice, modern and well-equipped. The in-room wifi is a complete ripoff and is unacceptable when paying these kinds of rates. Of course then most people went to the business center and one of the computers was broken so you always had to wait. Or you could sit in the lobby with your computer for free wifi. Annoying. Also the parking situation where you have to use your key to get out is annoying. But I could understand that they are near the airport and people probably try to take advantage. Otherwise it is a lovely hotel that is very clean and the sleep quality was very good. The staff should get some more education on Seattle though. If you want to go in there there was a lot of cluelessness.", "Date": "May 3, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "3", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Grapevine, Texas", "Title": "“Favorite Seattle Airport Hotel”", "Author": "planeengineer", "ReviewID": "UR104290183", "Content": "I've stayed here many times. On a number of occations, it's just for one night before an early departure the next day. Nevertheless, they always take good care of me. And the hotel is VERY convenient to the airport!", "Date": "April 16, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "new hampshire", "Title": "“Makes air travel seem fun again”", "Author": "greylaggoose", "ReviewID": "UR102825902", "Content": "Since I would be arriving late into SeaTac from the East coast, I decided to stay one night at the airport Marriott before heading into Seattle the next morning to meet friends. I expected just a bit of convienence but instead found a wonderful welcome to Seattle in an unexpectedly luxurious setting. The hotel itself was lovely, evoking a sense of Northwest charm. The lobby was comfortable and inviting, with a bar that overlooked the garden style pool/atrium. I enjoyed a delicious jumbo shrimp cocktail with a generous glass of wine. It was a wonderful way to relax after a very long day of travel, especially knowing that my room was just steps away. The location was as convienient as can be - minutes from the airport with shuttles running at frequent intervals. (I know this for a fact since I used the shuttle several times, having forgotten something at the hotel and using the shuttle to pick it up before I flew out of town). The staff - the front desk, the shuttle drivers. the bartender, the waiters at breakfast, the store clerk - all of them were wonderful - friendly, professional and helpful. (One desk clerk seemed to be having a bit of a bad day when I returned to pick up my forgotten item, but I, too, was feeling a bit rushed and inpatient - still, it was nothing that detracted from the overall experience). Perhaps tellingly, there seemed to be quite a few flight crews staying at the hotel. In my experience, I haven't found too many airport hotels that would be worth the visit besides the convienence - the SeaTac Marriott is an exception. It's a nice hotel, airport or not! It made flying seem like fun again.", "Date": "April 4, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "3", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Atlanta", "Title": "“Nice airport hotel”", "Author": "ammatlanta", "ReviewID": "UR102709668", "Content": "Basic Marriott near the airport. There is an airport shuttle to the hotel or parking (pay) at the hotel. There is breakfast for rewards members. The location is not in the best section of town; however, it is across the street from the airport.", "Date": "April 4, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Midwest", "Title": "“Nice Hotel - Wonderful Lobby/bar/swimming pool”", "Author": "b1ue1cz", "ReviewID": "UR102250534", "Content": "Great for business. Near airport, highway, easy to get in and out. Great room service, meal came hot and extra sauce exactly as I requested. Lounge was nice as well. Internet had decent speeds in the evening. Only reason I did not give a perfect rating, bathroom on the 8th floor was a little small, but was ok. Great job to the hotel management. Keep up the good work.", "Date": "March 31, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "3", "Sleep Quality": "3", "Rooms": "4", "Location": "5"}, "AuthorLocation": "alaska", "Title": "“GIIVE THAT MANAGER A RAISE!!!”", "Author": "valcarcejim", "ReviewID": "UR99831667", "Content": "I stopped staying at this hotel a few years ago, and reluctantly agreed to stay for an overnight quick business trip. Wow what a difference. The rooms, and in fact the entire hotel, is spottless. The health center is clean, fully detailed, and really well maintained. The conceirge lounge, which years ago was a disaster, was amazing and staffed with a really wonderful, friendly and upbeat host who served amazing snacks. I really was shocked by the hotel and the fact that I did not have one complaint. Everything was PERFECT. Please give that manager a raise! All Marriotts need to send their managers to this hotel to see how a well run hotel operates. I will be back!", "Date": "March 11, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Cleveland, Ohio", "Title": "“One of the BEST”", "Author": "cless", "ReviewID": "UR92014332", "Content": "Everything was fantastic, from the time the courtesy van driver picked us up at the airport until we returned to the airport. We had a flight mixup and found ourselves at the airport at 7 pm, with no room and 28 hours until our red eye flight the next evening. We were able to get reservations immediately using the Marriott central phone reservation system. The van arrived within 15 minutes and we were at the hotel 10 minutes after that. We were greeted with extreme courtesy at the hotel. The front desk clerk was especially cheerful and helpful. She provided us with a Marriott Platinum room upgrade before I even requested it. Once we got settled in the large, comfortable room, we went to the Club Lounge and were, again, pleasantly greeted. The manager asked if we'd had dinner (it was about 7:30) and when we replied we had not, she prepared us a wonderful dinner from the evening's buffet, even tho it had closed at 7 pm. She was very attentive throughout the time we spent in the Club Room. The indoor pool and hot tub were wonderful. Perfect temperature and wonderful scenery. The workout facility was top rate. The next day we had breakfast in the Club Room. Again, great food and service. We had a late lunch in the lobby bar. Superb food and service. I have travelled to thirty countries, and this is one of the best hotels I have ever visited. Superb!", "Date": "January 6, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "3"}, "AuthorLocation": "Tacoma, Washington", "Title": "“Fantastic customer service in a great hotel”", "Author": "zippycomehappy", "ReviewID": "UR87920194", "Content": "I realize that staying at the airport is not ideal, but if you have to, the Marriott is great! Their customer service was superb. Rooms where beautiful and the beds were VERY comfortable. The indoor atrium beautiful and the pools is warm and fun to swim in. It's also a few blocks away from 13 Coins which has great food and open 24 hours.", "Date": "November 22, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "virginia", "Title": "“Easy Airport Access”", "Author": "crazyteapot", "ReviewID": "UR86658326", "Content": "We booked 4 rooms here using prepaid option. We were flying to Hawaii and used two rooms for flight out and 2 for return flight. Their shuttle picks you up at the airport and delivers you right to the door. There is a 7-Eleven just across the street and the Lite Rail Station is about 3 blocks downhill. The shuttle driver will stop at the corner for you to get to the lite rail only if you have no suitcases as it is a busy intersection. Lite rail can be accessed right from the airport so it is very easy to use and inexpensive to get to downtown to look around, $2.50 round trip. They have an excellent website that goes into more detail on Lite Rail. The only meal we was breakfast off the menu which was very good. Nice indoor pool area.", "Date": "November 10, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "3.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Sarasota, FL", "Title": "“Use Caution if Parking Your Vehicle There”", "Author": "baycityart", "ReviewID": "UR83966486", "Content": "The hotel is OK. It's an older property with odd room layouts but overall it is certainly an adequate airport hotel. Front desk personnel can be rather curt but the breakfast waitress was particularly friendly. However, clean out your car if you are parking there. We did not and our vehicle was broken in with window destruction and items stolen. The parking attendants told us not to worry that they would watch it but it was moved to a remote area of the parking lot and vandalized. Don't leave your car there for a lengthly stay.", "Date": "October 18, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "", "Title": "“Great facility for overnight stay &/or for holding a conference”", "Author": "hatlad", "ReviewID": "UR83272275", "Content": "Close to SEA/TAC, nice atrium, rooms clean and relatively quiet. Conference facility very nice and staff very easy to work with.", "Date": "October 13, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "2.0", "Value": "1", "Sleep Quality": "1", "Rooms": "2", "Location": "4"}, "AuthorLocation": "Fairfax, VA", "Title": "“Not Impressive”", "Author": "Business_TravelerFFX", "ReviewID": "UR82256196", "Content": "Marriott has been my favorite brand, but this one is not one that I will return to. Because of our Marriott Rewards status, we were upgraded to the Concierge Level. However, the Concierge Lounge is closed all day on Saturday, the day we arrived, and doesn't open on Sunday until 5:30 PM. Our room, meanwhile, was on the back of the hotel facing the air handlers and exhaust units that ran all night. This is how Marriott treats its highest reward point members? I think that we will start staying at Hilton properties instead. BTW, I was also turned off by the $13.95/day charge for Internet access. What part of \"Concierge Level amenities\" don't these people understand? Thanks, Marriott Seattle, for a most unforgettable Concierge room experience.", "Date": "October 6, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Virginia", "Title": "“Nice atrium, close to airport”", "Author": "VASoxfan", "ReviewID": "UR82117712", "Content": "Stayed here for business in late September. This is an older Marriott property, as you can tell from the low ceilings and older decor. On the plus side, it's clean, comfortable with a very nice lobby, bar/restaurant, and \"tropical\" atrium with pool). Service was also excellent. This is a great property if you need a hotel close to the airport. Just don't stay in the \"back\" of the hotel, as the garbage trucks empty the dumpsters at about 5:30 every morning.", "Date": "October 4, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Needham", "Title": "“This hotel was a very nice place to stop over...”", "Author": "readnsurf", "ReviewID": "UR77428703", "Content": "I came with some caution because of a few negative comments. I would recommend this hotel to others. The service was excellent and the airport shuttle goes exactly on schedule. If you come, I would request a room with a view of the pool, which was very pretty and a nice size for relaxing... As for the food, the breakfast in Aqua Terre was delicious. I would recommend the omelette with sausage, spinach, mushrooms, and parmesan cheese which was terrific. Finally, the beds were extremely comfortable and you didn't hear one plane go by!!!", "Date": "August 30, 2010"}, {"Ratings": {"Overall": "1.0", "Service": "1"}, "AuthorLocation": "friday harbor", "Title": "“Outrageous treatment of a friend”", "Author": "suzysji", "ReviewID": "UR77413472", "Content": "I booked a room for a friend and called to ask that they bill my credit card. When he showed up, they wouldn't use my card and he didn't have enough money, he had to go sleep in the airport. Then the hotel USED MY CARD to bill for a no-show!!!! Seriously unbelievable. And I can't get them to refund. On to disputing the charge with my credit card company. I will not be staying at any Marriott soon, and NEVER this one!", "Date": "August 29, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Chattanooga, Tennessee", "Title": "“Convenient, standard Mariott”", "Author": "KingHuskey", "ReviewID": "UR74170482", "Content": "Stayed here to start a trip to Mt. Rainier as it was close to the airport. The property was pretty nice, they have a great indoor pool and a nice restaurant/lounge. The only drawback was the apartment behind the hotel, I could hear some noise from there. The rooms were clean, the staff was nice.", "Date": "August 7, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "3", "Sleep Quality": "5", "Rooms": "5", "Location": "2"}, "AuthorLocation": "Toronto, Canada", "Title": "“This hotel doesn't feel like an \"airport\" hotel at all. I wish I stayed longer!”", "Author": "archangeli", "ReviewID": "UR74131933", "Content": "I was worried this hotel might be noisy since the bar & restaurant in the lobby were very busy, but my worries were unnecessary. Like most Marriott's this hotel was a haven for me to rest and relax. I had a room with a king-sized bed. The bed was wonderfully comfortable, with a mountain of pillows. Each bedside lamp has a plug outlet at it's base for charging your phone - although one of the lamp outlets wasn't working in my room. There was a LCD TV, coffee/tea maker, but no refrigerator. The bathroom was spotlessly clean, and had a real hairdryer (not one of those horrible wall-mounted things). This hotel has Bath & Body works amenity products in Orange-Ginger scent. The scent was a bit strong, but nothing I couldn't deal with, however someone will a perfume allergy might find it overpowering. The hotel charges 12.95/day for WiFi or wired internet access unless you have a voucher (for a convention, etc). There is an ethernet cable provded in the desk drawer. There are LOTS of conference rooms of various sizes. The indoor pool is gorgeous - it has an outdoor feel since it's located in the atrium of the hotel. It made me think of a lovely cruise ship/ resort. There is a complimentary airport shuttle to SEA that runs every 15-20 minutes.", "Date": "August 7, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Edmonton", "Title": "“Very nice for an airport hotel”", "Author": "B'sbirdhouse", "ReviewID": "UR73046089", "Content": "Came for the Feis (Irish dance compitition) and stayed a couple more days to enjoy Seattle. Nice staff, nice rooms, nice pool (very nice according to my kids). Although it is out by the airport we found it fairly easy to get wherever we wanted. The new LRT line can get you downtown quickly. I hope to come back.", "Date": "July 30, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Norcross, Georgia", "Title": "“Served our purposes well for a one-night stay over”", "Author": "gaken", "ReviewID": "UR72883937", "Content": "Like a number of other reviewers, my wife and I stayed at this Marriott on both the front and back ends of an Alaskan cruise. We relied on the cruise line, Lindblad, to do our booking for us and as such found a number of our fellow passengers there. Overall no serious issues. We did have a ground floor room facing the outside, which was quite a little hike from the lobby. Although that got us far away from the pool noise other reviewers have complained about, it exposed us to a whole other set of street noises -- including what sounded like Mariachi music (could never tell where it was coming from) -- at least early in the evening. Our room was fine, but I'm real easy to please as far as that goes. We had drinks and appetiziers in the bar area and breakfast in the restuaruant on both legs. The food was fine, but as is typical of hotel fair a bit overpriced. The airport shuttle was a great convenience, running about every 15-20 minutes, and we used it both times we were there. One caveat -- I gave a five rating for location, but that's because it was convenient for us coming and going to the airport. For someone looking for a more extended Seattle stay, that rating would not hold. Being a totally non-smoking hotel was another plus for us.", "Date": "July 29, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Ocala, Florida", "Title": "“A nice property with wonderful staff.”", "Author": "OCALAFLORIDATRAVELER", "ReviewID": "UR72012801", "Content": "My wife and I stayed here on our way back from Vancouver having just did a 13 day Alaska cruise out of San Diego. I was pleasantly surprised when I arrived that the staff were incredibly helpful, they went out of their way to make you feel welcome. The food in the restaurant was also good but not incredibly great but good for hotel food. I've stayed at some properties where the food was barely palatable. The service was a bit slow, but in the servers defense she seemed to be the only one working. The breakfast buffet was good. The room was standard Marriott room. Incredibly small bathrooms and I mean small. Internet was a charge per day which I don't understand with Marriott properties. Can stay at a courtyard and get free internet, pay more at a Marriott property and pay for the internet. The Internet should be included in the price at the higher end Marriott properties and charged for at the lower level executive hotels like Courtyard and Fairfield Inn. Overall this is an excellent choice for cruise travelers both coming into Seattle or leaving Seattle. Take advantage of the free shuttle to the airport, although we took a sedan to the airport for our very early morning flight from Seattle to Alaska. Charge of $20.00 was well worth it as we were whisked right to the Alaska Curbside check in.", "Date": "July 23, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Vancouver, Canada", "Title": "“Pleasantly Surprised”", "Author": "mr_and_mrs_a_73", "ReviewID": "UR71838446", "Content": "We booked this hotel through Priceline (for a great rate!) since we needed somewhere to stay before a flight to Hawaii. The hotel a bit dated from the outside, but as soon as you walk into the lobby you'll quickly realize that it has been updated - very modern interior. Check-in was very fast and the front desk person friendly. The room was nicely renovated and had Bath & Body Works products in the bathroom. The atrium pool area was really nicely maintained - a large pool and two hot tubs. The restaurant / lounge had fantastic food. All in all, we were really impressed with this hotel and would suggest it to anyone who is staying in the Sea-Tac area before a flight.", "Date": "July 21, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "3", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Honolulu", "Title": "“Great place to stay - good value & family friendly”", "Author": "HawaiiTravelMom", "ReviewID": "UR70855874", "Content": "We have an 18 mo old baby and my husband and I stayed there with my parents & sisters family with their 3 kids ages 11-17yrs after our cruise to Alaska. The rooms were clean and spacious but there was no minibar/refrigerator in the room so I couldn't keep food in there for my son. We were in adjoining rooms 286 & 284 facing the atrium/pool. It was noisy due to the echo of kids playing in the pool all day & night and we could hear music from a ballroom event. My parents were in room 275 facing the airport and their room was very quiet but a bit far from the lobby. The enclosed pool was awesome and our kids had a great time swimming. The room service was ridiculously slow so we drove 5 min up International Boulevard to Subway. The hotel is minutes from the airport and the free hotel shuttle runs every 15 min, they are super courteous and helped my parents who have a wheelchair with all our bags. There is a kiosk in the lobby that allows you to check in online and print your boarding pass for free, plus a display on the wall showing the current departure times for all flights. There is a Hertz rental car kiosk in the lobby and we rented a car for 2 days at a good rate. All very convenient. There is a train stop a short walk from the hotel which might take you into Downtown. Free internet access in the lobby but my computer got the signal in my room. I'd recommend this hotel to anyone with kids or without. If you want quiet, I'd recommend a non-atrium facing room.", "Date": "July 14, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Sleep Quality": "2", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Minnesota", "Title": "“Seattle Visit”", "Author": "Dave127", "ReviewID": "UR67354108", "Content": "I stay at Sea-Tac Marriott on 06-11-10 because of an early flight the next morning. Was picked up at the airport after dropping off my rental car. The shuttle was very prompt and I learned that it ran every 15 minutes from the hotel. At the hotel check in was very fast. My family was given a room over looking the indoor pool. Previous reviews that said it was loud if you have a room facing the pool were correct. The rooms are not large, but have stayed in ones that are smaller. If you want a quiet room request a room facing the exterior. When flying out the next morning the shuttle to airport was once again prompt and it was a short 5 minute ride. One recomendation to the hotel would be to add insulated windows to the interior rooms.", "Date": "June 13, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "4", "Rooms": "5"}, "AuthorLocation": "Portland, OR", "Title": "“Visited for a conference. Beautiful...”", "Author": "KaceyB", "ReviewID": "UR67035533", "Content": "Visited for a conference. Beautiful hotel. Had to do a double take-- not your typical airport hotel!! I didn't try the restaurant, but conference food was excellent. Very fresh, nicely presented. Staff was great. Not great for tourist stay (it's a haul to city center). But excellent if needing to be near the airport!!", "Date": "June 10, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "3.0", "Value": "2", "Sleep Quality": "4", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Palo Alto, CA", "Title": "“Aging Marriott property”", "Author": "Mooneydriver", "ReviewID": "UR64885618", "Content": "I stayed at the SeaTac Marriott for two nights. It's an older Marriott property, and it shows its age. Rooms are recently upgraded with the most recent Marriott furnishings, but they are rather small. Bathrooms are rather small as well (but not as small as some Marriotts). Water-saving faucets are a joke (in general, I have a dim view of hotels that claim to be earth-friendly but don't bother to recycle bottles and cans). The AC in my room was quiet and functional. Windows are not as soundproof as some other airport hotels. Fortunately, the hotel is1/2 mile east of the main runways and as such away from flight arrival-departure paths. One design flaw of the hotel is that it is centered around a covered courtyard which contains the swimming pool. Yes, there's a large swimming pool in the middle of the hotel! As a result, the atrium and surrounding areas smell like chlorine. Fortunately, my room faced the outside (parking lot) instead of the atrium and smelled fresh enough. Parking is expensive, but there's a convenient free shuttle to SeaTac. The Concierge Lounge breakfast is unappetizing, consisting of eggs, greasy sausage, some fruit, and supermarket bread. Finally, free internet access for Marriott Rewards Gold and Platinum members. Others pay $12.95/night like most Marriotts. Friendly staff. Would I stay here again? Probably, but mostly for the convenience. The Hilton nearby looks newer - worth trying the next time around.", "Date": "May 21, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "2", "Sleep Quality": "3", "Rooms": "3", "Location": "2"}, "AuthorLocation": "seattle", "Title": "“Average hotel”", "Author": "aneckc", "ReviewID": "UR61851789", "Content": "I stayed here one night for a conference and was pleasantly surprised to have my room available for check in at 0700 when I arrived. The elevators were far off from the check in desk. No covered parking. The bed was comfortable and the the flat screen TV had many HD channels. The bathroom was tiny and the water saving faucet was pathetic. Took a long time for the hot water to warm up and inadequate spray. The toilet fixture sounded very cheap as well. Worst of all was the small soap more reminiscent of a Motel 6 than a Marriott Hotel. I'd rate this hotel no better than a 3* Better hotels like the Hilton and Doubletree nearby.", "Date": "April 18, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Seattle, Washington", "Title": "“Pleasant surprise”", "Author": "sulumat", "ReviewID": "UR57304280", "Content": "Room was very clean, quiet and bed was comfortable. Bedding was very nice and the bathroom had plenty of towels. The shower worked with great water pressure and consistent hot water with an easy to operate temp. adjustment. Big TV screen, comfy chair, good AC control and a window that opened. The staff was very helpful and friendly. I am very impressed with this 3 star hotel having stayed at the other 3 1/2 star hotels in the area. This hotel is much nicer than the others. One other thing that is very important to me-the reading light was bright enough to read quite a rarity.", "Date": "February 28, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "TN", "Title": "“Marriott Sea-Tac Hotel - Part of Package Deal - But Perfect”", "Author": "gr8times4me", "ReviewID": "UR55324216", "Content": "We stayed one night at the Seattle Marriott Sea-Tac Hotel as part of a cruise package deal. After a long day of flying from Tennessee, we checked into our room with no problem. went downstairs to the lobby and had a delicious dinner at the Atrium Lounge & Bar. Then we went back to our room to rest a little and immediately fell into a deep sleep. When we awoke in the morning, I had to find out what company made the pillows. After removing the pillowcase and zippered covering, I discovered it was the Pacific Coast Co. When we got home from our trip, I contacted the company and ordered two pillows. Then we got packed and went down to the Aqua Terra restaurant and had their \"Good Start\" breakfast buffet. You got coffee or tea, juice, fresh fruit, danish & pastries, eggs done anyway you requested, sausage, bacon, hash browned potatoes and pancakes. Everything was fresh & hot and our waiter would refill our coffee and juice. The cost was $13.95 plus TX and gratuity. We were really glad we did the buffet, because our trip from the hotel to the airport to catch our bus ride from Seattle to Vancouver was long (approximately 4 hours from hotel to the cruise ship) with no stops to eat. Hotel had lovely decor, a pool (which we didn't have time to use) large, quiet, comfortable rooms and a computer room. If we ever get back to Seattle, we would definitely stay here, because it was perfect!", "Date": "February 6, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "east texas", "Title": "“Fantastic Hotel”", "Author": "kmooring", "ReviewID": "UR52265095", "Content": "We spent 2 nights at this hotel, as we arrived at Sea-Tac, and again when we were departing at Sea-Tac, and we can only be positive about our whole experience. The staff was wonderful, the accomodations were great, and if you can get an atrium view, you will think you are in Florida. We had a great room service breakfast both times. The airport shuttle was convenient and dependable. We would like to take the bed home with us!", "Date": "December 31, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "2", "Overall": "3.0", "Value": "2", "Location": "5", "Rooms": "2"}, "AuthorLocation": "California", "Title": "“Would stay at the hilton or doubletree next time!”", "Author": "CaliforniaJosh", "ReviewID": "UR51856717", "Content": "This hotel is average at best. No big deal at all. I really wish that i had stayed at the Doubletree or Hilton instead. I saw them both and they looked much better. Room is very, Very small and extremely stuffy. Service is good. It was not noisy. Pool is nice. Food is not good. Shuttle is fine. Room was not very clean. I don't think it is up to typical Marriott standards. Wish i didn't see the lobby's of the hilton and doubletree.", "Date": "December 25, 2009"}, {"Ratings": {"Service": "1", "Cleanliness": "5", "Overall": "3.0", "Value": "2", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Temecula,Ca", "Title": "“BEAUTIFUL COMFY HOTEL, SERVICE LEFT ALOT TO BE DESIRED”", "Author": "AmberNicole625", "ReviewID": "UR51414271", "Content": "My BF, his brother and I were traveling to Anchorage, AK for Thanksgiving Holiday. We had a long layover (8.5) hours overnight so instead of roughing it in the airport made reservations for this hotel to just get some food and sleep. This hotel was also convenient because they had a comped shuttle to and from the airport. This hotel is absolutely stunning!! Looks like a ski lodge but its in the middle of downtown seattle!! Beautiful indoor pool and atrium and guest beds were so so comfy. Rooms were clean as could be. Only wished we could have stayed longer. ON THE OTHER HAND.... when we checked in we asked about the comlimentary lounge for Platinum Marriott Rewards members and were told it was closed \"for the holiday\"....4 days before the \"holiday\" Kind of strange right? So then when we got to the room we were all trying to decide if we just wanted to order room service or go down to the restaurant. Boys decided restaurant would be good. Called the front desk to ask what time the restaurant closed, they said 10 pm. Well being that it was 8:40pm we made our way down to the restaurant only to find out that it was closed \"for the holiday\" ...again 4 days before the holiday. After explaining that we had just called and they told us it was open until 10 they recommend that we sit in the bar (with a 14 yr old). Bar told us go to the restaurant because 14 yr olds are not permitted in bar(DUH). FINALLY, they agreed to seat us and after all that BS we had a VERY good steak dinner. One of the BEST I had had in a while. All in all beautiful hotel, great food, crappy staff. Seemed like laziness if you ask me... closing for the holiday 4 days before the date. Disappointing", "Date": "December 17, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Buffalo, NY", "Title": "“Very good airport hotel”", "Author": "Nittany&Fargo", "ReviewID": "UR50870868", "Content": "I stayed at the Sea-Tac Marriott for one evening on a business trip. It is located directly across the street from the airport, so it is a great location if you arrive on a late flight, or have to leave on an early flight. I arrived on a late flight. I slept in a bit the next morning, and never heard any plane noise, so the hotel is well sound proofed. The parking is restricted, but there is plenty available and it is free if you self-park. The lobby is unique and rustic, with plenty of overstuffed couches and fireplaces. My check-in went smoothly and I had a room on the 9th floor. (Note - another reviewer said there were only five floors; this is true in parts of the hotel, but there is an annex with 9 floors that is separate from the main courtyard area.) I ordered room service for dinner (the crab sandwich and a salad). The food was delivered promptly and was quite tasty. The room itself was small, as many airport hotels are since space is usually at a premium. The bathroom was particularly tiny. However, the bed was quite comfortable, and there was plenty of work space. There are also robes in the closet. The workout room was spectacular - one of the nicest anywhere. There were numerous ellipticals, treadmills, and bikes, all with personal TVs and headphones provided. There were also several weight machines. Fresh fruit was provided along with a refrigerator that offered cool towels. There were plenty of sanitizing wipes, cups, water, everything for an enjoyable workout. The pool area is quite lovely and peaceful. There are plenty of tables and chairs scattered around. Of course, I had to take photos of the huge totem pole. Very cute! The small gift shop has prepared items for a quick breakfast. I grabbed a fruit cup and a bagel and cream cheese and it was quite reasonable and fresh. Upon checkout, I was easily able to arrange to keep my car at the hotel for a few hours past checkout while my colleague drove us to a meeting. The front desk was very accommodating. By the way, I saw no bugs or black widow spiders. In fact, I thought the hotel and my room were spotlessly clean.", "Date": "December 8, 2009"}, {"Ratings": {"Cleanliness": "1", "Overall": "1.0"}, "AuthorLocation": "NYC", "Title": "“Black Widow Spider Bite - DO NOT STAY”", "Author": "Guest33", "ReviewID": "UR50708701", "Content": "I received a serious, poisonous spider bite, most likely from a black widow, as it had neurotoxic effects. When I wrote the hotel about it, they denied it could have happened there. Yet, I was sleeping on a roll-away bed in the room that may have been stored somewhere where the spider could have hidden. Also, the housekeeping staff left the window open every day, and there are no screens on the window. The hotel did not take my complaint seriously at all. DO NOT STAY HERE.", "Date": "December 5, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "5.0", "Value": "3", "Location": "4", "Rooms": "4"}, "AuthorLocation": "Seattle", "Title": "“Great place for a convention or group meetings”", "Author": "SeattleFlash", "ReviewID": "UR47875106", "Content": "We found the hotel staff great! They went out of their way to make the convention work. It's not easy to make 150 men and women happy with convention meals, rooms and various events. The food was wonderful and we come to the restaurant of lunch often. Chef is really good. The parking rates are a little hard for day visitors/seniors but that's the only complaint. They were fabulous and we would highly recommend the hotel.", "Date": "October 27, 2009"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "Knoxville, Tennessee", "Title": "“Seattle”", "Author": "MarkG45", "ReviewID": "UR47038344", "Content": "It is best to stay out by Sea-Tac airport...less than 10 minutes from downtown Seattle.", "Date": "October 16, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "2", "Location": "4", "Rooms": "2"}, "AuthorLocation": "Mexico", "Title": "“Only an average Hotelwith poor shuttle service”", "Author": "HEPF", "ReviewID": "UR44207613", "Content": "I was really disappointed, especially after so many great reviews on this Hotel. Let me highlight the downsides: It’s not the closest hotel to the airport. I had to be at the airport at 3 am, but they run the shuttle service only from 4 am to 12 am, so I had to order a cab to get there! Something not expected by an airport hotel. And the problem is that I found out about this just when I was expecting to leave the hotel, so I had to wait close to 15 minutes for the cab to come. There is only one elevator servicing the 3 floors, and there are no stairs close by, so if the elevator is stuck on a floor, you just have to go up/down through the emergency stairs. The room was simply average, being the bathroom a bit old fashioned and not well maintained. For the price they charge, there are simply better and cheaper options around.", "Date": "September 24, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Location": "3", "Rooms": "3"}, "AuthorLocation": "New Jersey", "Title": "“Decent Hotel for Business”", "Author": "lookingglass101", "ReviewID": "UR39590969", "Content": "This was a decent hotel for business. It was clean and quite. Not a good location for fun (next to airport) but good for traveling. They will pick you up at the airport if you call. They also have self park (free in and out with key) and valet. Bar was decent (common business travelers). Does have a nice pool, small fitness center and a business center with free printing. Nothing to0 special but a good deal for business travelors.", "Date": "September 2, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Washington DC", "Title": "“Marriott wins the \"bed wars\", best hotel night's sleep..”", "Author": "rowingman", "ReviewID": "UR38676452", "Content": "I have stayed here multiple times when pressed for time with a late arrival or early flight out, and everytime I am reminded how good the Marriott bed can be. The Marriott bed beats the Westin heavenly bed hands down. This is a good night's sleep. I appreciate this property for its recent renovation, the comfort and quiet of its rooms, the 24 hr fitness center, and the ability to get up at 6 and swim laps in the albeit irregularly shaped pool. The airport shuttle service is very frequent, courteous, and works well (I dump my rental car back at the airport the night before an early flight, stay here, and end up saving money). My only complaint is particular to the hotel industry, not this property; the more you pay, the more you pay. Why can't internet access be free in \"full service\" hotels when it comes free at lesser cost, select service properties (Courtyard for instance). This property made me a Marriott fan, largely for its room comfort.", "Date": "August 24, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Location": "4", "Rooms": "3"}, "AuthorLocation": "connecticut", "Title": "“The reviews are right, it is a little tired ...”", "Author": "calvino", "ReviewID": "UR37389758", "Content": "I had no bad experiences, and both the bed (very comfy!) and the staff (very nice!) were excellent. Good airport bus service, too. Strangely small room, but I don't really care about that. I booked the hotel based on the pictures I saw on the website and on expedia -- kind of cool looking indoor atrium, like a good Hyatt. The pictures do not lie, but on the other hand a closer resolution reveals that all the common areas in the hotel are pretty tired. The restaurant was definitely not worth a visit, although I'll put in a plug for the Eggs Benedict at the buffet (!). Not the handmade omelets, which are basically scrambled eggs with stuff in them. If you want a good meal, get one the other side of security at the airport (Vino Volo or Anthony's), or else walk a block to the Hilton and go to Spenser's. At the time I booked I could have got either the Hilton or the Doubletree for the same amount. Judging what I've read on the site, I should have gone for the Doubletree.", "Date": "August 11, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Rocklin, California", "Title": "“Great place”", "Author": "ALERTDIVER", "ReviewID": "UR37305772", "Content": "We came through Seattle on our way to Maui and stayed at the Fairfield Inn. It was is always clean, close to the airport, and it was free as we had cashed in reward points. The rooms were comfortable and nicely appointed with a small refrigerator, microwave oven, and other small items. The breakfast spread that they serve every morning in the dining room can't be beat. It comes with your nightly stay and was very good. We were given 4 bottled waters and we checked out. All I ask is a clean, safe, comfortable place to rest my head, and the Fairfield Inn always comes through", "Date": "August 10, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "accountant_guy", "Title": "“Not a bad full service Marriott”", "Author": "accountant_guy", "ReviewID": "UR36846566", "Content": "I have never stayed at a full service Marriott that hasn't charged for Internet, and maybe only a few suburban ones in the midwest that didn't charge for parking. I have been a Marriott rewards platinum, gold, or silver member for many years depending on how much I traveled for business in a particular year. To complain about this, is like to complain about McDonald's charging for fries and a coke with a burger. If you don't like it, stay in a non-business class hotel. The reason they charge is because these are all reimbursable expenses for most business travelers. The reason Fairfield doesn't charge is because they are an economy hotel geared more toward thrifty travelers. So I have no complaints about the charges for extras because I expected it. I got this room on a Thursday and Friday for 129 which was a good value in my opinion. This is especially true considering I went to the flight museum and to Alki beach one of those days. The location is great if you are not touring the downtown area. The room was totally clean and updated. The outside of the building looks a bit old, but the entire interior has been redone in the past few years. it is actually quite hip. My only complaint is that I swiped a card at check-in and changed payment method upon check out. My initial card got charged, however this was only a minor convenience. This was certainly not the best full service I have ever stayed in, but it was nice.", "Date": "August 5, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "2", "Location": "4", "Rooms": "3"}, "AuthorLocation": "Marietta, Georgia", "Title": "“Recommended”", "Author": "terryjgardner", "ReviewID": "UR36141867", "Content": "The Marriott at SEATAC is a perfectly acceptable, completely average Marriott property. Good, expensive restaurants, accurate, pleasant staff, accommodations acceptable without being outstanding in any way. Marriott offers internet connections at an outrageous price - similar to its competition. All hotels should get with the program of complimentary internet connections.", "Date": "July 29, 2009"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "Salt Lake City", "Title": "“Way more than expected”", "Author": "Thunderfist", "ReviewID": "UR34678234", "Content": "We stopped in here because the downtown Marriott's where already full for the weekend. But we were pleasantly surprised. Super comfortable beds, and indoor swimming pool that's amazing. Great food at the restaurants--although pricey. I loved this hotel and would absolutely stay here again. More more than expected for an airport hotel.", "Date": "July 13, 2009"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Tallahassee, Florida", "Title": "“Only there for one night, but a great airport hotel”", "Author": "jbfgator", "ReviewID": "UR32396584", "Content": "We stayed here on our way home from Alaska so that we could easily get to the airport the next morning. It's less than 5 minutes away from Sea-Tac and transportation to and from is quick and easy. We were also surprised to find that you can catch an express shuttle from the hotel to downtown, which makes it very convenient to do some quick site-seeing. Upon returning from seeing a few sites, the lobby, restaurant, and pool were bustling with activity! The pool is very large and in a beautiful atrium area. The bar and restaurant also looked nice, although we didn't eat there. We did, however, get room service and the menu was pretty extensive. Not to mention the food was good and the service was quick. The rooms are very comfortable, particularly the beds. We didn't encounter any problems at all.", "Date": "June 15, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Springville, Alabama", "Title": "“Very Nice Hotel”", "Author": "craigboggan", "ReviewID": "UR32100698", "Content": "We stayed at this hotel the day before our cruise and a day after our cruise was over. The hotel does offer a shuttle to and from the airport but it's not the fastest. If you are in a hurry I suggest grabbing a taxi. Overall the hotel was super nice and super clean. The staff was extremely friendly and very helpful. The rooms were very large and they have extremely comfortable beds. The restaurant in the hotel has good food as well. Do note if you want to use their wireless in your room be ready to pay a usage fee. Are you kidding me, a usage fee?", "Date": "June 11, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "2.0", "Value": "3", "Location": "3", "Rooms": "3"}, "AuthorLocation": "nowhere", "Title": "“Avoid this hotel. It has serious security issues.”", "Author": "abbygirl2", "ReviewID": "UR29056228", "Content": "My car was broken into and vandalized while I was at this hotel for two nights and one day. In fact, other conference attendees had their car broken into and one car was stolen. All cars targeted had Oregon plates. The hotel staff did not seem overly concerned and said this had been going on for awhile.", "Date": "April 29, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "3.0", "Value": "1", "Location": "5", "Rooms": "2"}, "AuthorLocation": "Orange, California", "Title": "“A MIXED REVIEW”", "Author": "Letsagogo", "ReviewID": "UR28910824", "Content": "Attended a convention at this hotel so we were somewhat a captive audience. PROS: the catering staff were fantastic! Thank you Keith Anderson! And thanks go to Anna for my Dr. Peppers! CONS: pool noise was awful (the staff did not honor the curfew hours of the pool), internet fee ($15 per day is outrageous and to make it worse the fee doesn't apply in the convention area) and the valet/self-parking fee ($26.00 to $22.00 per day) is a rip-off. One of the convention attendees had their car stolen and another attendee had their car broken into with items stolen. Why do hotel guests get charged such high parking fees only to have safety issues?? Shame on the Marriott!!!", "Date": "April 28, 2009"}, {"Ratings": {"Service": "1", "Cleanliness": "5", "Overall": "2.0", "Value": "1", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Portland", "Title": "“Dangerous parking lot. Cars are vandalized / stolen from secure lot”", "Author": "PortlandReviewer", "ReviewID": "UR28900361", "Content": "Our friend's Honda was stolen out of the \"secure\" $18. per day lot. My Buick had the front window broken out and my sister's Volvo was ransacked. It was a rotten experience. The only positive thing was the security guards helped sweep glass out of the car and had duct tape and plastic bags available for taping up broken windows. The valets were always available to show drivers stuck at the exit gate how to operate the confusing parking ticket machine that seemingly only function was to assure that the $18 fee was collected prior to exiting the lot.", "Date": "April 27, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "4.0", "Value": "3", "Location": "4", "Rooms": "4"}, "AuthorLocation": "justdoinmypart", "Title": "“Great Pool!”", "Author": "justdoinmypart", "ReviewID": "UR28505393", "Content": "I stay at this hotel once a year for a dance convention for my daughter. The indoor atrium style pool is awesome and the kids look so forward to it every year. In the area where you get rain 9 months out of the year, you have an indoor pool with an outdoor feel. We love staying there. The restaurant is pricey but pretty good. Customer service is average. The facililty has been recently updated though and the beds are very comfy and the rooms very clean. You have airport noise of course but it doesn't bother us much. We do love it here.", "Date": "April 21, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Business service (e.g., internet access)": "2", "Check in / front desk": "3", "Overall": "3.0", "Value": "3", "Rooms": "3"}, "AuthorLocation": "Chicago, Illinois", "Title": "“Just An Average stay”", "Author": "cafcolonel", "ReviewID": "UR22708294", "Content": "This was just an average stay, with nothing standing out. If the weather is good, I would recommend eating at the 13 Coins Restaurant which is a short walk from the Marriott, versus eating at the hotel restaurant. There is also a 7 Eleven about a block away if one needs other things. This is a typical Marriott, where they charge you for everything, including the Internet. What bothered me most was when I had to leave at 4:30am, and was waiting for my ride in the lobby, there was no staff around, and anyone could have walked into the place. It's not a bad place, but nothing stands out as being above average either.", "Date": "December 13, 2008"}, {"Ratings": {"Service": "1", "Cleanliness": "2", "Business service (e.g., internet access)": "1", "Overall": "2.0", "Value": "1", "Rooms": "3", "Location": "2"}, "AuthorLocation": "Kelowna, bc", "Title": "“go elsewhere”", "Author": "jimKelowna_bc", "ReviewID": "UR22363977", "Content": "The place is hugely overpriced and mis-managed. Better places to stay are the Hilton or Radisson, both of which are in the same airport area. I arrived and had to walk down endless corridors before finding out my key did not work. Finally got another room, other people's hairs in the bathtub. Gross, small, old-school and pricey. Yuk!", "Date": "December 2, 2008"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Check in / front desk": "1", "Overall": "2.0", "Value": "1", "Rooms": "3", "Location": "2"}, "AuthorLocation": "San Francisco", "Title": "“I Won't Go Back”", "Author": "SanFranciscoJack", "ReviewID": "UR21974452", "Content": "I stayed at the hotel 11/14/08 for 2 nights. I booked the package through Marriotts web site. The package incuded a deluxe room, free parking and a gas card. When we checked in we were told our room was not ready but they could give a handicapped room. I asked to look at the room. It was on the first floor facing the street and parking lot. I went back and said we would wait for our room. We came back 2 hours later and they gave me keys to room 199 which was 3 rooms away from the room we originally looked at, again facing the street and parking lot. I went back to the front desk and said I booked a deluxe room which was supposed to overlook the pool and be on a higher floor. I was told deluxe and standard rooms are the same. I was getting nowhere with the front desk. I went back to my 1st floor room and called the phone number on my marriott rewards card and explained the problem to them. I was told they would have a manager call me in my room. After no call I went to the managers office and talked to one of the managers and she said to me you want a deluxe room for the price you paid? I said yes that is what the package offers and I did not create the package I just bought Marriotts package. She then told me the package did not offer a deluxe room but a standard room. I told her that supposedly they are the same from what the front desk tells me. I told her that I had called the hotel directly before i booked and asked about the rooms and was told a deluxe room was a higher floor facing the pool. I then showed her my reservation confirmation which said deluxe room on it. The manager said well nobody else has complained. I told the manager that I could have stayed at the Hilton or Doubletree down the street cheaper and I will check out unless I get the room I paid for. Finally she says well your right I will get another room. I did get another room still on the first floor but facing the pool. The hotel was not very busy and we should have gotten the room we paid for which we never did. Bait and Switch at its best. I will stay at the Hilton or Doubletree down the street on my future visits to Seattle area. The room was okay very dark, small bathroom. The bed very comfortable. Old T.V. no flat screens.", "Date": "November 18, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Business service (e.g., internet access)": "2", "Check in / front desk": "4", "Overall": "3.0", "Value": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Santa Barbara, CA", "Title": "“Good weekend stay”", "Author": "HuskyFan59", "ReviewID": "UR21014950", "Content": "My wife and I stay here quite regularly when we visit Seattle to see a football game. The shuttle from the airport is always on time and operates almost 24 hours a day. The rooms are typical Marriott and always clean and functional. The restaurant is good with some very good items and others quite normal. If there is a large convention in the hotel (which occurs quite regularly on weekends) be careful where your room is(stay away from pool side). The hotel is old but has been remodeled very recently but the noise in the hallways and especially around the pool can be very annoying. Standard complaint is the charge for internet usage.", "Date": "October 19, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Business service (e.g., internet access)": "4", "Check in / front desk": "4", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "", "Title": "“Great Place!!!!”", "Author": "hatlad", "ReviewID": "UR20352173", "Content": "We did a seminar here and the place was great. Beautiful indoor atrium with swimming pool, hot tub etc. Guest rooms very clean, quiet and comfortable. Beds were heavenly. Setup and support for our seminar was superb. Only negative I can think of is that their breakfast buffet was ridiculously overpriced, but otherwise the bar and restaurant was excellent.", "Date": "September 24, 2008"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Jefferson, Iowa", "Title": "“No Free Internet? Wow, that irritates me!”", "Author": "EvanBu", "ReviewID": "UR19550032", "Content": "This hotel is amazing. I love the rooms, I love the fitness center, and I really love the pool area. It is a huge pool with two hot tubs that are actually, hot. I know this sounds odd but the hotel smells amazing. The staff was helpful and there are some restaurants in the area. One gripe, and it's a big one. The Internet. Will you please explain to me why the more expensive hotel chains charge for wireless but motels like Comfort Inn, and La Quinta, give complimentary internet? It is the number one complaint that I have against the whole Marriott chain. Although I do realize that some of the Marriott brands (Fairfield, Courtyard) offer the complimentary internet, I just believe that for $150 a night you should receive free internet! Overall, a very nice Marriott, with exceptionally clean rooms!", "Date": "August 30, 2008"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Moscow, ID", "Title": "“good business hotel”", "Author": "roam-ID", "ReviewID": "UR19131402", "Content": "stayed here one night on business. I selected this hotel simply because the workshop that I was attending was held there. Seemed expensive, at ~$250/night, so I'd shop around if I were returning to the area. The hotel is about one mile from the airport, so very convenient in that regard. A complimentary shuttle runs every 15 minutes, and this is also a plus. My room (and based on what I saw, the other standard rooms) was not very big, but was well-appointed: luxurious king bed, chest of drawers, armchair with footstool, desk with work chair, Starbucks in-room coffee. The bathroom and amenities were nice. The room was clean and reasonably quiet. I did not bring my laptop, so can't comment on the internet connection, however, there is a business center with 2 computer stations where travelers can check email, etc, no charge. There is also a kiosk especially for doing airline web check-in so you can print your boarding pass, a nice touch. The hotel has an atrium, where the pool and jacuzzis are located. It is quite nice, with trees. The fitness room was better than I encounter at most hotels. They had a selection of cardio equipment: bikes, treadmills, elliptical trainers, plus some weight machines and free weights. There is a somewhat pricey cafe in the hotel. I had breakfast and lunch there. The food and service were good. There does not seem to be any other place to eat within walking distance. The staff were nice and courteous. Overall, I would recommend this hotel to a business traveler.", "Date": "August 19, 2008"}, {"Ratings": {"Service": "1", "Cleanliness": "4", "Business service (e.g., internet access)": "2", "Check in / front desk": "3", "Overall": "2.0", "Value": "2", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Petersburg, Michigan", "Title": "“Parking is a shakedown”", "Author": "pnedry", "ReviewID": "UR18376223", "Content": "I had stayed at this property many times over the years but not recently. The public areas are still impressive, but the parking has never been great; it has turned to awful. There was no place to park to register and the bellmen were rude in requesting that we move our vehicle. The card readers for actuating the gate to the parking area for which there is a hefty charge did not work. When returning to the desk to find out why, the bellman told me that the card readers hadn't worked for some time and that I needed to push the green button. Yet, there are no instructions that indicate such. The directions on exit were inaccurate (the West Exit Booth was not open and it was difficult to backup and exit). The parking charge was eventually comp'd, but not without considerable effort. The room rate came with a $25 Chevron Gas Card. No card was presented. The service at this property has definetly slipped. There are lots of other hotel choices in the airport area. The rate was $174and overpriced for the services. The checkout time of 1:00 p.m. is nice and the breakfast buffet remains excellent.", "Date": "July 29, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Business service (e.g., internet access)": "3", "Check in / front desk": "4", "Overall": "4.0", "Value": "4", "Rooms": "5"}, "AuthorLocation": "Oregon", "Title": "“Nice and Comfortable”", "Author": "Great-Big-Head", "ReviewID": "UR16733375", "Content": "The rooms here were very comfortable. The bed was awesome; attractively made-up and super comfy. I do agree that the halls/elevator set-up is a little tricky, but asides from that small detail, I had a pleasant stay. I ate one meal in the main restaurant as well and it was quite good. It took a little while to get our food, but we were the first customers after they opened for lunch, so they probably had to turn on the stoves and stuff.", "Date": "June 6, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "4", "Check in / front desk": "5", "Overall": "4.0", "Value": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "California", "Title": "“Great Airport Hotel”", "Author": "grove911", "ReviewID": "UR15010465", "Content": "I stayed here the night before an early flight from Sea-Tac. It was only 5 minutes from the airport and the shuttle service was prompt and left from the front entrance every 15 minutes. The lobby was decorated in a mountain lodge style with 3 individual desks for check-in. Unlike others I did not have to wait in a line to check-in and the front desk staff were very pleasant and helpful. I had a king bed room that included breakfast (even room service breakfast). I had a room near the elevator and would suggest requesting one if you don't want to \"hike\" to your room like others. I will definitely stay here again.", "Date": "April 13, 2008"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "Chicago", "Title": "“Great short stay!”", "Author": "chicagoheel93", "ReviewID": "UR14585879", "Content": "Arrived in the middle of the night after hours of delay at airports. Staff was very welcoming, refunded us the $ we had to pay for a cab from airport since shuttle was not available at those hours. Was also given a discounted rate since we would be departing in a few hours. The rooms were very nice, wonderful beds, nice bathrooms. Service and food choices in the hotel restaurant were excellent. Didn't get a chance to use the pool, but it looked fantastic. Shuttle driver back to airport in the morning was friendly, helpful and efficient. We were recharged and ready to continue our trip after a horrible start!", "Date": "March 27, 2008"}, {"Ratings": {"Cleanliness": "4", "Check in / front desk": "3", "Overall": "3.0", "Value": "3", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Orlando, FL", "Title": "“Nice Marriot”", "Author": "BaByDream7", "ReviewID": "UR10858460", "Content": "I stayed here on my last day in Seattle since it was closer to the aiport for my 5am flight. Even though it was a bit hidden toward the back I was very suprised at how nicely done the entrance was. I walked it and you are greeted with a lodge type setting with nice comfy looking couches welcoming you in. Instead of a check in desk there were 3 small stations that you can check into the hotel. It was nicely done and made me feel very homely. The way to the room was a bit awkward since the floor was U shaped you had to walk all the way around to reach your room. I utilized the pool and it was a nice pool with Adult hours if you don't like sharing with kids and with two jacuzzi's available. The room was clean but the one i stayed in was a special for disabled people. So I was a little put off that the disabled shower chair was still in the bathroom that was a little weathered with yellow color tone to it. I wish they would have taken it out to fit the clientele that will be staying in it. But it was nice that the hotel accomodates for this. Check out was easy and the rooms was pretty nice. I loved the comfy beds, pillows, and the airport shuttle! Since I needed a ride to the airport the shuttle was most convenient! You can view their webpage to check out the entrance to the hotel.", "Date": "November 16, 2007"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Check in / front desk": "5", "Overall": "3.0", "Value": "3", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Oklahoma", "Title": "“Small but adequate rooms”", "Author": "GB4469", "ReviewID": "UR10072265", "Content": "If you have an early morning flight to catch, this is a good choice as it is right at the airport. It has been recently renovated so the rooms are new and clean. The room service was fast and efficient and the food was good. The negatives were that our room was very small and the bathroom was the smallest I've encountered in many years. Hardly room to turn around and I'm a small person. However, the countertops were granite, which was nice. Also there is only one elevator, which seemed odd for a hotel of this size. You may self park or valet park, both for a fee. Would not recommend for an extended stay, but it is fine for a one visit.", "Date": "October 12, 2007"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Business service (e.g., internet access)": "3", "Check in / front desk": "5", "Overall": "4.0", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Princeton, New Jersey", "Title": "“Better than average, some noisy rooms”", "Author": "cruisermeg", "ReviewID": "UR8591274", "Content": "I have stayed at this hotel a few times inthe last several months. The first stay was not the best, but the subsequent ones got better, and they have obviously taken some of the notes on the comment cards seriously. The hotel is located near SeaTac with a frequent shuttle. There is a tower, 8-9 floors high, and an atrium area that is about 3-4 floors high. Note, the tower rooms really have no view although some are advertised as having Mt. Rainier views. (Maybe before the trees grew!) Regardless of where you are, in the tower youwill be looking at the roof/ventilation or the roof/associate entrance. Avoid rooms ending in X16 and X18 as these are a bit noisy when the trucks show up. Odd numbered tower rooms will be a little noisy from the AC but frankly it wasn't as bad! The bathrooms are small, and double double rooms are a little crowded. King rooms seem bigger and have a chair and ottoman. All have been redone very recently but don't have the big flat screen TVs. The desk is pretty roomy and there is a cabinet and 2 small drawers...not the greatest storage. Rooms in the atrium area are noisier for some reason. Aside from the noise from the pool (and functions if there are any being held near the pool), it seems that the walls are thinner....last time, I actually thought someone left a cellphone in my room it was ringing so loudly. Food in the hotel is good-could be better. It is a bit pricy. The restaurant is due to be redone 1st quarter 2008. Desserts however, were tasty, and since I had some issues with my meals, they were free! Try the chocolate cake, it is VERY good! The lobby/bar are nice but the music is a lot too loud! One of the songs played has some sort of random spoken sounds...very disconcerting! Internet is part of the $9.95 wired for business package so if you don;t make calls, it's too expensive. I don't know when Marriott will get it through their brains...STOP CHARGING FOR INTERNET! There is a business center with 2 computers and an ethernet cable that you can use for free. Also, you can get free use of internet in the concierge lounge. There are only a couple other dining choices in walking distance (Dennys and 13 coins-which I think is also too expensive.) Other than that, and restaurants in other hotels, you need a car or a cab. Self parking is $16 per day, valet is $22-very high, but it's the norm for cities! Be careful in the shower...tubs can get slippery (I fell). I was able to get a rubber mat, but I also informed the GM and several other people of the situation, and that housekeeping needs to rinse carefully. The hotel is very clean. I even noticed a housekeeper vacuuming the rock wall outside of the restaurant. The staff was friendly, remembering me by name, and by my luggage-which seems to go someplace else when I come to Seattle! Seems that this is also a popular hotel with cruisers as there were a large number of folks heading off to Alaska on Vision of the Seas...maybe this is a Royal Caribbean pre-cruise hotel. Some people hate the pacific northwest design of the hotel-the lobby looks like a lodge. Frankly, I think it is appropriate for the area. There are plenty of places inthe area, but all in all this hotel is nice for flyers or anyone needing to be out inthe SeaTac area. It's about 30-45 minutes to downtown and you can hop on a bus at the airport (I also think there is a stop at the end of the hill) or drive. Also, tours can be arranged-many of which will pick up at airport area hotels. Give it a try!", "Date": "August 31, 2007"}, {"Ratings": {"Cleanliness": "4", "Business service (e.g., internet access)": "4", "Check in / front desk": "3", "Overall": "2.0", "Value": "2", "Rooms": "3", "Location": "2"}, "AuthorLocation": "Connecticut", "Title": "“Ordinary”", "Author": "Pullman1", "ReviewID": "UR8183616", "Content": "Although it is highly rated in these reviews, and you pay a premium price compared with other airport hotels, there is nothing special about this hotel other than its proximity to SEATAC. If you are thinking of staying here, pay attention to the Trip Advisor comments about the hideous views of HVAC equipment from the windows on one whole side of the hotel. Although my room was on the top floor of the building, the view looked like an industrial site, just because of all the equipment on the roof of a lower wing of the building. The room itself was spacious, the bed was comfortable, and the bathroom was functional. But during a rainstorm in the middle of the night, the ceiling leaked. The club lounge, for which I had paid extra, was about as modest as any I've ever seen. But it did have good food at breakfast. The best part of the hotel in my experience was its restaurant. The room itself was extremely ordinary, looking like a roadside restaurant on a freeway, but the food and the service were first-rate. Bottom line: I slept well here. But even though I collect Marriott points, I don't think I'd return to this hotel.", "Date": "July 18, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Seattle, Wa", "Title": "“Awesome for early AM flight”", "Author": "DougDilvo", "ReviewID": "UR8113297", "Content": "Wow! what a suprise. We stayed at the this property for one night (July 3) with my wife and two children (4 and 18 months). Check in was faster than I have ever experienced and had a newly renovated room on the 7th floor overlooking the airport (the parking garage actually). Room was larger than I expected (two double beds) and had plenty of room for the porta crib. The bellmen were very helpful with bags and even set the crib up for us. My Son and I went swimming and a had a great time. The beds were super comfortable and we slept well (very quiet). The hotel was not busy (very slow) but I don't think that would change if it was busy. Check out was very efficient. The shuttle comes every 15 minutes, and is less than five minutes from the airport. We will definatly stay here again if we have an early AM flight. Great job on this property Marriott. I'm a big fan.", "Date": "July 13, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "3"}, "AuthorLocation": "Bellingham Washington", "Title": "“Great Staff”", "Author": "travelgirl50007", "ReviewID": "UR7849732", "Content": "We stayed overnight the last week of May, flying out in the morning. We had no problem leaving our car except, when we checked in they asked for our AAA card. Evidently the rate we got for park, sleep and fly was for AAA members only. This was not an option or even mentioned on their web reservation form. The front desk quickly recognized this as their error and we were off to our super comfy room. We had a great dinner in the restaurant. Super efficient drop off on departure day and much quicker pick up then some other hotels we have used in the past. One tiny little thing on our way back was the guy who picked us up stopped to pick up his take out dinner before he dropped us back at the hotel. That was kind of weird!! Overall the experience was good and the hotel was great.", "Date": "June 14, 2007"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Mclean VA", "Title": "“fine choice for seatac”", "Author": "myjourney", "ReviewID": "UR7845432", "Content": "The lobby is attractive but a bit small and noisy. The room itself seemed newly redecorated/remodeled. It was not too big but had a very comfortable king bed with lovely duvet and many pillows. The bathroom was luxury level with granite countertops, attractive large framed mirror. There is a free computer off the lobby for printing boarding passes. The Hilton is a block away so you can easily walk over for their restaurant. It is a large steak house type place but there are other choices as well. As noted here, the parking is a ripoff. We dropped off our rental car early to avoid the overnight charge.", "Date": "June 13, 2007"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "4.0", "Value": "5", "Rooms": "2", "Location": "5"}, "AuthorLocation": "So Fla", "Title": "“Great value,”", "Author": "TravelingRaider", "ReviewID": "UR7722422", "Content": "looking for a nice hotel. not expensive, nice service, great looking lodge, but old / outdated rooms. this is the place for you. Try the breakfast. Great place to stay if you are coming in the night before and going to an alaska cruise out of seattle. Take the car service to the terminal. Great service and well priced.", "Date": "May 30, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "3", "Check in / front desk": "5", "Overall": "4.0", "Value": "3", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Overland Park, KS", "Title": "“Very nice but expensive parking”", "Author": "dazzystar5", "ReviewID": "UR7704907", "Content": "This hotel is very nicely renovated with a modern bar and beautiful indoor pool in the treed atrium. The staff was very friendly and helpful. The rooms are immaculately clean and the beds are extremely comfortable due to the nice linens and down pillows. My only concern was the expensive parking. It will run you $16 per day which I expect in L.A., but not Seattle. Other than that we had a wonderful stay and good food in the restaurant.", "Date": "May 27, 2007"}, {"Ratings": {"Cleanliness": "5", "Business service (e.g., internet access)": "2", "Check in / front desk": "4", "Overall": "2.0", "Value": "2", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Phoenix, Arizona", "Title": "“Nickel and Dimed to death.”", "Author": "Sonoran_Skies", "ReviewID": "UR7405033", "Content": "The hotel is nice and conveniently located if you're flying out of SeaTac. It's also incredibly expensive for a $200 bed for the night. Parking will run you $16 to find your own place in an otherwise unsecured lot....$52 if you want the valet to do it for you. If you're just staying at the hotel/airport area, make good use of the airport shuttle. Internet connection? You'll pay by the day. Want light? forget it. You'll be dim watt bulbed to the point where you're wondering if they stock flashlights. Water pressure? None. And I was on the 1st floor. Shower was warm, but not hot. I'm all for environmental consideration, but don't make me stumble in the dark or take a cold shower! Shaving your legs in either environment becomes a bloody mess. Literally. The bed was actually incredibly comfortable. Good thing, because the walls and windows are not insulated against airport noise, so ask for an inside room.", "Date": "April 20, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "4", "Rooms": "4", "Location": "3"}, "AuthorLocation": "DC", "Title": "“Extraordinaily Positive Staff”", "Author": "WillyLoman", "ReviewID": "UR7156273", "Content": "I stayed March 4th and wasn't expecting a lot from this airport hotel. As someone that works for a firm that has gone through the Ritz Carlton seminar, I'm sure this Marriott (which owns Ritz) had its employees go through this process. The room was fine, great pool, decent gym, frequent shuttle to the airport...all that was great. The free Internet with printer is a nice touch as well. Every single employee was amazingly friendly and solicitious - even when I was kind of lost someone would always go out of their way to offer help. There is a lot of construction going on which should be completed soon but it didn't negatively affect me. Good job, Marriott.", "Date": "March 13, 2007"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Seattle, Washington", "Title": "“Birthday party fun!!”", "Author": "powell'sparty", "ReviewID": "UR6908113", "Content": "We stayed here overnite, one night for my daughter's 16th birthday. Myself ,my daughter and two other friends of hers....We loved the room, two queen beds, one hide a bed(it was surpisingly comfortable!!) And the pool area, so beautiful and relaxing...while the girls swam I rested on one of the chaise lounges....We were swimming at night and they had the atrium area and pool all lit up with lights...So fabulous! They were in a state of remodel in lobby area and some of walkways and corridors to room halls but was not noisy or inconvenient in any way...We live in local area but treat ourselves to this hotel every once in awhile, we are always very pleased with service and amenities....Stay here...you won't be dissapointed!", "Date": "March 3, 2007"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "Oregon", "Title": "“Excellent stay!”", "Author": "Oregon07b", "ReviewID": "UR6605481", "Content": "We stayed at the hotel for one night and had an excellent stay. They put us in a room on the concierge floor for being a Marriott Rewards Silver member. All of our requests (room with a view of Mt. Rainer, toothpaste, rollaway) were accommodated. The renovated room looked great with comfortable beds and new bedding. We loved the look and feel of the swimming pool/hot tub area (as if we were outdoors in the tropics), and enjoyed the warm water. The food at lunch was very delicious. The hotel is 20 minutes away from downtown Seattle. Note that the lobby is currently being renovated and we needed to walk through a tent to get inside the building and that registration was in the business center.", "Date": "January 16, 2007"}, {"Ratings": {"Overall": "1.0", "Value": "3"}, "AuthorLocation": "WA", "Title": "“Sleep, Park and Fly”", "Author": "lesliewwu", "ReviewID": "UR6162130", "Content": "We parked our SUV within 50ft. of the front lobby under two bright lights. We were told it was secure parking. We left the 11th for our first trip to Cabo San Lucas to arrive back home on the 18th to find our SUV broken into with many items stolen, inside damage and things strewn everywhere. We waited for a very long time for the police to arrive to make our report. I have not heard from the corporate office as told as of yet. I made a phone call today and left a message to see how they would like to proceed. I will update once I know if they will stand behind their respected name.", "Date": "November 21, 2006"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "4", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Chillicothe, Ohio", "Title": "“Comfortable but not spacious”", "Author": "alancookie", "ReviewID": "UR6130778", "Content": "After staying two nights in the Redmond area for a conference, my wife and I booked this hotel for the last night before our flight home. The hotel lobby had a large fireplace and comforable couches. My wife commented that the pool area (which you pass on an elevated walkway as you make your way to the elevators) looked like something you'd see at Disney with lots of indoor trees/plants. Our room was clean, quiet and nice...but the bathroom felt a bit small. The breakfast buffet was well stocked with all sorts of hot and cold items and also had two cooks on hand for made to order eggs (including a Salmon Scramble which was delicious). We stayed on the top floor (Conceige level, received an upgrade with Marriott points) so the room had an elevated ceiling and I was very impressed with the quality of the decor.", "Date": "November 14, 2006"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "4", "Check in / front desk": "5", "Overall": "4.0", "Value": "4", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Huntington Beach, CA", "Title": "“Rooms Are Beautiful After Recent Renovation”", "Author": "LakersFan", "ReviewID": "UR5711130", "Content": "August 2006 - This was my first visit to the Marriott Seattle Sea-Tac Airport hotel since it was renovated earlier this year. The rooms were comfortable before the renovation, but looked somewhat dated. The renovation made them even more comfortable and gave the rooms a contemporary look. Check in was “Marriott fast” taking about a minute. The hotel was almost fully booked when I made my reservation and I was not guaranteed the non-smoking king that I prefer. However, when I checked in I received the non smoking king and my preference for a high floor was accommodated. My room was #565 on the top floor of the main building. It was an accessible room facing south. The photos show the room better than I can describe, but my impression walking into my room was “this is really nice.” The Revive bed not only looks great but is super comfortable. The new desk was very functional. The separate box and wires for broadband internet connection are gone with the electronics hidden elsewhere. The cat 5 cable plugs directly into a panel on the desk which also has a bunch of electrical outlets. The new office chair was GREAT, being both functional and very comfortable. The arm chair and ottoman were new and comfortable. Lighting in the room was excellent. Each of the lamps was bright and all had electrical outlets in the base to accommodate cell phone chargers, etc. The bathroom is also completely new, floor to ceiling. The countertop is granite and the sink was large and deep. The showerhead was about eight inches in diameter which delivered a lot of water without being too strong. Lighting in the bathroom was good. The main lights turn off by themselves and a night light comes on automatically. I think the difference in the room being accessible is that it was a little larger than a standard room and did not have a closet door. The bathroom door was large and the vanity did not have any shelves under it so that someone in a wheel chair could easily use the sink. The combination tub and shower had hand rails and there was a shower chair in the bathroom. I had access to the concierge lounge on the 8th floor. It had also been complete renovated. My first morning hot entrees were scrambled eggs and bacon. The second morning scrambled eggs and port sausage. Besides the hot items there was everything you would expect on a continental breakfast buffet. I was not able to enjoy the hors d'oeuvre ether evening, but did take advantage of the cookies and milk one evening. Parking at the hotel is $14.00 per night and internet access $9.95. The Amex rate for this stay was $189 per night which was comparable to other hotels in the area. Taxes add about 12.5% to just about everything. The hotel has a fairly complete gift shop which was handy because I did not bring any liquids in my carry-on luggage. I was able to buy a small toothpaste and deodorant and I like the new Marriott shampoo and conditioner in the room. I have stayed at the Marriott Sea-Tac Airport hotel quite a few times. I have always liked the service and atmosphere of the hotel. The renovations have made the rooms beautiful and very comfortable. The location is great and the service is excellent. I can recommend this hotel highly.", "Date": "August 26, 2006"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Business service (e.g., internet access)": "3", "Check in / front desk": "4", "Overall": "3.0", "Value": "2", "Rooms": "2", "Location": "3"}, "AuthorLocation": "", "Title": "“Hit or miss”", "Author": "rcmjr", "ReviewID": "UR5492273", "Content": "Stayed here on 2 separate occasions recently. One was great, the other was below average. Rooms have been renovated but found the one on our second stay to be noisy. Food is average hotel fare. Public areas can be dark. $14 a day parking in a lot far from the front desk was disappointing. Shuttle to/from the airport was on time and the drivers helpful. For the price, there has to be better options.", "Date": "July 20, 2006"}, {"Ratings": {"Cleanliness": "4", "Overall": "4.0", "Value": "4", "Service": "4", "Rooms": "4"}, "AuthorLocation": "Honolulu, Hawaii", "Title": "“Great Stay & Hotel has been Renovated”", "Author": "kennygH0n0lulu", "ReviewID": "UR5410705", "Content": "Stayed at the SeaTac Marriott for only an overnight stay but nevertheless, we enjoyed this hotel. We used their free shuttle from the airport to the hotel. Check in was a breeze with courteous and professional staff. The lobby was quaint with a fireplace and living room setting. The hotel's layout has a courtyard located in the middle that offers a foilage setting and there is a pretty good size pool in the middle. Our guest room was newly renovated so can't complain about anything being old and broken. The beds and bathroom were great. Took a cab to the Westfield Southcenter Mall to shop & eat. It's a huge shopping center and there is everything for a shop-aholic. Go to the Claim Jumper restaurant for some good eats at a reasonable price. Checked out from the hotel early the following morning to catch the early bird flight to Honolulu. Their shuttle service starts at 4:15 am running every 15 minutes so that was a plus. No complaints from us and would use the Sea-Tac Marriott if we ever need to stay at a hotel near the airport.", "Date": "June 29, 2006"}, {"Ratings": {"Cleanliness": "4", "Overall": "4.0", "Value": "4", "Service": "4", "Rooms": "4"}, "AuthorLocation": "Vancouver Island, BC", "Title": "“Pretty impressed”", "Author": "madge62", "ReviewID": "UR5332865", "Content": "Stayed one night here after dropping off our daughter at SeaTac. Yes, this property is a little bit older but we felt that it had been kept up very well. Our room was nicely appointed, the bedding was sooooo comfortable (loved the duvet). We had absolutely no complaints. The pool atrium area was awesome. Lots of real foliage and very bright. We enjoyed our swim in the warm water and time in the hot tub. Would definitely stay here again.", "Date": "June 12, 2006"}, {"Ratings": {"Cleanliness": "4", "Overall": "1.0", "Value": "2", "Service": "2", "Rooms": "2"}, "AuthorLocation": "Annapolis, MD", "Title": "“Stay Away”", "Author": "A TripAdvisor Member", "ReviewID": "UR4017178", "Content": "Stayed two days in October 2005 for 5 days of business in Seattle. Despite being a Platinum member of Marriott Rewards (100+ per year) I was not upgraded to the concierge level. This is my 5th time this year to this hotel and previously disappointed. I was told by Janet Burruss, Rooms Operatons Manager “Concierge rooms are available for sale to the general public, but as a Platinum member you get first priority when there are upgrades available, but we are not able to guarantee a complimentary upgrade, as sometimes a particular room type may be sold out. Reward members get second dibs on left overs. (Where's your customer loyalty over the almighty dollar?) Room was small, carpet worn out and had ripples. My room overlooked the loading dock and the room was extremely noisy. Had a shower head that had a super saver head. It took a while to get the shampoo out of my hair. The furniture was old and damaged. One of the phones did not work and the toilet ran intermittently all night. It was all reported the first night and a maintenance man did attempt to repair, but with no results. I attempted to change rooms, but was told the hotel was sold out and no other rooms were available. I left and went to the Hilton about 2 blocks away. (HILTON HIGHLY RECOMMENDED ----------) The front desk folks were young and inexperienced. They didn't care I was checking out due to problems and they made no attempt to make the situation right. The parking was OK. A little expensive at 12.00 per day when other hotels in the immediate area are free. The food in the restaurant was good and moderately priced. The bed was outstanding, but the other problems forced me out. I have put this hotel off limits for my employees and have made Hilton SeaTac our Hotel of Choice for the Seattle Airport location.", "Date": "October 12, 2005"}], "HotelInfo": {"Name": "Marriott Seattle Sea-Tac Airport", "HotelURL": "/ShowUserReviews-g60878-d100610-Reviews-Marriott_Seattle_Sea_Tac_Airport-Seattle_Washington.html", "Price": "$156 - $259*", "Address": "<address> <span rel=\"v:address\"> <span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">3201 S 176th Street</span>, <span class=\"locality\"><span property=\"v:locality\">Seattle</span>, <span property=\"v:region\">WA</span> <span property=\"v:postal-code\">98188</span></span> </span> </span> </address>", "HotelID": "2515114", "ImgURL": "http://media-cdn.tripadvisor.com/media/ProviderThumbnails/dirs/0d/d1/0dd1ae3427d1bb2f4d6415db852f3a415large.jpg"}}