{"Reviews": [{"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "4", "Sleep Quality": "4", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Chicago, Illinois, United States", "Title": "“Great, for the time we spent there!”", "Author": "Abby L", "ReviewID": "UR127566360", "Content": "In all honesty, we barely spent any time in this room. With that being said, the size of the room did not matter (while on the small side). The room was clean, and all the things you need to simply sleep in a room were provided. After our room was serviced one day, they had taken away our bath towels and replaced all the towels with hand towels. When we called to get bath towels, were were told that the laundry delivery service did not show up that day. We had to dry off using hand towels that day, but it worked, so that is a very little complaint. The next day we had normal size bath towels again. After coming from a somewhat 'luxury' hotel in London, we were bummed to see the room did not have an alarm clock or refrigerator, but it had a safe, it was warm, the bed was comfortable, it was clean, and we had hot water. Great place to stay if you are taking trains in or out of the city as it is close to Gare de l'Est and Gare de Nord.", "Date": "April 9, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Hove", "Title": "“Good value hotel in a convenient location”", "Author": "sjhHove", "ReviewID": "UR127196884", "Content": "We booked this excellent three star hotel hotel as part of a Eurostar package and I'd highly recommend it. It's10 minutes walk from Eurostar at the Gare du Nord and a stone's throw from the smartened up Gare de l'Est and the metro. The staff are extremely friendly and helpful, and, if you need it, speak excellent English. Breakfast is 10 euros and looked good but there are plenty of cafes and brasseries nearby both by the station and along the Canal St Martin. Our room, on the top floor, was small but well equipped with a very comfy bed and a lovely view over the park and the canal. The bathroom was clean, with good products, soft towels, a powerful shower and plenty of hot water. My very minor niggle was the lack of an extractor fan in the bathroom which got very steamy. but the hotel has recently been taken over by the excellent Tim hotel chain and I'm sure things like this will be fixed.", "Date": "April 3, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Mesa, Arizona", "Title": "“Gare de l'Est (formerly Villa Saint Martin)”", "Author": "Rhonda M", "ReviewID": "UR126601457", "Content": "This little hotel was an absolute gem! It was extremely clean, with a remodeled bathroom and a big screen tv. The breakfast was generous, and the staff were not only friendly, but genuinely kind! You can't fake that folks! The train station (subway and bus as well) is a block away, making it a very nice location. Great deal for the price! Enjoy! Elenora R. and Rhonda M. Mesa, AZ.", "Date": "March 24, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Mackay", "Title": "“Lovely Hotel in great location!”", "Author": "RhondaMackay", "ReviewID": "UR126571293", "Content": "Was really nervous in bo oking this motel as only viewed it on the Internet. Shouldn't have worried. Lovely clean & quiet motel in a fantastic location. The staff were very friendly and helpful. The rooms were tastefully decorated and although small fully equipped. The only possible problem I could find was if you are a large person it would be difficult to fit In the shower as it is very tiny. The breakfast was quite adequate & enjoyable. I would definitely stay here again on our return to Paris.", "Date": "March 24, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "3", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Newcastle upon Tyne, United Kingdom", "Title": "“Good Hotel in good location”", "Author": "Hayley G", "ReviewID": "UR126090866", "Content": "This hotel was very good value for money, although the rooms were a bit small (and the bed). The staff were very helpful and friendly and the location was very good, 2 minute walk to the nearest metro station, also the Paris open bus tour has a stop right next the hotel too. There are plenty of shops, bars and cafes within easy walking distance of the hotel. The breakfast was ok, as it was a bit chaotic and they ran out of english breakfast tea on our last morning!", "Date": "March 14, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Location": "5", "Rooms": "3"}, "AuthorLocation": "", "Title": "“Very happy with accommodation.”", "Author": "Gilzy", "ReviewID": "UR126014972", "Content": "Rooms were on the small side, but overall I had a very pleasant stay. The hotel was very close to the train station and the bus was easily located!!:)", "Date": "March 12, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "London, United Kingdom", "Title": "“Great hotel - friendly welcome and brilliantly located”", "Author": "Lhommedesmarais", "ReviewID": "UR125924423", "Content": "I spent 4 nights here and was very pleased with my stay. I booked with Eurostar and paid just under £350 (around 420€/US$550) room only, including return Eurostar from London which I thought was very reasonable. Staff on reception (24h/24) were very helpful and friendly, and although I managed to get by in French it appeared that most also spoke reasonable English. My room (a double, 3rd floor, accessed by a small lift) was perhaps a little small for a couple, but for me as a solo traveller, it was fine, and it was really just somewhere to sleep; the lack of view didn't bother me for the same reason. Cleanliness was perfectly adequate, although there were a few traces of mildew in the shower in the otherwise spotless bathroom. Daily visits by the friendly maid kept the room tidy throughout my stay. The room also featured free wifi, cable TV, hairdryer, safe and plenty of wardrobe space. Breakfast, served from 6h30 to 10h00, was a generous self-service buffet of coffee/tea/fruit/cold meats/cheese/cereal/juice/petit pain and a selection of pastries (croissant/pain au chocolat etc.). Not haute cuisine, but very reasonably priced at 10€. But if that doesn't appeal, there are plenty of bars/cafes nearby. The hotel is superbly located, being 10 minutes' walk from Gare du Nord (ideal for those arriving by Eurostar) and 2 minutes from Gare de l'Est, so even though it's a little way out of the city centre (Xe arrondissement), there are excellent transport links to all the main sights by bus/metro/RER virtually on the doorstep. And even though this is a busy area of Paris, the hotel is down a little side street - Rue des Récollets - so I didn't notice any noise. Opposite is a local park (Jardin Villemin), while at the far end of Rue des Récollets is the Canal Saint-Martin (and the bridge on which Amelie stood in the film!) so there are peaceful spots nearby to relax. I would give Villa Saint-Martin 4.5/5, only deducting half a mark for the mildew in the shower and the slightly small size of the room - but these didn't detract from my stay at all and I only mention these in order to be objective. I would recommend to others and would certainly stay again.", "Date": "March 11, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Muscatine, Iowa, United States", "Title": "“Fantastic bargain”", "Author": "Walter C", "ReviewID": "UR125811298", "Content": "My wife and I booked a 6 night stay at this hotel through a package deal with Gate 1 Travel, including air to and from Chicago. The entire cost per person was only $940! The hotel was quite comfortable, with a very helpful staff, generous and tasty breakfast, and good in room internet and TV. The location (right next to the Gare de L'Est) was perfect, so in combination with a Paris Museum Pass and Paris Visite transit pass, we got a wonderful vacation at a bargain price.", "Date": "March 8, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "3.0", "Value": "3", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "dublin", "Title": "“decent hotel for paris”", "Author": "brendan75", "ReviewID": "UR125306931", "Content": "Room was ok for paris,breakfast was typical european,5 min walk from metro,free wifi.reception staff very good", "Date": "February 27, 2012"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Ventura, Calif", "Title": "“Our Latest Stay @ Villa St. Martin”", "Author": "foodsniffer", "ReviewID": "UR125161882", "Content": "This was our third year in a row to stay at this hotel. The pros: Great location in the 10th district between the canal and Gare de l'est and within waling distance of Gare de Nord. Great front desk staff- very helpful and all speak English. Large rooms by European standards with our request for the room we had the year before accommodated. Acceptable breakfast but questionable as to if it is worth the price. Great restaurants nearby, (Papilles, Chez Marie Louise, and Les Enfants Perdus, (down the street)). The Cons: Establishment, which was family owned, has been sold to a chain, (TimHotel), and personal attention seems to be lacking- i.e. we had several problems in our room which were not addressed in a timely manner, but were eventually resolved. If you have a room facing the street, (whcih we requested), there is a certain amount of street noise. You can hear people in adjoining rooms if they are conversing loudly. We do enjoy the Villa St. Martin, are dissapointed it has been sold to a chain, but will return.", "Date": "February 24, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "3", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Vancouver, Canada", "Title": "“Affordable quality hotel in Paris”", "Author": "bjmchale", "ReviewID": "UR125134400", "Content": "Stayed at Villa St. Martin for 1 week in Paris. Paris was freezing but fantastic. The hotel was fantastic. Near the Gare de L'est train (get the all day pass if you plan on touring Paris), and near to several eating places. It is close enough to walk but you will have to go a short way to get to the main attractions like Eiffel, Louvre. The best part of the Hotel was the breakfast. Very good selection (cheese, meet, croissant, cereal, yogurt, etc) and the automatic expresso machine was delectable. The reception staff were friendly and personable. The rooms were small but comfortable and clean. One night we didn't know how to turn the heat on and we froze, but figured it out the nights thereafter. Also, the en suite safe was locked so we couldn't access it. It's a top quality 3 star and I would stay there again.", "Date": "February 24, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "2", "Sleep Quality": "4", "Rooms": "2", "Location": "4"}, "AuthorLocation": "Athens, Greece", "Title": "“Just an average hotel”", "Author": "Xainis", "ReviewID": "UR124959618", "Content": "I have booked this hotel based on the reviews I found here, that created a lot of expectations. Unfortunately they have not been fulfilled. The hotel location is one of its greatest advantages. Almost next to Gard De' lest and very near to Gard Du Nord, can be used as a base for visiting Paris Center and many closeby cities (by train). The area is full of small restaurants, with decent food. Many options available, from local French bistrots, to tex-mex and even Japanese food. My comments/observations for the hotel itself: + Reception girls were very polite and friendly + Free high speed wi-fi available and satelite tv (Free as well) + Location - Very expensive for the quality and services offered (paid around 160 euros per night) - One of the worst breakfasts buffets I ever had.. Very limited options and mainly ready made. Even the juice was not fresh and the cofee from an automatic machine - Small rooms and quite noisy because of the thin walls.. - The shower floor was dirty and that was a suprise since the rest of the room was very clean In general I would not visit it again and I would not suggest it, unless you find a very good offer", "Date": "February 21, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Sleep Quality": "4", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Lancashire", "Title": "“An ok base for exploring Paris”", "Author": "twoplustwoLancashire", "ReviewID": "UR124531069", "Content": "As per an earlier review - this is now TImotel (from 1st Jan). The hotel was ok - but wouldn't want to spend much more than a couple of days there. The rooms are very small and dark, although very clean. The beds are quite small, but the bedding immaculate. Shower leaked badly, so floor was flooded every time we took a shower. Breakfast was really a lottery. If you got there early before the rush, it was very nice with fresh bread, hams and cheeses and on occasions boiled eggs. There was also fresh fruit, yoghurt and pastries. However, the dining room is VERY small given the number of bedrooms, so if you don't get there early enough there are neither seats, food or crockery left! It would appear they are severely understaffed in the breakfast room. No one clearing tables or replenishing the food area. The one big positive is that the ladies on reception were always very pleasant and very helpful. The area is lovely - although it looks a little run down at first, its really a very safe area. Step out of the hotel and turn right, and there are several bars and restaurants on each side of the street. A particular mention to L'Atmosphere at the bottom of the street on the left hand side. Good little bar for a drink. Chez Marie Louise is a restaurant about 10 mins walk away and the food and service here are top class - however, would recommend booking as it was full on a Thursday night and people were being turned away. Les Enfants Perdu is another restaurant on Rue Recollets (turn right outside the hotel and walk a couple of hundred yards and the restaurant is on the left) which served excellent food but again would be advantageous to book. You can walk from Gard Du Nord (10 - 15 min walk with luggage) or from Gard D'Est (3 minute walk with luggage)", "Date": "February 13, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Camden Town, null, United Kingdom", "Title": "“Fantastique!”", "Author": "BenW87", "ReviewID": "UR124359162", "Content": "Just returned home from Paris, and a stay at Villa Saint Martin... Absolutely brilliant hotel; great distance from gare du nord and gare de l'est (10 mins maximum!) clean throughout, beautiful rooms and generally modern and pleasant whilst still in keeping with typical Parisian style. Good continental selection for breakfast in the mornings, certainly worth getting out of bed for! The staff were made this for us; friendly and pleasant (even first thing in the morning whilst finishing a night shift!) would definitely be happy to go back to villa saint Martin over and over, based on the attitude and manner of the staff. Good work; to all at villa saunt martin - keep it up - highly recommended! :-)", "Date": "February 9, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Southampton, United Kingdom", "Title": "“The friendliest hotel in Paris”", "Author": "sandra1271", "ReviewID": "UR124205586", "Content": "This is my second stay at the Villa Saint Martin (now a Timhotel, I believe). It is a small hotel close to Gare de l'Est and only a few minutes walk from Gare du Nord. The rooms are well-equiped, clean and quiet. The main advantage is the friendliness of the reception staff - they always greet you with a smile and go out of their way to help. For such good value, the service is beyond what one would expect. I highly recommend.", "Date": "February 6, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Westport, Ireland", "Title": "“Super small hotel - very convenient for international train travel out of Paris”", "Author": "JMHGlobetrotter", "ReviewID": "UR124185105", "Content": "A great find - only a few minutes walk from Gare du Nord / Gare Est so great for connection further into continental Europe and UK. Very welcoming and helpful. Rooms small but very clean and comfortable. Breakfast simple but good. Excellent restaurant around 100m down the road Les Enfants Perdus was recommended by the hotel and proved to be excellent.", "Date": "February 6, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "London", "Title": "“Friendly and comfortable, convenient location and great value”", "Author": "LondonOiseau", "ReviewID": "UR124141914", "Content": "Close to the Gare de l'Est and an easy few minutes walk from Gare du Nord, even with a wheely case. Reception were very friendly and English speaking. The rooms are clean and comfortable, modest in size but larger than many places in Paris and very good value. There are some nice bistros and bars close to the hotel, particularly those on the Canal Saint-Martin, which is a great canal-side walk down to the Seine.", "Date": "February 5, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "London", "Title": "“Very good value, Close to Gare DE L'EST, Lovely staff and smallish but clean rooms”", "Author": "nickylloyd1968", "ReviewID": "UR124053724", "Content": "Firstly a little about getting to the hotel itself. If you arrive on the Eurostar and don't want to walk (About 15 mins to hotel) or take a taxi, go via metro. Line No: 4 (Direction Porte d'orleans) from Gare Du Nord to Gare De L'est (One stop) When you exit Gare de l'est turn left and walk towards the end of the road (don't go down Boulevard Strasbourg) go down Rue de Faubourg St Martin. If you cross the traffic lights you will see Rue des Recollets on the left and the hotel is on the right hand side. When we arrived at the hotel (about 11.am) our room wasn't ready but we were able to check in and leave our luggage. The hotel itself overall was brilliant. (Note for ladies there are hairdryers in the bathrooms) The staff - Mariana, Helena and Charlotte were superb and spoke good English. Nothing was too much trouble and when we wanted to go to Parc de Prince stadium they rang ahead to get details for us! Breakfast is served in the bar area until 10am - buffet style and was good. The rooms are well insulated compared to others I've stayed in and though small were perfectly functional. There are varying reviews on which floor to stay but we stayed on the 4th floor (room 445 - twin room) which was at the front of the hotel. There was a lift too.The road noise is minimal and as we were higher up it was ok. Bathroom was good and modern, though if you didn't want to flood the bathroom floor make sure you put the shower curtain inside the shower tray! There was hand cream and hair/shower gel in the bathroom too. Overall a great stay, the staff superb and I would recommend this hotel to anyone while staying in Paris!", "Date": "February 3, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "London", "Title": "“Excellent value, good clean cosy rooms, wonderful staff”", "Author": "oliviadorothy", "ReviewID": "UR123713748", "Content": "I spent two nights at this great, no frill hotels and found the staff and service nothing less than exemplary. From the outset, when I arrived before check in time, the staff went out of their way to accommodate me. I asked for a quiet room and got a lovely one at the back of the hotel immediately. When I was whammied by a migraine headache on the second day I rang down to reception and was brought a couple of painkillers along with - without asking! - some coffee and orange juice by the very kind Charlotte (who speaks perfect English!). I travel to Paris a lot in my line of work as a journalist and rarely write reviews of hotels - so this one really comes highly recommended.", "Date": "January 27, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Falkirk, Scotland", "Title": "“Great Location. Nice Staff”", "Author": "gcee29", "ReviewID": "UR123335653", "Content": "Stayed here for 4 nights 7th Jan. Super location..1min from Gare d'lest station and metro. We got off at CDG airport and just jumped straight on the Bus dropped off an hour later right at hotel for 5 euros. Cant argue with that. Train takes u to Gare Nord then you will have to get the metro. Hotel rooms are very small yes, but we were hardly in ours...only to sleep late at night after walking Paris which is beautiful at night. Metro passes are a MUST.(20 euros each for a paris visite pass for 3 days at any station also comes with discount booklet for sites etc) City is very big...first day we walked alot, following day we were doing the metro and seen MUCH more stuff. It just felt great at anytime to hop on and off anywhere u wanted like Eiffel Tower at night then off to Sacre Couer to watch over the City. Staff at hotel are extremely helpful, speak perfect english although i try my best to speak in french. Breakfast is continental but plenty of it. Hams, Cheeses, Boiled Eggs, Croissants, Breads, Jams and coffee. Top tip..coffee machine push for cafe au lait then push for expresso so u get a shot in it as quite weak on its own. We personally never bothered getting the Paris Pass or museum passes as for a few days they are not worth it as you will never ever have the time to visit everywhere. We done things included in these passes that we wanted like the Lourve, Arc de Triomphe, Notre Dame and crypt, Catacombs, Parisien river cruise and Metro passes for cheaper than the tourist passes. It all depends on how much time you have and what you want to visit. Its worth planning and researching beforehand!! Eating out can be expensive..best to go for a Plat de Jour, which is a set menu, we found a lovely French Traditional place and got salmon and herring for starters, 10oz Rump, then cheeses plus bottle of red for 53 euros. Exremely good price..we just stumbled on it, very small cozy and quaint and typical french. Japanese is big here...we got a good deal over in the Latin Quarter for Sushi and its excellent..less than 40 euros with drinks. If you wanna pay top dollar then dont worry, easy to find..we read a menu..5 Course with Bottlle of wine and glass of champagne for only 830 euros!!! YES...830 euros haha. So always check the menu prices outside before sitting down and embarrasing yourself by getting up to leave again at some monstrous price. There are hundreds of hotels in Paris scattered everywhere but this was the best 3star deal we found which incidentally had the best reviews. We liked it and had a nice view of the city and the top of Eiffel. Good as a base....and that is all u need in Paris...keep the extra dosh for sightseeing!", "Date": "January 19, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "California", "Title": "“charming hotel, definitely recommend”", "Author": "adhn", "ReviewID": "UR122489386", "Content": "Pros: Hotel is within walking distance to Gare de L'Est where we took the Metro and Gare du North where we took the train to Belgium, 1 hour away. If you turn right from the hotel, there is a beautiful Thai restaurant and several other restaurants. There is a market if you cross the bridge over the St Martin Canal where you can buy drinks and food. The Canal is on the right of the hotel. It's pretty and we walked there at night when we could not sleep. There are also some cute boutiques along the canal. If you turn left from the hotel and left again on the main street, the Istanbul cafe, a Middle eastern restaurant has good eats for very reasonable price. I recommend the curry chicken and the shawerma sandwich. After meals, you get free chai tea on the house. Abdullah who waited on us was a sweetheart and can speak some English. His family owns the restaurant. There is plenty of seating upstairs. When you look inside the restaurant, it doesn't look like there is any seating left, but the entire 2nd floor has tables and is quite nice. Hotel rooms are a bit small but you are in the city. Staff can speak English really well and very helpful. Buffet breakfast is excellent with many choices. At night, we went to the lounge area and ordered beer or wine from the front desk. Cons: my room 112, the bathroom smells bad from the floor drain, may be the plumbing did not not have a shield or was not done properly? My sister who stayed in another room did not have this problem. When you take a shower, the surrounding area gets kind of wet. I definitely recommend this hotel.", "Date": "January 3, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Adelaide, Australia", "Title": "“We weren't disapointed”", "Author": "cpal0807", "ReviewID": "UR122389389", "Content": "We chose this hotel because of its close proximity to Gare L'Est - an easy 5 min walk. Our room, although small was comfortable and very cliean. The hotel is not on a main road and therefore very quiet. Our tarrif included a continental breakfast which had an ample selection of foods to choose from. The hotel's best asset is it's reception staff who were polite and friendly and helpful. We only had two full days in Paris and the staff's suggestions meant that we could make the most of this wonderful city in a short time. Catch a No.30 bus from opposite Gare L'Est and this route will take you past Moulin Rouge, near Montmarte right around to Champs Elysee and Trocadero for only a few Euro. Well done staff.", "Date": "January 2, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "columbia, sc", "Title": "“GREAT HOTEL”", "Author": "elloie18", "ReviewID": "UR122292355", "Content": "The hotel was clean and in a great location, the staff was very helpful. The room was well heated and very comfortable.", "Date": "December 30, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Los Angeles", "Title": "“A great hotel outside the major attractions”", "Author": "travel_sweeties", "ReviewID": "UR122052997", "Content": "A great hotel. Exceeded our expectations. Everyone was helpful from the time we booked to the time we checked out. Our room was upgraded to a junior suite because it was our anniversary & my birthday. They have modern furnishings & is kept clean. Hallways are narrow & elevator is small but it wasn't a problem for us. Location is very close to train station so eventhough it was outside of the city center, everything was accessible. The Gar d'lest station is probably the nicest we've seen there. It has a shopping area inside of the station. They have good breakfast. There are restaurants around the hotel too. The one down the street serves good French cuisine though a little pricey. Thanks VSM especially to Benedicte, Agatha & the reception staff.", "Date": "December 24, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "3"}, "AuthorLocation": "New York City, New York", "Title": "“Friendly Staff, Great Value, Very Clean”", "Author": "Alan W", "ReviewID": "UR121781355", "Content": "Staff was very friendly and very helpful with directions. Room was very clean. Quiet area. Only few minutes walk from Gare de L'est Station. Some nice restaurant and cafes nearby. HSBC bank only less than 2 blocks away. Supermarket also nearby. Would definitely stay again. Highly recommended.", "Date": "December 15, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Mount Arlington, New Jersey", "Title": "“Friendly Accomodating Staff”", "Author": "onmyway007", "ReviewID": "UR121779619", "Content": "Stayed for a week and had a wonderful experience! The staff was more than helpful...offering advice as to where to eat, where to find this and that as well as providing expert directions. Any time we had a question, any time we had a special request...it was taken care of. The room was small but comfortable and clean. The breakfast was excellent. What more can I say than the entire staff at Villa Saint Martin was instrumental in making this a more than memorable trip.", "Date": "December 15, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Location": "5", "Rooms": "3"}, "AuthorLocation": "raunds", "Title": "“Comfortable”", "Author": "samandpaulRaunds", "ReviewID": "UR121769757", "Content": "Everything you need from a hotel, very compact and bijou but rooms very comfortable. Excellent location, right near gare du l'est and metro stations. Breakfast was lovely, continental style but plenty of it and enough to set you up for the day. You don't go Paris to spend time sitting in a hotel so to get your head down, have a shower and breakfast it is perfect.", "Date": "December 15, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "3", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Strasbourg", "Title": "“Good hotel, would stay there again”", "Author": "Stepballchange", "ReviewID": "UR121699970", "Content": "I only stayed one night but would consider going back. Good points: Very close to Gare du Nord and Gare de l'Est, in a road which is a bit run-down but seemed safe. Substantial breakfast, free internet, room was a good size (for Paris) and the bathroom was tiny but clean. Staff very helpful and friendly. Bad points: a bit noisy, whole place could do with being updated, the double bed in my room was 2 single mattresses stuck together with a double sheet on top. Corridors dark with a strange system of lighting - sense monitors which took some time to turn on. This being a Paris hotel the lift and corridors were extremely narrow, you might have some trouble if you have bulky and heavy luggage.", "Date": "December 13, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "4", "Rooms": "4"}, "AuthorLocation": "Edinburgh", "Title": "“Really helpful staff, clean quiet hotel”", "Author": "dsliase", "ReviewID": "UR121222481", "Content": "My partner and I stayed four nights in the Villa St Martin and were pleasantly surprised at the level of service. The reception staff in particular were always helpful and friendly, booking meal reservations for us, giving directions and changing our room when the first room we had proved warmer than we were comfortable with. The rooms at the front of the building can get very warm and opening the window cools the room but also let's in noise from the street below. We were moved to a quiet room at the rear of the building which was much larger, at no extra cost and the staff were full of apologies for our discomfort. Buffet breakfast was included in the room rates and was always to a good standard. This is worth around 10 euros a night. In Paris, if you are comparing hotel prices be sure to check the breakfast on offer. The hotel is an easy 10 minute walk from the Gare Du Nord, for those of us coming in through Charles De Gaulle airport and is two minutes' walk from the Gare de l'est. The Metro from Gare de l'est will take you to the centre of Paris in 10 - 15 minutes depending on your destination and is 1.25 euros if you buy a book of 10 tickets. There a few nice restaurants within walking distance and the area around the canal St. Martin seems to be quite hip at the moment with a lot of young locals in the cafes and bars.", "Date": "November 29, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "chalandri", "Title": "“Very good hotel to stay”", "Author": "leftgeorge", "ReviewID": "UR121120989", "Content": "Clean Hotel across Gare de L'EST metro & train station that is a convenient place to stay. Breakfast was very good providing a good variety of fresh food. Hot drinks were from a machine and that was the only thing that was average. Hotel Staff was very helpful and would", "Date": "November 28, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "London, UK", "Title": "“Ideal hotel, staff a delight!”", "Author": "magicmat", "ReviewID": "UR120903412", "Content": "I was here for a business and pleasure trip, and this hotel was IDEAL! It was lovely to be such a short distance from the train station upon arrival. I actually walked, with 2 large cases, from Gard Nord, and it wasent too much trouble (although lots of steps, I dont think Paris is very diasabled-friendly.) The hotel staff couldnt have been more pleasant and helpful, a total credit to the hotel. They were friendly, knowledgable, spoke perfect English (i felt a bit ignorant!), and helped me book an unusual itinary, where there was no commision involved for them (I went on a Segway Tour, the best thing ever!). I was upgraded to a superior room, which was light, spacious, and in very good order. The location is out of the centre, but quite, and very close to the Metro. Go for a wander, there are some lovely shops and cafe's by the canal waiting to be discovered.", "Date": "November 22, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Lexington, KY", "Title": "“Wonderful, friendly hotel !”", "Author": "Leeann327", "ReviewID": "UR120879669", "Content": "The hotel staff went above & beyond to be helpful to us. The rooms were great - a bit bigger than my previous experiences in Paris. Very clean and very quiet. Great location - near Metro & near Les Enfants Restaurant, less than a minute walk away. Would HIGHLY recommend & I hope to stay there again.", "Date": "November 21, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "romania", "Title": "“Great small hotel :))”", "Author": "Crina S", "ReviewID": "UR120586356", "Content": "Small hotel near the metro, in a typical residential neighborhood. Very close to the metro and easy to get around. Clean, small but not too small rooms even for a single room, the double superior are big for Paris. Very clean and for the first time a very good breakfast, you had multiple choices which is quite unusual for Paris. Staff was always ready to help anyway they could and they made me feel welcome. Perfect stay for Paris :)", "Date": "November 14, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Singapore, Singapore", "Title": "“A great place to stay in Paris”", "Author": "sageds", "ReviewID": "UR120277914", "Content": "Room is a bit small but reasonably priced considering it is Paris. Quiet location, off touristy spot. Staff is very helpful and friendly, speaks good english. Only 1 power socket so prepare to ask for extension cable if you have a few gadgets. Pillows are too soft, room's lights too dim but well, you would hardly stay in the room.", "Date": "November 7, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Boston, Massachusetts", "Title": "“great choice for reasonable price, outstanding service”", "Author": "reboy_11", "ReviewID": "UR120276142", "Content": "we just got home last night from 10 days in Europe. We stayed the last 4 nights here. It was more than we expected. Staff was very helpful, friendly, accomodating, and anxious to please their guests. It is a little far from the madding crowd, but that is sometimes a good thing. We walked everywhere from this hotel...to the Eiffel Tower and back with no problems. We will definitely return the next time we visit Paris.", "Date": "November 7, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Ipswich", "Title": "“Reasonably priced in a great location”", "Author": "IpswichTourist_10", "ReviewID": "UR119860964", "Content": "We stayed at Villa St. Martin for three nights and had a thoroughly enjoyable experience. Although we were concerned that the hotel was located at quite a distance from the main tourist sights, it was very near the Metro (which is cheaper and easier to use than the London Underground), and it only took us about 40 minutes to walk back from Notre Dame anyway. The breakfast was served between 6.30 and 10.00- we just about made it to the 10 am sitting every day! Breakfast consisted of breads and cheeses alongside pasteries and cereal and fruit. A very appealing affair. The room was small but bright and clean and the toiletries in the bathroom were great! The staff were really friendly and keen to please. All in all a fantastic place to stay.", "Date": "October 29, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Oakland, CA., USA", "Title": "“In a quiet, non-touristy corner of Paris”", "Author": "JaniceHolland", "ReviewID": "UR119736589", "Content": "My husband, myself and our adult son shared a Junior Suite at this hotel in September 2011. We were quite pleased with the service, friendliness, cleanliness and quiet of our upstairs, streetside room. Located in the charming Canal St. Martin area of the 10th Arrondissement of Paris, the hotel is closeby to shops, cafes, restaurants, and the lovely Canal with it's steep walking bridges. One is hard-pressed to find tourists here, with the streets filled instead with young adults and young families with small children. One can feel so like a local here. A grocery store is down the block and the Metro just 1 1/2 blocks away. The Place de la Repubblique, with its busting shopping and restaurant scene is just a 12 minute easy walk. I recommend it for all ages. It is \"doing Paris easy\" without the frenetic tourist scene. Go!!", "Date": "October 26, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Milton Keynes", "Title": "“Weekend in Paris”", "Author": "Richard D", "ReviewID": "UR119712703", "Content": "I booked a weekend in Paris for my wife's birthday and we stayed at the Villa St Martin for 2 nights. The staff we more than helpful, no question was too much trouble, directions and personal recommendations were always accurate and there was always a smiling face at the reception to greet you. Our room was cosy and met all our needs for qiuet and comfortable evenings after busy day's spent in the hustle and bustle of the city. The standards of cleanliness were high with rooms being cleaned and fresh towels added daily. Breakfast was self service , the assortment of continental fayre was enough to cover anyones palate and was fresh and tasty. It is a small hotel , but it has a lot of plus points in its favour for the weary traveller once you have navigated the somewhat run down area between the station and the Rue the hotel is located on. A fantastic find is just a few hundred yards from the hotel to the right as you exit Les Enfants Perdus Restaurant, Great Food,Great Atmosphere, Friendly Garcon and an owner who steers the ship from his office behind the well stocked bar 10/10. ( So good we ate their 2 nights.)", "Date": "October 25, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "3", "Location": "4"}, "AuthorLocation": "N.Ireland", "Title": "“Lovely staff makes Villa St Martin”", "Author": "VernonGrey", "ReviewID": "UR119506579", "Content": "We are a couple with a six month old baby, and wanted a hotel within walking distance of Gare du Nord. We decided on this hotel and it perfectly suited our needs. The staff were wonderful, assuring us on numerous occasions if there is anything they could do re: baby food and bottles, they were happy to help.In addition to being very helpful, they were genuine and friendly. Continental breakfast was lovely, and easily kept us going until late lunch. Thanks to baby, we had breakfast around 8ish and the place was usually empty, although on my way out at 9.30am, it seemed busy. The location is good and about half an hour to forty mins walk away from centre of Paris. I like walking and easily made my way around Paris, seeing the main sites without using public transport. Rooms are smallish and fairly average. But all in all we had an above average stay, due to location, price and especially the staff.", "Date": "October 20, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Philadelphia, Pennsylvania", "Title": "“Great hotel”", "Author": "Angela T", "ReviewID": "UR119492161", "Content": "Just stayed here from October 13-16 for my first time in Paris. So cute and quaint! The staff is very friendly and are English speaking, which is always a plus (my French is quite rusty). The hotel is about a 2 minute walk to Gare De L'est, which is where the metro was located. It was a very safe neighborhood, we had no problems at all walking around late at night. The breakfast buffet was great and I thought the coffee machine was awesome. You can get hot chocolate, cafe au lait cappucino or regular coffee from it. All in all, a very nice stay in Paris. Highly recommended.", "Date": "October 19, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Newcastle upon Tyne, United Kingdom", "Title": "“Forget your faceless hotel chain, a friendly hotel”", "Author": "diarmaid f", "ReviewID": "UR119160954", "Content": "I booked as a surprise wedding anniversary trip for my wife. We were coming on eurostar so wanted something close to the train station. It's 10 min walk from garde de nord, 2 min if you metro it to Garde de Este. It's just off the main boulavarde, over the road from a nursery and sits in an up and coming young professionals area- chic kids clothes shops, restaurants, bars, canal etc. I'd phoned ahead for flowers and champange and the staff couldn't have been more helpful and upgraded us to a large comfortable room. the first night they booked us in an excellent restaurant next door- in our opinion probably one of the best in paris, Les Enfants Perdus. an excellent breakfast. Overall a wonderful place to stay for a different 'less touristy' experience of paris with convenient access to everywhere by metro or by running shoes (as I was marathon training on our visit!) we had an excellent experience staying in Villa Saint Martin and wouldn't hesitate to return there again or recommend to friends and family", "Date": "October 10, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "4.0", "Value": "3", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Telford, United Kingdom", "Title": "“Nice and friendly, good location”", "Author": "mattley23", "ReviewID": "UR118940005", "Content": "I recently returned from a 3 day break with my wife in Paris, France and stayed at the Villa Saint Martin hotel. The hotel is located an easy 5mins walk from the Gare De Este metro station and about a 15 min walk from Gade De Nord station. We were welcomed by a friendly French hotel worker who explained about the hotel, our room and location in good detail and was very fluent in English. Our room was small but we expected this due to us being in Paris, afterall it was just a place to lay our head at the end of the day so we were happy. 1 small point I would make, me and my wife are both about 5ft9 and our feet dangled off the end of the bed so anyone 6ft or bigger may struggle with the bed size of the standard rooms. Having said that the bed was comfy and the aircon worked well as we visited during a 30degree October heatwave!! The location of the hotel is in a busy area with shops, cafes and bars but we felt very safe even when walking home at 12:30am after getting off at the wrong metro station. There is a night club by the hotel but we didnt hear a peep from other guests let alone the club during our time there and this was through a Friday and Saturday night! The hotel is just a 20 m in bus ride from the Troccadero and Eiffal Tower and extremely close to all other major tourist destinations like Sacre Coeur, Arc de triomphe and Notre Dame etc. We had breakfast (additional charge) which consisted of cerials, pastrys, meat, cheese, fruit and eggs which was perfect for us and kept us filled up all morning. Check out was swift and easy and we even delt with an English employee who was great. All the staff were a pleasure to deal with and made our visit that much better. Overall we had a very good experience staying in Villa Saint Martin and wouldnt hesitate to return there again or recommend to friends and family should they ever visit Paris.", "Date": "October 4, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Melbourne, Australia", "Title": "“Great place to stay”", "Author": "Ken W", "ReviewID": "UR118870090", "Content": "Villa Saint martin has got to be the best 3 star hotel we have ever stayed in.Room really much bigger than we expected with a large comfortable bed.The bathroom was quite large and really modern and clean.The breakfast was better than we expected and the coffee quite good.All of the staff (and I mean all the staff) were really helpfull and went out of their way to assist with anything we asked.Nothing was too much trouble and always with a smile.Very close to Gare de l'Est.Would have no hesitation staying again and will recommend to anyone who asks.Ken and Barb Williams - Australia", "Date": "October 3, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "San Juan, Puerto Rico", "Title": "“Exceeded my expectations!!”", "Author": "Jorge-Yaira", "ReviewID": "UR118605666", "Content": "I had been in Paris before and I was certain that the rooms for a three star hotel were going to be small, so that was not a surprise, yet it felt comfy and the bathroom had a modern look. The shower's \"curtain\" is a glass door which will not cover much and it is inevitable to get the floor wet. My wife says that for the ladies reading this, they have complimentary Yves Rocher beauty products instead of the cheap normal soap and shampoo. Hot running water was available, the bed was comfortable and an occasional siren or children's laughter in the morning was heard (There is a school in front.) The only minus was that the TV's were wired a bit strange and the volume was too low. (But, I wasn't in Paris to watch TV...) The service was excellent!! There's an employee at the front desk 24 hours, (I've been in hotels where the employee leaves during the evening and comes back in the morning!) There's complimentary continental breakfast which makes things easier to go sightseeing early. Great location by the train station!!! If you're there in the evenings during the weekend, say hi to Mariana for us... ;-P", "Date": "September 26, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "3", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Singapore, Singapore", "Title": "“Decent and well maintained”", "Author": "Astello39", "ReviewID": "UR118590709", "Content": "This hotel is located along a quiet lane nearby the Gare de l'est station - pretty convenient although the nearest convenience store is about a 5-7 mins walk. The room is small but very clean, well kept and comfortable. Service staff are friendly and helpful. They provide laptops for use in the breakfast room with wireless internet connection at no charge - a nice touch. For a Paris hotel at this price and location, it is a value for money choice. I will stay here again. :)", "Date": "September 26, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Portland, Oregon", "Title": "“Amazing staff!”", "Author": "M_Granada", "ReviewID": "UR118588614", "Content": "Great deal! Rooms were European-style (so take heed Americans, rooms are on the small side if you have space issues this is not for you). Very close to Gare de L'est so very handy in getting around Paris! My experience was wonderful because of the staff!", "Date": "September 25, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Edwardsville, IL", "Title": "“Enjoyable stay in Paris”", "Author": "StephTodd", "ReviewID": "UR118495080", "Content": "We picked the Villa Saint Martin based on both Trip Advisor reviews as well as reviews on the European Destinations website (we booked a Paris/Rome trip through them). Everything was as expected--good location near the Metro, clean, good-sized rooms, very nice staff, a bar to hang out in before calling it a night, good breakfast, etc. One of the staff recommended a nearby restaurant, Les Enfants Perdu. It was one of our favorite meals of the entire trip. Great recommendation. We would stay here again.", "Date": "September 23, 2011"}, {"Ratings": {"Location": "5", "Overall": "4.0", "Value": "4", "Service": "4", "Rooms": "4"}, "AuthorLocation": "Bamberg, Germany", "Title": "“Good hotel near Gare de l'Est”", "Author": "reluctantflyer007", "ReviewID": "UR118047093", "Content": "Just a two minute walk from the Gare de l'Est and less than 10 minutes from the Gare du Nord, this hotel is ideally situated yet quiet. I slept with the window open and only the occasional sound of a siren got through to my room - otherwise very peaceful. The bed was very comfortable (not so common in France) and, although the room was very small, it was clean and comfortable. The staff were helpful and friendly (also not necessarily the norm in France) and the breakfast was good - not just the usual croissant and coffee but a proper continental breakfast with cold meats, cheeses and boiled eggs. All in all - to be recommended. (I have given only 2 points for the restaurant since I only had breakfast there and do not even know if they serve other meals).", "Date": "September 13, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "4.0", "Value": "4", "Service": "4"}, "AuthorLocation": "CALCUTTA, INDIA", "Title": "“Good Hotel near Gare de la East”", "Author": "SUBIRGHOSH", "ReviewID": "UR117839388", "Content": "Very good location just opposite to the East station. Rooms are clean and modern. Bathroom is also very nice. The Hotel was short of adequate number of ac plug adapters (which they should not) but the front desk Ladies were very help-full and somehow manage to charge my camera. The front desk is occupied 24 hours. The staffs are all very friendly. The cold breakfast is also nice with lot of choices.", "Date": "September 8, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "3", "Overall": "4.0", "Value": "4", "Service": "5"}, "AuthorLocation": "Cleveland, Ohio", "Title": "“Great service, clean but small room, iffy location.”", "Author": "Ron R", "ReviewID": "UR117758204", "Content": "The location of the hotel is in what seems to me to be a questionable neiborhood. I was not overly confident during any evening/night venture. It was very close to the train and metro stations however. The hotel itself had a wonderfully polite and helpful staff, and a pleasant breakfast. They even allowed me use of the hotel computer to check on a tour I had scheduled. The rooms are small by American standards and the bathroom was quite cramped. There is a section of rooms that have no elevator. Overall it was a fine choice for the price.", "Date": "September 6, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Iran", "Title": "“Value for the money”", "Author": "Saman1980", "ReviewID": "UR117596280", "Content": "We were there in late July , The hotel is absolutely the meaning of the Value For The Money, The location is fantastic , not too far from Paris attractions , there are 2 main metro stations around the hotel , one of them just about 2 minute walk! There is nothing special of course about the rooms and breakfast because it is a 3 star hotel , there is no refrigerator in the rooms, the ails are too narrow that two people can hardly pass each other, a bath can not be smaller than this but everything is very clean and tidy. the last and one of the most important positive point for the hotel is the staff specially the girls at the reception! they are very kind, smiley and helpful , thank you all . I hope I see Paris for the third time next year and of course I will stay in Villa Saint Martin.", "Date": "September 2, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "3.0", "Value": "4", "Service": "4"}, "AuthorLocation": "Jersey City, N.J.", "Title": "“Convenient Location”", "Author": "Butchik", "ReviewID": "UR117375793", "Content": "-The room we had was small but clean and comfortable for two people with 2 check in size luggage. In the bathroom, we had to put a towel on the floor as the shower sliding doors had a small gap that let some water out. -We had some issue with the TV/remote but the staff was able to fix it as soon as we came back from our sightseeing in the city. -The bed was comfortable though we wish that they could have 4 pillows for staying couples. The air conditioner works fine. -For ice, you have to ask the receptionist and she will get some for you in the bar. -The ladies from the front desk were nice and helpful. Always smiling and greeting us during the day. We enjoyed the breakfast selections that they offered. They had 3 choices of meat slices, pastries, orange juice, cereal, boiled eggs etc. They also have a coffee machine for 3-4 different kinds of coffee -The location is convenient as the line 4 metro is about a 2-5 minute walk. If you are taking the RER B from the airport, it took us 10-15 minutes walk from the Gare du Nord train station. We also walked to Sacre Coeur from the hotel. We felt safe walking back to the hotel at around 11 pm. -Overall, we were satisfied with our stay and would come back due to the convenient location. I do not know how big the superior rooms are so expect small quarters (we had a double room) If you want a spectacular area of Paris you might want to look at other neighborhoods but as a home base for your city travels, this hotel will do just fine.", "Date": "August 28, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "4.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Cardiff, United Kingdom", "Title": "“so friendly polite clean comfortable rooms in a secure location”", "Author": "LadyRaquelle", "ReviewID": "UR117167824", "Content": "WOW..from the moment we arrived we were impressed bags taken from us and secured in a locked room. Our rooms were small and toilet door didn't fit the frame however this is the norm in paris all rooms are small,the bed was so comfortable we had extra pillows and there was no noise at night time i have to say i loved the air conditioning .The breakfast was lovely fresh fruit meats cheese coffee machine and plenty of pastry's bread rolls and even english tea. Lovely canal opp with lots of bars with happy hours 5-8 and lovely tai restuarant a few steps away. I recommend this hotel as its so close to the stations metros and this hotel is so friendly and will go that extra mile to help.", "Date": "August 24, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Gambrills, Maryland", "Title": "“Wonderful staff, clean room, good location”", "Author": "StacyScottyAlan", "ReviewID": "UR117104940", "Content": "We stayed here for 9 days during our vacation in Paris, France August 2011. The hotel is very close to Gare Du L'Est train station which has Metro and ReR trains. The people who work there are incredibly nice and go out of their way to be helpful. We felt that they had a personal interest in helping us have a good time while we were in Paris. The room we stayed in was called a Jr. Suite, and was small by US standards, but accomodated my husband, myself and our 16 year old son. It was clean when we arrived and the housekeeper kept the bathroom clean and our beds made. The beds were comfortable. We were very glad we stayed with them.", "Date": "August 22, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "5", "Overall": "4.0", "Value": "4", "Service": "5"}, "AuthorLocation": "Boston, New York", "Title": "“Delightful”", "Author": "Rachel H", "ReviewID": "UR117008604", "Content": "We were extremely pleased with this hotel, for multiple reasons: lovely staff who were helpful at all hours, storage of our luggage before checkin and after checkout to accomodate us at no cost, very comfortable beds, quiet nights, fine breakfasts (great cappacino machine), ideal location near Gard L'Est so touring was very easy, etc. Of our 3 European hotels on this trip (also Berlin and Rome), this was #1. Also, excellent restaurant down the street.", "Date": "August 20, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "5", "Overall": "4.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Carmel, Indiana", "Title": "“Served us very well”", "Author": "Thomas E", "ReviewID": "UR116962767", "Content": "Excellent location, close to train station. Quiet canal neighborhood and park. Front door secured at night. Clean and comfortable. Friendly and informed helpful staff that was always available. Even packed food for our return plane trip without a request from us! Nice breakfast area also available as meeting place throughout the day. Full self serve breakfast with later bar service. Newspaper available daily. Family owned and operated by same family for over 10 years. Tiny rooms, and even smaller bath and shower. If stairs are a problem for you, ask for a lift side room.", "Date": "August 19, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "scotland", "Title": "“Fantastic hotel, excellent staff!”", "Author": "smokie84", "ReviewID": "UR116462731", "Content": "we stayed here in july for 4 nights. prior to the stay my husband emailed hotel to say would be my birthday whilst we were there,. upon arrival we were upgraded rooms, had a lovely view of the Gare d L'est station. STAFF WERE AMAZING, so helpful and friendly. we have travelled extensively and must say they were the best we have ever had. i forgot a travel plug so they gave us one to borrow, we needed help to reprint our boarding passes and again they did this for us with no bother, and we took back a pizza one night and were offered plates, cutlery etc so we could eat it comfortably in our room., our television wouldnt work and the reception came up straight away and fixed it. hotel is situated in lovely quiet street, very close to open top bus tour stop and very close to metro station. there are mcdonalds etc close by and french restaurants too. bedrooms werent huge but adequate for our stay, i would agree that a kettle etc would have been ideal in the room. everything was very clean in the hotel, and breakfast was the usual continental style, but had plenty to choose from.would definately recommend this hotel and would definately stay here if we went back to paris. a fantastic find, booked through hotels4u, got a great price too!!!", "Date": "August 9, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Miami, Florida", "Title": "“I really love this place..very convenient ..!!!”", "Author": "bonvoyage67", "ReviewID": "UR116396352", "Content": "The rooms are not so big, but the quality of the bed is second to none, I do have a tempurpedic mattress and the difference was minimum, the street was pretty much not noisy at all, excellent breakfast too..!! and the ice on the cake is excellent service and gare do nord ...the train and metro stations are only 2 blocks away..... very important in Paris...!!!", "Date": "August 7, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Location": "5", "Rooms": "4"}, "AuthorLocation": "", "Title": "“The staff are absolute stars.”", "Author": "jordanacjordan", "ReviewID": "UR116246488", "Content": "We just love this hotel,especially the staff. Only minus no tea making facilities this time. Will stay again (with a travel kettle)", "Date": "August 4, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Sao Paulo, SP", "Title": "“We loved it and we intend being back as soon as possible!”", "Author": "amolin2009", "ReviewID": "UR116131523", "Content": "Me, Daniel, and my friend Ronaldo (brazilian guys) have been at Villa Saint Martin Hotel on our last hollydays, on July, 2011, and wish thank the management and especially the receptionists for all the attention they spent us! All the girls were patient, polite and kind with us! Besides they are so beautiful girls!!! Comfortable room and complete breakfast! What else can we wish for ourselves? We have had the best impressions of Paris!!! It is going to be an unforgettable trip! Oh la la, France!!! If you wish to contact us, the email address is: amolin2009@hotmail.com Best wishes!!! Thanks for everything!!!", "Date": "August 1, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "5.0", "Value": "4", "Service": "4"}, "AuthorLocation": "London, United Kingdom", "Title": "“the best hotel I've been near Gare du Nord”", "Author": "AgentP13", "ReviewID": "UR115860882", "Content": "We had a very pleasant stay at Villa Saint Martin. T The location is perfect when travelling by train. The hotel is clean throughout, and we were very happy with the room. I have to say that for the many times I have been to Paris and have stayed in may different hotels, the staff at this hotel were exceptionally friendly and always helpful. At reception they will speak in French, English and Spanish and still being friendly...I have not experienced that in Paris before!! I will be back definitely! merci", "Date": "July 27, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "4.0", "Value": "4", "Service": "5"}, "AuthorLocation": "Aarhus, Denmark", "Title": "“Best service EVER”", "Author": "Lene1982", "ReviewID": "UR115853678", "Content": "I just stayed at Villa Saint Martin - and I loved it was near Gare de l'est - so I could hop on and off the metro. Wonderful and helpful staff. And breakfast is worth getting up for. I will definitely stay there again next time I visit Paris. Tanks for a nice stay", "Date": "July 27, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "4.0", "Value": "4", "Service": "4"}, "AuthorLocation": "Austin, Texas", "Title": "“Nice hotel but is out of the way from most well known tourist points”", "Author": "Merlot2010", "ReviewID": "UR115621600", "Content": "My daughter & I stayed here on our first trip to Paris. It is closest to Gare de l\"Est but not far from Gare de Nord so walking to and from the train station is not an issue. The hotel was clean and safe and the staff was lovely & helpful. It was cool to be right near the oldest church in Paris although occasionally you hear a little noise from the work they were doing on the church. The priest was in front of the church mingling with the locals each time we came by which added some charm to the area. The rooms were clean and neat but are very small for most US standards so get over yourself! The elevator is also small so beware of having lots of luggage. The underground stop is within easy walking distance. Even closer is a stop for one of the tourist bus lines so we bought a two day ticket and used it for most all of our movement. The only negative is that the drivers DO NOT stick to the schedule so you can lose some time waiting if you are on a tight schedule. Hey, its vacation - loosen up. :) The continental breakfasts provided a wide variety and started your days off well. Restaurants in the area are geared more for evenings and the typically larger, French dinner menu so for those looking for lighter fare, especially during the day will be challenged.", "Date": "July 21, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "4.0", "Value": "4", "Service": "4"}, "AuthorLocation": "Dallas, TX", "Title": "“Good location for the price”", "Author": "synnyster", "ReviewID": "UR115573110", "Content": "I had a good stay at Villa Saint Martin in March with my wife. The hotel itself is on the small side, but that is what you expect in Paris. The room was very nice for the price. The breakfast was included in our price and was good. The hotel is located near 2 main train stations so it is a good area if you wanting to make a day trip out of Paris or just moving on to your next destination. Many of the main attractions are about a 30 minute walk from the hotel if you are up for it. Subway stations can be found near as well.", "Date": "July 20, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "WV", "Title": "“When we return to Paris, this is the only place we will stay.”", "Author": "wvulaw", "ReviewID": "UR115391971", "Content": "The staff here was amazing. The girls that worked behind the desk were very pleasant and helped us with directions, questions, concerns, and our terrible handle on the French language. The location is a 3 minute walk from Gare de l'Est which is a train and metro stop. Although not near any of the major land marks in Paris, there is a beautiful canal, Canal St. Martin, just down the road a block or two, and with the metro stop that close it is a quick trip to any of the sightseeing landmarks such as the Eiffel Tower, Louvre, Musee d'Orsay, and others. Our room was what we expected in size and cleanliness, but was also air-conditioned which we were not expecting. All in all, we had a wonderful time while in Paris, we will be back and staying here again.", "Date": "July 15, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Darlington", "Title": "“Lovely hotel, great location, fantastic staff!”", "Author": "Kingpete", "ReviewID": "UR115354337", "Content": "Just returned from three nights at the Villa Saint Martin after spending two nights there last year. Room 164 not the biggest but had everything one could reasonably want, including a wonderfully comfortable double bed, effective and quiet air conditioning (very welcome) and a huge LCD TV with 50+ channels. It looked out onto the garden so was really quiet. Breakfast is fairly simple but attractive, fresh and generous; the breakfast room doubles as a welcoming bar later in the day, selling drinks at pub prices. Location is excellent, 5 minutes walk from the Gare d'Est, but better still, at the other end of the street is the super-trendy Canal St Martin - do as we did and enjoy a picnic on a warm evening, but beware, alcohol is only tolerated outside until 9pm. So overall, a brilliant hotel that doesn't try to do anything it can't but does what it does really well. Its best feature though has got to be the friendly, welcoming and helpful staff for whom nothing is too much trouble and who make the place really special - and for only £70 per night including breakfast (via Asda) one of Paris's best bargains!", "Date": "July 14, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "4.0", "Value": "5", "Service": "5"}, "AuthorLocation": "kuala lumpur malaysia", "Title": "“unbelieveable....”", "Author": "Hardyryan", "ReviewID": "UR115320098", "Content": "Hai all I just get back from paris holiday, Initially very worried about the hotel in paris, but what a suprise Villa saint martin hotel was the best hotel to me it is because it is very near to Garde de Nord train station whereby if you wish to get back by Eurostar it is the best place to stay no rush because the distance is near. breakfast was great light and easy.... Room is fantastic... you can open the window so that nice air can come in to the room...So romantic for couple..all of you should try...reception was very helpful and very understanding...metro station also nearby....try it our you wont regret guys...", "Date": "July 13, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "", "Title": "“Wonderful!!!!”", "Author": "tonibologna14", "ReviewID": "UR115303518", "Content": "The Villa St. Martin was wonderful! The staff was amazingly kind and all spoke excellent English. They were extremely knowledgeable and helped us out so much. Breakfast was delicious!!! So fresh! The location was great; it was down the street from the metro. Super clean rooms. It was just great! I absolutely recommend!", "Date": "July 12, 2011"}, {"Ratings": {"Cleanliness": "3", "Sleep Quality": "3", "Overall": "3.0", "Value": "3", "Service": "3"}, "AuthorLocation": "Bath, United Kingdom", "Title": "“Better than most for the money”", "Author": "thesaurus23", "ReviewID": "UR115041474", "Content": "First room we had in main hotel had a large bed but was cramped over all. It's a quiet area and the reception girls are helpful. We had to move the second night to the older part of building where there isn't a lift, and we were on the top floor. Quiet room, although the back rooms overlook school playing grounds so in the day it's noisy from the children. The room was tiny and chlaustrophobic, the bathroom not bad though. The first night we paid 115 euros which was reasonable but the second night it was 156 euros for some reason, which we felt was expensive for such a tiny room.", "Date": "July 5, 2011"}, {"Ratings": {"Sleep Quality": "4", "Overall": "4.0", "Value": "4", "Service": "5"}, "AuthorLocation": "Raleigh, North Carolina", "Title": "“Good location, friendly and helpful staff”", "Author": "toconnor17", "ReviewID": "UR113139743", "Content": "This is a pleasant place to stay in a convenient location just off the Gare de L'Est train station at a price that is reasonable by Paris standards. The staff is very friendly and helpful---I observed them providing assistance to many hotel guests. The rooms are rather large by Paris standards and the bathroom is quite modern and comfortable. The only significant negative is that the walls seem to be paper-thin--I could hear every word of our next door neighbors' morning conversations as well as every noise from their room. If you are wanting quiet and like to sleep in, this could be a problem. Otherwise, thumbs up.", "Date": "June 13, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "5.0", "Value": "4", "Sleep Quality": "4", "Rooms": "5", "Location": "3"}, "AuthorLocation": "London, United Kingdom", "Title": "“Great hotel: great staff!”", "Author": "missmistry", "ReviewID": "UR112261343", "Content": "Stayed here this past weekend for 2 nights with my best friend during out city break to Paris. The hotel was presented very well! The staff were so helpful!!!! I couldn't have been happier with the level of service! They were kinda, polite, understanding and were so helpful when asking for things that they even printed information for us. Our room was clean and a good size for what we paid. It was furnished with mod cons incl: new finished bathroom, hair dryer, TV, full length mirror and safe. The area isn't the nicest in Paris but the hotel is 3mins walk from Gard Du Nord which gives you access to anywhere in Paris via the Metro. The hotel also recommended a local restaurant serving French Cuisine 20 ft down the road Les Enfants Perdus which we visited...recommended for diner!", "Date": "June 8, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "San Antonio, Texas", "Title": "“Wonderful hotel”", "Author": "George60956", "ReviewID": "UR110814563", "Content": "We will stay here on our next trip to Paris. The English speaking staff provided the best service that anyone could possibly ask for. And a very nice room plus a great breakfast.\\ This was our 50th anniversary trip and this hotel was the best. Location is very good, couple of blocks from Metro, plenty of restaurants in neighborhood.", "Date": "May 31, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "California Central Coast", "Title": "“Best staff in Paris”", "Author": "CypressRidge", "ReviewID": "UR110620690", "Content": "Traveled to Paris in May 2011 with my spouse and another couple. We stayed at this hotel for five nights. The hotel itself is a typical three-star - small but clean rooms. Breakfast was great. Location near the Gare D'Est train station made travel around the city a breeze even though it is a bit east of key attractions. The Hop-On, Hop-Off bus stop is a block away, too! But what made our stay so delightful is the staff. They were SO responsive, helpful and pleasant. Need a computer to print boarding passes? No problem. They provided a laptop and printing capability. They gave us tips about the best way to get around. Our last day we had a pickup at 6 a.m., but breakfast is not until 6:30 a.m. Sure enough, they had breakfast ready for us a 5:45 a.m. that morning! THAT'S service. There are more than 2,000 hotels in Paris. If you want something homey and special, this is the place.", "Date": "May 30, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Gipf-Oberfrick", "Title": "“Ideallocation for a pleasant stay”", "Author": "walthersus", "ReviewID": "UR108481194", "Content": "We have chosen this hotel because of its location close to the “Gare de l’Est” train station. The reception staff was surprisingly young, very friendly and extremely helpful. We stayed in a twin room which was spacious enough for 3 nights. The bathroom was OK but the shower cabin was VERY small! The hairdresser was quite powerful. Breakfast was served in the bar and the quality of food was delicious. They had slices of bread and buns, croissants, meat, cheese, eggs, fruit salad and yogurt. There was also the choice of 2 fruit juices. Coffee was supplied by a machine which produced very delicious Cappuccino. I would alqays choose this hotel again if I went back to Paris one day.", "Date": "May 16, 2011"}, {"Ratings": {"Overall": "1.0", "Location": "1"}, "AuthorLocation": "Gaithersburg, Maryland", "Title": "“Nice staff. Horrible environment.”", "Author": "Ajones_0319", "ReviewID": "UR108253934", "Content": "We stayed at the hotel earlier this month. The staff was wonderful--very friendly and helpful. The hotel and the neighborhood were horrible. The rooms were very small (7'x7') which were too small even by European standards. There was mold in the bathroom and brown stains on the bathroom ceiling. The hallways were fitted with lights activated by motion detectors located at only one end of the hallway. You had to walk down a dark hallway in order to turn on the lights and then go back down the hallway to safely exit by elevator or the stairs. The street was more line a dark alley. I saw two dead rats on the sidewalk. Most buildngs on the street were lined with graffiti. I would never recommend this hotel. I give the staff a large BRAVO for working in these conditions and for their great care for the guests.", "Date": "May 14, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Belgrade, Serbia", "Title": "“Definitely best choise”", "Author": "Zlatan78", "ReviewID": "UR108129118", "Content": "I stayed here five days and my impressions are really great! The hotel has nice position, 2 minutes on foot from metro station Gare de l'Est! My room was very clean with nice bathroom! Breakfast is surprisingly good and with several french cheese! The thing I like the most is kindness of hotel stuff. They were always prepared to give me every information I need, especially Benedicte, who had nerves for my bad french!Besides,all of them speak english very well a part from majority of french people in the streets,bars,shops. My recommends goes to this hotel for sure! And will come again! Zlatan", "Date": "May 13, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Cheltenham, United Kingdom", "Title": "“Great location near Gare de l'Est and canal”", "Author": "MandLGloucester", "ReviewID": "UR107558687", "Content": "Very convenient if arriving or departing from Gare de l'Est. Pleasant location near park and canal with some good restaurants and bars near by. Superior room was very spacious. Friendly and helpful staff.", "Date": "May 9, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Fort Lauderdale, Florida", "Title": "“Took my daugther to Paris, France”", "Author": "southernguyFL", "ReviewID": "UR107471175", "Content": "The hotel staff very helpful and great personality. The hotel location was very close to metro. The walk from the metro to the hotel was a little concerning at first, but afterward I felt safe enough to return last nights with my daughter. The opposite direction from the hotel towards the river was safe and in a middle-class neighbor. The room was very nice for European standards. Nice for under $150 per night. We stayed 8 nights. Bathroon toilet was a bit close the wall and the shower", "Date": "May 9, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Denver", "Title": "“Great hotel”", "Author": "ajbauer29", "ReviewID": "UR106278064", "Content": "My husband and I stayed here while in Paris and couldn't be happier. Though located in kind of a seedy area near the train station, it was a great location because it was right next to a metro stop and you could get anywhere quickly. The staff was outstanding- so incredibly nice and helpful- their English is impeccable! The breakfast served each morning is huge and delicious- not just croissants and coffee, but cereal, yogurt, meats, cheeses, eggs, a variety of rolls, fresh fruit...just wonderful. There is a really nice restaurant nearby that serves this incredible ravioli with goat cheese in this beef broth that is absolutely to die for. Terrific recommendation by the staff. Again, we couldn't be happier. Good shower, bed was comfortable. I'd definitely stay here again!", "Date": "April 30, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Morgantown, West Virginia", "Title": "“What April in Paris Should Be”", "Author": "JRErnest", "ReviewID": "UR105165858", "Content": "The Villa Saint Martin is nicely located, serves a great breakfast, and is comfortable and convenient--but the best thing is the service. The staff is simply outstanding, helpful in every way and genuinely solicitous, looking for every way to make your visit more comfortable and enjoyable. We recommend this hotel to anyone, and we'll stay there the next time we go to Paris.", "Date": "April 23, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Manteca, California", "Title": "“We Loved It...”", "Author": "Mike32679", "ReviewID": "UR103835218", "Content": "Our room was tiny, but cute, cute, cute with large wonderful windows that opened wide. The people on staff were so nice, helpful, courteous, sweet. Near a nice park, two major rail stations and subway access. We loved it. Ask the desk about neighborhood grocery stores. You can get a substantial wedge of brie for about 2 euros and a great bottle of wine for 4 euros.", "Date": "April 12, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "WashingtonDC", "Title": "“Very helpful-friendly staff-”", "Author": "2ticos", "ReviewID": "UR103685172", "Content": "We stayed at this hotel as part of a package and therefore cannot comment on the price/value equation. The hotel is located off the beaten path, but with the excellent subway system in Paris, you can practically stay anywhere as long as there is a station nearby. The metro is 2 blocks away from the Gare de l'est and a few more from the Gare du Nord. We have a room facing the front of the hotel on the second floor - The street is not very busy and the room was very quite. The room was tight but comfortable, clean and well decorated with nice comfortable bedding. Breakfast was excellent with plenty of offerings. The staff was always helpful and greated us with a friendly smile. I would consider this hotel in my future travels and would recommend it highly.", "Date": "April 11, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "3", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Singapore, Singapore", "Title": "“Fantastic Service, Good security and Great location!”", "Author": "Astaris", "ReviewID": "UR103172469", "Content": "My husband and I stayed at this hotel for 3 nights. We came from Switzerland via train and it was about 3 mins walking distance from station n Gare De L'est Metro. Direct Metro to major sightseeing places and shopping areas. Love love love the location. As previous posts have said, its clean, compact and ideal if your looking a hotel on a budget. All the receptionist was extremely helpful and polite. Breakfast was great too! We would certainly go back...can't highly recommend it enough!", "Date": "April 7, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Rhondda", "Title": "“Reasonble stay at Villa Saint Martin”", "Author": "pontypandy57", "ReviewID": "UR102814704", "Content": "Just got back from a weekend stay at this hotel and the staff were very helpful and obliging and spoke excellent english, our room was compact and bejue as they say, the bathroom was a little on the cramped size and the shower cubicle was extremely tight to get in and out of, I don`t know how larger people managed and there was a few larger americans staying here. The breakfast was continental with plenty of choice as long as you got down there early, the bar serviced as the restaurant and was a little overcrowded some mornings. The hotel tried really hard and fair play was clean and tidy and as I say the staff were brilliant and keen to help, the location was north east of the seine approx 45 mins walk to the Notre Dam cathedral and about 400mts from Garde L`Este Metro station. Plenty of cafe bars close by albeit they were a little expensive e.g. meal for 2 costs around 45 Euros, beer was 8 Euros a pint, in the hotel a bottle of wine was 12Euros 50Cents, which, was the cheapest we could find although the bar was dead in the evenings. My only complaint about the hotel was there was a persistent smell of smoke in our room although it was a non smoking hotel.", "Date": "April 4, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Adelaide, Australia", "Title": "“Friendly Staff.”", "Author": "BonnieMax", "ReviewID": "UR102249954", "Content": "I stayed in a superior room 111, this is meant to be a little larger than a standard room. I choose this hotel because of the location to the main train stations.The front desk staff were excellent and always friendly and very personal. The rooms are basic with a large LCD TV and a modern bathroom. The ceiling in the bathroom was quite low, that if your are over 184 cms you would have to duck your head while having a shower. The bath towels were a good size and thick. The walls were very thin, I could hear the people in the next room easily. The free WiFi worked well in our room. This is a nice basic hotel for Paris.", "Date": "March 30, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "glasgow", "Title": "“Paris weekend”", "Author": "crystal64", "ReviewID": "UR101997133", "Content": "We stayed at this hotel in room 268 which was to the back with 2 flights of stairs no lift but the standard of the room was good and shower fantastic. The cleaner does a great job and they never get thanked properly. The breakfast is cereal fresh fruit yogurt rolls croissants bread cheese cold meat jam nutella orange juice coffee selection of teas. The gard du nord is a 10 minute walk and gard du l'est station is just round the corner. The staff at the hotel are very friendly and helpful and speak excellent english would definely stay at this hotel again", "Date": "March 29, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Sacramento, California", "Title": "“First time to Paris, very very pleased”", "Author": "ingmarsvenson", "ReviewID": "UR101340020", "Content": "This hotel was amazing. The service was polite and friendly and very helpful (and all spoke English, which was quite helpful, though I hate to admit it). It was a five minute walk from Gare du Nord, and seconds from Gare de l'Est. Free internet worked well (unlike all other hotels this trip), and room was very clean and sleek/modern. One last tiny thing I noted: the candy at the front desk was delicious. Will do my best to stay here on any subsequent trips to Paris. Stay here if you can.", "Date": "March 24, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Niagara", "Title": "“Nice clean hotel, good value and excellent front desk service”", "Author": "EddieNiagara", "ReviewID": "UR101138481", "Content": "Stayed at the Villa Saint-Martin as part of a tour package. The hotel is a good solid choice. As with any hotel in Paris, rooms are a little on the small side but have all the amenities. I was in a single, which had a recent reno of the bathroom. Shower was very small, I am 6' 3\", and could barely fit, but the bathroom was very clean. In the main part of the room, there is barely enough room for the double bed, but again, it was quite clean and I did have a small closet and a desk from which to work. My wife and daughter were in a double room, which was a little larger and had a recent reno on the bathroom as well. Again, size being what it is in Paris, the tub was so small that I could not fit and my wife and daughter could barely fit. Nonetheless, it is a clean and nice hotel. Location, while not that near the downtown, is literally across the road from Gare de L'Est, a main train station and a stop on the Metro. The Metro, is excellent and easy to follow and get arpouind as a mode of transportation. We bought a 5 day pass for each of the three of us on the Metro for 90 Euros and used the Metro continuously. You can generally speaking get anyhwhere in Paris using the Metro. The breakfast was nioce, not to over the top, but fairly good choices were available. Our biggest thanks went to the front desk staff, Charlotte especially, but also Marianna, Benedicte and Veronique. On the whole, Parisiens are not that friendly or service oriented, but the front desk staff was excellent. They took care of every request and wish easily and with a smile. In fact, we had our passports stolen (watch out for pickpockets in Paris - very bad) and the assistance from the front desk staff was outstanding. It would have been very difficult to coordinate all the phone calls, etc. without their assitance. Bravo!", "Date": "March 22, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Reading, United Kingdom", "Title": "“Fantastic value for money”", "Author": "ducos", "ReviewID": "UR100485191", "Content": "On my way back from Le Mans, I decided to stop for couple of days in Paris and I booked one at La Villa Saint Martin Hotel, which very convenient located, near Gare de L'Est and Gare du Nord and from there easy acces to Paris Charles de Gaulle Airport. I am very happy with my choice. If you are after luxury, you wouldn't want to stay there, as the hotel has very basic facilities, however if you want a spotless clean room, nice breakfast and a very warm welcome, then this hotel is the perfect choise. Unfortunatelly I did not take the name of the girl who was in reception when I arrived, as she was not wearing a name badge, but she was very welcoming and helpfull and on top of that her english was just perfect. I highly recommend this hotel to everyone, who doesn't want to spend too much, but still getting a very good service.", "Date": "March 17, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "3.0", "Value": "5", "Sleep Quality": "2", "Rooms": "3", "Location": "2"}, "AuthorLocation": "Hasselt", "Title": "“Great value for money”", "Author": "MyT9", "ReviewID": "UR99699783", "Content": "If you look out on the internet, you can find great deals for this hotel, which are close to being unbeatable taking into account value for money. Do not expect a posh hotel with large luxurious rooms. Villa Saint Martin offers decent rooms of an acceptable size, which are 'nicely' decorated. So, nothing outrageous but very ordinary. The breakfast is better than at most Parisian hotels as there is a fairly wide choice of products, and the quality is definitely above average. The staff are multilingual and seem very nice. The area is not the best: it is very near to the train station Gare de l'Est which is nice to get around town, but on the other hand: train stations are usually not in the best areas (expect night shops and old cafés closeby instead of Louis Vuiton and YSL). Bathroom looks quite nice and very clean (products are by Yves Rocher). The mattresses on the beds are a bit hard. In short, this is a very good 3-star quality hotel, close to unbeatable in value for money. Do not expect full luxury though.", "Date": "March 10, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Fort Lauderdale, Florida", "Title": "“A gem!”", "Author": "lymac7", "ReviewID": "UR99079136", "Content": "This hotel was great! It was close to good restaurants and brasseries, and very close to Gare de l'Est, which made it easy for the traveler to get around the city. Like another reviewer said, Charlotte was very friendly and helpful. Actually, all of the desk staff were that way. Their breakfast was good and offered a lot of variety, and the rooms were clean and well maintained. Also, the price was reasonable. I recommend this hotel to anyone!", "Date": "March 6, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Derby, United Kingdom", "Title": "“Great hotel, good location”", "Author": "Michelle1978a", "ReviewID": "UR98989655", "Content": "I booked my parents to this hotel as a Christmas Present A lot of hotels in Paris do not have a good writes up however this one I came across finally did. Its not in the centre as such because Paris is so big, it still does have a centre Paris Postcode if you are using shuttles or private taxi. Its 2 minute walk from the gare de nord and the metro so all the sites and attractions are easy to get to. Rooms are small but clean and tidy. The continental breakfast has a really good selection. My parents loved it, the staff are really helpful and nothing is to much trouble. They would recommend it as a good base to explore a lovely city", "Date": "March 5, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Brooklyn, New York", "Title": "“This Place Was Great and Service Amazing Will Stay There Again”", "Author": "AMAlovestotravel", "ReviewID": "UR98141000", "Content": "My boyriend and I went last week - just got back yesterday. I loved this place and the location by the two train stations (Nord and l'Est) is really good. The staff could not have been more fantastic - especially my favorite Charlotte. She was always there, so very nice and helpful. They were all nice and helpful and my French is the worst but they all spoke English. The room was small but this is Europe and the shower small but nice and hot and had the car washer type spouts that get you everywhere. Felt really good. We were supposed to stay only three nights and then fly to Rome but due to me getting sick (not from Paris but from something going around at my job) we had to cancel as i could not leave the room not fly. Although the hotel was fully booked they went out of there way to allow us to keep our room and could not have been nicer in asking us whatever they could do for us. Again Charlotte saved the day. Breakfast was good and plenty there. I will stay here agian and tell all i know to do so. go to theCana;StMartin at the end of the block - it's really nice andsupermarket on other side.", "Date": "February 26, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "3", "Location": "4"}, "AuthorLocation": "westmeath", "Title": "“Very friendly staff, good location”", "Author": "Treeflynn", "ReviewID": "UR98052395", "Content": "The only complaint was the room was very small,but the bed was very comfortable . Very helpful staff printed my boarding card for me next morning , close to Gard'Est train station and ten to fifteen mins walk from Gare du Nord train station. Quiet area very nice resturant on same street called Les enfants perdus", "Date": "February 26, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "3"}, "AuthorLocation": "London, United Kingdom", "Title": "“Good until they threw my stuff out...”", "Author": "babygat", "ReviewID": "UR97619224", "Content": "Overall was a good experience. Staff were friendly and the reception was open 24 hours. Don't expect anything special for breakfast but rooms were nice, clean and cosy. Good experience but warning as they do not do late check outs. We booked through BA and requested this however was not told until we returned and our stuff were in storage along with my broken snowglobe that I had brought for 20euros the day before!!!", "Date": "February 22, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Wrexham", "Title": "“friendly and convenient”", "Author": "JMSWrexham", "ReviewID": "UR97573490", "Content": "The staff on reception were friendly, welcoming & helpful and managed to book us a restaurant for dinner that evening, \"Les Enfants Perdu\" close by, and we had a lovely meal although it was extremely busy being Valentine's Day. The hotel itself was very clean and comfortable and we were happy with our room on the fifth floor, although it was on the small side. The double glazing kept out the street noise very efficiently - views of the Gare du l'Est and a nearby park. The only noise was from our neighbours in the next room who tended to slam doors and talk at full volume! Buffet breakfast was included with a good range of fruit, cereals, yoghurt, eggs, meats &cheeses, bread and pastries - help yourselves. The hotel was well situated for arriving by train - Charles De Gaulle airport then RER to Gare du Nord (half an hour, 8.70 euros each way) then one stop on the metro to Gare du l'Est or an easy 10 -15 minute walk. We would certainly stay again.", "Date": "February 22, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Bennington, Vermont", "Title": "“Quaint, clean, and excellent service!”", "Author": "cailc", "ReviewID": "UR97222399", "Content": "I recently stayed at this hotel and was very pleased with my experience. The service was fantastic. I am an American who speaks VERY LITTLE French, but I had no trouble communicating with those who worked there. They were always available, no matter what the time. Whether it was buying a glass of wine at 3AM for jet lag, or getting an ice pack (I fell walking the Champs Elysees--very character building), the staff was always obliging and helpful. It's also in a very convenient location, close to a main travel station. This hotel comes with my enthusiastic recommendation!", "Date": "February 19, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Prestatyn, United Kingdom", "Title": "“Good location and easy walking distance of Canal St Martin”", "Author": "AJones1949", "ReviewID": "UR96977876", "Content": "Enjoyed our stay in this hotel despite room being quite small. Whilst slightly outside centre of Paris,it was close to Gare De L'Est for metro and on direct bus route to airport.(number 350).Also within easy walking distance of Canal St Martin with pleasant walk to nearby restaurants. Nearest one is expensive Les Enfants Perdus but wonderful and their lunch at 18 euros is a dream. Hotel staff are very pleasant and helpful and if we were to be critical the plumbing seemed to be noisy and as we were in the basement sounded like Niagara Falls. The breakfast room also is rather cramped for the number of clients in the hotel albeit the breakfast especially the coffee was excellent.", "Date": "February 17, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Bucharest, Romania", "Title": "“Absolutey great !!!”", "Author": "Romuald78", "ReviewID": "UR96946601", "Content": "I have stayed in quite a few hotels in Europe and I can say without a doubt that here I have received the most warm welcome from the reception staff of all. Not even in 5* hotels staff was that friendly and helpful. Regarding the hotel I must say that in my opinion it offers more than a fair value for a 3* property - a good location with Gare de l'Est 3 minutes away walking and from there excellent conections to everywhere in Paris, clean, chic and functional rooms, with everything in the right place. Breakfast was good, nothing special to say here. My wife felt in love with the mattress of our bed, so soft and relaxing, just perfect after a day of walking in Paris. I would like to thank once more to Benedicte and her colleagues from the reception - they made our trip so much pleasant!", "Date": "February 17, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Staffordshire", "Title": "“Excelent value hotel with friendly staff”", "Author": "Heatherjayne", "ReviewID": "UR96167373", "Content": "We booked this hotel with otel.com and got one night free, thought it was great value for a city hotel. Staff were very friendly, room was clean and it's just a short walk from the metro. Realised after we left that we hadn't filled in any type of feedback form, main suggestion would be for them to display a five day weather forecast print out in the reception, which would have been useful for us in planning our days. All in all though somewhere I'd definitely recommend!", "Date": "February 10, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Tonbridge", "Title": "“A good hotel near the Gare de L'Est”", "Author": "ColinBern", "ReviewID": "UR95913248", "Content": "We have stayed at this hotel twice recently and find it to be an excellent choice. Its location near both the Gare de L'Est and the Gard du Nord is very convenient for us as we arrive by Eurostar and travel onwards by TGV to Switzerland. The rooms are small, as are most in Paris, but clean with a good bathroom and shower. The breakfast is good but possibly the best feature is the staff. They are polite and helpful, speak good English and do not sneer at our attempts to speak French, something we have encountered in other Parisian hotels. The hotel is in a side street which is surprisingly quiet for one so close to the main stations. We have already booked for ourselves and friends for next July.", "Date": "February 8, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Riga, Latvia", "Title": "“Nice little hotel very well located”", "Author": "Gorale", "ReviewID": "UR95549527", "Content": "Stayed there for 3 nights with my wife. Excellently located hotel, close to both Gare du Nord and Gare de l'Est stations so you have all your connections near by. Also it is on a quiet street, so good for your sleep. Our room was on a first floor and rather small, with even smaller bathroom. good that we both are slim and small :) otherwise it would be difficult to get into shower. Because we were during low season, hotel was not full, but when it is you might have some noisy neighbors, as the isolation is poor, and one can hear almost everything outside of the room. Breakfast is decent, not so much choice, but all is tasty. We also enjoyed free Wi- Fi throughout the hotel. All in all, we liked it and would definitely stayed there again.", "Date": "February 5, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "4", "Rooms": "5"}, "AuthorLocation": "", "Title": "“Amazing place!”", "Author": "Dentalfreak11", "ReviewID": "UR95007004", "Content": "Lovely place! The rooms are beautiful and the bathrooms are very modern. The breakfast buffet is very good, and features a cappucino machine that can make you a latte hot chocolate. The employees were wonderful and helpful, as was the view. I will definetely return. Also, please ask Benedict if he remembers the girls who asked him for spoons every night.", "Date": "January 30, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Melbourne, Australia", "Title": "“Good location with helpful staff”", "Author": "JalanHidup", "ReviewID": "UR95002888", "Content": "We stayed one night only before leaving Paris on 21 Jan. Didn't realise that this hotel is only 2min walk to Canal St Martin. We walked to canal under the full moon while looking for place to have dinner (plenty restaurants nearby). Room was quite big and had great hot shower. It was on quiet street, which was helpful for good resting night. Staff was very helpful. Train station Gare de L'est is only 2 min walking distance. Really recommended to all travellers.", "Date": "January 30, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Sleep Quality": "2", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Bristol", "Title": "“Good location, friendly hotel with good service”", "Author": "mermaid_cat", "ReviewID": "UR94777348", "Content": "Very convenient location - 10 minutes from eurostar, 3 minutes from gare de l'est which is connected to 3 metro lines. Friendly receptionist and staff generally. My room was small but had everything you need anad very clean. Very quiet as I was at the back of the hotel, I could even sleep with my window open as it was a bit stuffy in the room - pretty amazing how quiet it was even with the window open, in January too! I had a problem ith the bathroom, a slight leak from the cieling which was sorted out immediately by a very friendly guy. All in all a great stay in a great location, recommended!", "Date": "January 28, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Minneapolis, Minnesota", "Title": "“An excellent friendly and accomodating place to stay”", "Author": "Happy43323", "ReviewID": "UR94693864", "Content": "This was our first trip to Paris. My wife and I stayed for three nights. The hotel is located very close to the train station. Also one of the Paris bus tours has a stop a block away so the Louvre, Effiel Tower, Norte Dame, etc. are easily accessible if you're a first time Paris visitor. The hotel is clean. The staff is very friendly and very willing to help with any question or need. The neighborhood has many nice restaurants. The breakfast served at the hotel was excellent and tasty. We would definitely stay here again. We also would have no problem recommending this hotel to our friends.", "Date": "January 27, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Singapore, Singapore", "Title": "“5 star Family Hotel! ~~Suitable for everyone! Will definitely stay here again! :)”", "Author": "AydaHabs", "ReviewID": "UR94624693", "Content": "I have actually started boasting about this hotel to friends and families. Well, mainly because this hotel has been amazing to me. An experience to remember forever! I am a breastfeeding mom and travelled without my baby. Hence i had to express breast milk every day and seek help from the reception to help store my milk in their freezer.(there was no fridge in the room) I had to 'bother' them everyday to assist but it seems that this is not even an issue. The ladies understood my situation and gladly assisted without any questions. Check in was not until 2pm but i had to express some milk. The kind lady at recep was kind enough to offer me a room that is ready on the 1st floor before 2pm. I did not mind of course. I really appreciate her kind understanding. Everyday i see different faces at reception and these smiley faces provide service that i can safely label as high class service. Here are the main areas which I can commend::: Reception: ALL and i mean ALL of them were fluent in English. They were mainly ladies and they were cheerful and super friendly and helpful and POLITE! :)) Room: VERY clean and comfortable. Bathroom: was not expecting a fancy one but this hotel bathroom provides stylish shower area with massage and 2 different shower heads AND a nice and clean wash basin area. Free shower soap and lotion also provided. The towels were thick and really absorbent and good. View: We were on the 1st floor and looking out the window we could see some shrubs but that did not bother me and my bro at all. when it is warm at night,we would leave the window ajar for a while to let the cool air in. Location: Very near Gare del Est metro,barely 5 mins walk and there are cafes and shops all around. surprising that area is not noisy and disturbing. Safe outlook, fret not! If you are looking for halal food, just walk around the corner and you will find kebab joints. 1 that we ate at actually closes at 12 midnight. Beside the hotel is a bookshop and a graffiti shop and also near a shop selling arms. Interesting... :) Breakfast: Bread, fruits, yogurt,freshly baked croissants ans chocolate pastries,cheese slices,and some meat slices. They have a stylish espresso machine. You can even make yourself a hot chocolate! Cool! Definitely will not consider staying anywhere else but here! booked online and got the best price (winter season) including breakfast. At 54eur per night with that kind of service, i feel Paris is allll LOVE....Go for it! :))", "Date": "January 27, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "3", "Sleep Quality": "5", "Rooms": "3", "Location": "3"}, "AuthorLocation": "england", "Title": "“Great friendly stopover near the northern stations”", "Author": "amy000", "ReviewID": "UR93564725", "Content": "We stayed here en route from Italy to the UK and it is a very nice, friendly no frills hotel, within sight of Gare d'est and ten minutes walk from the Gard d'nord. Hotel has no restaurant but there were some nice looking bistros down towards the San Martin canal ( which was disappointingly drab itself) although they did not serve food until late and we wanted to eat. Other nearby options are fast food places around the station area if you want to eat early. The hotel has a small bar, which is also the breakfast room - nice plain food, drinks from a machine but nice enough. Only problem is the chairs are all bolted to the floor and not quite right with the tables - well, I suppose they must be in the right place for some people ! The room was small and I wouldn't want more than a night there but it was comfortable and clean and everything worked OK ! There were no large towels when we arrived and we wondered if this was part of the deal, but a simple request had towels delivered toute suite. No language problems, the staff were charming. Only thing I hated were the dirty streets on the walk to the station - cigarette ends, dog dirt. On our trip across Europe by train, walking from hotel to stations in several cities, this was the dirtiest route.", "Date": "January 18, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "3", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Widnes, Cheshire", "Title": "“Very well located hotel + helpful staff = a nice place to stay!”", "Author": "Mrs_Sud", "ReviewID": "UR92285879", "Content": "My husband and I stayed at the Villa St Martin for 5 days in December. It was our first wedding anniversary and the hotel was perfect for our stay. It is situated a five minute walk from Gare de L'est and so is ideally located for anyone arriving by either Eurostar (as we did) or by plane as CDG and Orly airport both have direct links to this station. There is also a Metro on the road opposite the hotel. I had emailed the hotel prior to our arrival to inform them of our wedding anniversary and upon arrival we had been upgraded to a better room as a result - this was very kind of the hotel and it was a nice start to our anniversary trip. The room itself was spacious and the bathroom was a nice size, the hotel provided nice, good quality complimentary toiletries (not the bog standard) which was also a nice touch. The television in the room only had one english speaking channel - CNN - which is annoying to the point of irritation (the channel!) so it was a good thing that the television wasn't charged to the room as an extra! I only add this point as information for any english speaking people looking to book the room, but to be honest after a day's sightseeing we were always too exhausted to watch tv anyway! The only negative I could say about this hotel would be the thin-ness of the walls - we literally heard the conversations and toilet habits of the two adjoining rooms - as a result we spoke in whispers most of the time - the window's are double glazed and so we heard little or no outside noise at all - I don't suppose anything can be done about this but then again, the hotel should really only be used as a stop-gap in between sight seeing so I guess it would only really irritate you if you spent a long time in your room? That said, compared to other hotels in Paris, this one offered extremely friendly and helpful staff and a good sized room.. It was very reasonable price wise and worked extremely well for us location wise so we were able to make the best use of the time we had there. If we ever returned to Paris I would not hesitate in booking this hotel again. We never got up for breakfast so i cannot comment on the quality of the food on offer. We ate locally one night and at Bistro 31 on the night of our anniversary (fabulous food and surroundings..cannot recommend it enough) we ate at a chinese resteraunt another night which was pleasant enough and made do with sandwiches and portable food the rest of the time. I would recommend to all to purchase your tickets for the Eiffel Tower online prior to leaving, this avoids you having to queue for hours and ensures you are able to access the tower quickly and easily (at your agreed time of booking) it also lessen's the time you have to spend avoiding the irritiating street sellers (who all sell exactly the same rubbish souvenirs within feet of each other!) and who continually badger the tourists who are queuing for their tickets! I would also recommend buying the metro and train tickets online prior to arriving, we were able to get off the eurostar and hop on to the metro without having to try and navigate our way through the awkward -ness of trying to buy tickets speaking in broken french/english! Bottom line is that this hotel is well located for travel and for all the sights of Paris that you want to see. The staff are extremely polite and helpful not to mention knowledgable. I would definately recommend this hotel to my friends or family - indeed anyone looking to stay in Paris.", "Date": "January 9, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Denver, CO", "Title": "“Fabulous hotel in Paris”", "Author": "summerchill13", "ReviewID": "UR92211613", "Content": "We arrived in Paris on Christmas Eve. We were delighted to find the Villa Saint Martin was located a short walk from the train/metro station. The hotel is delightful. The room was very clean and the rooms were quiet. We slept well each night. The best part about this hotel is the staff. They are warm, welcoming, and helpful. I would recommend this hotel to anyone traveling to Paris and will look forward to my next stay at Villa Saint Martin.", "Date": "January 8, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Leicester, United Kingdom", "Title": "“Excellent hotel, lovely staff”", "Author": "Aw1989", "ReviewID": "UR92059090", "Content": "My partner took me to Paris as a surprise for my 21st birthday and we spent 3 nights in this hotel. We got caught up in the bad weather/ Eurostar cues and didn't arrive at the hotel until 3.30am, but luckily we were able to get into our room at this time. Our room (some would say small) and en-suite bathroom was beautiful, there was plenty of room for us and both were incredibly clean. The area was very quite which made for an excellent nights sleep! The staff are wonderfully friendly and are happy to help with any problems you have - personally, I had forgotten a piece of luggage, and that has since been sent back to me. They are polite and there is a family-feel. The breakfast is continental with lots of pastries, meats, cereals and yoghurts, all very nice. My only criticism (although very small) is that the breakfast appeared to be the same each morning which some people may not like. The hotel itself is located about 2 minutes away from the Gard'Est train station, where you can easily catch the metro to anywhere in Paris. I would definetly stay here again, and would highly reccommend it.", "Date": "January 7, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "carlisle", "Title": "“super stay 332”", "Author": "scranmaster", "ReviewID": "UR91750235", "Content": "An excellent hotel in a great location, staff were very friendly and helpful, we stayed here over christmas for 3 nights. Will definately stay here again. Super breakfast and well priced drinks list.", "Date": "January 4, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Adelaide, Australia", "Title": "“Fantastic Hotel, highly recommended”", "Author": "GlennfromAdelaide", "ReviewID": "UR91363595", "Content": "what a fantastic Hotel. I wish I could use it to advertise Paris to everyone back home. The staff are so very friendly and helpful, nothing is too much trouble for them. The restaurant is comfortable, breakfast was excellent each day with a large selection of pastries, cereal, breads, fresh fruit salad, meats and cheeses. Fruit juice and tea/coffee also provided. Best value breakfast I have encountered in most places I have travelled. Location is close to everything. Metro (Gare de l'Est) is 2 minutes walk. A selection of restaurants to suit all budgets are similar (try the Indiana on the corner opposite Gare de l'Est for the burgers and Cafe de l'Est just past there for traditional French fare). The walk along Canal St Martin, 2 mins in the opposite direction to the railway station, is spectacular, and typically Parisian. Just wonderful Rooms were traditional Paris, smaller than some cities, but better than I had hoped for. Still very comfortable. Bathroom was a bonus with a 3/4 bath and well appointed. Not huge, but still excellent compared to other Hotels in Paris. If you have an option, ask for a room facing Rue de Recollets, the view is sensational In the middle of a snowy Paris over Christmas/New Year, the rooms were always comfortably warm. I had no problems at all with the a/c, it worked very well. After an initial glitch with the WiFi, which the staff went out of their way to fix, it worked well and was quick and stable. In room TV is mostly French, with CNN in English. One more English speaking (non US)channel would be fantastic, but is only a very very minor point - more a request than a criticism. Lstly, a final mention to the staff, again. They were just great, so very very helpful. Leave all the pre-conceptions about the French attitude behind, these people epitomise service. Thanks for a wonderful stay, we will certainly be back", "Date": "January 2, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Melbourne, Australia", "Title": "“Good value and Great service”", "Author": "tannythestar", "ReviewID": "UR91064811", "Content": "Convenient location - near Gare L'Est which is essential for us as we need to catch TGV in the morning hours. Supermarket nearby and short walk to canal St. Martin which is beautiful and relaxing. Staff were really friendly and helpful especially the lady in the hotel restaurant (she gave us ice, etc. and very friendly eventhough she couldn't speak English). Housekeeping staff couldn't speak English either but also very friendly. The room was really clean and has great amenities provided. Bed was comfy. Wifi was fast and we could borrow a laptop anytime if we need it. Good breakfast included too. The only thing bad thing during our stay was the airconditioning that didn't work so well, perhaps (as they explained) because the weather wasn't so hot outside but in the room was very warm during the day and early night. We had to open the window but there were mosquitoes getting in so we had to keep it close.", "Date": "December 30, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Fernandina Beach, Florida", "Title": "“A great choice for location and value”", "Author": "tvmovielover", "ReviewID": "UR90775203", "Content": "We stayed only 1 night before going on a Seine cruise. Our room was smallish but as said below, we do not lounge in our rooms in a city like Paris. Location is great near both Gare de Nord and Est and many decent small restaurants are nearby. The breakfast was very good. Our only regret was that a week later when we were stranded for 2 extra days by weather, the hotel was already booked and we had to stay elsewhere. We left our luggage early in the am when we arrived in Paris, to go touring and were in the Louvre about 15 minutes after leaving the hotel so do not let its distance from the main sights deter you from staying here. This hotel is great for location and value and we would definitely stay again if reservations were available.", "Date": "December 27, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "mobile, alabama", "Title": "“You will NOT regret staying here:) Delightful!!!”", "Author": "marchellene", "ReviewID": "UR90347571", "Content": "If I could sum the hotel up it would be...customer service is wonderful. The hotel is situated out of the 'center' of Paris but less than a 3 minute walk to the metro station. You can get into the city in less than 15 minutes... We had never been to Paris and were a bit worried about exactly how easy it was to get around. It was NO problem at all. The rooms had modern furnishings, the bed was very comfortable, and the hotel was quiet ( which is a wonderful find in such a busy city!). I am a very light sleeper, and I slept well here. The bathroom was small but according to European standards it was average size. However, we always had a wonderfully hot shower, and great water pressure. Our linens were refreshed daily. The hotel was warm, accommodating, and they spoke perfect English. Oh and FREE INTERNET. We really appreciated that. Kristina was wonderful!! She was one of the staffers that made us reservations at a restaurant we wanted to try. They also arranged our taxi to the airport for an early flight and assisted us with everything we had questions about. My husband and I had a wonderful stay and will return. Thank you Villa St. Martin!!!", "Date": "December 20, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Nashville, Tennessee", "Title": "“A terrific value, friendly and helpful staff, convenient location ... we recommend Villa Saint Martin!”", "Author": "1oldguitarman", "ReviewID": "UR88806234", "Content": "My wife & I celebrated our 40th anniversary with a Paris & London trip. Villa Saint Martin was an excellent value and we were very pleased. The rooms are modestly-sized, but more than adequate. We didn't come to Paris to lounge in our room. The breakfasts were good with a reasonable selection of items. It wasn't the Cracker Barrel \"Country Boy Breakfast\" which makes us Americans so obese, but the quality & range of selections was very good & healthy. All of the front desk staff were excellent: friendly, helpful and with a good command of English. Location is 1.5 blocks from Gare de l'Est, one of the major metro(subway) and rail stations ... with a 2-minute walk, you can be there & use the metro to get anywhere in Paris (just a few minutes & you're downtown). We had no concerns with safety. Some reviews and tourist guides give this region (arondissement) of Paris a slight disadvantage for security ... but we walked the area very late on several nights and felt no concerns. HELPFUL HINT: if you're a tourist, for your first trip to the metro station, make sure you walk there and immediately BACK to Villa St. Martin. Our first day, we returned very late from the Louvre and made one wrong turn when leaving Gare de l'Est ... we walked a good mile before finding our way! After that one instance, Villa St. Martin was always very easy to locate from Gare de l'Est. We would definitely consider this hotel for our next trip to Paris.", "Date": "December 2, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "london", "Title": "“Excellent Hotel, Highly Recommended”", "Author": "othmane", "ReviewID": "UR88509016", "Content": "Stayed in this hotel in NOV 2010, I will have no problem recommending this property, location is great very close to LA GARE DE L'EST and LA GARE DU NORD Checked in in the evening and it was quick , rooms are very clean and spacious, loved the massive flat screen tv, bathroom is lovely, clean with excellent Yves Rocher hygiene products. Checked out early at 6h00 am before breakfast starts and the night recpetionist offered me some nice croissants and a glass of orange juice ( I've been in some hotels of similar standard where hotel staff just put you off by saying breakfast is not served yet ) Overall, very good experience and an excellent hotel to recommend.", "Date": "November 29, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Maricopa, Arizona", "Title": "“Excellent Customer Service!”", "Author": "AZEuroTraveler", "ReviewID": "UR88224364", "Content": "Like many travelers, I relied on customers' previous reviews before deciding to stay at this hotel...and I wasn't disappointed. This small, but very clean hotel is located on a quiet street at the 10th arrondissement, with Gare de l'Est Metro station within a short walk from the hotel. The buffet-style breakfast was more than expected - pastries, cereal, orange juice, eggs, cold cut meats, etc. and multiple-choices of prepare your own hot drinks from their automatic espresso machine. The staff provided excellent customer service. They will provide a laptop for guests to use if you ask - yes, at no charge. \"Les Enfants Perdus\" restaurant located a few feet away from the hotel, was an excellent recommendation to hotel guests. The restaurant's food was delicious & the staff was very accommodating.", "Date": "November 25, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Mesa, Arizona", "Title": "“Best Staff, very friendly..top notch”", "Author": "Chaps5", "ReviewID": "UR87581833", "Content": "Free Wi-fi, clean, good breakfast. Front Desk was exceptional. We went from rome to florence to paris and this hotel was by far the best. I would return.", "Date": "November 19, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "3", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Saint Louis, Missouri", "Title": "“Better than expected!”", "Author": "staciegwiz", "ReviewID": "UR87388192", "Content": "We were very impressed with the hotel - the room size was larger than expected and the bathroom was fantastic! the shower was amazing. we had the king bed and were pleasantly surpised that there were two duvets in the closet, so we each got our own blanket. the room temp was the only problem - it was SO hot. we tried to move the thermostat down but it stayed hot the whole time. ended up needing to open the window. the staff was so friendly and tolerant of our lack of ability to speak French. we got there several hours before check-in and they kept our luggage for us so that we could wander around the city until our room was ready. the hotel itself is very close to a large Metro stop, and in wandering around the area there is plenty of shopping and cafes.", "Date": "November 17, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "London, United Kingdom", "Title": "“Small hotel, great location, amazing staff”", "Author": "ukausexpat", "ReviewID": "UR86397402", "Content": "Small rooms but very clean. Staff were incredibly helpful. Perfect location - mere minutes from Gare de l'Est station, surrounded by conveniences (supermarkets, pharmacies etc) and nearby to a small park and canal.", "Date": "November 8, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Melbourne, Australia", "Title": "“Friendly staff, great location, good breakfasts, and good rooms.”", "Author": "paulhb", "ReviewID": "UR86113683", "Content": "I'd been to Paris before, so my expectations were low. However, when we checked in to Villa Saint Martin, I was pleasantly surprised. The hotel is only a few minutes' walk from Gare de L'Est (we walked with all of our baggage). The neighbourhood is quintessential Paris, and being close to Gare de L'Est means you can get anywhere really quickly. We stayed almost a week, and got aroudn the neighbourhood quite a bit. The staff were amazing - not all of them spoke English well (which you can't really expect in Paris), but they were always friendly and did their best to help. Every request we had was taken care of. The rooms were large by Paris standards, and quite comfortable. Probably the only item I can fault is a problem with the shower that made it difficult to switch on - but this wasn't too laborious. Breakfasts were really good - buffet style with plenty of French fare (cheeses, fruits, pastries, etc). Oh yes, nearly forgot - free WiFi, and it works really well. Next time I'm in Paris, I'll be staying here again.", "Date": "November 5, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Franklin, MA", "Title": "“Just Great!”", "Author": "SnoSearchT", "ReviewID": "UR85161861", "Content": "First time traveling to Paris on a package deal, the Villa St. Martin was the hotel we selected due to previous reviews here, and we were happily not disappointed. Great proximity to the train stations, and off the beaten tourist path (both pluses). Hotel staff was very friendly and helpful. Room 445 was on the small side (imagine a nice cruise-ship stateroom), but with plenty of room for our carry-on luggage & then-some. The twin room beds were extremely comfortable, with 2 windows opening to the street. The bathroom was nicely appointed as well. Everything in the hotel was impeccably clean. (Friends traveling with us stayed at the Westin, and their view was of other hotel windows, not to mention the Westin lobby smelled of sewer-gas). Breakfast was fantastic. If you are trying to decide whether or not to stay here (like I was initially), I'd definitely recommend it.", "Date": "October 28, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Orlando, Florida", "Title": "“Not a bad place?”", "Author": "TCLP2010", "ReviewID": "UR84122549", "Content": "My husband and I stayed here a week or so ago. We paid for a superior room which we were told was a larger room with a view...first tip of advice - unless you want a bigger shower go for the regular room (I blame my travel agent for misleading me and not the hotel). Our \"superior\" room was in a corner with only one window which we had to leave open every night because it was so hot in our room (no AC, I know this is normal, just letting you know about the window). The bathroom was really nice in this room though but again save your money - my opinion. I even inquired at the reception as to the \"superior\" difference and she seemed flustered and did not understand me so I did not insist as HEY, we were on vacation and I argue enough at work, ha ha. We ended up staying here two more nights due to the strike and we loved the regular room we had (this is why I think the difference is the bathroom). It was larger and had three windows viewing the street so it was nice and cool. The shower was so tiny but I know this is normal for Europe...made for good entertainment hearing my husband hit the walls over and over again during his shower. I would say it is about 2ft x 2ft? Most of the staff was friendly though some did not understand or could communicate in English very well but I do not blame them as we are in THEIR country. Only one of the staff members rubbed me the wrong way because he provided misleading information and I told him so. There is a grocery store a couple of blocks down and he insisted they were all far away and suggested we buy water from their bar instead. The blonde lady with the glasses (sorry we did not get your name) spoke English well and was very helpful. She even let me borrow the phone to call Italy when I had to let them know we would not make it in time due to the strike so THANK YOU! Breakfast is adequate but in my opinion overpriced...go out instead. It is 10 euros per person - meats, cheese, rolls, coffee, yogurt, cereal...Free internet was a HUGE benefit as we ended up spending hours on Skype with our travel insurance after we could not get the phone to work. Their location is right down the street from the station which was PERFECT though next time I think we will stay over by the Luxembourg/Saint Michel area if we return but we would consider this hotel again.", "Date": "October 19, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "3"}, "AuthorLocation": "MA", "Title": "“Great Place”", "Author": "pjmk", "ReviewID": "UR82663518", "Content": "We stayed here in January and enjoyed our visit. The continental breakfast was wonderful and the rooms were small which is typical but nicely furnished and very clean. The hotel was a short walk to the metro. It was a very good value and would stay there again.", "Date": "October 8, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Gouda, The Netherlands", "Title": "“the perfect stay for a few days in Paris”", "Author": "HnHsoulier", "ReviewID": "UR81344088", "Content": "Traveling with thalys from Rotterdam to Gare de Nord, the destination on a monday afternoon. Using a small map walking to the Villa Saint Martin within 5 minutes. A Warm welcome by a quality receptionist. The room on the second floor. Nice facilities. Clean and neat. The Hotel is located at the 10th arrondissement. Near to Metro and other good facilities. Nice neighbourhood, many good native restaurants and bistro and bars. A Perfect stay for a few days in Paris.", "Date": "September 28, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "usa", "Title": "“great location, good stay”", "Author": "ross005", "ReviewID": "UR81223410", "Content": "positives: good location close to 2 major transportation hubs great breakfast free wifi friendly staff good value nice area with grocery stores, etc negatives: beds are not supercomfortable tv is only in french no fridge in the room", "Date": "September 27, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "3"}, "AuthorLocation": "North Georgia", "Title": "“Nice hotel, excellent service, free upgrade”", "Author": "HMSoon", "ReviewID": "UR79800398", "Content": "Villa St. Martin is a charming 3-star hotel located just a block from the Gare de l'Est metro station. The room we stayed in was modern, recently renovated, well-equipped, and very clean. It's two windows opened onto the street with views of an across-the-street park. The bathroom was small but adequate with clean towels provided daily. The continental breakfast (included with our room) was adequate. Fresh breads, pastries, and fruit were offered in addition to cheeses, cereal, juice and milk. We stayed here for three nights before taking the train to Annecy. Upon our return, Villa St. Martin upgraded us (because it was our wedding anniversary) to their recently opened 4-star hotel, Secret de Paris. Although we wouldn't be able to afford to stay in Secret de Paris if we return to Paris, we will certainly be happy to stay in Villa St. Martin again.", "Date": "September 16, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Combine", "Title": "“An oasis in a mass of humanity and beauty”", "Author": "RetiredCombineTexan", "ReviewID": "UR79671696", "Content": "Our first trip overseas and thanks to Travel Advisor we found a great hotel for us to relax and get a good nights rest. Couldn't have ask for a nicer hotel for the price. American style rooms with our own bathroom. P.S. The continental breakfast is not included in the price of the room. It cost $10 each. I should have asked and I might have got our money's worth.", "Date": "September 15, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "ALBUQUERQUE", "Title": "“Very friendly and helpfull staff, room was comfortable, breakfast-excellent”", "Author": "Europe333", "ReviewID": "UR78955355", "Content": "Good location-close to Metro, easy access to different areas of Paris, even you have a broad range of interests- sightseeing. Staff: informative, friendly and helpfull people. Room: You have everything necessary to fill comfortable and able to rest. Breakfast: A various of food for different taste.", "Date": "September 9, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "4", "Overall": "1.0", "Value": "2", "Sleep Quality": "3", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Yorkshire", "Title": "“Disappointed and distressed to be turned away at 10pm (our room was pre-paid)”", "Author": "Seabrook29", "ReviewID": "UR78724677", "Content": "I arranged to stay at this hotel as a stopover on our way to and back from Switzerland. Our first stay was good, the hotel is well placed near the Gare de l'est and canal st martin. Our room was up a spiral staircase with no lift which was a little disappointing for a 3 star hotel. The room was very small, but clean and well decorated. So on our return I was quite looking forward to staying there again. We arrived late and exhausted after a very long journey, I had considered ringing to say we would be late, but thought, as the room was pre-paid and we had stayed earlier that week there shouldn't be any problem. When we arrived we were told that they were overbooked and they had booked us into a similar hotel in the Gare de l'est. I was far too tired to get angry, so handed over my hotel voucher (at the receptionist's request) and walked back to the station. The receptionist was not particularly apolygetic or helpful. The hotel we had been booked in was seemed scruffy in comparison, with a slightly surly receptionist and is certainly not somewhere I would have booked myself. I was very upset at the time and wished I had had the energy to get annoyed and express this at the time. I also wished I had kep my voucher, as the 2nd hotel demanded this at first, and I realised that I had given any proof of my payment away leaving us to feel very vulnerable. Reading prevoius reviews I see thgis situation has happened before, and I think that this hotel may do this a lot. Considering I booked and paid in advance I think this is inexcusible.", "Date": "September 8, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "2", "Overall": "3.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "2"}, "AuthorLocation": "New York City, New York", "Title": "“At least they tried...”", "Author": "TravelDarling23", "ReviewID": "UR77343725", "Content": "I recently returned from a trip to Europe and Paris was one of my stops. I had never been there before and was SO excited to go. Well, I got off the Metro at Gare du l'Est, which is a two minute walk from Villa St. Martin -excellent, except I got off the Metro when it was getting dark, with my suitcase in an unfamiliar neighborhood. My immediate impression: wow, this neighborhood is seedy. Besides the general uncleanliness of the city (and I'm from NY), there were quite a few strange men on the short walk to the hotel. Women, just be careful if you are walking about this area by yourself, especially at night. Anyway, we got to our hotel and it was small but welcoming. The reception area is nicely presented and the staff were very nice and answered our questions. One man in particular even looked something up on the internet without us even asking, just so he could assist us. Anyway, we got into the elevator (two petite girls with two suitcases) and squished inside -this elevator is SMALL! We made it to our room, opened the door, and WHAM, the smell hit us instantly. I have to agree with the other reviewers on here -the smell from the canal is VERY unpleasant. We were also greeted by three flies flying around our room -not a good first impression (they were gone the next day and the remaining part of our stay). I did notice, however, that the AC was working and that our room, while not as big as in American hotels, was certainly big enough to move around. The bed sheets also seemed clean and the beds were so-so. The bathroom is maneuverable too, but I have to agree that the shower is very small (and I'm only 95 lbs). I had to open the shower door and soak the floor so I could shave my legs. We had free breakfast included, which was fruit, meats, bread and pastries. My only complaint about it was the very warm milk they had out everyday. Oh yeah, while the front desk service was very helpful, my sister and I were not pleased that every time we put the \"Do Not Disturb/Do Not Clean the Room\" sign, we would come back to our hotel with the sign off of the door, our sheets cleaned, beds made. While this wouldn't bother some people, it really bothered us because we hadn't locked some things away and were concerned with our privacy. What is the point of even having the sign if they're just going to ignore it??? The hotel served its purpose, but as a person who has stayed in many hotels around the world, this is definitely not at the top of my list. The front desk service was good, but it can't make up for the flies, the smell that hits you every time you open your door, the lack of privacy, and the neighborhood. My sister and I have decided that when we next come to Paris, we are going to stay closer to the center of the city.", "Date": "August 29, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "3.0", "Value": "4", "Sleep Quality": "4", "Rooms": "2", "Location": "4"}, "AuthorLocation": "Bucharest, Romania", "Title": "“Cozy hotel, good location”", "Author": "cornelp", "ReviewID": "UR76645174", "Content": "We stayed at this hotel for 6 nights at the beginning of our honeymoon. It is located at 2 minutes walking from the metro station Gare de l'est, on a street one can hardly find without the help of someone who really knows the neighbourhood. The staff welcomed us warmly and gave us all the informations we asked. The room was small as every room / street / table at the restaurant seems to be in Paris. The room was phonically insulated and the temperature was ok. The bathroom was of course small but comfortable. The breakfast was included cheese (Camembert, Emmentaler, spread), cold meats, cereals, boiled eggs, only one sort of fruit (melon), jam, croissants, several types of bread, milk, yoghurt, tea, juice, coffee, etc. We expected a larger array of types of cheese and fruits. Overall though the bed was big and comfortable, the fact that the room, the hallway and the breakfast room were so small is not an advantage for anybody. Our room had no view (the view was on the interior yard). The street on which the hotel is located was quiet though it is close to the railway station.", "Date": "August 24, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "3", "Location": "3"}, "AuthorLocation": "los angeles", "Title": "“Good location, clean rooms and definitely worth another stay”", "Author": "w0rldtrav3l", "ReviewID": "UR76272466", "Content": "The hotel is stone's throw away from the Gare de l'est train station, which connects to a lot of metro lines and we were able to visit all the attractions by just taking the subway. The rooms are small but clean and we were lucky to have the A/C working and we couldn't hear anything from outside so we always had a good night sleep. The lighting could have been better because I had a hard time putting on my make up every morning since they use dimmed/yellow lights and even if I open the curtains, I still don't get enough lighting. The bathroom is small but manageable and the only thing I didn't like about it is that the tub is quite high and I had a hard time getting out of the tub without slipping. For a small bathroom, they should just use a regular shower instead of a shower/tub. Me and my husband were pleased with the breakfast since it starts early from 6:30 - 10 am and since we took some early trips to the champagne region, we were able to eat breakfast at 6:30 since we have to leave the hotel by 7am. The only downside, which I didn't really like is that everytime you go out, you have to give your room keycard to the receptionist and you can take it when you get back but they don't ask for your last name or a security question. I'm just concerned that anybody can just walk in and give a room no. and what if coincidentally they had the room no. right? Also, we always leave the \"do not disturb\" sign out the door, which has translations in french and other languages but somehow, housekeeping would always go in and clean the room for us. It is a nice gesture but other hotels are strict about their clients wishes and if they see the \"do not disturb\" sign, they just leave fresh towels, toilet paper, soap, etc. in a bag outside the door. Since the \"do not disturb\" sign doesn't work for us and since we have to give our room keycard everytime we go out, we make sure our luggages are always locked just in case. Overall, the hotel is nice and clean, location is good, well worth the money and the staff are very friendly, will definitely go back ;-)", "Date": "August 22, 2010"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "Plymouth, Minnesota", "Title": "“best stay of our 3 week Europe trip”", "Author": "sposka", "ReviewID": "UR76074139", "Content": "This is a great hotel. One of the best places we stayed in over the course of a 3 week Europe trip! The rooms are small but very clean and inviting. We stayed in a room that didnt have much noise from adjacent rooms or outside activity. Great continental breakfast too. Staff were all fantastic as well.", "Date": "August 20, 2010"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "4.0", "Location": "3", "Service": "5"}, "AuthorLocation": "Cedar Park, Texas", "Title": "“My husband and I were very pleased with our stay at Villa Saint Martin.”", "Author": "Texastravellers2010", "ReviewID": "UR75539745", "Content": "The location is convenient because its only about a block away from a metro station. Our room and bathroom were small but very nice and clean. The staff were all very helpful and friendly. Before we arrived I had read some unhappy reviews regarding the air conditioning being broken; but I am happy to report the air conditioning was working just fine while we were there. We had breakfast there every morning; it was a nice variety of meats, cheeses, breads, fruits, etc...very yummy and very nice to have it provided for us before taking off for a full day of sightseeing. All in all our stay was a wonderful experience but in our opinion it was the staff that made it wonderful for us.", "Date": "August 16, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "3", "Sleep Quality": "5", "Rooms": "2", "Location": "3"}, "AuthorLocation": "Essex", "Title": "“Lovely hotel but try to avoid room 339”", "Author": "lesley2805", "ReviewID": "UR75214343", "Content": "We have just got back from our trip to Paris. After reading all the reviews for this hotel I was really pleased to secure a booking. It was fairly easy to find, we chose to walk from Gare du Nord and it only took 10 mins, Gare de L'est is about 3 mins so very handy for public transport .We got a really good deal with breakfast included, so we were really pleased with that. The hotel is spotless, not a bit of dirt anywhere. But after taking our luggage up to our room I was so disappointed. The room was so dark and dingy you had to have the light on day and night. The view from our window was the window into another room or a wall about 8 foot high, and we were on the 3rd floor. but as my husband pointed out we were only going to sleep in it. Easy for him to say but he didn't have to have the light on to put make-up on.If we wanted to see what the weather was like we had to go downstairs and look out side What made it worse was a day later I passed one of the front facing rooms that were being made up and it was so light and airy I could have cried. It looked so lovely. The good point about our room was the bed it was so comfy, I wish I could have brought it home with me. All the staff are so kind and helpful, they really go out of their way to help. Especially the four girls on the front desk. So on the plus side, the beds are lovely, the staff are wonderful, the hotel is spotless, the public transport is great. The minus side is room 339 is awful, there are no coffee/tea facilities in the rooms, the breakfast room is too small for the number of guests. On the strength of room 339 I dont think we will go back, but for someone who doesn't mind a dark room the hotel is perfect. So I'm very sorry, but it will be back to the drawing board for next years trip.Which is a shame because everyone is so nice.", "Date": "August 14, 2010"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Pittsburgh, PA", "Title": "“A very Nice Hotel”", "Author": "zebrasky", "ReviewID": "UR73955807", "Content": "Stayed at the Villa Saint Martin at the end of July. From the start I was made to feel very welcome. All the staff that I encountered spoke English. The staff were very helpful with all my questions. The room was rather large as far as Paris Hotel rooms go. It was very clean and the AC was working very well. The bathroom was also a good size and clean. The breakfast was OK. It was a good start the the day. The Metro stop, Gare de I' Est is right around the corner. There are numerous cafe's and shop, all within walking distance. I would stay here again without thinking twice.", "Date": "August 5, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Matteson", "Title": "“GREAT THINGS COME IN SMALL PACKAGES”", "Author": "Charles0729", "ReviewID": "UR72783113", "Content": "My wife and I just returned from Paris (for her dream vacation) and thanks to the staff at the Villa Saint Martin all of her dreams came true. Although the rooms are not as big as they are in the states, that doesn't matter considering the amount of time that was spent there. The service from the staff (Mauriel and Veronique) in particular was more then we could ask for. The hotel stay included a daily breakfast which was just enough to get our day going. The hotel is located less then 5 minutes walk to the Metro station that will zip you all over Paris in no time at all. This small hotel has BIG SERVICE and an even BIGGER HEART. We will return to Paris and will be staying at our new home away from home. Thank you Charles and Monique Room 449", "Date": "July 28, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Budapest", "Title": "“Excellent *** choice”", "Author": "fujimiya_aya", "ReviewID": "UR71862267", "Content": "Me and my friend spent two nights here and we were very satisfied with everything. Location: 5-minute walk from Gard du Est and the nearest underground stationg, 10-minute walk from Gard du Nord, you can reach the main attractions of the city in half an hour. Quite surroundings. Nice brasseries around. General facilities: Air condition, elevator, TV, safe... everything worked properly. Rooms: Very small, but nice and clean with attractive furniture, modern bathroom, towels and shower gel+body lotion changed and refilled every day. Service: Everybody we talked to spoke English. They were very helpful with everything. Breakfast: A basic but quality selection of buffet breakfast served in a pleasant breakfast bar. Everything is refilled regularly, you don't have to worry about being late for your fresh morning croissant. Overall impression: One of our best *** choice in our life. Warmly recommended.", "Date": "July 22, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "2", "Sleep Quality": "1", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Atlanta, Georgia", "Title": "“Don't stay here in the summer”", "Author": "shopping_girl_travel", "ReviewID": "UR71534127", "Content": "I traveled to Paris on business with a colleague and chose to stay here based on the good reviews on trip advisor. The hotel advertised air conditioning but it did not work, the unit blew out hot air, there was no air conditioning. I asked the front desk about the AC several times and was told it was repaired, when it was not. It was very hard to sleep because of the heat, but if you opened the window the noise of the street was just as bad. The entire hotel was incredibly uncomfortable due to the heat, including the breakfast area. Several times I was provided with small hand towels to dry myself with after a shower. The room was so small I was only able to partially open the closet door and the door to the safe, my suitcase took up any space to walk. I ended up checking out several days early and moved to another hotel. Overall, I did not have a good stay at this hotel and would not recommend staying here in the heat of summer.", "Date": "July 19, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "3.0", "Value": "3", "Sleep Quality": "2", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Melbourne Australia", "Title": "“Wouldn't stay here in summer again.”", "Author": "Quilterliz", "ReviewID": "UR70966064", "Content": "We are 3 adults, a female and two males. Stayed here for 7 nights and found the reception staff to be friendly and they spoke English which was good and they were very helpful etc. Room was very small with 3 single beds, bathroon tiny as well, Hotel is in a great location for the Metro, Worst thing was the rooms were very hot and when we asked about the airconditioning we were told it was being fixed, which never seemed to happen. It became very hard to sleep because of the heat, if you opened the window the noise of the street was just as bad. The hotel ran out of towels and we were given small hand towels to dry ourselves with, a bit hard with two males both about 6'5\". Breakfast was good and that was a bonus. My son happened to stretch up and found the ceiling was like rubber, maybe that didn't help with the heat ! We were glad when our stay was up as the heat in the room was terrible. Thank you to the reception staff who were very friendly and even the cleaners were friendly. Would not recommend staying here in the heat of summer.", "Date": "July 15, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Brisbane, Australia", "Title": "“Convenient location, convenient price”", "Author": "Brissie-Student", "ReviewID": "UR70857724", "Content": "When you are in Paris, you shouldn't want to stay in your hotel room. So all you need is a clean little place in a convenient location (ie near a metro stop, and walking distance from Gare du Nord) to sleep, shower, and rest your tired feet. Villa Saint Martin offers all of these things at a great price. Where else can you find a hotel in a safe location for 100 euro/night?", "Date": "July 14, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Cape Cod", "Title": "“Great location!”", "Author": "Laurem29", "ReviewID": "UR70010192", "Content": "I booked this hotel for two nights for my mother and I June 28 & 29. It was a great spot, stones throw to Gare de l'Est (train station). Learning the metro is so very simple and it's the cheapest way to get around Paris. Our room was nice, windows that opened onto the street to let in the breeze. We didn't find air conditioning in our room so expect to be very warm! Still the room was clean and comfortable. The bathroom was fine, no complaints! The staff does speak English very well and were very helpful. The breakfast was good. Nice assortment of pastries and other continental breakfast items. We were only there for 2 nights so we didn't get bored with it. We actually found it very enjoyable to simly walk downstairs rather than find a spot outside the hotel. I would definitely recommend a stay here. Enjoy!", "Date": "July 7, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Bucharest", "Title": "“Good price,very nice & friendly staff,near park & canal Saint Martin,clean rooms,good breakfast,we enjoyed our stay.”", "Author": "Caralumba", "ReviewID": "UR68054582", "Content": "Quiet location, 200 m to Gare de l'Est, 100 m to metro station, nice park across the street, 150 m to canal Saint Martin, 20 min.walk to Louvre. Nice,clean room,large enough for two(for what i've heard about Paris hotel rooms). A nice surprise was the breakfast (continental),a short version of a swedish buffet. Very nice staff, friendly and helpfull.I recomend it.", "Date": "June 20, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Sleep Quality": "4", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Oak Lawn, Illinois", "Title": "“clean, friendly, close to transport, nice find!”", "Author": "seemorun", "ReviewID": "UR68002562", "Content": "I booked this after reading reviews on this site and I found them to be quite accurate. It's a cute hotel with very friendly and helpful front desk people who speak English. Your windows open to the outside and you get a lovely view of Gare d'Lest (sp?), which is also quite handy for travel. We took a circuitous route to get there and found some unsavory streets along the way, but you'll find that in any big city. Walk out of the hotel to the right and there's the canal with shops and restaurants and you get a feel for the city. I would stay here again. One caveat: if you're bigger than me, which is most people as I'm 5'7 and 160, you're going to have trouble showering. It's tiny, like phone booth small. If you drop something you have to get out to get it. For the price, location, amenities, I thought it was fair and I was pleased with our short stay.", "Date": "June 19, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "4.0", "Value": "3", "Sleep Quality": "5", "Rooms": "2", "Location": "5"}, "AuthorLocation": "Dubai", "Title": "“Good, clean, Friendly hotel”", "Author": "abcdefghijkl", "ReviewID": "UR67437492", "Content": "Pros- Clean and comfortable rooms. Comfortable bed ( a very important factor) Friendly staff Good location right next to the a major station Free wifi Cons- Very small rooms Small breakfast room Nothing exceptional about the experience Breakfast can get repetitive, especially when you are staying for more than a few days", "Date": "June 14, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Salt Lake City, Utah", "Title": "“Easy walk from Gare d'Nord and Gare de l'est”", "Author": "Adventurebuzz", "ReviewID": "UR65537067", "Content": "Had one night in Paris. Arrived mid-day on Eurostar Gare d'Nord. Walked maybe ten pleasant minutes to Villa St. Martin. Very nice three-star hotel -friendly staff, nice room, close to metro for zipping around the city. Next morning easy walk back to Gare d\"Nord and a 45 minute RER to CDG. Very uncomplicated and better than hanging at a CDG airport for the night.", "Date": "May 28, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Notts uk", "Title": "“A Gem of a Hotel”", "Author": "NottsukMichel", "ReviewID": "UR64714240", "Content": "This was my 4th stay at the Villa St. Martin and I can honestly say it will not be my last. It is such a friendly hotel. The staff are always polite and all seem happy to help you. Even when staggering back at 2.30 in the morning you are greeted with a friendly smile. The rooms are always impeccably clean.(a word of thanks to the troupe of cleaners). The breakfast is amazing. So much to eat. Not your croissant and jam here. Lots of cooked meat , cheeses , cereals , bread. croissants , eggs, fresh fruit salad , fruit juices and copious amounts of hot tea , coffee and chocolate. Location is spot on. Metro Gare de L'Est line 4 gets you to Les Halle of Chatelet in no time and buy a Mobilis day ticket 5 euros 80. good value in what is an expensive city. Whilst at the Villa St Martin turn right out of the entrance and check out the Canal St Martin. A hidden part of Paris well worth exploring. All in all this hotel is a perfect place to stay. I would recommend it to everyone.", "Date": "May 19, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Yorkshire", "Title": "“Lovely hotel, fantastic find.”", "Author": "treesofgold", "ReviewID": "UR63190647", "Content": "I booked this hotel for two nights for my teenage son and I after extensive reading of tripadvisor. We found it to be even better than expected. It is closer to Gare de l'Est than I had thought -- we could see the station front clearly from our hotel room window. This meant that we had lots of facilities on the doorstep -- pharmacy, baker's etc. at all hours, plus of course the metro station. There was a good chinese buffet cafe-bar near the station that seemed a magnet for locals (12 euros a head for evening meal). Our room was nice, lots of windows with wrought-iron balcony-effect railings, spotless white sheets and duvets, pin-operated safe. The bathroom was fine -- small shower cubicle but no smaller than I've seen in some houses in the UK, good shower with lots of hot water. Very modern-looking washbasin -- the kind where the marble/stone basin sits on a wooden stand; colourful tissues; big fluffy towels replaced every day; yves rocher shower gel and body lotion also replaced every day. Very friendly and helpful staff kept everyone's luggage for them on the last day. The evening receptionist went out of his way to get me some ice for my hayfever eyes. I bumped into a housekeeping lady and asked for an extra pillow and she delivered one to me not long after. Breakfast had everything we might want, including fruit salad, yoghurt and herbal teas. The bar was open in the evening and the reasonable prices were clearly displayed in the hotel room -- quite reassuring considering I had paid 4.50 euros for a tiny 25cl Evian in one bar in the city.... This hotel was a nice place to come back to at the end of a busy day walking round the city (although my son would have liked more TV channels). I would definitely stay here next time I go to Paris.", "Date": "May 4, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "san diego", "Title": "“Best kept secret in France”", "Author": "InSanDiego", "ReviewID": "UR62738469", "Content": "After months of research and planning, we (my wife, son and his new wife) decided to stay at the the Villa Saint Martin on the Paris leg of our trips across Europe. It was the best decision we made our entire trip. We stayed 4 nights at the hotel. What a hidden secret!. First off, ALL of the staff speak English. That helped us so much. A young man by the name of \"Willie\" greeted us and throughout our stay, helped us so much with directions and suggestions on here to eat and better yet.... where NOT to eat. The last thing you want on a trip abroad is stomach problems. The next best gem about this hotel is the location. If you are coming by train, it is only a block away from the Est. Train Station. The underground Metro is also only a block away. My wife and I got a room on the 5th floor facing the street and my son and his wife had a room on the 4th floor, facing the courtyard. We had no complaints. It was exactly what we wanted. Two huge windows that opened up above the streets of Paris. The sounds and sights were just what we wanted. The room was cleaned daily along with fresh linen. There is a very small cafe off to the side of the front desk. There they provide a continental breakfast for 10 Euro a person. I would suggest eating there each morning because at 10 Euro you aren't going to get a better price on the street for all the different selections available. The only suggestion I would say is to get there early because seating is tight and once it fills up, it's kind of an problem moving around and accessing the food and drink. After hours you can always get a Coke or hot tea from this location. The bar is open in the evening, but who stays in their hotel room in Paris in the evening? Your in Paris, get out, see the sights and hear the sounds of this historic city. The elevator is a classic European one. Folks it's small... get use to it and move on. Two people and maybe some luggage will fit but it eventually gets you to your floor. My son loved his room. They kept the window open all night and never heard a sound. Now the street side of the hotel is a different story. Don't expect the city to shut down at 10PM because you are going to sleep. If you keep your windows open you will be awaken by school children across the street in the morning. There are three hospitals in the area and the French emergency vehicle drivers love to travel with their sirens on, coming and going. So you will hear the High, Low, High, Low sirens passing on nearby streets. If this bothers you, the windows shut out 98% of the noise out once they are closed. We would recommended this hotel to everyone. It's not a Holiday Inn. It is a traditional French hotel designed to European standards, not American. So everything is small but everything was very comfortable and CLEAN... Very Clean. Our check out bill was exactly the amount we agreed to on the Internet sight and not a penny more.", "Date": "April 29, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "NORTH EAST ENGLAND", "Title": "“A LIITLE GEM”", "Author": "DMAXNorthEastEngland", "ReviewID": "UR60304510", "Content": "Stayed for 4 nights. Excellent locationn, 2 minutes walk from Gare de Lest. Very comfortable. The staff were very helpful, nothing being too much trouble.Small bar to relax in after a hard days sight seeing. Excellent breakfast. Would we go again?, most certainly.", "Date": "April 4, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Rotterdam, The Netherlands", "Title": "“Villa Saint Martin, Paris”", "Author": "MartijnG3", "ReviewID": "UR60155316", "Content": "Hotel is located near the train station Gare De L'Est which is one of the biggest stations in Paris, so the location could not have been better. Rooms are smail but for a hotel in Paris there is nothing to complain. Staff is friendly and the breakfast buffet is oke.", "Date": "April 2, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Manchester, United Kingdom", "Title": "“Terrific location - Paris at your feet.”", "Author": "Kentish_9", "ReviewID": "UR60151915", "Content": "The hotel is easily reachable by metro from CDG Airport to the north. Don't get the bus, if you don't have to. It's a long journey and very difficult to find the right spot to stand and wait at the airport. The hotel itself is perfectly located near to Gare du L'Est train & metro station. The metro is very extensive and wide-ranging meaning you can reach almost anywhere in Paris within 30 mins (give or take a few change-overs). The staff were very friendly throughout our stay and the room was very clean. We stayed in a \"superior double\" and were very happy with it. We had a huge double bed and a large flatscreen tv on the wall for downtime, although the only english channel was CNN. The room had thick double glazed windows which excluded almost all noise - we slept very well indeed. Would definitely recommend for excellent location, cleanliness and price!", "Date": "April 2, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "3", "Rooms": "5", "Location": "5"}, "AuthorLocation": "newjersy", "Title": "“Fantastic staff, comfy bed, conveinent location”", "Author": "gypsynewjersy", "ReviewID": "UR59039829", "Content": "I had found this 3 star hotel through Gate One Travel. It is an excellent value. The breakfast was plentiful, the staff accommodating, and the location convenient to the metro. The rooms were clean with an extremely comfortable bed and cozy duvet. For me the best feature of this hotel was the staff. They are friendly and cannot do enough for you to make sure that you have a pleasant trip. I would definitely stay here again.", "Date": "March 20, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Ventura, Calif", "Title": "“Not Dissapointed with Trip Advisor Reviews of this Hotel”", "Author": "foodsniffer", "ReviewID": "UR58147937", "Content": "We booked Villa St. Martin hotel on a recent 4 day vacation to Paris. I will say that the other reviews of this hotel are just about right on and we were not dissapointed. Took RER train from DeGal, (sic?), airport to Gare du Nord train station and then walked to hotel with our luggage, (about 1/2 mile), without any problem. We compared the neighborhood that the hotel is located in to Greenwich Village, NY and it is safe, close to metro stop, and the scenic canal, with plenty of interesting shops, walking, etc. in the area. Hotel itself is clean with small but adequate rooms- typical Eurpopean. Great staff, and a very good breakfast each morning is included in room rate, (at least ours). To get to anywhere in Paris, just walk 2 blocks north to the Gare du Est train station and hop on the Metro.Highly recommend this hotel if you are looking for modestly priced stay in Paris.", "Date": "March 9, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Glasgow", "Title": "“Nice Clean But Small Room”", "Author": "smudge17", "ReviewID": "UR57973038", "Content": "We stayed here on Friday 5 March 2010. We were here for our 10th wedding anniversary, i booked the flight and room together with directline holidays and got a very good deal. The hotel is very nice and is well decorated, the room is very small with just enough room for the bed. The bathroom was small but recently decorated and the shower was good, the staff were all helpful. We had breakfast in the hotel and this was fresh and very good not like you get in some hotels in the uk. We would have no problem staying here again if we ever visited paris again. The actually room rate was 146 euro per night. Marc Bradley", "Date": "March 7, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "gulf shores al", "Title": "“A great hotel”", "Author": "tbear0123", "ReviewID": "UR57704651", "Content": "The hotel was resonable priced and in a good location to the metro to see all the sights. Andrea and Willy the front desk staff was very helpful and informative. The rooms was spacious and clean. We will definetly stay here again while visting Paris.", "Date": "March 4, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Leeds, United Kingdom", "Title": "“This hotel made our stay in Paris even greater and more enjoyable...”", "Author": "sisisico", "ReviewID": "UR57667421", "Content": "This is a great place to stay in. I stayed there for five nights in Feb 2010. Everything about it is great... location, cleanliness, service, breakfast, etc. The first room we were allocated had a standard bed which was pretty small. However, I had only to report my unsatisfaction about it to the reception that I was allocated another room with a bigger bed. Overall, a great place to stay in while enjoying the city of lights. The only things we complained about were the no tea/coffee making tools in the rooms and the TV channels which were all in French (except CNN). The breakfast was amazing. In fact, it was much better than the one I usually have at home. It consisted of French bread, butter croissant, chocolate croissant, apricot jam, cherry jam, cheese, French brie, eggs, corn flakes, and cold and hot drinks. We enjoyed it. This is all I can say about this place... enjoy your stay", "Date": "March 3, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Location": "3", "Rooms": "4"}, "AuthorLocation": "Orange County, CA", "Title": "“Great value”", "Author": "TravelingCeres", "ReviewID": "UR54145372", "Content": "My family tries to travel every year; we watch our budget carefully when we do. This was our first trip to Paris and we were not expecting a lot from the hotel since the rates were pretty low. Villa Saint Martin surprisingly exceeded our expectations -- it is a small hotel with small rooms (typical Paris), but the room and the bathroom were adequate and clean, breakfast was plentiful, walking distance to Gare de l'Est, Canal St Martin and restaurants along the canal, and the staff were amazing and exceptionally helpful especially Caroline. Would stay there again.", "Date": "January 23, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Brooklyn, NY", "Title": "“Convenient, clean and affordable”", "Author": "slbklyn", "ReviewID": "UR53878865", "Content": "I just spent a week at the Villa St. Martin with my husband, on a much-needed vacation. It was very easy to find, located very close to the Gare de l'Est train station, which was great for two jet-lagged individuals. We came in from Orly and took public transit all the way there, as well as to CDG on the way home. While close to public transit and walking distance to a ton of stuff, the neighborhood was pretty quiet and safe. It is blocks from the Canal St. Martin. Our room, which was on the 4th floor and faced the street, was small but totally adequate. I wasn't expecting anything fancy, just a clean place to sleep. When we checked in I asked the woman at the front desk if we could switch from a twin room to one with a double bed, and she recommended that we keep the twin because the room was bigger. I thought that was nice, and we managed just fine by pushing the two little beds together. We had plenty of space for the two of us, and we weren't there to hang out in a hotel room anyway! The room also had a safe, which was helpful. The bathroom was clean and super tiny. We had the smallest shower I had ever seen, and, being tall Americans, it was a bit of an adjustment. But honestly it was fine - as I said, cleanliness was paramount. The staff were all very nice and accommodating. Every interaction we had, with anyone from the front desk to the housekeeping staff, was pleasant. We made an effort to speak French (we both speak enough to get by) but they always took pity on us an spoke to us in English. Breakfast (served every morning from 6:30-10) was great. There was a good selection of stuff: ham, cheese, cereal, pastries, fruit, yogurt, coffee, tea... It was nice to know that at least one meal of the day would be taken care of without having to think too hard! The only real issue I had with the hotel (and it was minor) was that we were dealing with major jet lag the first few days and wanted/needed to sleep a bit in the morning, but the housekeeping staff were overzealous and kept knocking, even if the \"do not disturb\" sign was on the door. I appreciate that they wanted to make up the room every day, but isn't that what the sign is for? To indicate that you don't want to be disturbed? But overall, I would recommend this place wholeheartedly for anyone visiting Paris on a budget. I loved how convenient it was to so many things, and it was a clean, quiet, friendly place to stay.", "Date": "January 19, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "3", "Rooms": "5"}, "AuthorLocation": "St. Louis, MO", "Title": "“Great Experience, Great Price”", "Author": "Lisac2333", "ReviewID": "UR53371463", "Content": "We stayed here in January 2010 and were extremely please with the accomodations. The rooms were clean and well kept and the staff was WONDERFUL. They were so willing to help, expecially because we spoke little french. It was a great hotel and I would recommend it to anyone traveling through Paris. It is close to the major train station which is nice as well. It is a little far from some of the major attractions like Eiffel Tower and such, but it is close to Notre Dame and the Marais district (We were able to walk to Notre Dame in January). Great Hotel, Great Price.", "Date": "January 13, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Location": "4", "Rooms": "4"}, "AuthorLocation": "Overland Park, Kansas", "Title": "“Excellent experience here---Again”", "Author": "bobby_d-1", "ReviewID": "UR51463588", "Content": "Family owned property staffed by some family members. Extremely helpful. Good English. Convenient to the Metro, Gare du Nord and Gare de l'Est. Boutique shopping and restaurants to the east toward the canal. Be careful to the west--Ave. Magenta. Lap tops available on request.", "Date": "December 18, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Freiburg", "Title": "“Nice hotel”", "Author": "knoffeltock", "ReviewID": "UR51163633", "Content": "Nice Hotel. Next to Gar de l´est. Clean. Nice Rooms. Fruit salad for Breakfast...mjam. Friendly staff. We felt very comfortable. The only negative aspect was a big spotlight outside which lit though our window during the night.", "Date": "December 13, 2009"}, {"Ratings": {"Service": "2", "Cleanliness": "4", "Overall": "2.0", "Value": "2", "Location": "2", "Rooms": "3"}, "AuthorLocation": "London", "Title": "“Poor value for money”", "Author": "deXavier", "ReviewID": "UR50432106", "Content": "This hotel was too expensive for what it is - which should be a cheap place to stay near Gare du Nord. It's in a fairly dodgy area - as I am sure I should have anticipated, being so close to both north Paris stations. Staff were perfectly pleasant and looked after my bag whilst I went off to explore Paris. But there is no where very good to eat near by and as I say, it's not somewhere where you want to be walking back to after dark on your own. Room was clean but tiny. On reflection I would have been much better off being further out, for less money, and getting the metro in to town.", "Date": "December 1, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Sacramento, California", "Title": "“Oh yeah, stay here.”", "Author": "flip52483", "ReviewID": "UR50380560", "Content": "This is a great place to stay. This was the second of the seven hotels that we stayed in when we visited France and this was was the best as far as location, size of room, and cost (in Paris). The neighborhood is good, the metro/train station is very close by and a short ride to Paris center. We stayed here for two nights out of the nine that we spent in Paris. The last six nights were at Paris 18 after four nights of seeing the Loire Valley. We highly regretted staying there after staying here the first few nights.", "Date": "November 30, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Location": "5", "Rooms": "4"}, "AuthorLocation": "London", "Title": "“Lovely Hotel”", "Author": "Aris_UK", "ReviewID": "UR50291698", "Content": "Have arrived to that lovely hotel in Paris, been greeting by friendly staff. Nice and clean rooms. Lovely breakfast, plenty of food. Excellent service. Very local to the international train station, also close to central Paris.", "Date": "November 29, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "3.0", "Value": "4", "Location": "5", "Rooms": "3"}, "AuthorLocation": "New York", "Title": "“Clean and good location”", "Author": "TartTart", "ReviewID": "UR48719138", "Content": "This hotel is better than I expected. It is clean and good value. 5 minutes walk to the subway station. The continental breakfast is great. But the hallway is very narrow and dark. The heat is either too hot or none, never come to the comfor zone.", "Date": "November 7, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Location": "5", "Rooms": "4"}, "AuthorLocation": "augusta", "Title": "“a very nice experience”", "Author": "meg-diana", "ReviewID": "UR44758674", "Content": "sept 16-21 2009 we stayed recently at the Villa St Martin and were very pleased. The hotel desk personnel were always helpful and kind, The rooms are small but basically all you need, we didnt spend much time in there except to sleep. The rooms are not appointed in any fancy elaborate manner but are all you need, the linens are changed daily, rooms were clean, and staff kind and helpful. The bathrooms are small and the showers are very small, so some individuals may find that difficult, call and ask if there are options regarding kinds and size of bathrooms and showers/tubs. The rooms are all air-conditions and controls are in each room( not the case in many hotels, some centrally controlled). The hotel has a lift and a large area to store luggage pre and post check-in. The hotel provides a very nice breakfast( not so in many hotels) and there is a small bar available. The hotel is one block from the Metro, Train station and cabs are available there. If you need a cab, you can walk over to the metro and save 5 Euro right then. There is a large pharmacy in the station, many small cafes across from the station and in easy walking distance. All in all, we wanted a hotel not on a major road, a safe hotel, close to transportation services, and a helpful staff --> we found it. we will stay here again. This is a fine value and if you are going to see Paris and not live a week in the hotel this is a good choice, a great choice", "Date": "September 26, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Ellicott City, Maryland USA", "Title": "“Excellent Place & Worth very Cent of Money”", "Author": "Sultan09", "ReviewID": "UR44661122", "Content": "It was our greatest pleasure staying at this hotel. We discoverd this place via Trip advisor. You cannot ask for more. Extra clean, comfortable room, excellent hotel staff who are very pleasant to solve any problem.", "Date": "September 26, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Location": "3", "Rooms": "3"}, "AuthorLocation": "Scotland", "Title": "“Good value for money”", "Author": "GLCM87", "ReviewID": "UR42728159", "Content": "Nice little hotel, quiet and clean. Not in the best of areas, but we had no problems at all. Really handy for gare du nord and gare du est stations and easy to walk down the main parts of paris as well. The rooms are very small- tiny in fact but are clean and secure. It's not the most luxurious hotels but for the money its good value and I would stay there again.", "Date": "September 18, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "3.0", "Value": "3", "Location": "2", "Rooms": "1"}, "AuthorLocation": "Bath, UK", "Title": "“Not a nice part of Paris and very small, but very clean and friendly”", "Author": "NickBrenton", "ReviewID": "UR40125405", "Content": "My wife and I chose the Villa St Martin for our honeymoon in Paris for 5 nights. Now we didn't want to spend a lot on a hotel as we wanted more money to spend in Paris, our two finalists were a hotel near the Luxembourg Gardens and this one, we chose this one as it was a touch cheaper and from the website looked fantastic. Probably a good move now I think about it! I emailed the hotel before we went to confirm the reservation as it was our honeymoon and I didn't want to be chucked in a 2 star down the road as some people were! I received a lovely email saying it was confirmed and thanks for choosing them for our honeymoon, they were honoured. On the day of our wedding we travelled to Paris and our flight was delayed 2 hours, by the time we walked through a busy airport terminal and two metro stations we managed to get to the hotel at 10:30pm instead of 7:00pm of course not the hotels fault but we were exhausted. When we got there we were greeted by a charming woman and a lovely foyer, the hotel looked fantastic, and we were then congratulated on our wedding that day but received nothing? I know it's a little bad to shave points for not upgrading or something similar but we didn't receive a thing, no flowers, no champagne, no room upgrade, nothing! Everyone I know who stayed in a hotel on their Honeymoon has had something! The hotel was quite empty as well so a room upgrade would have been ideal! We shrugged this off and were sent up the lift to our room, after walking around the 3ft wide corridors for 15 mins sweating in the Parisian heat and lugging a 20kg suitcase around I went back down only to be told we were on the other side of the hotel on the top floor, there was no lift this time and we had to walk up stairs, we stayed optimistic and decided it was our honeymoon and we would forget that as it had been a long day. When we reached our room I couldn't believe how small it was, I live in a relatively small house but this room and bathroom was no bigger than our front room, there was about enough room for the furniture and one person comfortably approx 10x10ft. The Bathroom was even smaller and probably about 5ft by 5ft. I had to sit on the far front edge of the toilet seat as my legs hit a wall and the shower to the left and right of me, I also had to step in the shower sideways and squeeze in being 6'1\" and 18st. My wife is 5'0\" 8st but she didn't like the fact there was nowhere to store her shoes and dresses! We thought about asking to move but we didn't want to be rude and we were so tired from a wedding day and travelling, we'd also unpacked. I stretched up one morning out of bed and my hands hit the ceiling, it turned out to be a thick rubbery plastic membrane and not a white painted ceiling, it was like a massive trampoline on the ceiling!! One accidental slash and the whole ceiling would come down raining plaster and stones and spiders everywhere!! My guess is that it was a cheap way to cover the AC units but it was very tacky and dodgy, it didn't make the rooms’ very sound proof either! Our window view was a random apartment and part of the hotel as well as the hotel courtyard which consisted of a scabby stone path and dirt/weeds; there was also a fantastic display of old bathroom sinks on the floor that seemed to be doing nothing. The breakfast was fantastic and there was a selection of cheese and ham, boiled eggs, croissants, pain au chocolat, melon, yogurt, cereal, bread, coffee, OJ. My wife and I loved this; it fuelled us up nicely for an early start in Paris. There was also a big screen with the news in French but it let you know the weather for the day which was handy! Everyone in the hotel was friendly and smiled and was very helpful and our room was cleaned every single day with towels and sheets being replaced without us even asking, it really was an immaculately clean hotel, the cleanest I have stayed in. The area around Villa Saint Martin is a tad dirty and seedy. There is a lot of rubbish about and it's a predominately muslim/african neighbourhood. There were a lot of homeless people sleeping on the streets and there was a surprising amount of dog mess on the pavements. There was also the odd prostitute hanging around (Probably a good point for some?). It was quite smelly as well (You know that holiday smell of sewage that drifts by your nose while walking?) In the day it was just run down Paris but at night it seemed a little rough. Towards the Canal was a lot better and there were various bars and bistros and a big Supermarche but again at night this was a tad rough. The area is right next to Pigalle the red light district of Paris so it's probably expected but when you've spent the day wandering the Latin Quarter or St Germain Des Pres you long for clean streets and other tourists. I know again it's not the hotels fault but this is a main aspect of choosing a hotel and I think location is a biggy! The Gard D L'Est is 3 mins walk and this is a main stop on the No 4 Metro line which is your main route into Paris' centre so getting into Paris was very easy. It was also relatively easy to get the RER to the airport from here so transport wise you’re in a good spot. I would say this hotel is perfect for those on a business trip as it's close to train station and airport and a quick trip to the centre. Or if your on a Stag Night/Hen Night in Paris it's ideal as there are bars and restaurants and the red light district, it's a 30 min walk to Paris nightlife as well I believe. It’s definitely not for a honeymoon couple and it's not for the retired couple looking to see Paris. If you like spending time in your hotel room with your Wi-Fi and 10million channels id say no as well. Clean, cheap & cheerful but very small and not nicely situated. Def not #148 of nearly 2000 hotels in Paris. Sorry to write a long one but I feel its necessary, hope this helps. Feel free to email me with any questions on [--] I don't have any photos of the hotel unfortunately, I only do that when i'm in a stunner!", "Date": "September 8, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Location": "5", "Rooms": "3"}, "AuthorLocation": "Western Australia", "Title": "“Excellent Paris Hotel and highly recommend it for the average traveller”", "Author": "Sandgroperwun", "ReviewID": "UR37126536", "Content": "My wife and I come from Western Australia and after four weeks in Russia, Finland, Estonia and London spent six enjoyable nights at Villa Saint Martin Hotel. Staff were very friendly and helpful. All spoke excellent English and helped us learn some basic French phrases for using elsewhere. Clean quiet hotel well located to Eurostar, metro, buses, canal, park, restaurants, small shops and the big Franprix supermarket. Great breakfast included. We had a superior room which was adequate in size and had a comfortable bed - we have experience standard rooms elsewhere and found them too small so no longer risk such rooms and pay a bit more for a larger room. The passageways were very narrow but accept that as \"a Paris smaller hotel\". No refrigerator in room was inconvenient. But overall we loved our stay at this hotel and would not hesitate recommending it. We also really appreciated the hotel arranging the transfer by excellent small limo type bus to the Airport.", "Date": "August 9, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "La Creuse", "Title": "“Great Hotel, Good Value”", "Author": "moulins23", "ReviewID": "UR36475604", "Content": "We have just returned from a 2 night stay at this hotel and for the first time I was so impressed I have decided to write a review. We booked this trip through Promo Vacances so the deal incuded breakfast. Unlike some previous reviews we thought the breakfast was excellent. Living in France we did not expect eggs and bacon but thought the typical continental fare was of a good quality with sufficient choice to please most people, the bread was particularly good. Having read the problems some peole have experienced with showers, I telephoned the hotel prior to our arrival to explain my husband is a large man and we consequently received a room with a large modern shower. The room was fairly small, typical of Paris, but the bed was huge and the room was clean and comfortable. We liked the location of the hotel and found the multi-cultural area to be interesting. There were plenty of restaurants nearby ranging from cheap and cheerful to \"OMG\"!! Just a few minutes walk there was also a \"MonoP\" selling a good range of sandwiches, salads and snacks, as well as normal groceries, open from 9am to midnight. There are a good selection of bars which are a great place to people watch. The metro station is about 100 metres from the hotel and the open tour bus stop is even nearer. We did this tour on a 2 day ticket and found it good value for money, but only if you do the 2 day tour as there is only 3 euro difference per person between 1 day and 2. All in all. if you are considering a trip to Paris, I cannot recommend this hotel too highly..", "Date": "August 2, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "London, United Kingdom", "Title": "“Very good stay”", "Author": "searcher008", "ReviewID": "UR35700672", "Content": "Having stayed in most areas of Paris it was a joy to find this hotel after such a long time.As with most hotels in Paris the rooms are on the small side but Caroline the receptionist arranged for us to have a pleasant larger front facing room for a supplement.Caroline was most helpfull to us on our stay,the hotel is very close to the Metro and the Gare De L'Est and numerous bus routes.I hope to visit the companies new hotel situated near the Gare St Lazare later in the year.", "Date": "July 24, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Location": "4", "Rooms": "3"}, "AuthorLocation": "Portsmouth", "Title": "“Friendly, well located hotel - a parisian gem”", "Author": "angep1969", "ReviewID": "UR34072040", "Content": "I booked this hotel via Airmiles, having looked at many reviews of many hotels in Paris. It is fair to say that Parisian Hotels are not renowned for their roominess and the Villa Saint Martin is no exception. I'd booked a double and it was tiny - even to the extent that the bathroom was so small it contained a shower only - no problem with this except that it was so squeezed in that my partner was unable to actually get into the cubicle. No matter though as, upon booking in, the incredibly helpful receptionist had pre-warned us that the room was very small and offered to swap us to a twin room the next day. This was duly sorted out whilst we were out sightseeing and the new twin room was a vast improvement. Much bigger and with a fancy shower you could fit two into!! The hotel is located within a stone's throw of Gare De L'Est and about a 15 minute walk from Gare Du Nord - so was ideal for us as we travelled in by Eurostar. The area is not the swankiest Paris has to offer but I felt safe and secure at all times and there was a good selection of bars/restaurants nearby. (Would recommend La Bulle as a place to eat - not cheap but the food was stunning - and just a short walk north up the canal). we had continental breakfast included which was plentiful and just what I would expect with the usual selection of cheese, ham, fruit, bread, croissants etc. Where the hotel scored highly with us though was with their staff - all spoke excellent English and couldn't have been more helpful. An absolute joy for Paris where, in the past, I have felt the locals can be a bit stand-offish. Would have no hesitation in recommending this hotel but would suggest you book a twin rather than a double as you will get a lot more room and comfort this way.", "Date": "July 6, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Location": "3", "Rooms": "4"}, "AuthorLocation": "new orleans, la", "Title": "“nice but small rooms”", "Author": "deuce1011", "ReviewID": "UR34039447", "Content": "room was clean and comfortable, but small. very close to metro stop and gare de l'est (big train station). breakfast was very good, with lots of choices. nice hotel for the price, especially if you dont plan on spending a lot of time in the hotel room.", "Date": "July 6, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Location": "3", "Rooms": "3"}, "AuthorLocation": "Sydney", "Title": "“Nice hotel with convenient acces to metro and tourist bus”", "Author": "mwilliams205", "ReviewID": "UR32775924", "Content": "The room was tiny but we were told to expect that in Paris. Lift is very small and if you have luggage 2 people cant fit in. Hallways very small, even 2 thin people would have trouble passing each other. But that is Paris and we were amused by all that,not upset. Breakfast was typical french fare, lots of croissants, hams, fruit, yoghurt. Coffee was from an instant machine which we didnt like. Staff were very helpful and very nice. If you are arriving from London on eurostar, you can walk to the hotel. Its also close to the Gare de L'est (now famous because it featured heavily in the french movie AMELIE) and close to the tourist bus. Nice cafes in the area but be careful at night. By day the area is good but at night, we didnt wander around as it is not a touristy area and lots of shady characters hanging around. When you go out at night, order a taxi from your hotel. Coming from australia, the hotel was very expensive but that is Paris and we were very happy with our stay there.", "Date": "June 21, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Location": "3", "Rooms": "3"}, "AuthorLocation": "California", "Title": "“Clean, comfortable base of operations. Helpful staff.”", "Author": "vballmdbkr", "ReviewID": "UR30546507", "Content": "Caroline at the front desk was super helpful and went out of her way to ensure we had a great stay. She emailed me before we left the States to make sure my needs were met. We are used to large open rooms and this was our first time in Paris so the size of the rooms we small for us. They were clean and comfortable with new bathroom amenities. The Breakfast that was included was Ok but it never changed and we would have liked a little variety. All in all it was a good place to stay and was only 1 block from the Metro (Master the Metro as it is the absolute best way to get around) Great Cafe's in the neighborhood (Piano Bar) made finding a good meal easy after running all over the City and returning to the Hotel", "Date": "May 22, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Location": "3", "Rooms": "3"}, "AuthorLocation": "Brisbane", "Title": "“Small but Cozy”", "Author": "BellaAthena", "ReviewID": "UR29730778", "Content": "Hotel staff were always helpful and greeted you everytime you walked past reception. Our room was TINY with a pretty view of the courtyard. It did it's purpose, it was warm and comfortable. It took a while to figure out how to use the shower! Breakfast was the standard European fare (same everyday). Try the croissants! The area was eccentric and certainly not touristy. But it's close to the Metro and Gare du Est (you can walk there), it was easy to the touristy bits of Paris. I would recommend exploring the area during the day, some cool little boutiquey odds and ends stores. At night, stick to main roads, it just felt a little unsafe. Wireless internet available.", "Date": "May 11, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "2", "Location": "2", "Rooms": "2"}, "AuthorLocation": "Salinas, CA", "Title": "“Great for Eurostar arrivals, to far from Paris sights.”", "Author": "misscappuccino", "ReviewID": "UR28588864", "Content": "Good location if arriving from London on the Eurostar Train. Location to far from all the top 10 Paris sights. The metro is close to the hotel. Rooms are a bit small could use a renovation more updating. Breakfast was ok not many choices. Staff was friendly. We had friends staying in the Latin Quarter they were very close to the attractions. I would suggest staying in the Latin Quarter it is very quaint and close to the city center. The Villa St Martin is to far North in the city, just taxi down to Latin Quarter.", "Date": "April 22, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Location": "4", "Rooms": "4"}, "AuthorLocation": "Dorset", "Title": "“Great Value 3*** Hotel”", "Author": "LifeWorkbalanced", "ReviewID": "UR26624670", "Content": "Villa Saint Martin is a great value 3*** Hotel particularly for an expensive city like Paris. It is well located for metro/train and bus journeys from Gare de L'Est which is about 200 metres away. The Reception staff were most helpful and friendly at all times. We had a fairly large room at the back of the hotel with the adjacent school backing on to the picturesque Saint Martin canal. The room decor was fine apart from a prominant rainwater ? stain on the curtains. An unexpected bonus was the 42\" flat screen LCD tv which had several decent English/US films during our stay. The bathroom had a half sized bath which was a bit cramped for 6ft plus but nevertheless much appreciated after pounding the streets for hours looking at the sights. The Breakfast room was fairly small and can get busy at times but is available from 0630 which is useful for early departures or excursions. The buffet style cold breakfast included a good range of hot drinks,fruit juice, cereal, fruit salad,breads,pastries, hams etc which were regularly topped up. We will definately stay there again and have no hesitation in recommending Villa Saint Martin to others.", "Date": "March 22, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Location": "4", "Rooms": "4"}, "AuthorLocation": "CUMBRIA,ENGLAND", "Title": "“Excellent value for money”", "Author": "BUCEPHALES", "ReviewID": "UR26116670", "Content": "My wife and I had an extremely pleasant stay for 4 nights at this hotel and heartily recommend to every one who is looking for a good hotel in expensive Paris. The staff were excellent, the breakfast was very good, the room(superior but well worth the little extra we paid) was clean, and the bathroom was well appointed although we would have preferred a bath as well as the shower. The bed was comfortable and the room was quiet. Regarding the expense of Paris due to the pound exchange rate; it was still possible to search out reasonably priced restaurants for the evening meal. We found several off the main roads and at no time did we feel uncomfortable or threatened. The area around the hotel was a surprise as we did not realise the canal was so charming. It must be a great area inthe summer. Our trip to the Palace de Versailles (all pre booked on the net to avoid the queues ) was stunning. Our second 4 day trip to Paris and it di not disappoint.", "Date": "March 13, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Location": "5", "Rooms": "3"}, "AuthorLocation": "London", "Title": "“Great location for Gare de l'est and Gare du Nord”", "Author": "Nasher78", "ReviewID": "UR25809277", "Content": "Hotel is in a great location for Gare de l'est (2 minute walk) and Gare du Nord (10 minute walk). Rooms are small but clean, with a nice bathroom (bath very small.. but at least it had a bath). Plenty of choice for breakfast, staff helpful and pleasant. Perfect for a weekend stay in Paris.", "Date": "March 8, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "rockford", "Title": "“great find, loved the area, wonderful gem of a hotel in canal saint martin area”", "Author": "pjs536rome", "ReviewID": "UR25201904", "Content": "great rooms, great staff, free internet, free luggage storage, good location, fantastic breakfast,", "Date": "February 26, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Toronto", "Title": "“Good location, clean and small.”", "Author": "Bogacha", "ReviewID": "UR23991219", "Content": "We stayed at this Villa Saint Martin for nearly a week. The location is decent with quick access to the Metro and several choices for dining within a short walking distance. The building across the street gave off the vibe of a mental asylum with constant congregations of some very strange people. Other then the occasional homeless person, the area is safe. The hotel is a little small though quite comfortable. The room itself was quite small and I normally wouldn't be bothered by the size, but I felt it mildly diffiicult to unwind. The decor was modern and the room was very clean. The washroom was immaculate, the bathtub in particular radiated with a spotless shine. There was a large screen flat TV that contained a few english channels, including CNN. The staff was flawless, very friendly and accomodating. I had just arrived from a trip in the Middle-East in which I was suffering from an violent, ongoing case of traveller's diarrhea. It reached the point where I required medical attention. The staff contacted a doctor and within hours, I received medical attention and picked up my antibiotics. Needless to say the French medical system is second to none. The entire staff was very courteous and quite sympathetic to my ordeal, especially considering the wretched smell exuding from our hotel room. Overall, I was very pleased with my stay at Villa Saint Martin. I likely wo It certainly gets my recommendation.", "Date": "January 29, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "4", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "greece", "Title": "“Great value for its money!!!”", "Author": "pipi1982", "ReviewID": "UR23977650", "Content": "We stayed in Villa Saint Martin for 5 days....4 to say the truth, as there was a little problem with our booking and we had to spend a night in another hotel nearby (\"All seasons\"). This was a nice hotel, more expensive than Villa saint Martin (though not as good) but as the difference and the taxi were payed by them, we didn't have any problem to stay there for our first night in Paris. The day after, we returned to Villa saint Martin, to stay in a bigger room than that we booked, a \"juniour suite\" actually, without any extra charge! There was a comfortable double bed and a wide plasma TV!!! The bathroom was spacious enough and the room kept extremely clean every day!!! As for the breakfast, it was very rich (baquettes, croissants, milk, marmelade, ham, cheese, eggs....and many more)! The staff spoke english fluently, they were very friendly and cheerful! The hotel is located next to the metro station (Gare de l' Est), however the place is very safe! I would recommend you, staying in Villa Saint Martin!!!", "Date": "January 28, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "4.0", "Value": "5", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Belfast", "Title": "“Extermely convenient”", "Author": "dreamer888", "ReviewID": "UR23055595", "Content": "We spent 4 nights at the Villa Saint Martin hotel, and all in all it was a very pleasent and enjoyable experience. The hotel itself is situated about a 20 minute walk from the Gare du Nord and only 2 minutes from the Gare de l'est, from which the metro leaves. We found this very convienent and with the metro being so cheap, much easier than a taxi. The hotel was quite small, with a tiny lift hardly holding more than 3 at a time and small corridors leading to the rooms. The rooms were small but perfect fro what we needed in Paris, a base. We did however find that the bathroom did seem to get damp quite easily, but with clean towels everyday this really didn't bother us. The main downside to the hotel was at night time the room was extremely hot and sticky. At points to hot to bare, and we needed to sleep with the windows open...even in the middle of winter! But that was a snag we were willing to accept as all in all we found the hotel to be excellent value for money! One word of advise would be that if the breakfast is not included, I wouldn't pay 10 euros for it as there are plenty of cafes only a minute away that would serve a hot alternative!", "Date": "December 28, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Business service (e.g., internet access)": "4", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Cardiff", "Title": "“Excellent value for the price”", "Author": "awayuk", "ReviewID": "UR23037820", "Content": "We spent three nights here just before Christmas. It cost around 43 euro per night (via skoosh) for a double en suite room including a cold buffet breakfast which was very good. What a bargain! The staff were friendly, helpful and all spoke English. As gay travellers we weren't made to feel uncomfortable. The room was clean and perfectly adequate (and it was nice and warm - the heating worked and the windows opened). The hotel is close to Gare de l'est metro station (making it an easy trip by public transport to and from the airport: train to Gare du Nord one metro stop from there) and there are plenty of cafes around for eating locally. Paris is a large city and you need to get the metro everywhere so it's fair to say the hotel is pretty central - not out in the sticks anyway. It felt fairly safe around there at night. Can't fault it.", "Date": "December 27, 2008"}, {"Ratings": {"Overall": "1.0", "Value": "1"}, "AuthorLocation": "North London", "Title": "“I cannot recommend this hotel.”", "Author": "Steve_in_Barnet", "ReviewID": "UR22728903", "Content": "Arrived at 9.30 PM at night to be told they had made a mistake on the dates and were full, but not to worry as they had booked us a room at another 3* more expensive hotel just a 7 minute walk away. We were given a well photocopied map of how to get to the other hotel (so I think this was not the first time). After walking for 25 minutes in the rain we found the other hotel, which was acceptable but more like a 2* hotel. In my opinion the hotel takes extra bookings but banks on a no-show or has a deal with the other hotel to pass on bookings it cannot meet. Complaining to the booking company seems like a waste of time as they state on their website: \"The accommodation providers reserve the right to change your accommodation to an alternative\"! Be careful. Alex, Barnet, North London.", "Date": "December 14, 2008"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "uk", "Title": "“good, cheap, clean accommodation”", "Author": "ascrawley", "ReviewID": "UR21924869", "Content": "This is a very small but clean, friendly and well appointed hotel. It is situated 2 minutes walk away from gare de l'est and the St martin canal. The rooms are very very small as is the whole hotel, but the staff are friendly and it is reasonably priced. The breakfast is a little dull and lacks a warm alternative, but adequate. I would recommend this hotel to couples but families may find the rooms too small. All in all a good clean option for accommodation in paris.", "Date": "November 17, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Business service (e.g., internet access)": "4", "Check in / front desk": "4", "Overall": "3.0", "Value": "3", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Bethesda, MD", "Title": "“A bit sparse, but a Good Value”", "Author": "mrlayl", "ReviewID": "UR21750785", "Content": "My wife and I stayed at Villa St. Martin from Sept 26, 2008 to Oct. 4th, 2008. First the pluses: 1) Location - Although a 15 minute subway ride from the Louvre, its walking (3 minutes) distance to Gare De E'st train and subway station. 2) Breakfast - Ample supply of breakfast cheeses,meats, fruit, cereal, and coffee until 10 AM with plenty of seating at the breakfast room. 3) Staff- All spoke good English and were helpful, although some were at times defensive when an inadequacy was pointed out. 4) Free internet and loaner laptop. Now for the minuses: A) Rooms are small so additional cost to upgrade toa Jr. Suite was worth it. B) Furnishings, bed covers and room decor although clean look basic and dated. C) A couple of torn up bath towels upon check-in (replaced the next day) were disappointing. D) Had to push together 2 beds slightly wider than American twin size to create an uncomfortable full size bed. they claimed that was as large as a bed size they had in the hotel. E) Hotel overlooks and shares a wall with an elementary school yard. So, depending on the season, you may be awakened at 8 AM to the sound of school children playing in the yard. Although, if the window is closed double pane windows block most of the noise. If you decide to walk to the city center try to avoid the Republic neighborhood, by asking the front desk people for routes that do not cross the area. Monmart is close - about 30 minutes walk and Canal St. Martin area is an up and coming mostly residential neighborhood. All and all, depending on the price you pay, this could be a good place to stay in Paris without breaking the bank.", "Date": "November 11, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Hungary-Spain", "Title": "“Great value for money”", "Author": "laz81", "ReviewID": "UR21728711", "Content": "We've stayed in Villa Saint Martin 3 nights and had a great experience. Staff were very polite and friendly, all speaking english. When we arrived late in the evening, the receptionist greeted us by our name and saying \"we've been expecting you\". Great little detail. Room was good standard. Lcd tv on the wall, not like you will need it in Paris,just in case. Bathroom clean, shower could be a bit bigger but overall normal size, toilet paper was soft not like some places having boardpaper and even tissues. Breakfast was excellent, including ham, cheese, boiled eggs, pastries, eat as much as you can. Location is great 3 min to nearest metro (Gare De l'Est), from there you can reach main attractions in 10 min. Gare du Nord also 1 metro stop away, if you travelling from/to Charles De Gaulle Airport. Overall it was a great stay, especially for the price (we paid £160 for double room for 3 nights), would def recommend it.", "Date": "November 11, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Check in / front desk": "3", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "London", "Title": "“Pleasant little hotel”", "Author": "Katyaw41", "ReviewID": "UR21382547", "Content": "This was my fifth visit to Paris in 3 years and each time I've stayed in a different place. Not for my 6th visit. For that one I will definitely be staying at Villa Saint Martin again!!! It's so convenient for the metro and overland trains, Gare du Nord & Gare de l'Est are literally 15 mins walk and 5 mins walk away. Normal buses are around the corner and the yellow line of the Green Tour Bus (Opéra/Sacré-Cœur/Montmatre) stops just across the road. Lots of restaurants around. Convenience store about 8 mins away and after another 15-20 mins walk (I walk slowly) there's an absolutely fabulous food market! So fresh! The hotel breakfast was brill and highly recommended. There are the obligatory homeless people and the odd strange person but all in all the location is very good and the hotel was clean and service was very good. It felt very safe, even in the early morning hours. Three complaints (because I have to). 1 - the bathroom did not have an apparent working vent and got pretty steamed up when in the shower and everywhere ended up dripping but nice shower. 2 - the walls are maybe too thin as we had one guest knocking on our door asking us to be quiet because they needed to sleep (pathetic woman, you're on holiday, let your hair down, we were only laughing!!!). 3 - only English telly was CNN. I highly recommend Villa Saint Martin for your stay in gay Paree!", "Date": "October 29, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "4", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Hoboken, New Jersey", "Title": "“pleasant stay”", "Author": "scottsiegel1959", "ReviewID": "UR21071842", "Content": "Had to stay for 1 extra night and booked 2 singles via Kayak ($141), Clean, modern, flat screen tv (CNN). Location is great. A hop.skip and a jump from Gare D' la Est.. Booked two rooms and and to be next to each other. Wasn't possible so we stayed on 2 different floors. Without asking we got \"larger\" rooms. Mine was fine and my mom's was even larger.", "Date": "October 21, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Business service (e.g., internet access)": "3", "Check in / front desk": "4", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Glasgow, Scotland", "Title": "“Great Base for sightseeing”", "Author": "LoriQM", "ReviewID": "UR20837144", "Content": "Hotel was modern and clean. Nice decor. Room was a fair size for Paris and had a large flat screen TV and digital safe included at no extra charge. Buffet breakfast was ok too. En-suite was a bit small especially the shower, but overall acceptable. Staff were helpful, nice and polite and room was cleaned every day if requested. Good base for sightseeing although didn't spend a lot of time there as no foyer to sit in, only the bar area which was fairly quiet. VERY close to the metro and Gare de l'est RER station so ideally sited and within 10-15 mins walking distance of centre of Paris / Louvre etc. Area ok at night, but has a few homeless people round about the station area. Didnt feel unsafe at any time though. Would recommend, good value. LM, Scotland", "Date": "October 13, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Business service (e.g., internet access)": "4", "Check in / front desk": "5", "Overall": "4.0", "Value": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Haysville, KS", "Title": "“Great Hotel”", "Author": "starlit179", "ReviewID": "UR20804970", "Content": "We highly recommend this hotel. It is a great place to stay - you are approx 15-20 minutes from most of the attractions in Paris. This location is approx 2 blocks from the Gare de l'Est station - which would take you less than 5 minutes. It is approx a 10 minute walk to Gare du Nord station. The service was fantastic and their breakfast was great. The room is small, but that is normal in Paris. It is a very clean & decent hotel. The neighborhood is decent & we never felt uneasy or unsafe - even in the early morning hours! If we get the opportunity to go back to Paris - we will look into staying here again.", "Date": "October 11, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "4.0", "Value": "5", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Bedfordshire", "Title": "“Excellent locqtion”", "Author": "NigelTaylor", "ReviewID": "UR20731665", "Content": "Stayed at the hotel from 29 September to 4 October. The hotel is well sited for Gard de Nord station. I had a room on the third floor which was sufficient for one person. The hotel staff were always friendly and helpful. There was a good variety of food for breakfast. The bar was very quiet and gave you some space in the evening. Sweets at the reception were a nice touch. Wireless access to the internet was available and you could borrow their laptop if you did not have your own. Thoroughly enjoyed my stay and would recommend to others", "Date": "October 8, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Business service (e.g., internet access)": "3", "Check in / front desk": "5", "Overall": "4.0", "Value": "5", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Tennessee", "Title": "“Great hotel”", "Author": "tntravel908", "ReviewID": "UR20633973", "Content": "Nice clean hotel on a quiet side street. Rooms were very small. We barely had enough room to put our luggage. The hotel is a 2 min walk from the Est Metro station. You have to take the metro to get to any touristy areas. I did not feel completely safe in the area that the hotel was in at night. We walked around the area of the hotel one afternoon and quickly turned around as we did not feel safe. The hotel had a very nice breakfast buffet. The front desk staff let us use their laptop with wireless internet to check our email. I felt that this hotel is very reasonably priced for Paris. If you do not mind taking the Metro everywhere you need to go then this is a nice hotel. I would stay at Villa Saint Martin again.", "Date": "October 5, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "pennsylvania", "Title": "“great place to stay”", "Author": "ffdoc2", "ReviewID": "UR20277089", "Content": "We stayed here for four nights sept 2008, and would stay here again with no hesitation at all. For those of us with extremely limited (if any) French speaking skills it never mattered as the people at the front desk as well as the breakfast all spoke easily understood fluent English, which they used the moment i opened my mouth and they heard my fractured \"bonjour\". The room was smallish but then we didn't go to Paris to hang out in our room, and yes the shower was tight, that just made you get more creative about how to shower. Our room had no tub, which didn't matter to us but might to someone else. Particularly nice was the included breakfast. There were 3 or 4 types of pastries, a couple kinds of cereal, hard boiled eggs, 3 kinds of meat, 3 or more types of cheese, yogart, fresh fruit cut up, a couple kinds of juice, a few kinds of tea, and various coffees. Seating was plentiful, as were plates, silverware, etc. The area where it is located is not near many of the sites one is likely to want to see, however the Gare D'est metro station is roughly a 3 minute walk, there is a hop on/hop off bus stop even closer, and a few restaurants nearby, even a McDonalds, which was nice coming back to the hotel at night for a shake or coke if nothing else. We never felt uncomfortable in the neighborhood, our room was spotless, there is a safe in the room, hair dryer, flat screen TV, (only English channel though was CNN but again who goes to Paris to watch TV?) I would highly recommend this hotel to anyone except perhaps someone who for whatever reason is hesitant to take the metro.", "Date": "September 22, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Phoenix, Arizona", "Title": "“Great Service !! loved this charmer.”", "Author": "BookloverAZ", "ReviewID": "UR20225898", "Content": "We stayed at the Villa Saint Martin Paris for 3 nights - i picked this hotel based on the Tripadviser reviews and I am so glad I did !! The guest service was amazing from the very start - Adis, the Front Desk Manager spoke English (I am American) and he made our stay very special. Also, Emilia, at the front desk was wonderful - she gave us a restaurant recommendation on our first night in Paris and the food and the service there was amazing. Our room had two windows that opened up for fresh air and views of the city. Our bedding was comfortable and the shower water pressure was better than I have at home. The room was clean, and relaxing. We were convenient to the Metro for acces to the sights we wanted to see. They arranged for a shuttle to the airport, it was on time and very convenient. I loved my stay, it was our 10th anniversary. I will definitely stay at this hotel again. Thanks to Adis and Emilia, and the rest of the staff - you're the best. Anita and Todd Voris - Phoenix, Arizona", "Date": "September 20, 2008"}, {"Ratings": {"Service": "1", "Cleanliness": "2", "Business service (e.g., internet access)": "1", "Check in / front desk": "2", "Overall": "2.0", "Value": "2", "Rooms": "1", "Location": "2"}, "AuthorLocation": "Minneapolis, Minnesota", "Title": "“Completely Overrated”", "Author": "MNSpark", "ReviewID": "UR20067328", "Content": "We booked the Villa St. Martin based upon tripadvisor reviews. That was a mistake. I would never stay here again. The hotel lacks charm, the staff is nice but unhelpful and the halls are like rabbit warrens. We booked a junior suite and it was smaller than delightful rooms we had previously stayed at on the left bank. There was one window that provided little light. Finally, we booked a shuttle to CDG through the hotel. The shuttle ran two hours late and we missed our flight. We had to spend the night at the airport. All and all - it was a grand disappointment.", "Date": "September 14, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Business service (e.g., internet access)": "4", "Check in / front desk": "4", "Overall": "5.0", "Value": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Portland, Oregon USA", "Title": "“great place to stay!”", "Author": "ORreviewer", "ReviewID": "UR19353843", "Content": "My husband, adult son, and I stayed at Villa St. Martin for 4 nights in early August (2008). We stayed in a Triple room which had 2 twin beds that could be pushed together and a roll-out double bed that stayed up during our stay. The room was large enough for 3 and all of our suitcases so we were not bumping into each other. There was a balcony and windows that open for fresh air. There was also air conditioning. The bathroom was \"ensuite\" and very adequate in size for three of us. Note though that the shower/tub combination had very high sides so some may have difficulty getting in and out of the tub. The hallways and elevator are small. However, the staff are helpful and speak English well. The breakfast was buffet style that provided 2 cereals, several juices, a meat platter, cheese, bread and pastries. Shampoos and hair dryer were provided. The location is not too far from a bus stop or underground station and there are restaurants near by. Great value for the price.", "Date": "August 25, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Altus, Oklahoma", "Title": "“A great little place...”", "Author": "Jetdriver21", "ReviewID": "UR18293794", "Content": "The wife and I took a weekend off in Paris - it was her first time, and chose this hotel based on lots of good reviews. To start, the location is away from a lot of big city/touristy bustle. A very quite neighborhood at night. It's a 2 min walk to the Gare de l'Est train station. This is a main exchange and you can get to anywhere in Paris easily. The hotel itself is very cute and clean inside. The décor is modern and tasteful. They do not offer free breakfast, but it is available and quite good. A modest selection of fruit, bread, yogurt, juice and of course coffee. There are a few cafes close by if you want that option. Rooms are small - typical for this type of hotel. It was adequate though - we didn't spend any time in there anyway - after all, we were in Paris. Anyway the room had a flat screen to save space and a safe for your valuables. It had enough room for our packs and the bathroom was very clean a well appointed. One very notable item was the shower. It was an awesome full body shower with about 5 nozzles running the length of the wall. A fun shower to use.Overall the staff was great, no problems, they were all helpful and accommodating. This was a pleasant experience altogether.", "Date": "July 27, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Check in / front desk": "5", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Perth, Australia", "Title": "“Nice stay”", "Author": "Bluering73", "ReviewID": "UR18262354", "Content": "Hotel Room, medium size, clean and tidy, bath room clean but cluttered and badly designed. Reception quite courteous and helpful. Breakfast excellent, a good variety of food but the room is cluttered with awkward chairs. Hotel location excellent, 2 min walk to Gare de l’Est, it was a bonus to catch the train to go to anywhere in Paris, and no money was wasted catching taxi. Unfortunately, the airconditioning was not working, luckily it was not hot during our stay in Paris. Overall experience quite good.", "Date": "July 25, 2008"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Business service (e.g., internet access)": "4", "Check in / front desk": "4", "Overall": "2.0", "Value": "2", "Rooms": "2", "Location": "4"}, "AuthorLocation": "London", "Title": "“Not as good as I expected after reading earlier reviews”", "Author": "calibj", "ReviewID": "UR17932402", "Content": "Nice service by the staff, but let down by the quality of the rooms. Much smaller rooms than expected, even given that I've stayed in many Paris hotels. We changed rooms due to initially being allocated a room next to a building site with constant jack-hammering. Avoid room 163 as it was tiny, while our new room was a more reasonable size, so maybe best to check out the room first before unpacking. Hotel is in a reasonable area, next to Est train station, but it is a more residential area. Can walk to Montmartre without too much trouble, and the Republique/Grand Boulevard areas. A few interesting characters in the area as you'd expect near 2 of the main train stations (Est and Nord). Also the busy Canal Saint Martin is just down the end of the street, which is bustling during summer. Bathroom nice and clean although small; Bed fairly solid not too soft; Breakfast plentiful for typical French continental buffet style; the lobby bar is fairly quiet but they will happily fix u a drink; Rooms have good plasma TV (only CNN in english); no mini bar or fridge for chilling the champagne though :) Overall is a passable hotel without quite living up the the reputation of the reviews so far.", "Date": "July 16, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Alexandria, Virginia", "Title": "“A Lovely Stay”", "Author": "SiteCer", "ReviewID": "UR17655482", "Content": "The Villa Saint Martin is a lovely hotel. I booked it as a package deal (fly into/stay in London, train to Paris, stay in/fly out of Paris) and, as included in the package, it was very good bargain. As others have noted, it is very conveniently located near Gare de l'Est where there are a few Metro lines. The breakfast included was more than adequate and the hotel staff was very nice and accommodating. They helped me arrange a shuttle to the airport for a very early departing flight. The fact that I do not speak French was not a problem at all. Although my reservation was for a single, I was very surprised to get to my room and find a double bed (rather than a twin). The room was on the small side but very clean and had everything I could need. I also appreciated having CNN Europe as one of the TV stations available since it is in English and I could catch up with what was going on in the world. The only minor issue is that the shower was extremely small (2.5' x 3' x 6.5'). Since I am petite, it wasn't that much of a problem for me but it could definitely be a problem for others. The shower also leaked so do not leave anything on the floor that you do not want wet. Overall a very good stay.", "Date": "July 8, 2008"}, {"Ratings": {"Cleanliness": "4", "Business service (e.g., internet access)": "4", "Check in / front desk": "4", "Overall": "4.0", "Value": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "West Sacramento, California", "Title": "“Perfect for travelers coming/going east or north of Paris”", "Author": "BoarderX", "ReviewID": "UR17535806", "Content": "Took a chance on the Villa St. Martin based on other reviews. The positives are dead-on. Small room, but very standard for Paris. Very clean and modern, and everything was in working order. Wireless Internet access in the room was nice and convenient, although not superfast. The breakfast included in the rate is somewhat limited but certainly more than coffee and a croissant. Given all this, the St. Martin is a unique value for its location, a block from Gare de l'Est and four blocks from Gare du Nord. So it is perfect if you're arriving late into Paris or leaving early, either from/to CDG airport or to point east or north (including the UK, Benelux, and Germany). Most of the other hotels close to these stations are either undesirable or overly pricey, but the St. Martin gets it just right.", "Date": "July 4, 2008"}, {"Ratings": {"Cleanliness": "5", "Check in / front desk": "4", "Overall": "3.0", "Value": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Rockville, Maryland", "Title": "“Nice quaint hotel with lots of French character”", "Author": "planefun1996", "ReviewID": "UR16951031", "Content": "We stayed at the Villa Saint Martin while on a side trip to Paris for 4 days. We booked the hotel through otel dot com. This site provided the best rate, included taxes and fees and a great continental French breakfast. French breakfast includes varieties of pastries, cheeses and meats along with fruits, cereals and coffee and juice. With the value, or lack of of the value of the dollar in Europe, this is a substantial savings, since a cafe breakfast will cost 6-10 Euros which is $12-20 US. This hotel is quaint. It's walking distance (2 blocks) from the Gare de lst metro stop. All the sites are no more than a 10-20 minute metro ride. This is a safe, no frills neighborhood with a few restaurants, wine/grocery stop . Hotel is very convenient , clean and has a nice front desk staff that speaks English. Rooms were remodeled recently and exudes typical French charm.", "Date": "June 15, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "McAlester Oklahoma", "Title": "“Very Very Good”", "Author": "Barbwire184", "ReviewID": "UR16582257", "Content": "I have nothing but praise for the Villa St Martin. It is located in a very quiet area of Paris yet five minutes and your in the middle of everything. The whole hotel is very well kept meaning very clean,very professional staff,nothing but praise. I went to Paris by myself and was a little hesitant about seeing everything I wanted to see and do but ,the staff went above and beyond to make sure I got everything I needed to see and do all. All spoke fluent English which was a big relief for me. Staff made calls for, found addresses everything I ask for they helped with. I'm going back to Paris in August and already know where I'll be staying. I have nothing but praise for Villa St Martin Hotel and staff.", "Date": "June 2, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Denver, Colorado", "Title": "“Great value”", "Author": "California26", "ReviewID": "UR16533760", "Content": "Very well-maintained, clean facility. Location is two short blocks south of Gare d'est, the gateway for high-speed trains to eastern France, and about 5 blocks south of Gare d'nord, a stop on the train from Paris/CDG airport. Metro/subway stop at Gare d'est. Airport limo service back to the airport, arranged by the front desk, was reasonable and easier than dragging luggage back to the train station. Rooms are very clean and well-maintained with modern, up-to-date bathrooms and plasma cable TV. Reception is very friendly, helpful, and fluent in English. A big attraction is the free internet throughout the hotel, including all rooms -- both broadband (bring your own network cable) and wifi. The neighborhood is not one of the chicest, but with the convenience to trains and subways, it's quite acceptable, and I felt safe walking around in all directions. Given the very weak dollar, and otherwise exhorbitant prices in Paris, this is an excellent value.", "Date": "May 31, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Singapore, Singapore", "Title": "“Fantastic Service”", "Author": "ChristineLim", "ReviewID": "UR16368076", "Content": "We stayed at the Villa Saint Martin for 3 nights during our stay in Paris and we totally enjoy it. The location of the hotel is very near to the Gare de l'est metro station, which made it really easy for us to explore Paris without having to spend too much time on travelling. One thing that I absolutely must mention is the excellent service that we'd received. Everyone in the hotel was extremely friendly and the front desk personals speak excellent english. I had fun chit-chatting with the lady at the front desk (sorry I couldn't remember the name) who had been to Singapore. The room was clean, comfortable and safe to leave our stuff in. The size of the room may not be big but that's common in Europe. Best of all, we had free wireless internet connection through our stay. How nice! Overall, Villa St Martin is value for money and I'm sure the staffs at the hotel will deliver excellent service. I will definitely go back again.", "Date": "May 24, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Live Oak, Florida", "Title": "“Great Experience for First-Time Travelers”", "Author": "Self_Portrait", "ReviewID": "UR16324865", "Content": "My wife and I stayed here in February 2008 (celebrating our 35th anniversary) and can describe the Villa as absolutely delightful. This was our first trip out of the United States to Europe, Paris being a 10 year dream-come-true, vacation. The room was small by American standards, but had better amenities and was laid out better than some 4-star resorts we've stayed at in the States. It was very clean!! The hotel is just a few minutes walking to the Metro and train station. The staff spoke excellent English and was very helpful. We arrived 5 hours before check-in and they allowed us to leave our luggage, while we began exploring Paris. We were a little nervous about our shuttle to the airport on the return trip, but the front desk assured us everything was all right, and it was. The breakfast was a real meal...coffee, pastries, cheeses, juice,etc,etc,etc...a great start for the day. We stayed on one of the top floors with two windows overlooking the city. It was just a joy to look out the windows and soak up this magical city. Thank you Villa Saint Martin for adding to the Magic of Paris. We highly recommend this hotel.", "Date": "May 22, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Limerick", "Title": "“Fantastic!!!!”", "Author": "GGirlLimerick", "ReviewID": "UR16285098", "Content": "Brilliant Hotel. I visited Paris last november and really enjoyed my stay. The staff are so polite and very helpful. They organised a trip for us to go to DisneyLand and got our travel to the bus station. It is in a lovely location near the train station. there is also a few lovely restaurants around.All staff have very good english. The accomodation is lovely and as its small there is virtually no noise. Would recommend it to everyone wanting to visit paris and will without a doubt return!.", "Date": "May 21, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Budapest", "Title": "“A very good choice to feel Paris”", "Author": "tbalazs", "ReviewID": "UR16282842", "Content": "We have spent our honeymoon in Paris, in the Hotel Villa St. Martin. We had 8 days there, and it was all beautiful. The location of the hotel is fantastic; near the subway, and all thing you need is very close to the hotel. There are restaurants, cafes, bakery, rent-a-bicycle and a railway station. The nearby St. Martin Canal is a very nice part of the city, at the afternoon a lot of people meets there with a bottle of vine, with a bagette and a guitar to have a picnic. The hotel staff is excellent, they speak very good in english [better than me], very helpful and they have a laptop at the reception desk, which you can use in the bar whenever you want . There are Wifi in the hotel. The rooms are small but comfortable with air conditioning. Only one thing was negative for me, the totally lack of sound proof of the walls. Our honeymoon was OK, but our neighbours? At all, it's a very good and not too expensive hotel with a fantastic location. tbalazs", "Date": "May 21, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Chelmsford, United Kingdom", "Title": "“A pleasant stay!”", "Author": "sdyson", "ReviewID": "UR15879374", "Content": "Villa Saint-Martin is well situated if you are arriving in Paris via the Eurostar. It is a short walk or, if you have heavy bags, a single stop on the metro. All central Paris attractions are within at most a 20 minute Metro journey. We stayed in room 229 and were told that this was the largest room in the hotel. The room was spacious with a large Samsung LCD TV mounted on the wall. The staff were all friendly and spoke excellent English. The breakfast buffet had a wide selection.", "Date": "May 10, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "TX", "Title": "“Great Experience”", "Author": "KVATX", "ReviewID": "UR15549897", "Content": "We've recently returned from staying at the Villa Saint Martin for 3 nights while on vacation. The staff was very helpful. They gave us directions and were always very pleasant when we came back to the hotel in the evening. The rooms are small, but clean and comfortable. The bath was a little small and difficult to take a shower in, so request a room with a shower only if that is your preference. The metro was very close and had three lines to choose from which made it very easy to zip around town.", "Date": "May 1, 2008"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Check in / front desk": "4", "Overall": "4.0", "Value": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Bedford", "Title": "“Long Weekend In Paris”", "Author": "juicyjackie", "ReviewID": "UR15460039", "Content": "Just back from four nights at the Villa Saint Martin. 24/4/08-27/4/08. Pleasant stay. Breakfast as previously described, was plentiful and tasty. The room was *very* small - approx 9x10 feet , but nevertheless, clean and fit for purpose. The small ensuite was newly decorated, but not adequate for a person with a fuller figure. Even me, being a uk size 14, struggled to get through the shower door!!! Had a problem with the room safe but the very helpful and very pleasant staff put it right almost immediately. Would stay there again as very good value for money. Location is superb for Gare de L'est and less than 10 minutes walk from the gare du nord - easily done even with large luggage. Beats paying the 10 euros taxi fare.", "Date": "April 29, 2008"}, {"Ratings": {"Overall": "3.0"}, "AuthorLocation": "New York", "Title": "“The Price Is Right!”", "Author": "P-Nutz", "ReviewID": "UR15328963", "Content": "The Villa Saint Martin might not be the most luxurious hotel in the world, but it's hard to beat their rates! My room cost under $150 and I was pleased with the overall experience.", "Date": "April 24, 2008"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "san diego", "Title": "“Thumbs up to the Villa St. Matin”", "Author": "cindy050", "ReviewID": "UR14898911", "Content": "We loved the Villa St. Martin during our recent stay in Paris. Our 30 minute walk to the Ile de la Cite each morning was wonderful and full of interesting sights. The front desk was always pleasant and very helpful. The breakfast was a nice selection of bread, cheese, fruit salad and more. In the evening this room was a nice spot for a beer or wine or just to sit and chat and plan for the next day. Our room was somewhat small but it had everything we needed and the bathroom had recently been updated and was quite nice. We would definitely stay here again.", "Date": "April 8, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "4", "Check in / front desk": "5", "Overall": "5.0", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Netherlands", "Title": "“Very recommendable”", "Author": "actief", "ReviewID": "UR14874924", "Content": "After a thorough search we booked this hotel, based mainly upon other travellers reviews. And I must say, it really is a very good deal in Paris. It's very clean, comfortable and quiet(!). Breakfast is good and the staff was very friendly and helpfull. The Hotel is also located very well. Arriving at gare du Nord you are at the Hotel within 10 minutes walking (2 minutes from gare de l'Est). From these Gare's you can reach any point in Paris within 5-10 minutes using the (excellent) Metro. At the Hotel itself and through their official website http://www.villastmartin.com the rates are a bit high. But through their alternative site http://paris-hotel-villa.com you can book at reduced and very reasonable prices. You can also use this site to check current public or reduced rates and call the Hotel to book directly referering to these prices. At those prices we can absolutely recommend this Hotel. When we return to Paris we'll return to Villa Saint Martin.", "Date": "April 8, 2008"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Business service (e.g., internet access)": "3", "Check in / front desk": "5", "Overall": "4.0", "Value": "4", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Leeds", "Title": "“Got what we paid for.”", "Author": "tfeb", "ReviewID": "UR14707830", "Content": "I'll try and be brief and honest as possible. Ok Gare d'lest has two different entry points plus 4 subway entrances. So we spent the first 30 mins walking around the immediate area looking for the dam thing. There is no tourist info point in Gare'dlest and the security guard tried pointing us in completely the wrong direction. Obviously no fault of the hotels though and once we were there we wondered how we go it wrong! Front of house: Once of the best things about this hotel are the front of desk staff. All of them were really friendly, spoke good English and always wanted to help The Rooms: I have stayed in alot of hotels in my time and this was defiantly the smallest. All very nice and clean but yes small. Unfortunately there was no English speaking tv which while not a problem it would have been great to have one channel to watch in the morning such as cnn. But hey you get what you pay for. We paid £60 per night for 3 nights. Someone did mention this in another review and that is the walls are thin. I don't think the French bloke in the next room was happy that we and my g/f had booked a romantic weekend away......we had fun anyway! Location: When you leave the hotel you can turn left (towards Gar d'lest or right). perfect to get to the station. But if you are looking for a restaurant or a nice walk go right. Me and my g/f were amazed it was like two totally different parts of the city despite only being one street away. When you turn right at the end of the road there is a restaurant and a cafe opposite each other. Apologies but i can't remember the name of either. However the cafe served us an excellent lunch and the atmosphere in there was excellent. Across from here is a restaurant where we went on our final night. I searched for hours on the internet to find the perfect place in Paris to go on our last night and it was at the end of the road. The food was excellent and we had a few drinks. also. Price wise it probably costs just as much as any decent restaurant in Paris. We took 500 euros with us for the weekend. When it was gone it was gone. We travelled around on the tube which is very efficient and cheap. Get a carnet! - Basically this gives you ten tickets which we found was just enough for the weekend. Don’t eat and drink near the tourist attractions they just overcharge you. Find places to eat and drink even a 5/10 min walk away and you find the prices fall. By doing the above it meant we were able to see all that we wanted and then treat ourselves to a nice meal on the final night. Overall we had a great weekend and i wouldn't rule out a return to Paris. Would I stay at this hotel again? Well if i had the same budget constraints yes but hopefully in a few years time ill be able to afford something bigger and nicer. But i would definatly recommend to a friend and have no hesitation in saying its a perfect base if you wish to explore.", "Date": "April 1, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Check in / front desk": "5", "Overall": "4.0", "Value": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Northern Ireland", "Title": "“Clean, friendly and comfortable - what more do you want!?”", "Author": "PinkL0u", "ReviewID": "UR14465166", "Content": "We booked the Villa St. Martin after reading a number of favourable reviews on TripAdvisor and I'm pleased to say that we weren't disappointed. The hotel is very well situated within minutes walk of the Gare de L'Est which is quite a large station. From there, you are only a few minutes from most of the city's sights, via the Metro. The hotel itself was clean, comfortable and quiet at night. The room we has was small but I gather small rooms are the norm for the majority of Paris hotels. The bathroom was clean and there was plenty of warm water and clean towels. Breakfast was also pretty good, breads and cheeses, croissants and pain au chocolat, and coffee, tea and juice. The staff at the front desk were also helpful and could speak good english. The only criticisms i would make are that we had trouble finding nice places to eat at night in the immediate vicinity of the hotel - you really would need to get the metro into a livlier area of the city. All in all a very pleasant stay - not the height of luxury but all you really need for a city break.", "Date": "March 23, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "3", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "New Jersey", "Title": "“It's true what they say...all of it”", "Author": "FrancoisP", "ReviewID": "UR14242451", "Content": "When I researched the hotel I, too, was skeptical, but all the good things are true...and so is the one bad thing, but the bad thing isn't so bad. Very pretty hotel. All the amenities, although our friends' phone didn't work. We recommend Room 165. More remote. Overlooks the back yard. Room is Paris-type small, but redecorated recently and quite pleasant. Great bathroom; best shower ever: a $10,000, 8-head, does-everything toy. Great access to the city via the #4 Métro line and almost next to Gares de l'Est and du Nord. Situated near the prettiest bends of the Canal St. Martin. Incredibly outgoing desk staff. Great breakfast with buns, breads, cheeses, meats, cereals, drinks. The negative? Walls are thin, very thin, but then, if you're well behaved, maybe the others will be, too. We had no problems. #165 only has one room next door and one above. But you have to walk up a half-flight of stairs. We'd stay there again, and we go to Paris every year!", "Date": "March 12, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "1", "Check in / front desk": "5", "Overall": "4.0", "Value": "5", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Washington DC", "Title": "“Good Hotel”", "Author": "Travelmore20", "ReviewID": "UR13929025", "Content": "My husband and I stayed in this hotel for 4 night in late February. It is a very good loaction, being across the street to one of the city's major Metro stations (Gare de L'Est). Several metro lines run through this stop, which make is very easy to get around without much switching of the trains. Definitely get a \"carnet\" (10 metro tickets package which reduces the price per ticket since you ar buying 10 at a time) when you first arrive in Paris if you are staying in this hotel, since you will be going to see all the sights via metro. So, great loaction. The bad? here it is: DO NOT LET THEM GIVE YOU ROOM 118!!!! The room is the size of my closet back in the states. At first I thought that all the rooms are like that and was OK with it, but then in the morning while the rooms were being cleaned and the doors were open I saw that all the other rooms were way bigger than my room! So, if you get assigned room 118 - request a reassignment to ANY other room, trust me. We had no room to open our suitcases. Another thing: the front desk staff tells you upon check in that every time you leave the hotel you should drop off your room key with them - kinda sketchy, but there is a safe in the room, so you can lock up whatever you think is of value. The breakfast is very good, great selection, good breads. The fron desk staff spoke English which made it very convenient. So over all, great location, many places to eat around the hotel, nice staff, but do not settle for room 118!", "Date": "February 29, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Business service (e.g., internet access)": "3", "Check in / front desk": "4", "Overall": "4.0", "Rooms": "4", "Location": "2"}, "AuthorLocation": "London", "Title": "“Comfortable and good value”", "Author": "SKDLondon", "ReviewID": "UR13892467", "Content": "Stayed here for 3 nights in February. This is a good hotel for those who prefer to see Paris rather than a hotel room. We had a quiet room at the back of the hotel (though Rue de Recollets at the front isn't very busy) on the 2nd floor. The room and bathroom were definitely compact but the furniture appeared to be fairly new as was the bathroom. Everything worked and you could open all the doors. The stairs are fairly narrow and steep and I didn't see the lift so perhaps not the best place to stay if you aren't fairly mobile. Breakfast was fine - fruit juice, fruit salad, bread, cold meats, cheese, bread, croissants and pastries plus coffee or tea. The breakfast room did get busy and we had to wait a few minutes for a table on the Saturday morning. The staff were helpful - they have a lap top you can borrow for internet access and there was a luggage room where you can leave bags after you checked out. The hotel is a little out of the centre but very close to Metro Gare de l'Est from with good access into the centre. In the other direction the Canal St Martin makes a pleasant stroll and has several cafes and bars - it must be pretty lively in the summer. We had a drink at L'Atmosphere on Rue des Recollects which was pleasant (and the food served on other tables looked good). We ate at Le Marin facing onto the canal - decent cafe/bar food with plenty of locals out for Friday night. Villa St Martin isn't luxurious but it is a quiet and comfortable base if you want to spend most of your time exploring Paris. It also appears to offer some very good deals on some websites making it very affordable for Paris.", "Date": "February 27, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Business service (e.g., internet access)": "4", "Check in / front desk": "4", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Morgan Hill", "Title": "“Love the hotel”", "Author": "cusip", "ReviewID": "UR13633727", "Content": "We booked thru Gate 1 Travel and was very pleased with the location and amenities of this hotel. Very pleasant staff and close to the station which makes it easy to get around. The room is quite spacious considering our expectations is lower in the European hotels. Would recommend this hotel to our friends and if we ever come back we will stay here again.", "Date": "February 17, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "4", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "San Diego, CA, US (For Now)", "Title": "“Wonderful, In Every Way!”", "Author": "SanDiegoExpat", "ReviewID": "UR13418955", "Content": "FIRST Off, This Place Was Rated In Top 5% Of Paris Hotels On HERE... So I Booked It! NOT Central, but 75 m from Gare d Este Metro/Train station, so convenient. Good access to public transportation, and 2? stops from Sacre Cour, to the North. 3-Star Hotel with 4-Star service! ALL the employees spoke perfect English, and balked at nothing! Lobby & breakfast room were very pleasant/modern! Breakfast buffet/daily got me through my HECTIC day, just fine! MODERN chrome/LED lift! The room was quite nice, with storage space for hanging clothes & drawers, built-in. NICE LCD TV, with cable channels. There was a sufficient desk area with room to write post-cards, and a safe (in wardrobe). The bathroom was MODERN with hair-dryer, makeup mirror, and LARGE tub/shower. Would DEFINITELY stay there, again... only about 3 km from City Center. GREAT Value, and quaint yet modern!", "Date": "February 10, 2008"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Auckland", "Title": "“Great little hotel great spot”", "Author": "TripnAuckland", "ReviewID": "UR13053911", "Content": "This was a great location 2 minutes walk from Gard de L'est, and the Metro, but tucked away from the noise. It was only 5 minutes on the Metro to Les Halles Shopping district, Galleria Lafaette and Au Pretimps. While the rooms were on the small side, we were there to sight see and shop, so it wasn't that much of an issue. The staff were excellent, they were very helpful and extremely friendly, and great with their english. Our 4 night Package included breakfast, which was a great way to start the day, while not a hot breakfast, there was plenty of everything else. It had a small life which while not uncommon in Europe, made it a little harder for getting up and down, at peak times like breakfast, but still a great stay. Paul from Auckland New Zealand", "Date": "January 27, 2008"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "canada", "Title": "“Wonderful Hotel in a very convenient area”", "Author": "tottav", "ReviewID": "UR12964420", "Content": "We spent 5 nights at the hotel and found it to be a great hotel for the price and we would definately stay there again. The location is excellent being across the street from the Gare d'est train station and Metro stop. Travelling out of Paris on the train and within the city on the Metro was extremely simple because of it. The rooms were clean, the breakfast was good. The only thing I would suggest is that the hotel get more english speaking stations/movies available on the Tv programming. The staff were great.", "Date": "January 24, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Ohio", "Title": "“Perfect for Paris”", "Author": "Greg_Annie", "ReviewID": "UR12666641", "Content": "Conveniently located 1 city block from Gare de l'Est (for Metro lines everywhere in Paris, and indirect transit to/from CDG airport), it is nevertheless still offset on side street, away from nighttime noise. Wonderful front desk & breakfast room staff, all are enthusiastic and friendly, willing and able to speak french/english as you please. Can't say enough about their desire to oblige and make our 5 day visit in Paris perfect. Although the room was small, it was well-equipped, modern in its appointments, very well-designed, and spotless. Very nice breakfast buffet, with far more choices than in many US breakfast-included hotels. Our stay in Paris (for our 26th anniversary) was made very special largely due to the exceptionally caring staff, convenient location, and nicely-appointed accommodations at the VSM hotel.", "Date": "January 15, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Check in / front desk": "5", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Browns Mills, New Jersey", "Title": "“We will definately return”", "Author": "Carizma", "ReviewID": "UR12153519", "Content": "We chose Villa Saint Martin for its location, very close to the metro and bus. The great staff was a bonus! I have never stayed in a hotel with such accommodating and friendly people. We speak very little french so it was nice to find that they spoke english. We will book a better room next time (we had a twin room). But our stay was great. The hotel is very clean, the view was nice from the 3 windows, and we even had a big flat screen TV. Breakfast was great to start the day, although we did have to wait awhile for a table one morning. The location was better than expected. Not only were we close to the metro (the week pass is easiest and cheapest) but there were plenty of restaraunts, bakeries and shops nearby. This hotel is a super value and I highly recommend it to tourists.", "Date": "December 31, 2007"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "4.0", "Value": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "pacific beach", "Title": "“It's defintiely good”", "Author": "nickpb", "ReviewID": "UR11631951", "Content": "This is an excellent hotel given that it is often available at deeply discounted prices through various booking sites. Staff are friendly, rooms are well kept and nicely appointed, and importantly, reliable wireless internet is provided (why do so many places either not have it or grossly overcharge?). Although rated a 3 star, I have certainly stayed in worse 4 stars than this one. Probably worth considering even at standard price, but a rare find if you can obtain it discounted...", "Date": "December 17, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Davenport, Iowa", "Title": "“Very Happy with Villa Saint Martin”", "Author": "lisalisaingrid", "ReviewID": "UR11572779", "Content": "After looking at reviews on this website we chose Villa Saint Martin for our 3 day stay in Paris. We weren't disappointed either - the rooms were clean, the breakfast was simple but good. We wound up getting a larger than average room and felt we had ample space. The bathroom was modern and very nice. The staff was especially helpful and friendly. We also liked the location - which was important as we got there the first day of the transportation worker strike and the trains weren't running. We found it easy to walk to most sites without much difficulty. (we never made it to the Eiffel Tower though). It would have been an even better site if the trains were running as there are stops very close by. There is a bike rental site right outside the hotel - although it seemed to fill up, so if you plan to bike home be sure to know where the next closest rental site is. Wi-fi is available in the dining room - you can get a lap top from the front desk if you like. A great place to stay if you are coming in via Eurostar. Overall, a great value. Thanks Villa Saint Martin!", "Date": "December 15, 2007"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Check in / front desk": "5", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Greece", "Title": "“Very nice hotel”", "Author": "kirkou", "ReviewID": "UR10996741", "Content": "We stayed for three days at the Hotel St Martin during our honeymoon. We had a very nice stay. The room was clean and cosy although was extremely small. The staff was very helpful and friendly. The breakfast was good enough to start your day although the breakfast room is quite small - but stylish - and is possible not to find free table right away. Generally it is a very nice, clean hotel. But it is also very small. Small rooms, corridors and elevator. This was not a problem for us but if you need something big and luxury you should find something else and of course pay much more. We also recommended it because it is in a very good location, just 2 minutes walk from the train-metro station, from where you can go anywhere in Paris.", "Date": "November 23, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "London", "Title": "“Perfect Paris Hotel”", "Author": "nymsel", "ReviewID": "UR10717839", "Content": "A Pefect Paris Hotel - Great Value, friendly staff and well located The rooms are indeed smaller then you would expect, but for 2 of us it was just fine; you are meant to go to Paris to go out all day, the room is only for sleeping - if you are very fat (or American) then do not stay here it will be too small for you It is less then ten minute to walk to from Gare du Nord with a case on wheels, if you have just come off the Euro Star - 4 minutes from the hotel door and you are on the Metro at Gare du Est, which will take you any where in Paris... The staff are friendly and all speak perfectly good English - which is actually annoying when you are trying to practice your French as they pick up on the accent and reply to you in English - I tried, I really tried to keep the conversation going in French but they even know the London Slang!! Do your self a favour and for a great value short break in Paris stay at this hotel - Ps the breakfast is great too, with in 5 mins walk you have half a dozen good places to eat from the expensive but so so good Strasbourger to the better value Piano Bar,or Le Tramways de l'Est for a great set manu with oysters", "Date": "November 9, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Groningen", "Title": "“A Great place to stay”", "Author": "KLMboy", "ReviewID": "UR10685612", "Content": "My girlfriend and I visited Paris in August and stayed at Ville St. Martin. We were very impressed the soon we entered the lobby. The staff was very friendly. Though we did not speak French very well they were pleased to attend us in English. The breakfast was modest but certainly good enough, especially those French croissants. The room felt a bit small, but who cares. There is more to see in Paris than your hotel room. The hotel was conveniently situated on walking distance of Gare de L'est (train station). There is a pretty good connection to down town with the tube (or Metro whatever you prefer). We could also use the internet free of charge to check in for our flight back home, and even print out our boarding pass. That's what I call great service. Next time we are in Paris, we defenitely will stay at this hotel.", "Date": "November 8, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "New Jersey", "Title": "“Thanks St. Martin”", "Author": "eswens", "ReviewID": "UR10611140", "Content": "Thru Gate One travel. Very friendly. Good breakfast. The St. Martin canal is very interesting. Boats and locks two blocks away. Loaned us 5 Euros when we arrived and supplied an electrical outlet adapter. Help with directions. No reluctance to speak to us very competently in English. Metro is very convenient.", "Date": "November 5, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "4", "Check in / front desk": "5", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "austin", "Title": "“Very Pleasant Stay”", "Author": "chadblessing", "ReviewID": "UR10598823", "Content": "We were only in Paris one night, so I do not have much to compare it to, but I was very pleased with our stay. We were traveling by train so it was conveniently located near two train stations. The staff was very helpful and the hotel was very well kept. We speak very little French, but the staff was able to communicate just fine in English and were very helpful and very kind. The rooms were nice. All in all, I have no complaints and was quite pleased with the stay.", "Date": "November 4, 2007"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "London", "Title": "“Just the ticket!”", "Author": "London2Travellers", "ReviewID": "UR10350411", "Content": "Just returned from three days in Paris and it was lovely to be based in the Villa Saint Martin - so close to the Metro and with easy access to the sights. Staff were friendly and helpful, the breakfasts plentiful and enjoyable, the room basic but comfortable and very clean. Thanks to all the reception staff for a friendly, helpful and courteous welcome. We will be back!", "Date": "October 26, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "4", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "cambridge", "Title": "“EXCELLENT HOTEL”", "Author": "juicebuster", "ReviewID": "UR10238075", "Content": "Our stay coincided with the 2007 World Cup. So the Hotel was busy1 This small family run hotel is spotless. Our room and lounge of the hotel were tastefully decorated although the room was small. But aren't all Paris hotels! We stayed for 2 nights and felt the friendlyness of all the staff helped make our stay very comfortable. The reception is open 24hrs and they will even look after your luggage when you check out if you want to spend the rest of the day in Paris. Although the bar is not manned all the time the reception will arrange for any drinks you want. The 2 large flat screen TV's make good viewing should you want to wish to catch up up on some news.The breakfast was well presented. Cold meats, rolls, good coffee, cereal, juice, eggs and plenty of all made the experience most enjoyable. My first trip to Paris and should I return I would have no worries booking into this hotel. Overall I was very impressed with what I experienced. The staff were happy to help and guided me most successfully with my train ticket purchases,day trips out and resturants to eat. If you want a clean, small, excellent value for money hotel, close to the main stations then try out this hotel. You wont be disappointed", "Date": "October 22, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Check in / front desk": "5", "Overall": "4.0", "Value": "4", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Queensland", "Title": "“Lovely time and friendly staff.”", "Author": "EdwinQueensland", "ReviewID": "UR10173840", "Content": "As first time travellers to Paris and only being able to speak english we though that we might have a few problems getting around. These problems were overcome to a large extent by the friendly and helpful hotel staff. There seemed to be no problem that they could not assist us with including organising trips, airport shuttles and recommending places to eat. Being close to Gare de l'est and Gare du nord was very good as we just walked from the Eurostar to the hotel.", "Date": "October 20, 2007"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Business service (e.g., internet access)": "3", "Check in / front desk": "4", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Pahrump, Nevada", "Title": "“Nice surprise, great hotel & staff”", "Author": "BFFTraveler", "ReviewID": "UR10080388", "Content": "The hotel we left in London was old. What a pleasant surprise when we arrived at Villa Saint Martin, the hotel staff was friendly and helpful. The room was very clean & decore cute. Loved the windows that opened up and the flower pots outside the windows. The three flights of stairs was a workout. The breakfast was great. We were late for breakfast the 1st morning and they were gracious to let us serve ourselves while they were shutting the buffet down. Hotel is very close to the train station, we didn't know that until the very last day!! Metro station was very close too. I would stay at the Villa Saint Martin again.", "Date": "October 15, 2007"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Check in / front desk": "2", "Overall": "1.0", "Value": "1", "Rooms": "1", "Location": "3"}, "AuthorLocation": "Mumbai (Bombay), India", "Title": "“Villa Saint Martin a thieves paradise.”", "Author": "Shahze", "ReviewID": "UR8741016", "Content": "Villa saint martin, St. Martin would turn in his grave if he comes to know that his name is associated with this hotel. This is typical example of a hotel which has all the amenities of a 3 star but it is infact a 1 star hotel. The rooms are no bigger than the bathrooms at my house. The breakfast is not so great and with just one person serving you can imagine what it is like. The location is in one of the bylanes near the Gard De Lést station. A rundown an impoverished neighbourhood the rooms are tiny and the walls seem to be made of thermocol so much that if the person in the next room farts you are sure to hear it. The corridors are so small that two ppl cannot walk side by side you have to go and come in a single file. The lift seems to be an afterthought. The new wing or the so called renovated wing is the one of the worst rooms i have ever seen. Once inside you feel you are in a Hell Hole. I stayed here for 4 nights and I know. Some how this hotel seems to be popular with the tourists and i just cannot fathom WHY?? They have nothing going for them Bad service, Tiny rooms, Smelly corridors, No Porterage, Breakfast which is so good you just want to run away from it. The only saving grace in this hotel is Andy the concierge who is always smiling and trying his level best to give his guests the best service that he can. A very helpful and genuine person. But beware thieves do lurk in the lobby of this hotel which i found out after losing my handbag and with Andy on a holiday the other staff was just not ready to accept that my bag was stolen from the lobby. When I asked for the address of the nearest police station to my surprise they replied they have never seen one. DO NOT STAY HERE. Gard de Lést and Gard du Nord areas are not for tourists.", "Date": "September 18, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Business service (e.g., internet access)": "4", "Check in / front desk": "5", "Overall": "4.0", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Wetumpka, Alabama", "Title": "“A Great Stay in Paris”", "Author": "starkswetumpka", "ReviewID": "UR8524576", "Content": "My girlfriends and I celebrated a special in Paris. We had the pleasure of staying at the Villa Saint Martin. We had a wonderful time. The rooms were quaint and clean; the food was appetizing. The ambiance was a blend of old world and modern Paris. The hotel was within walking distance to the Euro train station, taxis and the Metro. Restaurants and eateries were abound. The staff was so accommodating, attentive and most of all friendly. I experienced a crisis while abroad and they went above and beyond to assist me. I would like to acknowledge some of the staff; Mrs. Agnes, Mr. Jacopo and a special thanks to Mr. Adis. They and others made our stay most enjoyable. It is because of their graciousness and professionalism and the overall expericence, I am recommending this hotel to my daughter and her husband and several other friends who plan to visit Paris next year.", "Date": "August 28, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Toronto", "Title": "“Really confortable, friendly, clean and well located”", "Author": "TorontoTravelNut", "ReviewID": "UR8521758", "Content": "My husband took me to Paris for our first anniversary. Neither of us knew what to expect as we had heard bad things about the smaller Paris hotels. However, we were more than pleasantly surprised. My husband had asked them to have roses and champagne chilled and waiting in the room and they were more than ready to accommodate his request. It was there waiting when we arrived and was good value for money. The room is a modest but standard European room size. It was very very clean. No funny smells, no unpleasant stains and had air conditioning. We had three full French windows that opened completely and had a good view of the city. It looked onto a park across the street as well. The bathroom was clean, with nice toiletries and the toilet flushed well. House keeping came every morning without fail. The free breakfast buffet is fantastic! There are three choices of jams, three choices of cold meats, three choices of cheese, two types of juice, plenty of coffee, espresso etc. The freshest yummiest chocolate croissants and plain croissants and raisin brioche and hard boiled eggs as well as baguettes. There were also two choices of cereals and melon fruit every morning already cut into cubes as well as several flavours of yogurt and to finish off, many types of teas. The staff are extremely helpful and friendly and speak English. The location is near many restaurants (The Little Regina is really nice) and cafes. One piece of advice for travelers is arrive at the various museums before 9am or you will end up waiting for hours in the hot sun. We only made that mistake once. Avoid ALL touristy restaurants if you want to eat good French food.", "Date": "August 28, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "4", "Rooms": "5", "Location": "3"}, "AuthorLocation": "England/Newcastle", "Title": "“Well-Worth-It Hotel :]”", "Author": "Carlie--x", "ReviewID": "UR8503576", "Content": "This Hotel is really good. It has everything you need. Hairdryer, Big Samsung TV, Air-Con, Wardrobes, Full length Mirror, Walk in shower/Tub, Telephone,Toilitries [Shampoo && Soap] etc Staff there are very friendly and speak English and French. Breakfast is small but cosy and the food consists of; -Yoghurt, Fruit, Croissants, A selection of jam, Ham, Cheese, Haird boiled eggs, Many different types of bread. Drinks include; -Fresh Orange and tropical juice, Many different types of tea [Mint, Earl Grey, Jasmine, Rosemary etc] and a coffee machine that does hot chocolate, cappaciouno, coffee etc The breakfast room plays music and has two wide screen Samsung TV's where you can watch the daily news. There are 5 floors of the hotel and these can be accessed by stairs and a lift. The corridors are quite narrow but are manageable to walk through. The rooms have internet access although we did not know how to use it, i think it would have been done if you asked the receptionist. The hotel allows you to borrow their own laptop to access the internet for free. If you need to iron your clothes you ask in reception if you can borrow the ironing board and iron. They also do a cleaning service to wash your clothes and babysitting. I would redommend this hotel; it was such a pleasure to stay :) Never wanted to leave! Very modern and beauitful!", "Date": "August 25, 2007"}], "HotelInfo": {"Name": "Timhotel Paris Gare de l'Est", "HotelURL": "/ShowUserReviews-g187147-d233792-Reviews-Timhotel_Paris_Gare_de_l_Est-Paris_Ile_de_France.html", "Price": "$143 - $211*", "Address": "<address> <span rel=\"v:address\"> <span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">27, rue des Recollets</span>, <span class=\"locality\"><span property=\"v:postal-code\">75010</span> <span property=\"v:locality\">Paris</span></span>, <span class=\"country-name\" property=\"v:country-name\">France</span> </span> </span> </address>", "HotelID": "2515073", "ImgURL": "http://media-cdn.tripadvisor.com/media/ProviderThumbnails/dirs/aa/48/aa4830e0da05f6b83b5b6758d43edeeb1large.jpg"}}