{"Reviews": [{"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Melbourne, Florida", "Title": "“Awesome trip...will def be back”", "Author": "Jessfranco", "ReviewID": "UR129383139", "Content": "Me & my family booked this hotel through the Universal Studios website and we're so happy we did. Some of the previous reviews I read made me think a little bit but when I got there, all those concerns were gone. We were greeted by Juan who was so unbelieveably helpful. The customer service was top notch, anything you wanted, you got. Once we got into the room it was even better. The beds were not \"too soft\" like other reviews had commented...they were great. Very clean, & even better there was internet connection in each room. The free breakfast was delightful & they provide free shuttle service to the parks. Now unfortunately, (through no fault of the hotel) I got sick my 3rd day in, we were supposed to stay 4. I explained to the staff that i was sick & wanted to leave & they said they would call me to see what to do with my 4th night. They actually did! It was amazing service from start to finish. We will definitely be back.", "Date": "May 4, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Arlington, Va.", "Title": "“Just ask and they'll make it happen.”", "Author": "Wima", "ReviewID": "UR129301656", "Content": "Before we left home, we read the reviews about this hotel; all were very good except for the soft mattresses. I telephoned and said we wanted to be at this hotel but needed a firm mattress. The person with whom i spoke said she would make it happen. When we arrived in Orlando for our two nights at this hotel, the bed was so firm and great that we slept very well both nights. In fact, I forgot that I had needed to request a fix. The hotel was extremely clean, the staff were excellent - Larisa in her care of the breakfast, Galina one night and Veronika the next at the desk with assistance on dining and other area attractions, and all other staff were attentive and professional. This hotel is kept well, the location allows anyone who wishes to walk (or take the hotel shuttle) to Universal Studios/Islands of Adventure, and there are several restaurants just feet away.", "Date": "May 3, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "3.0", "Value": "4", "Sleep Quality": "2", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Plantation, Florida", "Title": "“Best for small families”", "Author": "Kelton", "ReviewID": "UR129139711", "Content": "At $82 a night it was OK. My company paid for this - on vacations a prefer a nicer hotel. This was 2 1/2. Great location. Off the \"main\" road, but not far...just a block or two. If I had kids, it would be great, two beds and free breakfast are an high point. And the breakfast was pretty good. I had a saugage biscuit, grapefruit, coffee, and OJ. That would be at least $30 for a family of 4, so the room rate is fair. However, for a single or a couple, you could do better on priceline for a much better property. The room was OK. First one had satins, but the second one was clean, The beds were too soft for me. The linens were thin (clean, but thin). Staff are very responsive- sweet, and kind. No attitude. GALINDA gets an A+++++++. Pool is small, but clean, and it has a hot tub and a work out facility. Nice modern TV with HBO. Hot cookies in the evening are nice. Coffee in the lobby, too. Can't complain. The people made up for any weakness.", "Date": "April 30, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "1", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Greenville, TX", "Title": "“Good but not Great”", "Author": "gslink", "ReviewID": "UR129133749", "Content": "There are many things to like about this hotel. If you are going to Universal than this hotel is really close. The housekeeping and staff there are some of the best I've seen and I've stayed in hundreds of hotels. The rooms are while a bit dated spotlessly clean. The breakfast staff are very active in keeping everything up to date in the morning, oatmeal fixed, clean area, well stocked etc. They are really on top of this! The bad is a very short list but is my biggest need in a hotel room, the bed. I am very easy going and I don't expect too much in my opinion but the bed is a big one to me. The ones in our room are doubles and the matresses are very soft and very old which made for a tough night of sleep. Getting on to I-4 is easy. Food is good, oatmeal, waffles, cereal, lots of goodies. While the hotel is very busy, the noise level was very low. Cookies everyday! Fairfield Inn & Suites Orlando Near Universal Orlando Resort, please update your beds! Your hotel is very good and that would put you guys in the excellent catagory!", "Date": "April 30, 2012"}, {"Ratings": {"Overall": "3.0"}, "AuthorLocation": "Seattle, Washington", "Title": "“Great location, but basic accommodations”", "Author": "BeckyInSeattle", "ReviewID": "UR128327840", "Content": "Our family of for (2 kids ages 12 & 9) stayed here for three nights for our trip to Universal Studios. The two reasons I picked this hotel were for its location and the free breakfast. (and we had Marriott points to get the room free!). As another reviewer mentioned, the rooms are pretty basic -- I agree! It's also true that the A/C units are noisy - sounds like they could use some servicing. The rooms are a bit small for a family and they really should offer more rooms w/ 2 queen beds (or at least one double and one queen). A double bed just isn't big enough for two adults to comfortably share! And I think the matresses are just old - not necessarily soft on purpose. If you sit on the edge of the bed, they really sink down. The sink/vanity area are very small w/ just one sink. Only one person can use it at a time - again not super functional for a family. Perhaps we should have considered getting a larger room but other hotels we've stayed in have more accommodating room layouts. If you are traveling w/ just 2 people, I think this room would be fine. Or if we were just staying for a night I could more easily deal w/ the cramped quarters. The free breakfast is fine. Again, fairly basic offerings but it's better than paying for something! The pool is ok - small but fine for a quick dip. They provide towels out there, which is nice. The best part about this hotel is its proximity Universal Park. It's about a 5 minute ride on their bus or a taxi and maybe a 20 minute walk. There are also a wide variety of restaurants nearby that are slightly cheaper than eating at the theme park. Oh, and the shuttle to Universal leaves only once in the morning & picks up @ Universal twice at night. Not super convenient and we ended up taking a cab a few times but it only cost $5. All in all, an ok stay. However, I would probably pay a little more money (or use a little more Marriott points) and stay at a little bit nicer hotel next time around.", "Date": "April 22, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Jacksonville, FL", "Title": "“Great hotel if you're going to Universal”", "Author": "bhsu21", "ReviewID": "UR128256922", "Content": "We stayed here just one night and I used a free Marriott certificate. Check in was one of the best. We had this young girl and she was so friendly. It was around 9pm when we checked in but she had so much energy. We had a basic room with a double bed. Nice and clean. We didn't have any problems with it. there is a fitness center but it's just a treadmill, elliptical machine and weights. Really tiny. We checked it out but didn't use it. The bed was softer than we would prefer but you might like it. The only bad thing about this hotel and that's why I had to take off a star was the free breakfast. I know it's free but I've had free breakfasts at the Doubletree next door and the Hampton right down the street and they are 10x better than here. They had breakfast sandwiches you could heat up, but mine was dry and no flavor. They had a waffle machine. I had Fruit Loops. They had your typical bagels and toast. No eggs or bacon like at the Hampton or Doubletree. I ate a bit because nothing really interested me. But it's free and overall enjoyed the stay here.", "Date": "April 21, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Raleigh, North Carolina", "Title": "“2 minutes from Universal.”", "Author": "Daryl G", "ReviewID": "UR127898058", "Content": "We stayed one night before we moved to our hotel at Disney's Animal Kingdom. If you are going to Universal Studios. You can't beat this great location. Rooms were basic and clean. Free breakfast with cereal, fruit and waffles.", "Date": "April 15, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "3.0", "Value": "4", "Sleep Quality": "2", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Weymouth, United Kingdom", "Title": "“Good location and value, but not the best comfort”", "Author": "mistermikeuk", "ReviewID": "UR127873427", "Content": "A family of four, we stayed here for a 9 day visit to Orlando. Excellent location within walking distance of Universal and at a very good price. Staff were friendly and helpful and a reasonable complimentary breakfast was included with a range of cereals, waffles, breads and fruit available. A small pool and gym were also available. Although there is no restaurant, several decent restaurants are available nearby as well as general stores (all easy walking distance). Free coffee is available all day and cookies provided at around 4pm. The downside to the hotel is that the room, whilst clean, was not the most comfortable. The bed was too soft for our tastes and the aircon unit was very noisy when operating, which when combined with jet lag, resulted in a pretty tired family by the end of our stay. I would recommend this hotel to others, but would probably check out others in the same area before staying there again ourselves.", "Date": "April 14, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "2.0", "Value": "2", "Sleep Quality": "2", "Rooms": "2", "Location": "4"}, "AuthorLocation": "Providence, Rhode Island", "Title": "“You get what you pay for”", "Author": "Cynd113", "ReviewID": "UR127802829", "Content": "You know...the reviews for this hotel are not accurate. This is a bare bones, simple, moderately clean hotel that leaves you with few things to remember, think about or desire to go back to experience again. We went there for one night to go to Universal Studios- they do two things right, they offer a great free breakfast and offer a shuttle to Universal (2 in the morning and 2 at night). I just think the right expectations should be set with this hotel- it's not gross, but it's not nice. It's more of a motel than a hotel- weird lighting in the bathroom, humid rooms with a loud air conditioner, small rooms with a bed, old tv and desk. No frills...but I actually think that's the point of this hotel. It's designed as a cheap place to stay to sleep and go out...not hang out and enjoy. It's cheap...and that's what you should expect!", "Date": "April 13, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Cicero, New York", "Title": "“Customer oriented staff, clean rooms, great breakfast!”", "Author": "Marianneh7674", "ReviewID": "UR127780120", "Content": "We stayed 2 nights while attending a wedding which took place at Universal's Portofino Hotel. .When checking in, the staff offered complete information on nearby restaurants, cabs, and prices for parking at the Portofino (ridiculously expensive!) Also invited us back to the lobby for 3 o'clock freshly baked cookies. Hot coffee and tea also available in the lobby at all times. The rooms had new cloud-like mattresses, very comfortable and clean. Breakfast had a wide variety of choices, with a staff member keeping everything clean and well-stocked. Staff member offered to make the waffles for customers. Breakfast alone would be at least $15.00 -$20.00 at any restaurant in Orlando. We asked for late checkout, which staff easily granted. They also allowed us to use the pool area until we had to leave at 3:45 for airport, and gave us bottled water to take with us. In general, we were made to feel like a valued customer.", "Date": "April 12, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Indianapolis, Indiana", "Title": "“Loved the hotel, felt cheated by the cabs”", "Author": "magicsoccer2", "ReviewID": "UR127493197", "Content": "We stayed 3 nights while we visited Universal for the first time. The hotel and it's staff were great. The breakfast was well staffed and had plenty of choices. The pool was very clean. Rooms were a very nice size and seemed well cleaned. The hotel was in walking distance of a few restaraunts, which was nice. The only problem that we had was the cab service. I have not used a cab very often, but these left me feeling cheated. We had the front desk call the cab for us since we were leaving at unusual times. The first cab ride was in a van, and the cost was $8. When we came back from Universal the driver told us the fee would be $5 or $6. When we got to the hotel he told us we owed $7. The next morning the hotel called a cab for us again. This time he took 2 families in the van. I assumed that we would split the cost. I asked him what the cost would be, he told me $10. I gave him $5 plus his tip and went on my way. I could hear him yelling as I was already on the escalator to Universal. I assume he was wanting the entire $10 from me. I think they need to at least run their meters instead of picking whatever fee they like. Other than the cab issues, we had a great visit and would stay at this hotel again.", "Date": "April 8, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Williamsburg, Virginia", "Title": "“Close to Universal, Comfortable and Clean”", "Author": "lvtoske", "ReviewID": "UR127313111", "Content": "We had a very nice experience at this hotel. When we arrived, they had overlooked our request for a room in a quiet area and had put us in the room directly across from the elevator. They moved us without any problem. The new room, unfortunately, had a leak above the window and it was raining. Within five minutes of our call to the desk a maintenance person came in to check out the problem. He returned with tools and materials, fixed the leak, wiped up all the water and cleaned up everything - great service. The room was very clean and quiet. Be sure to confirm if you need a refrigerator and microwave. We thought we were getting one but evidently did not reserve that type of room, and they were sold out so they could not give us one. Breakfast was very crowded, but the staff worked really hard to replenish the food. The location is very good for Universal - close but would have been too far for us to walk and then do all the walking once there (and then walk back!). There is a Walgreens, Carabbas, Wendys, Starbucks, Burger King etc. within walking distance. I would definitely recommend this hotel if you are visiting Universal based on the price and location.", "Date": "April 5, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Fort Lauderdale, Florida", "Title": "“Close to Universal Studios at a great price.”", "Author": "Hitchedintahoe", "ReviewID": "UR127047462", "Content": "We won free tickets to Universal Studios & wanted to find a good hotel that was close & inexpensive for a quick weekend getaway. This was the perfect hotel. We couldn't have asked for a better location or a better price, especially considering it was last minute & during the peak of spring break. The front desk staff was very friendly & helpful, clean room & free breakfast. They even have a free shuttle to Universal Studios. We didn't use the shuttle as our tickets included free parking & the shuttle times didn't work with our schedule. Oh and we could have even bought the tickets to the park if we needed to. Aside from being literally minutes away from the park it is walking distance from several restaurants & a Walgreens. Would definitely stay here again.", "Date": "March 31, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Grorgia", "Title": "“Best customer svc ever!”", "Author": "meldsilva", "ReviewID": "UR126835217", "Content": "We made a last minute trip to Orlando and picked this hotel based on the 30 min research on Tripadvisor.com. I was impressed by the positive comments on the customer svc at this hotel and decided to make a reservation. The comments were indeed true. The staff is professional and firendly. The holel itself is clean and so was our room. I have stayed at the more expensive Marriott brand but did not meet with such a high quality staff as in this Fairfield. Will definitely consider this hotel during our next trip to meet the mouse. Universal Studio is not too far from this location either.", "Date": "March 28, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Bridgewater, New Jersey", "Title": "“great location”", "Author": "alwaysajerseygirl", "ReviewID": "UR126081559", "Content": "We stayed here for one night and the location was perfect for visiting Universal Studios. Clean, comfortable and very friendly staff. Hotel was quiet and the price was affordable.", "Date": "March 14, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "The South", "Title": "“Great hotel, great value, we'll be back!!”", "Author": "OleMiss91", "ReviewID": "UR126018994", "Content": "We stayed at this property for 4 nights, to visit Universal. Our stay was great, the staff is very friendly and accomodating. Our room was on the top floor, the 6th, and was wonderful. Very big, clean, quiet, comfortable bedding, bath was big enough. Breakfast was very good in the morning, many choices. We took a cab 2 mornings to Universal which ran us around $8. It was worth it to be taken to \"the door\" and not have to fool with parking (which is $15 regular, $20 priority parking) There are many fast food and sit-down restaurants in the parking lot and on the block of the Fairfield. We'll stay here again the next time we visit Universal!!", "Date": "March 12, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Decatur (Atlanta), GA", "Title": "“Comfortable, well-run, with surprising number of amenities for the cost”", "Author": "mindynate1", "ReviewID": "UR125657616", "Content": "Just got back from three nights at this hotel. The hotel employees are very friendly and competent. I asked for a quiet room and was placed in a perfect location (end of the hall, several floors up, far from an elevator). The room was clean, comfortable, bright, and had up-to-date decor and linens. The shower even had water pressure. The shuttle service to Universal was complimentary, prompt, and courteous. The complimentary breakfast is also well-run. There are many choices (you can eat healthy or not!) including self-serve waffles, oatmeal, cereal, sweet and savory breads, yogurt, fruit, etc. The dining area was kept clean. The staff put out afternoon cookies as well. I was happy to find a large hot tub/whirlpool in the pool area. And if you work out in the mini gym, you'll find cool towels for your face. Again, lots of unexpected amenities. VERY close to Universal. Pleasantly surprised!", "Date": "March 5, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Chappaqua, NY", "Title": "“Very Comfortable and well run”", "Author": "DavidHaup", "ReviewID": "UR125348662", "Content": "We stayed here in late February. great hotel, comfortable, well run, great staff. Need to note the woman that oversees the breakfast room (Rosila was her name I believe), does such a great job and the breakfast is great!! room was comfortable, very quiet, large, price was fair. only problem was pull out bed springs were rough to sleep on for one of our kids. see below: pros right next door to Universal - very convenient Very quiet large room nice pool great breakfast - Rosila!! clean room Great staff cons pull out couch bed not comfortable ran out of cookies at check in", "Date": "February 28, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Baltimore", "Title": "“Excellent stay - Excellent Customer Service.”", "Author": "bgoodfly", "ReviewID": "UR124630862", "Content": "I stayed at the Fairfield inn just outside Universal Studios. The room I stayed in was very nice and well layed out. It was a small studio with a King sized bed and a little sitting room. It had 2 flat screen TVs as well as a fridge and microwave (which I actually used). After I checked in, I discovered that this hotel was listed as a catagory 4 hotel which allowed me to use some free nights I had on my account (which only allowed up to a catagory 4 stay), so I asked the desk to change the billing to use those nights. The front desk told me it would have to be coordinated with Marriott reservations, but they would handle all that for me. I was pleasantly surprised when I checked out the bill was perfect! All of the appropriate discounts and free nights were accounted for.", "Date": "February 15, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Melbourne, Florida", "Title": "“Top Notch Customer Service”", "Author": "sseaton68", "ReviewID": "UR124293005", "Content": "Upon check-in, we could tell this was not an ordinary chain hotel. The front desk service was superb! They upgraded our room which was spacious, clean and well appointed. A shuttle is available to Universal, but it's a very short drive if you don't want to depend on a shuttle schedule. We only stayed for one night, but I can see how it would work well for a longer stay too. There are several restaurants and a drug store (Walgreen's) within walking distance. My only suggestion for improvement is the breakfast buffet and coffee service. I have some food sensitivities (eggs and dairy mostly) and there was no non-dairy creamer. They also could have used a few more toppings for the oatmeal which was about the only thing I could eat besides the fruit. All-in-all, a terrific hotel. We would recommend it to anyone and stay there again. I'll just remember to bring my own coffeemate.", "Date": "February 8, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "New York City, New York", "Title": "“Reviews are correct!! Great place!”", "Author": "Leslierapp", "ReviewID": "UR123717736", "Content": "I went to visit family and my sister got the flu so we wanted to stay at a hotel at the last minute trying to avoid getting sick. I went on trip advisor to seek out a hotel that was close by. The reviews were spot on. The customer service was better than a lot of 5* hotels I have been to. The second night we were there, the parking lot was full. I had my fiance run inside to ask the front desk where we should park. As I'm waiting there I see the front desk staff (Mariant) running to move her car for me. She actually moved her spot so I could park there and who knows where she ended up putting her car. She didn't have to do that, but she went way beyond her professional call of duty and with a smile. She was wonderful, as was all the other staff members at this hotel. The room was clean and quiet. I would definitely stay there again.", "Date": "January 27, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Eden, Texas", "Title": "“Outstanding Customer Service”", "Author": "CathyK76837", "ReviewID": "UR123579386", "Content": "I met a childhood friend for a weekend at Universal Studios and was blown away by the hotel - most especially the welcoming and well informed registration staff! The young man arranged for a taxi since we had missed the shuttle to Universal and engaged in friendly conversation when we checked out the following morning. The room was comfortable and well maintained and the breakfast - ending at 11 am - was exceptional! If you're going to the Orlando area, don't think twice - this is the hotel for you!", "Date": "January 24, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Lake in the Hills, Illinois", "Title": "“Outstanding Customer Service!”", "Author": "Brian D", "ReviewID": "UR123178786", "Content": "Our experience at this hotel was excellent! We stayed two different times during the past week and both times were perfect. Rooms were spotless, and the hotel is centrally located. We were assisted by Emanoel during both visits, he was professional, friendly and extremely helpful during our stays...i can't say enough about the level of customer service he gave us, I wish every hotel had people like this at the desk!", "Date": "January 16, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Hollywood Beach, FL", "Title": "“Visiting Universal: Stay Here!”", "Author": "Nichole17", "ReviewID": "UR123089557", "Content": "This was an excellent hotel experience! I've stayed at several hotels and did research before choosing a hotel for a trip to Universal Studios. I was very pleased! Excellent rooms, great decor, beds comfortable, shower - great water pressure, flat screen tv. The free breakfast included several choices including waffle maker, breakfast sandwiches, fruit, yogurt, cereal, bagels, etc.. The staff was friendly and helpful and gave out coupons for area attractions. It's in walking distance to Universal, so we didn't have to pay to park - bonus!! It's also in walking distance to restaurants. I will definitely stay here again!", "Date": "January 14, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Location": "5", "Rooms": "4"}, "AuthorLocation": "SP", "Title": "“I would stay again”", "Author": "Andre_Brasil", "ReviewID": "UR122792808", "Content": "The hotel is well located. Just few minutes from the hotel you can find several restaurants, millenia mall and premium outlet. Room: bed is confortable, shower is nice. Both very clean. Breakfast: few options, just like any other hotel in this category. Staff: very friendly and helped us with everything we needed. Negative points: The room doesn't have a safe. We had to use in the reception. In the second day we noticed the hair dryer were not working. We informed the reception and immediately they left an electric screw driver over the sink.???? At night i complaint about it and finally they fixed the dryer. I would return to this hotel. I recoomend to anyone.", "Date": "January 8, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "AL", "Title": "“Clean and Near Universal Studios”", "Author": "Terri W", "ReviewID": "UR122712621", "Content": "Cute hotel with bright and cheery decor. It was clean and customer service was great. It is a very short drive to Universal Studios and has several restaurants within walking distance. We went to Universal Studios to see Harry Potter. It was a cool place, but the crowd was insane. You could not see anything or get in any of the shops because of all the people. Waited at least two hours for the rides.", "Date": "January 7, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Fairfax Station, Virginia", "Title": "“great \"extra mile\" friendly service!”", "Author": "Jedibusinessman", "ReviewID": "UR122616766", "Content": "We arrived at a busy time -- between Christmas and the New Year (2012) -- and we received prompt, friendly greetings and EXCELLENT service. Front desk manager Emanoel went out of his way to make sure we had everything we needed. Breakfast counter was re-stocked continuously, even when the dining room was full. Courteous treatment by all the staff. Rooms very neat and clean. Walked to Universal and Islands of Adventure, but there was a shuttle if you wanted it. Lots of great restaurants a short walk away.", "Date": "January 5, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Rio de Janeiro, RJ", "Title": "“Great Choice for Orlando”", "Author": "AnnaColagro", "ReviewID": "UR122486806", "Content": "The staff is very friendly, the room (king) is large and clean and the free breakfast is the best I ever had in Orlando. Its worth paying more.", "Date": "January 3, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "", "Title": "“This hotel had it all: great value, excellent service, and top notch accommodations! Great pick!”", "Author": "vpharr", "ReviewID": "UR122339033", "Content": "The location is great, right next to Universal Studios and you can get to Sea World on the trolley line. Several great restaurants in walking distance if you don't rent a car, the staff is friendly and SUPER helpful, the rooms are nice... This hotel is the total package. My whole family stayed here for several days and we were extremely pleased!", "Date": "December 31, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Jacksonville, Florida", "Title": "“Nice clean hotel close enough to walk to Universal.”", "Author": "jenbudd", "ReviewID": "UR121990762", "Content": "Rooms were clean and comfortable. Breakfast was good but it does get really busy. The first morning they were out of quite a few things but the next morning was better. The fresh fruit was a nice snack to bring to the parks. The spa was not hot enough to actually enjoy as a spa but the kids were able to use it as a little pool. It took about 20 minutes to walk from the hotel to Unversal Citywalk and that was with kids in tow.", "Date": "December 22, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Curitiba, PR", "Title": "“JUST PERFECT”", "Author": "REBECA H", "ReviewID": "UR121975018", "Content": "My family and I have just checked in at this hotel. After reading the so many reviews and planning this trip for almost a year now, we can simply say: It`s JUST PERFECT. The hotel is well located, front desk clerk Veronica was super welcoming, the room is spotless (as many have noted before) and the area is quiet for a great night sleep. From what we have seen so far, this is definitely going to be a great stay!!! We do recommend Fairfield!!!", "Date": "December 22, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Philadelphia, Pennsylvania", "Title": "“Get to breakfast early for best selection”", "Author": "LYNNIE72", "ReviewID": "UR121961891", "Content": "I stayed here for 3 nights and had a pleasant stay. The room was just a typical hotel room with a king sized bed, chair with ottoman, and desk with chair. There were no extra bells and whistles, like an in room refrigerator or microwave. The pros (in no particular order): 1) free breakfast (but arrive early for best selection) 2) proximity to Universal's theme parks (you could walk, but it's also a 5 - 10 minute car ride) 3) convenience to places to grab a bite or pick up necessaries (Walgreens is just across the parking lot). Golden Corral, Burger King, and I believe another eatery or two are just across the parking lot as well. Other places to grab a bite are a short drive away 4) cleanliness of the room And I really don't have any cons. If in the area again, I would consider staying here.", "Date": "December 21, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Edgewater, Florida", "Title": "“Great place if you have someone with a wheelchair/power chair”", "Author": "carla h", "ReviewID": "UR121922748", "Content": "Last weekend my husband and I stayed at Fairfield Inn by Universal Studios. My husband uses a power chair. Often hotel rooms are tight even if we have a handicapped room, but the handicapped rooms at this hotel are marvelous! There is plenty of room to get through the door and to run the chair anywhere he needs. There is space in the bathroom for the chair and in the sitting area. There is a bathtub with handles and a bath chair already in the room. It was great to be able to have everything we needed. The staff there is really friendly and nice as well. Great place to stay!", "Date": "December 20, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Jacksonville, FL", "Title": "“Great Hotel, Great Location”", "Author": "Simonmax", "ReviewID": "UR121734263", "Content": "Stayed at this hotel for one night on a Marriott Rewards Certificate. Hotel was very clean and modern looking, front desk was pleasant and informative. Requested early check-in and they were able to accommodate us. Our room was spotless and comfortable. Breakfast offered good choices and was still being enjoyed 15 minutes after it was supposed to end by a few. Coffee and tea were still offered. Plenty of well lit parking and there are quite a few restaurants within walking distance. Would definately stay here again and recommend it to friends.", "Date": "December 14, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Surrey", "Title": "“Very good, british visitors should consider this location”", "Author": "Scotforever", "ReviewID": "UR121631001", "Content": "The hotel is perfectly situated away from the over commercialism on International Drive. It is close to some 24/7 shops and takeways and a Starbucks is 2 mins walking away. I got the room I asked for on the top floor, which whilst next to the lift I did not hear anything. A few minor issues, when busy you may need to park opposite hotel as there are not enough spaces for everyone. The room had no full length mirror, which i personally find useful. Plusses - almost all staff were very polite and aimed to deliver quality customer service, there is a shuttle to Universal, which when is great when the parking is now $15 (what a rip off). The breakfast room was well eqipped and staff within it were very welcoming and helpful. Overlall a very good hotel, striving to gain good reviews and visitors from everywhere, 2 other issues I had wer dealt with very quickly and to my complete satisfaction.", "Date": "December 11, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "", "Title": "“Great Service & Clean Room”", "Author": "Nick0324", "ReviewID": "UR121528413", "Content": "I checked in today at the Fairfield Inn and I was greeted by Emanuel, who provided me with professional and friendly service. The room was clean and had great amenities. The internet access was quick, and the bed was comfortable. I would recommend this to anyone staying in the Orlando area!", "Date": "December 8, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "", "Title": "“A nice surprise!”", "Author": "terrirobin", "ReviewID": "UR121496247", "Content": "This was such a pleasant stay. The room was comfortable, very well kept up and clean. Everyone was a delight to deal with. The breakfast was one of the best of its kind I have experienced with a great selection for those on the go. I would recommend it to anyone wanting easy access to the area and a no hassle stay.", "Date": "December 7, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Miami, Florida", "Title": "“EXCELLENT”", "Author": "LizFG", "ReviewID": "UR121474416", "Content": "GREAT FREE BREAKFAST, AWESOME CUSTOMER SERVICE. Just a short walk to the parks to get the blood flowing for a great day of fun. Would def stay there again. Starbucks, Ale House and other places very close by.", "Date": "December 6, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Livingston, New Jersey", "Title": "“Best service in the area”", "Author": "AC213615", "ReviewID": "UR121358238", "Content": "This hotel has everything you would want- clean, comfortable rooms, a location directly across from Universal Studios and walking distance to shopping and dining options, and a great breakfast that includes options for all; however, the thing that sets this property apart is the service. I have stayed in hotels that cost double this rate and not received the exemplary service of this hotel staff. From a complimentary bottle of water when I cleared my throat at check-in to the special bandage given for my foot- these people enjoy what they do, and it shows! If you are in the area, this is where you need to stay.", "Date": "December 3, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Prairieville, Louisiana", "Title": "“Above and Beyond!”", "Author": "Nicole F", "ReviewID": "UR121136334", "Content": "We did lots of research on area hotels before booking with the Fairfield Inn in Orlando. There are so many to choose from! We were so impressed with the reviews we read, our decision was made. We were not disappointed! Emanuel and Juan were wonderful! We checked in promptly. The hotel is very clean and well kept. All staff we encountered were so nice and helpful. The breakfast was great and was constantly being cleaned as people ate! We will definitely stay here again!!!", "Date": "November 28, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Peachtree City, Georgia", "Title": "“Great place to stay!”", "Author": "LindaShoe", "ReviewID": "UR120903574", "Content": "After reading many hotel/motel reviews, I chose the Fairfield Inn Universal Studios for our three-night stay recently. I was not disappointed. The staff was friendly, courteous, and very helpful. The day we arrived, my husband and I visited City Walk. After a few hours, we decided to walk back to the Fairfield. Not a bad walk at all. We took the water taxi to the Loews Portofino Bay hotel, walked out the front door, and down the driveway to the street. Made a left on the sidewalk, and we were almost to Kirkman Road. (In my Universal guidebook, I read that you don't have to stay in an onsite hotel to use the water taxis.) We used the Fairfield shuttle both days we visited the parks. Two different drivers ... both courteous and friendly ... and on-time. Breakfast was great ... lots of choices, including homemade waffles. We would definitely stay at this hotel again. Thanks, Emanoel, for helping to make our stay so nice.", "Date": "November 22, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Sarasota, Florida", "Title": "“Great stay near Universal!”", "Author": "HouseMother", "ReviewID": "UR120811996", "Content": "We spent one night at this hotel in order to be near Universal Studios Orlando. It was clean, staff was friendly, we had everything we needed in the room and for breakfast. Very convenient to Universal Studios -- nearly across the street. I noticed plenty of restaurants, outside the park nearby, but we chose to go straight over to Universal City Walk (no ticket required) for our meals. We were traveling with a family of five. Would definitely stay at this Fairfield Inn again.", "Date": "November 20, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Scituate, MA", "Title": "“Good, Solid and Friendly”", "Author": "shem01", "ReviewID": "UR120797333", "Content": "We stayed two nights in November. Everything went smoothly. Nice touch having coffee in the lobby 24x7. The staff manning the desk were very personable, helpful and nice. the food at breakfast was good, typical of a Fairfield or Springhill.", "Date": "November 19, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Orlando, Florida", "Title": "“Support to the Utmost”", "Author": "Layton_E", "ReviewID": "UR120724837", "Content": "It is with great resound that i acknowledge the great hospitality, comfort and support of this esteemed Hotel. For the past three weeks i have been in awe with this superb staff. Mariant is extremely suited for her position and absolutely gorgeous. She is complimented as well by Emanoel. They are informed, knowledgeable, and caring. A great team and true drawing power for many return visits. i wouldn't stay in any other place. Location, accommodations and this magnificent staff make for a great place to stay over and over again.", "Date": "November 17, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Bolton, United Kingdom", "Title": "“Nadia looks after you like a Mum!”", "Author": "gill m", "ReviewID": "UR120591994", "Content": "Great location, comfy beds, very clean and excellent staff. BUT the best thing is the inclusive breakfast and NADIA - she is a gem - nothing is too much trouble. You would not get better service at a full service restaurant. Waffles were superb but beware if you finish it too quickly Nadia will make you another one. A definate recommend!!", "Date": "November 14, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "", "Title": "“Style & Class mixed with home comfort in Orlando.”", "Author": "Jason_Elliot", "ReviewID": "UR120423521", "Content": "Thank you to staff for the accommodations made for me during my stay. Emanoel at the front desk was very helpful. Thank you a lot.", "Date": "November 10, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Ormond Beach, Florida", "Title": "“Customer Service Extraordinaire”", "Author": "Gregory K", "ReviewID": "UR120205653", "Content": "From my initial contact with Juan (who was able to bump up our room to a suite) and to Nadia in the breakfast area, the stay was wonderful. Marriott is in a class by themselves. Only a handful of companies in America can provide first class service each and every time. Thank you, Greg Kirkwood", "Date": "November 5, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Jacksonville, Fl", "Title": "“Just right for us”", "Author": "nicko591", "ReviewID": "UR120124105", "Content": "My son, daughter and I stayed one night while attending Halloween Horror Nights at Universal. This hotel is quiet, family friendly, and clean. Before arriving, I had requested a roll away bed and it was delivered promptly by a very polite staff member. Continental breakfast was satisfying with homemade waffles and plenty of juices and coffee. This is a must stay hotel for the convenience, location, cleanliness and staff professionalism.", "Date": "November 3, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Panama City, Panama", "Title": "“CCC...Comfortable, Convenient, Cheap !”", "Author": "Miguel H", "ReviewID": "UR119799191", "Content": "I spent a whole week in this hotel during my boyfriends first visit to Disney World, actually our first trip together. You have nothing else to ask for. conveniently located, comfortable bed, very clean room, huge bathroom, nice pool and jacuzzi to relax after a whole day at parks...and most of all, EXTREMELY friendly staff at front desk and breakfast room. Very good price. Lets face it, when you go to Disney World, you spend 80% of your day at the parks, so you dont need a resort which amenities you wont even have time to enjoy. Trust me...this is the place to stay !", "Date": "October 27, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "ljanelle85", "Title": "“Great non-resort in Orlando”", "Author": "ljanelle85", "ReviewID": "UR119605307", "Content": "I went to Universal with my mom and stayed at Fairfield for 2 nights (Friday-Saturday). The front desk staff is beyond nice. I travel a lot and I'm used to grumpy check-in clerks, especially later in the evening, but even after dealing with a huge, non-English speaking group in front of me, the guy behind the desk was pleasant and helpful. He even gave me free bottled water when I asked for change so I could hit up the vending machines. If you ask, they have a printed map of a running trail near the hotel. My mom was going to go but was hesitant about running in the area by herself, so she hit the gym instead. She had a great workout but since treadmills are limited, she had to quit at 3 miles because there were 2 people waiting in line at 7 in the morning. The rooms were clean and quiet. The hotel is definitely within walking distance of Universal if you're used to walking. It took us fifteen minutes of brisk walking to get to the gate (and we're both runners), but beware if you're going to walk a lot at the park - the walk back to the hotel is a lot harder than the walk there, haha. Also, go left down Kirkland and right on Major instead of walking down Vineland - it's faster (we tried both). Breakfast was great. Lots of options. Note that if you book a room without a sofabed, you won't have a fridge or microwave. Didn't bother me because I knew this going in. I will definitely stay here again next time I'm in town.", "Date": "October 22, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Las Vegas, Nevada", "Title": "“very nice services”", "Author": "Isamu T", "ReviewID": "UR119571552", "Content": "clean, front desk people were so nice. walgreen is close, anyway, if I have a rent a car, I must choose this hotel.", "Date": "October 21, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "NY", "Title": "“Perfect for what we needed”", "Author": "kaffeineub", "ReviewID": "UR118567344", "Content": "Hotel was clean and neat. Just around the corner from Universal. There is a Wendy's and a Burger King next door as well as an Ale house, Walgreens, and Kobe in the plaza adjacent to the property. Pool and hot tub had plenty of lounge chairs. We had a small fridge and microwave in the room which was great for the trip. When we came back to the hotel around 10:30pm from dinner we had trouble finding a parking spot and ended up circling the lot for 6-7 minutes before finding somewhere to park", "Date": "September 25, 2011"}, {"Ratings": {"Location": "5", "Overall": "5.0", "Value": "5", "Service": "5", "Rooms": "4"}, "AuthorLocation": "Caracas, Venezuela", "Title": "“Good service, nice staff”", "Author": "Carolinauf", "ReviewID": "UR118198147", "Content": "We were there for 10 days. Near the main attractions , the room comfortable, breakfast is ok. Ver y nice staff, people in the frontdesk are very nice and friendly all of them.I would come back!", "Date": "September 16, 2011"}, {"Ratings": {"Location": "5", "Overall": "5.0", "Value": "5", "Service": "5", "Rooms": "5"}, "AuthorLocation": "West Palm Beach, Florida", "Title": "“Great stay!”", "Author": "WPBMoxiegal", "ReviewID": "UR118071155", "Content": "When my husband and I travel, we like a central location, friendly surroundings and great service. We found all three at the Fairfield Inn & Suites Universal. When we checked into the hotel we were greeted with smiles, freshly baked cookies and lemonade! The room was perfect and we will be back. Thank you!", "Date": "September 13, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Jacksonville, Florida", "Title": "“My favorite hotel in Orlando”", "Author": "marcy602004", "ReviewID": "UR117997728", "Content": "This hotel has the friendliest staff and the cleanest rooms.", "Date": "September 12, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Wesley Chapel, Florida", "Title": "“Great Service from Nadia”", "Author": "Ken C", "ReviewID": "UR117969449", "Content": "We had a great stay at the Fairfield Inn & Suites Universal Studios. The accomidations were great and the staff was Super nice and accomidating. We really appreciated the extra help and service from NADIA who helped us at breakfast. Thanks so much for making our stay memorable.", "Date": "September 12, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "4", "Overall": "4.0", "Value": "4", "Service": "4"}, "AuthorLocation": "Tallahassee", "Title": "“Great Service! Super Clean!”", "Author": "FSU2000", "ReviewID": "UR117922582", "Content": "I travel to Orlando often for work and business, so I've stayed a variety of hotels in the city. I will stay at this location again and would recommend, especially if planning to visit Universal Studios. I made my reservations on line and included a request for a room on high floor on the poolside of the hotel. When I checked in they honored my request. Staff were very nice and offered suggestions and discounts for City Walk. The lobby, room, pool and gym were very clean. The gym is a bit small; they only have one treadmill, one elliptical and a universal gym machine. Outside of that there were no negatives about this hotel.", "Date": "September 10, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "4", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Collegeville, Pennsylvania", "Title": "“Super Clean Place and Very Helpful and Friendly Staff”", "Author": "GAD09052011", "ReviewID": "UR117698182", "Content": "This review will be factual and possibly picky as in Nit-Picky. I hope you find this information very useful. The Fairfield is located in a convenient location near plenty of places to eat that are walking distance. Many local restaurants to choose from are very close, with delivery as an option for most. We had pizza delivered once by Flippers. It was good stuff. Not top shelf, but it will not disappoint. Ale house across the parking lot serves good bar food and has sports on the TV. I think the Ale house is the place to handout on the weekend; parking lot is crowded in the evening. Good starting point if you want to drink, because city walk drinks can be expensive. Free breakfast is included – need I say more. I will, the regular employee, Nadia was very sweet and helpful. She made the waffles each morning, served breakfast, and clean up after us. I gave her a tip, and she gave my family 4 bottles of water each day, and a bunch of bananas plus special K cereal snacks. If you stay here please tip, since your breakfast is free. Breakfast alone will cost you while staying in Orlando, where a tip is how they make a living. I deducted some points here because of the eating area chairs had sticky arm rests from syrup- those kids and their waffles. :) The rooms were very clean, no bed bugs, or spiders, or dust. Only the cleaning service was slow to make their rounds, and they usually did our room around 4pm, and on one occasion, we interrupted her to do a quick change for the pool. A little CON here - I think they need to get them done earlier in the day incase folks want to clean up and go to another park mid-day. They have a place to come back to and change quickly. But hey, we only spent the week sleeping, where most of the time we were out and about. The front desk folks are great too. Javier and the others were very accommodating. I asked for extra blankets and pillows for the kids because they were on the pull out sleeper. I use one of the extra blankets for adding cushion to the bottom of the thin mattress and allow support for the girls. The kids found it comfortable after adding it and making the additional layer. TIP: This hotel is even close to universal, approximately one mile to bus and taxi drop off point. On one occasion, we crossed the street from the Ale House, and went through the landscape into the Portofino hotel backyard. There we found our way through their hotel and to a water taxi into universal studios. It was sort of criminal, but adventurous for all. If you visit Universal Islands of Adventure wear you bathing suits. You will get wet and you will rash up if you do not – you know what I mean. I see too many people visiting from other countries wearing jeans and shorts only to be paying $5 to get them dried. Speaking of other countries, the last week of August has folks coming from Brazil. They are very rude people. Beware of them. The brits were in town at the same time, and I found them polite and charming. Just my observations. Places to eat: Margaritaville Hard Rock TGI Fridays Ale House Things to do: Do the Disney Typhoon Lagoon – The swim with the fish in a real salt water tank was nice. Do the Blizzard beach – Great Slides and the kids have great areas to hang out? Ratings for Aquatica and wet and wild were not high. I passed by the wet and wild and it looks cheesy. Do the Island of adventure - Harry Potter Castle ride first, it backs up fast and it is located in the very back. The Champions double roller coaster has a lesser wait time.", "Date": "September 5, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "4.0", "Value": "5", "Service": "5"}, "AuthorLocation": "new york", "Title": "“Clean and Comfortable”", "Author": "mommatish", "ReviewID": "UR117639523", "Content": "This is a great hotel at a great price. It was clean and comfortable. really convenient to Universal. Considering that you are getting breakfast free, I think it is great (cereal,fruit,toast,waffles). People who work there are great, friendly and helpful. Btw, the Ale house on the other side of the parking lot had great food, ate there twice.", "Date": "September 3, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Cape Canaveral, Florida", "Title": "“Warmest of Welcomes from Javier and Juan”", "Author": "ReliableJohn", "ReviewID": "UR117592503", "Content": "My wife and I met Javier and Juan when we arrived and we were treated like \"family.\" It felt like we had known these two for years. They had ordered pizza for their own lunch and asked us if we would join them. Polite, super friendly, courteous and allowed us to check in at 1 PM. Asked if the room was suitable. It doesn't take much to be friendly and helpful. The room was great but after this welcome we expected only the best. It made a real difference to our trip. Many thanks \"Javier\" and \"Juan\", our new family members.", "Date": "September 2, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Orlando, Florida", "Title": "“The kind of service you don't often find any more.”", "Author": "Bob-Proctor", "ReviewID": "UR117134239", "Content": "Everything, from making the reservation to relaxing at breakfast was done with the warmest touch. The local sales staff, front desk and breakfast service folks all delivered a \"best in class\" experience. I especially have to name the \"breakfast lady,\" I believe her name is Nadia. Behind the scenes had to be on top of their game too, the rooms and facilities are spotless so housekeeping needs a shout too. This obviously is a very well run property.", "Date": "August 23, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Bumpass, Virginia", "Title": "“Incredible Experience”", "Author": "Christopher E", "ReviewID": "UR116855067", "Content": "My wife and I took our children to Disneyland for vacation. We stayed at the Fairfield Inn on International Drive. As we arrived we were greeted warmly and with excitement. Our rooms were very nice and clean, not to mention the rest of the hotel was just as spotless. Anytime we needed anything the staff was very willing to help us. IE if we needed directions they were knowledgeable, or if we just needed something for our room. the continental breakfast was exceptional and there was plenty of food for everyone. I was impressed how the staff would ask if they could get you anything while you were eating. You normally do not get this service with a continental breakfast. It was a pleasure staying here and if we ever make another trip to FL will certainly stay here again. Not to mention we will suggest the Fairfield Inn to friends that may be taking vacation there. Thank you to the Management and staff for making our stay a pleasant experience. The Emmert Family from Va", "Date": "August 17, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Wesley Chapel, Florida", "Title": "“Can't wait to come back!”", "Author": "Tamtamw4", "ReviewID": "UR116828158", "Content": "This was such a great experience! The rooms are clean and very modern with a flat screen tv. Breakfast was amazing- waffles, bagels, oatmeal, yogurt, cold cereals, four juice options, sausage egg and cheese biscuits, etc. In the afternoon, there were fresh baked Otis Splunkmeyer cookies. The employees, especially Emanuel, were friendly and helpful day or night.", "Date": "August 16, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Jonesboro, Georgia", "Title": "“\"we loved it and we'll be back!\"”", "Author": "Karen E", "ReviewID": "UR116773782", "Content": "My husband and I stayed for five days and had the most enjoyable experience from the moment we stepped into the lobby . The young men at the desk were so friendly and helpful as well as the women who helped at the breakfast tables. Our rooms were cozy and exceptionally clean. We enjoyed our stay so much we didn't want to leave. We would highly recomment this Inn for anyone coming to the Orlando area. Karen & Fred", "Date": "August 15, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Foley, Alabama", "Title": "“*****Hours of Operation *****”", "Author": "Mike M", "ReviewID": "UR116660357", "Content": "To all We had a wonderful time on vacation the staff at this hotel was awesome I like to set the stage- I work in the hospitality Service as Guest Services Director For a large Resort in Orange Beach Ala. www.cariberesort.com So, I have a good idea of what I am looking for- now since my line of work is cleaning Condos- it hard to compare the size units and property we have towards a Hotel- When we arrived we were welcomed by a live person who checked us in at 4:30am Are room was clean! Cold so nice –I was ready to get off the road – 2 queen size beds- Room was CLEAN saying it again! – I got some new ideas to use at our Resort it was like working but looking as well Javier & Daniel – Emanuel where awesome to interact with, they all dress so nice-helpful in True gentlemen who love their job – great people skills - again! I know I do with for a living!!!24/7/365 So many ways directions getting lost- breakfast each morning Coffee 24 hrs a day with 3 girls –7 14 47 The ladies who work this area are so nice! The front desk Staff being able to speak different language Was great my wife is from Brazil so it made her feel so welcomed- Now, let me tell ya about Veronica this lady never stopped cleaning! ***** The property is much secured; the area was nice close to everything – price great Very clean grounds- ***** we were able to walk to Universal Orlando ***** We elected to drive and not use shuttle service but bus was picking people up So it worked. Pool and hot tub outside was great *****FREE INTERNET WIFI I rate this whole stay a 5. We made it home alive from a long trip- no car troubles Great roads – The Parks where packed with people- wait too long to see Harry Potter- I knew this going in with Schools out but still hold on to your child- I found a lost kid During my trip and turned him into Security – I just knew what the signs are. So much more! learning during time away was a awesome experience", "Date": "August 13, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Ocala", "Title": "“Home away from home”", "Author": "lazyasL", "ReviewID": "UR116430745", "Content": "Like leaving home and arriving to your second home. Not treated as a traveler, but as a family member. Everyone on staff was great and gave informative information to make our trip more enjoyable, comfortable and problem free. Entire Hotel was immaculate at all times. Have now made this our home base on our future Orlando trips.", "Date": "August 8, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "4", "Overall": "4.0", "Value": "5", "Service": "4"}, "AuthorLocation": "chicago", "Title": "“You can't beat the price”", "Author": "ttrinter", "ReviewID": "UR116024557", "Content": "We stayed here when we went to Universal Studios. It was your average chain resort and it was good value. While all the other nearby hotels were quite expensive, this was a very reasonable price. It was also close to Universal and offered a shuttle service. We chose to drive ourselves to the theme parks, but it looked a lot of people were taking advantage of this service. Breakfast was also included which was ideal for us. I would stay here again, if I was going to Universal Studios.", "Date": "July 30, 2011"}, {"Ratings": {"Cleanliness": "2", "Sleep Quality": "4", "Overall": "4.0", "Value": "5", "Service": "3"}, "AuthorLocation": "Georgiana, Alabama", "Title": "“The best General Manager”", "Author": "theprinces12", "ReviewID": "UR115999443", "Content": "I just need to let everybody know about Angela Bell, General Manager at the Fairfield Inn & Suites by Universal, the way that she resolves guest issue, is very professional, she goes whatever it takes, the ensure the satisfaction in our need. Thank you sooooo much Ms Bell, and we are coming back next year for our next vacation!!", "Date": "July 29, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Tampa, Florida", "Title": "“Wonderful Experience!!!”", "Author": "eaguilar0402", "ReviewID": "UR115374037", "Content": "Excellent experience, from the moment I stepped in I received the warmest of greetings, the staff is very attentive, and rooms are clean, comfortable and have the amenities that make your business trips feel less of business and more like play. Javier Moreno was very helpful and happy to show me the executive suites which provide a spacious room that includes sleeping area, sitting area and extras for a great price! This will be one hotel I will recommend my organization to use for future events. I look forward to returning to this hotel the next time I'm in town.", "Date": "July 14, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Chillicothe, Missouri", "Title": "“July 4th stay for son's R&R”", "Author": "mopate", "ReviewID": "UR115249730", "Content": "My son was on his R&R from Afghanistan, so I planned a family trip to Florida. We stayed in Marriott properties throughout our traveling and during our stay in Florida. After visiting family in another part of Florida, we decided to stay here for a couple of days. We loved the property so much, we stayed an extra day!! All the staff were wonderful, the rooms were nice and very clean, the pool was great and the breakfast area and food were very nice. Javier (spelling?) was AWESOME...we wanted to find a good place to see 4th of July fireworks, and he graciously provided us with a list. We had done the Universal thing a few years ago, so we opted to go to Sea World. We also went to Fun Spot to race go karts!! They have the best tracks we've ever been to and my family had a great time (we even left our entrance bracelets on and went back to race more after Sea World). Thank you for making our stay so nice, especially for our son!! : )", "Date": "July 11, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "4", "Service": "5"}, "AuthorLocation": "Belém, Brazil", "Title": "“A perfect stay”", "Author": "DavidNormando", "ReviewID": "UR115065272", "Content": "My family had a wonderful stay at Fairfield Inn and Suites Orlando near Universal Studios. This Hotel is walking distance from Universal. But the best is that we can feel every piece of care. The lemonade when we arrived exausted from the parks, gifts for kids during the breakfast, and a wonderful staff at the front desk (Emanoel, Juan Daniel and Javier) always helpful. All of them speak Portuguese, Spanish. I strongly recommend this hotel.", "Date": "July 5, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Alpharetta, Georgia", "Title": "“The best Fairfield Inn & it is in a great location!”", "Author": "RoadWarrior022", "ReviewID": "UR115027949", "Content": "My family of 3 had a KIng Studio which was roomy & comfortable. I stay at Fairfield Inns all the time and this in one of the best. The front desk staff is genuinely helpful and the condition of the hotel & rooms are excellent. The location was great for the I4 attractions & Universal and it was an easy 10 minute drive to Disney.", "Date": "July 4, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Jacksonville, Florida", "Title": "“Great Service”", "Author": "flvstraveler", "ReviewID": "UR114628163", "Content": "I had to stay here for a corporate training. The breakfast was good (although I miss the juice machine), the rooms were clean, and the staff was great. There was a REALLY nice guy on the front desk name Eduardo (or something like that) who signed me up for the free rewards and gave me some delicious cookies. He went above and beyond. Great stay, especially for the price.", "Date": "June 22, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Jacksonville, Florida", "Title": "“Best service EVER!”", "Author": "smepperson", "ReviewID": "UR114625645", "Content": "Just wanted to give a shout out to the super awesome Emanoel Frias! Seriously, the best front worker ever. Per request, he made cookies for some of the FLVS teachers.", "Date": "June 21, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "4", "Overall": "5.0", "Service": "5"}, "AuthorLocation": "Jacksonville, Florida", "Title": "“Great Service”", "Author": "ARait", "ReviewID": "UR114624930", "Content": "I'm staying in Orlando at the Fairfield Inn and Suites by Universay Studios. The rooms are contemporary and nice. Very clean. After a hard day of training, it was nice to come back to the hotel and relax. The person at the front desk, Emanoel Frias is wonderful. He went out of his way to help me feel like a special guest - such great hospitality! I am so glad that my company uses this hotel for its out of town employees. I know that when I come back I will be treated well.", "Date": "June 21, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Buenos Aires, Argentina", "Title": "“Amazing stay!!”", "Author": "sasita70", "ReviewID": "UR113166097", "Content": "We mainly chose this hotel due to the prior reviews and the good price. We didn't imagine it would be such a nice hotel!!! When arriving, the guy at front desk was really nice and helpful. The room we booked was the suite and it was fantastic, it was really clean and neat, and so big!! the bed was so comfortable. Then, also all the complimentary services such as internet, parking and breakfast were great. The breakfast is good, with a good variaty for a complimentary service. I've been to other hotels with complimentary breakfast which did not provide as many as products as this hotel. And they also provide hot/cold beverages and cookies all day long. The pool is really nice, and the jaccuzzi is great too!! they give you towels for free and there are plenty of chairs around the pool. They also has a laundry for guests which you can use at any time with your own products and for only just a few quarters. They algo gave us some discounts for Universal Studio park, which is just 5 min away from the hotel. All in all, I will stay here again and I will recommend it to every one going to orlando.", "Date": "June 13, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Massachusetts", "Title": "“It was an enjoyable two-night stay, great accommodations, friendly staff, and most of all very clean.”", "Author": "MadieP", "ReviewID": "UR108798770", "Content": "Save money on breakfast and take advantage of an excellent complimentary breakfast available at the hotel. Offered a great selection of breakfast items to choose from.", "Date": "May 18, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Cinnaminson, New Jersey", "Title": "“Great value and nice facility”", "Author": "dutchy49", "ReviewID": "UR108239755", "Content": "Just got back from a 5 day/4 night visit to Universal Studios. The Fairfield Inn on Vineland Road, just off of Kirkland, was a terrific find. Prices were reasonable, breakfast was included (including fresh waffles), complimentary shuttle to/from the park (twice to the park in the AM and three times back in the evening), fresh made cookies in the afternoon, a small but nice pool and free Internet access all made this a very good value. It's very close to the park (taxi cost us $4.40 one way the only time we didn't want to wait for the shuttle). Desk staff were very friendly as were the breakfast area staff. Another plus is that there are many restaurants close by to choose from, including one that provides room service to the Fairfield Inn. I''ll admit I was a little cautious because of some negative reviews but I was very pleased.", "Date": "May 14, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "4", "Overall": "1.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "US Navy Afloat", "Title": "“Check your reservation, before you arrive”", "Author": "MCPO-USN-2011", "ReviewID": "UR105865683", "Content": "I am an avid fan of Marriott properties - however this visit required a rather harsh review. Made my reservation, online....well in advance....for a King Room. Had my confirmation, and everything is good to go. Have stayed here before, and never had any problems. However, upon arrival----I was told that they \"over sold\" the rooms, and had no King rooms available. Front Desk reception was very helpful, however could not provide me any further info----other than \"We changed your reservation from a King to 2 double beds, because we oversold the hotel\". Unfortunate for me----I cannot sleep in a double (comfortably) due to my height.....plus, it wasn't the room I reserved. The hotel is very nice-----very close to Universal----and a great free breakfast. However, the poor Management (overbooking their property) and the lack of any assistance to get me into a King room, prevents me from recommending this property----especially when there are so many hotels nearby. Check your reservation the day before.....just to make sure you still have what you reserved.", "Date": "April 27, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Trinidad", "Title": "“Great service!!”", "Author": "Ninette1976", "ReviewID": "UR105814354", "Content": "This is a great hotel for value.....clean and comfortable...having breakfast downstairs included was a great benefit. Perking could be tricky on Saturday night and more shuttle intervals would have been nice, but its a great place to stay. The location is great for the parks and shopping. Would certainly stay here again!!", "Date": "April 27, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Viera, Florida", "Title": "“Very Nice Hotel”", "Author": "Pixelsaj", "ReviewID": "UR104842099", "Content": "We had stayed in this hotel a few years back and really liked it so we booked it again for our weekend getaway. The hotel is very clean and the staff is super friendly. They have a pretty good complimentary breakfast bar too. Our room was on the 5th floor next to the stairway so it worked out great as we could go down the stairs and out the side door. I only wish the shuttle ran several times a day instead of only one pickup in the morning and one drop off in the evening. We had wanted to go over to City Walk around 4 one afternoon but did not want to pay the $15 parking fee just to walk around. We had thought the shuttle ran every 20 minutes like it used too. But that was the only negative. The bed was comfortable, the room was very clean and nice, we had a view of the front area and could almost see the entrance to Universal. There are a few restaurants within walking distance as well as Walgreens. I would definitely stay here again.", "Date": "April 20, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Bellingham, Washington", "Title": "“Excellent deal, clean, close to Universal.”", "Author": "PNW2011", "ReviewID": "UR104823205", "Content": "The staff was friendly, the rooms very clean and updated. Continental breakfast was good with plenty of seating. It was an easy 10-15 minute walk to Universal which we did the first day. The second day we rode the shuttle which was convienent and nice for tired feet. Several restaurants within walking distance. Complimentary parking was nice as not all the nearby hotels offer that. I would definitely stay here again if we return.", "Date": "April 20, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Venice, Florida", "Title": "“Above and Beyond Staff”", "Author": "SilverJay88", "ReviewID": "UR103407408", "Content": "I just returned from a 2 night business trip for some training seminars and had a noteworthy experience at this Fairfield Inn. The staff at check in were energetic, friendly and eager to help in anyway they could. In fact, every employee I encountered during my stay had a big grin on their face as if they loved their jobs. The room was clean and comfortable. Their was a short note from the manager that welcomed me to the room but was also light hearted and humorous. It included a list of meaningless facts like \"the skin that peels off after a sunburn is called 'blype'\". I got the feeling that the positive customer first attitude from the manager had infected her entire staff. I had the housekeeper stop me in the halleway to ask if my room had been cleaned to my satisfaction. The reason I took the time to write this is because in over 311 stays in Marriott brand hotels, I have never been so impressed with the overall quality of service. This Fairfield's staff could handle a JW Marriott or Ritz Carton. I'll be back.", "Date": "April 9, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "USA", "Title": "“Mmm - Cookies”", "Author": "Swlc2001", "ReviewID": "UR102324898", "Content": "I booked a 2 night stay and when we arrived fairly late on our first night, we were told our room had been over-extended by the current guests and that there were no rooms for us. However, the hotel put us up at the Pointe Orlando resort ( a time-share) for free for our first night. This was fine with us and was only about 5-10 minutes away. We did take advantage of the fresh baked cookies b/f we left for the Pointe. The next morning, we planned on going to Universal Studios, so we went back to the hotel to park and partake of breakfast which the Pointe offered at at cost and the Fairfield's is complimentary. We took the free shuttle to the Park and then later we walked back to the hotel...about 10-15 minute walk. We were hoping for the fresh baked cookies to top off our night, but alas, they were all gone. We mentioned our disappointment to Lynette our front desk receptionist and she offered to bake some for us. We went to our room and when we called to see if the cookies were ready, they weren't and we were so tired we fell asleep. But the next morning after eating breakfast and before we checked out, we again voiced our disappointment over the wonderful cookies and Max offered to bake some for us. So, in the end, right before we checked out at noon, we had yummy cookies. The beds were wonderfully comfortable and the breakfast was hearty.", "Date": "March 31, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Sleep Quality": "2", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Detroit, Michigan", "Title": "“DO NOT USE YOUR DEBIT CARD TO PAY FOR YOUR HOTEL STAY”", "Author": "TheGoGetters4", "ReviewID": "UR100610169", "Content": "We arrived on Sunday, March 13, 2011. The check in went smoothly and the hotel was nice. No, its not a 4 or 5 star hotel, but it was clean and doable for the time we would be staying there. We paid with our debit card at check in from the entire stay. The next day we noticed that the hotel charged us an additional $70.00. When I called ask what was this charge for, they said it was incidentals, etc. Ok, I was wasn't alarmed by that because some hotels do that. Well the next day they charged us another $70.00. Then the day after that they charged my debit card $140.00 and they day we checked out they charged another $170.00. I was completely floored, I went back and forth between the bank and the hotel. The back thing about it is the hotel did not see the charges on their end. At this point, the situation is still not resolved we're still fighting to get these charges off. So word of advice, DO NOT USE YOUR DEBIT CARD TO PAY FOR YOUR HOTEL STAY at this hotel.", "Date": "March 18, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "3", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Tallahassee, Florida", "Title": "“Great Access to Universal Studios”", "Author": "MisterWombat", "ReviewID": "UR96085590", "Content": "The hotel is conveniently located across from the entrance to Universal Studios, an easy 10-15 minute walk to the ticket booths. Hotel has a ticket kiosk in the lobby and gives out cards good for discounts at Universal shops. Lots of dining options in the area , walking distance. Free parking, free shuttle to Universal. Basic continental breakfast included in the room rate, usual cereals and breads, nothing hot except waffles. Room was good size, shower and tub, plenty of hot water and towels, heat and air conditioning OK. Free wired internet in rooms, wi-fi in lobby. Sink area a bit small and no refrigerator.", "Date": "February 9, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Brantford, Canada", "Title": "“Highly recommended! Walking distance to Universal!”", "Author": "hale4760", "ReviewID": "UR96044151", "Content": "This hotel should be rated higher! The hotel staff were friendly,and always with a warm greeting. The room we stayed in was clean, bright and spacious. The breakfast in the morning is extensive, and is a great way to start the day. The cookies on the front desk were also a delicious touch. We did take advantage of the shuttle to and from the Universal Parks; when we didn't, the cab fare was under $10 dollars, but the walk is manageable. We only took a cab due to severe rain one day. There is a great pub restaurant in front of the hotel that serves amazing food at fair prices, and they also service the hotel if you would prefer takeout. For the price, this hotel is well worth it. We highly recommend this hotel if you are planning on visiting Universal Studios.", "Date": "February 9, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Stevensville, Maryland", "Title": "“wonderful hotel”", "Author": "Traveler12315", "ReviewID": "UR95790933", "Content": "This hotel was beautiful. It was freshly renovated. Nice staff, very pleasant and helpful. They have a shuttle for Universal Studios but Universal is so close, you can walk it within 15 minutes. Very nice breakfast. Walgreen's and Golden Corral in front of hotel. McDonald's down the street. We arrived at 10:00 in the morning to the hotel and they put us right in a room. The only con was that we decided to go to Disney the day we arrived, but we didn't have a car. So we took a sedan to Disney. Very costly, but hey who wouldn't want to go to Disney for the day.", "Date": "February 7, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Abbotsford, Canada", "Title": "“Nice and Close to Universal Studio, less than a 5 minute drive to the park”", "Author": "Abbey_Travelers", "ReviewID": "UR92344335", "Content": "Renovations in progress, but our room was newly renovated with big screen tv, Everything was fresh and clean, Continental breakfast was a basic, cereal, muffins, toast and waffles. Disapointed hot tub not working but we could use the one next door at the Best Western, since this was unacceptable due to mobility issues. We were componsated and the service was great. Front desk staff friendly and helpful, to even suggesting a place for my wife to get her nails done. No time share salesman at this hotel which was nice. Used the Universal package to book this hotel and qualified for early entrance to the park. Not as convienient to Disney but still only a 15 minute drive to Disney. Pictures on Trip Advisor were acurate", "Date": "January 9, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "3.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "New York", "Title": "“One Night Stay to visit Universal”", "Author": "Kappa1991", "ReviewID": "UR92143818", "Content": "My husband & I stayed here for one night during a short visit to Universal. The hotel was OK. Now ... don't get me wrong. It was clean, and the bed was comfortable, but it was just eh. Nothing special. The living area couch was hard, but luckily we didn't spend much time sitting around. The bathroom was clean as was the rest of the room. Ample towels and nice toiletries. I did use the hot tub, and i did not find it to be too hot. It was actually the perfect temperature. IT was kind of chilly when I went into the hot tub, so the heat felt good. The pool area was completely shaded by about 4:00 PM. We did not eat breakfast or use any of the other facilities because we were there for such a short time. We had a car, so we did not walk, but it felt like it could have been walked easily ... maybe not in the heat of summer, but it would have been a nice walk in May. There was a cool bar across the parking lot where we ate and sat outside with our drinks. Nice that we did not have to drive to get something to eat. Would I stay here again? Yeah ... I guess so. Would I rave about the place ...nah, but for what I paid (I got the room for $60,) it was worth it.", "Date": "January 8, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Trinidad", "Title": "“The best hotel in Orlando”", "Author": "kurttackoor", "ReviewID": "UR90585266", "Content": "I am presently a guest at this hotel. I have been here a week now and I am highly satisfied with everything about this hotel. I have no complaints. I always try to stay at a Marriott when I travel, however this is my first time at a Fairfield Inn and Suites. The hotel is almost similar to the Courtyard by Marriott hotels. The beauty about this hotel is the close proximity to everything. Its an easy 10 minute walk to Universal Studios. The other theme parks are a 15 minute drive away. The hotel has an excellent taxi service (CBC) attached to it, which is very prompt and always arrive before time. There are numerous eating places nearby, from Japanese to Italian to fast food. The service at the hotel is nothing short but exceptional. The rooms are large, tidy and well kept. They are cleaned everyday including weekends. The front desk personnel are highly helpful and very friendly. Service from them is always with a smile. The staff comprising Daniel, Juan, Lynette and Loseli, just to name a few, are very pleasant and provide excellent advice on dining options and nearby attractions. They are always willing to help in any way they can. In short, I can highly recommend this hotel whether it is for business or leisure.", "Date": "December 23, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Florida", "Title": "“Nice and Clean Place and Close to Universal Orlando”", "Author": "nata257", "ReviewID": "UR90122164", "Content": "It is just a good place to stay if you are planning to spend whole day in Universal Orlando parks and then quickly get to the hotel to rest. Also, convenient complimentary breakfast helps you to get to the destination sooner. The staff is very nice and helpful. Rooms are clean. Coffee and tea are always available at the lobby. The hotel is very close to the Universal Orlando. We, including children, walked there. It is about 15-20 minutes walk. The hotel is right next to several restaurants. Although the hotel is in the midst of an active area, we did not find it noisy. On our next visit to Universal Orlando we will defiantly stay at this hotel.", "Date": "December 17, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Toronto", "Title": "“Close to Universal, clean rooms and friendly service”", "Author": "zev0n", "ReviewID": "UR85750144", "Content": "We stayed one night at Fairfield Inn & Suites in the middle of October for the Pirate Dinner night deal. Travelled with kids (age 4 & 8) who loved the night out and it was a great deal. The hotel rooms were clean and well maintained. We had no problems with bugs or other little critters in our room. The hotel was close to Universal. There were quite a few fast food restaurants around for dinner and a Walgreens right next door. Staff were very friendly and helpful. Breakfast was basic but served it's purpose & we were offered coffee, tea, hot chocolate and cookies in the lobby all day. Our only complaint was that the breakfast area was small and staff did not ensure that patrons left when they were done so some families were left waiting for a table longer than they needed to be.", "Date": "November 2, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "2", "Sleep Quality": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Siesta Key, Florida", "Title": "“Wonderful staff, nice and clean - but mind the extra charges!”", "Author": "SiestaKeygrrl", "ReviewID": "UR85633405", "Content": "I booked this room as overflow for my son's 16th birthday at Hard Rock / Universal Studios. Using the Ritz-Carlton/Marriott Elite reservations, I prepaid the booking for a suite with 2 bed + sofabed, with a rollaway. My ONLY complaint is that after paying for the reservation in full, I was charged again for the rollaway - adding $30 in charges and taxes to the original prepaid reservation (additionally taxed on the rollaway as well). It felt a little dishonest to me. The room was perfectly clean, the housekeeping staff does a superb job. Although I didn't get everyone's names, the staff is SUPER friendly, accommodating every request. The woman at breakfast was adorable in her Cleopatra costume, and ever so sweet! The night maintenance man did show a little irritation after having to come up to the room twice - once when the shower backed up, then again because the sofabed sheets and pillows were not supplied (he searched the drawers and room before acknowledging there really were no extra linens). Taxi fare is only $5 to Universal Citywalk, and about 2 minutes drive. Save yourself from the $16 parking fee at Universal and take the taxi. My last tip, take your chances and walk in off the street to book a room. A gentleman came in when I was getting pool towels and booked a suite for half what I paid. Live and learn. Still a lovely Marriott hotel, would definitely stay again!", "Date": "November 1, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Chicago, IL", "Title": "“Nice clean hotel near Universal Studios”", "Author": "var6444", "ReviewID": "UR83646185", "Content": "We found this hotel to be clean and conveniently located to all the Universal Studio attractions, the hotel also offered a free shuttle to the Universal parks. Carrabba's Italian Grill is right across the street. Just a few miles away is the Millenia Mall which was absolutely beautiful and had many great restaurants like Cheesecake Factory and McCormick & Schmick's. We found this Fairfield Inn to be great location. Also the cookies put out on the front desk every evening was very nice.", "Date": "October 15, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Cincinnati, Ohio", "Title": "“Good Marriott Option if you are going to Universal Orlando or City Walk”", "Author": "honeymoonin", "ReviewID": "UR81874912", "Content": "My family and I just got back from a 4 night stay at this hotel. We were looking at a Marriott property close to Universal and this was the closest we could find. I was using points, so it didn't costs us a thing but it was more points than your normal Fairfield Inn just because of the location. Location: The hotel is just around the corner from Universal. It was an easy 10-15min walk. The walking entrance is the same as the valet entrance. It is easy to find and has a well laid out walking path. You could drive and park in the garage but it really wouldn't save that much time and you would be walking nearly as far while paying for the garage. There are a few restaruants really close and quite a few for delivery. Citywalk is pretty close too, so it you decided to have a few adult beverages you would be OK to stagger back to the hotel or at least grab a cheap cab ride. Hotel: The hotel was a little taller than your average Fairfield Inn. It is undergoing a restoration at the moment, but I didn't see any sign of it other than the little plastic hardhats and construction signs everywhere. Pool was OK, but pretty small. Breakfast was cereral, waffles, microwave sandwiches, yogurt, and muffins,but nothing fancy. Room: We were upgraded to a King Studio which I was told was recently remodeled. For a new room, there were a few things that didn't look new. Nothing major, but more wear than a new room should have. The bed was comfortable. The ammentities were standard. The room had two flat screen TVs but not high def. Movies on demand were available. The staff was all extremely friendly (Juan especially) and tried to be helpful. I asked for walking instructions to universal the first morning and the lady was not sure. Hint: If you have \"near Universal Studios\" in your name, everyone there should know chapter and verse about Universal! BTW: tipping housekeepers gets you better service. It really shouldnt be that way, but it defiantely made a difference. Warning: The firedepartment/lifesquad is directly across the road and they are going out ALOT!!! Great if you have an emergenc. If you are a light sleeper, you might have a problem. The bottom line is that it walking distance to Universal Orlando, clean and comfortable, and the staff is great. If I ever decided that I had to go back to Universal, I would be happy to stay here again.", "Date": "October 2, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "New York City, New York", "Title": "“Excellent Staff and Customer Service”", "Author": "wuh291", "ReviewID": "UR76234584", "Content": "My boyfriend and I came down here to go to Universal Studios. Our trip was enhanced infinitely more by the assisstance from the hotel desk staff/concierge service. Looking for a good place to eat, one of the hotel desk staff members, Steffanie, recommended a local seafood place rather than direct us to generic tourist attractions. They gave us directions and even called a taxi for us. On top of that, they gave us the best way to get to our next hotel destination in Orlando in the most cost efficient way (as we are both students with a budget). The hotel staff, in general, was very accomodating. Any issues or questions we had were quickly resolved. Would definitely come back again.", "Date": "August 21, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "3", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Nashville, TN", "Title": "“Friendly and Prompt Service!”", "Author": "ellycain", "ReviewID": "UR76062242", "Content": "I wanted to take the opportunity to mention that the maintenance and front desk service during my recent stay was EXCELLENT! My room air conditioner was not exactly keeping up with my need for a cool room. Upon my exit the first day I meet JP Midalgo, maintenance, at the elevator and mentioned to him my issue. He was very friendly and courteous. He told me he would check on it that day, and also gave me additional tips on how to use that specific unit. Upon my return that afternoon I had a cool room and appreciation for his quick response and ability to solve my problem. ALSO! Juan was my front desk assistant when I checked in to the hotel. He was extremely personable and truly invested in creating a good stay for me. Each day I saw Juan he always greeted me with a smile and checked in with me to see how things were going. It is nice to feel someone is looking out for you! Thanks to both for your excellent service and to the Orlando - Universal Studios Fairfield for your high expectations with your employees!", "Date": "August 20, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Ottawa", "Title": "“Great Place to Stay”", "Author": "kanata-pete", "ReviewID": "UR71403512", "Content": "The service at the hotel was outstanding. The staff always called me by name when I saw them. It is very close to lost of food choices. It is close to Universal but depending on how much you like walking you might be taking a cab. They have a taxi van that picks you up and charges $8.00. When we left the resort we took a regular taxi. It only cost $5.00. We used the pool which was nice and clean. I would go back for sure!", "Date": "July 18, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Miami, Florida", "Title": "“Vacation Spot”", "Author": "marciahotel", "ReviewID": "UR71195838", "Content": "The hotel is very clean, I like to stay there. The breakfast also is very good and i love the way the employees attend to me especially Stefany that works at the front desk. She was very helpful with directions and she was really educated with me, she treated me like a regular everyday customer.", "Date": "July 16, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "cornwall. ny", "Title": "“highly attentive staff, great breakfast, very clean, good location”", "Author": "samfree13", "ReviewID": "UR70884600", "Content": "As soon as I walked in i was greeted by a very professional and polite front desk employee. Emanoel was able to make my stay very enjoyable and was able to accommodate my issues. I had arrived late and had extra friends then planned, he was able to upgrade my room so that the room could accommodate us. When I arrived to the room, i was very much pleased with the cleanliness. The breakfast that they include was great and had a big selection of items. The hostess for breakfast, Nadia was very polite and helped me bring items to the table. Overall I had a excellent stay and look forward to my next visit!", "Date": "July 14, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Kenner, Louisiana", "Title": "“poor start, but more than made up for it”", "Author": "MAP12", "ReviewID": "UR68996536", "Content": "Got off to a bad start here. I don't know if it was my travel agent or the hotel's fault. This is an Inn and Suite hotel. I had told my travel agent I wanted a suite, but when we got there we were in a regular room, but a bit larger than normal. There were 5 of us staying, so I ordered a roll-away, thinking we'd be able to \"make do\" well after one night it became very apparent that we would NOT be able to make do - so I went to see about getting into a suite. No problem, we were immediately moved to a suite - in fact, they even moved our luggage (as long as it was packed) while we were enjoying Universal. There was no additional charge, which leads me to believe it may have been the hotel's mistake - I was charged for two extra nights of the roll-away, but that was removed from the bill when I questioned it. The suite itself wasn't that special - but did have a mini-fridge, microwave and sleeper sofa (which is all we really needed. Set up was a bit wierd, but it worked for us. No hotel restaurant, but several in the adjacent strip mall. Hotel is in a good location. You could walk to Universal - but only if you're in good shape - I would say it's about a mile. I think there was some mention of a shuttle to the park - well, there was one, but only available once a day each way (which I've found is typical of hotels that offer this service, so I didn't get upset about that). Free cookies and lemonade in the afternoon. Breakfast is offered, but nothing special - waffles, cereal, juice, coffee . . . There was free massages in the lobby one afternoon - don't know if that's a regular thing or not, but it was a nice touch!! Free internet, but not wireless. Free parking - with additional parking in lot across the street (small strip mall). Staff was very friendly and helpful. Pool was placed behind the hotel, so out of the afternoon sun, which was good. We originally had scheduled 3 days here, but extended a couple because we were having a good time.", "Date": "June 28, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "1", "Location": "5"}, "AuthorLocation": "Fort Lauderdale, Florida", "Title": "“Most caring hotel staff ever!”", "Author": "Japarican", "ReviewID": "UR66927364", "Content": "Because of the friendly greeting from Steffanie at check-in, and the attentive service at breakfast from Nadeza, my husband and I both agree our short stay was made relaxing and enjoyable. The reason for our stay was to spend a day at Universal Studios which is right across the street. Because parking at Universal is $14 per car, we thought we would attempt to check in early, leave our car in the free hotel parking lot, and walk to Universal Studios. Since we arrived at the hotel at 12:25 PM, I wasn't optimistic that a room would be ready, but Steffanie happily informed us that there was a room available. It wasn't so much the fact that a room was available that made us feel welcome. It was the way Steffanie greeted us and didn't hesitate to help us that made us feel comfortable and at ease to ask questions. We asked her if it was an easy walk to Universal, and she gave us directions and taxi information in case we chose to ride back by taxi instead of using the shuttle service that only operated at a certain time. After we dropped our luggage off in our room, we opted to walk over to Universal, and it was a nice walk that took us 15 minutes or so. We ended up walking back to the hotel as well. Our room was comfortable and clean. Everything was in working order. In the morning, we went downstairs for the complementary breakfast and we were immediately greeted with the most warm \"Good morning!\" from Nadeza. Remember this is a self-serve buffet breakfast. Nadeza kept checking to see if we needed anything at our table and brought us yogurt to eat later and bottled water. She cleared dirty plates and bowls from our table too. We watched her as she tended to other guests with the same beautiful smile and cheery attitude. She even gave us each a kiss on the cheek as we left the table and made sure we had our fill of coffee. Upon check-out, we asked Steffanie for directions to an outlet mall nearby. She immediately printed out the directions for us. Nadeza was still in the breakfast area cleaning up with her big smile. When we said goodbye to her, she gave us another kiss on the cheek. My husband and I are both crewmembers with an airline. We travel to different destinations in the world. We have never felt so much at home and at ease as we did during our short stay at this hotel. The reasons for this are found in the caring hearts of Steffanie and Nadeza. We hope they will be there on our next visit.", "Date": "June 9, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "westford, ma", "Title": "“Service with a smile!!!”", "Author": "joannemav", "ReviewID": "UR65645878", "Content": "We had a fabulous stay in Orlando, we were down for a family event, as well as taking in the parks. The rooms were clean, the continental breakfast was good, and the service was outstanding! We specifically want to give a shout out to Daniel ! Every evening we returned to his smiling face, offering us warm cookies and pleasant conversation. We will definitely stay here again upon our next visit to Orlando. Thank you!", "Date": "May 28, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "West Palm Beach, Florida", "Title": "“this is the best hotel to stay at in the orlando area”", "Author": "terrella", "ReviewID": "UR64752354", "Content": "i loved the personal care and attention i recieved. i felt like i was staying with family.", "Date": "May 19, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "dorset", "Title": "“Great stay”", "Author": "DorsetNetti", "ReviewID": "UR64275058", "Content": "This was our first hotel as part of our tour around Florida and set a high president for the others to follow. It provides free parking and has a good range of eateries nearby epecially the Golden Coral. The staff were helpful and during our stay got to know Daniel on Reception well. He is full of character and so helpful and friendly and was sad to say goodbye to him (and the cookies!) We had a great time here, did not use any of the facilities due to being at Universal all the time. It is a great location for Universal with a lovely walk to the park. The breakfast is great- lots of choice frequently stocked- over our trip it had the most choice of all the hotels we stayed at- very impressed and set you up for the day. There is complimentary tea/coffee available in reception.(as well as coffee in rooms) As we travelled round Florida we soon realised just how good this hotel was with all the little extras eg great breakfast, sweets, cookies, tea/coffee etc. Would definately recommend this hotel for international drive and universal sides", "Date": "May 16, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "McDonough, Georgia", "Title": "“Great Hotel and Great Stay!!!!!”", "Author": "bmurphy0274", "ReviewID": "UR59551632", "Content": "This was my first time staying in Orlando so I wasn't familiar with the hotels chain. I did a lot a research on this hotel and boy i was happy about my selection. The Fairfield Inn and Suites near Universal had a warm and friendly atmosphere the staff was awesome and very helpful I enjoy everything about my stay. The hotel was very clean and the rooms were amazing too. The beds were soft and great after a long day of theme parks. The breakfast was always hot and good to the stomach. I plan on visiting Orlando again and I know where I'm going to stay. Thanks Trip Advisors for help me find the hidden gem!!!!", "Date": "March 26, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "3", "Rooms": "5", "Location": "5"}, "AuthorLocation": "miami", "Title": "“friendly and great location”", "Author": "ladyinredMiami", "ReviewID": "UR57580741", "Content": "I was taking a fairly large group to a dance competition and everyone I dealt with was very friendly and accommodating. My parents were super happy which is always a great relief! The front desk staff were very sweet and one employee was particularly great with all the kids and made them feel very important. The location is great with a Starbucks right across the parking lot along with quite a few restaurants and a walgreens too. Covered all our needs! Hotel was clean and breakfast (included in price) was good. My only thing I would like to see improved are the beds as they were just a little too soft for me and my husband who then woke me when he moved around. This was a great hotel and right across the street from Universal.", "Date": "March 2, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "3", "Rooms": "3", "Location": "5"}, "AuthorLocation": "South Coast, England", "Title": "“Excellent hotel with very few problems!”", "Author": "Rides_And_Free_Beer", "ReviewID": "UR56396933", "Content": "A really friendly and \"cosy\" feeling hotel. Rooms are well stocked, and come with free coffee, soap and Pantene products, replenished daily. Housekeeping is excellent. Rooms are a little smaller than we are used to at this price, but this is made up for with the generous free breakfast provided. It's worth asking for a room that does not overlook the parking lot/car park, as there is noise from there late at night, as the windows are not double-glazed. Front desk staff were excellent and friendly, and as this is a smaller hotel it is nice to see the same faces day-to-day. All in all a really good, relaxing stay.", "Date": "February 18, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "3", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Erial, New Jersey", "Title": "“Noisy”", "Author": "jas45", "ReviewID": "UR56027535", "Content": "Check in was easy and friendly. We then went drove to Universal and stayed until closing. Upon arriving back at the hotel we found that there were no parking spots in the hotel or nearby lots. After finding someone backing out of a spot we go up to our room for a good nights sleep. Inconsiderate loud talkers periodically in the hallway and doors slamming made sleeping a problem. In the morning I realized that we were next to the stairs which a lot of people would use instead of waiting for the elevator. The stairwell is a VERY loud echo chamber and the doors slam shut due to fire regulations. I would stay here again with two exceptions, first NOT in a room near the stairs and second not on a Saturday night when you may not get a parking spot if you leave. If you stay here be certain that your not in the room next to or close to the stairs.", "Date": "February 15, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "england", "Title": "“Fantastic”", "Author": "srcwad", "ReviewID": "UR51895657", "Content": "Fantastic Hotel, This is our second time we stayed at this hotel and we would definitely go back. the rooms are big and very clean, All the staff are fantastic epecially Laura and Manuel. the brakfast is very good too,", "Date": "December 26, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Florida", "Title": "“OUTSTANDING!!!”", "Author": "Marriotttraveler1", "ReviewID": "UR49595358", "Content": "I needed to extend my stay one additional day. I went on Marriott.com and the room rate was more for the additional day. I came in, checked in and let them know I needed to stay another nite but there was a price difference of $20 for the additional nite. Not only did they extend my stay, they gave me the same nite rate as my original reservation AND placed me in a suite for that rate. My experience at this hotel has always been good. I love the upscale remodeling, the professionalism and the helpfulness of the staff and the location. I recommended this hotel to my girlfriend who is staying here the weekend. Thanks for being wonderful Fairfield. From, a platinum member who travels 3/4 days per week and stays in many different Marriott properties.", "Date": "November 19, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "3.0", "Value": "5", "Location": "4", "Rooms": "4"}, "AuthorLocation": "Orlando, Florida", "Title": "“Not great but a decent place to spend the night”", "Author": "favargas", "ReviewID": "UR40935256", "Content": "Small hotel very convenient to universal; free continetal breakfast. The staff was very friendly and willing to help the couple of times I have stayed at this property", "Date": "September 11, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "NY", "Title": "“Perfect Location , great service.”", "Author": "nkaston", "ReviewID": "UR38823547", "Content": "Staff was the best! Kayla, Steffanie, Emmanoel, Franklin and Angela were really concerned about you getting the most out of your stay.", "Date": "August 25, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Leicestershire UK", "Title": "“Fantastic Midlands UK”", "Author": "dawnjotham", "ReviewID": "UR36586446", "Content": "We spent 14 nights at this hotel and it was really nice. The staff were very friendly the hotel was clean. the room was really good could not hear any noise from other rooms. highly recommended.", "Date": "August 3, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Business service (e.g., internet access)": "4", "Check in / front desk": "4", "Overall": "4.0", "Value": "3", "Rooms": "4", "Location": "2"}, "AuthorLocation": "Norfolk", "Title": "“Nice hotel, but in a busy area”", "Author": "NorfolkDude", "ReviewID": "UR24040572", "Content": "We spent one night at this Fairfield on our trip south to Disney. In total for this trip we spent three nights in three different Fairfield Inns. A few of the Pros: - The beds were as comfortable as the other two Fairfield Inns, so the quality was consistent. - The hotel was well kept. - Front desk employees were very friendly. - Breakfast bar was well maintained and delicious! - A very nice Italian restaurant (Carmela's) is right around the corner. A few of the Cons: - A nearby fire station could stir up quite a commotion, when the fire trucks would roll out. - Universal Studios is right around the corner, so there is a critical mass of hotels in a small area. This Fairfield is squeezed in behind a strip mall on one side, a busy road on the other and two other hotels on the remaining sides. Consequently, the parking lot fills up quickly. Overall, this Fairfield is a nice hotel and we would stay here again.", "Date": "January 30, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Plantation Florida", "Title": "“Great Stay at Fairfield Universal”", "Author": "robvia", "ReviewID": "UR21099658", "Content": "Booked hotel for 1 night on Saturday October 18th, 2008. Room was clean, everything in order. The breakfast area had the nicest lady attending to the needs of the guests. She was cleaning tables, making waffles, seeing if they wanted whip cream on their waffles, and giving them bags for any food they wanted to take away. I've never seen anything like this in a free breakfast area. Sure, there's someone who will clean the tables, but this person was actually serving people. I don't know where all the bad reviews came from in previous posts, but our stay was nice. The hotel is within walking distance of Universal. It's about a 10 minute walk across Kirkman Road to the parking garage, but it's better than paying $12.", "Date": "October 22, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Check in / front desk": "2", "Overall": "2.0", "Value": "2", "Rooms": "2", "Location": "5"}, "AuthorLocation": "Baton Rouge, Louisiana", "Title": "“Disappointed”", "Author": "BatonRougeFamily", "ReviewID": "UR17801315", "Content": "I was bound to be disappointed with my reservation...I paid $358 for 2 nights. I wanted to book the Homewood Suites/Orlando after a great experience with them (using tripadvisor ratings for Albuquerque). They were full. I had a REALLY good experience with the Comfort Suites Universal in 2006 and wanted to see if I could get a better deal. I went with \"Fairfield\" thinking I was booking the #1 hotel with Tripadvisor. 2 weeks prior to my vacation I realized that when I went to the Marriott website to book my vacation I was somehow switched to a different Fairfield Inns & Suites. I kept the reservation hoping it would be okay. I had hoped to have a reservation including 2 rooms, one with 2 queen beds and a living room with sleeper sofa and TV...plus kitchenette including microwave and refrigerator. Boy was I disappointed when I received one room...NO Refrigerator...NO Microwave. Two beds plus a small sleeper ....SMALL SMALL SMALL. In 2006 We had stayed at the Comfort Suites Universal and received a MUCH BETTER DEAL.....2 beds with larger sleeper sofa....Large rectangle refrigerator and microwave plus some snacks provided. I would stay there again...it was cheaper than this stay! .... I will never stay at this Fairfield again. To me, there are much better deals than this. And I am one of those reviewers that really are more positive than I should be. To recover from the shock....we requested a refrigerator and they complied. However the refrigerator they sent was so small and never really worked. No microwave. The breakfast was (to me) not as great as Comfort Suites. Basically the same but no sausage. They had Breakfast Sandwiches, you cook them in the paper. The most positive thing I can say about this place is that they are very very close to Universal so that when the 'bus' came we were the last 'pick up ' and one of the first 'drop off' stops to get on. You are close to a Burger KIng, a Golden Corral, a Carraba's and there is a Convenience Store close by. The Cookies were nice at check in as was the Check in Clerk. There is a really nice Housekeeping guy that taught me some Spanish at the elevator. They have Lancome Shampoo and Conditioner. This is not the best deal available in Orlando....Please shop around.", "Date": "July 12, 2008"}, {"Ratings": {"Overall": "3.0"}, "AuthorLocation": "Peoria, Illinois", "Title": "“Good value for the price”", "Author": "ztheworld", "ReviewID": "UR12288822", "Content": "Very convenient location for The Holyland Experience and Universal Studios, just minutes away. Above average free breakfast in the morning and fresh baked cookies in the afternoon. Rooms and hallways have just been updated. Beds are very comfortable. Suite rooms have cooling challenges, with one wall unit by the window. The bathroom and hallway side of room get extremely warm, while the bed area has the A/C unit blowing directly on you as you sleep. Overall, this is a good value for the price.", "Date": "January 3, 2008"}, {"Ratings": {"Overall": "1.0"}, "AuthorLocation": "NY, NY", "Title": "“Avoid at all costs. Go to the Fairfield International instead!”", "Author": "welookgoodcom", "ReviewID": "UR11994893", "Content": "I ended up staying at both the Fairfield Universal and the Fairfield Internation. Not for good reasons The Fairfield Universal is a dump! Avoid at all costs. The hotel was so horrible I needed to cut my stay short and take an emergancy cab ride to the Fairfield International Drive. The Fairfield International Drive is a 5 star resort compared to the Fairfield Universal. My issues: 1. I called up to get a non-feather pillow due to someone in the party who is allergic. I was told the hotel doesn't have them. As a result the person slept without pillows. 2. I was told on the phone the pool was heated. It is not. It's freezing cold 3. The jacuzzi is too hot so it's not possible to go in. Owning a jacuzzi I like it as hot as possible (107, 108). The temperature was so hot, its not fit for a human to go in. As a result I burned myself. The Fairfield International has a heated pool and a jacuzzi at the perfect temp 4. It is NOT within walking distance to Universal. Complete lie. 5. The room #s have paper signs. Nice touch! 6. The Fairfield Universal is not in a safe area. The Fairfield International is in a much safer hotel complex. I booked the Fairfield Inn & Suites Orlando Near Universal Orlando Resort thinking it was nicer since it was more expensive than the Fairfield International. Huge mistake! Still have the burn from their jacuzzi. By the way both hotels use the same complimentary shuttle service. By staying at the FFI International you are costing yourself an extra 8 min each way but much better off! If you have a choice stay at the Fairfield International. Save some $ and be much happier with a HIGHER QUALITY HOTEL. Front desk is extra friendly. Do NOT STAY AT THE Fairfield Inn & Suites Orlando Near Universal Orlando Resort. For reference I am a Marriott Platinum who stays at all brand of Marriott very frequently!", "Date": "December 27, 2007"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "3", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Orlando", "Title": "“Great Value and Location!”", "Author": "Schrutenator", "ReviewID": "UR10128102", "Content": "We stayed at this hotel October 15th-18th 2007 for our 1 year anniversary. We wanted a clean, smoke free hotel, with free parking, free internet, free breakfast, in a safe location. We got everything we wanted! It is in a great location, right next to the entrance of Universal and close to International Drive (for restaurants, entertainment, and shopping). We stayed in a King Suite with a fridge/microwave. It was nice to sit on the couch and watch t.v. and then go to the \"bedroom.\" The mattress was firm and comfortable. The hotel is very clean and the internet connection was great because the cord could reach the table, couch, and the bed. They had all the amenities that anyone would want (Pantene shampoo/conditioner, blow dryer, iron/board, newspaper, pool, small workout room etc.) Our room 616 was great because it was close but far enough away from the elevator and exit doors so noise wasn't a problem. The only issue we had, and it would be the same way in any of the area hotels, was the fire station that was across the street. The alarms would go off in the middle of the night (2-3 times a night, bring ear plugs) but obviously there is nothing you can do about that. There are restaurants within walking distance (Burger King, Kobe Japanese Steakhouse, Starbucks, Golden Corral Buffet, Carrabba's Italian Grill) and a Walgreen's that's great for anything you may have forgotten. The continental breakfast was nice, there were make your own waffles machines, bagels and other breads, hard boiled eggs, cereal, fresh fruit, coffee & tea, fruit juice etc. The cleaning staff even cleaned our room after we left the room after 2:00pm. The hotel staff was accommodating, we didn't use the shuttle but saw it picking up people for Universal right on time. For $99 a night plus taxes, it is a great deal!", "Date": "October 18, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "4", "Check in / front desk": "5", "Overall": "4.0", "Value": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Ontario", "Title": "“Great value for a Family!!!”", "Author": "weluv2travellots", "ReviewID": "UR8700787", "Content": "OVERALL- a great hotel. Rated as a 2 star, but clean and comfortable. We stayed at other 2 stars in florida, and this far exceeded what we expected. Cheapest price was through the Universal Studios website. Booked a King suite. Worth the little bit extra if traveling with kids. You get a divided off king size bed and an extra T.V. Saw the standard rooms (2 double beds) and they looked like the run of the mill hotel rooms...pay the extra for the suite. They have a little fridge and microwave, so bring your own popcorn and snacks. THE BEDS-The beds are VERY comfortable. Pillows are 1st class. Rooms are always clean. Breakfast is good...if they don't have what you are looking for, ask. The staff is very helpful. THE SHUTTLE-the only glitch in our stay. Watch the shuttle schedule-it changes (I think on Sundays) so every week is different. We got stuck paying for a ride home after a day at the park because the change...I told the front desk they should advise the guest of the change/when it changes, because it was very inconvienent to have to try and get back...expecting the shuttle. There are several shuttles during the morning, and several pick-up times in the evening. GREAT for people that want to sleep in, or go before the crowds. THE POOL-clean and well kept. Had to ask a few times for the pool towels to be brought out, but the staff was always friendly, and prompt. GREAT VALUE- I'd highly recommend this hotel to anyone. There is laundry on site (but be aware the hotel next door sends over their guests) which is good to use late at night, and reasonably priced. The rooms are clean and nicely furnished. Staff was friendly, and helpful. Location is kind of off the beaten track...but keeps the noise down. If you are energetic, you can almost walk to food stores. Would go back :')", "Date": "September 12, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "4", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Granger, IN", "Title": "“A high quality hotel at a good value”", "Author": "VikGranger_IN", "ReviewID": "UR8447450", "Content": "This is overall a very good quality hotel for a family visiting Universal Studios. It is a Universal \"Partner\" hotel, and hence has complimentary transportation to and from the park. The room and amenities were of high quality and the complimentary continental breakfast was top notch. My wife particularly liked the belgian waffle mix. Staff was friendly and helpful. Several restaurants are within walking distance, including one that is open late (I can't recall the name, but it was good). Two notes of caution: (1) The bus service was good, but the schedule was very imprecise. For example, a couple times the 10:30 AM bus never showed up because it overfilled from another hotel, so the 11:00 AM bus showed up (at 10:50 AM) to serve both 10:30 and 11:00 AM passesngers. Bottom line - the published schedule is not exact, but in the end, they'll get you there and back. (2) Be sure you get on the right bus coming back, especially if you wait till the midnight City Walk bus. There are two Fairfield Inns in the same general area - be sure you communicate clearly with the driver which one you're going to (the one on \"Vineland\").", "Date": "August 18, 2007"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Business service (e.g., internet access)": "2", "Check in / front desk": "5", "Overall": "2.0", "Value": "2", "Rooms": "1", "Location": "4"}, "AuthorLocation": "reading", "Title": "“noisey”", "Author": "madennis", "ReviewID": "UR7840385", "Content": "Nice hotel with good breackfast but you need a good meal after a sleepless nights the walls are so thin you can hear everything. Weekends in may are very noisey as school kids stay there and run and shout in the rooms", "Date": "June 12, 2007"}], "HotelInfo": {"Name": "Fairfield Inn & Suites Orlando Universal Studios", "HotelURL": "/ShowUserReviews-g34515-d223016-Reviews-Fairfield_Inn_Suites_Orlando_Universal_Studios-Orlando_Florida.html", "Price": "$123 - $169*", "Address": "<address class=\"addressReset\"> <span rel=\"v:address\"> <span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">5614 Vineland Road</span>, <span class=\"locality\"><span property=\"v:locality\">Orlando</span>, <span property=\"v:region\">FL</span> <span property=\"v:postal-code\">32819</span></span> </span> </span> </address>", "HotelID": "2515915", "ImgURL": "http://media-cdn.tripadvisor.com/media/photo-s/01/e1/f7/0d/fairfield-inn-suites.jpg"}}