{"Reviews": [{"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Chicago, Illinois, United States", "Title": "“Very cool boutique hotel”", "Author": "Brad S", "ReviewID": "UR127021325", "Content": "Every room is a new experience. Great location, excellent shape, responsive staff.", "Date": "March 31, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "New York City", "Title": "“Close to the San Diego Zoo and Great Customer Service”", "Author": "Brklyn", "ReviewID": "UR125613100", "Content": "We took a last minute trip to the San Diego Zoo, and arrived in town at 6:00pm on a Saturday with no place to stay. I'm SO glad I checked Trip Advisor and read about the Balboa Park Inn. We were lucky to get their last available room. The place was so great for the low ($99) price that we stayed an extra night. (In the summer, this place gets even better; they have a large sun deck and many outdoor dining tables.) The Balboa Park Inn must be the closest hotel to the San Diego Zoo. It's a VERY short walk through the park. Unfortunately, when we checked out we left some valuables in the room. The Inn phoned right away to alert us. Since we had already left town, they were nice enough to ship our things overnight. Great customer service all around!", "Date": "March 4, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "3", "Sleep Quality": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Marshfield, Missouri", "Title": "“Comfortable bed”", "Author": "Pammie_12", "ReviewID": "UR125025582", "Content": "Reminded me of staying with relatives in an older house, very comfortable. The bed was not your typical hotel bed and the bedding was beautiful. There was quality furniture and Cuisinart cookware. It was surprisingly quiet considering the age and location of the building. Staff are friendly and housekeeping kept the place spotless. Down side? Could have had a slightly more substantial breakfast, other than pastry and cereal. Also could have done without it raining on our bed due to leaky roof. However, management has done the right thing and compensated us for that unfortunate event. And I'm told the roof has been repaired.", "Date": "February 22, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Toms River, New Jersey", "Title": "“Awesome bed & Breakfast”", "Author": "Mark H", "ReviewID": "UR124869478", "Content": "I stayed at the Balboa Park Inn for 4-5 nights back in July 2011, and it was great. We stayed in a room facing Balboa Park, on the first floor. The room had a very warm, homey feel. Kind of like staying in the guestroom at your grandmothers house. The bathroom was large, with a jacuzzi tub. it was kind of weird that the mini-fridge, microwave, and other kitchen supplies were in the bathroom, but we got over it. There is a Trader Joe's nearby where you can stock up on microwave-cooked foods. The daily breakfast was nice, they were always very friendly when you called and ordered. Always a great job cleaning the rooms when you're out for the day. The Inn is right across the street from Balboa Park. We jogged through the park every night. We walked to the San Diego Zoo easily. There is also a bus stop right there that goes in Downtown San Diego, convenient way to avoid drinking/driving at night. The parking is sreet parking, and it can be tricky, but I stay in North Jersey a lot so it was really no big deal, just like home. There is always somewhere to park, it just always isn't right in front of your hotel. The staff was great and friendly, they were able to hook us up with a nicer room upon check-in for no extra cost. We originally were going to be in one room for 2 nights, then switch to a smaller room for the remaining nights. They ended up letting us stay in the larger/nicer room for the same price as the smaller room. I would definately go back.", "Date": "February 20, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "New York City, New York", "Title": "“Home away from home”", "Author": "346SueU", "ReviewID": "UR124223192", "Content": "Breakfast served daily; comfortable, conveniently located to Balboa Park and buses to all parts of the city. Located in happening Hillcrest area. Excellent service and welcoming. Clean. Free wireless.", "Date": "February 6, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Vevey, Switzerland", "Title": "“Nice hotel, very kitsh”", "Author": "mojave", "ReviewID": "UR123531684", "Content": "The hotel (or is it a large B&B?) is locateed in a couple of old houses in a beautiful residential area along Balboa Park. The decor is resolutely kitsh, it is a matter of taste of course. Upon entering the room, one is struck first by the decor, and at the same time by the excessive smell of air freshener. That, too, is a matter of taste, but breathing these chemicals all night long cannot be very healthy. I did not like the envelope requesting a tip for the maid, to be handed at the desk on check-out. Don't they pay their staff? The bed was good, wifi was clear, there were a fridge, coffee machine, microwave, and everything was very clean. Continental breakfast is brought to the room, which is nice. Parking is on the street, easy to find.", "Date": "January 24, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Mesa, Arizona", "Title": "“We loved the Jungle Nook!”", "Author": "chiwawa4556", "ReviewID": "UR121994875", "Content": "My husband and I recently stayed in the Jungle Nook room at Balboa Park Inn. The room is decorated in a way that some might find \"over the top,\" but I thought it was very fun! The walls are painted to look like jungle plants and there are exotic animals everywhere. There were even a few Christmas deocrations added here and there, which we thought was a very nice touch. I thoroughly enjoyed watching TV while I took a shower in the huge shower built for two. Didn't get a chance to use the huge bathtub surrounded by flameless candles, but hopefully I will next time. The room was VERY clean and comfortable. I did not smell any mold that previous reviewers ave mentioned. The staff was friendly and attentive without being intrusive. The breakfast was more than enough to get us going for the day. Each day we had an assortment of breakfast breads and pastries including a cinnamon roll, mini muffins, panetone (my new favorite!), croissants, and various other things. My husband also ordered cereal each morning and we both had juice. There is a well-stocked coffee bar in the room as well as a microwave and a fridge. This room is adjacent to a beautiful courtyard where we enjoyed our breakfast the first morning of our stay. It was very quiet. I did hear a little bit of noise from our neighbors above us on the first night of our stay, but nothing that was going to keep me awake. The Inn is walking distance from the San Diego Zoo and Balboa Park and an easy drive from Sea World. The only negative things I can say about this property are these: They have no parking lot, so you have to park on the street. Some areas are No Parking at certain times on certain days, so you have to pay attention. There was never any hot water in the bathroom sinks, and it took a little while to get hot water in the shower. The Jungle Nook room is great for couples, but the setup of the bathroom areas wouldn't be good for traveling with friends or relatives as there is little to no privacy. (Not really a negative, just something you should know.) And that's it. Everything else was wonderful and I can't wait to go back again. I would definitely recommend Balboa Park Inn to anyone looking for a fun place to relax!", "Date": "December 22, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Idaho", "Title": "“Great B&B, walking distance to the San Diego Zoo!”", "Author": "RockhopperPenguin", "ReviewID": "UR121461314", "Content": "I mainly selected this place because it sounded nice and was walking distance to the zoo. The rooms have personality as others have said and my wife really liked it. Breakfast was good and the area is great, no complaints!", "Date": "December 6, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "San Francisco, California", "Title": "“Cute, kitschy and a great place to stay!”", "Author": "veenas", "ReviewID": "UR120556245", "Content": "This place has it all- very nice location, excellent service, and unique, awesome character! We were supposed to stay in one of the regular rooms, but got upgraded to the Bon Vivant suite, which was just ab fab. It reminded me of a grandma's house from the 70's- but in a good way. The living area faces the street, but the bedroom was in the back so it was nice and quiet for a peaceful sleep. The staff was all very friendly and punctual with the breakfast when ordered. Location is super convenient to the zoo (5 min walk) and University Ave (10-15 min walk) restaurants/ nightlife. Loved it!!", "Date": "November 13, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Tampa, Florida", "Title": "“Quaint Inn in a great location”", "Author": "aligobs", "ReviewID": "UR120526600", "Content": "Unknowingly we booked a trip to San diego during Comic Con and found all hotels had jacked the price up. This little inn was the exception but we were leary. Since the location was so good (right next to Balboa Park) and down the road from my sons house we said what the heck. We are so glad we did! The staff was excellent, the rooms were awesome! Fireplaces, comfortable beds, and a courtyard so pretty I didn't want to leave. I will be returning to the Balboa Park Inn.", "Date": "November 13, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Portland, Oregon", "Title": "“Great location, wonderful property and staff, somewhat tacky decor :)”", "Author": "JMGinPDX", "ReviewID": "UR119365537", "Content": "We recently stayed at the Balboa Park Inn in San Diego's Hillcrest neighborhood in mid-October 2011. Our room was the \"Medley Suite,\" a 2nd floor suite with a living room, bedroom, bath, and sizable full kitchen. Other amenities included free continental breakfast delivered to your room with more than enough pastries for 2 adults and a toddler, coffeemaker and coffee, and cable TV (there may have been internet as well but I didn't use or research it). At $149/night + tax it was a bit more than we usually like to pay, but well worth the money for the location and comfort. The property is located at the corner of Park and Upas, literally a 5-minute (if that) walk to the gates of the San Diego Zoo, the carousel and the miniature railroad. El Prado and the natural history and science museums are about 10 minutes' walk, and a playground for our 2-year-old about 15-20 minutes' walk. We rented a car, and were able to drive no more than 10 miles in different directions to get to East Mission Bay, downtown and the Gaslamp, Sea World, and the ferry to Coronado. The airport rental car agency was literally a 5-minute drive, and the shuttle ride back to SAN took about 3 minutes. All of that meant to say - there is very little reason to stay in any other part of San Diego, especially the overrun, noisy and congested Hotel Circle. Just another 2 minutes southeast and you can stay in a quiet, suburban and slightly upscale neighborhood that is very close to all the things most people go to San Diego for, in some cases closer than you can get by being right off the freeway. In addition, by being on the eastern end of the Hillcrest district, we were close to a vibrant and historic neighborhood with lots of interesting culture, a vibe that appealed to a couple of Portlanders like us, and wonderful restaurants like The Tractor Room. Our first impression in the lobby was that is was friendly and comfortable, but a bit on the over-decorated and tacky side (at least for semi-snobs like us who prefer simplistic modern Scandinavian and Asian decor ;)) The staff was wonderful and unobtrusive - the only times we saw employees was when the sweet housekeeping/service ladies brought us breakfast, and when we checked in! The room itself was comfortable, but again, a bit overly decorated with fake plants, mismatched paintings and sculptures and outdated furniture, pink tiles in the bathroom...it actually reminded me a lot of my grandmother's apartment circa 1975. I can appreciate kitschy/hip, but this was just plain tacky. Again, that is likely not important to most people and ultimately wasn't important to us either. Our room opened on to a deck that led to the sun terrace, a large and comfortable spot for taking in the beautiful San Diego weather. really appreciated the full kitchen, complete with 3/4 size fridge, stovetop, oven, microwave, and all the utensils, dishes, cookware, etc. you would find at home. The cleaning staff was even nice enough to do the dishes for us, including the toddler-friendly utensils, cups and bowls we had brought along from home!", "Date": "October 16, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Baldwin City, Kansas", "Title": "“Wonderful place to stay”", "Author": "Christine R", "ReviewID": "UR118463976", "Content": "We spent 3 nights in this delightful B & B. The rooms were spacious and clean, the service was very friendly and they went out of their way to help us in any way they could. I had a dental emergency our second day there and they not only came up with a list of local dentists but hand delivered it to our room and then followed up the next day. The location was so close to Balboa Park that most all museums and the zoo were withing walking distance. Parking on the street never a problem, most of the time getting a parking space almost in front of our suite. We stayed in the Monet and it felt as if we were staying in an apartment. This is a definite revisit for us in the future. I would recommend this to our friends and family.", "Date": "September 22, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Huntington Beach, California", "Title": "“Darling Place to Stay!”", "Author": "Scottysgirl01", "ReviewID": "UR117256956", "Content": "This little bed and breakfast style property was an absolute delight!! The room was clean and decorated in a theme like fashion. From the front desk staff to the housekeeping staff they were always friendly and helpful, yet not intrusive in any way. I will be back for sure...in fact in Sept. 2011!!", "Date": "August 26, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "4", "Overall": "4.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Rancho Mirage, California", "Title": "“Great place to stay”", "Author": "Aucaman", "ReviewID": "UR117249466", "Content": "This was more than the average B&B place. It's a set of old San Diego homes converted into very attractive small suites with everything you need for a fun long weekend. We had the feeling that we were staying in some friends' old apartment. We had gone to attend theatre performances at The Old Globe in Balboa Park and this Inn could not be better located. We also enjoyed a visit to the famous San Diego Zoo, just a five minute walk. We would definitely go back on our next visit to The Old Globe Theater.", "Date": "August 25, 2011"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "", "Title": "“Will go back next time we are in San Diego, near San Diego Zoo!”", "Author": "illini_knight", "ReviewID": "UR116580191", "Content": "Unique B&B with charm, good rates, and wonderful location (if you want to walk to San Diego zoo, you can in five minutes!). PROS: Service was good, free internet, unique decor in rooms (never seen any hotel quite like this one), beds are in great condition, fairly reasonable breakfast brought right to your room, lots of in-room resources to local attractions/restaurants/etc... CONS: Small bathrooms, can get a bit noisy (depends on which room), oddly shaped rooms (we stayed in Victorian room this time around, and our bed was diagonal in room, kinda odd, but I guess it works), very small tv (we never used it, but if you want a big tv, it isn't). In July 2009 my wife and I stayed in the \"City Lights\" room and it was very similar to our current stay in 2011. We will certainly return next time we are in San Diego. Both times we paid about 90-100 a night.", "Date": "August 11, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "2", "Overall": "3.0", "Value": "4", "Service": "4"}, "AuthorLocation": "Southern CA", "Title": "“Spacious rooms but terrible breakfast”", "Author": "Travelingpossum", "ReviewID": "UR116541907", "Content": "If you won't use the sofa bed or do not plan to eat their breakfast, this is a perfectly fine place to stay. The suite is very spacious and a good value for the price. The roof top terrace is very nice. The bed in the master bedroom was quite comfortable. The location is excellent. We walked to the zoo and museums in Balboa Park. It's also a short drive to many superb restaurants in nearby Hillcrest. However, the breakfast was composed of cereal or vending-machine quality pastries (one donut was still wrapped in plastic as you would find at 7-Eleven). The breakfast was similar to those I’ve had at low-end chain motels. A motel that calls itself a B and B should be embarrassed to serve such low-quality food. We ate the breakfast once; for the remaining days we went out. The sofa bed is VERY uncomfortable. It pulls out from a tiny loveseat (so is much smaller than a twin bed) and has a thin mattress covering through which the springs can be felt. My adaptable teen son was able to deal with it, but most adults would be too uncomfortable to sleep on it.", "Date": "August 10, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "San Francisco", "Title": "“Marvelous, again!”", "Author": "TripPlanPro", "ReviewID": "UR113133782", "Content": "Stayed at this B&B across the street from the San Diego Zoo for the 3rd time, and continued to really like it. The location is so peaceful [except on the morning of the Rock & Roll Marathon which goes right by the building at Mile 2, and then the location's just plain fun], and the neighborhood's so tranquil compared to the congestion and stress of the big hotels along the marina. Every room in the Inn is different. We've stayed twice in City Lights, which is on the 2nd floor, has a couch & kitchenette, and very nice view out to the street. We've also stayed in the Jungle Room, which is wild, has a much larger bathroom, and is also memorable, but is on the first floor, opens out onto the center patio and therefore has little natural light if you're going to be hanging out during the day. The breakfast that's provided at the Inn is very tasty -- although could use some fresh fruit. It includes cereal, juice, coffee & assorted pastries, and is brought to your room anytime after 7:30 am, which is also a very nice touch [would be better for the business traveler, however, if it could be available by 7 am]. The inn is actually several 2-story homes/apartment buildings all linked together on the corner across from Balboa Park at the Zoo [expect the bathrooms to be 'vintage' as a result], so it has an especially homey feel. You could live there indefinitely and not feel that you're in a hotel. The room across the hall from City Lights, in fact, has a living room, kitchen and bedroom -- it's a full-on apartment. No matter which room you take, if you have to be in San Diego for business or pleasure, couldn't recommend this B&B more! Parking's free on the street -- although sometimes difficult to find -- and the stay will make you want to stay longer. [Only real drawback -- wireless Internet access is quite sketchy & on-again/off-again. It would help if the management would make it reliable 24x7 for people who are in San Diego on business, or even those traveling on vacation. Reliable online access is considered standard at urban hotels here in the 21st century.]", "Date": "June 13, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Arizona", "Title": "“Budget friendly for extended family without giving up a comfy bed and a clean room.”", "Author": "swsteph", "ReviewID": "UR109638633", "Content": "This is my second stay at Balboa Park Inn and it is still wonderful! We visited San Diego with grandparents and small children. The owner kindly upgraded my parents so they could stay closer to us. Our room connected to a big back porch where people could hang out after the kids went to sleep. The breakfasts were substantial enough to get us going. The kitchen allowed up to keep kid friendly snacks on hand so we did not need to purchase them at expensive stands while site seeing. There are a number of good restaurants and a Trader Joe's near by to load up on snacks that you can keep fresh in the kitchen in your room. The location is fantastic. It is easy walking distance to the zoo and other wonderful sites in Balboa Park and a quick drive to Sea World or a baseball game to see the Padres. Balboa Park in is a budget friendly place to stay without giving up a comfy bed and a clean room.", "Date": "May 24, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Zürich", "Title": "“Cute rooms”", "Author": "travellerZ_rich", "ReviewID": "UR106946060", "Content": "All of the rooms in this hotel are unique. We stayed for 3 nights in Room #3: Paris in the 30s. I just love the names! The room was very cute, lots of decoration and \"stuff\", but still clean. You could tell from the way the towels were folded, that the owners have attention to detail. Coffee and tea making facilities in the room, as well as a microwave. Breakfast (included in the price) can be served to your room. It consists of cereals, milk and some sweet cakes, coffee and tea. Free Wifi. It is right next to Balboa Park so you can go for a run in the morning or walk to the zoo and all the museums. The only thing that bothered me a lot was that our shower didn´t work properly. The water pressure would just disappear during the shower, leaving me with shampoo in my hear but with no water coming from the top, only from the bottom tap. I reported this to the reception lady, but the issue had mysteriously vanished when they checked it. All in all, we enjoyed our stay here.", "Date": "May 5, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "port douglas", "Title": "“Best Beds & Service Ever!”", "Author": "ecotravelling", "ReviewID": "UR99625894", "Content": "Found this little Gem online. Lived up to expectations. PERRRFEEEECCT location opp Zoo & Park & close enough to all things gay downtown. Had the best beds I've ever slept on. Super clean, friendly & accomodating. My place in San Diego!", "Date": "March 10, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Wisconsin", "Title": "“A Great Stay”", "Author": "WisconsinVagabond", "ReviewID": "UR98269537", "Content": "We enjoyed our recent stay at BPI. We had the most inexpensive room class, $99, but it was adequate in size and had a walk-in closet, a frig, coffee maker, and microwave oven. We received more than enough pastries and cereal at our continental breakfast, served 5 minutes after we called, either in our room, on the terrace, or up on the sun deck. The grounds of the hotel were nice, with the rooms in three separate buildings side-by-side on Upas Street. We had a Midnight check-in, and were wisked to our room as soon as we showed up. We had to park our car about a block away at times, but at least it was free. We met the owner, Edward, at check-out and he was very pleasant. The hotel is very convenient to the Hillcrest neighborhood, and is at the north entrance to Balboa Park. We would definitely stay here again.", "Date": "February 27, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Tempe, AZ", "Title": "“Charming and Eclectic and Close to Balboa Park”", "Author": "Rororosie", "ReviewID": "UR97634457", "Content": "If you are a musuem/zoo buff, this is the best value in San Diego for a trip! I could walk down to the park. The parking is on the street but for me this was not a problem. I didn't mind parking close by in the neighborhood. The rooms are very eclectic, almost to an extreme, but I found that quite amusing. I have stayed in the Harlequin and The Aruba so far. They are very, very comfy!", "Date": "February 22, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Blue Hill, Maine", "Title": "“charming!”", "Author": "hu11nt", "ReviewID": "UR90941340", "Content": "If you are looking for the sterile monotony of a chain hotel, look elsewhere. If you are looking for aplace with personality, that feels more like home, check out the Balboa Park Inn. We came to town for a medical conference with a few extra days allotted for fun with the family. Balboa Park Inn provided us with all of the comforts of home, including a full kitchen, living room in which to visit with the family, and delightful terraces and balconies. The bed was the most comfy we've ever experienced in a hotel. Each room has a different decorating theme, so I can't speak for all of the rooms. Ours was quirky, but lovely with a number of interesting touches such as cross-stitch embroidery on the sheets, embroidered shower curtain, and Waterford crystal in the lighted display case in the living room. All of this came at a price significantly less than the boring bed and bath that we would have had at the Hyatt in which the conference was held. The staff was friendly and helpful. The hotel is a short walk from the San Diego Zoo and Balboa Park.Breakfast was included in the price and was served in the room...cereal and yummy hot pastries and croissants. All that and a perfect central location made this a wonderful choice. We will absolutely return. friendly and helpful rooms", "Date": "December 28, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "San Diego, California", "Title": "“Our Five Star Resort”", "Author": "Bert_Ayala", "ReviewID": "UR83746315", "Content": "Well my wife and I are San Diego natives and this year for our tenth anniversary we had this great idea to stay close to home and just find a nice place to relax and get away from it all. So we picked this wonderfully charming hotel to spend a few days together alone. We chose the Balboa Park Inn, mostly because of it close proximity to Balboa Park and one of our favorite restaurants The Prado. We checked out a few of the other themed rooms the Inn had to offer, each had its own unique flavor and exquisite furnishings. We were impressed by their attention to details and after much deliberations we settled on their very best room the Tara Suite. The suite was very spacious, beautifully & uniquely decorated, the furnishings were even more impressive starting with a fancy gold silk down filled Sherrill sofa to relax on, a wonderful Empire style Century Furniture dresser for our clothes with the matching desk, a beautiful Theodore Alexander accent chair with the matching console...no cheap particle wood hotel furnishings here. The entire suite was impressive to say the least. As you continue through to the rear of the suite you are surrounded by the romantic aroma of scented candles all around you (all electric and remote controlled). In the corner is a large bar with all the kitchen amenities discreetly tucked behind it, a microwave, coffee pot and wine glasses. But the best part about this suite is the oversized jacuzzi and European style bathroom all so cleaned it looked brand new as if we were the first to use them. The bathroom was unique in that it had no door! Just a simple wall defining the private space. There were two showers next to the jacuzzi one was a big rain shower head which was great to use. The room was so nice we spent more time inside than out. The service was outstanding. The staff is very knowledgeable, pleasant, and helpful at any hour. We received a level of customer service we had only experienced in five star resorts. I am not in the habit of writing reviews or talking up any establishment but honestly any one considering a nice romantic place to stay here in San Diego and at great prices do not look any further. This is our favorite get away and it will soon become yours!", "Date": "October 16, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Pittsburgh, Pennsylvania", "Title": "“Exceptional - 5+++”", "Author": "DPD123", "ReviewID": "UR82247453", "Content": "All staff were great. Our suite, #24 was very recently renovated - clean as a pin and most new. Don't go by the photo of it on their website. My guess is that things are being renovated throughout the Inn. We received a complimentary upgrade which made our stay a tremendous value. The Inn is unique and, for us, it had a \"home-like\" feel. If you want to pay $100-$150 more for fancy digs, knock yourself out. The Inn is within walking distance (20-40 minuets) of great, inexpensive restaurants, Trader Joe's and Ralph's, a major grocery store. Being on the edge of Balboa Park was a major advantage. The zoo is a 10 minuet walk. Another 10 minuets gets you into the heart of the Park. Bus stops are across the street if you need public transportation. BPI is a gem.", "Date": "October 5, 2010"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Overall": "1.0", "Value": "1", "Sleep Quality": "3", "Rooms": "1", "Location": "1"}, "AuthorLocation": "Nashville, Tennessee", "Title": "“dated, musty, over decorated and not central to anything”", "Author": "predatorlover", "ReviewID": "UR81557116", "Content": "Boy did i make a mistake booking here. Unfortunately I did it based on the reviews i read on line, which must have been written by the owner or thir friends. Now I will try to protect the next person. First off we were greeted by a smoky smelling front desk area, and a most unfriendly gentleman who yelled at his housekeeping staff in front of us, which I was appalled by, and followed up with commenting on the weight of our suitcases. Suddenly we were \"upgraded\". to a room on the first floor (can you say \"too out of shape to lift our suitcases a flight of stairs\"). This Inn was eclectic for sure...like NOTHING in our room went together, it was overdecorated with fake flowers everywhere and was musty smelling, covered over with cheap air freshener. If this was an upgrade I would hate to have seen where they were planning to put us to start with. It was advertised as close to Balboa Park..I don't think so. Everytime we went to Balboa park it was a $8 cab ride. It was near NOTHING...it was in a residential neighborhood with a restaurant 8 blocks up and three blocks over. The clencher was there was no service to print our boardig passes. I nearly came out of my skin when the lady at the desk said we could go to Kinkos! The best part of this hotel was the housekeeping staff, and the cab that drove us away the second morning.", "Date": "September 30, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "3", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Toronto, Canada", "Title": "“Excellent”", "Author": "Anne_Peters_618", "ReviewID": "UR79351387", "Content": "Great location, quiet and clean. Other guests were lovely too", "Date": "September 13, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Stockton, California", "Title": "“Funky, Great Value”", "Author": "Leveetrash", "ReviewID": "UR79251081", "Content": "I have stayed here a few times and it never disappoints. The location can't be beat. The SD Zoo, Balboa Park are right outside your door. Close to downtown. 10 minute drive to airport. It is in the Hillcrest neighborhood which has lots of shopping and restaurants. It is offbeat so may not be for everyone. Those who enjoy cookie-cutter one room Hotel Circle type places should stay away. Someone I know who has no sense of adventure, imagination or fun (she lives on a golf course in a planned community) stayed here once on my recommendation and found it \"disturbing\" which means it is perfect for people like me. Each room is decorated differently. My last stay was in The Monet #5 $149, bk included. Separate sitting room, good size full kitchen, quiet, porch overlooking the deck area. The full kitchen is always a good feature if you are staying a while so you don't have to eat out all the time. They will bring your breakfast to the room or to the outside deck area. The deck area is a nice feature. We had wine outside in the evening and met some other people.", "Date": "September 12, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Bronx", "Title": "“Great Inn :)”", "Author": "TripsandFalls", "ReviewID": "UR75058600", "Content": "My husband and I stayed at the Balboa Park Inn from Friday to Monday and we were very pleased with the establishment. The staff was very nice, the facility was beautiful, rooms were clean and the area is quiet and peaceful. The rooms are quarky, however they were very clean and comfortable. We stayed in Vicorias Secret and Monet's. They mistakenly over booked the VS room and had to move us for the last night, but they made the transition very easy. The hotel is in walking distance to the zoo, which is great because the parking for the zoo on the weekend was horrible. And there is a bus stop right in front of the hotel that stops @ the zoo, Balboa Park and goes into downtown SD. Down side- coffee pot in the room and a few little treats for the continental breakfast, but there is a cafe about 3 blocks away that had good coffee and breakfast. I would recommend this Inn if you are staying in the San Diego area :)", "Date": "August 13, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Toronto", "Title": "“Charming, close to zoo, great value”", "Author": "absolute_di", "ReviewID": "UR74374306", "Content": "We stayed in the Aruba room of this charming B&B. Our room was probably the smallest room they had, but it was adequate for the two of us. We are of slim physique and only had two carry-on luggage and there was just enough space for our stuff and to move around. I wouldn't recommend this room for anyone that likes spaciousness or have lots of bags. The bathroom on the other hand is HUGE, it's about 1/2 the size of the bedroom! It's got a jacuzzi with bubble oil supplied. The room is well equipped with: dishes, bowls, utensils, fridge, coffee maker, coffee, tea, ironing board + iron and hairdryer. There's also an ice box in the courtyard. The free wi-fi internet was also a plus and much appreciated. We found the courtyard decorated with lots of plants and small ornaments really charming. It was a nice little place to sit and enjoy breakfast. The breakfast consisted of juice, pastries, and cereals. The pastry basket only has 4 pieces of pastries. The croissant and mini muffins were the best, so try getting extras. Conveniently located next to the zoo and close to Balboa park. In fact, it's probably a 10 minute walk to the zoo if you don't want to drive and find parking. Balboa park is also very close by and a must-see. I wish we had more time to spend at the beautiful park. Street parking (on the side street) was never an issue with us, but if you park on the main street, be sure to read the signs as they wash the streets and you can't park on a certain side on a certain day. We were very pleased with the price of this place. After doing lots of research on the web, I think Balboa Park Inn is truly exceptional for the value. Next time we're in SD, I'll probably book this place again, but with a different room (not because I didn't like Aruba, but because the other rooms look beautiful as well). Someone mentioned that this isn't really a bed & breakfast, but more like a 'hotel'. I would have to agree that it's not the conventional 'bed & breakfast', because you don't get to meet the owners and it doesn't really feel like a 'house'. If you're just looking for a clean, convenient, comfortable place to stay, then consider this Inn. If you're looking for the full-fledged Bed and Breakfast feel, then this may not be to your liking.", "Date": "August 8, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Connecticut", "Title": "“Quirky but comfortable”", "Author": "jfd07", "ReviewID": "UR74224067", "Content": "This was my fifth stay, each time in a different room. The area is quiet and safe, and just a short walk away you can find the restaurants of the Hillcrest area. The rooms are a terrific value. This was my third suite- I really like having a kitchen and sofa especially for a stay of more than a couple of days. It felt more like an apartment than a hotel. I will say the breakfast has gotten a bit skimpy since my first visit when there was fruit as well as cereal or pastries. However, I knew that lunch and dinner would be substantial each day, so a simple breakfast was fine. I enjoyed a late night hot chocolate on my balcony each night- a great way to wind down. Someone mentioned the air conditioner- yes, it was very loud and a step stool was provided to turn adjust it (not a great idea for a person with creaky knees). But the nights were so cool I didn't use it, even though it was August. The only other thing I'd add is room darkening shades. The room was brightly lit from the lights outside and morning seemed to come awfully early.", "Date": "August 7, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Carpinteria, California", "Title": "“Lovely Place”", "Author": "amberLeiv", "ReviewID": "UR73344677", "Content": "This really was a lovely place to stay. The neighborhood was friendly and felt very safe, plus it was just a step away from Balboa Park. The parking was usually very easy to find, it was only when we would come back somewhat late (around 12 or 1 am) that we would have difficulty finding parking and have to park somewhat far away. The room was adorable and we loved the convenience of having a kitchen and a door that led to the sun terrace. The air conditioner in the room is a little loud and though it could probably drive some people insane it actually helped me sleep better haha.The service was always kind and helpful. My only real complaint is that the walls are a little thin. I felt a bit strange being able to hear every word of the peoples conversation in the room next to us, it made me want to talk very softly because i was worried about disturbing them or just the fact that they could hear every word i was saying as well was creepy. The buildings seem to be a little old so it wasn't really a surprise that the walls were so thin. But overall it was a great experience and I wouldn't mind staying here again.", "Date": "August 2, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "York, England", "Title": "“Fantastic place to stay”", "Author": "gflaz54", "ReviewID": "UR69234681", "Content": "Stayed here for 3 nights. Lovely welcome and easy to find. No problems parking on roadside. Rooms are all themed. Ours had a full kitchen which was great as we made our own meal one night and got pizza delivered on another. Very comfortable, spacious rooms. It was very peaceful in the courtyard where our room was situated and the roof terrace was pretty where we ate breakfast. The staff were very friendly and gave us all the information we needed. We found the location very convenient. It was a ten minute walk to the zoo where we spent a whole day and about a fifteen minute walk to the park where you could pick up the trolley bus tour. Definitely a place to remember", "Date": "June 30, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Akron, Ohio", "Title": "“Excellent value - great location”", "Author": "plstrom", "ReviewID": "UR62245485", "Content": "We were in San Diego for the first time and wanted to stay away from the big chain hotels, which are expensive. We also wanted to get a feel of some of the city neighborhoods. Balboa Park Inn was perfect for our needs. We could walk to the San Diego Zoo and all of the attractions in Balboa Park. We also could walk up to some great restaurants on University Ave. The room we stayed in had a kitchen, so we saved some money and bought some simple things at the local Trader Joes (which was welcome after spending all day on our feet at the zoo). Don't worry too much about parking - we were there from Wednesday through the following Tuesday and never had a problem getting a spot on the street, right in front of the place. We took the car out several times to go to places like Torrey Pines, Cabrillo, La Jolla and Coronado (lest you think we parked and left it there for the week). There can be a bit of noise from the street - you are in the middle of a residential neighborhood - so get a room on the inner courtyard if that's a concern. It's also a safe place to walk around in the evenings, which was nice.", "Date": "April 23, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "3", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Chapel Hill, North Carolina, USA", "Title": "“Quirky but a great place to stay”", "Author": "Shoggoth", "ReviewID": "UR60689131", "Content": "If you're looking for the Holiday Inn or the typical large chain hotel experience, do not stay at Balboa Park Inn. However, if you appreciate (or at least aren't bothered by) quirky touches like plastic flowers, this off-the-beaten-path B&B has a lot going for it. We stayed here with our preteen son in one of the suites, which was perfect for us. The kitchen was nice to have -- we got dinner from the local Whole Foods in Hillcrest a couple of nights we were there, and the kitchen has all the basics you need (including a corkscrew!). The service was great, the beds were comfy, the rooms were clean, there wasn't much noise from the street, and you can't beat the location. Oh, and there's free wireless broadband. After reading other reviews, we skipped the breakfast and either ate in or visited the fabulous Bread & Cie in Hillscrest. Some people here have complained about parking, but we had no problems finding a parking space on the street. Most nights we got a spot right in front of our building's door; two other times we had to park a short walk around the corner, but this didn't bother us. We would happily stay at Balboa Park Inn again.", "Date": "April 7, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "san diego, ca", "Title": "“\"America's Finest\" - Finest Secret - The Balboa Park Inn”", "Author": "13beaches", "ReviewID": "UR59970601", "Content": "Tucked away in the heart of America's Finest City (that's what San Diego calls itself- and for good reason) is a B & B so quaint, so comfortable, so well run and so unusual, you'll be amazed you haven't heard of it before. It's not at the beach (not even on a hill overlooking one) and no, it's not in famous La Jolla or downtown in the trendy Gaslamp Quarter. In fact, the BALBOA PARK INN is right where it says it is, at the edge of one of the truly great city parks in America, a 5 minute walk from the San Diego Zoo and more than a dozen top-notch museums-all located in, yes - Balboa Park. BALBOA PARK INN is a restored guest house from the early part of the last century, now comprising 26 unique, differently appointed and themed suites - all affording the best in value, comfort, convenience and originality - and the food ain't half-bad either. It's romantic for the couple who is looking for something really fun or perfect for the stressed-out business traveler in town for a few days and looking to get \"un-stressed\". It's a 2-minute drive to downtown, 12 minutes to the airport, and just a few minutes from either the \"Gaslamp\" or the \"Hillcrest\" neighborhoods, both packed with one-of-a-kind restaurants, exciting night-life and unique shopping. Prices run from around $100- $250, all are suites, some with mirrored beds, fireplaces and jacuzzi tubs and the top-of-the line rooms, such as the \"Jungle Nook\" or \"Greystoke\" are so wonderfully playful you may find it difficult to venture out (ala Jane and Robert in \"Barefoot in the Park\"). I live in San Diego but make it a point to \"escape\" every now and then to the BALBOA PARK INN - it's a one night vacation and lucky you if you're checking in for a longer visit.", "Date": "March 30, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Hollywood, CA", "Title": "“This place is perfect and the staff are amazing. There is parking.”", "Author": "Hollywood_Sun", "ReviewID": "UR56321389", "Content": "I have stayed at the Balboa Park Inn at least 5 times driving down to San Diego from LA and this place is exceptional! Yes, there is street parking and I have never had trouble finding a parking spot-ever. The rooms are cute and some have mini kitchens in them which I love because I always go to the store and cook a foil tray of cinnamon rolls so my room smells yummy. The front desk staff are always available for me and have sometimes let me check in early if my room is ready, I just call ahead to check. This place is clean and not only located near the zoo but also shopping in Hillcrest. I recommend Balboa Park inn and really, I won't stay anywhere else. LOVE IT!", "Date": "February 17, 2010"}, {"Ratings": {"Overall": "1.0"}, "AuthorLocation": "Los Angeles", "Title": "“DO NOT STAY HERE- NOWHERE TO PARK!!!!!!”", "Author": "ericcomic", "ReviewID": "UR55982198", "Content": "The room is fine, if a little tacky- but there is absolutely no parking anywhere!!! The liar who took my reservation assured me there was plenty of street parking and that, in a pinch I could park across the street at the school. Neither statement was true. We drove around in circles for an hour every time we needed to park- and the staff was totally unsympathetic. On top of that, they did not warn us that we'd have to move our car for alternate side parking on Mon morning. Pretty much ruined our trip. DO NOT STAY HERE!!!!!!", "Date": "February 14, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Atlanta", "Title": "“Perfect location - perfect suite”", "Author": "heavenlyjane", "ReviewID": "UR55637417", "Content": "We wanted a place that was an easy stroll to the zoo. Balboa Park Inn fit the bill being 5-minutes away. I was extremely pleased with our accommodations, a suite named Suite Cycles. AMMENITIES: For our money (the same amount we'd pay a hotel), we got a bedroom, living room and kitchen. We bought read-to-eat meals at a near-by Whole Foods and made good use of the kitchen. SPECIAL TOUCHES: Our visit coincided with a rain winter rainstorm and the innkeepers lent us a big umbrella so we could puddle-jump our way through the zoo - that was a generous offer that we really appreciated. BREAKFAST: unexciting - a choice of stale pasteries or cold cereal with milk; We skipped it after the first morning. PARKING: Free street parking was easy to find. We always found a spot in front of the hotel. BOTTOM-LINE: We would recommend this place heartily.", "Date": "February 10, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Maine", "Title": "“An inn with a charming personality”", "Author": "marshwatcherMaine", "ReviewID": "UR55009218", "Content": "The beds are extremely comfortable. The rooms are clean and obviously planned and decorated with thoughtful care and imaginative taste. I agree with other reviewers' use of the words \"quirky\" and \"quaint.\" The location next to Balboa Park's museums, zoo, and restaurants is very convenient. It's a great place to come and relax - why bother to stay anywhere else in San Diego!! The price is very good value for what you get.", "Date": "February 2, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Location": "5", "Rooms": "3"}, "AuthorLocation": "Chapel Hill, North Carolina", "Title": "“Ideal for some, not all, travelers.”", "Author": "Susan_in_NC", "ReviewID": "UR53229217", "Content": "This hotel has a lot of character, but it’s not the sort you’d find in, say, an urban boutique hotel. There’s nothing “put on” about this place; it's not trendy and it doesn't have attitude. I found the furniture and decor (including ample bouquets of artificial flowers) pretty tacky/kitschy, but beauty is in the eye of the beholder, and in any case this did not put me off the hotel, which was very clean, comfortable and homey. Fair warning, though – if you’re a traveler who enjoys the sleek monotony of a corporate chain hotel, if you’re a design guru, or if you consider tastefulness to be next to Godliness, this probably isn’t the hotel for you. Our suite, “Medley,” contained a cozy living room with a television, a smallish bedroom with a queen bed, a modest no-frills bathroom, a spacious fully-equipped eat-in kitchen overlooking the terrace, and two closets. We were able to enjoy San Diego’s famous climate by keeping the windows open at all times and we slept soundly in quiet comfort. It appears that each suite has a different configuration, so those wanting a large, luxurious bathroom should choose a different suite, but the layout and amenities were fine for the two of us. A hair dryer, iron, ironing board and all such necessities were provided. I was particularly impressed with how well-stocked the kitchen was, with a full range of Kitchenaid pots, pans and utensils, in addition to the dishes, coffee maker, fridge, range, microwave, etc. It felt like we were staying not in a hotel but in someone’s small and old but well-maintained apartment. This feeling is amplified by the fact that the hotel is in a quiet residential neighborhood and not the bustling downtown. The location means you can’t just step out of your hotel room and have your choice of restaurants and shops within blocks, but if you enjoy walking it’s a reasonable and pleasant walk to the Hillcrest area which is full of options for eating and shopping. I enjoyed walking past the charming little bungalows and cottages of all different styles that make up the neighborhood. You couldn’t be closer to the zoo, and it’s an easy walk further into Balboa Park. During our relatively short visit we didn’t make use of public transit, but when you call a cab (which the staff will happily do for you whenever you ask), it arrives quickly. The distances to anywhere you’re likely to want to go are generally pretty small, so getting around should not be a problem. The free Wi-Fi is certainly appreciated. As for breakfast, it’s a tall glass of juice with either a bowl of cereal or a basket of various edible but frankly unappetizing pastries. I don’t choose hotels based on the quality of the breakfasts provided so this was not much of a negative for me. Bottom line: this hotel would not be right for everyone – some people would love it (“quirky, unique, homey”) for the very same reasons that others would hate it (“tacky, kitschy, dated”). However you can easily get a sense of what the hotel is like by checking out the photos on the hotel’s website, so there shouldn’t be any surprises. If you like what you see online, you will undoubtedly enjoy your stay here.", "Date": "January 11, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "las vegas, nv", "Title": "“What a quaint, eclectic place!!!!!!!!!!!!!!!!!”", "Author": "partdudelv", "ReviewID": "UR47815442", "Content": "We arrived on Friaday, Oct. 23rd at 2:45 pm. Alan at the front desk provided us with all the info we needed. (directions, maps, how far to the nearest store). What a helpful employee. We had reserved the Country Talk mini suite. WOW!!! 4 rooms, a fully equipped kitchen, king size bed in a roomy bedroom, living room with a couch , loveseat & a chair. tv with a boatload of channels. A good size bathroom. A balcony thet leads to a patio are that was great for breakfast. It'a about a 8-10 minute walk to the zoo, which was great!!! Get there about 8:30 am so you don't wait in line very long since it opens at 9. About 5-10 minutes past the zoo is Balboa Park. Another great area. Do the auto musuem & the sports Museum. Highly recommended. Alan also suggested dinner at Busalacchi's Italian restaurant. One of the best meals we've ever had!!! The only drawback was that almost anywhere you want to go, you really need a cab. There are no mini-marts or 7-11's in the area. There is a liquor store about 7 blocks from the inn. They have everything you need. We will definitely come back for another visit, but we will be driving. We hope Alan will still be be.", "Date": "October 26, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Arizona", "Title": "“Good location, Comfortable bed, Clean”", "Author": "swsteph", "ReviewID": "UR46237361", "Content": "It was more than I expected. We walked to Balboa Park every day and walked to University Ave for dinner each evening. Because of the close proximity to the zoo we were able to take our time wondering the zoo over 2 days and never felt rushed. It was simple to take public transportation to the beach. The staff were extremely friendly & helpful but not overly zealous. The bed was extremely comfortable, the kitchen was clean, the eating nook was cozy and the living room was spacious enough for a family of 3 to hang out. For our budget and our plans this was by far the best choice for our family. I hope to stay there the next time we go to San Diego. Note: We stayed in the California Suite", "Date": "October 8, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Northridge, CA", "Title": "“A Very Cute and Funky Place to Stay!”", "Author": "BluEmu", "ReviewID": "UR42568453", "Content": "We just got back from a brief 2 night vacation in San Diego. We chose the Balboa Park Inn because it was right next to the park and the price was excellent. We stayed in the City Lights Room. The room was very clean and well equipped. The weather was delightful so we just opened the windows and did not need air conditioning. The only negative to this room is that it is on Park Avenue. If you sleep like my husband it is not problem at all, but if you are a lighter sleeper like I am you will hear some street traffic noiise. That said I would definitely stay here again. You might also inquire whether the room is on the second floor. It could be a climb for someone who has bad knees. Judy (I don't know if she is a worker bee or owns the hotel or both) is a very nice lady and will help you with anything you need. You can take your breakfast in your room, on the patio or on the sun terrace. We took our on the patio and we very happy with the muffins, rolls, cereal, juice and coffee to start our day. If you are a walker, it is a very easy walk to the zoo and to the museums. Also, there are many nice restaurants in the area.", "Date": "September 18, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Los Angeles", "Title": "“Exceeded my expectations”", "Author": "canadian-in-LA", "ReviewID": "UR37996829", "Content": "My husband and I wanted to spend the weekend in San Diego and visit the zoo, so the Balboa Park Inn was in the perfect location, within 5 minutes' walking distance of the zoo and the rest of Balboa Park. I wasn't quite sure what to expect because some reviewers had said that the Inn was old and funky, but I was delighted by our stay. I'd reserved the Monet's junior suite, but upon our arrival, we were informed that the manager had given us a free upgrade to an even nicer suite, the Nouveau Ritz. We were very happy with our suite, which was extremely clean and very quiet. I found the room decor pleasant without being kitschy - it definitely had more character than a generic hotel room. The staff was helpful without being intrusive. Breakfast was very simple - juice, pastries, and cereal - but it was good. I would recommend this place to anyone.", "Date": "August 17, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Connecticut", "Title": "“best place to stay in San Diego”", "Author": "jfd07", "ReviewID": "UR37428113", "Content": "This was my fourth visit to the Balboa Park Inn, staying in a different room each time. This trip I chose a mini suite (Monet's), with living room (two recliners and sofa), kitchen with full size refrigerator, microwave, coffee pot and toaster and small and very comfortable queen-bedded room. Everything was immaculately clean (the shade in the bedroom didn't always rise, no big deal). Yes the decor is a bit kitschy, with ample silk flower arrangements, but that's part of the charm. A plus is the ceiling fan in every room, for a bit of cooling when the air conditioner is too much. This year it seemed the breakfast was a bit smaller than last time (no fresh fruit) but at the end of the week I noticed I could have ordered both cereal and pastry instead of just one or the other. That plus juice was more than I needed and even provided a treat for a snack later in the day. The biggest delight was the price- even including cab fare to downtown it was still cheaper than the downtown boxy hotels. (The bus is even cheaper.) Plus, free breakfast and plenty of coffee, tea and cocoa mean trips to the local coffee shop are unnecessary. The location is perfect- between Balboa Park and Hillcrest, an interesting neighborhood with great ethnic restaurants at much lower price than downtown. I can't wait for next year's visit.", "Date": "August 11, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Clinton, MA", "Title": "“Loved it and would go back again - but for a whole week, instead of 2 nights!”", "Author": "mrscoviello", "ReviewID": "UR36176605", "Content": "My husband and I traveled the coast along Rte 1 for a week. We stayed in 5 hotels along the way and this was definitely our favorite. We stayed in the Aruba Room ($99 a night). The room is small but the bathroom is gigantic. There is a whilpool tub, which felt great after a long day of walking around. The room has a small fridge, micro, and coffee maker. They even give you a couple of plates and silverware, tons of teas, hot chocolate, coffee, and paper towels. Free, on street parking. We did not have a problem parking right in front of the gate either night. The Aruba room is in the back so it was very quiet. Loved the breakfast. one morning, we had it delivered in less than 10 minutes, the other day we were a little disappointed it took a little over a half hour. You get one of 3 kinds of juice (a pretty good size glass) and can choose cereal and/or pastries (warm) in a basket. We ate on the patio both mornings while planning our day. Would go back in a heartbeat.", "Date": "July 29, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Christchurch", "Title": "“Absolutely magical experience”", "Author": "KiwiMel88", "ReviewID": "UR36104095", "Content": "I booked this wonderful little hotel last minute (two weeks before I was due to arrive) as I was coming to San Diego for Comic Con. Initially they only had one night available as they were fully booked out for the rest of the week. I requested they keep me updated in case there are any cancellations. As fortune would have it, there were & I was able to stay for 6 nights in the \"Suite Escape\". The hotel staff was very quick & friendly about getting in touch with me whenever cancellations occured so I could prolong my stay. Absolutely marvellous communication & within 4 days of my initial booking, I had all 6 nights confirmed. The room was very clean, spacious, beautifully & uniquely decorated, & instantly made me feel at home. The service was outstanding, everyone was beyond friendly & welcoming. Being a mid-twenties single female tourist, safety is a big concern for me. In my two weeks in California, this was the only place I truly felt well looked after. I felt like part of the Balboa Park Inn family! Even if this hotel charged twice as much, I would still consider it a bargain. Not to mention, this was the only hotel I found online that did not quadruple its prices during Comic Con, like all the big hotels do. From now on, this is the only place I would stay at when visiting San Diego. A truly wonderful B & B that I highly & gladly recommend to all!", "Date": "July 29, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "los angeles", "Title": "“Unique and charming and very close to the San Deigo Zoo!”", "Author": "lgmiller", "ReviewID": "UR33910636", "Content": "We stayed one night in the \"Beach House\" Room. It was very nice in a different and whimsical way. Beach motif murals throughout and really roomy. The bathroom is enormous with a very nice jacuzzi tub. It was clean and comfy. The bed was really lovely...felt like sleeping on a cloud. It is a short walk over to the zoo which was the reason for our visit and not to be missed. I think it must be one of the finest zoos in the world. Will definitely go back to stay again and see more of Balboa Park! The people were very helpful and made it one of our more memorable anniversaries! Thanks Balboa Park Inn!", "Date": "July 5, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Durham, North Carolina", "Title": "“Fun place for a budget traveler or traveling with kids to Balboa Park”", "Author": "VictoriaEremita", "ReviewID": "UR32985031", "Content": "Since we were only staying in San Diego one night and didn't need a lot of space we opted for the $99 Aruba room. The room is small, but it's in the very back of the hotel and extremely private. We had no disturbances or noise what-so-ever while we were in the room, it was great! The bathroom is huge and has a whirl-pool bath tub which we didn't use, but is a nice feature even if it is a little old and out dated looking. The room was very clean and the bed was comfortable enough. The decor is a little kitchy, we had colorful plastic fish strung from the ceiling, but if you are expecting this element it can be fun. The staff was very friendly when we arrived, showing us where we could park on the street and taking us to our room. There is a small continental breakfast that can be requested and brought to your room. It's not a gourmet breakfast, but it's still a nice touch and you can eat it outside on one of the many patio tables they provide. There is also a coffee maker and provided coffee in your room if you want to have that with breakfast. The hotel is located on the edge of Balboa park and easily walking distance to the zoo. It's a great choice if your primary San Diego destination is Balboa Park! Overall, the hotel is a great place if you don't need super fancy accommodations and just want a nice, clean, safe place to stay for a very reasonable price while you are in San Diego.", "Date": "June 23, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Phoenix, AZ", "Title": "“Nice Location, Clean, Affordable”", "Author": "TravelGirls11", "ReviewID": "UR32581160", "Content": "I found this hotel on TripAdvisor and got pretty much what I expected. I stayed in the City Lights room for two nights. Everything was clean. Liked the fridge, microwave, free Wi-Fi. Location was convenient next to Zoo & Park. Very cute little neighborhood, but still close drive to beaches. Everyone was friendly. Felt safe for a girl traveling alone. Only drawback, the only parking was on the streets, which sometimes was a little full or very tight squeezes. Also the electrical outlet in bathroom was up by the light, which isn't very convenient. Overall, great deal if you don't need anything super fancy and are looking for something clean, safe and affordable.", "Date": "June 18, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "san jose, ca", "Title": "“Absolutely the BEST!”", "Author": "bluedogtravels", "ReviewID": "UR32374501", "Content": "The Balboa Park Inn is heavenly! Quiet, clean, friendly and fabulous are only a few of the words that can describe this unique lodging. Close to the happening and hip University Avenue, across the street from the Zoo, I can't say enough about how much I loved staying in this hotel. Our room had a living room, a bedroom and kitchenette. The space and layout were fabulous as we were there a few days and never felt crowded. I highly recommend the Balboa Park Inn, the owner is on-site and the staff -Jim - are terrific!", "Date": "June 15, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Rijswijk", "Title": "“Authentic hotel close to Balbao Park”", "Author": "Josbob", "ReviewID": "UR29763245", "Content": "We choose this hotel because of the location (really at the border of Balbao Park) and the variety of rooms. The rooms are located in several old buildings and are all different. We had Suite Sanctuary with full kitchen which was very nice. The price is relatively low, the service is good. The bedroom was not at the streetside and quiet. It had a king, but two beds is also an option. Housekeeping was excellent. We loved the Bilbao Park with all the musea and the wonderful zoo. Also other parts of San Diego are worthwhile, such as the beautiful beaches (especially Corona Beach) and old downtown. Any negative points? Not much. Maybe the sun terrace which has no view and is not very cozy. And you better skip the free breakfast which is only sweet cakes and cereal. Overall a wonderful hotel which we highly recommend.", "Date": "May 11, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "2.0", "Value": "3", "Location": "4", "Rooms": "2"}, "AuthorLocation": "Ventura County, CA", "Title": "“Old, kitschy motel; good location; great staff”", "Author": "LA2Ventura", "ReviewID": "UR28109999", "Content": "The Inn's location is convenient and the excellent staff are friendly and helpful. We spent three nights in the Beach House room, which was relatively secluded and devoid of outside noise. Getting to the Beach House required a walk through a narrow \"canyon\" between two buildings whose sides are heavily covered with undisguised pipes (for water, gas, etc.). The path continued through a narrow, cluttered courtyard. We noticed that some of the planters still had price stickers still on them. The Beach House room door had frosted glass inserts that were worn in places, potentially enabling outsiders to look all around the room. We tore off pieces of paper and stuck them in the window frames for greater privacy. The room itself was decorated in a mostly tropical theme and there was a mural on one wall. The room also contained a small LCD TV (we could not get any of the HD channels), three fake trees (the one by the bed looked like it was made from an old Christmas tree), an air purifier, and a mini-fridge. Both appliances made a noticeable hum that eventually became distracting. The window fan/heater/AC unit was very noisy and the controls were hard to reach. There are mini-blinds and curtains on the windows. The blinds and sheers close but the opaque curtains do not. That could be a problem for folks who require greater darkness for sleep. There is abundant light for reading, but the two wicker chaise lounges have slippery cushions on them. As for cleanliness, the room was immaculate except for a silverfish crawling across the bedspread (ugh!), some well-worn brochures on the bureau, and a sponge left on the bathroom floor. Speaking of the bathroom, it is spacious, contains lots of mirrors and plush towels, and features a jacuzzi with a mirrored, faux-candle-lit surround. Directions for the jacuzzi are too brief and confusing to be helpful. (A desk clerk was unable to decipher them.) The shower stall is roomy but hot water can be slow in coming. The amenities include body lotion that smells very strongly of peppermint. There are dozens of gaudy, artsys-craftsy fish hanging from the ceiling. We thought they might look cute in a child's room. Skip the unimpressive continental breakfast (the Inn's only room service) and head over to Richard Walker's Pancake House, which is open for lunch as well. The food, service, and ambiance are all top-notch and worth a wait.", "Date": "April 15, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Kelowna", "Title": "“Location was wonderful walking distance to Balboa Park”", "Author": "SunnyOkan", "ReviewID": "UR26777731", "Content": "We spent 1 week in San Diego. We booked the Balboa Park Inn because of it was close to Balboa Park. It was wonderful to walk to the Park and enjoy the zoo, museums and other attractions. We purchased some food and beverages and enjoyed a snack on the sunny terrace in the afternoon. The room was spacious and clean. It was great to have a separate sitting room, bedroom and kitchen. From Balboa Park we took the Trolley tour, excellent value, and a cab from downtown was about $10.00. Our room was very quiet in the evening and a short walk to Hillcrest and many dining choices. I would recommend the Balboa Park Inn as an refreshing alternative to a standard hotel room.", "Date": "March 24, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Half Moon Bay,CA", "Title": "“My favorite hotel IN THE WORLD......”", "Author": "margaHalfMoonBay_CA", "ReviewID": "UR25144429", "Content": "This is a truly hidden jewel. It is one of the most unique and welcoming Inns that I have ever stayed. I have been coming to the Balboa Park Inn for over 20 years and it just becomes lovelier with each visit. This is because the general manager and owner, Mr. Ed Wilcox is passionate and meticulous about the Inn He is constantly changing the decor of these beautiful rooms with a unique artistc fervor that I have never seen. The suites are all very unique with exquisite pieces of art that sometimes come from his personal collection. I asked Ed does he have a special security system to protect his magnificent pieces and he assures me that people that stay at the hotel are gracious and respectful.. although I know he would know in 2 seconds if anything went missing! All the rooms are wonderful and different to fit peoples needs and taste. I love to stay in each room to experience the uniqueness. The \"creme d' la creme\" is the Greystoke Suite which is out of this world! The collection of bedroom furniture is a collectable ensemble and the spa bathroom is amazing! The tile work in the bathroom is a work of art on its own. You must see it to believe it! It even has a fireplace in the SPA! There is also a fireplace in the living room as well. The hotel location is perfect for business or pleasure as it is centrally located with easy access to a major highway, however it is situated on a quiet little street next to the beautiful Balboa Park. Of course there is wireless access and a yummy continental breakfast that they bring to your room! The best part are the prices they are reasonable in fact I think a bargain.... For all these reasons I have been a loyal customer and will continue to be one! This is 5 STAR hotel with a 3 STAR pricing- don't miss it!!!!!", "Date": "February 25, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "3", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Fairhope, AL", "Title": "“One of a kind -- wonderful time!”", "Author": "Namekal", "ReviewID": "UR24106332", "Content": "Before I booked my room at the Balboa Park Inn, I was told that the owner/manager loves to lavish attention on his rooms, and this is definitely the case. Each room in this remarkable B&B is uniquely stamped with its own personality -- Paris in the 30s, the American Southwest, the islands, the African veldt -- each with its own special decor, appointments, and amenities. Many of the rooms have ensuite jacuzzis and fully equipped kitchens. The room I spent two nights in had a Stickley sleigh bed and the world's most amazing walk-in shower! The proprietor, Ed Wilcox, is very knowledgeable about his rooms and the Inn's history (it was built for the 1915 Panama-California Exposition). I have only good things to say about the staff. The housekeepers go the extra mile on details (I returned each night to find my hand towels neatly folded into fantails). The front desk managers were always prompt and attentive, particularly on the afternoon/evening shift. All of the restaurant recommendations I received were outstanding. And the Inn is right there at the park's entrance, so you don't have to go far for a great day out. Book it now!", "Date": "February 2, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Business service (e.g., internet access)": "5", "Check in / front desk": "4", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "", "Title": "“Wonderful stay!”", "Author": "AlbuquerqueSparkle", "ReviewID": "UR23744080", "Content": "We were there for our 25TH and it was wonderful!!! Staff were friendly and very helpful. We stayed in #11 the suite cycles room. I posted pictures. The location was key and we loved the feel of having our own apt. A short walk to THE zoo and Balboa Park. The terraces at night under the moonlight with the quiet sounds of the neighborhood. We would stay here again in a heart beat. If you are set in staying by the ocean then look somewhere else, but for the zoo and Balboa park and the area itself....it was a great experince for us. I highly recommend the suite cycles room. From this location we had no trouble finding our way to the ocean. Also if you are planning on doing the tolley tour,there is a pick up spot at the zoo and balboa park. And then you can be dropped off there too,with a short walk back home.", "Date": "January 21, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "LA", "Title": "“This Inn Makes Me Happy”", "Author": "FastFlo", "ReviewID": "UR23650831", "Content": "Let me start by saying I am a traveler, not a tourist. I have stayed at the Serena Inn in Zanzibar, both the Mount Grace and the Cape Grace in South Africa and the Hotel des Artistes in Paris. I travel a lot and I love to stay at small but comfortable places. The large hotels and the execubox, not for me if it can be avoided. This Inn has become my favorite of all time. There are about 20 different rooms. Really different., each has a different theme that is done to perfection. I, my family and friends have stayed in about half of them. They are beautifully decorated, many with large jacuzzi tubs. Even some small rooms have the tubs. Some of the rooms also have full kitchens if you are with your family. There are natural food markets and supermarkets just minutes away. There is a very nice enclosed central patio with lovely seating and many of the rooms have their own porches with bistro tables and chairs. There is a large lovely sun roof where you can bask in the sun or watch the stars. It is quiet, clean and friendly. They are walking distance from the San Diego Zoo, several museums, a spectacular rose garden and if you like them, an even more spectacular cactus garden that covers probably close to half a mile and a whole hillside. The Globe Theatre is also in Balboa Park. They are less than a $10 taxi ride from downtown San Diego, Amtrak, the airport and the port of San Diego where you can see some really great historic sailing ships. The staff is very friendly and helpful. There is a lovely little gift area in the lobby. It has saved me time occasionally just by having items I would actually give as gifts which don't cost an arm and a leg. The staff does everything they can to accommodate your wishes and have brochures with maps to everything in SD. They are also very good at either bringing you what you need within minutes or staying completely out of your life. I love these people and I always feel completely safe when I am there. No matter what I am doing in SD, I would never dream of staying anywhere else if I need to be in town overnight. Between 2004, when I was directed to them by someone who really LOVES me, and today, I have never stayed anywhere else when in SD. I am ashamed of myself for not having written this sooner. But as I said, I am a traveler so time is not always on my side. However, after my last trip there when I was with them for 6 days instead of the usual 2 or 3, I saw that the congeniality is constant and only gets better with time. So I took the time to tell them I love them and to tell you, too.", "Date": "January 18, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Business service (e.g., internet access)": "4", "Check in / front desk": "5", "Overall": "3.0", "Value": "3", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Honolulu, HI", "Title": "“Great neighborhood, like staying at grandmas”", "Author": "MarianaG", "ReviewID": "UR23018835", "Content": "This is a small older hotel with kitchens or microwave/refridgerator and continental breakfast. We stayed in the Beach House and it is Miami beach designed. The pluses; big king size bed, big room, large bathroom with double size shower and jacuzzi tub. The place is dated and it shows. It was clean. The breakfast is just lots of carbohydrates and some fruit juice; some fruit or yogurt would have been nice. You make your own coffee in the room. The pillows were large and foamy. Location, Location. This place is in a safe neighborhood with free parking. It is next to Balboa park and the Hillcrest neighborhood where you can find every type of restaurant, Whole Foods, Ralphs, pharmacies, etc. Parking is free but you have to find it on the street. The room was quiet!!! The room had an old window heater/AC unit that ran/off all the time. The linens are dated. This is like staying at grandmas without grandma walking in.", "Date": "December 26, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "4.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Seattle, WA", "Title": "“Great value and location, friendly staff”", "Author": "CatLuvr", "ReviewID": "UR22564309", "Content": "We had an excellent stay at the Balboa Park Inn. Don't expect luxury at this property. Do expect a very clean room and exceptionally friendly staff. They held our bags for the day while we toured the city, called us a cab, got our breakfast order 100% correct and were very friendly. We stayed in the \"Suite Escape\" room. Plenty of space for two people who like each other. Small bathroom but very clean. The room faces a main road so maybe avoid if you have problems with traffic noise. As many other reviewers have mentioned, the decorating schemes are eclectic and in my opinion, lots of fun. Overall, highly recommended for a great value.", "Date": "December 9, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "California", "Title": "“Wonderful stay at the Balboa Park Inn”", "Author": "Wynda", "ReviewID": "UR22560882", "Content": "We recently spent one night at the Inn so we could enjoy Balboa park without the long drive home. The Inn is as close as you can be to the park without being on the grounds. Everything was so convenient that we were able to walk to everything without being tired and we never had to use the car. The Inn itself is charming and cozy, with lots of extra touches. Everyone we encountered at the check-in desk was friendly and helpful. Our room was decorated for the holidays which was a nice touch and really made us feel at home. I was a little nervous about the comfort of the beds because of previous reviews, but we were pleasantly surprised with the comfort and there was NO crinkly sound at all. Our bedroom had two tempur-pedic pillows along with four other soft pillows and a humidifier. We booked a few days before our stay so the only room left had only one bed, but the Inn had an inflatable bed ready when we arrived for our 10 year old. Our room had two tv's, a kitchen with utensils,microwave,full size fridge, coffee pot and small table. There was also a living room area with a working faux fireplace along with a small ironing board and iron. The bathrooms were very clean and stocked with toiletries and tons of towels. We've stayed at all sorts of hotels from Hilton to Hojo's but this was the most pleasant experience I've had so far. Anytime we stay in San Diego I will book the Balboa Park Inn from now on. Did I mention that they bring a complimentary breakfast to your room? How awesome is that! (Our room was the Talmadge)", "Date": "December 8, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Bolton, UK", "Title": "“Funky, Fun and Unique”", "Author": "StuandEm", "ReviewID": "UR21371824", "Content": "Of the 8 hotels that we stayed in on this trip, the Balboa Park Inn was our favourite. We stayed for four nights in the Beach House suite which proved to be a great choice. On arrival we were greeted with a warm, friendly welcome and shown to our room personally. The bedroom itself was completely unique with murals on the walls, a large bed, loungers, fridge, microwave and coffee maker. If the bedroom was great, the bathroom was amazing with a large shower, jacuzzi tub, more towels than you could ever need and colourful fish hanging from the ceiling. The whole place was quirky and fun. Breakfast is served in the room each morning, although you could also have it in the courtyard or on the sun deck – just call reception 15 minutes before you’re ready for it with your choice. The location of the Balboa Park Inn was also excellent, in a residential neighbourhood on the northern edge of the park very close to the zoo. Parking is available on the street next to the hotel, although it could get quite busy. A couple of nights we had to park around the block but this was not a problem as it was only a couple of minutes walk away on quiet streets. We loved the Balboa Park Inn – it is quirky and fun with a great attention to detail. Both the accommodation and service were top class, and we would go back without hesitation.", "Date": "October 29, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Pittsburgh, PA", "Title": "“Great for Travel with Family & Friends”", "Author": "barrhp", "ReviewID": "UR20376483", "Content": "The Balboa Park Inn was a terrific find for us. Because we have an infant, we needed to have separate spaces for sleeping & gathering -- the Mayfair Suite MORE than met this need with its large living room and two bedrooms. The full kitchen was also a terrific asset as we didn't want to pack up and leave the hotel for every meal. We even prepared a meal and then ate out in the courtyard one evening -- it was quite peaceful. The location was ideal for meeting friends with small kids -- just a short walk to the zoo. When we were up for a longer stroll, the rest of Balboa Park had tons to offer -- museums, shops, picnic areas, and the ever-essential: playground. The hotel is also only a short drive from a number of restaurants and grocery stores -- not too far from I-5 (main interstate thorough-fare) -- and only 12 minutes from the airport. The staff was extremely courteous and helpful, even altering the cleaning schedule to work around the baby's nap time. Overall, we had a great experience with the Balboa Park Inn.", "Date": "September 25, 2008"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "san diego", "Title": "“Service out of this world!”", "Author": "tjboly", "ReviewID": "UR19857949", "Content": "My father was scheduled to come spend a week with me in august/2008. I booked the reservation at the Balboa Park Inn about a month in advance. My Dad's flight was cancelled and I had to reschedule my reservation. Both Edward, the owner, and Judy, the Manager, did everything to give us a new reservation and were nice enough to understand that this situation was out of our control, so they did not charge us for the change. How wonderful to deal with a hotel that undesrtands it's all about service! I highly recommend this fun,well located hotel in San Diego! Karen", "Date": "September 7, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "new york", "Title": "“Great place to stay in San Diego”", "Author": "vdams", "ReviewID": "UR19173312", "Content": "My husband two teenage kids and I stayed four nights at this bed and breakfast as part of our two week vacation to california. This was our last stop and it was perfect. First off the neighborhood that its located in is great. Hilcrest area of san diego has great shopping, restaurants and of course within walking distance to balboa park and the zoo. The Inn is old but very well kept. We stayed in room 14 emmas diary and it was lovely. two bedrooms and a pull out sofa in the kitchen/living area. The patio is lovely and we had breakfast out there every morning. The room was cleaned everyday while we were out and no one disturbed us while we slept in. had great nights sleep on the confortable beds. no street noise very quiet and cozy. We felt like part of the community staying here. I would suggest it for anyone who wants to stay in a comfortable place in a nice area for great rates. Its not near all of the other hotels and you truly feel like a resident and not a tourist.Breakfast was included it was the usual continental fare. Never a problem with parking on street in front of the inn. I and my family loved this place and would return again.", "Date": "August 20, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Check in / front desk": "4", "Overall": "4.0", "Value": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "San Francisco", "Title": "“Adorable palce to stay--for a great price!”", "Author": "0wlbear", "ReviewID": "UR18817734", "Content": "Clean, charming, and centrally located, my only regret about the Balboa Park Inn is that we didn't stay here the whole time. It has character-- those without imagination may find it tacky--but it was the perfect place for my girlfriend and I to feel like we were crashing at home in San Diego.", "Date": "August 10, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "4", "Overall": "4.0", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Staffordshire", "Title": "“Unique Getaway”", "Author": "Priestbot", "ReviewID": "UR18022393", "Content": "My Husband and I stayed at the Balboa Park Inn at the end of our honeymoon after travelling through California. After the bright lights of LA, the Balboa Park Inn was a breath of freah air - I have never stayed anywhere quiet like it and was very impressed. We stayed in the 'Beach House' which was wonderfully spacious and comfortable, we were able to spread out properly. Everything was immaculately clean and the bed was incredibly comfy. The bathroom was fantastic with a huge Jacuzzi bath, perfect for soaking weary feet after a day at the zoo! The hotel was so laid back and quiet, you felt as if you had it all to yourselves and we enjoyed having early evening drinks in the courtyard. San Diego itself was also great, very chilled, some great restaurants including the Strip Club where you grill your own meat, good value, delicious food. Our stay rounded off a superb holiday and if we ever return to San Diego, we will definitely be back at the Balboa!", "Date": "July 18, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "4.0", "Value": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "London, England", "Title": "“A great accommodation choice. Would stay there again.”", "Author": "infolondon", "ReviewID": "UR16554364", "Content": "I booked Balboa Park based on previous TripAdvisor reviews. They weren't wrong. This is an excellent place. The room was a good size, bed was comfortable and all the staff were friendly and helpful. In fact the cleaner even found a necklace which we had left in our room on check out. The hotel provides some nice touches like daily newspaper delivered to your room. I have struggled to find anything negative to mention. However I've come up with some advice should you consider staying here. - Breakfast - Breakfast is a choice of either cereals or croissants and buns. Both options come with fresh fruit. The croissants and buns are particular good, highly recommended. It is nice that they will deliver the breakfast to your room or outside terrace. However after about 3 or 4 days the options do become a bit repetitive. - Water pressure - The water pressure in the shower wasn't as powerful as ideally I would have liked. Although I'm sure this is outside of the hotel's control. - Location - The hotel location is good, but possibly not for everyone. If you don't drive (I don't) please consider the following. I considered the hotel to be in good safe neighbourhood and I felt safe when walking around the area at all times of day or night. It appears to be quite a residential area. The hotel is a 90 second walk to a bus stop for route 7 which runs into downtown. The bus service runs quite frequently about every 12 minutes in the day, and about every 20 minutes in the evening. It takes about 10 minutes to City College where you can transfer on to the San Diego trolley. The hotel is about 10 minute walk south to San Diego Zoo, Rose Garden and a few more minutes to attractions like the model railway museum. 10 minutes walk north of the hotel on to university avenue is Starbucks, 7 11, other restaurants and bars. From university avenue you can catch bus 10 to old town. - Flowers - The flowers in the room are artificial. Not a problem, but might be worth noting. - Pizza delivery - Like a lot of places Balboa Park Inn provides some local information leaflets in the room. One was for the Broadway Pizza delivery service. We decided to use this one night. I have never tasted such a terrible pizza. Obviously this isn't the hotel fault, but I wouldn't recommend ordering from Broadway Pizza during your stay. - Overall - Overall Balboa Park is an excellent choice at a very fair price. I would certainly recommend it and would definitely stay there again. The only reason I've given 4 stars instead of 5 is because the hotel is a 10 minutes walk from shops, restaurants and bars. But I was aware of this when booking, so this wasn't really a problem.", "Date": "June 1, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "4", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Wisconsin", "Title": "“We Love The Balboa Park Inn!!!”", "Author": "MEKWisconsin", "ReviewID": "UR16356546", "Content": "We have just returned from our fourth visit and will most definitely stay here again. Unlike the many hotels with their \"cookie cutter\" rooms, this inn is charming and unique. Each room or suite is decorated differently and beautifully furnished. Breakfast was once again delivered to us in our suite or on the terrace or upstairs deck and consisted of pastries or cereal and milk, fruit, coffee and juice. The front desk staff has always been helpful and friendly. I give high praise to the housekeeping staff. Our rooms have always been immaculate and the beds very comfortable. We enjoyed the additions of LCD flat panel television and free wireless internet access, which were both added since our last stay. The location of this delightful little inn is within walking distance of the San Diego Zoo and restaurants, museums and exhibits at beautiful Balboa Park. It is in a nice neighborhood and we felt safe there. We are already looking forward to our next opportunity to make the Balboa Park Inn our home away from home.", "Date": "May 23, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "3", "Check in / front desk": "5", "Overall": "4.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Saint Cloud, Minnesota", "Title": "“So Fun!”", "Author": "Mitre10", "ReviewID": "UR15785186", "Content": "My husband and I stayed 2 nights at this hotel while on vacation and checking out neighborhoods for a relocation. This inn is completely quirky and fun. Because the place was so full, we had to stay in two different rooms, which we ended up being happy about because each room is decorated in a \"theme\" and it was really fun to check two out. They did a great job with the relocation--we just left our stuff in the first room and they moved it all for us while we were out. We stayed in two $99 rooms and they were good value. The first night we stayed in the Aruba room with a beachy theme. The best part were all the little fish attached to the ceiling in both the bedroom and the bathroom, as well as the jacuzzi tub. The bedroom in the Aruba is quite small but the bathroom is huge and the room is very private. The second night we stayed in the Suite Escape room. The decor was much more sedate. The bed was on a \"stage\" (a little difficult to navigate in the dark) and had a canopy. There was a little sitting area in this room. The bathroom was small but perfectly adequate. Breakfast was brought to our room and it was quite good. We'd stay here again--we love a place with personality and a sense of humor! The staff were all terrific, so helpful and friendly.", "Date": "May 7, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Chicago", "Title": "“STILL Our Home Away From Home”", "Author": "Stephani", "ReviewID": "UR15464031", "Content": "We stayed in the Mayfair Suite at the Balboa Park Inn for 7 nights during spring break. This was our second stay at the Balboa Park Inn and it was even better than the first. It truly feels like a home away from home. The location is excellent,n a quiet residential neighborhood that is iwithin walking distance of the zoo and Balboa Park, close to the restaurants and grocery stores in Hillcrest and a short distance from downtown. Our suite was huge, with 2 bedrooms, a living room and a full kitchen that opens onto the terrace. The free breakfast is brought to your room or to the terrace. We found the fresh fruit, cereal, milk and juice to be more than enough food. The beds are very comfortable. The public places (such as the halls, the outdoor terrace and sun porch), and our room, were kept very clean. The disinfectant smell that others have mentioned is present in the hall but we did not notice it at all anywhere in our suite. We did not have any problem parking either directly in front of our building or within a few yards from it. I felt very safe in this neighborhood, even in the evening. think the management and staff really set this place apart. They are all very helpful and are more than willing to provide suggestions for restaurants and directions for getting around. We wouldn't stay anywhere else in San Diego and have already booked our next stay..", "Date": "April 29, 2008"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "Florida", "Title": "“Love it and will be back”", "Author": "kmplace2029", "ReviewID": "UR15284861", "Content": "Came to San Diego on business and did not want to stay downtown.. Chose very well.. had a lovely suite (3 room) and loved the roof top lounge area. Internet: off and on which can be a problem since I was there on business but it wasn't that too much of a slow down/ did not bother me enough not to return next month Staff went out of their way for great customer service.", "Date": "April 23, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Business service (e.g., internet access)": "3", "Check in / front desk": "5", "Overall": "4.0", "Value": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Seattle, Washington", "Title": "“Clean, inexpensive, helpful staff”", "Author": "RottHound", "ReviewID": "UR15274975", "Content": "My 4-year-old son and I stayed in the California Suite. It was a good size for us. It was essentially a very small apartment with a full kitchen (minus dishwasher), small dining room table, bedroom, and living room area. There was a tiny outdoor area too. Not really a deck, but sort of an enclosure. My son enjoyed running his trains and cars out there and I didn't have to worry about him because it's fenced from the street. PROS: --Close to everything. We rented a car and our longest drive was 12 minutes to Coronado. Balboa Park, Old Town, downtown, and the charming Hillcrest neighborhood were all very close. If I didn't have a small child, I wouldn't have rented a car at all. THe public transport there is great. --Very accommodating staff.. There were a few things missing from the kitchen (knife, pancake turner, hot pads) and they delivered them to the room one at a time, as I discovered what I needed. They gave me lots of recommendations and directions to places and were very friendly. And they were willing to let me have housekeeping every other day, instead of every day. I don't like to waste the water it takes to change all the bedding and towels every day (which I would never do in my own home!) and because I feel compelled to tidy up for the cleaning staff, it's less work for me if I don't have to worry about them coming in every day. --Inexpensive. It's hard to find a 1-bedroom with a full kitchen anywhere else in San Diego for under $200. Having a kitchen saves a lot of money too. We ate many breakfasts and dinners in the room, paying only to eat out for lunch while we were sightseeing. --Clean. The place was kept quite clean. --Easy and free parking. In a week, we only had two times we had a hard time finding a parking space on Upas St. Once, on Earth Day, when 60,000 people came to Balboa Park and took up a LOT of parking spaces! And the other on a day when we came back to the room at about 3 pm and there were cars lining the street with parents in them, waiting to pick up their kids from the middle school across the street. In both cases, we drove around the block 3 or 4 times and finally found a space in front of the inn. Not really a big deal. I must say that San Diego in general is a nirvana of free parking. I come from Seattle, land of expensive pay parking, so it was amazing to me that there was lots of free parking at Balboa Park, the zoo, Old Town, Coronado beaches. We never once paid for parking. Try that when you go to Seattle Center or Pike Place Market! CONS: --The rooms in the California Suite were very small. The bedroom pretty much only had room for the bed and night stands. I had a pack-and-play in there and it was wedged between the bed and wall and you couldn't walk around it. The dining area was also cramped and I think it would be difficult to seat 4 people there. The kitchen had very little prep room. For the price, we didn't mind, but if you had more than 3 people, it would probably be too cramped. --The smell of the cleaning solutions they use were pretty overpowering, as several people have pointed out. I opened all the windows and the door to air it out the night we got there and by morning, it was better. The fabulous thing though is that all I had to do was mention it to the front desk and they arranged for the cleaners not to use anything smelly while I was there. Problem solved easily and painlessly. --Noise in our room. Our room was at the bottom of the staircase, right next to the main door for our building, so we heard every guest come in (slam!) and leave (slam!) and haul their luggage up and down the steps (bump, bump, bump). Fortunately, when we had the bedroom door shut, we couldn't hear it. Mostly we just heard it while we were up and around. But if you have a baby who needs to nap during the day, it's something to think about. Overall, we had a great time and I plan to go back to the Balboa Park Inn as soon as I can afford it. A week was not enough to see all the stuff we wanted to see and still fit in plenty of beach time!", "Date": "April 23, 2008"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "melbourne", "Title": "“Baoa Park Inn- Fantastic - Love To Return Someday”", "Author": "blondelinda", "ReviewID": "UR14844731", "Content": "Family of four stayed at this lovely charming B & b for 2 nights in late march as part of our month long stay in the US I was more than impressed with the size, quality, cleanliness, location and friendliness of the staff The location is pefect. cant be beat IMO The staff are the best, more than willing to help with anything The rooms are largest we have stayed in so far We stayed in Emmas Diary it had two bedrooms, and a sofa bed in the sitting/kitchen area. This was more than adequate for my family of 2 adults and 2 teenage children. We all had our own beds We loved san Diego in the short time we where there, and we loved this place and hope to return if we ever make it back to the US Further mention, the best meal we have eaten during our entire stay to date was at PRADO recommended by Judy at the desk, and it was a beautiful restuarant in the Balboa park with excellent service and food Fantastic Stay", "Date": "April 7, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Tampa Bay", "Title": "“Right by the ZOO!”", "Author": "perky2you", "ReviewID": "UR14827554", "Content": "We stayed at the Balboa Park Inn during the month of March. It was a beautiful time of year. The staff was super friendly. We stayed in unit 23. I called to book and told them we had a 3 month old. They put a pack and play in the room for us. They also put a hair dryer in the room so I wouldnt have to drag it cross-country. We had a 3 bedroom suite. It was PERFECT for us! The staff brought pastries and fruit everyday, coffee/tea was in the room. The kitchen was great for us since we had an infant. We could walk to the San Diego Zoo, couldn't be more then 1/2 mile away. The area is across from a school however we never heard any commotion. It's a very convenient location. They have $99 rooms, and the price is right!", "Date": "April 6, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Check in / front desk": "3", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Midwest", "Title": "“great location, nice place”", "Author": "ktbradshaw88", "ReviewID": "UR14657964", "Content": "We stayed in the \"Paris in the 30's\" room for several days. Very convenient for nice walks in Balboa Park, a few blocks from a \"strip\" of restaurants, close to bus stop. Felt safe walking after dark. In-room breakfast was a nice touch, although the \"boxed pastry-and fruit\" was nothing to rave about. Room was well-laid-out and private - - nice having a fridge and microwave. As others mentioned, there was a very odd, unpleasant smell in the room (not quite musty, but couldn't identify). My only other complaint was that one of the manager-types at the front desk used crass, disparaging language directed at the housekeeping staff within my presence. Rather unprofessional. Otherwise, the staff was very helpful in making recommendations for location shops, bus lines, etc. Easy to get on and off the freeway, but parking may be tight, depending on the time of day.", "Date": "March 30, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "3", "Check in / front desk": "3", "Overall": "4.0", "Value": "4", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Dusseldorf, Germany", "Title": "“The small things made the difference...”", "Author": "cjmehlauge", "ReviewID": "UR14528055", "Content": "We´ve been there for two nights and it was worth every dollar. The City-Lights-Room was not so big, but very clean and really cozy. The Room was equipped with a microwave, a kettle, a fridge and a small TV. What made this B&B so special and lovely were little things like the milk-pyramide (see picture) or the way they fold the towels. They also tidied up the bathroom and put our stuff (thoothbrushes and toothpaste) in the mirror-cabinet. The thing was that we haven´t noticed this special mirror-cabinet yet and the service-personal was so smart to let the door of the mirror-cabinet a little bit open, so we could mention it. Every morning was a daily newspaper at the door. (This is also a special service) The B&B had also a big, beautiful courtyard and a huge sun-terrace where you could eat your breakfast or relax if you want. Very nice!! The breakfast was ok, but nothing special (this is the only thing we were a little disappointed about.) If the stuff would provide a fresh cooked breakfast, than this B&B could be excellent!", "Date": "March 25, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Pittsford, New York", "Title": "“Loved the themed room”", "Author": "redsparkle010", "ReviewID": "UR14336210", "Content": "We have just returned from 4 nights at the Balboa Park Inn. We loved the originality of the room, we stayed in the Aruba room, and the fish and colour scheme really made it seem like we were in our own tropical paradise. We paid $99 per night (plus tax) whihc was superb value for money - we even had a jacuzzi in the bathroom! We loved the fact that breakfast was brought to your room as and when you wanted it. The zoo is walkable from the hotel which is great as are the attractions of Balboa Park. The staff were excellent and provided super directions when we asked.", "Date": "March 17, 2008"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Seattle", "Title": "“Great location for a nice walk”", "Author": "thai2007", "ReviewID": "UR14243846", "Content": "Selected Balboa Park Inn based on Trip Advisor reviews, and was certainly pleased. My favorite feature was its location relative to amenities, safe and convenient for a walk into the park, of course, but I (single female) also felt very safe walking in the residential neighborhoods at dusk and early a.m., with great interest in looking at homes and daydreaming about living in a San Diego bungalow. We took a cab downtown to Gaslight for $10 each way, but didn't do enough research to find that it is not served by the fantastic Trolley line which we used to explore the rest of the city. Ronnie in the office was helpful in pointing out options for walking, bus, or cabs to get around.", "Date": "March 12, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "4", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Bishop, California", "Title": "“Wonderful Stay”", "Author": "elwood9", "ReviewID": "UR14003220", "Content": "We stayed at the Balboa Park Inn with 2 young children. The \"continental\" breakfasts pushed the definition of continental breakfast, with a wonderful selection of pastries and fruit. We stayed in the California Suite. We had a living space and a kitchen dining space, that were separated by a narrow hall, with a very small bedroom off the hall. We were able to set up the kids in the dining area at night (a bench seating/bed worked perfectly for the 3 year old, while the 1 year old was in a pack-n-play. This let us stay up and watch a little TV at night. We really enjoyed this hotel. The proximity to the zoo and other park amenities was incredible. And the staff made us feel very welcome and comfortable. Would highly recommend to anyone. This suite would be good for a couple, or a couple with small children. With older children one should definitely consider one of the larger suites.", "Date": "March 3, 2008"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Portland, Oregon", "Title": "“Old School, but Charming”", "Author": "BackpackGirl", "ReviewID": "UR13918827", "Content": "I stayed at the Balboa Park Inn for a week during the wildfires in SD this fall, and they were super-concerned about my health and safety given all the bad stuff floating around the air. They purified the room everyday and kept the windows shut. The staff were very courteous and I didn't find parking to be a big problem. The breakfast delivery was nice - but I wished it were a heartier meal. It felt a bit uninspired - fruit and a danish. I could buy that at Starbucks! The bed was comfortable and while the building was old, it was clean. That's always important to me. While it wasn't a stellar inn, I found it's ambience perfectly charming, and very SoCal.", "Date": "February 28, 2008"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "British Columbia", "Title": "“Expect the unexpected!”", "Author": "harshar", "ReviewID": "UR13791863", "Content": "We arrived back from our cruise and were able to leave our luggage at the Balboa Park Inn as it was still morning and we were told that as soon as the present occupants checked out they would clean the room, move our luggage in and then we could check in. My wife has scent allergies (this place is non smoking) and we had requested that no scents be used in the room and not only did they do that but they had an air purifer running in the room as well. The accomodation was great and the nights sleep wonderful, best mattress ever. The fresh fruit, cereal and warmed bakery items were just what we needed to start our day of site seeing. The coffee was excellent and the juice also. The staff are pleasant and helpful. The Balboa Park Inn is quiet and is situated on a bus route for those without a car. It is within walking distance to Balboa Park and its many attractions. We would staf at the Balboa Park Inn is a heart beat next time and highly reccommend it to our friends. Harry & haron", "Date": "February 23, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Business service (e.g., internet access)": "3", "Check in / front desk": "4", "Overall": "4.0", "Value": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Edmonton, Canada", "Title": "“Our Honeymoon at Balboa Park”", "Author": "theryguy23", "ReviewID": "UR13736752", "Content": "My wife and I were looking for a romantic, well-located and well-priced hotel to spend our honeymoon in San Diego. We found everything we were looking for at the Balboa Park Inn. Breakfast was a great way to start our days. I really liked how they delivered it up to the rooms. We stayed five nights in the City Lights room and 3 in the beach house. Though the city lights room was nice (clean, but a little old), the beach house was definitely the best part of our stay. Our only annoyance for our stay would have to be the constant phone calls we got from the front desk in the morning asking when the maids could come in. One day it was three calls in a couple hours... on our honeymoon. Besides that we were thrilled with the hotel and would come back in a second!", "Date": "February 21, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Virginia", "Title": "“Funky Charm”", "Author": "free2read", "ReviewID": "UR13050689", "Content": "With a funky, eccentric 1930s boarding house feel that's definitely not for the Marriot Rewards set, the Balboa Inn is a perfect blend of kitsch and comfort. Our room, Paris in the '30s, had a canopy bed, an old-fashioned chaise lounge, and an ornate Victorian fireplace mantle -- complete with fake electric fire. Think elegant AND tacky. It was also very private, very quiet, and the bed was incredibly comfortable. Who could want more?! We found it a delightful change from the bland cookie cutter rooms found in your standard hotel chain. The location is perfect; it's tucked into a quiet residental neighborhood with very lttle traffic (we slept with the windows open and didn't hear a sound) that's a short walk to the SD Zoo. It's also a great walking and jogging area. The staff is very friendly and accommodating, the continental breakfast is more than adequate, and our only complaint was that on the street parking can be tight. An earlier reviewer complained of the musty smell that we have found in many older hotels -- we always carry an aromatic candle with us. That and an open window will quickly clear the air and add a little romantic atmsophere. Restaurants are scarce in the immediate neighborhood, but the Cafe on Park is about a mile up the street . It serves an awesome breakfast with pizza sized pancakes that are locally famous. There is also a Farmers Market grocery where you can pick up fresh fruit, sandwiches, drinks and any other items you want to keep in the in-room frig. Dinner restaurants will require a trek. Ask at the front desk for recommendtions and directions. The Balboa Park Inn has become our new San Diego home away from home. We will be back", "Date": "January 27, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "4", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Harleysville, Pennsylvania", "Title": "“Loved this Great Little Inn”", "Author": "Thelrose", "ReviewID": "UR11060986", "Content": "I booked this Inn for our Thanksgiving stay with family in San Diego. We were int he Victoria's Secret room and absolutley loved it. The bed was extremely comfortable with a nice reading lamp for each side of the bed. There was a beautiful chaise lounge that also had a nice lamp. The owners think of everything here. Towels were plentiful and there was a mini frig, microwave and all the necessary items for coffee, tea, hot chocolate, etc. We were impressed with the amount of food for breakfast - huge amount of pastries and fruit. The 2nd day we cut back on the pastries and got one cereal and still couldn't finish everything. The location here is great. Walk to zoo and museums in Balboa Park. Bus stop is on the corner and a short walk to University Ave for restaurants and stores. We asked the hotel to recommend a restaurant for us right after our arrival and he recommeded Cafe Eleven. It was such a good meal that we went back the night before we left. For the price, you can't beat this place.", "Date": "November 25, 2007"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Check in / front desk": "4", "Overall": "3.0", "Value": "4", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Queanbeyan", "Title": "“A little old but O.K”", "Author": "DoggiesFan", "ReviewID": "UR11054915", "Content": "We did like Balboa Park Inn, but found it a tight squeeze for 5 people in Emma's Diary. The rooms were showing their age but were always kept clean by the friendly staff. We liked being in the burbs and only a short walk to the zoo (a must), public transport and University Avenue for restaurants and groceries (go to Ralph's for good grocery prices and selection and make sure you join the Ralph's club which doesn't cost anything but saves you heaps!). The sun roof Garden area was an added bonus which provided relief from the compact accommodation. It was also handy having breakfast delivered which was usually enough to get you started on your day (just cereal & fruit or pastries & fruit), but not being able to get it until 7.30am meant it was too late for us on occasions.", "Date": "November 25, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "California", "Title": "“Left Bank without the flight time....”", "Author": "murphysmum", "ReviewID": "UR10953601", "Content": "GREAT HOTEL....I didn't take a lot of time selecting this hotel; it was only for one night and I simply wanted something after an event in Balboa Park...close to the Park....to avoid a two hour trip home. I haven't found a hotel room for $99 in several years so I was expecting \"very average\". What a pleasant surprise! The hotel room reminded me of what you WISH you'd find on the Left Bank in Paris, only this one was perfect! It wasn't huge, but comfortably held a queen size canopy bed with white lace topper (very comfortable), a huge chaise lounge (to die for), some decorative pieces and a built in holding a small refrigerator with a microwave and coffee maker on top. The room was well supplied with up do date travel brochures and information on local restaurants. Great ambiance and charm. Predominate dark green, brown and white make the room cheerful and bright and extremely inviting. I appreciated the lighting, often a neglected item. This room contained a floor lamp, a wonderful reading lamp next to the chaise and two bedside wall lamps with decorative shades. The room wasn't fancy...no marble tubs... but I give it 10+ for the charm, cleanliness and comfort factors. Staff were very nice when I made the reservation, explaining the different rooms, pros and cons. When we were arrived everything was in order; I was asked if I needed a hairdryer, iron or anything and they were brought to our room immediately. Breakfast was simple but plentiful...fresh fruit, juice, cereal, assorted muffins and pastries...excellent hot tea and coffee. We simply called and it was brought to our room within five minutes. We additional had the choice of eating in the lovely courtyard, but I really didn't want to leave the room. Since I live only two hours north, I stay in San Diego several times a year for various reasons. I have always stayed downtown so that I could have a view of the water. Having stayed at the Balboa Park Inn, I'll be forgoing the water view for this cozy get away. For those who don't know San Diego well, this is an excellent location if you have access to a car. Parking is free on the street. You can walk across the street to the zoo if you're with kids...or if you're a big kid. You have easy access to the marvelous museums in Balboa Park, as well as being conveniently located to anywhere else you'd want to go in San Diego. The price for value is amazing; it's a great place for a family to stay. Warning: If you like chain, cookie cutter hotels, this is not the place for you. If you like uniqueness, warmth and charm...I'd go back in a heartbeat...and will. Enjoy your travels!", "Date": "November 21, 2007"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "London", "Title": "“Excellent!”", "Author": "SR73", "ReviewID": "UR10320047", "Content": "I'm usually more of a hotel fan but after reading about the Balboa Park Inn on this site, we decided to give it a go. I'm so glad we did! Friendly staff, comfortable room and breakfast brought to your room each morning. It's on the doorstep of the restaurants & bars of Hillcrest and is 5 mins by bus or car from downtown. It was a perfect base for us as we decided to travel around quite a bit. There is street parking but read the signs carefully - road sweeping means that on some days you must move your car by 10am or face a ticket (guess what I ended up with?!) Despite the $40 penalty - we had a great stay. The Balboa Park Inn isn't going to win any design or decor awards but it's warm, friendly and with your own fron door - incredibly private.", "Date": "October 25, 2007"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Business service (e.g., internet access)": "3", "Check in / front desk": "4", "Overall": "2.0", "Value": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "San Diego", "Title": "“Good location, but tacky rooms and no parking”", "Author": "married_traveler_31", "ReviewID": "UR10302435", "Content": "My husband and I stayed here partly because of the great reviews on TripAdvisor. Our friends also stayed here too and between us, we saw three different rooms at this location. I am embarrassed to have recommended this place to our friends and feel compelled to write a more realistic review to save future travelers. Here is my take on the following: LOCATION- very good especially if you want easy access to the zoo and other downtown attractions. But note, they don’t have a parking lot so be prepared to be circling around the block to look for street parking. ROOMS and VALUE - depends on the room. Pay attention on which one you get because some of the décor is downright tacky. And all rooms are very old. The Monet’s room is decent and clean and for $149 per night is a good value. The Greystoke room is good for those that want that “zoo” feeling but for $219 per night isn‘t worth it unless you love, love, love, stuffed lions! And the Greystoke room is awful, do not pick this room, it is super tacky with a mix match of repainted furniture and odd scary looking fake plants. Service - Not sure because we hardly had any interface with the front desk folks. They seem nice enough. Breakfast - It’s just pastries and juice, not much to comment on. In summary, this is a harsh review but only because I am baffled at why it is rated so high by other travelers. I would rank this way lower than it’s current spot on the top ten San Diego Hotel list.", "Date": "October 24, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "spokane, wa", "Title": "“Truly amazing!”", "Author": "disneyorbust", "ReviewID": "UR10116181", "Content": "I took my 13 year old daughter to San Diego for the weekend to celebrate her birthday, and spent 2 wonderful nights here. I had read previous good reviews, but my main motivation in staying here was the closeness to the zoo...NOT the good reviews. From the moment we stepped into the lobby, I was in awe...it looked like someone's living room...not a cold, hotel front desk. We were welcomed by Bobby, who made us feel like relatives. He took us to our room, \"Victoria's Secret\", and it was like spending the night at grama's house. It was cozy and comfortable, and did NOT in any way, shape or form look ANYTHING like a hotel room. I have never before slept soundly in a hotel, but I tell ya...I slept like a baby here. In the morning, the newspaper was slid under our door. We called down for breakfast, and it was delivered to our room within 10 minutes. There was so much food that we put some away in the fridge to snack on later. We were given melon, apples, oranges, warm cinnamon rolls, mini muffins, croissants with butter and jam, cereal and orange juice. The zoo and Balboa Park were a mere 5 minute walk away. We grabbed a burger at the zoo at closing and brought it back to the Inn where we sat in the courtyard and ate. Other guests were there, and again it was like hanging out with family...sipping wine and talking about our adventures. The staff is so friendly and helpful and accommodating, that you really hate to leave. I may have chosen the Balboa Park Inn because of the zoo, but I will stay there again because we love it.", "Date": "October 18, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "4", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Los Angeles, California", "Title": "“Jungle Love”", "Author": "spycygrl", "ReviewID": "UR10086705", "Content": "My boyfriend and I stayed here last month for a little romantic weekend getaway from Los Angeles. Boyfriend's friends live literally 2 blocks away, so the location was key not only to hanging out with them, but also to the SD Zoo. We chose the Jungle Nook (after viewing all the pix of the rooms online) since we are both silly monkeys. The room faced the courtyard and was EXTREMELY quiet. A little overwhelming with all the \"jungley\" touches, but pretty hilarious. There is a plaster elephant head over the bed and a full-size bronze chimp in the bathroom! And, yes, a real Brass Monkey swinging near the shower. The jacuzzi tub (which we now call the \"junguzzi\") was heavenly and we partook of it all weekend. The double-shower is also fantastic since you don't waste time getting ready (everyone can shower at once!). Bed was very comfy and there was a selection of different pillows (very smushy to firm). The continental breakfast is brought to your room upon a quick phone call to the desk and was an entire TRAY of muffins, croissants and cinnamon rolls along with fresh melon and orange juice. The room has a mini fridge and a coffee maker with all the good condiments. The zoo is only about a 10 minute walk and there are excellent bars, restaurants and shopping within a brisk walk (or short drive). The neighborhood is cute and pleasant. We loved our little weekend getaway. It helped us fall in love.", "Date": "October 16, 2007"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Check in / front desk": "3", "Overall": "4.0", "Value": "3", "Rooms": "2", "Location": "3"}, "AuthorLocation": "england", "Title": "“not as quirky as i thought it would be”", "Author": "dundeetripper", "ReviewID": "UR10041946", "Content": "We stayed here for 4 nights early last month, based solely on trip advisor reviews, i feel a little bit disgruntled. From the hotel website i thught our room was going to be really quirky but disappointingly it was just a bit old fashioned. Clean but old fashioned. We did have a seperate kitchen, bedroom and living room which was really handy when we put our son to sleep and then we could just chill out with a bottle of wine in the living room. The breakfast is nothing to write home about, and was a couple of pieces of fruit, some oj and some microwaved danish pastries ( never had hot danish before ) obviously brought straight out of the freezer and defrosted ?. Any way its a short walk to balboa park and the zoo about 5-10 mins. The staff were helpful but we didn't really see them much. The only main problem was that the tv didn't work throughout our stay, when we rang down they stated it was a problem with their cable service. i don't know if this was true or not. The pictures of the decking looks really nice but most of these flowers are plastic ?. All in all i can't really see why this is so high in trip advisors list.", "Date": "October 5, 2007"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Chester, Connecticut", "Title": "“Good Deal for the Money”", "Author": "ssnamurray", "ReviewID": "UR10015838", "Content": "I found the Balboa Park Inn online while trying to find a place to stay near the San Diego Zoo. Success - it's an easy ten-minute walk to the entrance. The building itself dates from around 1915, and the decor is eccentric. Outside and throughout the courtyard and decks there's a combination of plastic flowers and genuinely nice specimen plants. Decor is tacky but frivolous enough to make one smile. I stayed in the \"Aruba Room,\" VERY private and quiet. $99 got me a private room with a large bath with Jacuzzi tub (great for tired feet after the Zoo!). When I called to request breakfast I was asked whether I preferred pastries and fruit, or cereal and fruit: I selected pastries and got a tray loaded with an orange, apple and watermelon slices, cheese danish, mini muffin, croissant AND fruit bread! I'd stay here again without hesitation.", "Date": "September 28, 2007"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Business service (e.g., internet access)": "3", "Check in / front desk": "5", "Overall": "4.0", "Value": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Baltimore, MD", "Title": "“Easy access, nice rooms, decent rates”", "Author": "Professor_PuttsALot", "ReviewID": "UR8865850", "Content": "We stayed in the $179 Beach House room for two nights and were very happy. The room is large, with a soft bed and a spacious bathroom. The staff was friendly. Not sure if it belonged to the hotel, but we were able to pick up a strong WiFi signal from the SkyRiver network. We returned to our room late both nights but were able to find parking one block over from the hotel.", "Date": "September 23, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "3", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Austin, TX", "Title": "“Great place for a Honeymoon!”", "Author": "djbnews", "ReviewID": "UR8538055", "Content": "We stayed at the Balboa Park Inn for our Honeymoon at the end of May, and we found it charming with a friendly staff and a *fantastic* location. We stayed in the Paris in the 30s room, which was cozy and quiet. The breakfasts are delivered to the room (basically, sweet rolls, juice and fruit). We were able to walk to the zoo and the front desk was able to make several recommendations for dinner. We arrived very early (10 a.m.) and very, very tired on the first day, and the staff was willing to send an extra cleaning person to our room right then so that we could check into our room early (it took about 20 minutes). We would definitely stay there again!", "Date": "August 29, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Orange County, CA", "Title": "“A Gem in San Diego”", "Author": "Traveler", "ReviewID": "UR8405974", "Content": "Stayed here one night based on Trip Advisor reviews. Great residential-area location -- right next to zoo and Balboa Park, close to Hillcrest for shops and restaurants, free street parking. At $99 + tax for City Lights suite it was quite a buy -- bedroom, living room with excellent TV, full kitchen, smallish bathroom. Furniture from 1950-60 but clean and in excellent condition. Nice continental breakfast we ate outside -- fresh fruit, sweet rolls, juice, coffee, cereal. I'd stay here again.", "Date": "August 13, 2007"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Check in / front desk": "4", "Overall": "4.0", "Value": "4", "Rooms": "3", "Location": "4"}, "AuthorLocation": "New Jersey", "Title": "“It worked for us!”", "Author": "DoctorGNewJersey", "ReviewID": "UR8235422", "Content": "Stayed in the Mayfair room recently. The rooms were very clean and it was like having our own small apt. A short walk to the zoo. Food is close by. The whole place is really not a true hotel but rather like your grandmothers well-kept, but old apartment with all it's quirky furniture and decor collected over a lifetime. Everything is old but well maintained and perfectly functional. The breakfasts are cut up fresh fruit along with generic grocery store danish/pastries warmed up in a microwave. But it does the trick and saves the hastle of going out for breakfast. If you can get over the fact that this is not a cookie cutter hotel you will enjoy the uniqueness (and value) of the experience.", "Date": "July 25, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Tucson", "Title": "“Better every time”", "Author": "mjarizona", "ReviewID": "UR8108245", "Content": "This was our third visit to BPI and it gets better every time. Just wanted to give a little update to previous visitors' posts. The property now has Wi-Fi throughout as they installed multiple antennas around the property in June. We had no problem with access both in our unit and in the courtyard. The breakfasts have also improved since our last visit. No more fruit cocktail. Each morning included fesh cut seedless watermelon along with oranges and apples or stawberries and grapes. The pasteries and cereal are the same, but unless you are looking for the ultimate B&B breakfast, theirs is more than acceptable. We are looking forward to our next trip to San Diego and BPI.", "Date": "July 12, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "3"}, "AuthorLocation": "Athens, Alabama", "Title": "“Great Place”", "Author": "shellito1012", "ReviewID": "UR8078705", "Content": "My husband and I just enjoyed two nights in the beach house (room)...July 6th and 7th. I really liked the place and would definately stay there again and recommend this place to my friends and family. I had family visiting me there and they were staying in Old Town...they wished they had booked where we were simply because of how comfortable the bed was! I was exhausted when we arrived at the Balboa Park Inn and when I layed on the bed I thought I was in heaven. I love a good bed and they have it. We had a jacuzi in our room and that was very nice. We loved the track lighting, the bistro table, the couch, the lite palm tree. The air conditioning was a window unit but kept the room chilly...just the way we prefer it. The breakfast was small but adequate...if staying again I would probably skip it and go out for breakfast, but that is because I love to eat breakfast out. The place is within walking distance to the zoo - which is a must if you have never been. I had no moldy or old smells in my room as a previous poster had. Enjoy your stay here!", "Date": "July 8, 2007"}, {"Ratings": {"Cleanliness": "5", "Business service (e.g., internet access)": "3", "Overall": "5.0", "Rooms": "4", "Service": "4"}, "AuthorLocation": "Florida", "Title": "“Quirky Balboa Park Inn”", "Author": "stevenbFlorida", "ReviewID": "UR7844679", "Content": "We stayed at the Balboa Park Inn for 7 nights this June. BPI is an excellent value for expensive San Diego. We typically stay at more upscale boutique hotels but decided on this place to save a bit. We were pleasantly surprised. The cleaning staff at the BPI keep this place spic and span. The courtyard areas are spotless, our room was kept spotless too. If I owned a hotel I would want that hard working staff to work at my place. Our suite (Southwest suites) was pretty spacious, small kitchen, comfortable bed, private patio. I never slept so well at a hotel. The overall look of the room/buildings are older and probably could use an update but not too shabby. I felt comfortable as the place is quiet and is nice to come back from a busy day to a quiet place. The fake flowers around are not my style but the real flowers and bushes are so nice. BPI is a few blocks drive to University Ave with has a ton of restaurants. You must must try breakfast at Hash House a go go in Hillcrest. I have never had such a huge and amazing/inventive breakfast. The place itself is an experience. Lei Lounge in University Heights is a must for a late tapas dinner. Very south beach like. If you normally stay at the ritz carlton, then you may not like it but otherwise I think this place was great. steve and jeff", "Date": "June 13, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "3", "Check in / front desk": "5", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "stockport", "Title": "“nice time at balboa”", "Author": "lizandnorm", "ReviewID": "UR7803011", "Content": "nice place,good for zoo and sites in park,plenty going on at weekends in the park. check out the car show on a saturday near to the Air and space museum Good bus service to take you downtown.Lots of resturants with in short walking distance.The hotel is very clean and tidy,housekeeping second to none,staff will give you adivce of what's going on near by.Nice gardens and patios to enjoy your breakfast or in the evening order yourself a pizza and a bottle of wine from 1 of the many takeaways that will deliver to the hotel reception ,When downtown I recomend the Fish Market Resturaunt next to the midway for an excellent meal", "Date": "June 7, 2007"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Business service (e.g., internet access)": "3", "Check in / front desk": "5", "Overall": "4.0", "Value": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "takeley", "Title": "“Recommended !”", "Author": "honeybunnyTakeley", "ReviewID": "UR7728873", "Content": "We stayed here towards the end of May, rooms eccentric but clean and cosy. Staff very helpful, the only downside was the problems parking when we returned after the baseball night games. Having said that there was always somewhere to be found, even if it was a bit further than we would have liked. Location great for the park and a very nice neighbourhood.", "Date": "June 1, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "2", "Check in / front desk": "5", "Overall": "5.0", "Value": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "alberta canada", "Title": "“know what you're looking for”", "Author": "pat2", "ReviewID": "UR7704926", "Content": "If you want sanitised luxury stay at the Marriott. On the other hand if you want a small older place with character, quirky and spacious themed rooms, floors a bit creaky, pretty courtyards, then this place is great. We had five days here in May. The hotel is on the north edge of Balboa Park so you're not downtown and the walk to the zoo entrance is 10 minutes and the museums another 5. The restaurants in Hillcrest are a 5 minute drive or an ok 30 minute walk away. Our room was spotless, continental breakfast delivered to the room was fine, service was good, staff were helpful, cabs came within a couple of minutes of us asking front desk($15 airport, $12 downtown). Its a great place if this is what you are looking for.", "Date": "May 27, 2007"}, {"Ratings": {"Service": "4", "Cleanliness": "2", "Business service (e.g., internet access)": "2", "Check in / front desk": "4", "Overall": "1.0", "Value": "1", "Rooms": "1", "Location": "5"}, "AuthorLocation": "Columbus, Ohio", "Title": "“Moldy Manor”", "Author": "OhioBuckeyeBOY", "ReviewID": "UR7670828", "Content": "Greatly overrated, in my view. Front desk and support staff were great and the location is wonderful, but the facility is old and objectionable. I stayed here twice (frequent business traveler to San Diego) to be fair to the facility. On the first visit, there was a strong offensive musty odor in my quarters. Because I used it only as a sleeping room, I remained for several days. On arriving home, I discovered that all my clothing and luggage smelled moldy. Further, there are many electrical safety issues (I'm a firefighter). Code-violating extension cords under carpets, jury-rigged wiring tucked inappropriately behind moldings, electrical wiring run into walls without conduit, overloaded receptacles, all contributed to give me the heebie-jeebies regarding my safety while there. On my second stay, I found the same kitschy decor which has bothered some other reviewers, but I also found yet another unit with a strong objectionble odor of mold. This unit had evidence of water intrusion from leaks in roof (it's a flat roof with parapet walls, about one hundred years old, so no surprise). When I complained about the odor, the desk clerk acknowledged that they receive many complaints on this from throughout the buildings comprising the Inn. The owner was tight-lipped and not happy, but agreed fairly quickly to refund my prepaid lodging charges for what was to have been a five-day visit. I simply cannot recommend this lodging to anyone, but especially for those with allergies to mold or chronic respiratory diseases, this will be a nightmare.", "Date": "May 22, 2007"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Northampton", "Title": "“Good price and location”", "Author": "Sam39", "ReviewID": "UR7624568", "Content": "We stayed for 3 nights at the end April 07 (booked direct with the hotel). These individually decorated suites are situated on the intersection of Park Boulevard and Upas Street. There are several seperate buildings contanining a few suites however each block had an access door that was locked. We had the Monet room which was in a block about 100 yards or so from reception. The suite we had was very spacious, with a bedroom, bathroom, kitchenette (including fridge, microwave, coffee maker and grill) and living room area (with big sofa and small tv). All the rooms in our suite were clean and well presented, the TV in the living area was smaller than the one in the bedroom, but there was a nice fireplace with an electric fire (not really a fire as in it didn't give out heat) which crackled nicely and lit up. The Monet has a balcony from the kitchen door that is shared with another unit. Our suite was on the first floor, up a fairly steep flight of stairs, and carrying heavy cases could be difficult for less able people. Parking was on the street, and we never had a problem finding a spot close to the hotel. During our stay the hotel was not full, and it was in a residential area with a school opposite so maybe parking could be more difficult at busier times. Breakfast was delivered to the room, you just had to ring down when you wanted it and it was there a few minutes later. The choice was pastries or cereals with fruit juice and a bowl of fruit, it was an adequate start to the day. The location was excellent, an easy 10 minutes stroll to the zoo. We drove to Fashion Valley Mall at Friars Road (about 10 minutes) to catch the trolley into the city, which was a better option for us than driving into downtown. Check in was very friendly and the staff very helpful and informative. There were restaurant on 'University Avenue’ however we had our meals in downtown and at the Fashion Valley mall where there were a few restaurants (including the Cheesecake Factory, Crocodile Cafe and PF Chang) along with lots of shops. There were menus in the hotel room for restaurants that delivered to the area which was a good idea. We did as other reviwers have metioned notice a smell of cleaning products when we entered the room however it did not bother us. The shower did have to be left running for ages to heat up however it eventually. We would stay again if we were in the area as it was clean, quiet and comfortable.", "Date": "May 15, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "4", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Escondido", "Title": "“Quaint, Charming, Comfortable, Welcoming”", "Author": "socalibnblover", "ReviewID": "UR7565860", "Content": "I loved my stay at the Balboa Park Inn. I have stayed here numerous times. My favorite room is the Beach House but it was not available so I stayed in one of the Jr. Suites. The bed was extremely comfortable and the bedding was very soft and obviously high quality. I found my room to be spacious and well decorated. I love that all the rooms are different which is a nice change from the chain hotels. I was speaking with some of the staff who are very friendly and informative and found out some of the quirky history behind the inn and that a lot of the decor in the rooms come from the owners personal collection. I do not agree with other reviews when comparing the Balboa Park Inn to a Hyatt or Marriott ( which by the way i have stayed at frequently also and had rooms that were less than perfect). The Balboa Park Inn is a special place in the heart of San Diego that is truly a rare gem. If you are a B & B lover or want a place that is different and away from all the same standard rooms, The Balboa Park Inn is the place to stay. They serve breakfast to your room which is not exactly gourmet but it is good and filling. They will brew coffee or boil water for you for tea if you ask even though you can do it yourself in your room. They have all the basic nessessities one may need such as hair dryers, irons and toiletries. Oh and as far as the Sign that says there may be cancer causing materials on the property, If you have gone to a lot of public places or old buildings with wonderful old architecure anyone would notice that same sign posted elsewhere. As far as the price goes my suite was about $153 a night and i think it is a great value. I called a few places in downtown San Diego and all the rooms were close to $200 or more a night for a standard room. I can't imagine what those places will charge for a room this summer . In short, I found my stay once again very comfortable, clean and best of all relaxing. I would recommend this place to everyone from singles to newlyweds to families. In fact I made a reservation for my mother and her husband for their anniversary coming up.", "Date": "May 8, 2007"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Business service (e.g., internet access)": "3", "Check in / front desk": "4", "Overall": "2.0", "Value": "3", "Rooms": "2", "Location": "5"}, "AuthorLocation": "Orlando, Florida", "Title": "“Great Location & Service, Bad Dwelling”", "Author": "jaredavd", "ReviewID": "UR7564505", "Content": "I only stayed for one night while visiting the zoo with my wife's family and it was right down the road from the zoo. The park was literally right across the street, so that was great too, and it was far enough away from the beach and downtown to avoid horrible parking and most undesirable people. There were a couple of shoeless hippies wandering around with walking sticks outside the inn in the morning. The staff was friendly and brought us an iron and ironing board with a tasty pastry and fruit breakfast in the morning. They let us check in a little early as well, which was very nice of them. I had the same problem as a previous reviewer-- the heat was on full blast when we first arrived. That wasn't too difficult to take care of, though. The buildings seem like very old apartments. All the floors creak and I can imagine that anyone staying below us would have heard every step we took on those old floors. The paint was peeling, the carpet seemed very old. It wasn't a bad place, just old and probably shouldn't be ranked #3. If you need to be close to the zoo and are only planning on doing the zoo and the museum, then this is a fair place. If you want to see any of the rest of san diego or socal, get something a little nicer.", "Date": "May 8, 2007"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Check in / front desk": "2", "Overall": "3.0", "Value": "3", "Rooms": "2", "Location": "4"}, "AuthorLocation": "Minneapolis, MN", "Title": "“Monet room, not the best”", "Author": "Willie123", "ReviewID": "UR7539265", "Content": "We stayed in the Monet room for 3 nights. Upon checking in, we went up to our room. The heat was blasting and the suite must have been about 95 degrees. The staff person with us commented how hot, but did nothing to fix the problem. We later figured out the air conditioning unit was set to the hottest temp, but it would have been nice if the staff person would have helped us with this issue. Great location. Large suites, but the TV in the living room is about 13 inches tall. The shower also didn't always have hot water. Very iffy if wanting to take a shower in the afternoon. Decor is a bit tacky. I wouldn't choose to stay here if visiting San Diego again.", "Date": "May 2, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "East Longmeadow, MA", "Title": "“Great place!!!”", "Author": "MikeCav", "ReviewID": "UR7492309", "Content": "I was a fan of this place even before we arrived in San Diego from the east coast. Because of a flight cancellation on Saturday 4/14, the earliest flight the airline could book my family of four on was Tuesday 4/17. My 3 and 5 year old were dissapointed to say the least (my wife and I were'nt to happy either!). After spending hours trying to get a better flight, I finally gave up with American Airlines. Early Saturday morning I called and asked the folks at Balboa Park Inn if they would be kind enough to let us cancel the first 3 nights of our 4 night stay (spent the rest of the trip in Anaheim) - something they didn't have to do based on their cancellation policy. They understood and let us cancel. Although I was unhappy with the airlines, it was a little easier to swallow knowing that the Inn was flexable. We booked the Mayfair Suite - upon arriving late on Tuesday night we were extremely please with the room/suite. The place is huge! It felt like a home away from home, and we all slept like babies.... The next morning is when he had some time to really check the place out. As my son, daughter and I were exploring the welcoming courtyard - warm partries, fruit and juice were delived to our room to my wifes delight. The food was more than enough for my family of 4, and delicious! Unfortunatelly because our trip was cut short, we had to check out that morning and drive up to Anaheim for the Disney parks (after spending the day at the zoo). The Inn's location is easy to find and just a short walk to the zoo and Balboa park. We were dissapointed that we only had a chance to stay 1 night in such a wonderful place. Balbo Park Inn can count on us as being guests again in the future! - The Cavanaugh's", "Date": "May 1, 2007"}, {"Ratings": {"Service": "1", "Cleanliness": "2", "Business service (e.g., internet access)": "1", "Check in / front desk": "3", "Overall": "1.0", "Value": "1", "Rooms": "1", "Location": "2"}, "AuthorLocation": "Alabama", "Title": "“#2?????????”", "Author": "aeroc33", "ReviewID": "UR7432826", "Content": "If you plan on taking a vacation in San Diego please avoid the Balboa Park Inn at all costs. While the people that run the place seem like nice folks, the inn just does not cut it. I agree with all of the points made by alliefromlongbeach and will add that the wireless internet is crap. We actually left after our first night. If we would have not been able to leave I was about to begin a series of \"honeymooners held hostage\" updates on tripadvisor. If the manger/owner reads tripadvisor I would like to let him know that we did not appreciate him waiting until the next morning to decide whether or not to let us have our money back for the rest of the stay .This created an extremely restless night for us. Very dissapointing.", "Date": "April 25, 2007"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Check in / front desk": "4", "Overall": "4.0", "Value": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "New Jersey", "Title": "“Spacious and convenient!”", "Author": "NJvacation", "ReviewID": "UR7415326", "Content": "My family of four stayed at the Balboa Park Inn for a few days vacation in San Diego. We booked this place because of the wonderful reviews it recieved from tripadvisor - the reviewers were correct! This is a very good value! Large spacious rooms - nicely decorated and very clean. Wonderful location - we walked to the Zoo and were very close to Hillcrest, where we could find any kind of food imaginable! Breakfast is included but rather minimal. But this is not a major negative. In fact, the only potential negative is that the parking is on the street! We were always lucky to find parking but could imagine that this might be a problem during the more crowded summer months.", "Date": "April 22, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "3", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Sault, Michigan", "Title": "“What's another word for Charm”", "Author": "Pyronym", "ReviewID": "UR7302949", "Content": "This Inn charmed us from the first entrance to the last minute of our stay. We stayed 2 nights because of the excellent location to the Zoo but the room was so beautifully appointed, we cooked a meal and enjoyed our surroundings. The rooms were very spacious and although older, was very comfortable. The staff were extremely friendly and I felt more at ease here than anywhere else I have ever stayed. Enamor, captivate, charisma, allure all equal a great stay.", "Date": "April 9, 2007"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "Nevada", "Title": "“Great place to stay!”", "Author": "nvgirl", "ReviewID": "UR7293224", "Content": "We stayed in the Southwest suite. It was clean, quiet and a great place to stay. The grounds were spotless and the employees and front desk people were very friendly and helpful. We ordered takeout and they delivered it to the front desk. We walked to the zoo. Balboa park was beautiful and there are many museums and things for the kids to do. Parking was not a problem. It's a nice neighborhood and we enjoyed our stay.", "Date": "April 8, 2007"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Check in / front desk": "4", "Overall": "4.0", "Value": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Wisconsin", "Title": "“Location! Location! Location!”", "Author": "MiMi58", "ReviewID": "UR7178471", "Content": "We loved this hotel which is within a 10 minute walk of the zoo and Balboa Park museums. It's also located within a 10 minute walk of University Ave. which has lots of neat shops and small, locally owned restaurants. If you like staying away from the tourist area, this is your hotel. The retro decor may not be for everyone but we found it charming and cozy. Highly recommended!!", "Date": "March 17, 2007"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Business service (e.g., internet access)": "3", "Check in / front desk": "4", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Cape Coral, Florida", "Title": "“Stay in the Beach House (Room #29)”", "Author": "tropicdiver", "ReviewID": "UR6900984", "Content": "The nice stuff: I stayed here for only one nite (passing thru town) and was very pleased with our sleep over. The room was large, had a separate couch, as well as a fridge and a microwave oven. The bathroom is *huge* with a separate shower and also a very nice 5' Jacuzzi tub that is surrounded on one side by mirrors. The room was set in a beach type motif with fish hanging from the ceiling in the bathroom. The king size bed was very comfortable. The room was very clean. I had read earlier reports of water that wasn't barely warm and poor water pressure. I assure this was *not* the case in the Beach House. There was plenty of water pressure and hot water to go around. The nit picking: It rained while I was there during the nite and the a/c - heating unit is wall mounted and the water dripped dripped dripped onto the unit and made a lot of racket (I enjoy sleeping to the falling rain, but this was way too much). I would suggest they put some kind of awning above the unit, so the water would run off of it, instead of sounding like a snare drum inside the room. Parking is on the street, but that was a very minor problem for us, as we always managed to get a parking spot nearby. In closing, I would stay here, again.", "Date": "March 2, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Sydney Australia", "Title": "“charming ambience - make you feel like a local”", "Author": "iloveolives", "ReviewID": "UR6748279", "Content": "Bottom line - this is a truly delightful and comfortable apartment style bed and breakfast with all the mod cons. The location is very convenient especially if you are a first time visitor to SD as we were. The proximity to the Zoo and all the lovely museums and gardens of Balboa Park make it very attractive. Our family ( 2 adults + 2 teens) had the California Suite which is on the ground floor but extremely quiet and secure. Very comfortable queen bed, and the sofa bed was ok as well, but probably could be replaced soon.The decor is sunny and homey and really makes you feel you are at home not in a decorators showroom! Bathroom is compact but had everything. Good towels, kitchen well fitted out with full size fridge.We did all our cooking , and we enjoyed eating in the little dining area.The best place to shop for groceries is the Whole Foods store in University Ave towards Hillsborough( for overseas visitors it is a chain of upmarket organic food store with a huge cheese and wine section, fish, bread etc - fantastic). The service at the desk was friendly and v. helpful. Another good service is the housekeeping will do your laundry for a small fee ( the same as you would pay in a coin laundry for a couple of loads). Breakfast was very generous with good quality pastries, fruit and juice- unless you are v. picky you don't need to buy breakfast anywhere else. Parking was fine especially if you came back in the late afternnon. Finally I was amazed at how quiet it was. Overall very enjoyable and if you don't enjoy the big hotel scene and especially if you are visiting with a family this is the only place to stay in SD.", "Date": "February 5, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Northport, NY", "Title": "“Loved this place!”", "Author": "rosiered723", "ReviewID": "UR6570255", "Content": "My boyfriend and I went to San Diego for a romantic getaway, and loved this place! We stayed in the Monet Suite and was well worth it. It was bigger than my first apartment, they only thing it didn't have was a stove, but no need. There's a toaster oven, microwave, coffeemaker and fridge. Off the kitchen was a balcony shared with the next suite, but we didn't actually have neighbors. Our bed was super comfy, nice plush pillow top and plenty of pillows. T.V. in the bedroom and living room. The bathroom was clean, full size tub. The living room was cozy and had a faux fireplace. The t.v. in the living room actually had a dvd player in it too. The location was great. Nice and quiet at night. We walked to the park and zoo. We did take a cab one night to the Gaslamp Quarter, but it was only $8 plus tip. The very friendly staff was kind enough to call us the cab. Breakfast was delivered to our room, and was more than enough! We definitely enjoyed our stay and hope to return again soon!", "Date": "January 9, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Dublin, Ireland", "Title": "“Completely different to anywhere else!”", "Author": "carol55", "ReviewID": "UR6569360", "Content": "We chose the Balboa Park based on other trip advisors comments and I would agree with all the previous positive ones. The location is wonderful (right across the road from the Zoo) and the Inn itself is a real experience. I am so glad we did not chose anywhere else. From the moment we arrived we were made to feel valued and welcomed. The staff gave us valuable advice about what to do and not do in the short two days we had in San Diego. (Day One - we went to the Zoo across the road - and loved it. In the afternoon we went to the Wild Life park about 40 mins away - didn'd find that as enjoyable but we had a pleasant drive back taking some detours off the highway. Day Two - took the trolley tour which leaves outside the Zoo and allows you hop on and off all day - we saw loads and got a real taste of SD. My teenage boys particularly liked USS Midway - the aircraft carrier.) As to the Inn itself, our suite was extremely comfortable. We just loved the quirkiness of the place. One downside for us was that Balboa Park Inn has no wireless internet access - however! if you go up to the roof garden there is service there!! Must come from the neighbours - hope they didn't mind. Wonderful location with some great places to eat about 10 minutes walk away. Highly recommended.", "Date": "January 9, 2007"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Check in / front desk": "3", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Austin, Texas", "Title": "“Fun and funny little place”", "Author": "bevanderson98", "ReviewID": "UR6543158", "Content": "This place is really cool if you want a laid-back, kind of kitschy sort of place. We stayed for two nights in the Courtyard Suite- an odd mix of oriental and Grandma decor. But there was a jacuzzi tub and champagne bucket! which made the stay! All of their rooms are different. We wanted to try the Jungle Room but it was booked. The location is great- just a short walk to the zoo and nearby the University/Hillcrest area. We randomly went out in this area and as a straight couple in the \"gayborhood\" (as they called it), we were welcomed with open arms in the local bar. Fun place.", "Date": "January 2, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "4", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Longview, Washington", "Title": "“Your own little apartment in San Diego”", "Author": "Kitters", "ReviewID": "UR6307375", "Content": "We loved this place! We rented the Monet Suite--3 rooms done in lovely pastel colors--although the silk flower bouquets were a bit overwhelming. Kitchen includes dishes, a large refrigerator, microwave, toaster oven, coffee maker, and table/chairs. The breakfast brought to our room each morning offered enough options that we always had plenty. We walked to the zoo which is basically just across the street and around the corner. We spent a day and a half at Balboa Park and did not begin to see everything. Except for the Cafe on Park (which was closed on the day we arrived) there are no restaurants within a reasonable walking distance. However, San Diego has so many places with great restaurants like the Gaslamp Quarter and Old Town that we sampled a different spot each night.", "Date": "November 30, 2006"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "4", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Concord, CA", "Title": "“Wonderful for families!”", "Author": "christine182", "ReviewID": "UR6177489", "Content": "We loved this place and will absolutely stay here again and again! My husband, I, and our 4 and 1 yr old girls stayed two nights in the Suite Cycles suite. First, It was spotlessly clean, our number one requirement, and we weren't bothered at all by the housecleaning scent (rather assured by it, actually, but if you have allergies to scented cleaners/disinfectants, you may want to stay somewhere else). Also, the price is incredible, I really could not believe we were staying somewhere so great for so cheap. Every other decent place in town for a suite was at least $210 a night. Even though each room in the Inn was booked, it was incredibly quiet and peaceful. It was like having our own apartment, we settled right in. Our 4 yr old loved having her own fold out bed in the livingroom, and there was enough space next to it for our toddler's pack n play (we brought it with us, but the Inn offered a crib for $10 if we had needed it). The livingroom TV had lots of channels and great reception, but there is no TV in the bedroom, so if you plan to relax in that room after putting your kids to bed in the livingroom, you'll want to bring a portable DVD (that's what we did). The breakfast is delivered right to your door whenever you want it in the morning, and it was plenty of food to get us started for our day at the zoo (and for just 2 paid adults, there was plenty to share with our kids, so don't pay for an extra breakfast for little ones). People here that have complained about the quality of the breakfast fare must be very hard to please, as we found it to be perfectly fine. It isn't gourmet, just some cut fruits, juice, and store-bought pastries, but heck, it's tasty and filling and you don't have to leave your room! As everybody else has noted, the walk to the zoo is quick and it is a lovely and safe neighborhood. Both days we came back to the suite and let our kids nap, it was SO quiet, we never even heard housekeeping. Never had a problem finding parking, even though we walked to most places, so didn't have to re-park very often. In addition to the zoo, there are other family things to do within walking distance: Balboa Park museums, a carousel, train ride, and Morley Field, which has a playground and tons of running around space. Great restaurants in this area too: Cafe on Park was recommended by the Inn, and it was great, they love kids there! We also ate at the following Hillcrest restaurants, all super: Hash House a Go Go, Taste of Thai, Bacione Ristorante, and Bronx Pizza. Wow, we just could not have found a better place to stay in San Diego! Thanks to the Balboa Park Inn, we look forward to many more trips to SD in the future.", "Date": "November 26, 2006"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Fort Worth", "Title": "“Loved Balboa Park Inn!”", "Author": "legalsea", "ReviewID": "UR6122823", "Content": "We JUST returned from our stay at the Balboa Park Bed & Breakfast (the proper name). We stayed in Beach House, for $169.00 per night. We loved everything about this place. It was a 10 minute walk to the entrance to the San Diego Zoo. Quiet neighborhood. No parking (we had no car, but parking was on the surrounding streets). Our room, Beach House, is a single large room, abouit 17 feet by 10 (I did not measure). We had a small refrigerator, mircowave oven, plates and such, coffeemaker (with coffee in pods), creamers, etc. King sized bed; sitting area with couch, lounge chair, and table with couple chairs. Bath: HUGE. Large corner Jacuzzi (sic?) (big enough for two people), large walk-in shower, and simply lots of room. Utterly clean. We enjoyed buying adult beverages and heading up to the outside patio on top of our house. This top-side patio is some 50 feet long, 10-12 feet wide. 5 or 6 tables with chairs. True, no view to speak of, but a very pleasant place. Breakfast: you have the choice of warm pastries or cereal, juice, and I think coffee. Warm pastries: 8 pieces of various pastries, plus fruit bowl, and juice. Delivered to your room: all you have to do is tell them the time (I always went up front and made my request, due to my wife sleeping, but you may call the front desk). DO NOT IGNORE THE PASTRIES! Superb. We found the hosts to be very warm and willing to give any help we needed. For instance: liqour store? about a ten minute walk. So it was. Food? They have several restaurants that deliver to the hotel, but we did not use Balboa Park Inn Bed & Breakfast will be our new home in San Digeo. If you have any specific questions, email me at marylouisg@yahoo.com.", "Date": "November 13, 2006"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Business service (e.g., internet access)": "3", "Check in / front desk": "4", "Overall": "5.0", "Value": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "San Francisco", "Title": "“Fun, Unusual, and a great value!”", "Author": "jtretakoff", "ReviewID": "UR6059906", "Content": "Picture several suburban homes on a corner..then picture connecting them all, and doing them all as an Inn. Now you have the Balboa Park Inn. Each room is a masterpiece: great theme (we stayed in the Orient Express), and great amenities. The Inn is funny. The three buildings are connected by means of meandering paths and walkways, interrupted by tables and lounges. There is no main area of the Inn; it's literally three homes that have been joined together. The location can't be beat: literally across the street from Balboa Park, you can walk to the Zoo. It's a suburban neighborhood: very quiet at night, sometimes hard to park at night. I'd advise staying here when school is not in session, as the school is directly across from the Inn. The rooms are the attraction here, and they don't disappoint. Luxurious, well done. Quite a nice place to stay!", "Date": "November 5, 2006"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Check in / front desk": "4", "Overall": "5.0", "Value": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "San Diego", "Title": "“This place is absolutely charming!”", "Author": "Zxin", "ReviewID": "UR6002872", "Content": "I stumbled across this place quite by accident just surfing the web... WHAT A FIND! * Charming room (very romantic) * Bed very comfortable. * Bathroom was spotless (as was the whole room). * Jacuzzi tub was a blast. My girlfriend (who is very well traveled) just loved the room. We can't wait to come back, and visit again. The folks who run the inn are very hospitable and are just great folks all around. -Tom San Diego, California", "Date": "October 23, 2006"}, {"Ratings": {"Service": "2", "Cleanliness": "5", "Check in / front desk": "2", "Overall": "3.0", "Value": "3", "Rooms": "3", "Location": "5"}, "AuthorLocation": "los angeles", "Title": "“A little disappointing...”", "Author": "mere97", "ReviewID": "UR5965504", "Content": "Given the stellar reviews we've read on this site, my husband and I were disappointed to discover that the Balboa Park Inn was not as wonderful as we had expected. The location IS fabulous - we spent a lot of time enjoying Balboa Park, the museum, etc., but other than having a really high \"kitsch\" factor (the plastic flowers in the outdoor flower beds are really funny), the Inn itself left us wondering what the fuss is about. Our room was very neat and clean - we stayed in the Orient Express room (which is really pretty great) - it's like being inside an old Asian brothel - very low light with red and black theme. It was disappointing that the breakfast was so average - canned fruit in the fruit salad and some run-of-the-mill, store bought pastries - for the price ($175 per night), I guess we thought there might be more effort put into breakfast. Even offering yogurt would take it up a notch. Finally, while everyone we met on the staff was very friendly, we were extremely disappointed to find that when we asked for local directions at the front desk, neither woman working there could help us. One said \"Oh, I don't live around here\" and the other just said \"I have no idea\". It seems to me that part of offering excellent service should include a staff that is at least familiar with the surrounding area...so, all in all, we thought it was just O.K. As much as we appreciate a funky, kitschy vibe, we wouldn't stay here again.", "Date": "October 17, 2006"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "Atlanta, GA", "Title": "“Wonderful Place”", "Author": "gman30341", "ReviewID": "UR5961696", "Content": "We stayed here for two nights before we hit the cruise. It is a wonderful place, very roomy, quiet and the staff is very friendly. It is really an apartment with a separate living room and kitchen. Breakfast is served in the courtyard or in your room. Location is next to Balboa Park, very walkable to the Zoo, over 10 museums, and the trolley which takes you all over San Diego. I would highly recommend this as a place to stay.", "Date": "October 16, 2006"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Phoenix, AZ", "Title": "“Only Wonderful Surprises”", "Author": "buppie", "ReviewID": "UR5943988", "Content": "My wife, daughter and I spent 3 nights at Balboa Park Inn. Honestly, these guys (Ed and Judy) run an AMAZING place! A great bargain and uncommonly CLEAN. Very attentive and friendly staff. We felt like we were at home. We will sleep no place else in San Diego. We took a few pics, take a look! signed, Philip S. Phoenix", "Date": "October 11, 2006"}, {"Ratings": {"Cleanliness": "2", "Check in / front desk": "3", "Overall": "3.0", "Value": "3", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Simi Valley, CA", "Title": "“Interesting, but not as great as I had my hopes on”", "Author": "CMINIGO", "ReviewID": "UR5908721", "Content": "I was expecting more based on all the reviews written here, but I'm sure that's the only fault with the Balboa Inn. I booked the Oriental Express room for a romantic, get-away surprise for my fiancé’s birthday in July. We spent the first half of the day at the SD Zoo, which is literally walking distance from the Inn! That was great as you're also close to lovely Balboa Park and only 12 minutes from the Harbor (where we went on a harbor dinner cruise- my advice is those aren't worth the $, so don’t bother). Our room was clean. The couch, comforter, bed linens, towels, and things just felt old and dusty. The room was much smaller than expected which came as quite a surprise. The themed decoration was neat though and helped make up for what it lacked in size. The smoke-tinted mirror over the bed was fun but took some getting used to. The bathroom was ok with an older tile lshower, standard single sink, and a tub. They did leave a lovely candelabrum near the tub, filled with new taper candles and a book of matches. That was a nice touch. The toilet was in a separate room, which was all black, which also took some getting used to (even a black toilet!). At night I discovered the light in the toilet room didn't work, which was a pain but nothing we could fix and the scary Chinese mask on the wall looked scarier in the dark. After having enough to drink you’d swear it was moving. Our stay was quiet and we heard no other guests. This is definitely a place for couples only. We had a great time overall, but wouldn’t come back to the same place. It was fun for what it was, but nothing I’d want to do again. I think the best thing was the amazing omelet breakfast we had at “Café on Park” down the street, as recommended by the hotel front desk. The intimate gay art on the walls was a bit much to digest while eating, but the food was killer! This place is a great value and the location is prime. Just don’t expect too much and you’ll be pleased. And yes, there is a school directly across the street, so beware if you stay during the week, it will be noisy.", "Date": "October 4, 2006"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "4.0", "Value": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Seattle", "Title": "“Fantastic Location, Lots of Chraracter and Friendly Staff!!!”", "Author": "maighdlin", "ReviewID": "UR5824192", "Content": "We recently stayed a weekend at the Balboa Park Inn with our 20 month old daughter. We chose it because of the great reviews that it had here on Trip Advisor and felt that it lived up to just about everything that we read. The Inn is really easy to find, as it is literally right across the street from the Zoo and Balboa Park, so you can pretty much follow signs from just about anywhere and get there with no trouble. It only took us about 15 mintues from the airport in our rental car. It is also close to downtown. We didn't really venture around the nearby neighborhoods, but on the way there, we saw lots of nice restaurants and coffee shops, so I'm sure there are lots of them around. Check in was easy and despite what some of the reviews here say, we did have help from the staff lugging our bags up to the room. We stayed in the Monet Suite and it was very nice and much bigger than we had anticipated. It was literally like having your own apartment. There was a nice livingroom with a comfy couch, two chairs, a table, tv with dvd player and a nice fake fireplace. It felt very homy and comfortable. The bathroom had fairly new fixtures and was very clean, however the plumbing was really noisy sometimes...but, not enough to be a nuisance. The bedroom was plenty big and had a really comfy bed, dresser w/mirror, a tv, two nightstands with lamps and a closet that fit our big suitcase on a stand. The kitchen was bigger than we imaged as well. it had a table with two chairs, utensils, glasses and plates, a microwave, toaster oven, coffee maker and large refrigerator. They supply plenty of coffee (regular and decaf), sugar, creamer and hot chocolate. We also had a deck that we shared with another unit, that was nice to eat breakfast on in the morning. Others mentioned the plastic flowers outside and some said that they found them tacky and silly, but to be honest....they mix these flowers with real ones, plus there are lots of trees and such on the decks and patios as well. I didn't really even notice them, to be honest. I don't think I would have even realized that they were plastic, had I not read it on Trip Advisor ahead of time. The breakfasts were nothing special, but they were enough to tide us over for a little while. You got fresh fruit and juice and a choice of cereal or pastries. Like others have said, the rooms are exceptionally clean. We asked directions and suggestions from Robbi at the front desk and she was very, very helpful and friendly. Our room was fairly quiet, the rooms aren't soundproofed well, but we didn't find it to be a problem at all. The only suggestion that I would have for the folks at the Balboa Park Inn would be to put irons and ironing boards in the rooms. It would make things much easier on the guests!! :-) I know that other guests mentioned a cleaning smell of some kind, but I didn't really notice it and I have allergies and asthma, so it must not be all that bad. I would definitely recommend this place to anyone. It is clean, fun and much more room than you'd get at a chain hotel for twice as much money. If you're looking for cookie cutter, boring hotel room then I would avoid the Balboa Park Inn, but if you're looking for a clean, friendly, cozy place with character.....definitely stay here!!", "Date": "September 20, 2006"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "2", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "New Jersey", "Title": "“Fantastic location”", "Author": "Atomictoms", "ReviewID": "UR5762595", "Content": "We stayed three nights in the Mayfair suite, with two adults and one 17 year old. The suite was more like a scrupulously clean apartment with a separate tv for the 17 year old. Although the hotel did not offer internet, we piggy-backed on a neighbor's unsecured wi-fi, which worked out well. The breakfast was tasty and served within minutes of asking. The patio (including rooftop) was quite nice, although we made little use of it, spending our time away from the hotel except the evenings. The location is super. We loved Balboa Park and the neighborhood. If you are used to standard hotels, be ready, this is furnished more like a bed and breakfast, but everything was comfortable, suitable, and clean. We would definitely stay again.", "Date": "September 2, 2006"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "california", "Title": "“Friendly staff, pleasant accomodations”", "Author": "maria12134", "ReviewID": "UR5609447", "Content": "I chose balboa park inn based on it's number # 1 rating for San Diego. At the last second my husband was unable to travel with me and I was very hesitant about staying at a bed and breakfast alone with 2 children! However the staff at BPI went out of their way to make us feel welcome. This is a charming inn with all the personal touches, attentive employees, great value in a great location. My only regret is that they won't rent jacuzzi tub rooms to people with children due to insurance issues, so that limits selection greatly. Some type of liability waiver would be great, as I was dissapointed in missing out on the Jungle Room! (Also, a small pool would have been greatly appreciated in the heat!) I had no issue with parking even though I am a terrible parallel parker, and the neighborhood was very safe. I recommend balboa park inn to any traveler and will definitely stay here again in the future.", "Date": "August 14, 2006"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "St Albans, England", "Title": "“Superb Location and a really laid back atmosphere”", "Author": "Okie2", "ReviewID": "UR5523734", "Content": "Firstly, to echo other reviews, this place is an upscale motel, and not a true B&B or hotel. If you go stay here expecting the full American B&B treatment, then you will be disappointed. We paid $99 dollars a night for the Aruba room for two nights, and for San Diego that's cheap even by motel standards. Considering what we paid, we thought this place was fantastic! Location wise, this place is just a few minutes stroll from the entrance to San Diego Zoo (best zoo in the world in my opinion), and a short drive from Hillcrest and other sites...it's also close enough to the freeway to get to Seaworld easily. The room itself was small but came with a huge bathroom with a great jetted tub, and an outside table to enjoy the motel's enclosed and secluded courtyard. Breakfast was simple, but served to our door each morning at the time we specified. We thought the 'aquatic' theme in the room (cuddly toy fishes dangling on strings from the ceiling!?), and the colourful courtyard were both really fun! And most importantly, everything was totally clean. Okay, so some of the flowers in the courtyard are plastic, and the room themes are a little over the top...but we thought this just added to the fun of the place...it doesn't take itself too seriously, which makes for a great place to just relax. The owners have obviously gone to a lot of effort...it's just that it might not be to everyone's taste. I'd definitely recommend this as a great place to stay, provided that over-the-top room themes make you laugh rather than cringe. And one final thing...we were recommended a local diner by the lady at the front desk, and I had possibly the best burger ever there...it's called Brian's and it's just a few blocks from the Inn.", "Date": "July 28, 2006"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "2", "Check in / front desk": "5", "Overall": "5.0", "Value": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Memphis, TN", "Title": "“Excellent time at the Balboa Park Inn”", "Author": "matt1978matt", "ReviewID": "UR5512369", "Content": "My wife and I stayed at the Balboa Park Inn while we were in San Diego for the Comic Con, and we had an excellent stay. We booked the Courtyard Suite, and the room was fantastic. Comfortable bed, neat-o decorations, and a jacuzzi tub to boot. The property is very pretty, and the roof seating is a nice place to hang out. We were able to easily walk to the zoo, and it wasn't too hard to find our way around from the inn to other locations in the city. The only things that would really help would be wifi in each room, and maybe a less complicated alarm clock in the Courtyard Suite. Other than that, it's an fantastic place to stay.", "Date": "July 26, 2006"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "California", "Title": "“Cute and Comfortable”", "Author": "TrekMeister", "ReviewID": "UR5511334", "Content": "My husband and I stayed in the Victoria's Secret room for one night. The room was very comfortable and quiet and the decor was much more interesting than I had expected. The room was clean, the bed was comfortable and all the inn staff were very friendly and helpful (they spent quite a bit of time giving us restaurant suggestions and giving us directions and maps). Our room came with a small refrigerator, microwave, and coffeemaker, and the faux fireplace was a hoot (it would light up and make crackling noises). The room was such a nice change of pace from the generic hotel rooms every place else. The inn is made up of several buildings, each containing five or six units. The hallway in our building did have a very strong smell, like a cleaning solution, but our room did not smell. It was hot when we visited San Diego, but our room was nice and cool because of the room's very effective air conditioner. Our breakfast was nice. We had the option of having a bowl of fruit with either a basket of bite-size pastries or cereal. We chose the bite-size pastries, which also came with two cups of orange juice, and a caraffe of hot coffee. Just what we needed to start our day. They also delivered the morning paper to our room. All and all it was a very comfortable stay. The location is fantastic if you want to hang out in Balboa Park. We went to the zoo and to a theatre play in the park at the Globe Theatre. There was also a free blues concert in the park the evening we stayed there.", "Date": "July 26, 2006"}, {"Ratings": {"Cleanliness": "2", "Overall": "2.0", "Value": "1", "Service": "2", "Rooms": "1"}, "AuthorLocation": "Long Beach, Ca.", "Title": "“A full on assault of the senses.”", "Author": "MissChris", "ReviewID": "UR5460428", "Content": "We were booked to stay in the greystoke room, which didn't look that bad in the website photos. In reality it's a hideous animal theme gone overboard with stuffed animals on every surface looking at you. Maybe this would be good if you had kids, but certainly not for any kind of romance (unless you're into that). There is a giant stuffed leopard opposite the bed under a huge painting of a naked man with a big snake. To make this even worse,the room smelled horribly of disinfectant cleaner and some king of air freshener. It was unbearable. We decided we just couldn't stay there, and went to complain only to find out that someone had smoked in that room the night before and they were trying to cover the smell. They changed us to another room immediately. The next room was all pink and peach floral, basically your standard frou frou bed and breakfast room circa 1980, but with mirrors every wear, I mean every where, and spotlights on the bed. It didn't smell nearly as bad, just a hint of yucky air freshener. To top this all off, the flowers inside and outside are fake. Let me clarify, the flowers in the ground and around the courtyard are all plastic. I would never stay here again. In this case, \"eclectic\" is just another word for tacky.", "Date": "July 12, 2006"}, {"Ratings": {"Cleanliness": "5", "Overall": "5.0", "Value": "5", "Service": "4", "Rooms": "5"}, "AuthorLocation": "Philadelphia, Pennsylvania", "Title": "“Very Nice. I'd stay there again.”", "Author": "Katze", "ReviewID": "UR5412682", "Content": "My husband and I stayed 4 nights at Balboa Park Inn. I first have to say that the location is awesome. Balboa Park ended up being a big highlight to our trip to San Diego, and it was great being beside it. We stayed in City Lights, which is a bargain for $99/night. Housekeeping lugged our heavy suitcases up the stairs to our room- those girls are strong! We really liked the room - it was very clean and spacious. The amenities are nice - with tea, hot chocolate, and coffee and all the fixings in the room. There was a microwave and mini fridge in the room, which was great for heating up leftovers, which saved us money. The breakfast is nice. They brought it within 10 minutes of calling every morning. Great service. We did have some plumbing problems in our bathroom. The toilet was having tons of problems, and we ended up getting upgraded free of charge to The Courtyard Suite for the last night of our stay. This suite was so incredibly eclectic! It was crazy with tons of mix-matched pieces of decor, but we liked it. The huge jacuzzi tub was awesome. I don't think I'd pay $169/night for the room though. The smaller City Lights room was just fine. I have to say the beds in both rooms were the best! I liked them just as much as Westin's heavenly beds, which says a lot. If you need to have internet access, good luck. We were able to tap into a free, public wireless connection when we were in the City Lights room but not in the Courtyard Suite. The person at the front desk couldn't help us. My husband ended up sitting on the step outside the building where City Lights is and accessing wireless that way. The hotel should consider offering internet service. Parking was free on the street and if you can parallel park, you'll be fine. We didin't have any troubles finding spots within a block of the hotel. If you don't want to spend a lot of money on your hotel and you don't need business services, such as internet, this hotel is a great choice. It's refreshing to find a hotel with character. I get so sick of the cookie-cutter rooms like you find in chain hotels.", "Date": "June 30, 2006"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "Los Angeles California", "Title": "“Loved it”", "Author": "A TripAdvisor Member", "ReviewID": "UR5381540", "Content": "We live in Los Angeles and visit San Diego frequently. For the past 15 - 20 years we have been staying at the Balboa Park Inn. We find it a hidden treasure in the midst of a bustling city. Those accustomed to the sameness of city hotels will find this quaint bed and breakfast to be a refreshing relief. Most rooms we have stayed in were suites with various motifs ranging from victorian to the ribald. No two are alike. It is located within walking distance of Griffith Park, the Zoo, Globe Theater Complex and 10 minutes from downtown. Prices are reasonable.", "Date": "June 25, 2006"}, {"Ratings": {"Cleanliness": "4", "Overall": "4.0", "Value": "4", "Service": "4", "Rooms": "4"}, "AuthorLocation": "Amsterdam, the Netherlands", "Title": "“Fun and worth the money”", "Author": "A TripAdvisor Member", "ReviewID": "UR5381501", "Content": "We only stayed for 1 night. The people (very friendly) showed us their available rooms and we picked the jungle one. It was hilarious. But with a nice 2 person jacuzzi and double shower. We thought it was different, but fun and worth the money. We would certainly go back there again. T&J from Amsterdam, the Netherlands", "Date": "June 25, 2006"}, {"Ratings": {"Cleanliness": "4", "Overall": "2.0", "Value": "3", "Service": "3", "Rooms": "2"}, "AuthorLocation": "Lake Norman, NC", "Title": "“Not as nice as I expected”", "Author": "A TripAdvisor Member", "ReviewID": "UR5380938", "Content": "We stayed in a 1BR suite at the Balboa Park Inn one Friday evening in May '06 after a week's stay in San Diego. When our other hotel couldn't accommodate the last day of our stay, I chose this hotel because of it's #1 ranking on the Trip Advisor website, but I was somewhat disappointed with it overall. (We probably had been spoiled by having such a nice suite at the Glorietta Bay Hotel in Coronado - for not much more than the $189/night that we paid for this room). While the staff was nice enough at check in, I thought it was kind of strange that if you wanted to have a hair dryer, iron or ironing board, they 'lent' them to you upon check-in and asked that you take them to your room (were they afraid you might steal them, or could they not afford to provide one in each room? What's next the coffeemaker?) Overall the buildings and our room in particular left a lot to be desired. This hotel is made up of several older homes. The bougainvillea climbing flowers were beautiful in the courtyards, but our room was on the second floor in a building down the street. We were all tired after a long day of sightseeing and weren't impressed when we unexpectedly had to lug all of our suitcases up the carpeted steps by ourselves. The room was awkwardly laid out with a bedroom in what would have been a dining room and a sofa bed in the kitchen. While everything seemed to be clean, the room was hot and muggy. Fortunately, there was a security screen door off the public bedroom (i.e., dining room) that we could lock, but leave open to help the place cool off while we were at dinner. Note, there are no restaurants nearby this hotel, so you must drive to another area to get something to eat. The beds and bathroom were fine, but not as nice as we had hoped for from a #1 ranked hotel. In the morning, I got a little frustrated because we couldn't use the coffee maker and the microwave oven (I like hot milk with my coffee) at the same time without tripping the circuit breaker. We had no problem calling down for breakfast and it was nice that they delivered it to our room. Breakfast was ample and delicious (we opted for fruit cup and pastries), but we thought that since our \"family sized\" room rented for four people and we had 3 adults and a child, they should have given us 4 breakfasts, not just three (it's not like they gave us a discount because we had a child and only 3 adults). We ate outside on the large upstairs deck and enjoyed the beautiful San Diego weather. While there were plenty of chairs, the deck was a bit run down and could use some attention. And, seeing the rats nest of electrical wires that were overhead and going into the buildings, I could understand why the breakers kept tripping. Upon check-out, after multiple trips up and down the stairs to get all our suitcases back to our rental and returning the hair dryer to the front desk, the desk clerk said he wasn't surprised by our microwave/coffee pot electrical problem, stating that these old homes were built in the 1930's and all had a lot of wiring issues.", "Date": "June 25, 2006"}, {"Ratings": {"Cleanliness": "5", "Overall": "5.0", "Value": "4", "Service": "5", "Rooms": "4"}, "AuthorLocation": "Houston, Texas", "Title": "“One of a kind!”", "Author": "Admin", "ReviewID": "UR5326197", "Content": "I was so glad we made the decision to stay at this wonderful place in San Diego on our recent visit! The staff is absolutely magnificent - so friendly and helpful! Each room is different and while this isn't a brand new place, it is well maintained and very clean. The breakfast comes to your room when you order it. We had fresh warm croissants, pastries and a large bowl of fruit for each person. There is a coffee maker and fridge in the room. We walked to the zoo and there is a shuttle bus around Balboa Park. The bus stop is right across the street and it will take you to where you can board the trolley. We were concerned about parking on the street, but we never had a problem. The only small concern we had was that this is a residential neighborhood and therefore you must drive somewhere for dinner. It would have been nice to have a restaurant close by after a long day at the zoo. However, Hillcrest is just a couple of miles away and there are many great restaurants. A local suggested a small restaurant named Arreviderci in the Hillcrest neighborhood, and it was excellent! Other reviewers have lamented that this isn't a traditional B&B. We found it even better! I have never stayed anywhere with a staff more eager to please! We can't wait to visit again.", "Date": "June 8, 2006"}, {"Ratings": {"Cleanliness": "5", "Overall": "5.0", "Value": "4", "Service": "4", "Rooms": "5"}, "AuthorLocation": "Lake Forest, CA", "Title": "“A great find!”", "Author": "LyndaGail", "ReviewID": "UR5316973", "Content": "In town recently for the marathon and checked hotels in \"TripAdvisor. Why not start at the top. I ended my search right away and booked the Balboa Park Inn based on the reviews. I wasn't disappointed. It was different from the large hotel scene in big cities. A super location, very clean we were charmed. I would definitely book again. lp", "Date": "June 7, 2006"}, {"Ratings": {"Cleanliness": "5", "Overall": "5.0", "Value": "5", "Service": "5", "Rooms": "5"}, "AuthorLocation": "Scotland", "Title": "“Fabulous place to stay”", "Author": "Scotsgirl", "ReviewID": "UR5289203", "Content": "My husband and I spent 4 nights at the Balboa Park Inn recently, in the Beach House suite, and it was absolutely fabulous - the decor of the room was amazing, exceptionally clean, the staff were extremely helpful and friendly and all the little touches (providing matches for the candles, for example) made for a great stay. The proximity to the zoo just added to all the positive things that can be said about this place - we would highly recommend and it and will definitely stay here when we return to San Diego", "Date": "June 1, 2006"}, {"Ratings": {"Cleanliness": "5", "Overall": "5.0", "Value": "5", "Service": "5", "Rooms": "5"}, "AuthorLocation": "Tucson, AZ", "Title": "“Balboa Park Inn Is a Wonderful Place to Stay”", "Author": "ASatisfiedVisitor", "ReviewID": "UR5225301", "Content": "I have stayed at Balboa Park Inn for extended periods of time since November 2003 and have found each stay to be delightful. My most recent visit was in March 2006. The suites are beautifully decorated and exceptionally clean. A friendly and helpful staff makes each visit enjoyable. I love walking around the balcony overlooking the courtyard with its beautiful plants. This balcony connects with a large sun terrace. The plants and attractive teakwood furniture provide a lovely place to have breakfast or just sit and relax. I'm looking forward to my next visit.", "Date": "May 25, 2006"}], "HotelInfo": {"Name": "Balboa Park Inn", "HotelURL": "/ShowUserReviews-g60750-d112247-Reviews-Balboa_Park_Inn-San_Diego_California.html", "Price": "$99 - $219*", "Address": "<address class=\"addressReset\"> <span rel=\"v:address\"> <span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">3402 Park Blvd.</span>, <span class=\"locality\"><span property=\"v:locality\">San Diego</span>, <span property=\"v:region\">CA</span> <span property=\"v:postal-code\">92103</span></span> </span> </span> </address>", "HotelID": "2515476", "ImgURL": "http://media-cdn.tripadvisor.com/media/photo-o/01/bd/fc/38/balboa-park-inn-thumbnail.jpg"}}