{"Reviews": [{"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "3", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Banska Bystrica, Slovakia", "Title": "“Great Stay!”", "Author": "Tomaskova", "ReviewID": "UR128947458", "Content": "We stayed at the Villa's for 7-days in April of 2012. We were in room 1512 which is right at the front of the Villa building, therefore it is steps away from transportation and the main lobby. We were also located close to the pool. It was clean, quiet, and all of our needs were met immediately. We absolutely loved having the full kitchen, and it saved us a ton of money instead of buying the dining plan. We look forward to going back to Disney, and staying at the Lodges again!", "Date": "April 27, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Port hedland", "Title": "“Amazing!”", "Author": "Ironships", "ReviewID": "UR128277856", "Content": "An amazing room. Stayed in a one bedroom villa for 4 nights. The attention to details just incredible. The villa had heaps of room for the family to spread out. Staff very helpful. A welcome relief after 4 weeks traveling with two kids. The smell of the trees on the veranda in the morning was just lovely. Never waited more than 10 mins for a bus or boat. Boat access to magic kingdom is worth it when returning after the fire works.", "Date": "April 21, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "3", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Allen, Texas", "Title": "“My new home away from home”", "Author": "LizGirl", "ReviewID": "UR128173919", "Content": "We really enjoyed the Villas at Disney's Wilderness Lodge. Upon entering the main lobby, I could not contain my \"wow\". The structure is so impressive in the way only Disney can do. The theming is fantastic. We had a one bedroom unit that had a nice kitchen and a wonderfully roomy bathroom area, including a large walk in closet. These units are very smartly laid out and make it easy to get comfortable. Since we were on the first floor, we had two walk out patios. The landscaping and decor are very relaxing. The proximity to Magic Kingdom can't be beat - you are right there but feel a world away from the hustle and bustle once you are back at the resort. The staff at the lodge was always very friendly and helpful. We even got to be the flag family and visit the roof of the main lodge. As for cleanliness, I was pretty happy. We left a small gratuity every day and mousekeeping took good care of us with extra toiletries and towel animals for the kids. They kept the room clean and even ran the dishwasher. We did have a couple of issues that were very minor - previous guests had put away the dishes when they were dirty, the shower door was a little rusty and likely needed to be replaced, and mousekeeping forgot to clean the toilet before we checked in. Overall, we were so pleased with the villas and can't wait to return! We booked a bounceback offer and will be back there very soon! I highly recommend this hotel.", "Date": "April 19, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Richmond, Virginia", "Title": "“Wonderful Hotel - great for families”", "Author": "1967foodie", "ReviewID": "UR128051643", "Content": "My wife, 12yo daughter and I stayed four nights in the Villas at the Wilderness Lodge from April 10 – 14, 2012. We are DVC members and stayed on points. We stayed in a one bedroom room with a king bed and a sleeper sofa. Our room was on the 4th floor overlooking the front of the villas walk-way from the Wilderness Lodge. Our room was very clean when we arrived. The bedroom had a very comfortable mattress that was soft with good quality sheets and bedding. My wife liked the soft pillows. My daughter said the sleeper sofa was fine and she slept well each night. The bathroom had the toilet in a separate room with its own lockable door. The shower stall was huge with a nice Waterpick shower head. There was a separate area in the bathroom for the large jetted tub and vanity. This is also were the walk-in closet is located. The bathroom was accessed from both the master bedroom and the living area. The kitchen area was spotless when we arrived. The refrigerator was spotlessly clean as was the sink, stove, microwave and dishwasher. Disney does an excellent job in the way it “Themes” its resorts. The Wilderness Lodge is themed just like its name – as a lodge/log cabin. All areas show Disney’s attention to detail in how the theme is carried out throughout the report. All posts and beams are made to look like logs (if they are not actually wooden logs), and all metal handrails look like small logs. My only complaint about the room is how the bathroom is set up – there is no way to lock both doors that enter into the master bedroom from the living area and bathroom. There is a lock on the door from the living area to the MBR, but not on the door from the bathroom into the MBR. This door can be locked from the inside to prevent anyone from entering the bathroom, but not from entering the MBR. Small issue, but one I need to point out.", "Date": "April 17, 2012"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "Cheshire", "Title": "“Wilderness Escape”", "Author": "luvs2hol", "ReviewID": "UR127846773", "Content": "The minute you arrive at the hotel you really feel like you've been transported to the American Wilderness. The landscaping of the grounds is superb and we really enjoyed walking the nature trail, or even better, hire a surrey bike and save those tired legs. There always seemed to be a quiet corner of the grounds to sit and relax too. The villas building is impressive and the touches and attention to detail is the best that I've seen in Walt Disney World - you can really tell how much effort has gone in to the \"imagineering\" of the resort. The rooms were spotless and well thought out and the balcony, although compact, had a lovely relaxing view of the woods. We found the boat service to Magic Kingdom a great advantage and a novel way of getting to the park. The bus service was ok but it was annoying to detour to Fort Wilderness, often doubling back to continue on to the parks. We were glad to have our hire car - just be careful to remember where you park as the lot shared between the lodge and villas is massive. The staff were always helpful and friendly. The restaurant options were ok - we've eaten at both Whispering Canyon and Artist Point in the past and would definitely recommend the latter. Roaring Forks food court was also good - we used the drink refill station a lot and bought a few snacks from there too. The pool for the villas was quite small but we never found it that busy. The lodge pool was much bigger but in comparison, was always packed. We wish we had allotted more time to spent around the resort but we will be back to explore more in future.", "Date": "April 14, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Portland, Oregon", "Title": "“Perfect location for families visting the Magic Kingdom.”", "Author": "EdwardTylicki", "ReviewID": "UR127776339", "Content": "This is my second time here and it is the perfect location for families visiting the Magic Kingdom. There are small boats that go from the property to the entrance to the Magic Kingdom. The rooms (two bedroom with a living room) are nice with views of the woods or lake. The place is great for families with young children. The pool and activities for kids are nice. Every night there is a water show of barges on the lake. I like the running trail along the lake and towards the Wilderness campground. I especially enjoy the laid back quiet feel of the villas after being in the parks.", "Date": "April 12, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Clermont, Florida", "Title": "“Transported away from the Everyday”", "Author": "ecs44", "ReviewID": "UR126985481", "Content": "Once you step into the gorgeous lobby, you are instantly transported away from your everyday life and are now in the midst of something Magical. Then you walk to the villas and find another intriguing lobby that sets your imagination free. The rooms are perfectly clean and offer some lovely views. Two pools - one with a slide & pool parties and one that is quiet but beautiful and relaxing. There's a beach with campfire, movie, & electrical water parade. Three restaurants and service via boat to Magic Kingdom. (There's also bus service to all other Disney attractions). A well appointed gift shop with souveniers as well as snacks. Plenty of things for kids to do and all in a lovely atmosphere. You could just hang out at the resort without even going to the parks and have a wonderful time.", "Date": "March 30, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Jacksonville, Florida", "Title": "“Excellent choice for Christmas season”", "Author": "JAXTRAVELLINGMOM", "ReviewID": "UR126503018", "Content": "We stayed here in December and loved everything about our visit. We stayed in the DVC 1 bedroom for 2 nights and the studio for 1 night. We prefer the 1 bedroom with a kitchen because we can cook our food and save money. The lobby in the hotel is decorated so beautifully and we were able to take a lot of great family photos. The restaraunts also have great food and atmosphere. The only con I can stay about the DVC area is that the units are very far removed from the main lobby hotel and it is a hike ith a 2 & 4 year old every day. There is a great little boat that docks at the hotel and will take you to the Magic Kingdom too.", "Date": "March 22, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Asheville, North Carolina", "Title": "“Another great stay at Disney”", "Author": "QTandToots", "ReviewID": "UR126088228", "Content": "This was our first time staying at the Villas at Wilderness Lodge. I love the decor; if you like staying in a national park, this is perfect atmosphere. The staff was great and friendly. I had done online check in before arrival and after we went through the guard gate, we were actually greeted by someone who had our keys and welcome packet in hand. Pretty convenient! We drove most places but did use the Disney bus to get to Fort Wilderness for the Hoop de Doo show. It's the first stop so it was quick and easy. My only complaint is the lighting; things are pretty dim over the mirrors so a bit challenging to put make up on. I'd definitely stay there again though.", "Date": "March 14, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Buffalo, New York", "Title": "“one of favorites!”", "Author": "john m", "ReviewID": "UR125930373", "Content": "This was our 4th time staying here, obviously one of our favorite Disney resorts. We had a great stay, the service was typical Disney quality..Awesome! The resort is in a great location, just a boat ride away from the Magic Kingdom. The themeing is excellent! The Whispering Canyon Cafe is a fun place to eat, the food is very good. It is themed so well, you wouldn't think you're in Florida. It feels just what it was themed for..like you're staying at a lodge in one of our national parks out west! Only drawback with this resort is the main pool. It just isn't on par with other Deluxe resort pools. A better water slide would definitly change my opinion. If the waterslide dosen't bother you then the pool is fine. I'd advise against accepting the handicaped room...unless you need it. We were given this room becuse it was the only one ready when we checked in, I was tired from driving , I just wanted to sleep, so I accepted it. You lose a lot of counter space, plus no eating counter and you need to put a towel in front of shower or your bathroom floor gets wet. These items will not prevent me from staying here again, this resort is a favorite! If it weren't for the handicap room I would've rated this excellent!", "Date": "March 11, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Boston, Massachusetts", "Title": "“Wilderness Retreat”", "Author": "Greg R", "ReviewID": "UR125827817", "Content": "My wife, two daughters (ages 7 & 9), and I recently made our annual winter school vacation trip to Walt Disney World. Since we are Disney Vacation Club owners, we generally stay on property at DVC resorts. For this trip, we decided to stay at the Villas at Disney's Wilderness Lodge due to it's proximity to the Magic Kingdom. We were very happy with our choice! When we arrived at 11:30 AM our room was already ready. Normal check-in for Disney resorts is 3:00 PM, so we were extremely happy to be able to check-in early. We stayed in a studio room which comes equipped with a queen bed, double sleeper sofa, flat screen TV, dvd player, coffee maker, refrigerator, and microwave. We typically have a light breakfast in the room each morning, so the kitchen area made things easy. The resort has a great lobby and the grounds are beautifully maintained. Overall, you really get the feeling of being in the Northwest wilderness. In addition to the pools, the resort offers an arcade, a children's activity center, bike rentals, boat rentals, nightly marshmellow roasting and movies on the beach. We enjoyed a great dinner at the resort's signature restaurant, Artist Point, and the counter service restaurant, Roaring Forks, had lots of quick and tasty options as well. The location of the resort was terrific! The boat ride to the Magic Kingdom took less than 10 minutes. There is also a boat that will take you to the Contemporary Resort, which is convenient if you have reservations at the California Grill or Chef Mickey's. Buses are available to take you to the other parks and Downtown Disney. Overall, we were extremely happy with our decision to stay at the Villas at Disney's Wilderness Lodge.", "Date": "March 8, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Buenos Aires, Argentina", "Title": "“Amazing place to stay... es un sueño el lugar”", "Author": "Flor47", "ReviewID": "UR124732616", "Content": "The room at villas is full-equipped with a microwave, a coffe maker, a toaster and a refrigerator. The hotel is near Magic Kingdom. From my room a saw a couple of deers and squirrels, beautiful and peaceful:). The room is comfortable. In the hotel there is a private beach, near the beach there is a place where you can rent boats and bikes. I RECOMMEND THIS AMAZING HOTEL! RECOMMEND THIS HOTEL! PACIFIC soo! AND VERY WELL EQUIPPED! We had a SUPER HOLIDAYS!", "Date": "February 17, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Pennsylvania", "Title": "“Second time staying here was just as amazing as the first!!!”", "Author": "sleepingbeauty_10", "ReviewID": "UR124202388", "Content": "Love staying here! Rooms are spacious! Love the decor and vibe! Great home away from home!", "Date": "February 6, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Detroit, MI", "Title": "“Another winner for Disney!”", "Author": "Belle_n_Daisy", "ReviewID": "UR124178360", "Content": "We had a large group so we got a 2 bedroom and a studio. Both were decorated and maintained in the excellent Disney manner we've come to expect. The resort was nicely laid out and scenic. The restaurants were great, the store was great, the pools were great. We even caught an electric light parade on the water! This was our first visit to the Wilderness Villas and we would definitely return!", "Date": "February 5, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Athens, Georgia", "Title": "“Amazing Disney property!”", "Author": "amieingeorgia", "ReviewID": "UR124023709", "Content": "What can you say? This is Disney -- awesome customer service, amazing thematic decor right down to the geyser outside and the bubbling brook in the lobby. Nice rooms, comfortable beds; the rooms are a bit small compared to other Disney resorts, but you're only there to crash at night & get ready in the mornings anyway, right? The boat to MK is a nice touch, and there are pontoons you can rent and a light show at night on the water. There's a great general/gift store on site, and you really do feel like you're in a national park, or maybe even Jurassic Park (in a good way) at times. The negative? The rooms could use some refreshing like new carpet and for a place that caters to young kids, they really need to replace the stoves. The knobs are right there on the front of it -- eye level for our 18-month-old -- who just thought it was a great thing to turn those knobs. That is unsafe. But, if you're going to Disney, I highly recommend staying at a Disney resort so you get those extra benefits like Magic Hours in the parks & the meal plan, and if you're going to a Disney resort, the Wilderness Lodge is an excellent choice, and the villas have a full kitchen!", "Date": "February 2, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Beavercreek Ohio", "Title": "“Very woodsy and neat for Christmas!”", "Author": "Lmcgraw551", "ReviewID": "UR123203380", "Content": "This hotel is beautiful. this was the first time we got a one-bedroom at the Villas. This was a must and very nice for cooking breakfast (you can get all the fixings at the little store). Our view was great and the weather was beautiful. The lodge was neat for Christmas. Since we were at the Villas, Santa delievered the presents to the 2 story tree in the entry. Doesn't get much cooler than that. I do have to say that we ahve gotten spolied staying at the Beach club and having easy access to Epcot and Hollywood Studios. You can ride the boat to MAgic Kingdom but that is about it...everything else is by bus. We also did the carriage ride through the campgrounds--a must and worth every penny of the $60.00!!!", "Date": "January 17, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Pocomoke, Maryland", "Title": "“First time at the Villas”", "Author": "ChincoteagueWaves", "ReviewID": "UR122969536", "Content": "This was our first time at one of the DVC club properties and we were impressed. We also for the first time \"rented\" points from a DVC member to do this. It saved us around $1500 off a regular room rate to do this. Check some of the disney boards or just search dvc club point rental and you will find it. Make sure you do your research and read everything before going forward. It' not for everyone, but it worked for us. We found a friendly and trustworthy DVC point owner with more points then he could use, so he made the reservation, booked our meal plan and I paid him a dollar amount per point. It worked and we will do it again. As to the property. Typical Disney in that it's done right, themed well, super clean and well maintained. Please note we look at a room a bit differently than many. For us, a trip to Disney isn't about the room...its a place to sleep, clean up and go back out for something else to do. On the whole, the room was adequate and comfortable, very clean as well. Our room had one queen and 1 sleep sofa. We are four, two adults, a 13 year old and a 9 year old. The only thing I can say not positive about the room is that it was the smallest of any room we have ever used at WDW. That's not to say it was too small, just wanted to be clear at times we felt we were walking all over each other. It functioned, but I could have used another 50 square feet or so. Balcony overlooked woods. Hidden Springs pool was a nice stop that was never very busy compared to the other pools. Our room was at the very end of a VERY long hall. When we turned the corner on the first day we laughed out loud at how long it was. Be prepared if you have folks in your party who don't get around so well, ask at the front desk when checking in, how close is the room to the elevator.", "Date": "January 12, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Crystal Beach, FL", "Title": "“More than amazing!”", "Author": "2BOYSMOM44", "ReviewID": "UR122623861", "Content": "We were pleasantly surprised with this property. I had asked friends for a recommendation and this property came up numerous times. So glad we stayed. The room was on the small side and we had thought we were getting 2 queeen beds when we got 1 queen and 1 pull out sofa bed. It was OK comfortable but the kids didn't complain...they were exhausted from the Magic Kingdom. I don't think I've stayed in a cleaner property. It was impeccable! We asked for more towels and they arrived promptly. Our luggage was waiting at our room on arrival with a bellman. Transportation to/ from Magic Kingdom (the only park we visited) was easy via boat or bus. We were there in November and the Christmas decorations were stunning. Everyone was pleasant and helpful. The room had a mini kitchen with refrigerator and microwave. We had a nice balcony overlooking the woods. The outdoor movie, lakeside, was fun as was seeing the geyser.", "Date": "January 5, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "3", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "South Florida", "Title": "“So comfy! Just like home”", "Author": "jentlewolf", "ReviewID": "UR122584531", "Content": "I stayed in a two bedroom villa with a group of friends in November, 2011, for four nights. The Lodge is beautifully decorated. The beds were comfy, bathrooms large, and the kitchen was nice. We had no complaints at all about our stay. Grabbing the WDW transport was a short walk from our room. The pool by the villas was nice a quiet. The main pool by the hotel was a little louder from all the children playing. The poolside bar was nice and relaxing. Just everything you would expect from a Disney property. I would HIGHLY recommend the villas.", "Date": "January 5, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Traverse City, Michigan", "Title": "“Good time to visit WDW”", "Author": "theaterguy", "ReviewID": "UR121883962", "Content": "Staying at the Wilderness lodge and villas is a great way to get away from the large crowds and remain close to the action. Its the smallest of the vacation club properties. Has a great pool and outdoor pool bar. The staff at the pool bar are very friendly. It was october, so Kids are in school, except for those in strollers.", "Date": "December 19, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "", "Title": "“Fantastic holiday”", "Author": "GMLee", "ReviewID": "UR121834437", "Content": "In a fantastic location, just a short boat ride to the magic kingdom. Stayed in November, this is a wonderful resort. The rooms are small but are clean and have everything you could need for your stay. Loved it and will definitely be back.", "Date": "December 17, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Rhode Island", "Title": "“Love this place!”", "Author": "livsmeem", "ReviewID": "UR121680270", "Content": "I have always wanted to stay at the Wilderness Lodge and finally got my wish. We just returned from Disney and had such a good time. What a great resort! My husband and I had a one bedroom villa. He normally gets up earlier than me and I like the separate bedroom so he doesn't have to tip toe around me. It was so peaceful there. We loved the decor, pools were great, (we didn't have an opportunity to use them but they looked fabulous!), the beach is fun, the main restaurant is really good and they make it very fun for adults and kids. The quick service restaurant is ok - there are some really good sandwich selections. We didn't make it to the high-end restaurant; couldn't get reservations but we heard from many that it was quite good. In the villas, there is very little noise from other rooms, (we didn't hear any to be honest). There was no noise from the common hallway; there were a LOT of kids there so we were quite surprised we didn't hear them! There are nice walking/riding paths, boat rentals...you could spend days at this resort and never visit the parks and still have a good time. Beds and pillows were comfy - shower pressure good - kitchen more than adequate - well situated, (just a few minutes to the parks), excellent service, good food, fun events going on all the time... Yes, I would HIGHLY recommend this resort! I know some people feel like, 'why spend a little more on a room like this - you don't come to Disney to sit in your room', but you know, there is a lot of running around at those parks and a little down time is a very good thing. If you can spend that down time in a comfortable space, why not? We've stayed off the park before and frankly, most of the economy rooms are just a little icky. We've also stayed in other Disney resorts but this ranks as our favorite and we will absolutely go back to Wilderness Lodge when we visit Disney again.", "Date": "December 12, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "", "Title": "“One of best DVC locations”", "Author": "EveningStar7679", "ReviewID": "UR121364678", "Content": "The Villas at Disney's Wilderness Lodge are one of the best Disney Vacation Club properties at Walt Disney World. First off, the atmosphere, it feels like you are at Yellowstone and there is not a Castle just a small boat ride away. The geyser that spouts every hour, hot springs, mountains building up the pool, and large trees makes it seem like you are at a resort tucked inside Yellowstone. The small touches like animal prints and leaf outlines in the concrete even add to. The atmosphere is enough to come back again and again. However, the rooms are excellent. They are spacious and carry through the theme. We stayed in a a studio which had a pull out bed and a queen bed. The pull out bed was as comfortable as the queen bed (which is rare to find!). When looking outside, the area was covered with trees and no sights of Florida...you were able to put yourself in the wilderness even more. The villas are separate from the actual hotel. There is a covered walkway, perfect for when those Florida afternoon storms come, to get there. The actual villa lobby branches off into a place to sit and visit, a play area and multiple art decoration areas. The elevators to take you to your room are fast. If you missed one, another elevator was going to be there in seconds. It was fabulous for when you were exhausted from a long day at the parks and was ready to be in your room and sleep. The quick service restaurant had a variety of offerings and specials. The sitting could get tight during peak times. It was always concerning when there was a long line to get food if you were going to be able to get a seat. But, the resort is spectacular. You could spend just a day there exploring and going in the pool. It was so much fun and I cannot wait to stay there again!", "Date": "December 3, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Location": "5"}, "AuthorLocation": "Spartanburg, SC", "Title": "“Great place to stay”", "Author": "Momofthreesweeties", "ReviewID": "UR120814237", "Content": "Stayed here for eight days in November 2011 in one bedroom villa with my husband and three children. Had a great room, loved the peaceful setting, plenty of space for all of us. The resort is wonderful, one of my favorite here at Disney, great location to Magic Kingdom, able to ride boat or take bus easily. Only complaint is service at front desk, is really not good at all. Workers up front do not have great attitudes, definitely missing \"the magic\". Called several times to ask basic questions, which nobody knew. Disappointed in this aspect. Otherwise flawless experience.", "Date": "November 20, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "2", "Location": "5"}, "AuthorLocation": "Knoxville", "Title": "“Great resort, but not our \"ambience\"”", "Author": "Jennjoonthego", "ReviewID": "UR120780341", "Content": "We stayed here using our DVC points in October 2011 so we could enjoy the Epcot Food & Wine Festival. Check in was seamless and our room was ready early. The lobby is beautiful and filled with similar amenities to the other DVC Villas: a few restaurants, a bar, a gift shop, and arcade. Our room was very similar to the ones we stay at Saratoga Springs in layout, but in decor it had a very cabin like feel and color. It really was too dark for us. My husband made the comment that he would just go to a cabin in the woods if he wanted to stay in a cabin! Ha ha. We stayed in a one bedroom villa that has ample space for two adults and two relatively small kids aged 11 & 13. We will eventually reach a point where the kids will desire more privacy and/or room, but that's another story. Things that we disliked:the decor was too dark and made the room feel dated and the main pool layout seemed as though it was put in as an afterthought in the middle of a walkway. Plus the slide seemed geared toward kids younger than ours. Things we liked: the beach, the staff, the lake, the boat and bike rentals, the ease of transportation, the deer grazing right beside the walkway each evening. In conclusion, it's a great resort, but our family prefers light, open, more modern accommodations. We are used to Saratoga Springs which has an entirely different ambience. We will not stay at Wilderness Lodge again, but only because we prefer another Disney DVC villa.", "Date": "November 19, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Sleep Quality": "4", "Rooms": "3", "Location": "4"}, "AuthorLocation": "SC", "Title": "“Good but not great”", "Author": "cal0899", "ReviewID": "UR120662507", "Content": "We stayed in the Wilderness Lodge Villas. They are like furnished condos with everything you'll need for your stay. The rooms are comfortable but a bit dark (maybe more lighting or better bulbs?) The thermostats weren't the best. The hall was constantly cool but our a/c didn't compare and couldn't keep up. The fold out couch was very comfy for our boys (one of the best mattresses I've encountered). The way the bathroom is separated into two rooms is smart for privacy. Nice to have 2 closets and 2 tvs. Deck/patio was nice but a little small. It was a lifesaver to have a washer/dryer after two days of heavy rain for our water-logged tennis shoes. The staff did a good job and were very polite. Be prepared for the high prices of the food in the gift shop. If we'd had a car I would have driven to a grocery store. The tap water has the sulfery smell/taste so bring/buy water if you can't tolerate it. Seems to me if the resorts on the Mayan Rivera can afford water treatment systems that Disney could as well?The ferry to Magic Kingdom was super-convenient and the boys loved watching the birds, otters, etc. Overall a good stay.", "Date": "November 16, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Hillsboro, Oregon", "Title": "“Coming back.....”", "Author": "David P", "ReviewID": "UR120629856", "Content": "We have been staying at the Wilderness Lodge since it first opened in 1996 I believe. We come in early December each year and have spent the last 4 visits in the villas. We highly recommend the main lodge and the villas but it is curious that you are not given a complimentary newspaper if you are in the villas but you are in the lodge. Doesn't quite make sense to me but then neither does the lack of wi-fi in the rooms. While annoying, neither of these factors are deal breakers because the experience is well worth it. All three dining locations on property are special in their own ways. What makes the Wilderness Lodge special is the staff. We are welcomed every year by a bellman we met in 1996 that remembers us by name and by various of the wait staff from the Whispering Canyon that also remember us. The last little negative comment I have is that the decorations around the Lodge at Christmas seem to be shrinking a bit every year. Having said that, we're still coming in 19 days!!!!!", "Date": "November 15, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Uckfield, United Kingdom", "Title": "“Fantastic resort”", "Author": "Heather G", "ReviewID": "UR119885930", "Content": "We enjoyed a week at the villas at wilderness lodge as part of our Disney vacation club membership in mid October .we did the on line check in which is great desk to room 5 mins. It is a beautiful laid resort with a serene feeling about it. We were a party of 2 adults and it is not always possible to get quiet adult time at Disney but this place hit all the buttons. The setting,quiet and family pools and fun restaurants. Excellent means of getting to the parks with boat and bus option making it easier to get to other resorts for dinner etc if you don't have a car I did the behind the scenes resort walk about which was great and very informative. Can't wait to stay here again", "Date": "October 30, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Central NJ", "Title": "“Quiet”", "Author": "PartyofFiveNJ", "ReviewID": "UR119471175", "Content": "We stayed here the second week of October. It is such a serene, quiet hotel. Beautiful to look at. The boat to the MK seemed to always be at the dock or just getting there. It was a great way to travel without all the chaos and hassle of the busses. One word on the bus transportation from here, every trip is either yoked with Fort Wilderness or Grand Floridian. Now, while they appear to be close to WL, they actually added on another 10 to 15 minutes to your ride to the park. So, every trip to any park ended up being at least 20 to 25 minutes, at the very best. Other than that, the hotel was great.", "Date": "October 19, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Kendal, United Kingdom", "Title": "“Enjoyed our home from home!”", "Author": "McClures", "ReviewID": "UR119265789", "Content": "Arrival in the lobby of this wonderful hotel and you are in awe of it. It is absolutely fantastic and truly characteristic of a wilderness lodge. Check-in for the villas was extremely efficient as we had used the online check-in facility so just had to pick up our pack and room key. The villas are in a separate lodge to the main hotel but you use all facilities. We were given \"happy anniversary\" badges as our wedding anniversary had been the day before we arrived, which was kind of special as every time we went past members of staff they wished us a happy anniversary! The lobby of the villas is just as detailed and amazing in its own right as the main lobby. We had a lovely spacious one-bedroomed villa overlooking the pool area, very beautiful, with all the facilities needed of a self-catering apartment. Having been in the Disney Vacation Club now since 1997, we have never been disappointed at the accommodation and are still extremely pleased that we ventured down the road of ownership. Will be returning to the Wilderness Lodge some time soon! And thank you to all the staff for their efficiency and pleasantness.", "Date": "October 13, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Barcelona, Spain", "Title": "“Loved it!”", "Author": "PoisonedIvy", "ReviewID": "UR118731545", "Content": "We stayed in the villas at the lodge for 5 days during our honeymoon. It was fantastic. Truth to be told, we had a great deal with almost 40% off, so I don't know how much the villas normally cost. Positive - The room was cosy, spacious and even had a little terrace in the garden. - There's a seperate vanity area with 2 sinks. - The kitchenette was well equipped, with enough plastic plates etc. - The Villas are seperated from the main lodge and have a small swimming pool, so it's much more quiet than staying at the lodge. We especially loved the Pacific room. A great place to relax after a day in the parks. - You can go to the MK by boat, much nicer than taking the bus. - In summer, they make a campfire on the beach, to roast marshmellows. Negative The first day we got our refillable cup, but you can only fill it at the soda fountains in Roaring Forks. It would be great if there was a place also in the villa's. The bathroom was pretty small compared with the rest of the room. We had a great stay and would definitely come back.", "Date": "September 29, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "5.0", "Value": "3", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Brockville, Canada", "Title": "“Wonderful resort...but improvement can be made”", "Author": "thriftylil", "ReviewID": "UR118716982", "Content": "We stayed at the villas, in late September for a week to have space after a busy day at the park.......grounds were immaculate, villa,clean ,spacious and very comfortable. We were fortunate to have the lake view.The villas are exceptional becuase they feel like home..... Some concerns to share Check-in ...arrived at 11...checked in at 3...Reception was not magical. Restaurant.....very crowded at meal times Pool very crowded. Childrens activity area was un-shaded, and did not encourage children to stay long due to the sweltering 90 degree heat. Last but not least.....internet SHOULD be free with the cost of the room considered, although this complaint has been heard over and over again..Will save my $$$ to return, because the great outweighed the bad.....", "Date": "September 28, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Kissimmee, Florida", "Title": "“Best place ever!”", "Author": "BarbaraJane", "ReviewID": "UR118694671", "Content": "Stayed at Wilderness Lodge and can't wait to go back! You feel as if you are up North and for a native New Yorker, it just fits the bill. Loved the fireplaces that are all around the resort, it just made for a very cozy atmosphere. Our room was bright, clean, and I especially loved our little deck, which I loved sitting on in the evening. The main restaurant is truly family style, and lots of fun for kids. If you want a quiet meal, then this isn't where you want to eat. The food is good, but the place is more for children. They do have other places to eat on the property so don't worry about that. There is something there for everyone!", "Date": "September 28, 2011"}, {"Ratings": {"Location": "5", "Overall": "5.0", "Value": "5", "Service": "5", "Rooms": "5"}, "AuthorLocation": "Marlton, New Jersey", "Title": "“You really feel like you're really in the wilderness...seriously!”", "Author": "MacTavish", "ReviewID": "UR118212469", "Content": "We stayed in a two bedroom villa for 7 nights on the fourth floor. The villa was appointed very well and themed perfectly. The beds are very comfortable, and there is everything needed for a home away from home atmosphere. The grounds are absolutely georgous, and true to Disney, everything was impeccably maintained. The lounge area on the first floor has a two wonderful sitting areas with fireplaces. Any spot in this area will make you want to grab a good book, get comfortable, and relax! There are also perfect spots for this as well on the rocking chairs outside on the massive porch area. Take a walk down the \"Nature Trail\" if you get a chance. Its really neat. Knowing there are gators, wild turkeys (seriously!), etc. in the area, you'll never know what you'll run into...so you have to keep your eyes and ears in check! :-) The spanish moss definately adds to the beauty and authenticity of the overall experience. We also went to the Hoop-Dee-Doo Review. I highly recommend this. It was very funny and the food was very, very good considering this is a dinner show. The ribs and chicken were cooked perfectly - chicken was flavorful and juicy, and the ribs literally fell right off of the bone. Yum! I hope this was helpful and if you decide to go...HAVE FUN!", "Date": "September 16, 2011"}, {"Ratings": {"Location": "5", "Overall": "5.0", "Value": "3", "Service": "4", "Rooms": "5"}, "AuthorLocation": "Baltimore, Maryland", "Title": "“Nice stay!”", "Author": "Craig Z", "ReviewID": "UR118198340", "Content": "We just got back from a 10 day trip to WDW and stayed in the Wilderness Lodge villas for a couple of nights to end our vacation in style. We have 5 kids and the double room villa more than accommodated us. It is rustic in decor, yet luxurious with ammenities. Expense is the only drawback. I highly recommend renting a two person boat for 45 min and exploring the 2 lakes. There are a lot of poolside activities for the kids. The pool is a little crowded. The boat ride taxis to the MK are very convenient and fun. We would definitely go back!", "Date": "September 16, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "4", "Service": "5"}, "AuthorLocation": "georgia", "Title": "“Perfect for Families!!”", "Author": "ligby", "ReviewID": "UR117543046", "Content": "My husband (43), seven year old son and I (40) stayed here in June and had a great stay. We are Disney Vacation Club members and we were staying on points. We had a one bedroom villa on the first floor. When we checked in, I wasn't thrilled with the news that we had a first floor room but my fears were quickly doused when we arrived in our room. The view out the back windows was of pine trees and there were two small patios, one off the living room and one off the bedroom. It's really too hot to spend too much time sitting outside anyway, so it turned out to be fine. This hotel is big and having a room on the bottom floor made it a lot easier to get to our room after a long day at the park. The room had a \"wilderness\" camping theme. The colors were lots of dark greens, maroons and browns and woodsy looking. I loved the little hidden Mickeys in all of the carpets, curtains etc. There was a stackable washer and dryer, which is very useful. They supply you with one loads worth of soap, so if you plan to wash more, bring some from home. The kitchen was well stocked with everything you would need to prepare a real meal, fridge, regular stove/oven, microwave, dishwasher and untesils. The bathroom is a splt bathroom,with a toilet and sink and shower in one room area with a door and then the jacuzzi tube and sink in another half. The tub has a window that over looks the bedroom, but there are louvered shutters that you can close. There is a sofa bed in the living room that is really easy to set up and is quite comfy. The master bedroom had a King size bed, and extra overstuffed chair, dresser and a flat screen tv. There was also a flat screen tv in the living room. Overall, it was comfy and perfect for the three of us. The lodge itself is beautiful. There is a ferry that takes you to the magic kingdom and is really quick. There is an awesome \"quiet\"pool. There is also a pool with a slide, bar etc. The only downside I could say is that the parking lot and the rooms are really far apart. Not that this is a bad thing, unless it is 1:00am and everyones feet are tired. I would definatley stay here again. It was wonderful!!!", "Date": "September 1, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Brooklyn", "Title": "“Loved the Wilderness Lodge”", "Author": "Brooklyntraveler_8", "ReviewID": "UR116286282", "Content": "We just returned from a 9 day stay at the Wilderness Lodge and did not want to leave. The hotel has a beautiful lobby that is modeled after the Old Faithful Inn in Yellowstone National Park. Maybe we loved the lodge because it reminded us of our wonderful trip to Yellowstone last year! The lobby is constructed of wood with beautiful craftmanship and has a stunning fireplace which is relaxing to sit by. The room was a bit small but was comfortable for my family of 4. Kids loved the bunk beds and we had a view of the villas,woods, and the villa pool. Do not get caught up in the view however since we were never in the room except to sleep or shower and did not even pay attention to the view! I know people have reported that the rooms seem a bit dark and dated. They are a bit dark,however if you ever stayed in a national park the rooms are a bit darker due to the wood furnishings,decor,and lighting. The hotel did NOT seem dated or worn at all! My one complaint would be that it did not have enough lighting. The pool was nice and the children loved the slide and the daily children's activities by the pool. The staff really kept them busy!! The kids also loved the movies on the beach at night but beware of getting bit by mosquitoes and bring bug spray to put on the kids beforehand. They also enjoyed nightly marshmallow roasts! We also enjoyed the boat ride to Magic Kingdom and Contemporary Resort which seemed to come every 10 minutes. I can't report on the buses because we rented a car. All staff that we met were very helpful and curteous and went out of their way to ensure we were having a great time. We did not like the Whispering Canyon Cafe as we felt it was loud and annoying although my husband did enjoy the skillet dinner. The Roaring Forks Cafe was convenient however we would have liked a more diverse menu to choose from as it seemed to have the same choices every day. The souvenier mugs were a great deal as you are able to refill them throughout your stay with coffee, water, and a variety of drinks. The kids loved refilling their mugs and felt it was a real treat. We thoroughly enjoyed our stay. I cannot compare to other Disney hotels except the Port Orleans French Quarter. The whole family agreed it was much better than Port Orleans.", "Date": "August 4, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "4.0", "Value": "3", "Service": "5"}, "AuthorLocation": "San Antonio, Texas", "Title": "“Our Favorite Place to Say at WDW”", "Author": "bobemac", "ReviewID": "UR115937299", "Content": "This was our second visit to WDW and the WV. Last year we took our grandson, this year our granddaughter. The kids loved this place. We have stayed in a one bedroom villa, and there is plenty of room. We had a full kitchen that came supplied with all appliances and utensils. The toaster was not working, they replaced it with a new one immediately. Last year it was not as crowded. The small pool was overwhelmed this year. A negative was the constant testing of the fire alarm system all week. None of the operational controls for the properties are run by the property itself.There is a centralized control center which dispatches all support to the individual units. This can cause confusion and delays. The individual suites are amazingly quiet and private. Staying at the WDW Villas is like an oasis from the hustle and bustle of the theme parks. The decor and appointments are good and well suited to the NW USA during the intended era. The main lobby of the adjoining WL is simply breathtaking. The view from the roof is even more outstanding. The WDW cast members are very friendly and courteous. My axe to grind with WDW; there is no free Internet in any of their properties. You must pay $10/night unless you are a DVC owner. WDW also has stopped daily housekeeping support to all TS units exchanged from RCI. The transportation system at WDW is impressive. You never need a car. WDW will meet you at MCO with Disney's Magical Express, they also take your bags directly to your property seperately. We were able to get to the MK in ten minutes by boat. There are also boats and buses to everywhere on WDW. The grand kids were enthralled with the entire WDW experience. That's what it's all about anyway", "Date": "July 28, 2011"}, {"Ratings": {"Cleanliness": "3", "Sleep Quality": "3", "Overall": "4.0", "Value": "5", "Service": "4"}, "AuthorLocation": "Chicago,Illinois", "Title": "“Can't wait to go back”", "Author": "ms957traveller", "ReviewID": "UR115931085", "Content": "Not much can beat a three generation family vacation at WDW but staying at the Villas at the Wilderness Lodge was an additional bonus. It was nice to have the extra room and the Wilderness Lodge seems less congested and quieter than some of their mega resorts. Our only problem was lack of reliable Internet access. It's time for WDW to get with this century. Also it's wise to book your dinner reservations ASAP. Nothing's worse than having a hungry 3 year old at five pm and nothing available until 9 pm.", "Date": "July 28, 2011"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "Bordentown, New Jersey", "Title": "“stayed here 10 times and we will be back!”", "Author": "sueef", "ReviewID": "UR115416416", "Content": "Athmosphere is awesome..relaxing the minute you arrive. Staff is great. Whispering canyon restaurant is a must with children..especially for breakfast. Artists pointe restaurant is great gourmet food for the adults.", "Date": "July 16, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "5.0", "Value": "4", "Service": "5"}, "AuthorLocation": "Palm Harbor, Florida", "Title": "“Wilderness Lodge Villas still great”", "Author": "palmharbormichelle", "ReviewID": "UR115375062", "Content": "Have stayed here before and went back again. We love this place for the ambiance, friendly employees, great pool, proximity to the Magic Kingdom, and more. The pool slide was open until 10pm which was great. If you stay here, take advantage of everything - movies at night on the beach, the electric water parade at 9:30 at the beach, the erupting geyser every hour, boat ride to Magic Kingdom, etc. Take a look around the lobby at the villas - there are two train cars from Walt's backyard train on display. We are DVC members and I don't know how many times I have stayed here, but this is the first time I saw the train cars. We are always so wrapped up in the parks; make sure and take a day off to really enjoy whatever Disney resort you stay at. Kitchen and bathroom were well stocked. The room was clean, but there was a big black ant crawling around in the bathroom when we got there. Flushed him and saw no more bugs after that. I live in Florida and understand the bug thing (NOT BED BUGS); the bug guy sprays my house regularly and we still have the occasional bug. And make sure you watch out for the bats - they fly right past your head at night on the walkway from the main lodge to the villas. This place is surrounded by woods and water, so remember that when choosing your resort.", "Date": "July 14, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "5", "Overall": "4.0", "Value": "5", "Service": "5"}, "AuthorLocation": "", "Title": "“closeness to MK was stress free”", "Author": "lobsterlovers", "ReviewID": "UR115067461", "Content": "Stayed here in a one bedroom villa with my 2 kids through an RCI exchange and had the parents accross the hall in a studio. This was a great combination for privacy. I thought this was a great value of points compared to what it would have cost to pay cash. The villa was fantastic for us, made breakfast every day, inventive pull out couch where the cusions stay attached, easy to open, clean room. I missed having a view of something off the balcony. Could only see trees. It was so humid from first thing you couldn't sit out there. The staff was very switched on and helpful, no mistakes on billing, no lost dinner res;s, which I am used to from travelling mostly Carribean. A well oiled machine. Ran out of shampoo and called to ask if its supplied or do they sell it downstairs and they said it's not supplied but they sent up 2 weeks supply of everything. The main pool was packed and not much fun because of that. Bratty kids running loose. The villas pool was less packed but I had to keep telling my kids not to splash!! People were enjoying quiet relaxation. It would have been good if we could each go to different pools!! LOL I found the best feature of this resort the close walk to the boat shuttle from the villa (something other people complain about and I don't get it!) and the short, direct, ride over to MK which brings you right to the front gate. I think it took me just as long to walk to our rental car in the resort parking lot as it did to get to the boat dock. I rented a van and used it every day. A grocery trip, wallmart trip, other resort dining, and to other parks. Well worth it IMO. It took so little time to get to the other parks and resorts. good advantage to be able to drop the seniors off at the door then go park. Parking was easy everywhere and fast shuttles from parking. We took the boat to MK to Grand Floridian one night and it took an hour and a half.....boats also don't run if there's lightening!! Most dissapointing was the meal plan. I made a few in park dinner reservations and we had to get out of the parks around 3 cause it was 98'F. This left us with not what I would have liked for last minute dinner choices. Believe me, one night at the wispering canyon is enough. The second night I had an extremley overcooked steak and some chip and southwest dip app that tasted like dirt. I would have eaten more off property for some more fresher food options, probably half the price. They're not that far of a drive and I think would have been more enjoyable for all. Not to mention the 6 desserts left in our fridge on check out ....and thats with 2 kids!!! It would have been nice to have more dining options on site. I think my next choice would be the grand floridian as when we went there for dinner it is close to everything and offers more options...and no forest themes...I'm from Canada eh? no big deal, would rather have something more elegant. Yah what?? no free internet?? Hello?? What year is this???", "Date": "July 5, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Frisco, Texas", "Title": "“Great hotel and perfect for Magic Kingdom trips!”", "Author": "txwalkers", "ReviewID": "UR114614262", "Content": "Very Family-friendly place, very clean, lots of things to do, plenty of options for dining. The snack bar/quick service place by the pool has burgers, fries, chips, desserts, beer, chicken nuggets, etc and a patio option. We loved using the boat to get to Magic Kingdom quickly!", "Date": "June 21, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "5.0", "Value": "4", "Service": "5"}, "AuthorLocation": "trinidad w.i.", "Title": "“perfect for families”", "Author": "TrinidadW_i_Gillian", "ReviewID": "UR113209474", "Content": "we had a two bd room villa from an rci points exchange. the villa was clean and well equip. the staff at the resort was extremely helpful. we had requested a room near an elevator but arrived late from the drive up from miami and was given a room that was a long walk from the elevator, almost to the end of the building however the costumer service rep relocated us the next day to a perfect room, we did however have to wait so we could not plan anything for that day but it was well worth it. shuttles to and from the parks were prompt and convenient. we had rented a car but did not use it much. the dining plan was good for a first time stay at a disney resort, but i would not use it again, too much food, and the room had a full kitchen. i would prefer to make reservations at the better restaurants and pay. the main pool was always crowded but the smaller one by the villas was private and less crowded. extra magic hours was the best. if ever i am doing disney parks again i would definitely stay at a disney resort for the magic hours. disney parks are too crowded with little kids as compared to the other parks. i could probably handle it once every three years. overall the resort was great except for the overcrowded pool.", "Date": "June 13, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "4", "Overall": "4.0", "Value": "3", "Service": "4"}, "AuthorLocation": "Maryland", "Title": "“Nice Location, Clean and Comfortable”", "Author": "PaxExplorer", "ReviewID": "UR112563393", "Content": "I chose this location because of the convenience for participating in the 70.3 Ironman event at Fort Wilderness. I received a somewhat favorable rate being a repeat visitor to Disney. The Wilderness Villa’s are an extension of the Wilderness Lodge, essentially I found out they are part of Disney’s timeshare program but was able to rent one because of availability. We rented a Queen Studio room, which provided us a fridge (bigger than the standard micro-fridge), microwave, toaster, and coffeemaker. The room itself was non-descript basically about 2/3 the size of a standard Embassy Suite room. It had a sofa and TV and standard bathroom, nothing fancy. The one minor annoying aspect was the placement of the TV inside the console and could only be viewed from the bed and not the sofa. The grounds surrounding the lodge are very nice and cozy; there are two pools, one near the villa which is smaller and quieter then the main pool at the lodge which is only a short walk. There are hiking and biking areas to enjoy, there is a also a non-swimming beach area . One the main perks I enjoy staying on a Disney property is the extended park hours for guest and if you want access for free parking throughout Disney. There are busses that run from the grounds you just need to expect it will take about 45 minutes to arrive to your destination. This is assuming you need to wait the max time of 20 minutes btw busses. If you looking for a clean, quiet, comfortable room this is great but don’t expect any great features in the room.", "Date": "June 10, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Richmond, VA", "Title": "“Can't wait to go back!”", "Author": "brianz09", "ReviewID": "UR111677660", "Content": "Stayed for 7 nights in a one bedroom villa, with a slight view of Bay Lake. Room was spacious and clean, and did not disappoint. Loved the pools and relatively quick trips to MK.", "Date": "June 5, 2011"}, {"Ratings": {"Cleanliness": "2", "Sleep Quality": "4", "Overall": "2.0", "Value": "2", "Service": "3"}, "AuthorLocation": "Mickleton, New Jersey", "Title": "“Could be better...”", "Author": "ILoveMickey654", "ReviewID": "UR111190752", "Content": "My family and I stayed here over president's weekend and the first impression was not the best. We got to the room and it didn’t feel like Disney, it had a musty smell, but air freshener got it away. I found the room dirty and the sheets were stained, we called house keeping and they fixed it. They also didn’t give us pillows are the fold out couch, we called house keepingcame about 3 times the first day. When we went onto our balcony we saw bees and house keeping didn’t do anything! We were annoyed and tried to move to any other resort but they were all booked, but the great things were the pool, except that the geyser was closed ☹, and the walk from villas to the boat was long and annoying also. The pool was warm was nice and the mini café was convenient. Okay resort but will choose differently next time.", "Date": "June 2, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Lafayette, Louisiana", "Title": "“Loved the Villas at the Wilderness Lodge”", "Author": "John522", "ReviewID": "UR110230121", "Content": "The Villas at the Wilderness Lodge are Great!! We rented a two bedroom and loved the amount of Space for the six of us; myself and wife, son and daughter-in-law and two grandchildren. It was so nice to have washer and dryer in the room. We didn't use the kitchen to cook, but it was nice to have the space and a large coffee maker. Trnasportaion to the Magic Kingdom was really excellent. The grandchildren loved the beach and swimming pools. Whispering Canyon Cafe is also great. Have the Skillet! We did online check in and it was quick and efficent. The only downside was the long walk to the room. The fitness center where my granddaughter had her first facial was also very good. The Staff was always warm, friendly, and helpful. The best part was that the Villas are very quiet and relaxing after a long day at the parks.", "Date": "May 28, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Stratford, NJ", "Title": "“Great Hotel...Great Location!”", "Author": "allhandsondecker", "ReviewID": "UR108294888", "Content": "stayed club level. had a view of MK fireworks everynight! The staff was wonderful and the hotel was amazing. Plan to stay there again next trip :)", "Date": "May 15, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Solihull, United Kingdom", "Title": "“Great hotel, cant wait to go again”", "Author": "karensolihull", "ReviewID": "UR107499165", "Content": "Have been coming to the villas for the last 12 years or so as a member of DVC. Never had any complaints whatsoever. Rooms are lovely, pool area lovely (although we use the villa pool rather than the main pool which gets a bit hectic) Location is perfect and is so easy to get out and about in Disney. The only very slight complaint is that they are letting the trees continue to grow higher and higher. This gives a lot of shade by the villa pool so would be a little chilly from time to time, we prefer the sun! Also the trees were right infront of some rooms which would make them a little dark. Overall this is a great place to stay and we're looking forward to going back next time.", "Date": "May 9, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "3", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Stafford, Virginia", "Title": "“Our favorite of all Disney property!”", "Author": "Coastie16", "ReviewID": "UR106392609", "Content": "Spring Break!! My wife and I stayed here for the first time in a 1 bedroom - with no kids!!. We got the room location and view as requested - back side viewing Bay Lake and on a high floor. The room was clean, towel mouse on the bed and in the kitchen - the classic Disney touch! We had just purchased a new bed, so the Disney mattress was, to say the least, was a bit \"uncomfortable\" thus the \"3\" on sleep quality. We also took advantage of the refillable mugs for about $15/mug, well worth the cost on long stays; unlimited cold/hot drinks for your entire stay. We enjoyed the movie on the beach and the light show every night. Great relaxing atmosphere; ground floor area has very comfortable furniture for \"just sitting\" and/or playing checkers/cards. Wednesday through Saturday, Wonders of the Lodge tour is available at 9AM. The guide \"cast member\" explains everything in explicit detail how Disney theme is used throughout the resort - well worth the 1 hour. Guests checking in can also sign-up to assist the Ranger for raising the flags at 8AM. This is extremely popular and not a guarantee, if selected, the view from the top of the Lodge, we have been told, is fantastic. Please note, a \"connecting\" room is between a studio and a 1 bedroom with a lock-off.", "Date": "May 1, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Commerce Township, Michigan", "Title": "“Nice stay at the Wilderness Lodge Villas”", "Author": "MIDisneyPrincess", "ReviewID": "UR103635527", "Content": "Just returned from a 4 day stay at the Wilderness Lodge Villas, April 4-7. The resort itself is very beautiful....we all know Disney doesn't miss a detail. The staff that I interacted with were very friendly and went out of their way to help. The villas is a separate building from the main lodge but an easy walk under a covered walkway. The resort is large so depending on where your room is, you can end up having a longer walk to the main lobby/pool area...just a note in case some of your family members have any health issues...make sure you request a room closer to the main area if that may be an issue. The Roaring Forks cafeteria is pretty basic really....a few salads, sandwiches and the basic hamburger, pizza etc. It doesn't have the choices that the moderates/values cafeterias do at all...in fact, I haven't found a deluxe/DVC resort that does. We never encountered any issues with the transportation ... both the buses and ferry were very prompt. Overall, we had a great time at the Wilderness Lodge and wouldn't hesitate to come back at all.", "Date": "April 11, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "4", "Overall": "2.0", "Value": "1", "Sleep Quality": "3", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Palm Harbor, Florida", "Title": "“Way over priced and terrible service”", "Author": "Stacimaee", "ReviewID": "UR102791488", "Content": "I am a florida resident and have had the luxury of staying Disney several times in my lifetime. I have a 5 year old boy and have stayed at the value, moderate and luxury resorts. By far this stay, the most expensive one, was the worst trip to Disney I have had. Its seems at Disney the more money you spend on a room the less amenities they have and the poorer customer service you get. Examples: only 2 pools one with slide. At the mod and value resorts there are pools at about every building. There are a wide range of food choices at the less expensive hotels. As far as customer service..we were actually told when asking for some napkins to go buy them in the gift shop or to go tho the womens bathroom and pull them from the dispenser. I wil never return to this hotel again! Big disappointment at a big expense!", "Date": "April 4, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Albany, Georgia", "Title": "“It's always been magical”", "Author": "William1001", "ReviewID": "UR102578168", "Content": "We have been DVC members since 2001, and this is our home resort. It fits us to a \"T\"! Families with small children might not fine it as enchanting, but for the 9 and up, crowd it's perfect. The first week of December is the best time to visit Walt Disney World!", "Date": "April 2, 2011"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "Charleston, South Carolina", "Title": "“Great experience at Wildnerless Lodge Villas”", "Author": "Katelewis97", "ReviewID": "UR96798148", "Content": "This was our first time staying on property and it was awesome. We rented a villa so we could have a kitchen/laundry and do meals in, pack cooler for the day at the park, etc. It went off without a hitch. We love the lodge and our villa was in close proximity to the bus depot (which I requested and they granted). I think my only negative about the property is that the kitchen and some of the furnishings seem outdated- even my 5 year old said something about it. We will definitely stay here again!", "Date": "February 15, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Bentonville, Arkansas", "Title": "“I Love this Place!”", "Author": "CLR4321", "ReviewID": "UR95217017", "Content": "We stayed 2 nights in the Wilderness Lodge Villas in the middle of our Disney vacation (stayed in a regular room at another Disney resort for the rest of the vacation). The lobby was beautiful with totem poles, a huge fireplace, and the beginning of a stream that led outside on to a river with a waterfall out in the pool area. It was spectacular! The villas had their own pool and jacuzzi aside from the main pool for the main part of the Wilderness Lodge. In the common area in the villas building, there were a few fireplaces with comfy chairs and tables with checkers and chess to play. We had a 1 bedroom villa that had a jacuzzi tub and sink in a separate part of the room inside the bedroom, plus a separate bathroom with a large shower. The kitchen was fully stocked and included a stove, dishwasher and fridge. Our toaster would not pop up by itself, and maintenance brought us a new one right away after we burnt some bagels by mistake. The washer and dryer was very convenient to have in the room. I will definitely consider this resort again if I am booking a villa. The proximity to the Magic Kingdom was awesome too!", "Date": "February 1, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Findlay, Ohio", "Title": "“Grand children had a ball”", "Author": "cherylg57", "ReviewID": "UR93950216", "Content": "We stayed in a 2 bedroom villa with 4 adults and 2 children in August. This trip was a birthday present to our 5 year old grand daughter. The weather was stifling and humid but the ceiling fans helped alot with the comfort factor. There was plenty of room in the villa for everyone. The bedrooms were spacious and comfortable with huge closets. The kitchenette had everything we needed for our 5 day stay. We ordered groceries from The Garden Grocer.com and they were delivered to our room upon arrival. The grandchildren espically enjoyed the carved animals in the lobby and had to say good morning to each and every one. I only have one complaint and that is with housekeeping. They came when the children were napping and said they would come back later and did not come back unitl the next day. I called the front desk and they sent up towels, but the trash and used towels was not collected until late the next day. It was a small detail to an otherwise great vacation. This villa has it all. The pool is smaller than the pool at the lodge, but you can use either. It is a long walk to the buses and dining areas, but it gave the kids a chance to run off some built up energy. Adults, not so much. The staff was helpful and friendly. They answered all our questions in a pleasant manner even though I am sure they answered the same question over and over every day. The employee in the gift shop was very friendly to the children. I am not sure I could be so cheerful after a long day. The boat ride to and from The Magic Kingdom at night is very calming with the night breeze coming off the lake. We highly recommend this villa!", "Date": "January 21, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Chicago", "Title": "“Great Place to stay!”", "Author": "ChicagoKman", "ReviewID": "UR93426398", "Content": "The Villas are my family's favorite place to stay when we are at Disney. I am a DVC Member and this is my home resort. The room was in a great location with the cast members able complete all of our requests. The room was a two bedroom villa and was very clean and spacious. I only had a couple issues while on property, 1.) The Host at the Whispering Canyon Cafe was very rude. I was trying to get on the wait list for a party of ten. He said the wait would be at least an hour and a half, I said ok put me on the list. He then asked if my total party was in the lobby. I said no but they were almost back from the parks. I was then told I could not be placed on the list until all of my party was there. That is ridiculous that I can’t even get on the wait list when the wait is over an hour! 2.) Another issue was the DJ at Magic Kingdom on New Year's Eve. I herd the same song about 12 times with in a 2 hour span; I think its time for a new DJ 3.) Also what happened to the cast members saying \" Have a Magical Day\"? I didn’t hear that once when I was on my vacation. Over all the Villas at The Wilderness Lodge is a great place to stay, But I think that the Disney cast members are loosing their Magic.", "Date": "January 17, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "United Kingdom", "Title": "“Wonderful resort for Christmas!”", "Author": "gemmybear83", "ReviewID": "UR93154201", "Content": "We rented dvc points and stayed in a studio for 2 nights, we much preferred the studio room to the concierge room we stayed at Wilderness Lodge in 2009. We were in a disabled room so no bath and a big walk in shower, I guess we were put in this as we were only staying a couple of nights. If we had stayed longer we would have asked to be moved to a regular room as there was no safe in the room due to the change in layout. The positives was the studio was much bigger than a regular studio! The only downside of the studio was there was some litter left in the waste basket from the previous guests. Cast members were awesome, nicest ones we have come across and transportation to the parks were great, we loved the boat across to Magic Kingdom. The buses shared with the Grand Floridian and you were picked up/dropped off at WL first. Ate at roaring forks a couple of times and was great as always. Magical express was on time for the first time also! Would love to stay here again in the future - the resort always feels like we are coming home!", "Date": "January 16, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Sleep Quality": "3", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Palm Harbor, Florida", "Title": "“Love the Wilderness Lodge Villas”", "Author": "palmharbormichelle", "ReviewID": "UR88378454", "Content": "Stayed here in a villa studio for the last night of a 6 day trip to Orlando. Am a member of Disney Vacation Club and hadn't stayed here in 6 years. Still a great place. Son (11) swam in pool and enjoyed it. Loved the Electric Water Parade - if you stay here make sure you go to the beach around 9:30pm to view the great floats and hear the fun music. Room was clean. Fan in bathroom was very loud and squeeky. People next door let their kids scream from 7am to 11 pm. Otherwise all nice. Had lunch at Whispering Canyon - still a favorite place to go. Great food and good service. Resort nicely decorated for holidays. All resort employees provided great service as usual. Love this place.", "Date": "November 27, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Greensboro, North Carolina", "Title": "“Perfect for a holiday visit!”", "Author": "RetiredNana08", "ReviewID": "UR88204732", "Content": "We stayed at the Villas Wilderness Lodge in a Studio for 4 ngts, 11/18 - 11/22. Although I'd been hesitant to stay here, my friend very much wanted to try the Resort and we were fortunate to find a studio available during a very busy time when the resort was sold out. The studio was larger than expected and in very good condition. It was a corner room with a balcony and side window (view of quiet pool), which made for a lot of natural light. VWL does not boast great views, but ours was quite nice: the lake through pine trees, but the trees were not dense, so we were able to see and hear the Electrical Water Pageant if we were in the room when it passed at 9:35 each night. We could also see the top of the Magic Kingdom fireworks (Wishes) from the the side window and balcony. We found the theme at the Villas to be much nicer and more understated than the Lodge - The Villa rooms and public areas are rustic, yet with a soft elegance. Rocking chairs inside and out - fireplaces and lovely areas to sit or gather. We had to contact a housekeeping manager for an issue unrelated to housekeeping/room cleanliness (one of us had a medical issue and we asked for a bit later check out time, which is nearly impossible to accommodate in the Villas) - she went out of her way to assist us. We found Cast Members at the front desk, shop and dining, to be excellent - warm, kind and very friendly. We would not hesitate to recommend the Villas (not the Lodge due to narrow hallways, rooms in need of refurbishment, noisy). Both the Villas and Lodge were decorated for the holidays by Friday morning (11/19) and truly beautiful!", "Date": "November 25, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Edmonton, Alberta", "Title": "“go Disney”", "Author": "Dharmaloo", "ReviewID": "UR86569648", "Content": "We used our RCI points to book here and I was a little worried. My worry was wasted! We were in a one bedroom suite with a full kitchen as promised. It was very well equiped. We ordered groceries before we left from Gardengrocer.com and that worked out great. It was delivered as promised and when they did, they sent me a text. The hotel stored the cold items in one of their coolers until we picked it up from them. If I were to do it again, I would have bought more food from them and took more snacks to the parks and had some items for dinner. We chose not to get the meal plan because we wanted the flexibility. We ate at the Roaring fork once - fun, the fine dining restaurant - OMG excellent! and the quick service got old very fast... I think because we were RCI they only came in once a did a quick clean - basically empty the garbages and change towels. The washer and dryer were nice to have. I brought extra soap from home. We were on the ground floor so we didn't have a view. It was quite except for one night the neighbors work us up. But... we would go so hard during the day we went to bed early. A couple times, we were work up by the electric parade on the lake - is that at 10pm - so take that with a grain of salt. We made a special effort to stay up for the fireworks and that was definately worth it. This is a great property to take advantage of the Disney transportation. I loved to take a boat whenever we could. The only thing I could complain about is the air conditioning - it definately works. We would run through the hallway to our room! We turned it off in our room and just used the ceiling fan.", "Date": "November 9, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Schertz, tx", "Title": "“Great place to relax after a hectic day at the park”", "Author": "mickey79", "ReviewID": "UR85407894", "Content": "beautiful setting almost makes you think you left florida. Boat ride to Magic Kingdom was pleasant. Studio was great.", "Date": "October 30, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Raleigh, NC", "Title": "“Another incredible stay at the Villas!”", "Author": "RustyGriswold", "ReviewID": "UR83145868", "Content": "We had a room facing the woods/bay lake--very peaceful. The 2 bdrm villa is a great size, plenty of room for when you need downtime and you are not on top of each other. Used garden grocer to get grociers delivered so could utilize the full kitchen for breakfast. Quick boat ride to magic kingdom. The grounds and pool area a beautiful and truly feel like you are getting away from the hecticness of the parks when you return--we will be back, no doubt.", "Date": "October 12, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "5", "Overall": "3.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Oak Ridge, North Carolina", "Title": "“make sure you lock up your valuables.....they like to steal IPods from the room”", "Author": "APPGirlOakRidge", "ReviewID": "UR79529730", "Content": "A great day at the Magic Kingdon on 9/8/10 turned to crap when we returned to our Villas to find that an Ipod had been stolen. Front Desk staff wanted to claim that it had been \"lost\" and wiped thier hands clean of the incident. Now we are dealing with police reports and insurance claims. Takes away from what had been a great trip.", "Date": "September 14, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Austin, TX", "Title": "“Another wonderful stay at the Villas”", "Author": "BronteReed", "ReviewID": "UR78973875", "Content": "We stayed here for a week for our 10th Anniversary in a One Bedroom. As usual, the room was clean and well-kept. The staff, especially bell services, were wonderful and friendly. We were able to eat at the Roaring Forks several times and had good experiences always. The hand-tossed salad is especially good and addictive, lol. Their sandwiches are fresh and HUGE - you can easily share with a small child and save some money or save a meal credit. The store by the lobby is one of my favorite resort stores at Disney. They have a great selection of practical and classy clothing, a decent selection of grocery items, a few new bestseller books in case you want something to read by the pool, and a nice selection of toys and other items. If you're a DVC member, you can also pick up free dvd rentals here. And the lobby for the holidays is just AMAZING! It's one of the best at Disney - very romantic, cozy, and definitely makes you feel like you want to grab a chair by the big fireplace and just relax. It's a wonderful home away from home!", "Date": "September 10, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Maryville, TN", "Title": "“Nice, \"LARGE\" place”", "Author": "angi1968", "ReviewID": "UR67518087", "Content": "My 16 year old son and I just returned from a 7 night stay at the Wilderness Villas. My son and I shared a studio room with a friend of mine and her 16 year old daughter. The room was spacious...my friend and her daughter slept in the queen-sized bed, I slept on the sofa bed, and my son slept on a twin-sized air mattress on the floor. There was plenty of room to walk around in the room even with the air mattress on the floor. The commode and tub were separate from the bathroom sink/vanity which made it nice in the mornings! There was a small kitchen sink and under-cabinet refrigerator in the room along with a coffee pot, microwave, and toaster. Since we were using the Disney Dining Plan we didn't need anything more from a kitchen. The room was quiet, and we were never bothered with any noise. Check out was awesome! We used the Disney airline check-in service which allowed us to check our luggage and print our boarding passes without leaving the resort! We were very thankful to already have those boarding passes when we arrived at the airport and saw the long lines for for Air Tran! Now for the \"not so positive\" things. 1) Our room (room 3562) was the last room in the longest hallway of the Villas! We were at least 1/4 of a mile away from the bus stops, so by the end of the day, that 1/4 of a mile felt like another 14 miles!!! If you have the quick service dining plan, you should also plan on walking a long way to the Roaring Fork restaurant because it's located on the back side of the Wilderness Lodge near the pool...this is farther away than the bus stops. There is a boat available to take you to/from the Magic Kingdom, but from our room, it was a good 1/2 mile walk. I am not exaggerating these distances....I felt like I was in Vegas! 2) You don't always get what you request. My friend has been a member of DVC since 2002 and commented that she had never had such a problem with her reservation. She made her reservation in November and we traveled in June so the reservation was made in plenty of time. When we arrived at the Villas, she was given a handicap accessible room which had a bathroom where the sink/vanity was in the same room as the shower and commode. This did not work for us since no one would be able to use the sink/vanity if someone else was in the shower. And, if you have small children, there is no tub in the handicap accessible rooms. She requested a room change and that is when we were given the room in BFE! On her reservation, she had requested a room near the laundry facilities which at the Wilderness Villas is near the front door on the first floor and she reminded them of this. She was informed that they would try to accommodate her, but they could only work with the Studio rooms that were coming available from people checking out on that date. So...as the story goes....your requests don't really mean a lot. 3) The laundry facilities are very lacking. There are 2 washers (one of which was broken the entire time we were there) and 4 dryers. Not much for a facility the size of the Wilderness Villas. I know that this doesn't mean much if you're staying in one of the larger rooms since they have washers and dryers, but it does if you're in the studio room. Who wants to spend 2 or 3 hours doing laundry with there one washer? 4) Our room did not have a view. I have read other reviews that commented on the view of the lake, but our room had a view of the service road. Overall, our stay was very good and I would go back to the Villas, but it wasn't all \"magical\" like some of the other comments.", "Date": "June 14, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Kokomo, Indiana", "Title": "“Loved it!!!!”", "Author": "hcorrell", "ReviewID": "UR66512583", "Content": "My family (9 of us) stayed in a 2 bedroom villa at the Wilderness Lodge. We were so impressed with everything there. The staff was friendly and helpful and the room was beautiful. We could see the sunrise from our balcony each morning. There was so much room that the 5 children (under the age of 5) all had somwhere to sleep and all slept well. The best part of our ENTIRE Disney trip was the Whispering Canyon Cafe'. We celebrated my son's 5th birthday there and all the kids are still talking about how great it was. Mr. Rafael was our waiter, but really he was an entertainer that brought food. He made each one feel special and especially my son. All the kids think he is a rock star now. We had to go back each day the rest of our stay to say hi to him. The kids want to go back to see Mickey, but Mr. Rafael is 2nd that they want to see. I shoudl mention that the food was the best meal we had while visiting as well. The water launch was excellent to Magic Kingdom and we didn't wait long coming or going at any time. We LOVED the boat where we didn't have to collapse the stroller down to get across. My family and I had not been to Disney in 10 years and assumed we would come back in another 10. However, because our stay was so easy (Magical Express and help with luggage was AWESOME) we are thinking about coming every year and staying at this resort. Thanks Disney for helping my family make some really great memories!", "Date": "June 5, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "4.0", "Value": "3", "Sleep Quality": "3", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Buffalo, NY", "Title": "“Beautiful and convenient (to the Magic Kingdom).”", "Author": "TrpReviwr", "ReviewID": "UR63525356", "Content": "Our family of 4 (mom, dad, 5-year old girl, 1-year old boy) stayed here for a week in late April. We stayed in the lodge last year and wanted more room, so we tried the villas this time. Getting to the Magic Kingdom (where we spent most of our stay) was so very convenient (short ferry ride). Despite this convenience, we felt that the villa side of Wilderness Lodge was very quiet, peaceful, and almost another world. We never heard any other families while in our villa. We felt like we had the place to ourselves. But the lodge and all of its conveniences was a very short walk away - even with 2 young children. We would get breakfast in the lodge at the counter service place and bring it up to our room many mornings. This was easy and convenient. We stayed in a 1-bedroom which worked out perfect for us. We had a little patio with a woods view near the villa pool. I was a little nervous about being so close to the pool, but we never found it to be noisy at all. We enjoyed sitting out there in the evenings and looking at the stars and trees. The beds were not particularly comfortable, but they were not terrible. Our villa was stocked with Palmolive dish soap, and Tide laundry detergent in addition to the usual supplies (pots, pans, plates). Housekeeping was very accomodating of our schedule without any special requests on our part. The villa pool was far less busy than the main pool at the lodge. The theming was very well done at this resort, and it made the place even more special. We would not hesitate to stay here again, although since we are curious, we may try another resort next time. My only complaint is that DIsney should really have free wi-fi at their hotels!", "Date": "May 7, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Rome", "Title": "“I wish I never had to leave”", "Author": "jnrcwdw1", "ReviewID": "UR63212078", "Content": "I have stayed here a couple of times. Before the Wilderness Villas, it was always the Wilderness Lodge. I always enjoyed my stay there as well. Trying to tell of how wonderful it is is a difficult thing to do. It is a beautiful place. They have made it a place that you always will remember and will long to go back to. There is not a restaurant in this hotel/villa, but there are in the adjoining Wilderness Lodge. I highly recommend the Artist Point. I have eaten there every stay.", "Date": "May 4, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "San Antonio, Texas", "Title": "“Outstanding Property”", "Author": "bobemac", "ReviewID": "UR62587351", "Content": "We took our five year old grandson to WDW, and stayed at the Villas. You are so close to everything, just a boat ride to the Magic Kingdom. The one bedroom has plenty of room. There's a fully appointed kitchen, two flat screen TVs, and beautiful themed decor. Everything worked. The employees were all very friendly. Our grandson got to raise the flags onthe roof in the morning. He got a kick out of that. Great building, quiet and comfortable, with nice views of the secluded Villas pool and hot tub. Lots of flora and Fauna around. The only negatives was no maid service, and $10 a day for HS ISP.", "Date": "April 27, 2010"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "", "Title": "“Awsome”", "Author": "VivianS2", "ReviewID": "UR57829827", "Content": "We went with freinds we got a dubble room. There were bunk beds in the room.", "Date": "March 5, 2010"}, {"Ratings": {"Cleanliness": "4", "Overall": "4.0", "Value": "2", "Service": "3", "Location": "5"}, "AuthorLocation": "Florida", "Title": "“Mickey knows how to do it...”", "Author": "FloridaTruthful", "ReviewID": "UR52228868", "Content": "Disney has the magic mastered, but there can still be imperfections. During our week stay the AC broke, the dishwasher had to be replaced, the pump on the whirlpool tub was replaced, and the light/exhaust in the master bath was broken. These villas are dated, but if you're interested in a wilderness experience, you'll get it here. I was disappointed that the only thing the front desk manager gave us for all of our maintenance inconvience was a fastpass that we didn't even need/use because we were there when the parks were not crowded. You can't beat the Disney bus service, the Extra Magic Hours you get by staying on property, and the total Disney immersion you feel when staying on-site. Is it worth the money? Debateable. Have I experienced nicer resorts in Orlando? Definitely! Would I stay here again? Certainly.", "Date": "December 31, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Erie PA", "Title": "“Wow, Wow, Wow - Pure Delight!”", "Author": "MookiEriePA", "ReviewID": "UR51677156", "Content": "We drove to Disney for a vacation 12/6-12/12/09. We were booked in Kidani Village but had lunch at Whispering Canyon on our first full day. Wow. We took the boat over from Magic Kingdom and it was fun and easy. Our jaws dropped when we walked in the place. It's beyond gorgeous. The lobby was towering with the biggest Christmas tree we had ever seen and thick, heavy garland and twinkling lights. Everyone seemed friendly and relaxed. Soft, traditional holiday music played in the background. That was it, it was love at first site. When my husband went to check in at the cafe, I visited the concierge and begged for a room transfer. Wow! talk about accomodating! They went well over and above to arrange it for the following day. We left Kidani early and checked in at the Wilderness Villas. The process was quick and painless. They took our cell number and texted us when our room was ready. We could not wait to see it. Wow! What a room! The Villas are a short walk from the main lobby under a covered walkway. Our room was around the center atrium. The decor was stunning. Garland and twinking lights the whole way. Short walks all around. Oh, and the scent... Have you ever been in the woods after a rain, surrounded by ferns and smelled that fresh, earthy smell? Yep, it smells that way on the walk to the Villas. The room was a one bedroom and HUGE. The kitchen was well stocked with real dishes and cutlery (Kidani had a few paper plates and plastic ware). The master bedroom was huge with an extraordinarily comfortable king bed. The kids loved the sofa bed. We all loved the huge jetted tub, separate shower, and plentiful storage. Everything worked as it should. Having a washer and dryer was wonderful. It was blessedly quiet and so convenient to everything. The busses worked very well and the boat was a delight. We loved the pools and hot tubs. The kids enjoyed the water slide and the bubbly water in the second pool. We didn't use the health club but it looked very clean and well equipped. We at at Whispering Canyon twice and that was fun. Roaring Forks was quite nice and the food tasty. Our favorite food was Artist Point - our waitress was fabulous and the food divine. We brought our 6 year old and 12 year old and they were warmly welcomed. To summarize, we adored the Villas at Wilderness Lodge. They were beautiful and so convenient. The staff was friendly and superb. The Lodge was very kid-friendly. I can't say enough positive things and we are huge fans. The Christmas decor was utterly breathtaking.", "Date": "December 22, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Michigan", "Title": "“I want to live there!”", "Author": "MattHMichigan", "ReviewID": "UR48246780", "Content": "Absolutely the best resort I have ever stayed at! I loved the theme, space, atmosphere and everything about it. I can honestly say there is nothing I didn't like. If you or anyone in your family like the outdoors and log cabins this is your place. Even if you don't like those things you should still stay just for the laid back atmosphere of this place.", "Date": "November 1, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Toledo, Ohio", "Title": "“Perfect Halloween Treat!”", "Author": "OhioTea", "ReviewID": "UR44058621", "Content": "OUTSTANDING! My reaction was simple, jaw down, eyes up! There is so much detail, and things to see here that you don't even know where to begin! This hotel is a theme park unto itself! The rooms and bedding was 5 stars, as were the staff. Not one bad thing to say, everything was great! On the grounds, you can rent things like bicycles, do so and enjoy a ride around - we saw bunnies, and even a deer while riding around the grounds! There is a boatlaunch to the Magic Kingdom here, making this resort ideal if you want to do any of the special Holiday events at the Magic Kingdom! We attended the Disney Halloween party, and LOVED it! There are free mini events hosted at the hotel, such as a discussion about trains hosted by some of Disney's own trainer engineers!", "Date": "September 24, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Location": "5", "Rooms": "4"}, "AuthorLocation": "ropqsr", "Title": "“Terrific Stay”", "Author": "ropqsr", "ReviewID": "UR42713415", "Content": "Just returned from a 6 day stay with my husband, 4 year old, and in-laws. We stayed in a two bedroom villa which was perfect for us. Travel from the airport to the lodge was a breeze. We took the magical express from the airport. There was no wait and our bags arrived shortly after we did to the hotel. Return to the airport was even easier. We had a late 8PM flight on the day of check out and it was so nice to be able to check our bags for our flight that morning and get our boarding passes right in the hotel lobby. They held our carry-ons for us while we enjoyed our last day in the magic kingdom. Villa: The villa itself was very comfortable with a great layout for our family. Each bedroom was spacious and clean (one with king, second with two full beds) with large closets and baths. The kitchen/combined living room was well stocked. There was laundry detergent, paper towels, coffee maker etc... It was great after a long day at the parks to have the living area to relax. Our son loved it. Housekeeping came daily. The only drawback to the villa was that we were on the 5th floor and VERY far from the elevator. I'm a fit person but after walking in the parks all day then walking up and down that hallway all week , it got old fast. We ordered groceries ahead of time at gardengrocer.com. They were waiting for us when we checked in and were delivered to our room when we checked in. Wilderness Lodge in General: A wonderful place. We researched for a while and after stopping at many of the other hotels to compare during our stay we were so happy that we went with the Villas at Wilderness Lodge. The grounds were beautiful. My son loved seeing the rabbits, ducks, the geyser, the lobby is breathtaking. It was great to take the boat over to the magic kingdom or contemporay and hop on the monorail. The bus service to the other parks was also great. The pools were very nice. The main pool was very crowded at times. Liked the pool at the villas better ...smaller/quiet. Cubs Den: We also made a reservation one night for our son to have dinner on his own at the cubs den while my husband and I had a date. He absolutely loved it. The space itself is small but they have many toys, computers, sand pit for the kids and they eat dinner there as well. He was very content here and we had a wonderful time off on our own for a few hours. We found the price of $12/hour to be very reasonable. Dining: We were pleasantly surprised by the dining choices at Disney. We didn't go with very high expectations. Whispering Canyon in the lobby was an excellent choice for dinner our 1st night. Several of us got the all you can eat BBQ and it was great. We had a wonderful meal at the California Grill our last night. The fireworks were amazing with the most spectacular view. We also had a very nice lunch one day at the Animal Kingdom Lodge. The food in the parks was ok. Chef Mickey's for breakfast also just ok. Our son LOVED getting to see all of the characters here. So glad we got him an autograph book. In the parks you have to wait in line to see them but at Chef Mickey's all the characters come right up to the table. It was great; lots of good pics. The Roaring Fork at the Wilderness had great quick options. We tried to do a quick service at the Polynesian one day and left when nothing looked good to us. Territory lounge at night was also a great place in the lobby for a drink. Wished we could've bought beer at a reasonable price to keep in the fridge in the villa ($5 for one can) steep in the lobby shop. Wine was reasonably priced but limited selection. Gym: The gym was great and modern and on the 1st floor off the lobby in the villas building. All the cardio, wts etc. You could access it 24 hrs/d. My husband worked out just about everyday at 5AM. My husband and I enjoyed some wine in the lobby at the Grand Floridian one night while listening to a jazz band. Beautiful lobby. It seemed less geared towards children but really was pretty. Might be a better place for families with little girls. Lots of little girls dressed up taking pictures in the lobby while we were there. Loved the white lobby and they had a great selection of wine. Couldn't be any closer to the magic kingdom here either. We also loved seeing all of the animals at the Animal Kingdom Lodge while we enjoyed lunch. We debated booking here at first but after visiting I'm glad we didn't only because it really is so far away from everything else at Disney. All in all: wonderful stay! This was our sons 1st trip to Disney so we wanted to do it right and do everything we thought he would enjoy the most. I highly recommend the Villas at Wilderness Lodge. We had a wonderful family vacation!", "Date": "September 18, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Boca Raton, Florida", "Title": "“Can't wait to stay here again for the Holidays”", "Author": "WeLoveDisney123", "ReviewID": "UR39488038", "Content": "this review is a little late.. but better late than never! my husband and i are huge fans of the wilderness lodge and it's ambiance. we decided to stay in the villas in december because we read that the holiday decorations at the lodge are spectacular. they definitely are a site to see!! not only was the grounds and lobby of the main lodge beautifully decorated, but they carried the theme on nicely through to the villas. since we were staying 4 nights with our two young children (2 and 1) we decided to book a 1 bedroom villa for the space and kitchen. the carpets had just been replaced throughout the entire villas so they were all nice and clean.. it was great! the villa itself was clean and comfortably furnished. i was a little worried that they wouldn't come clean up everyday because i had heard that if it was a villa housekeeping only comes every few days.. this isn't the case if you booked the room without being a vacation club member. housekeeping still came to clean up the room every morning. we had a ground floor villa and the back patio was AMAZING! it was quiet and the kids sat on the grass and colored while hubby and i enjoyed a drink! we've stayed at the wilderness lodge 4 times and staying in the villas for the first time we could definitely see a difference. it's much quieter and relaxed. you can manage to find a seat next to the fireplace to enjoy a book. they also have a great room with chess and checkers which we imagined that we would enjoy once our kids are old enough. my husband and i definitely said staying at the wilderness lodge villas should be a yearly holiday tradition!", "Date": "September 1, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Location": "5", "Rooms": "5"}, "AuthorLocation": "white plains", "Title": "“Welcome Home - Great Destination !”", "Author": "familyof4wp", "ReviewID": "UR39463033", "Content": "We are steady travelers to Disney World and love staying at the Villas at Wilderness Lodge. My 2 children and husband all look forward to walking in and hearing \"Welcome Home\" from the greeter. The 2 bedroom villas are spacious and clean. The restaraunts are all fun, especially the whispering canyon, the kids love all the action there. We love the location which is accessible to all the attractions via boat or bus.", "Date": "September 1, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "4.0", "Value": "3", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Northern California", "Title": "“Very Comfortable and Spacious”", "Author": "labeckley", "ReviewID": "UR29096159", "Content": "We stayed in a one bedroom suite at the Wilderness Lodge Villas as the second part of a split stay at the Port Orleans French Quarter. We were all excited to see how Disney deluxe accomodations would compare with those at a moderate. We were also looking forward to sleeping in larger beds (king with a queen sofa bed). And it was my husband's birthday, which I had let the reservationist know when she asked if we were celebrating anything. So I expected it to be fun at check-in, with my husband receiving and (undoubtedly be embarrassed) by a \"happy birthday\" and birthday button. Rocky Start However, though we loved the villas, our trip kind of got off on the wrong foot. I would not mention any of the following things but these villas, reserved through the Disney reservation system, are not inexpensive and my expectations were high. We had caught the boat from the French Quarter to downtown Disney, and had a wonderful lunch at Wolfgang Puck's. We decided we would have to return on our last day prior to departing for our late afternoon flight to get meals to bring on the plane. We caught the bus from downtown Disney to the Wilderness Lodge, and soon realized the long bus ride meant we would not have time to return to do a last-day stop at Wolfgang's.. The bus stopped at Typhoon Lagoon, and there was also an at least ten minute stop at Pleasure Island -- there isn't much left open at Pleasure Island, but it seemed to take some time to do a driver change. This was probably the longest bus ride we were on during our stay at Disney World. When we went to check-in at the Wilderness Lodge, there was no friendly greeting or mention of my husband's birthday or button (I know this may seem silly to mention, but I wanted him to get the full Disney treatment). We asked about our luggage transfer and the desk clerk checked and said it had not arrived and gave us a number to call to inquire further. My husband asked if she could check for us, and she did, only to find our luggage was not even en route -- it was still sitting at Port Orleans. So we went up to our room and immediately rushed to our balcony to take in the view. It was a view of the rooftop and the bus stop. My husband called Port Orleans and spoke to a supervisor at the Bell Desk, who arranged for our luggage to be taken over to us. My daughter had been excited about going to the pool, and we were all anxious to get out and see the property, but the swim suits were packed in our luggage that was being transferred and we had to just wait around in the room for a couple of hours for the luggage to arrive. I had suggested to my husband previously that we just catch a taxi and move our luggage ourselves, but everyone at Disney had been so exceptional prior to all this so he thought it would be okay. But next time we would move it in a taxi. I called the front desk to see if (1) they had any way of acknowledging birthdays and (2) if we could get a room with a better view. The lady at the front desk said they could send him a Mickey Mouse birthday card if I wanted, but he would not get it until the next day. I said that was fine. She then switched me over to another person about changing our room. This lady was extremely gracious and helpful and said that, while there were no rooms with better views available that day, she could move us the next morning so that is what we did. As it turned out, we did find the Mickey Mouse birthday card in our room when we returned from dinner at 1900 Park Fair that evening. It didn't have my husband's name on it, but it had arrived on his birthday. Our five year old immediately appropriated the card, saying that she thought Mickey had meant to leave it for her because she had met him the previous day and thought she must have made a good impression! We were very glad to receive the card. Wound up being a Great Place to Stay! Despite the intial disappointments, the one bedroom suite was really wonderful! As much as we loved the French Quarter, it felt so luxurious to be at the villas! The beds were large and comfortable, and there was a wonderful jacuzzi tub and shower and walk-in closet. There was a full kitchen where we could keep and reheat leftovers. The washer and dryer was SO convenient -- I was able to wash all of the dirty clothes we had accumulated in the first part of our stay. There were two television sets, a comfortable living room and a pleasant balcony amid the trees. We were really able to relax at this resort. I can certainly see why people would invest in these timeshares -- such a comfortable base when you're out doing the parks all day! The cleaning staff at this resort were absolutely excellent. Our rooms were extremely clean and well-kept. We asked for extra hangers and someone came immediately. They were really great! The grounds at the Wilderness Lodge are magnificent, among tall pine trees with a created waterfall, a white sand beach and playground, and a geyser that goes off in the background. We saw one very tame brown bunny that was allowing a little girl to get close enough to almost touch. There were two pools -- one smaller one by the villas and a larger one with waterslide in the main area. In the afternoons they host games at the pool. The boat service to and from the Magic Kingdom is delightful. We didn't wait long for boats, and the trip was not long. One evening, quite by accident, we found ourselves returning on the boat during Wishes, and it was fun to watch the fireworks from that vantage point. I was taken with how majestic the Wilderness Lodge looks at night. lanterns light the walkway from the boat dock among the Pines. The waterfall, pool and grounds look particularly spectacular amidst the night lighting. All in all, after a rocky start, we enjoyed a comfortable and relaxing stay at the Wilderness Lodge Villas and would return.", "Date": "April 30, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "dighton", "Title": "“Best Disney World Hotel We Have Ever Been To”", "Author": "turnbull2357", "ReviewID": "UR26227078", "Content": "We stayed at the Wilderness Lodge from Auguest 22nd to the 29th. Overall we say its the best hotel weve been to. We stayed at the Villas but its the same thing but not staying in the main hotel itself. When we arrived at the front door a member opened the doors for my wife and daughter and took our bags off for us which was pretty fast and amazing. It was hot outside on the 22nd but once you got inside it was air conditioned and all the different tiki poles and how huge it is was pretty breath taking also. Check-in was faster than we could say \"Disney World\". We had a room in the Villas part on the 3rd floor around the hexagon I believe. The view was not great but the room its self was huge. We had our own kitchen so we cooked for 3 of the night we stayed which was money -saving and extremely conveinient.There was our own washer and dryer so we could wash our clothes and that means less luggage. My daughter had her toe bleed because of the metal thingy (forgot the name). The bed was big and comfortable. The bath was huge and so was the shower. We had a double sink which had not madness to fight for it. The walk to the pool was a short walk. Theres 2 different pools and both were great. But we used the Villas pool at about 8 o clock so the water was warm and we had it all to ourselves. It rained alot so we barely passed going to the hollywood studios because it was a raging storm. The walkway to the Wilderness Main Hotel was nice because you could see the flowers outside and a short walk to the Disney Buses was great. The indoor river was magnificent so we took alot of pictures. Theres 1 store for food or clothing and even games but I thought they shouldve had atleast 1 more store there. The Roaring Forks was good. We got the mugs so we dont have to pay like 15.00 for 4 sodas. (im just guessing). We went to Whispering Canyons one night and that was FUNNY. We had a waiter with funny glasses so my son loved that. He also needed Ketchup (for those who know what happens with that). So the waiter yells for ketchup and every single bottle of ketchup is brought to our table. 2 teenagers actually met there also while we were there. Short boat ride to the Magic Kingdom and buses to the other parks and downtown disney. We went to the House of Blues for breakfast and there was many food and drinks to choose from. I couldnt choose! Overall, this was one of the best hotels ive been to since Disney World opened in 1971. I reccommend this to every single person for vacation. :)", "Date": "March 15, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "4.0", "Value": "4", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Ogden Dunes, IN", "Title": "“Kids loved the Lincoln Log Hotel”", "Author": "Dagney1", "ReviewID": "UR24920215", "Content": "I stayed at the Villas at Wilderness Lodge from 2/11/09 - 2/14/09. We had a two-bedroom suite. I shared the suite with my 3 children (7, 4, 1) and my parents. My husband could not come with due to work, but there would have been more than enough space for him as well. We had stayed in the Lodge about 3 years ago and loved the location and calmness of the Lodge. The Villa was nice - but one complaint was that it needed cleaned for the price of a $600+ night villa. It was fine per Comfort Inn standards - there were no outward dirt. But, we did find a teething ointment bottle folded up in the port-a-crib that came with the room. My father snores - and so my mom reported that the fold out sofa was comfortable. The villa was big enough that I didn't hear him, which is a good thing. The kitchen was clean, no spoons or bowls - which made breakfast interesting. Beware of the jets in the tub. I didn't notice that some were higher than others and ended up spraying my mother in the face with them when my daughter asked to see the bubbles. Again - not perfect, but funny. The kids loved the towels folded as animals. The location is great. We had a 8AM breakfast scheduled with Cinderella and we were told to catch the 7:30 boat. Unfortunately, the 7:30 boat was training new boaters - so we were left somewhat stranded. Panic is not allowed on vacation, so we loaded ourselves on the ferry to the Contemporary Hotel and then the monorail to the Kingdom. We made it with 5 minutes to spare. What started out as a bit stressful time ended up as one of my favorite memories. They let us into the Park before the masses - and then my 4 year old daughter - afraid to miss her meeting with Cinderella, hiked up her Belle dress and sprinted down Main Street full speed ahead. I had my video camera out and caught a bit of the action. I couldn't stop laughing at the sight of a little Princess running to her castle with all of the Disney music playing in the background. But as far as the Lodge was concerned, a bit of coordination and heads-up would have been nice when we asked about early transportation to the Park at the desk the day before. Would this happen at the Ritz? no. The Children's Activities were fun for my 7 and 4 year old. They gathered kids up and the pool and had games in the sand. The pool was busy and I did run into strict rules, which are a bit irritating. They have ducks in the pool - which is why I marked them down for cleanliness. My daughter wanted to swim with the ducks. So, I said gross, but okay and off she went. I sat near the edge of the pool with my diet Coke watching her. I was told that I couldn't have drinks in the pool. I wasn't in the pool, but said okay and put it behind my back. She told me that I had to have it 6 feet from the pool. Now, let me understand this - duck poop in the pool - okay - a diet coke 2 feet from the pool - not okay. It is just that you are paying lots of money and expect to be treated like you are home... not in kindergarten. The view was great - 4th floor with partial lake view. The room was big and everything worked. I don't like the Disney bus service and we didn't use it. But the boats were great and one afternoon they even passed out swards and the kids led by the co-pilot stood at the front of the ship and took over other Ferry boats pirate style. We would stay here again, but at the price that they are asking - they have some stiff competition.", "Date": "February 21, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Check in / front desk": "4", "Overall": "5.0", "Value": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Buffalo, NY", "Title": "“Awesome resort!”", "Author": "2CrazyKids", "ReviewID": "UR24082074", "Content": "I stayed at the Villas at Wilderness Lodge from 1/27/09 - 1/31/09. We had a one-bedroom suite, and my in-laws had a studio which connected to ours through double doors that could be locked on either side. To say we were impressed is an understatement. First, the resort itself is very beautiful - from the moment you walk into the well-decorated lobby at the main resort - you hear quiet, relaxing music and the sound of a bubbling creek; there are tall totem polls and comfy chairs. Go through the lobby and turn right through double doors, and you are on the covered path to the Villas. I found the Villas building to be quiet and more mellow than the main lodge. The rooms are beautifully decorated and ours was clean and not worn at all - reading some of the previous reviews, maybe we got lucky, but everything was in great shape. We traveled with our two boys, who are 4 and 1, and they both had a great experience. They adored the jacuzzi tub - it has never been easier to give them a bath! We asked for a crib rather than the standard pack-n-plays that come with the room, and it was delivered promptly. I was impressed with how large and comfortable it was. The mattress on our bed was soft for my taste, but basically okay. The outer room had a TV with a DVD player (nice when your kids want you up at 5:45 a.m. and you need a little time to relax and make coffee). There was a balcony with a woods view, and there were tall pine trees all around. A hawk landed right outside of our room on the last day; ducks swim in the main pool on a regular basis and we saw rabbits, too. The pools are fantastic. There is a very quiet, kidney-shaped pool in the Villas area, along with a spa. Towels and poolside seating are convenient. If you walk along the path toward the main building, you can see a beach by the lake (no swimming in the lake but you don't miss it since the pools are right there) - my youngest one loved digging in the sand, which is clean and soft. The pool by the main building is much larger and it is busier, but it wasn't crazy crowded when we went. There is also a nice shallow wading pool for younger kids, which both the boys enjoyed. One perk for parkgoers is the boat transportation to and from the Magic Kingdom. The buses are more conveniently located when you stay at the Villas, but if you care to take a walk to the other side of the resort, the boats can take you to Fort Wilderness or the Magic Kingdom. The ride itself is short (less than ten minutes) and so relaxing - you can see wading birds, as well as the other resorts. My boys loved the boat rides we took. Bus transportation elsewhere is doable. I found that the buses came pretty frequently, and there are comfortable places to sit while you wait. My husband and I cannot wait to go back to the Villas at Wilderness Lodge, especially when our boys are older and we can do a bit more. All in all, I highly recommend this place, especially for families with young children.", "Date": "February 1, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Business service (e.g., internet access)": "4", "Check in / front desk": "4", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Redding, CA", "Title": "“Resort was the Highlight!”", "Author": "conkime", "ReviewID": "UR23286223", "Content": "The Wilderness Villas was a refreshing finish to each day. The parks were so crazy and busy during the holiday period that the serene, quiet ambiance helped to calm your nerves (cricket sounds were a nice touch). Throughout the day, it was not uncommon to see deer, rabbits and ducks wandering around the resort. We had a one room villa and our daughter (9) liked having her own space and T.V. Kitchens had all the amenties but it was difficult to buy any real groceries. The small mercantile store had a limited supply. The washer/dryer was great...next time, I'll take less clothes ...they provide detergent but not dryer sheets. Great transportation to Magic Kingdom (boat or bus). Other areas took quite a bit longer and really only available by bus. Pool area was nice and my daughter enjoyed the pool games in the afternoon. Limited sun at times which can be a bit chilly during the winter months. Whispering Canyon restaurant is fun (once)...but loud (that's what they are known for) and the Raging Fork snack shack was O.K. -- It is very easy to get around the resort and nothing is more than 2 minutes...I loved that! We really enjoyed the resort and would most definitely stay there again...the housekeeping made animals out of towels and washclothes and that was a really \"cute touch\" that my daughter is STILL talking about!", "Date": "January 5, 2009"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "Home", "Title": "“A Little Heaven on Earth”", "Author": "acrum1", "ReviewID": "UR23028745", "Content": "Our family has stayed at the Villas twice and are returning for another visit in two weeks. We would not stay anywhere else. The accomidations are lovely and the environment is serene. This is a wonderful place for all ages. We can't wait to return!!", "Date": "December 27, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Check in / front desk": "4", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Richmond, Texas", "Title": "“Beautiful and Clean”", "Author": "BlueH2O", "ReviewID": "UR22754732", "Content": "This property definitely had the pacific northwest feeling! The grounds were always kept very clean and the people are all so caring. The winter holiday decor was pleasing to the eyes. (I loved the christmas tree). We were also able to get a complimentary wheelchair (first come, first serve basis) to use throughout our week long stay for Disney parks. We were on the fifth floor corner section. It was always quite there, I did not hear many noise levels in the hallways. The one bedroom was equipped with a full kitchen (stove, microwave, washer/dryer and sink with all the works such as detergent for clothes and dishes). The down side was that the washer and dryer & the bathroom toilet was extremely loud! You can seriously be awaken by the toilet being flushed (with the doors closed)! Also, my husband has allergies and he had a reactive symptom there because I think they need to change the air filters and some furniture needed dusting (I did it myself- which was no big deal). You can take the ferry boat to magic kingdom and the shuttles to the other parks. One thing I've learned was that you can't take the bus to get from one hotel to the other, except to get to the Grand Floridian on the hollywood studio bus. The Whispering Canyon restaurant in the hotel is okay and the roaring fork was decent for fast food. The lobby and restaurants are separate from the villas (it is about a 2 minute walk). Anyways, If you like that dark, woodsy outdoor feeling... then this is the place for you. I think we'll try a different Disney property next time. Overall, the Wilderness Lodge villas was a pleasant experience.", "Date": "December 15, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "4", "Check in / front desk": "3", "Overall": "5.0", "Value": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Fairmont, West Virginia", "Title": "“One of the BEST...”", "Author": "tuliplor", "ReviewID": "UR22487405", "Content": "The Villas at Wilderness Lodge are in a wonderful location. I like having the option of using the bus, boat or even going to the Contemporary Resort to get the monorail. We loved taking the Lodge tour with Stan the Ranger! What a gentleman! He made the experience fun and interesting. He gave us so many details that it made me like the resort even more. We had a 2 bedroom, Our family and friends stayed in a studio w/ a one bedroom. It had a full kitchen and a whirlpool tub. We loved being on the ground floor close to the bus stop. Perfect location! I liked the private pool and hot tub. We visited 3 or 4 times. The food at Whispering Canyon was great! It is a great experience for the family. Ask for the ketchup! We got to be the flag family!! HOW FUN!!! Ask when you check in. This is a beautiful resort!! We will visit again! We are vacation club members,", "Date": "December 6, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Charlotte", "Title": "“Can't Wait To Return To The Lodge”", "Author": "kikiCharlotte", "ReviewID": "UR20543802", "Content": "My wife and I traveled with our two girls (ages 4 and 2), as well as my parents, to the Wilderness Lodge in September. This was our first trip to WDW with kids and parents, so we wanted to make every effort to select somewhere very accessible. Since we knew working around nap time would be a must, accommodations close to the Magic Kingdom were the most important thing to us.. I am happy to say we could not be more pleased with the Wilderness Lodge. Regarding location, we found both the bus and ferry to be very prompt, with neither requiring more than a 15 minute wait. We had booked several character breakfasts at various resorts, in the early morning hours (7:30-8:00 am). Even at that hour, we found access from the Lodge to be prompt and without hassle. Regarding the Lodge itself, we opted to stay in a two bedroom villa in order to have the entire family together, and allow room for the kids and parents to rest without interruption. We were extremely impressed with our villa. The layout was excellent, everything was extremely clean, and both the furniture and beds were comfortable. If you enjoy a little quiet time after a busy day at the parks, you certainly find it at the villas. Not once did we experience noise from the corridor ,never waited on an elevator, and a pool designed to serve those staying at the Villas was a short walk away. I have noticed others writing on Trip Advisor had mixed reviews regarding customer service. However, we were very happy with our experience in this category as well. We arrived several hours prior to check in and found the front desk willing to go ahead and check us in. Our luggage actually beat us to our villa! We rented a car during our stay. Apparently the bellman noticed this when we arrived, as he brought a map with our luggage and highlighted the nearest grocery store, restaurants, etc.. The conceirge's desk was extremely helpful, making several reservations for us and never attempted to rush us into making a decision. Another great thing about the Lodge is all the entertainment available without leaving the resort. Between the two pools, bikes, boat rental, arcade, and walking trails, you can spend the day having fun without ever leaving, just in case you want to take a day off from the parks. We hope to visit Disney every 2 or 3 years if possible. Based on our experience this time, we will be staying at the Villas during our future trips.", "Date": "October 1, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "3", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Nocona, Texas", "Title": "“More than we expected”", "Author": "mlstorey", "ReviewID": "UR20409329", "Content": "I planned our trip to Disneyworld for two years, and the hardest thing was for me to pick our resort. Thankfully, the Villas were the answer to our prayers! We loved the lodge theme, and everytime we entered our lobby we really did feel like we were home. I felt like everything was pretty close, so meals, pools, and shopping were convenient. My family of 4 stayed for 8 days, so I knew we needed lots of room and I preferred a kitchen and washer and dryer. Our 1 bedroom villa was extremely roomy. We especially loved the bathroom (huge). Not being used to the humidity, we took lots of showers and washed lots of clothes. We found the whole property to be quiet and peaceful. Our only complaint was our bus wait times. It always seemed Wilderness Lodge was the last bus that showed up, but that really was our only complaint. Without a doubt we would choose exactly the same accomodations for our next trip.", "Date": "September 26, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Check in / front desk": "4", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Northern NJ", "Title": "“Willderness Lodge - Well Themed and Maintained”", "Author": "MickeytheSorcerer", "ReviewID": "UR20116099", "Content": "Our family of four (myself, wife and two teenage daughters stayed at the lodge for six nights in August. As members of DVC we try to sample different lodging each time we visit Disney World. We stayed in a one bedroom suite with a view of the quiet pool area. Check in went very well and the concierge area is very convienantly located next to check-in area. This made it one stop shopping as we purchased our theme park tickets, made reservations for dinner and picked up confirmation notices on previously made reservations. The property is not large and spread out like Saratoga Springs or Old Key West so it was easy walking distance to the bus or boat transportation and back to the main building. The lodge is well maintained, clean and the theming inside the main building and around the pool areas are pleasing to the eyes. The one area that we were a little displeased with was the bus transportation. I recommend the boat to MK it is more reliable even though it is only a 5 minute bus ride from the lodge. The problem that week seemed to be infrequent bus transportation more than 20 minutes apart and in our case almost a 45 minute wait for buses to Epcot or the Studios. Buses to these two resorts first stop at the Floridian so be prepared for crowded buses. All in all it was a pleasant experience, we rate this resort above both Saratoda Springs and Old Key West but a notch below the Boardwalk. We have not been to AK Lodge or the Beach Club so I can't comment if the Wilderness Lodge is a better stay. Its main advantage is it is close to the MK and the compact nature of the resort. Cast Members were helpful and I would revisit this resort again.", "Date": "September 16, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "3", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Illinois", "Title": "“Very nice!! Quiet compared to the Lodge.”", "Author": "oftheseas", "ReviewID": "UR19839227", "Content": "We were already staying at the Wilderness Lodge when we decided to extend our stay because we were having such a great time in Disney World. The Lodge was booked, but they did have an opening at the Villas. We were happy because we didn't have to waste much time in getting over there. The Villas are very nice. We loved the decor and theming. If you stay, make sure you go and look around. They have a lot of nice quiet sitting areas. the beds are very comfortable. Everything was very clean and well kept. We thought the Villas are much quieter than the actual Lodge. We didn't hear any noise. We could only get a studio, so the room was a bit small for a family of 4. It was nice though to have a fridge and microwave in the room. The laundry room was very close and free of charge!!!(even though there is a slot for money, it doesn't accept money).", "Date": "September 6, 2008"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Business service (e.g., internet access)": "3", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Spring Hill, TN", "Title": "“Loved the villas!”", "Author": "dfarner", "ReviewID": "UR18262652", "Content": "We stayed at the Villas during the week of the 4th of July. We had a one bedroom unit, which was plenty of room for us (2 adults and 2 kids). We arrived before 10:00 am and were lucky to get right into our room. The room was very clean and stocked up with all the \"starter\" packs you get with DVC-coffee, Tide, etc...The king size bed was wonderful, but the pull out sofa bed was dubbed \"the Black Hole\" by my 6 year old. Housekeeping was a mixed bag. We asked for bed rails and received those with no problem, but a couple nights later we asked for an extra blanket and it took 3 calls and a walk to the front desk before we could get one. We had a \"trash and tidy\" visit on our 4th day, and the beds were made, trash was taken out, and supplies were replenished. The villas are located off of the main lodge, but they are an easy walk from anywhere on the property. The property was extremely quiet and nice to come back to after being at the parks during one of their busiest weeks of the year. The grounds are gorgeous. There is a small sandy beach in the back with boat docks and a place to rent boats/bikes. We rented 2 Sea Racers one afternoon, and the price was very reasonable. They allow anyone over the age of 12 or 13 drive the boats, which I think is a bit young. We experienced a very hairy situation when a young boy was trying to maneuver his boat throught the canal at the same time one of the Disney ferries was going through. If you're going to let your pre-teen drive the boat, please go with him. The villas have a small, \"geyser\" pool, which was very nice. The main pool behind the lodge was very large, with plenty of pool chairs. Every afternoon they had a \"pool party\" with Limbo, Hula Hoop contests, dancing, and more. There is a bar and deli area right near the main pool area as well. There is some outside seating for eating, but the ducks and birds are VERY aggressive, and if being stalked by birds is not your thing I would not recommend eating outside. Transportation was never a problem. We waited probably not more than 10 minutes for a bus to any of the parks. We took the boat to MK one morning and it was quick and very peaceful. There is also a boat to the Contemporary, which we took one morning and then jumped on the monarail for a ride. I would definitely recommend the villas, especially if the Magic Kingdom is one of your main destinations while at Disney World.", "Date": "July 26, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Check in / front desk": "3", "Overall": "4.0", "Value": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Red Bank, New Jersey", "Title": "“Loved the Villas”", "Author": "givemeoceans", "ReviewID": "UR14355316", "Content": "My family and I have been members of the vacation club for almost 10 years, and this was the first time we stayed in the villas, as we had 2 extra guests. We had a two bedroom villa, and it was enormous. The room was spotless: the kitchen appliances were clean and functioning, the master bathroom was perfect. both bedrooms had small balconies that had partial views of the large quiet pool. the building was also very welcoming and fully encompassed the hotel's theme, as is expected with Disney resorts. The main pool area is wonderful, with a gentle waterfall safe enough for children. The pool bar is good, but the pool bars at the Coronado Springs and the Boardwalk were better. The snack bar near the pool provided a wealth of snacks for everyone throughout the day, and our group would get breakfast there if we weren't going to a theme breakfast that day. The staff was friendly, though we bumped into a few staff members that weren't exactly feeling the \"Disney magic\". We didn't let that get to us. Mostly everything we needed was taken care of immediately. There are two restaurants in the hotel, and we only ate at the theme restaurant (its a barbeque restaurant). Be prepared for very involved waitstaff - if you don't like LOUD, crazy, get you up out of your seat to do a rodeo dance around the room kind of dining, then i suggest you don't go here. it's a great atmosphere for kids, but only go there if you are open to semi-obnoxiousness and you have a sense of humor. the food there is pretty good too... LOVED the pulled pork!! Okay, now here's the bad news. The second night in the hotel my friends and I used the hotel hot tub. Two days later I woke up with the WORST allergic reaction I've ever had in my entire life all over my legs. We actually had to have a doctor come to the hotel to diagnose me, as I could barely walk. The doctor (employed by DisneyWorld) diagnosed the reaction as a reaction to potential hot tub bacteria that soaked into the pores in my legs. it's why the reaction stopped at my bathing suit line. when we informed the hotel, they were not receptive to the informaiton. they refused to take responsibility for it, which was very disappointing as we have been so impressed with Disney in the past. Fortunately, they did end up taking responsibility and covering all medical costs. However, my 10 day trip was essentially cut short - not only was it unbearably itchy, but it was so embarrassing to walk around with - people actually were commenting and asking me what was wrong (not Disney's fault). I was also unable to go out in the sun, as it would potentially irritate it. I ended up sleeping through the days and only going out at night. Other than this setback, we enjoyed our vacation thoroughly. We have been to DisneyWorld over 18 times and never expect less than the best. If you are a member of the vacation club, seriously consider this hotel. The location and transportation are also worth mentioning, as they were never an issue.", "Date": "March 18, 2008"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Check in / front desk": "3", "Overall": "4.0", "Value": "3", "Rooms": "4", "Location": "4"}, "AuthorLocation": "burlington", "Title": "“Great vacation”", "Author": "kmtruffe", "ReviewID": "UR13387501", "Content": "my family of 5, consisting of myself, my wife, my 2 daughters (8 and 4) and son (2) stayed at the villas jan 28-feb 4. As background, my intention was to stay at the wilderness lodge but it was sold out, so i chose to stay in a studio at the wilderness lodge villas. We had an amazing vacation and here are the pros and cons of the villas: pros - beautiful grounds; handy and fun quiet pool that was uncrowded and had cool little \"geysers\"; very clean; very quiet (we rarely saw or heard anyone); lots of common areas in lobby area where you can play chess or checkers or simply sit on a big chair by a fireplace. cons - the studio wasn't worth the $65+ per night more than a standard wilderness lodge room. Sure, the microwave and toaster was nice, but not worth close to $500; the walk to get coffee in the morning took about 20 minutes and was very inconvenient. We stayed at the end of a very long hall, but I think it would be a pain in any room. A simple coffee stand/shop in the villas would have made a huge difference; after sending 2 faxes and a request at check-in asking for a \"room with a water or pool view\", our view ended up being of the back of the resort facing the linen storage area (we thought they were garbage bins at first); the maid service was a mid sporatic as we came \"home\" one day at 3:00 to an unserviced room which was a bit odd. Please don't think my \"cons\" suggest the place wasnt great. It was, but I would suggest getting a 1 or 2 bedroom villa instead of a studio so you get separate sitting areas, a full kitchen (studio just had a fridge, microwave, sink, and toaster).", "Date": "February 8, 2008"}, {"Ratings": {"Service": "2", "Cleanliness": "2", "Business service (e.g., internet access)": "2", "Check in / front desk": "3", "Overall": "1.0", "Value": "1", "Rooms": "1", "Location": "5"}, "AuthorLocation": "Chhicago, IL.", "Title": "“Warning!”", "Author": "TravelsavyChicago", "ReviewID": "UR13104401", "Content": "WARNING! Lots of Kids. Rooms appeared old and the property is under renoation. resort is not as nice as it looks online. Not worth the price for teh avrigation I experienced. On the plus side, it is very close to everything you want to do at Disney. Visit after the renovation.", "Date": "January 29, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Columbia, South Carolina", "Title": "“Gotta Love the Outdoors!”", "Author": "pmauldi", "ReviewID": "UR11239963", "Content": "On a scale of 1-10, I would have to say that my recent stay at the Villas at Disney's Wilderness Lodge was a 9. I was somewhat disappointed that the Villas’ pool area was closed for refurbishment; therefore, I had to use the main pool at Wilderness Lodge which was not as convenient – or quiet, as the one just a few feet away. But overall, I did enjoy the rustic atmosphere of the resort as well as the scenic wooded areas.", "Date": "December 4, 2007"}, {"Ratings": {"Service": "2", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "4.0", "Value": "4", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Orlando, Florida", "Title": "“Very relaxing, but don't forget the \"Do Not Disturb\" sign.”", "Author": "maddoxmoncrief", "ReviewID": "UR8666451", "Content": "My stay at the Villas at Disney's Wilderness Lodge was wonderful. My room was very clean and the lodge itself was beautiful and relaxing. Disney has done a very good job of making you feel like you've traveled to the Pacific Northwest instead of central Florida. During my stay, I took advantage of in-room dining, full service dining at Whispering Canyon, recreation boat rentals, a massage at the spa and the swimming pools. Each time I visited these areas I encountered very friendly and knowledgeable staff. So if everything was great, why didn't I rate the resort as excellent? Well my trip lasted 4 days and 3 nights. Of those 3 nights I was woke up at 8:30 in the morning by someone from the Lodge knocking and attempting to enter my room. The first time, it was a Front Desk manager just stopping by to ask how my stay was going. That's great and all, but does this really need to happen at 8:30 am? Couldn't she have just called or slipped a note under the door? The last time I was woke up was again at 8:30. This time it was the housekeeping staff trying to get in and clean the room on the day I was to check out. Now checkout doesn't happen until 11:00 am, why on Earth are you trying to get into the room at 8:30? Because everything else during my stay was so great, I am willing to look past these two minor issues. I would recommend this resort to others and I would stay there again myself. Just don't forget to use the \"Do Not Disturb\" sign!", "Date": "September 6, 2007"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "4.0", "Value": "5", "Rooms": "5", "Location": "3"}, "AuthorLocation": "St. Paul, MN", "Title": "“Always wonderful, but some problems with the DVC”", "Author": "MikkoN", "ReviewID": "UR8615962", "Content": "We love the Villas at the Wilderness Lodge and we have stayed there several times. The rooms are spacious, well-appointed and QUIET! This is important after a full day. We stayed for a brief weekend this trip, so we didn't need the in-room washer and dryer, but it is a nice feature (they provide the Tide, but you should bring your own fabric softener). The pool for the Villas is lovely and much calmer than the pool at the Lodge. The fitness center is also large and full of good equipment. This was the first trip we took to Disney with our infant, and it is truly a baby friendly place. Besides the dishwasher and microwave (essentials) the pack 'n play was clean and just fine for our son. Service is always incredibly friendly. Only a few negative comments: My family belongs to the Disney Vacation Club. Member services was really lacking this time around when I called. I had difficulty getting assistance from the DVC person when I tried to set up the \"Disney Magical Express\" ride for us from the airport (I didn't have my member number on hand, and she simply said I was out of luck). When I tried talking to a DVC person in the flesh at one of their booths, they said they were helpless and couldn't do anything, and I should call member services. It was frustrating. The other slight negative, that we didn't notice before we had an infant is that it takes a LONG time to get to another hotel from the Lodge. We wanted to eat at the Polynesian and it took 45 minutes to get there by boat and monorail--there is no direct bus. In retrospect, we could have taken the bus to a park (which would stop at the Grand Floridian) and then taken the monorail. Plan accordingly with your little ones.", "Date": "September 3, 2007"}, {"Ratings": {"Service": "4", "Cleanliness": "1", "Check in / front desk": "3", "Overall": "2.0", "Value": "2", "Rooms": "3", "Location": "4"}, "AuthorLocation": "New Jersey", "Title": "“Not so magical beginning”", "Author": "huizarst", "ReviewID": "UR7802675", "Content": "I recently visited WDW from May 29-June 5, 2007. This review covers my stay at the Wilderness Lodge Villas from May 29th thru June 3rd. You will have to read the extension of my review once we reached the Villas at Boardwalk Inn. Our trip began with a stay at the Wilderness Lodge Villas. We had visited the Lodge before to have dinner at the Whispering Canyon Restaurant and toured the grounds. To say we were impressed at what we saw and the excitement we felt as we checked in would be an understatement. We were checked in right away and placed in Room 3059. After a long day of travel getting to Florida, all we wanted to do was take a shower, rest for a bit and hit the parks that evening. When we first got to our room we found lights burned out on the bedside and the bathroom, and as we unpacked and started to stock our refrigerator I noticed there was a crack in the handle that subsequently pinched me at the tip of my finger. Not a good first impression. I told the front desk receptionist about our experience as we left for the park. When we returned, the lights had been fixed, but the fridge had not. Also as we settled in the night, I noticed a smell from behind the couch and so I pulled the couch out from the wall to find pepperoni left behind. To say it was disgusting would be in jest as my feelings to the overall attention to cleanliness and detail were far from positive. The next morning I got up to get a bottle of water from the fridge and again was pinched by the broken plastic handle. That was it and I felt I needed to communicate my disappointments with a manager. I went downstairs and spoke with a manger by the name of Alisha. She listened to all my concerns, apologized for the occurrences and assured me that the room would be cleaned again and fridge repaired to the best of her ability. I thanked her for her time and left for a day in the parks. When my family returned we were glad to see that the room had been cleaned, fridge replaced, but the complimentary fruit basket and note of apology was amazing. That bit of hospitality went a long way and helped put our trip on a magical course again. We stayed at the Lodge till June 3rd. Check out my continued saga on my review of the Villas at Boardwalk Inn. Magical just did not find my room there.", "Date": "June 7, 2007"}], "HotelInfo": {"Name": "Villas at Disney's Wilderness Lodge", "HotelURL": "/ShowUserReviews-g34515-d254239-Reviews-Villas_at_Disney_s_Wilderness_Lodge-Orlando_Florida.html", "Price": "$412 - $630*", "Address": "<address class=\"addressReset\"> <span rel=\"v:address\"> <span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">901 Timberline Drive</span>, <span class=\"extended-address\">Lake Buena Vista</span>, <span class=\"locality\"><span property=\"v:locality\">Orlando</span>, <span property=\"v:region\">FL</span> <span property=\"v:postal-code\">32830</span></span> </span> </span> </address>", "HotelID": "2515905", "ImgURL": "http://media-cdn.tripadvisor.com/media/ProviderThumbnails/dirs/5a/99/5a9995662a9d3d5c32c93bc25ab13ecd1large.jpg"}}