{"Reviews": [{"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Las Vegas, Nevada", "Title": "“Great For Families”", "Author": "schmidt76", "ReviewID": "UR128566139", "Content": "Attended a wedding in the San Diego area, and stayed here with a large group of family. Like most Embassy Suites, this is a great property for families/friends traveling together. The rooms were very spacious, with a pullout bed in the couch for extra room. Enjoyed having a door that could separate the bedroom area from the living area, so could hang out in the room witht disturbing those sleeping in. The breakfast was excellent (cook to order eggs, omelettes, etc), and a great value-add for a start to the morning without having to go to a restuarant. The lines were long during peak timeframes (around 9:00 - 10:00 on Sunday, and 7:30 - 8:30 AM on Monday), but before or after those times was no issue. The staff was extremely friendly, and quickly responded to a few minor issues with the room and parking charges. Parking is in a garage adjacent to the hotel, and easily accessible to get in and out, although some of the stalls were pretty narrow. The immediate area includes a PF Chang's, and an outdoor shopping mall across the street.", "Date": "April 25, 2012"}, {"Ratings": {"Service": "2", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Sacramento, California", "Title": "“Nice Hotel”", "Author": "CyberTag01", "ReviewID": "UR127680703", "Content": "This is a typical Embassy Suites/business hotel. We are HH gold members and were upgraded to an Executive Suite. It was a very nice room for our family of 4. The sofa sleeper is EXTREMELY uncomfortable and we do NOT recommend it! Luckily we brougth our doube aerobed for our 15 and 18 year old to sleep on. The regular king bed was very comfortable. We had a corner room and even though it was not near the elevator, we heard the elevator all night. May have been because it was a corner room? The regular hotel staff is not very friendly. We had to call each day for towels as there were never 4 bath towels left by housekeeping. One day they didn't leave us any fresh towels. They do an excellent job on the breakfast in the morning. The managers reception was nice as well. They offer popcorn, pretzels, celery/cauliflauer and zucchini sticks with ranch dressing as their light appetizer. They also have a very inexpensive happy hour menu from 5-8 pm. It is a nice hotel and besides for the above small issues, we would recommend it and stay again.", "Date": "April 11, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "3.0", "Value": "5", "Sleep Quality": "4", "Rooms": "5", "Location": "3"}, "AuthorLocation": "Nevada", "Title": "“Off to a rocky start”", "Author": "CbnCampy", "ReviewID": "UR127634146", "Content": "My husband and I and our three kids (2,7,10) were traveling from Las Vegas to San Diego for Spring Break. We chose this hotel because the one we normally stay in during our trips to Legoland was booked. We were due to arrive late Tuesday night. We had booked a non-smoking, 1 king bed suite. Knowing we would arrive late, I called Tuesday morning to advise the hotel that we would be checking in close to midnight and that I would love to have a crib waiting for us in our room since we would have a 2 year old ready for bed by the time we arrived. The lady at reception said she would send one right up and noted our late arrival. As planned we arrived around 1am. I went to the front desk to check in and the gentleman took an unusually long time to check us into a room. When I asked him if there was a crib in the room he said no but that he would send one up. We carried all our sleepy kids up to the 12th floor and walked into a very smoky room, my kids instantly noticed and complained of the smell. I called the front desk and told them that we had reserved a non-smoking room. He told me that they had over-booked and that I had the only room left in the entire hotel. I proceeded to tell him that its not my problem that they overbooked and that I reserved and was paying for a non-smoking room, how can they just give my room away? He said that they had oxidized the room extra to try to get rid of the smell for me...whatever that means it didn't work. He had no further explanation other than to apologize and offered me to speak to the manger at 7am. Still waiting for the crib to arrive, the one that was promised to have already been in our room, we put the kids to bed. The room smelled like an old musty smoky casino, I couldn't sleep and ended up hanging out in the lobby's fresh air until about 330am. I went back to the room fell asleep for 2 hours, showered and went to the lobby again to hang out until breakfast was served at 6am. At 7am I spoke to the assistant manager that was very surprised by what had happened. He apologized and told us we would not be charged for the room that night. He told us he would move all of our belongings as soon as a new room was cleaned later that morning. I left all of our belongings in the front room and when we got back from Legoland everything (except for the crib, which I had to request for again) was in a new smoke free room. The rest of our stay was great, but that first night was awful. The kids tossed and turned all night and barely slept, my husband and I barely slept after a six hour drive to San Diego. As a family with a toddler and two older kids we regularly stay at suite type hotels, which are considerably more expensive but for the added convenience of having 2 rooms it is worth it, so to have this happen to us was really a shocker especially from an Embassy Suites. All in all it was a good trip and a pleasant stay..after the first night.", "Date": "April 10, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Ohio", "Title": "“Wonderful hotel!”", "Author": "Justmarried9-15", "ReviewID": "UR127189294", "Content": "I loved my stay at this hotel. The hotel was beautifully landscaped inside with plants everywhere and a beautiful stream with large koi fish. The suites were all very clean and contained all the ameneties I needed. The staff was extremely friendly as well. And of course you can't go wrong with the amazing hot breakfast with a million choices and the nightly manager's reception! It is definitely worth every penny! There is a PF Changs right outside the front door if the hotel restaurant doesn't sound good - plus a really nice outdoor mall is right across the street with a million other options for food and shopping.", "Date": "April 3, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "2.0", "Value": "3", "Sleep Quality": "1", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Seattle, Washington", "Title": "“Loud,”", "Author": "freqtrav002", "ReviewID": "UR127080548", "Content": "This hotel is ideal if you LOVE, crying babies, screaming teenagers (and as I write this there are six 13-year olds standing outside my window screaming over the balcony at the top of their lungs, 12 floors down to the lobby), fitness centers crowded with 8 year olds on treadmills... it is a really nice property but the lay out seems to cater to families, small children - if you are in town for business or traveling with adults i would say avoid this place.", "Date": "April 1, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "4", "Rooms": "5", "Location": "3"}, "AuthorLocation": "Lemoore, California", "Title": "“Relax in La Jolla”", "Author": "ccdmgallardo", "ReviewID": "UR126835165", "Content": "I have been taking business trips to San Diego for the last three years and I have to say that this is the place to stay. Never too crowded and always a great stay. The breakfast is always great (and free) and the free manager's reception is the perfect way to unwind after a day of work. I highly recommend it.", "Date": "March 28, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Santa Cruz", "Title": "“Pleasant stay”", "Author": "Matt M", "ReviewID": "UR125529943", "Content": "This is a fairly typical Embassy Suites, and while it has gone through some renovations, it is showing its age. My wife and I had a suite on the 12th (top) floor, and we discovered a drip coming from the ceiling in the corner of the sitting area -- either a leak in the roof or the plumbing had obviously been there for a while, since the ceiling was heavily stained and bits of the ceiling had fallen off at some time in the past. We reported this to the front desk, and they were very apologetic and offered to move us to a different suite. We didn't feel like repacking all our stuff, though, and the drip wasn't really bothering us that much. Despite that minor glitch, it was a pleasant stay -- the staff were friendly, and the suite was comfortable. We will probably stay there again the next time we're in the area.", "Date": "March 2, 2012"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "New York, NY, USA", "Title": "“Overall very nice”", "Author": "jack783", "ReviewID": "UR125482305", "Content": "Stayed for one night while in the area for business and overall really liked it. It's an atrium-style layout with 11 floors. I had a 1 bedroom suite (true suite, not divider walled) that was spacious and well appointed. The hotel was completed renovated 5 years ago and further fitted with flat screen TVs a year ago. In addition to the usual coffee maker there is also a small fridge and microwave. Internet is about $10 and self-parking is $20. Everyone was friendly--I had to go to the nearby Hyatt for dinner and the bellman was happy to drive me over in the van. The fitness room is a little small for the size of the hotel, just three treadmills, a couple of elliptical trainers, and that's about it. It wasn't too busy when I was in there at 8 am but it wouldn't take much to fill it up. The indoor pool looked nice but too small for laps. There is a hot tub outside. The free breakfast buffet has a good selection of hot and cold items. It ends at 9 am so I stopped by after my workout, loaded some things onto a tray and ate in my room later, which worked out well. It did seem to get a little crowded and there were several people waiting in line for the omelet station. The Embassy Suites is not as nice as the Hyatt 5 minutes down the road, and you can't beat the Hyatt's beautiful lap pool and nextdoor enormous health club which Hyatt guests can use (for $13 I think). But the ES is a little cheaper and would be better for families due to the suite layout and free breakfast.", "Date": "March 1, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Sleep Quality": "4", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Santa Barbara, California", "Title": "“There are better Hilton Brand options nearby”", "Author": "Brent C", "ReviewID": "UR125408058", "Content": "First of all, this is for solo business travel, and my review would probably be different (and slightly more favorable) for vacation travel with the kids. After staying at nearby the Hilton Garden Inn (Del Mar) and DoubleTree (Del Mar), the Embassy ranks at the bottom of my list of Hilton choices when I travel to this area. It is not a terrible hotel, by any means; it just isn't my favorite among the various Hilton brand options in the area. For a family get-away on a weekend it may be the best option in the area, with the large family room and spacious accommodations. During my stay, however, I had the impression that the hotel seems a bit \"tired\" and stale (as are many Embassy Suites around the country), and the general feel of the hotel left me wanting more. That being said, all my interactions with the staff were very pleasant and the check in was very speedy and friendly. The Good: The location is very convenient, right off the 805 freeway and across from a large shopping mall with lots of options for food and beverage. A quick 15 minute drive over the hill takes you to the beach at La Jolla and the quaint and upscale shops and restaurants there. The rooms are very spacious and comfortable with a typical Embassy Suites layout of sitting room with sofa/desk in the front room and a bedroom in the back. The views from the taller floors are nice (for this area, which is very commercial). The bathroom amenities are nice (they even included a razor, shaving cream, toothbrush, toothpaste, and a mending kit). The linens and towels are very nice quality, however the pillows are synthetic and very spongy - if you are used to down pillows, you may wake up with a neck-ache like I did every morning. Staff is very friendly and helpful The Not-so-Good: This hotel is one of the more expensive Hilton options nearby for the regular room rates. Add $20 a day for parking and it becomes significantly more expensive, without delivering additional meaningful value. The parking garage fills up quickly and is so narrow you have to back up if someone comes the other way while trying to exit, which is incredibly frustrating when you are just trying to get to the office in the morning. The Free Breakfast: Standing in line for breakfast. Really? Come on! I am fortunate to get free breakfast at *any* Hilton (as HHonors Gold or Diamond) so the \"free\" breakfast at the Embassy was not my reason for choosing the hotel. However, if it had been, the deal-killer for me is that there is no quick buffet for hot items like pancakes, french toast, waffles, etc. Instead you have to queue up behind everyone in a long serpentine line to order one person at a time. The problem is so bad, they even post a \"warning\" about it in the rooms!) You must stand in line for anything besides cold cereal, muffins, or toast. After standing in line 15 minutes my first day for two pancakes, I opted to go across the street to Corner Bakery for my breakfast the remaining days of my stay. As to the rest of the food options at the \"breakfast buffet\", they are less numerous and of lower quality than the aforementioned HGI and Doubltree, both of which offer very nice (and fast) breakfasts by comparison. For example, the coffee at the Embassy is made from coffee-flavored syrup and hot water that is mixed as you dispense it - like the stuff in a college dorm or cruise ship - it is not even brewed. (That was a big turn-off to me) I found the air in my room to be stale smelling; almost as though someone had smoked in the room some time before and the smell never quite cleared (there isn't a way to crack a window for fresh air). Also, I happened to check in on an unusually cold and rainy evening and I turned on the heater in the room (which inexplicably had been turned completely off). I quickly realized why it had been disabled by a previous occupant - the fan was noisy and the air that issued from the vents smelled awful - dusty and dirty and reminiscent of the exhaust from an old vacuum cleaner that needs to have its bag changed. In fairness, heaters probably aren't used much in San Diego, but it was still off-putting. Bottom line, if you are traveling on business and don't mind driving an extra 10 minutes, I would personally recommend the nearby Hilton Garden Inn or Doubletree hotels - you'll save money on the room rate and get free parking, plus you will have a newer room and a far superior breakfast in the morning, with equally friendly and helpful staff.", "Date": "February 29, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Gig Harbor, Washington, United States", "Title": "“Terrific Hotel”", "Author": "Rozalyn B", "ReviewID": "UR125318450", "Content": "We had a great experience at the Embassy Suites in La Jolla. Our room and bathroom were really clean. The staff was friendly and helpful. Our room was quiet and we enjoyed the hot made-to-order breakfast. We were really happy with the location. A terrific hotel at an affordable price with a lot of amenities. We will definitely stay there again.", "Date": "February 27, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Maryland", "Title": "“Great for business or pleasure”", "Author": "Nurs09", "ReviewID": "UR125053747", "Content": "I stayed at the Embassy Suites for a conference 2-17 thru 2-21-12, the customer service was excellent from check in through check out. The first room I was given upon checking in, I did not like because the bedroom window was right next to the highway, with a view of a part of the hotel's roof on the third floor. I went down and asked for it to be changed, and the young lady did so without a problem. The room was adequately stocked with fresh towels and pillows daily. I had to travel daily to the Hyatt Regency, the driver of the shuttle on the first day was Paul, before he dropped me off he gave me the number to call for pickup on my way back. Paul and Paige worked different shifts and was able to transport me daily for the conference. Both drivers were excellent!...courteous, friendly and very kind. Thanks guys. The daily breakfast made to order(free) was an added bonus. Though the hotel was booked, the lines for omelets, flowed smoothly, the breakfast bar was adequately stocked. Thanks to the Front Office Supervisor, Dibiana for her professionalism and prompt response in getting my paperwork completed. Overall, my stay at the Embassy Suites was a very good experience. I recommend this hotel for all categories of travel. The high level of customer service demonstrated by the employees, will have me staying at the Embassy Suites for years to come.", "Date": "February 22, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "San Mateo, California", "Title": "“Great hotel & location”", "Author": "jkinney4", "ReviewID": "UR125048448", "Content": "We were lucky enough to find a room here on short notice, since we got downgraded at a different hotel. We were in town for a hockey tournament and lucky for us this was available, since the rink was right across the street in the mall. The kids enjoyed the breakfasts, snacks and pool. We enjoyed the space. We had a room with 2 double beds (bad) since we have to double up in each bed. Two queens would be nice, but I understand there is a space issue. Smaller beds equal larger floor space, I watch HGTV...I know. The only down side was parking, but it was really not that big of a deal, since we would come back late in the day. Plus, the best part, they let me check in early. Room was available!!!!!!!!!", "Date": "February 22, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Bakersfield, California", "Title": "“Great stay for a family of 20”", "Author": "teachergirl01", "ReviewID": "UR124805398", "Content": "We had a family of 10 adults and 10 kids for four nights. Great stay! We would have liked connecting rooms, but we've traveled enough together that we know that chance is hit and miss. We always try to make the effort to stay at the Embassy Suites because of the free breakfast and happy hour, and this was by far the best one we've stayed at. It is primarily a business hotel, which was nice for us because it meant our kids were competing with a million other kids for the pool in the evening! Thursday night was the best, as there was low business traffic. By Saturday night the place was PACKED, so we retired early as to not compete with the pool crowds. The breakfast lines can get quite long, but if you plan your morning and take the advice of the breakfast traffic card they put in your room, you will have no problems. (Wake up earlier... I'd rather lose 30 minutes of sleep then waste 30 minutes in the omelet line...). The breakfast is hot and plentiful, and basic buffet flavor as far as that goes. We gorged ourselves so as to hold off lunch longer throughout the day, and it is easy to do so with the large selection they have. The happy hour was great each night. Not as much of a food \"spread\" as we've have seen in other Embassy Suites, but again, as this is more of a business hotel, they aren't putting out the treats a family on vacation usually wants. All in all we all agreed it was worth it to stay in beautiful La Jolla for our San Diego trip. An added bonus is the mall across the street (we went there for dinner the first night. Fun! Watch the ice skaters as you dine! Try the Noodle Bar (not sure of the name) in the food court. So delicious!). And PF Changs shares the hotel parking lot. Great hotel!", "Date": "February 19, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "redondo beach", "Title": "“Nice hotel for a family of 5”", "Author": "baseballm0m_3", "ReviewID": "UR124179110", "Content": "We are a family of five, so we are limited as far as finding a hotel that sleeps 5. We have been to this hotel a few times and I love that they have updated their rooms. Very modern and very comfortable king sized beds! The pull out sofa is a bit less comfortable so I usually bring along our aerobed for the kids. This is a family friendly hotel so you do get quite a few kids running around the halls. It could be a little noisy in the front room, but the back bedroom is very quite. The indoor pool is nice as you don't have to hope for good weather to use it. The restaurant in the hotel was good and there's a PF Chang's next door. However the service there was really bad and we waited at least an hour for our food to be served. The reason I didn't give this hotel 5 stars is because I've noticed that the people working here aren't very friendly.", "Date": "February 5, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "USA", "Title": "“Embassy Suites is always a great place to stay.”", "Author": "Tommy88", "ReviewID": "UR123669213", "Content": "We enjoy staying at Embassy Suites hotels. The suite was very comfortable and clean. We enjoy the cooked to order breakfasts and the afternoon \"happy hour\". The staff was very friendly and helpful.", "Date": "January 26, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Pompano Beach, Florida", "Title": "“Thank you Trip Adviser reviewers!”", "Author": "PYT13", "ReviewID": "UR123369595", "Content": "We stayed at this hotel last night and chose it because of the reviews we had read on Trip Adviser. Using Trip Adviser to check out hotels in advance adds real value to a hotel stay. We had a great welcome from Kathleen on receptio, even though it was only noon and check is 4pm. We went to relax in the sun by the pool and Kathleen came to find us with our keys about an hour later. The hotel is very modern and comfortable. The suite was lovely. Free bottled water in the room. Manager's 5.30 til 7.30 reception with complimentary wine, beer, spirits. Fresh cooked hot breakfast (again complimentary) and even though they warn you that it will be busy with queues between 8 and 9, we turned up at 8.30 and waited about 5 minutes for omelettes. We strongly recommend this hotel for both business and leisure travellers.", "Date": "January 20, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Kuwait", "Title": "“Great rooms and great location”", "Author": "Riyah", "ReviewID": "UR123101721", "Content": "This is a comfortable and contemporary Embassy Suites. It is located right next to Westfield's UTC mall and steps away from PF Changs. We had 2 connecting 1 bedroom suites and then moved to a 2 bedroom suite. All the rooms were well appointed and spacious, with a microwave and coffee making facilities. There are laundry machines on each floor as well as vending machines for sodas etc and ice. Morning breakfast is v early and quite crowded so get up as early as possible if you are hungry. There is also a managers reception each evening with complimentary drinks and snacks. Kids will love the glass elevators and fish ponds. There is also a pool. I would def go back.", "Date": "January 15, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Scottsdale, Arizona", "Title": "“Nice Hotel, Good Location”", "Author": "SteveNScottsdale", "ReviewID": "UR122870127", "Content": "We stayed New Year’s weekend at the Embassy Suites La Jolla and enjoyed our stay. The check in process was handled quickly and efficiently. The employee that checked us in was friendly and had great customer service skills. The room was very clean and everything worked as it should. One day the housekeeper forgot to leave clean towels; it only took about 5 minutes to deliver them after I called. The breakfast/happy area was very pleasant and the staff there was very accommodating. We would be happy to stay there again.", "Date": "January 10, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Sheffield", "Title": "“Good hotel - well located for SeaWorld and Legoland”", "Author": "travelling_owl", "ReviewID": "UR122659331", "Content": "I stayed here for 3 nights covering New Years with family. The hotel is modern and fresh with the usual Embassy suites room standards of a seperate living room and bedroom, this is ideal if you have young kids (as we did) as they can have a seperate room and not be disturbed. Hotel is well located and close to the interstate meaning that you can get to Seaworld in 15-20 minutes or Legoland in 30-40. There is a Westfield shopping centre over the road from the hotel, if you want to head into La Jolla it is a 5-10 minute drive and definitely worth a visit.", "Date": "January 6, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "5", "Location": "3"}, "AuthorLocation": "Oakland, California", "Title": "“Great for families”", "Author": "JourProfSF", "ReviewID": "UR122439457", "Content": "After staying in many different kinds of hotels with my family I have to give a vote for Embassy Suites in general and this one is particularly nice. For just a little more than we paid at a lousy Comfort Inn in San Diego the previous night, we had a lovely room with access to a pleasant pool (though it was indoor), a nice fitness center, terrific breakfast. There's a plushness and festive feeling to this hotel. My kids loved it. We were there on a holiday week and the hotel fed breakfast to a huge number of people with great efficiency (unlike the Embassy Suites we stayed in two nights earlier in Valencia where we waited in line 30 minutes to get an omelet). My only quibble is that they nickel and dime you to death (a Hilton tradition!) -- $20 for a cot, $20 for parking, $10 per day for Internet. We ended up passing on the cot and my kids shared the uncomfortable sofabed and we parked around the block for free. Just ask and they'll tell you where you can park. Despite this, I've become a big believer in Embassy Suites as a great chain for families.", "Date": "January 2, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "3", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "HK", "Title": "“very nice stay”", "Author": "lalalandHK", "ReviewID": "UR122242169", "Content": "We stay in Embassy Suites for 3 days during Christmas. This is the best Embassy Suites we stay in CA. The room is clean (perhaps due to the recent renovation), nicely decorated and very comfortable bed and bathroom. Most of all, the location is great, with a big shopping mall across the street and many little shopping village few miles away. The only thing I complain is the air condition which was noisy and turn on and off many times during the night.", "Date": "December 29, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "5", "Overall": "3.0", "Value": "3", "Sleep Quality": "5", "Rooms": "5", "Location": "3"}, "AuthorLocation": "Detroit, Michigan", "Title": "“Good hotel rooms but just okay staff”", "Author": "8isenuff", "ReviewID": "UR122203476", "Content": "We checked in on a Sunday nite. Hotel rooms were nice, big, clean. Beds comfortable, breakfast great as always as was manager's reception. Parking is $20 but I don't know if that is good or bad. Valet Parking in ES Chicago was $35 and in Walnut Creek was $16. There was no one behind the Front Desk when I arrived. Had to wait a few minutes before someone came out from the office. I felt rushed through check in w/o conversation, not even a \"hello\" or \"thank you,\" handed two keys and told I was \"on the 8th floor. That's it. Later standing in line at the Mgr's Reception, I noticed they made Shirley Temples. I ordered two for my kids. The bartender could not be bothered to smile or say hello, but did find time to stop, straighten out the two dollar bills someone left for him as a tip in front of me, then look up at me. The next day during breakfast it looked like only one guy was trying to clean the entire dining area. Poor man. Even at the ES Walnut Creek they had two or three people cleaning the area. I think they are the same size hotels. This hotel had all the great things I love about Embassy Suites - spacious, clean rooms. It just seemed at this particular hotel, the employees did not like working there. Makes things just average.", "Date": "December 28, 2011"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Overall": "2.0", "Value": "3", "Sleep Quality": "1", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Nevada", "Title": "“Friend's Birthday”", "Author": "mikki74", "ReviewID": "UR120300981", "Content": "We stayed here to celebrate a friend's birthday. We kept getting phone calls from management saying that we were too loud and that the guests were complaining. In the meantime, guests with small children gave them free range, breaking dishes, running through the hallways yelling and no one had a problem with that. They also charge $20 per day for parking. Why do you think that is?", "Date": "November 7, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "3", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Seattle WA", "Title": "“Good business hotel”", "Author": "robertoed", "ReviewID": "UR120128911", "Content": "This property is clean, well located, and the staff was very efficient.", "Date": "November 3, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Cleveland, Ohio", "Title": "“Perfect For everyone”", "Author": "SenicGorge", "ReviewID": "UR119987473", "Content": "From the lobby to the rooms, this is a great place to call home in San Diego. The food is excellent, the rooms are clean and the bed is comfortable.", "Date": "October 31, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "3", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Dublin, CA", "Title": "“Comfortable and Convenient”", "Author": "Wildiris117", "ReviewID": "UR119777122", "Content": "I stayed her over Labor Day weekend with 2 of my friends on a girls getaway weekend in San Diego. The room was a pretty standard example of an Embassy Suites. Staff was friendly and accommodating. We didn't try out the snacks during the cocktail hour (too many fun things to do in San Diego) but we enjoyed the full breakfast each morning of our stay. We also appreciated the kitchenette in the room as we brought a lot of our own snack (although be careful - the fridge was a little too powerful and we ended up freezing some of our food). The location was great - not too far from both the 5 and 805 freeways in a nice area near shopping yet not congested. All in all a great stay.", "Date": "October 27, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1"}, "AuthorLocation": "munich", "Title": "“They just put me in a stinky smoker room”", "Author": "gfun69", "ReviewID": "UR119504240", "Content": "As a non-smoker it is an absolute annoyance to be put by the unhelpful und unfriendly receptionist in a stinking smokers room. Since you cannot open the window, there is no way to get a fresh gasp. I rate this as personal injury which should be prosecuted. Additionally parking and internet is very expensive. I will avoid Embassy in future.", "Date": "October 20, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "3.0", "Value": "2", "Location": "4", "Rooms": "3"}, "AuthorLocation": "Brisbane, Australia", "Title": "“Difficult to justify price paid! Far too many negatives...”", "Author": "wasimmehr", "ReviewID": "UR119378497", "Content": "We stayed in the 2 bedded presidential suite, and although most would think this review is not applicable to them, my comments would relate to general things... On the positive side, the rooms are pretty clean and have most things you would expect, minus great views, even on the top floor. On the negative side, we felt that the accommodation was not worth what we paid... The USP of embassy suites is the cooked to order breakfast, and frankly it was a bit of a disappointment with limited selection... And I can't believe that a hotel that caters to tourists can have breakfast finish at 9am! We had to get out of bed just to have breakfast, after not having had enough sleep, which in a way ruined the rest of the day... We could see many others who were half asleep during breakfast, or come in their bathrobes! For an all service hotel, I would expect that a pack of batteries that they had would be delivered to the room, especially when we are paying for it... We were asked to come down and 'sign for it'... Not to happy! Parking is quite expensive at $20, and as explained in earlier reviews, is quite tight for space, especially for a 4wd... To summarize, I would definitely not recommend the 2 bed presidential suite @$500/ night, but if you need to stay in the area for a couple of days for business (thereby having to wake up early anyways), a standard room here at a much decent price could do...", "Date": "October 17, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Caledon, Canada", "Title": "“Great place”", "Author": "Nor18", "ReviewID": "UR119311958", "Content": "The suite was spacious and it came with a free hot breakfast and free drinks for happy hour.", "Date": "October 14, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Sleep Quality": "2", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Scottsdale, AZ", "Title": "“Wonderful breakfast, good location, noisy and dark room”", "Author": "AZPamela", "ReviewID": "UR119077080", "Content": "We've stayed at multiple Embassy Suites and usually choose them because of free airport shuttles, manager's receiption(s), and great breakfast(s). When you factor in these perks, you can justify the price being somewhat higher than other accommodations. In this case, some of those perks were cancelled out by the $20 daily parking fee, but that seems typical for the San Diego area. Hard to find lodging without some form of parking that tends to be from $15 to $35 daily, so the Embassy Suites is right there. Although their parking garage is poorly laid out and because of the single lane entrance/exit, if the garage is full then someone will have to back up if you find yourself in a situation where someone is traveling in the opposite direction from you; i.e., coming in while you're trying to exit. Because parking is scarce, you may also find yourself playing that awkward game where the car that wants your space will absolutely, positively not budge to give you a single inch of extra space because of the fear that your spot will be taken by someone else. Is this the fault of Embassy Suites? Probably not, but when it's rainy and windy in San Diego... it's just not fun. The parking garage has two covered levels and one rooftop level and you do have to walk in open air to get into the structure. FYI for those rainy times. I was surprised that the room was so dark. You have to use the interior lights at all times while in the room. The bathroom has an awkward layout with its huge, oversized door that requires all the space in front of the wardrobe to swing. Beware of that to avoid hitting anyone that is getting something out of the closet. There is an interior control of the cooling/heating in the room. We required a/c while there and it was terribly, horribly loud during the night. The worst part was that there was some sort of interior plumbing that sounded like a waterfall erupting at various times during the night. Loud enough to disturb sleep. And the bed was just too soft and lumpy for our necks and backs. Room 606. The lobby is inviting. Made-to-order breakfast was fast and good. An abundance of choices with a grill that served any style of cooked eggs, pancakes, french toast, sausage, bacon, potatoes. Around the buffet area you would find pastries, cereals, toast, muffins, yogurt, fruit, tea, coffee, fountain soda, fountain juice(s). At the manager's receiption you could be served just about any cocktail of your choice, wine, beer and the appetizers were pretzels, popcorn, chips/salsa, carrots/celery/zucchini with ranch dressing dip. Just a thoughtful way of grabbing a relaxing drink and having a little nibble at the end of the day. Easy access to I-10. PF Chang's is almost on the premises. A nice shopping mall across the street.", "Date": "October 8, 2011"}, {"Ratings": {"Location": "5", "Overall": "4.0", "Value": "4", "Service": "2", "Rooms": "4"}, "AuthorLocation": "California", "Title": "“Excellent for families”", "Author": "STM65", "ReviewID": "UR118117885", "Content": "Pros : This hotel is great for families. The suites are spacious, with 2 TVs. The sofa bed is comfortable. The free real Breakfast is a very good deal - especially for kids. The indoor pool, is great for young kids. Gym facilities are very adequate. Location across from the UTC mall is excellent for shopping. Cons: Tends to be noisy and crowded on weekends due to many families. Not the best hotel for business travellers. Parking is $20 a day ( can add up)", "Date": "September 14, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "4", "Overall": "4.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Las Vegas, NV", "Title": "“Nice hotel, good location”", "Author": "StephanieOng", "ReviewID": "UR118015673", "Content": "We stayed at this hotel with 2 tweens on the busy Labor Day weekend. We all like the hotel, and will consider staying here again the next time we visit SD. Pluses: + SPACIOUS CLEAN ROOM ~ We got a standard 2-room suite. Our room was well appointed with a microwave, an empty mini fridge, a wet bar, a full-sized sofa pullout in the sitting area, and a kig sized bed in the bedroom + GOOD LOCATION ~ Easy access to major freeways, 10 mins. drive to SD beaches, a mid to high-end malls just opposite the hotel, lots of restaurants nearby + PROFESSIONAL AND FRIENDLY STAFF ~ There were many families with kids (MANY!) at the hotel during our stay. The lobby was quite chaotic, esp. during breakfast and happy hour reception. However, the staff were well trained and were able to keep the place together. Minses: - PARKING CHALLENGES ~ The hotel garage is really TIGHT. We drove a RX350, and had difficult times getting in and out of the garage. If you had to use the garage, I suggest parking your car on the first level. On the upper floors, inflow and outflow traffic SHARE ONE SINGLE LANE. We had to park our car on the street on the 1st night b'cos the garage was full, due to a function at the hotel (Hotel did refund our parking fees after we spoke). And street parking was quite tricky on the Labor Day weekend. Patrons to PF Changs would park their car on the street too. We were lucky to always get the LAST spot for our car when we return at around 8pm. - ROOM NEAR ELEVATOR IS NOISY ~ We stayed in a room #830, across from the hotel elevators. My boys slept on the pullout in the sitting area. They complained about the noisy elevators and people getting in/out of it. My husband and I slept in the bedroom, and we did not hear the noises. Guess rooms near elevators are ok as long as no one is sleeping in the sitting area. - INDOOR POOL NOT HEATED, AND OUTDOOR JACUZZI IS TINY ~ well, just our preference - FEE FOR WIRELESS INTERNET ~ However you may use the business center computers to get free access to internet. There are only 2 computers. * The frontdesk has printouts of restaurants nearby, mall map as well as a local map of La Jolla. ** There is a small, nice and kid-friendly pizzeria called Regent Pizza on the NE corner of La Jolla Village Dr. and Regent Rd. It is a few doors next to Starbucks and Einstein Bagels. It makes both NY and Boston style pizza. We had their NY pizza and salads...YUM! *** Also tried sushi at BlueFin, which is in the mall parking lot, next to Wells Fargo. Good fusion sushi, extended menus and great services!", "Date": "September 12, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "4", "Overall": "4.0", "Value": "5", "Service": "4"}, "AuthorLocation": "Chicago suburbs, Illinois", "Title": "“Nice Rooms, Good Breakfast, Pleasant Stay”", "Author": "midwestworldtraveler", "ReviewID": "UR117848005", "Content": "The standards that are typical and expected of all Embassy Suite properties -- complimentary 'real' breakfast, good-sized rooms, and open lobby/central areas -- are all present in this LaJolla property. The breakfast area is large, and the food was very good. There's a nice lounge for relaxing in the evening that can handle a large group (we had about 20 in our party). The property is not close to the beach, but instead close to the business district. It is a bit off of the main highway. But this didn't feel like a disadvantage to those of us that wanted to visit the beach - it was an easy drive to the beach. We will be back.", "Date": "September 8, 2011"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Albany, Georgia", "Title": "“Great location.”", "Author": "USMC_Retired", "ReviewID": "UR117840766", "Content": "Overall Impression: I loved this hotel. Probably one of the best Embassy Suites I have ever stayed in. Was here on business, but would stay for vacation. With my Hilton Honors Diamond status, I received HH bonus points. PROs: -Location. Close to the University and shopping and resturants -Breakfast and Evening Reception -32”/37” HD TVs -Room was spotless -Business Center CONs: - $20 Self Parking", "Date": "September 8, 2011"}, {"Ratings": {"Cleanliness": "2", "Sleep Quality": "5", "Overall": "4.0", "Value": "4", "Service": "4"}, "AuthorLocation": "temcandelario", "Title": "“Very Nice Weekend Trip”", "Author": "temcandelario", "ReviewID": "UR117411567", "Content": "We stayed here 8/26 and 8/27... Pros: - The hotel layout, room layout and free breakfast - as with all Embassy Suites - Although parking was $20.00 (get over it - its La Jolla) the parking was very convenient - No issues with noise, comfortable beds and pillows Cons: - The cleaning was not thorough (although we are a bit extreme - we bring sheets, pillow covers and wipe everything down with alcohol.) We found hair in a \"clean\" towel (The cleaning issue runs across all hotels these days - maids assigned 18 -20 rooms or the \"saving the environment\" excuse to not change sheets, and wash covers on daily basis. - Carpet is worn and the room is slightly dated Front the desk folks: We were given a 3rd floor room and requested higher floor for better view - no issues and friendly staff - Thanks! Overall: Enjoyed our stay - no second thoughts! The area is so beautiful and hotel did not diminish our enjoyment. - So don't over think it - this is a solid choice. We will try the Hyatt down the street - next time around.", "Date": "August 29, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "4", "Rooms": "5"}, "AuthorLocation": "", "Title": "“Restful & very nice!!!!”", "Author": "kastombe", "ReviewID": "UR117377554", "Content": "Loved their Happy Hour, great breakfast.. Lots of options. All and all a great place to stay!!!", "Date": "August 28, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Location": "5", "Rooms": "4"}, "AuthorLocation": "", "Title": "“Good value and a good breakfast!”", "Author": "Zahpok", "ReviewID": "UR117190151", "Content": "The staff at the omelet station were always patient and friendly. They replenished the buffet often. The rooms were clean but a bit dark. One day housekeeping skipped our room entirely, but they made up for it and had someone come fairly quickly to clean the room. Their outdoor bar area is really lovely and we really made the most of it. My only disappointment is the pool area. Guests left their food and drinks on the table, which wasn't cleaned up for hours. The indoor pool itself was very VERY small. It was good enough for the little kids though.", "Date": "August 24, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "3.0", "Value": "5", "Service": "4"}, "AuthorLocation": "NJ", "Title": "“Good Value - Family Friendly”", "Author": "macfamily804", "ReviewID": "UR117186760", "Content": "Stayed at the Emabssy Suites La Jolla for 8 days along with 5 other families, all with kids ranging from 2-18. Location: 20 minutes from every attraction in San Diego, 1 mile from Hwy 5. Hotel is located directly across the street from large mall (150+ stores). It shares a parking lot with PF Changs. 2 major strip malls with McDonalds, CVS, Baskin Robbins, Supermarkets ect... are located within 3 blocks (10 minute walk). On of the most beautiful churches you will ever see was less then a mile away. Was even nicer at night when it was lit up. PARKING IS NOT AN ISSUE: we had 5 cars and had no problem parking on the street at all hours of the day & night. Property is nothing special, located in area with office buildings. Small fountain and nice landscaping as you approach. 3 story parking garage off to the side. Inside lobby had nice ponds with large coi fish. Several large screen TV's had sporting events on all night. Pool is small, but served its purpose. Plenty of towels all day and night. Pool closed at midnight. Sauna and hot tub were clean. Gym was small but again, served its purpose. Rooms were spacious and clean. Only negative would be the loud air conditioning units cycling on & off. Refrigerator was not working but maintenace brought up a new unit in under 5 minutes. Towels were plentiful & house keeping did a great job all week. Rooms had blowdryer, iron & board, coffee machine & microwave. 2 TV's, No in room safe, but you could get a safety box down at front desk. Washer & dryer were free and available pretty much all the time. Great perk ! Complimentary breakfast was good ever day. Never waited more then 5-7 minutes on line for cook to order omlettes. Always plenty of food. Good selection of frenchtoast, pancakes, eggs, cereal, pastries, fresh fruit, yogurts, oatmeal & 4 different juices, 5 different teas. Breakfast was a great value, only drawback was that it ended at 930 on weekdays (would prefer 10am) 1030 on weekends. Finding table was never an issue and the dining area was kept clean by freindly & smiling workers. Complimentary Happy Hour 530-730PM every nite was another great value. Nothing like coming in from sightseeing all day and grabbing a cold bud light or killians. The hotel seems to cater to alot of families, would have loved to seen a room set up with video game, ping pong table ect... Think security guards would appreciate that as well as they were chasing kids all weekend long. lol Overall, the Embassy Suites La Jolla was a great value. It wouldnt have been my choice of hotel being that it was 20 minutes away from most attractions, however it was easy to get to and never any traffic. Staff was friendly and helpful. Would reccommend this hotel to other families. Only 10 minutes from La Jolla Coves where you can go kayaking to the caves. Also worth the short drive at sunset to \"Childrens Pool\" where you can also see seals & sealions hanging out on the rocks. Seaworld was nice, San Diego Zoo was over rated (Bronx Zoo much nicer) Petco Park is beautiful baseball stadium. Old Town was nice with good Mexican Restaurants, Little Italy was Little. Only several blocks long and located on India Street, still cant figure that out??? Gaslamp Section was nice. Bay Front was nice. Coronado is definetly worth a day trip. Beaches of Southern California are over rated. Miami Beach & Florida beaches blow them away. Water is warmer, sand is whiter & softer. San Diego was a nice, small & clean city. Glad I had opportunity to visit.", "Date": "August 24, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "4.0", "Value": "5", "Service": "4"}, "AuthorLocation": "", "Title": "“\"One of the Best Hotels during our 2 Week Stay in Cali\"”", "Author": "Comesanas", "ReviewID": "UR117009133", "Content": "We had stayed in numerous Embassy Suites and other hotels, the La Jolla location ist the best by far! Our room was very accommdating, comforatable, decorated very nicely with up ti date furnishings. Our daily breakfast and happy hour was awesome. We started our day very full with a cook to order omelet, etc.., only to return to a welcomed happy hour with awesome appetizers. Downtown attractions such as San Diego Zoo were only 15-20 minutes away and La Jolla Beach was very close by. Ths hotel is the best stay for the vaule!!", "Date": "August 20, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "4"}, "AuthorLocation": "Coastal North Carolina", "Title": "“Always A Pleasure”", "Author": "anncgrl", "ReviewID": "UR116972161", "Content": "I have stayed at the Embassy Suites in La Jolla several times and have found the accomodations and the atomosphere to be very enjoyable every time. One of the best parts of my stay is the delicious breakfast that is included in the cost of the room. My breakfast was made to order or there were numerous options such as fruit, cereals, bagels, etc. Since I was traveling on business this accomodation was perfect for getting ready to leave for meetings on time and made my food budget stretch. It is also convenient to La Jolla Beach and even to a hospital which, unfortunately, I had to use on one visit. I love this hotel.", "Date": "August 20, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "5", "Overall": "3.0", "Value": "3", "Service": "3"}, "AuthorLocation": "San Diego, California", "Title": "“Take the stairs”", "Author": "Mctsnowboarder", "ReviewID": "UR116732850", "Content": "This place by far has the worst elevators I've ever seen. There are four but out of our three night stay there were only three working. Our room was on the top floor so we had to wait to get picked up and then stop at every other floor on the way down. Due to the slow service our rides up and down were always jam packed. This hotel needs to get a better elevator service, like they do in Vegas. Designate two to go up the top floors and the other two to go the lower floors. It's not rocket science. Also the $20 a night for no parking or very little parking in the way parking garage is a joke!!! Good luck on finding a spot after 9:30pm. The rooms were nice but the flat screen tv sucked. They had the worst HD I've ever seen. If you can handle lines then breakfast will be enjoyable for you. I would think that in a big city the size of San Diego is you'd be able to find a better place to stay.", "Date": "August 15, 2011"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "tallchick1978", "Title": "“Comfortable Accomodations”", "Author": "tallchick1978", "ReviewID": "UR116283505", "Content": "Great location - across the street from a mall & a PF Chang's. Hotel offers a complimentary breakfast, comfortable bed, nice living room. If I ever get back to San Diego, I would stay here again.", "Date": "August 4, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "4.0", "Value": "3", "Service": "4"}, "AuthorLocation": "Tucson, Arizona", "Title": "“Loved our stay here”", "Author": "Momtothree14117", "ReviewID": "UR115998355", "Content": "We stayed here over the 4th of July weekend and had a great time. The location was great for us and my husband really liked the fitness room. Due to the holiday, it was quite busy probably sold out but I didn't feel cramped. The housekeeping staff was great and we will definitely stay here again.", "Date": "July 29, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "4"}, "AuthorLocation": "Boulder, Colorado", "Title": "“Great hotel and location”", "Author": "PWithnell", "ReviewID": "UR115919911", "Content": "We stayed in one of their two bedroom (king and sleeper sofa bed) suites. Even with two children, my wife and I found that the room was spacious and offered all the conveniences we needed, including a separate dining area and a lockable door between the bedroom and great room. Indoor pool is small but functional and worked well for us. Location placed us in the middle of our destinations which included Legoland and San Diego Zoo. Had no issues parking as the hotel has a separate parking garage next door. We would definitely use this hotel again for our next visit.", "Date": "July 28, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "5", "Overall": "5.0", "Value": "3", "Service": "5"}, "AuthorLocation": "", "Title": "“Our favorite place to stay”", "Author": "sedona888", "ReviewID": "UR115874291", "Content": "Even though we only stayed one night in La Jolla, we were able to relax in our room at Embassy Suites. Had dinner at PF Changs across the parking lot. Nice atmosphere. Very comfy beds and pillows. There were a million kids there (soccer tournament) but since I am a mom, it didn't bother me that much to have them running around. We had to checkout before the breakfast, but it's always good there. Price of the room was extremely high, but there weren't a lot of options since ComicCon was in town when we were in the San Diego area. Always recommend Embassy Suites!", "Date": "July 27, 2011"}, {"Ratings": {"Cleanliness": "3", "Sleep Quality": "3", "Overall": "4.0", "Value": "3", "Service": "4"}, "AuthorLocation": "Bakersfield, California", "Title": "“GOOD BUT NOT BEST EMBASSY”", "Author": "mike-in-bako", "ReviewID": "UR115480752", "Content": "My family and I stayed three nights at Embassy's La Jolla location. It's your standard set up for this hotel with the free breakfast, manager's reception, indoor pool, etc. Unlike some I've stayed at, this one seemed to be occupied by mostly families which is fine but business travelers might want to shop around. Beyond what most other reviewers are reporting, this is what I have to add or request of the hotel: 1. Never understood why every Embassy location charges $11 per day for internet. Even a wired connection cost the same rate. Travelers should factor that into a price comparison with other hotels. 2. Parking is $20 per day extra. As busy as this place was, I have no idea if street parking is really an option. I couldn't imagine hauling luggage any further than the paid garage. I opted for the convenience of having the car nearby. 3. The room we had was getting pretty worn based on mold in shower, damaged tile and depleted carpet. 4. Free use of laundry machines was a surprise and plus. 5. The staff was generally pretty good, particularly the ones working the breakfast area which was hectic and chaotic at times.", "Date": "July 18, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "", "Title": "“BEST VALUE EVER”", "Author": "SEG-lover", "ReviewID": "UR115464925", "Content": "This hotel was the most family friendly and excellent value in California. The breakfasts every morning were the best and all family members found much to love. The suites were clean and spacious. The staff was friendly and attentive. Then to top it off a nightly happy hour. The kids swam daily and also enjoyed fun non alcoholic drinks. From now on I will never stay anywhere besides an Embassy Suite hotel. Great job to them and they helped make our Calif. trip wonderful!", "Date": "July 17, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "4.0", "Value": "4", "Service": "4"}, "AuthorLocation": "Camarillo, CA", "Title": "“Good Value in San Diego”", "Author": "seadog22", "ReviewID": "UR114807105", "Content": "The Embassy Suites in La Jolla has alot going for it - good location between the 5 and 805 interstates for quick access to San Diego attractions and many restaurants, attractive appearance with a refurbished atrium, above average breakfast and evening manager's reception, clean rooms, friendly staff, BUT as other reviewers have noted, there are some drawbacks. The $20 a day parking fee is way overpriced for the location, the hotel is very popular with families so the breakfast is very crowded at times (although there is a hot buffet line separate from the made to order line which is fairly quick), and the soundproofing between rooms needs work. All in all a good value for the money and a hotel worth considering in San Diego. Watch the rates before your stay, we were able to get a very good price by switching to a prepaid rate (but be aware you cannot cancel so you are committed to paying).", "Date": "June 27, 2011"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "Palo Alto, California", "Title": "“Great value for family travel”", "Author": "Franklin_Kildaire", "ReviewID": "UR114643218", "Content": "Hotel left a great impression on our family, and we'd put this hotel at the top of our list for a future trip. Stong point 1 is location. For family travel, we prefer suburban La Jolla to downtown San Diego. Near (but not next to) interstate 5. Not beachfront, but short drive to beach. Next to a shopping complex and office park. San Diego attractions and neighborhoods are easy to get to from hotel site. Strong point 2 is quality of premises and staff. Personnel are welcoming and efficient. Facilities are well maintained (gardening), exercise facilities/small pool, laundry facilities on premises, business center w/ pcs and printers. Facilities otherwise consistent with Embassy Suites hotels in other cities. Strong point 3 is quality of Embassy Suites features. Complimentary breakfast is top-notch (good selection, quality), efficient (guests served quickly w/o being made to feel rushed). Complimentary manager's reception also first class, not just an afterthought. What we experienced here was better than what we've found at other Embassy Suites locations. Weak point is a $20/night parking fee. I could understand this at a downtown location or with valet services but find off-putting at a self-park suburban location. Another reviewer mentioned on-street parking, but I respectfully disagree: it's really hard, on the spot, to make a snap judgment about availability and safety of on-street parking. To be candid, what bothers me most is the extra charge at a chain that markets lots of features included at a fixed price; had Embassy Suites increased the room rate by $20/night, we'd probably still have chosen the hotel. Our stay was for family travel, and our review is positive. But we'd echo other reviewers and caution business travelers. This hotel offers good service so has high occupancy rates, with lots of couples, families and school groups; this, plus the building's atrium design, generate traffic and some noise. For business travelers seeking calm, there's an Embassy Suites at downtown San Diego that's may be better suited (with no disrespect intended towards management of the La Jolla Embassy Suites).", "Date": "June 22, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "4", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Upstate NY", "Title": "“Excellent Value-good location”", "Author": "fingerlakesdweller", "ReviewID": "UR113125153", "Content": "We found the staff at Embassy Suites, LaJolla to be exceptionally courteous, making us feel most comfortable & welcome. The room was very comfortable. We took a tip from other travelers & parked on the off street, saving 20 dollars per day. Easy access to the 5--hotel is centrally located-easy to get to/from attractions. When buying internet service, understand that you pay by device. For example, if you have an IPad, and a lap top--you will be charged for 2 connections if you access the interenet from each.", "Date": "June 13, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Santa Cruz", "Title": "“Very nice hotel - expensive, but no more so than others in the area.”", "Author": "MidFortiesMom", "ReviewID": "UR109146748", "Content": "My husband and I have stayed in five hotels in La Jolla in the past year and this is the one we'll be returning to. It's expensive, but all hotels in the area are expensive. For the money and the location (if you want to be near UC San Diego), it was our choice. The Marriott is a little newer but is expensive during the week (great prices on the weekends, though). The Sheraton is nice but is somewhat worn. The Residence Inn is very old and dirty. Embassy Suites has a very impressive, soaring lobby with koi ponds, waterfalls and plants. There is a made-to-order breakfast included that should please everyone. Beware of the price because in-room internet is more ($11.95 a day) and parking is $20 a day. There is lots of free parking on the street as long as you don't try to park on a school day (it's taken early). Make sure the hotel credits you back for parking. There is a nice business center with three computers and a printer that you can use for free (20 minute limit if others are waiting) so you don't need the in-room internet. What we really liked was that there are two rooms in each suite with a real, solid door between them. So many suites don't seem to have two real rooms but this one does. The staff seemed eager to please when we were there. A bit older but not too bad and very clean.", "Date": "May 20, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Moreno Valley, California", "Title": "“Made our stay great!!!”", "Author": "cassidi9", "ReviewID": "UR107567368", "Content": "I stayed at this hotel since we were going to a Dance Competition at the University of San Diego. This hotel was amazing!! When I called the hotel to see if I can check in early the front desk agent Jennifer who answered the phone was very polite and professional. She made every effort to check us in early. When we arrived at the hotel we were greeted by Jennifer as well. When we were in the lobby my 3yr old was amazed by the fish in the pond and didnt want to go anywhere but stay with the fish. The bed was so amazing and comfortable!!! We loved it!! The next day Saturday morning we came down and enjoyed the best breakfast!! My 3yr again was so excited to see the fish. We went to the desk and ask what kind of food the fish eat, and he was so nice and helpful he went to the back and got a little baggie of food for my 3yr old to feed the fish. This made her day!! Thank you so much for giving us such a great experience. I will come to the Embassy if I'm in San Diego again.", "Date": "May 9, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "2", "Sleep Quality": "1", "Rooms": "2", "Location": "2"}, "AuthorLocation": "Huntington Beach, California", "Title": "“KIDS......And More Kids....”", "Author": "fastdata", "ReviewID": "UR106527981", "Content": "After doing extensive online research....I booked at the Embassy Suites as the Hyatt was asking for too much money. I looked at all the reviews and landed here. Embassy Suites is a type of hotel you either love or hate....As it has an enclosed atmosphere that is really not for those looking for quiet.. The first thing you notice kids everywhere...There was a waterpolo meet somewhere and all the kids were everywhere...I can live with the kids, HOWEVER the hotel allows these kids to play running up and down the halls. Yelling down to their friends from higher floors etc. They employ 3 guys to monitor the kids....that is how bad the kid situation is....For the good...the Manager reception free drinks and snacks really cool.... As for the room....Was put 2 rooms away from the elevators......When first got to room.. was ok but as the night went on you could hear the shaft noise and bell.... Lets just say sleeping was not easy...not only that...some sort of generator noise all night.. Made a complaint and was satisfied by result.... As for the breakfast very nice.... Overall would give this hotel a B- as no pool to speak of and jacuzzi was tiny..", "Date": "May 2, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "5.0", "Value": "5", "Sleep Quality": "3", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Dubai", "Title": "“Will go back again!”", "Author": "DXB-chocolatechips", "ReviewID": "UR106187053", "Content": "Apart from the welcoming lobby, the staff at front desk were very hospitable and knowledgable. The suite was also welcoming, clean and comfortable... however, the air-conditioning unit woke us at night when it kicks in! We have made our comments at the hotel. The manager's drinks in the evening was very pleasant and relaxing especially after our full day of sightseeing. Nice smells from the live cooking station during breakfast was a hit with our family too. It was very convenient having the shopping mall Westfield just across the street . As for parking, we opted to park on the street outside the hotel instead of paying the hotel fee of USD 20 a day. Plenty of spaces. Our family really liked this hotel and our children still talk about Embassy Suites! I am sorry that I do not have any photos of the room itself because of our children's excitement when they saw the clean, freshly made beds, hence no neat beds to take pics of!", "Date": "April 30, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "3", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Los Angeles, California", "Title": "“Family-oriented hotel than business-travelers”", "Author": "Stevedusa", "ReviewID": "UR103395981", "Content": "This is my first time staying at the Embassy Suites in La Jolla. It wasn't the first choice nor it was out of faint of the heart. However I will admit the loyalty program pays. Most of the business travelers pick their stay based on the location. I am no exception. However keep in mind that the location of the hotel isn't a tourist hotspot, although La Jolla is about 10 miles to the west and the major tourist attractions are down south. What surprised me is that there are a lot of families here, which translates into lots of kids. Guests aside, the hotel is clean, modern and very guest friendly. Free breakfast, 2-hour free drink daily, what else can you ask? I stayed in the Executive suite. Upon check-in I was greeted by if not one of the most friendly staff I've ever met. Prompt service and makes me feel like a valued guest all the way. The room is very clean, nicely lay out and make me feel like home. Now if you staying here on a weekend or peak-tourist periods, you will hear kids. Door closed or not. Some running some screaming, but if that bother you or not is up to you. The bedroom on the other hand is like a standard hotel room but upgraded. Ceiling-to-floor window, comfortable bed and sheets. However if your room is facing the streets, prepare to hearing some car noises. Also the A/C unit can be loud. In my case it actually woke me up when it kicked in. However you can always keep it running to combat the outside noise but it's louder than comfortable level to sleep soundly, if you are a light sleeper. Over all I suggest this hotel to those who wants to get a suite but don't want to pay an arm and a leg for it. However some noise problem might be important to those who likes peace and quiet. This hotel is more suitable for families than business-travelers.", "Date": "April 9, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "so cal", "Title": "“Best Embassy Suites in San Diego Area”", "Author": "joantri", "ReviewID": "UR103049990", "Content": "We have stayed at the other Embassy Suites in the San Diego area and this one is far nicer than the others. The room amenities as well as the maintenance of the room furniture seems to be new and not worn, did not have stains on the carpet, bathroom fixtures and tub not dingy. The location of this hotel is great. It is close enough for a drive to downtown La Jolla, but you avoid the traffic of getting in/out of that area. Plus, you are close to Balboa Park and across from a mall that has an indoor skating rink. The mall has some fast food options, but for a dining experience, I would go elsewhere. There is parking available on the street, so the parking of $20 overnight can be avoided. The housekeeping staff does an excellent job of daily cleaning with the attention to small details which is very impressive for an Embassy. We will definitely stay here again for the convenience of the location to all area attractions as well as the cleanliness of the rooms and attentive staff.", "Date": "April 6, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Milwaukee, Wisconsin", "Title": "“Great Customer Service and Family Hotel”", "Author": "lindsey2006", "ReviewID": "UR102966833", "Content": "We were met with great help from the moment we arrived. We were immediately offered help with bags and a luggage cart. Check in was no problem, and very helpful. We were offered local info for restaurants and a map. Also staff was frank about the fact that you could easily park for free on the streets around the hotel and not pay for the ramp. The room was comfortable, had a pull out couch and chair in a sitting room, as well as a desk. There was a wet bar, refrigerator and microwave. All worked well and things were clean. The bathroom was nice sized, not too small. the bedroom had two comfy beds with nice linens. There was a TV in each room - the front sitting room and back bedroom. You do have to walk through the sitting room to enter the bedroom, so if you have a child napping in the sitting room you may be trapped in the bedroom. Free hot breakfast with cooked to order eggs/omlets each day. It was always busy but we always were able to find a place to sit, and there was plenty of food availble, nothing ran out. great free happy hour each night with beer and wine as well as some light snacks. The room was quiet, and we were on the top floor which i think helped as well. There was a great indoor pool, really a hot spot for kids and families. The hot tub was outside, just a few steps and great. Everyone was very friendly and helpful!!", "Date": "April 5, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Richmond, Canada", "Title": "“Great Hotel”", "Author": "travelval2010", "ReviewID": "UR101817318", "Content": "Great location and access to shopping and highways. Rooms are clean, updated and the breakfast is the best for a hotel that includes breakfast. The only downside is that it has many young kids, which at times could be a bit noisey and we found some of the furniture with pen scribbles", "Date": "March 28, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "", "Title": "“Excellent location, excellent service, happy hour, excellent breakfast, excellent restaurant. This was an excellent hotel.”", "Author": "Missy116", "ReviewID": "UR100665566", "Content": "What a joy to find a hotel that actually lives up to it's promises on their website. I'm usually at least a little, if not terribly disappointed when I arrive. But in this case I was anything but disappointed. the staff was outstanding! The location was excellent, close enough to I-5 to get anywhere very quickly. Situated in beautiful LaJolla, with many restaurants and shops within walking distance. Just close enough to the airport to make it very convenient, but without the airport noise. We will definitely stay here again. The only negative thing I can think of is the $20 per night parking fee, but there is plenty of street parking!", "Date": "March 18, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Ottawa, Canada", "Title": "“Excellent space, yummy breakfast and FREE evening drinks!”", "Author": "Aprilfool1962", "ReviewID": "UR99541268", "Content": "We stayed in La Jolla for 3 nights in Jan. What a great city - and not just for the zoo either. This hotel fit the bill nicely. The best feature of this hotel is the front desk staff. Our guy was awesome with info on the city, beaches and directions. Happy hour is about 2 hours of free bar drinks and snacks. Their restaurant is pretty good too. All of the rooms are suites, which was great for us, as I am an early riser and my boyfriend prefers to sleep a bit longer. If there was a downside to this hotel - it would just be that the parking lot is not attached to the hotel. But really...it was warm even in January. The walk was nothing in that beautiful SD weather.", "Date": "March 9, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "5", "Location": "4"}, "AuthorLocation": "los angeles", "Title": "“Nice stay but parking is too much for the area”", "Author": "historyteacher50", "ReviewID": "UR99065138", "Content": "Had an enjoyable stay - staff was friendly; excellent breakfast and Happy Hour. The rooms look recently renovated and very clean. $20 is too much for parking in this area - it's not downtown San Diego. Another thing that was ridiculous was the per laptop charge per room. We were using 2 lap tops and we had 2 charges of $11 totalling $22. Most hotels charge one internet access charge.", "Date": "March 5, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Sleep Quality": "3", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Greenwich, ct", "Title": "“Good hotel, with some minor flaws”", "Author": "CTTraveler56", "ReviewID": "UR98930012", "Content": "The good: - clean rooms and common areas - nice staff - good breakfast - great open bar manager's reception, from 5:00 to 7:30 pm The bad: - during weekdays, breakfast stops promptly at 9:00 am - cancellation: 48 hrs - internet: $ 10.98 for a lousy slow connection (have your antivirus up to date, as I got infected) - $20 for parking in the garage is a bit too much; if you're not scared of a little walk, there is plenty of spaces within one block. - double check the restaurant list provided: one of the recommended restaurants had a wrong address", "Date": "March 4, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Houston, Texas", "Title": "“Consistent Quality from Embassy Suites”", "Author": "passandshoot", "ReviewID": "UR94723991", "Content": "Overall what you expect from Embassy Suites. I guess in California it is also expected that you pay $20 a night for hotel parking for a parking structure that is difficult to navigate and the spaces are too small. Hotel has some construction going on in the lobby area. But room was clean, comfortable and quiet.", "Date": "January 28, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Agoura Hills, CA", "Title": "“Excellent service, great stay”", "Author": "katlive", "ReviewID": "UR92135282", "Content": "For my friend's birthday we stayed here and had the most marvelous time. The staff was extremely accommodating and very helpful for all of our requests. We arrived just in time for happy hour, which was a great suprise and really enjoyed breakfast the next morning. The rooms were huge and the beds were extremely comfy. It is definitely a place I will stay the next time I go to La Jolla/San Diego. My only semi complaint is the same with all hotels in the San Diego area - I think it is ridiculous to charge for parking when you have a captive audience!!", "Date": "January 7, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Alaska", "Title": "“Lovely staff and very nice location”", "Author": "Alaskanworker", "ReviewID": "UR90756118", "Content": "Rooms are fine - nothing wonderful, but the location for the value was very good. The gym is terrible - please upgrade this facility or just close it down! Nice breakfast.", "Date": "December 26, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Sleep Quality": "4", "Rooms": "4", "Location": "3"}, "AuthorLocation": "London, United Kingdom", "Title": "“Comfortable but really a business 'one nighter'”", "Author": "mackdaddynewton", "ReviewID": "UR90327978", "Content": "We had four nights at the Embassy Suites La Jolla and it was a mixed bag. Location is pretty good, although you definitely need a car. They do charge $15 a day for parking, but that seems fairly standard. Rooms are good, with separate living room and little kitchenette area. They are quite gloomy - all living rooms off the central atrium, and they are fairly '1970's' in decor and style. But comfortable and functional. Free breakfast buffet is really good and they have a free happy hour type thing in the early evenings. Real bonus having a PF Changs next door - definitely the highlight for our 2-year old! The pool is decent, gym not too good. We ate in the hotel restaurant once, not very good and more aimed at afterwork drinking crowd. Overall, good hotel but we felt overpriced. We booked online and when tax included we paid over $800 for 4 nights.", "Date": "December 20, 2010"}, {"Ratings": {"Service": "2", "Cleanliness": "4", "Overall": "3.0", "Value": "4", "Sleep Quality": "4", "Rooms": "3", "Location": "3"}, "AuthorLocation": "California", "Title": "“Good Price, Good Location for a La Jolla Stay”", "Author": "ATravelerCalifornia", "ReviewID": "UR87556525", "Content": "My stay at this hotel was nice, located conveniently between the 805 and 5. This hotel is great for those who want to enjoy being near by La Jolla (Located La Jolla UTC) without the expensive La Jolla Shores price. I found the rooms and lobby to be clean and comfortable. If I had any complaints I'd say rooms are a bit dated but why would you go to San Diego just to hang out in your hotel room.", "Date": "November 19, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Highland", "Title": "“Take your kids and save money at Embassy Suites San Diego.”", "Author": "SoCalMomHighland", "ReviewID": "UR86865692", "Content": "We have 3 teenage boys and the breakfast they provide at Embassy Suites fills the boys up and they like it. We all enjoy the free happy hour and we all have a great time sitting around and relaxing and visiting. It is worth it to us to go to ES because of the \"all suites\" and the food. We go here a lot and 3 times we have been upgraded to the presidential suite ( 2 bedrooms, 2 bathrooms, full living room, dining area, and the most wonderful loos you have ever seen.) The only downside there is the hotel restaurant. The food is pretty limited, expensive, and not all that good. They are never busy and I would guess that accounts for there lack of effort. The people at the front desk seem to be always on edge because sooo many people come in rude, demanding, and act like they deserve Waldorf Astoria treatment for 1/3 the price. Basically, very family friendly, a bit noisy, but clean, no bed bugs, and affordable.", "Date": "November 12, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "3.0", "Value": "3", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Signal Hill, CA", "Title": "“Not as nice as other Embassy Suites”", "Author": "Artybill", "ReviewID": "UR86413690", "Content": "My wife and I have stayed at more than a half dozen Embassy Suites in several states. We love Embassy Suites - Great bang for your buck! I'm not saying this particular property was not clean and comfortable, but the front desk people were not very helpful. and it costs $17 a day to park. Considering the fact that it is located in a high-end business area of San Diego/La Jolla called \"the Golden Tiangle\" I was disappointed at the level of service we received. There were no parking spots reserved for check-in so one has to park in the parking structure (no elevator) and haul your own bags. The bellperson is not always present and there is only one luggage cart. The breakfast offerings were minimal compared to other Embassy Suites. When my wife went to use the pool for the first time - we discovered her room key card did not work (1 of 2) She as not asked her room number but rather refused assistance unless she showed ID - she was on her way to the pool!! She didn't have ID! When we complained to the manager, we got a wimpy \"that shouldn't have happened\" No real apology or effort to make it up. As I said - when compared to other Embassy suites and considering it's location - I was dissapointed.", "Date": "November 8, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Minnesota", "Title": "“Nice hotel, nice location, wish service were better”", "Author": "RickyBobbie", "ReviewID": "UR85541908", "Content": "Overall this is a nice hotel in La Jolla. The layout is typical for Embassy Suites but we did not notice excess noise from the courtyard. Rooms were clean and reasonable in size. The living area is in the front half of the room, with couch and chair, work-desk, phone, flat screen tv, small fridge, microwave, coffee maker and sink. If you are having an extended stay, you could keep some food/drink in the room but it's not a kitchenette. The bedroom was comfortable with its own flat screen tv and the bathroom was clean and modern. The breakfast is excellent and free, and the service staff was friendly and efficient. The fitness center was nice too--a decent size pool and modern cardio equipment with some hand weights. Our only complaints were the extra (and in our minds, excess) daily charges for what many hotels include for free: $19 for parking and $14ish for internet, and the lack of responsiveness from the front desk. When we complained about the internet charge, the front desk mentioned they had a business center where we could use the internet for free. It's not the same. Also, we had a few issues with our room--the phone in the bedroom would not call the front desk and the bathtub would not drain. We called about both and neither was fixed nor was there a follow-up call to verify the isses had been addressed. The coffee in the room was never refilled. Upon check in, our Hilton Honors membership was not recognized nor does it get you anything other than points. So, if management would encourage their front desk staff to respond quickly and follow up with guests, we would have rated the hotel higher. Otherwise, it's still a pleasant stay.", "Date": "November 1, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Sleep Quality": "4", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Tustin, California", "Title": "“For an Embassy Suites, good but short of great.”", "Author": "Maikolo", "ReviewID": "UR84911644", "Content": "For an Embassy Suites, this is a good hotel but short of great. Don't get me wrong, I don't think you will be disappointed. I checked into my room and discovered a bath tub full of backed up sewage. But, costumer service was great, and gave me an upgraded room. So I can't complain about that. The units are very roomy with a separate bedroom and large living room. Indoor pool and outdoor jacuzzi are a little small but still nice. Like most Embassy Suites, the floor plan of the hotel makes with the atrium in the middle amplifies voices and noises echo throughout the building. Just a minor problem though. Indoor parking is very limited and compact. Nice restaurants walking distance.", "Date": "October 26, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "3", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Berthoud, Colorado", "Title": "“Loved it!”", "Author": "berthoudrunner", "ReviewID": "UR84660643", "Content": "We had such a good experience at this hotel. We stayed here for a week in late Oct. 2010. The complimentary made to order breakfast every morning was so good and the lobby area for eating was beautiful and clean. This was complimented by the friendly service staff and the excellent job they did clearing tables and making sure the turnover for breakfast moved along. Along the same lines the nightly reception was something to look forward after a long day of sight seeing and our two year old couldn't wait to get popcorn as soon as we got back to the hotel. The restaurant 'Indulge' also had good food and hefty portions. Spliting a sandwhich and a cup of soup was often enough for me and my husband to share. There was always ample parking and the location to all highways and downtown La Jolla was acceptable. Zoo, Sea World, and downtown were only about a fifteen to twenty minute drive. Rooms were very clean and quiet. I never heard a peep from any of our neighbors either beside us or above/below us. This was especially good since we have a two year old who still naps during the afternoon. Only things that could have been better was the noise level of the air conditioning unit, everytime it clicked on it was pretty loud. The bed was a little on the soft side and the mini frig could have used a good defrosting as it didn't seem to hold temp very well. However these were not significant enough to taint my view of staying here, we LOVED it and can't wait to come back.", "Date": "October 24, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Sleep Quality": "2", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Lakewood, California", "Title": "“Small Water Features”", "Author": "believeit_10", "ReviewID": "UR83240074", "Content": "Love the full breakfast, but the pool and jacuzzi are very small for the size of the hotel.", "Date": "October 12, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "4", "Sleep Quality": "2", "Rooms": "2", "Location": "4"}, "AuthorLocation": "Sherman Oaks, CA", "Title": "“Way Too Loud”", "Author": "LisaT91403", "ReviewID": "UR83052063", "Content": "I admit, I'm a hotel snob. I don't usually stay at places like the Embassy Suites, but with a young child, it was the most economical way to go as we needed a suite & crib. The hotel was apparently renovated, but it still had some major issues as far as I'm concerned. If you don't want to read a whole review, just remember this one thing: AIR CONDITIONING AS LOUD AS A LAWNMOWER The A/C unit cycled on and off all night, and sounded like a lawnmower each time it started up. Even the fan itself was incredibly and horribly loud. They may have renovated the furnishings, but this A/C is old and L-O-U-D LOUD! Here's my take on everything else: PROS: - Friendly staff - Not a bad breakfast, considering it was free. The first day, the omelettes were okay. The second day, they were inedible. But there were other things to eat, so it was okay. - Comfortable bed - Clean room CONS: - LOUD air conditioning...making it almost impossible to sleep - Drapes don't reach all the way across windows, so there's always some light seeping into the room. Unfortunately, this light was directly in my eyes at 6:00 in the morning. - Odd shaped room, coming to a point so you feel like you are staying in a slice of pizza (maybe this is just because we had a corner room?) - $19 for self-parking, plus another $10/day for Internet - Shower was just kinda yucky (not dirty, but looked very old and dingy) I would stay here again if it weren't for the air conditioning issue. It really ruins this hotel.", "Date": "October 11, 2010"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Dallas, Texas", "Title": "“Great stay! We made the right choice.”", "Author": "trigre", "ReviewID": "UR81421006", "Content": "We stayed at the Embassy Suites for a week in August. We loved the hotel. It is wasn't for the $19 dollars a day parking fee I would give it the highest rating. We loved this hotel. It was so clean and quiet. It was easy to get in and out of and was close to several things. My husband went down for the breakfast every day and he enjoyed it. I am not a breakfast person so I skipped it. I only had to deal with the staff a couple of times but they were always helpful and very nice. The rooms were so nice and it was great having two rooms since I stay up later than my husband. They have laundry rooms that are free to guests. That was very helpful to us. We used the business office a couple of times to print tickets for different tours we had purchased. This hotel met all our needs. I just can't say enough good things about Embassy Suites San Diego - La Jolla.", "Date": "September 29, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Long Island, NY", "Title": "“Sweet suites and a gigantic lobby!”", "Author": "lynnandmarc", "ReviewID": "UR78258162", "Content": "Our family of four stayed here four nights at the end of August - beginning of September. When our kids saw the lobby of this hotel they were in heaven! There is a small koi fish pond with small waterfalls, four glass elevators, and you can look twelve floors straight up. Both the free breakfast buffets and the nightly Manager's Reception were in the lobby, so the kids enjoyed watching the elevators \"race\". The suite was roomy. We had a king bed in the bedroom, the kids slept on the pullout sofa in the living room, and there was a refrigerator and coffee maker. The bathroom had a massage showerhead. You did have to be careful going from room to room, however, so as not to get hit by the bathroom door. We appreciated the free drinks at the Managers Reception and the free breakfast. We typically went to breakfast at its busiest hour (8-9 AM), and never had a problem getting seating. The pool was indoors, which was good when it was cool. We ate at the restaurant Indulge twice. Try to sit outside by the fire pit. Laundry was free, which was great, but since there was only one working unit on each of floors 2, 5, and 12 (floors 3 and 4 were out of service), we spent a lot of time going up and down. The concierge Adam was very helpful suggesting nearby beaches where the kids took surfing lessons. Overall, we'd stay here again. The kids practically cried when we had to say goodbye to the lobby!", "Date": "September 4, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Tulsa, Oklahoma", "Title": "“Street Parking Risk”", "Author": "joseph1963", "ReviewID": "UR78224430", "Content": "I read the reviews about the $19 a day parking garage fee and tips to park free on the street. I parked on the street near PF Changs and feel pretty certain someone clipped a tail light on my car while parking. There was a crack in the lens on the morning of the third day. I was wishing I had parked in the garage but it sounds like it also has a few risks. There were a lot of cars coming and going to the restaurant increasing the odds of accidental damage. Overall, it was a good place to stay. Here are a few of the cons: My son said the sofa bed was very uncomfortable, as the mattress was very thin. The A/C compressor cycled frequently and was noisy despite leaving the fan on all the time and wearing earplugs. The coffee was extremely hot. I was carrying two stacked cups to our room when the top cup tipped and spilled a small amount despite the lid, and left a nasty burn on my chest which is still there. I have never understood why the ES charges for the internet and local calls while the lower-priced hotels offer them free. The staff was friendly. I had booked online and checked the rate two days before the trip finding the rate was reduced from $197 to $170. It was past the cancellation deadline, so I called the hotel and they gave me the lower rate. Two restaurants I would recommend: Point Loma Seafoods on the waterfront had fresh seafood and very reasonable prices as noted by Rachel Ray on one of her shows. Corvette Grill in Point Loma was a 50's style diner with an era Corvette at the entrance, continuous black and white movies on many screens and waiters/waitresses dressed in that era and a menu to match.", "Date": "September 4, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "4", "Rooms": "5"}, "AuthorLocation": "Los Angeles", "Title": "“Amazing. This hotel was certainly one...”", "Author": "KayEmLA", "ReviewID": "UR73950533", "Content": "Amazing. This hotel was certainly one of the best Embassies I have ever stayed in in my life. The atmosphere is very elegant and the staff was incredibly helpful. You won't be disappointed.", "Date": "August 5, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "San Mateo, California usa", "Title": "“Great stay”", "Author": "da-reef", "ReviewID": "UR69278033", "Content": "I just wanted to say how good the manager was. When we arrived they made us wait 2 hours for our room after check-in-time. We made the reservations 2 months in advance. After talking to the manager he took care of us and made everything right again. His name is Zarko Lucic. The Embassy Suites is lucky to have a person of his experience.", "Date": "June 30, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "colorado", "Title": "“Great hotel!”", "Author": "kewilli", "ReviewID": "UR68317620", "Content": "My husband, my mom, my two daughters, 3 and 8, and I stayed at this beautiful hotel for 4 nights and had a great stay. It is a beautiful hotel with a great koi pond that my 3 year old loved. Although it was beautiful it was still comfortable. Sometimes I cringe when my kids are walking through very nice places because I'm afraid they'll touch something, but not here. The staff is friendly and the breakfast is awesome. We found something for everyone, even my picky eaters! We will stay there the next time we go on vacation! Excellent!", "Date": "June 22, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Chesapeake, Virginia", "Title": "“Great Place”", "Author": "VaBest1", "ReviewID": "UR67815476", "Content": "Nice hotel, rooms are small but nice, a lot of parking (kind of expensive $19 a day and I was there 18 days) and they had a free washer and dryer on the floor I was staying on. The breakfast wasn't bad the one time that I had time to eat. Love the free beer and wine from 1730 to 1930. The internet wasn't free, but I think had I been a diamond member it would have. Great hotel for a few nights. I had no real poblems. I wish parents wouldn't allow their kids run in the hotel as if they was running outdoors. Not really the place for kids to be running anyway. May stay was from Apr 12, 2010 till Apr 30, 2010", "Date": "June 17, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Sydney", "Title": "“Lovely hotel”", "Author": "lizzylg", "ReviewID": "UR63377931", "Content": "We enjoyed our stay at this hotel. The hotel lobby was nice and my son loved the Koi fish in the pond. The bed was very comfortable. We had a room on a high floor which I had requested, I would say it would be pretty noisy in your living room where the sofa bed is if you had a room on a lower floor and near the elevator. The living areas all face the atrium and the noise from downstairs does drift upstairs, nice and quiet in the bedroom though. My main criticism was the location of the internal doors, they were ridiculous. The one through to the bedroom was right next to the cupboard door where the microwave was, you had to shut the bedroom door all the time to open the cupboard door to use the microwave. It was very awkward, just bad planning when they constructed it!! Also, the parking was $19 a day, don't bother paying for this. Park on the road, there is plenty of parking on the streets around the hotel so save your money. It was fairly close to the freeway so easy to get to Sea World, about 15 minutes. We also went to Legoland which was about a 20 minute drive north just off the freeway. There was a PF Changs right outside the hotel which was great and also a Westfield shopping centre across the road too which had Sears and Macys plus lots of other shops. Breakfast was included and there was also a happy hour/manager's reception every day from 5-7pm which was great. The staff were very friendly and helpful. Overall, we had a great time at this hotel.", "Date": "May 6, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Sleep Quality": "4", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Toluca Lake, CA", "Title": "“It was OK”", "Author": "Tusich", "ReviewID": "UR62109484", "Content": "We stayed here 2 nights over Easter weekend. Check in was quick - we arrived at 1 pm, and our room was ready despite of the fact that check in time, I think, is 4 pm. Suite was a little bit dark, but I guess, all suites are like this unless you take a corner suite with the balcony. Room was clean and noise level is OK. I didn't hear our neighbors upstaires or in the next room. Location is OK - it took us 10 mins to drive to drive to La Mesa and dine at their \"Red Lobster\". La Jolla shores are 10 mins away as well. It was nice to stroll there in the evening. Seaworld is 15 mins away on I-5. Breakfast and happy hour every day are included in room price. Breakfast could be a little better though. Very limited amount of fruits and veggies. Only banana and oranges, and actually no veggies at all. No yougurt or cottage cheese. At least, Hilton Suites include those items in their free breakfast. Evening happy hour included all kinds of wine and coctails (with the show of ID and your room key), chips and salsa, pretzels and slices of pita bread with little bit of hummus on them. Indoor pool was always crowded though, with kids in particular. I booked this hotel because of it's indoor pool knowing that it can be chilly in SoCal in March-April. My daughter swam there, however, all days - in the morning and in the evening, but I coulldn't get it because of tons of screaming and splashing kids. But that's Ok with me, I didn't want to swim anyways... Pool towels were too tiny, but I guess, it's OK for the kids. Oh, and no robes in the room (just comparing it with Hilton Suites). Also, there was too much chlorine in the pool - I could't comb my daughter's hair after each swim... We haven't tried their restaurant \"Indulge\", but it looked nice in the evening, especially the patio with heated lamps, couches with pillows and fire pits. Not sure if we'll return to this place next time. May be if the prices will be cheaper. I paid around $150 per night. Once again comparing to earlier stay at Hilton Suites, where we stayed in corner suite - light and bright - and where I paid $90 per night.... Oh, and they charge $19 for parking per night, and it's not a vallet (Hilton charged $12)...", "Date": "April 21, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Salt Lake City, Utah", "Title": "“Great Place, Good area”", "Author": "SDNX", "ReviewID": "UR61996880", "Content": "This is one of the best Embassy Suites I have stayed at. Very good area for restaurants and entertainment within walking distance. Parking is a little steep and the garage is small. Rooms are large and clean. Breakfast and evening drinks are nice and the staff was excellent.", "Date": "April 20, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "3"}, "AuthorLocation": "Out West", "Title": "“Great Place - Garage Sux”", "Author": "I-heart-Travel", "ReviewID": "UR61862075", "Content": "The ONLY thing I have to gripe about this place is the Garage. It is small and not really set up for the two-way traffic down one-way lanes. There is no elevator service, despite being three levels tall. The stairs to levels 2 and 3 are uneven and actually tilt you forward for a bit. There is no attendant at this lot (at $19 per day), so you must enter your credit card at a machine that sometimes doesn't work. Great hotel otherwise. Super friendly service - excellent PF Chang's right across the driveway.", "Date": "April 18, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "3", "Rooms": "5", "Location": "5"}, "AuthorLocation": "England", "Title": "“Embassy Suites always realiable but noisy air con”", "Author": "Buddy3567", "ReviewID": "UR61387076", "Content": "We chose the Embassy Suites because you know what you are getting and this one doesn't disappoint. La Jolla is a lovely area and having first booked in the Gaslamp District we were very pleased we changed at the last minute. Only downside was the noisy air conditioning so often a feature in American hotels. It was just too hot without it at night but so noisy that we had to raise our voices above it. Perhaps we were unlucky and other rooms would be better.", "Date": "April 15, 2010"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "California", "Title": "“High extra fees **BEWARE”", "Author": "brt925", "ReviewID": "UR60755422", "Content": "I love Embassy Suites but the extra fees at the La Jolla site made our stay unpleasant. A charge of $19 per night for parking is TOO MUCH.", "Date": "April 8, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "3", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Belmont, Massachusetts", "Title": "“Great staff, but watch out for the fees/extras”", "Author": "tennesseine", "ReviewID": "UR59182848", "Content": "I was in San Diego on business for two nights and picked Embassy Suites for the Hilton points. Clean, sleek building, decent rooms, pool (didn't use), OK-ish workout room, food wasn't bad. But they charge for both parking and internet, so add another $30 a day for these. Had it not been for the staff, I wouldn't even be bothering to write this review. I typically only write reviews when it is very good (and thus want to steer people to the business) or very bad (feel a duty to warn fellow travelers!). So an OK-ish hotel wouldn't merit my time, but I feel I have to take a moment to recognize the fact that while the hotel is not a great value or particularly outstanding in other respects, the kindness and professionalism of the staff merit a note: -I woke up one morning and was immediately buried in work and before I knew it, I had missed breakfast. I called down to ask if maybe there was still food at the buffet and they said it had already been cleared away. Two minutes later, they called back and said, \"Can I get the kitchen to whip you up an omelet or something?\" They brought it to my room ten minutes later, no charge. That small kindness just changed my outlook on the day and really reduced my stress level! I wish I had gotten the lady's name to recognize her above-and-beyond help. -Next day, I checked out and left in a rush to catch my 6 AM flight up to SFO. Got to security and realized I had left ALL my hanging clothes in the closet back at my room..pair of pants, jacket and two shirts. I called the hotel and a very nice person in housekeeping promised to send them to me. Two days after I got home, they were there: they had UPSed them two-day express. Again, above and beyond. So next time in San Diego, extra $30 or not, I am staying at the Embassy Suites there.", "Date": "March 21, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "3.0", "Value": "2", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Maryland", "Title": "“Nice stay, but watch out for fee! Business travelers beware!”", "Author": "nvychk", "ReviewID": "UR58211236", "Content": "I was impressed with the hotel - from the comfortable and clean rooms, to the delicious and plentiful breakfast, and the friendly and helpful staff. It's a gorgeous facility with a great location, plus it's easy to get in and out of. However, I was severely disappointed when I went to check out and found a large fee on my bill for checking out early. In my business, it's typical for us to book rooms for longer than ends up being necessary, because we may or may not stay an extra day, depending on what happens in our meetings. Because I left a day earlier than planned, I was charged 1/2 a day's rate. I was upset about this because I was not told this would be an issue and had NEVER had this problem at any other hotel. When I argued with the staff, I was asked \"Weren't you told about this when you checked in?\" I was not, and replied so. As a result, I warn all business travelers to this hotel to make sure you nail down the number of days you're going to stay before you check in!!", "Date": "March 10, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Location": "4", "Rooms": "5"}, "AuthorLocation": "Sunnyvale CA", "Title": "“good value for money and family friendly”", "Author": "arun0708", "ReviewID": "UR53387259", "Content": "Great hotel for family, we directly booked thru the hotel site, we paid $141 per night, (including 19$ parking) in last week of december, stayed for 6 nights. kids enjoyed the pool, hot tub. Made to order breakfast is included and it is good but very crowded during holiday times. couple of days they ran out of certain items and was not refilled, one day I spoke to the staff and then she made sure that everything was refilled, They need to improve their service for morning breakfast when it is crowded. They also have an evening soft drinks/wine/drinks complimentary service at the atrium. The restaurant in the hotel is very average with not many choices for kids. They also have few (about 4-5 washer/dryers) which was useful. need to get your own soap but dryer is free. Otherwise it s a comfortable and nice stay. I recommend the place for families with kids.", "Date": "January 13, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Location": "4", "Rooms": "5"}, "AuthorLocation": "Los Angeles, CA", "Title": "“Great Value, Nice Rooms, Terrible Situation but Nice Recovery”", "Author": "gooner_cb21rf", "ReviewID": "UR52499026", "Content": "I took my family to this hotel along with two other families for a nice quick visit to Sea World and some other relaxation. Other than a very unfortunate situation that I'll describe below, we had a great visit and would certainly return. Pros: Newly refurbished rooms that are very nicely furnished. Living room faces hallway which gives the bedroom some noise buffer. The free breakfast and happy hour are awesome. The fitness room is brand new and has the best cardio equipment I've seen in a hotel. Cons: The $19 parking/night tops the list. This feels like robbery, so definitely walk the block or two and use the free street parking. I hate paying for internet but given the room rate we were able to get and it being $10 per 24 hrs I can't complain too much. The big con we experienced on our trip was the obscenely loud new year's eve party that was booked at the hotel. I'm a reasonable person and NYE is the night to party. But I consider it the hotel's responsibility to ensure that all guests' needs and desires are met equally. The noise was so intrusive and pervasive that it was really unacceptable. The party basically turned the lobby/courtyard into a nightclub with all the noise. From our living room, the music was LOUD and with young children trying to sleep, this was a nightmare. We called down to the front desk and were met with the rude response of \"well, it IS New Year's Eve\" along with a very half-hearted \"I will see what I can do\". My wife was so upset that she went down to the front desk and asked to speak with the general manager. At this point, I have to really compliment the general manager (David). Seeing that moving rooms at 10:45PM was not an option for us, The GM listened to our request for partial compensation and graciously agreed. He was courteous, apologetic, and said that he had young kids of his own so he understood the situation. Clearly he was put in a bad situation by whoever from special events/catering booked the party and failed to manage it, but he did a very good job turning a big negative into a decent situation.", "Date": "January 3, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Location": "5", "Rooms": "4"}, "AuthorLocation": "London, United Kingdom", "Title": "“Welcoming and well located”", "Author": "geronimoturtle", "ReviewID": "UR52457999", "Content": "We stayed for 1 night as we needed to be in La Jolla for Thanksgiving. Had two rooms, a king and two doubles for my sister and her family. Our room, though next door was far larger and superior. Go for a King if you don't need the extra bed. Comfortable bed, coffee machine and nice flat screen tv. Iron and ironing board in the room came in useful. The kids love the hotel, they can run around and make a noise, swim and use the hot tub! As many other reviewers have mentioned, breakfast to order, not chased from our table after serving time. Shame they feel the need to charge for internet and don't haver free wifi in the hotel. Great location for the mall if you want to shop.", "Date": "January 3, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Location": "3", "Rooms": "5"}, "AuthorLocation": "Los Angeles", "Title": "“Great stay!”", "Author": "Beatledude64", "ReviewID": "UR51588034", "Content": "The staff was really nice, the hotel itself was very clean and good looking. The rooms are very nice. The free hot breakfast was very good too. The only complaints I have is that the internet isn't free, and the line for the breakfast seemed really long. Overall, it was a fantastic stay.", "Date": "December 21, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "4.0", "Value": "3", "Location": "5", "Rooms": "3"}, "AuthorLocation": "us", "Title": "“Excellent with kids”", "Author": "melonbar", "ReviewID": "UR50975434", "Content": "This hotel is nice in that, it's close to shopping mall and most of the restaurants. The hotel has nice big atrium, where complimentary made to order breakfast is served. The area where hotel is nice area and it's ten minutes from the coast. The rooms really need remodeling, since the carpet in the room is worned out.", "Date": "December 9, 2009"}, {"Ratings": {"Cleanliness": "4", "Overall": "4.0", "Value": "4", "Service": "4", "Location": "5"}, "AuthorLocation": "boston", "Title": "“Dependably nice”", "Author": "ps92", "ReviewID": "UR49147822", "Content": "We've stayed here several times and always like it. Typical Embassy Suites rooms. Love the breakfast and happy hour. We especially like being able to walk across the street to the UTC outdoor mall. Great place for all of us to shop. 10 minute drive to the beach. Near 2 major highways so easy access to downtown San Diego. Safe neighborhood to walk around. Just right for a family trip. No need to pay expensive daily parking in narrow garage. Plenty of free on street.", "Date": "November 13, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Location": "4", "Rooms": "4"}, "AuthorLocation": "brookey109", "Title": "“Nice hotel & Great Location”", "Author": "brookey109", "ReviewID": "UR46279592", "Content": "We stayed 2 nights in a two room suite. The room was a good size, clean, comfy bed. The hotel has a cool koi pond/waterfalls in the lobby which were nice. As was the free happy hour and breakfast. The hotel wasn't full while we were there, so there were never long lines for food or a lack of tables. Yes the parking fee kinda stinks, but we figured we got our money back by not having to buy breakfast for two days, and with the free drinks at happy hour. The hotel is right off the highway and only minutes from La Jolla. There is a mall across the street which came in handy since we had a suitcase break and were leaving from San Diego for a cruise. I would stay at this hotel again.", "Date": "October 8, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "3", "Location": "3", "Rooms": "4"}, "AuthorLocation": "Somerset", "Title": "“Better on week days”", "Author": "kevgy", "ReviewID": "UR45531273", "Content": "Up to the standard I would expect from Embassy Suites except overnight car parking is rather expensive at $19. The hotel was clearly popular at the weekend, with the infamous breakfast queues if you get your timing wrong and turn up just before breakfast is scheduled to finish. On week days, I didn't have to queue to get a freshly cooked early breakfast but queues built up around the end of breakfast session, when there is an alternative of self-service scrambled egg, bacon and sausage as well as the usual selection of cereals, cakes and bread and muffins for toasting. My room, or rather my suite, was lavishly spacious. The hotel is just across the road from a low rise shopping centre but it was necessary to drive some distance to get to the beach. The hotel bar & restaurant was pleasantly informal and relaxing and well used compared to the typical sparsely used formal restaurant one might expect in that class of hotel.", "Date": "September 30, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Location": "3", "Rooms": "5"}, "AuthorLocation": "Baton Rouge, Louisiana", "Title": "“Perfect!”", "Author": "retro_librarian", "ReviewID": "UR44485276", "Content": "My husband and I stayed here while we were on the second part of our honeymoon. It was perfect! The \"romance package\" was a nice touch. As like all other Embassy Suites, there was a beautiful atrium, complimentary breakfast served every morning, and complimentary beverages (and snacks) served each evening. The breakfast and evening reception are two of my favorite things about this hotel chain.", "Date": "September 25, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Location": "4", "Rooms": "4"}, "AuthorLocation": "", "Title": "“Good hotel, with a few negatives”", "Author": "taxcpa", "ReviewID": "UR42468201", "Content": "Typical Embassy Suites, in a good way. We really enjoyed our stay there, and would definitely stay again. The rooms and staff were nice, the hotel was nice with a big, beautiful koi pond in the lobby that the kids liked, the free internet in the business center was helpful, the breakfast was good with an excellent selection (hint: don't be late, they close it down right on time), and the location was great - 20 min or less to all major attractions, including the beach. Lots of restaurants and a nice mall close by with a playground for small children. The few negatives are: the sofa bed was awful - it was ridiculously uncomfortable. The mattress felt like springs with a sheet on top. Every spring was sticking out. They really need to replace them. I had a relative staying in another room, and her sofa bed was the same way, so it wasn't just our room. Also, other Embassy Suites I've stayed in had a nice kitchenette. This just had a very small area behind the door - the fridge didn't get very cold, and there was no freezer, which was disappointing. Still, it was nice to have the sink, fridge and microwave, however, small. The pool is nice for adults (even has a sauna) but definitely not a place for kids to play, so if your family expects to hang out in the pool, this is not the place. It's indoors, and is just a small rectangle pool with no shallow area for kids to play, not even large steps to hang out on. Also, the hotel rooms could really use a shelf or two in the bathroom. If you have more than one person, there's nowhere to put toiletries, etc. other than on the sink. If they just stuck a shelf on the wall, it would really help create more storage space. Lastly, they could really use a little noise buffer from the lobby, like more plants. All the rooms surround the lobby, and even though we were high up on the Honors floor, the noise still drifted up when there was happy hour or a band playing. We were prepared for the parking cost, we just considered it part of the overall cost of the hotel, however, it's very inconvenient - three stories with no elevator and only one lane in the garage - two cars can't pass eachother, one needs to back out for the other to get by. The front desk had conveniently printed directions to every surrounding location, which was very helpful. The hotel was comfortable overall and relatively quiet, with helpful staff and was in a good location, so we enjoyed ourselves very much, and would stay there again.", "Date": "September 17, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Location": "3", "Rooms": "4"}, "AuthorLocation": "Los Angeles, California", "Title": "“Nice Hotel - Expensive Parking For Suburban Area”", "Author": "StealthySteven", "ReviewID": "UR40217011", "Content": "A long 5 minute wait at check in, but the room was nice and quiet. Kids seemed to be running all around the hotel public areas without supervision during the free cocktail hours, playing with elevators, etc. Parking fee seems pricey for this location. Free street parking is available within one or two blocks of the hotel, so I avoided using the hotel garage. Five hours after checking out, I realized that we had left a cell phone in the room and returned to the hotel to see if they had found it. A very nice assistant manager went back to the housekeeping area and discovered that it had been found and tagged by the room maid with our room number and date of stay. Needless to say I was very pleased to get the phone back. I would definitely stay in this hotel again.", "Date": "September 8, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "4", "Location": "4", "Rooms": "5"}, "AuthorLocation": "Oregon", "Title": "“Great- but parking could be a major problem for some people.”", "Author": "tikilounge", "ReviewID": "UR39275202", "Content": "Great Embassy Suites- better than usual decor. Terrific location- can walk to PF Changs and the mall. Short drive to La Jolla atrractions. Reasonable drive to San Diego attractions and airport. But there is one major oddity- the parking. First- it's $19/ day. I can live with that. But it's not a parking lot, it's a parking garage and there is no elevator. Even for me, that made hauling my bags in (having to carry them down flights of stairs a pain). Also, there is no valet option. I'm not sure what they were thinking- but it certainly was not about people with disabilities, small children, or luggage. It's nice to have the two room suite, but I'm only one person and could have lived with a smaller room. I'm a Hilton Diamond member so I always prefer the Hilton family of hotels, which includes ES, but next time I may try the Marriott right down the street- which has balconies.", "Date": "August 30, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "3", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Naples, Italy", "Title": "“Worth Staying Here”", "Author": "sheiksan", "ReviewID": "UR39030012", "Content": "Typical Embassy Suites. Outdoor jacuzzi; indoor pool. Reasonably nice gym. Must pay for internet access in room; free internet is available downstairs but it can get very busy. You can eat outdoors as well. Staff was great. What really makes it nice is the location. Right next to P.K. Changs, across the street from a mall (that has a 24hr fitness). Lots of restaurants of many price ranges in the vicinity (short driving distances). If you are a cyclist there are lots of places to ride, but you have to be comfortable with big roads. And some roads are pretty bad.", "Date": "August 28, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Location": "3", "Rooms": "5"}, "AuthorLocation": "Los Angeles, California", "Title": "“Great place to stay when traveling with kids.”", "Author": "KatrinaTaylor", "ReviewID": "UR36641235", "Content": "We enjoyed our stay at the Embassy Suites due to the cleanliness and kid friendly enviroment. The staff was very friendly and kind enough to ship my UPS package off for me without any cost at all. Room service was friendly and fast. P.F Changs is right across the street for you to grab a nice bite with friends and family. If you just so happen to forget an item of clothing, like I did, the mall is right across the street for you to pick up some quick threads. We stayed here to attend Sea World and would enjoy booking this hotel again!", "Date": "August 3, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Hawaii", "Title": "“Great hotel!!”", "Author": "808traveler", "ReviewID": "UR36278235", "Content": "I had considered staying at the Hyatt La Jolla but was glad that I stayed at the Embassy Suites (La Jolla). The rooms are typical Embassy Suite rooms, one living room with a flat screen LG television, a desk for your laptop computer and a couch with a pull out sofa. There is also a small bar with sink, a microwave and a refrigerator. The bedroom had a tube television (pretty good size and picture) and a nice king size bed. There are free washers/dryers if you need to wash your clothes. The complimentary breakfast was excellent (cooked to order omlettes, eggs, sausages, bacon, variety of toasts and pastries, oatmeal, fruits, dry cereal with milk and a variety of juices). The breakfast is from 6:00 am to 9:00 am but it's best to go early and avoid the crowd (it never really got too busy). They also have a FREE cocktail hour from 5:00 pm to 7:00 pm where they serve free alcohol and mixed drinks. The parking lot isn't too big and they charge $19 a day. There is a pretty good mall right across the street and a P.F. Chang's restaurant right outside the lobby. The location is good (a minute away from the 805 and a few minutes away from the I-5). You can't go wrong if you're staying in La Jolla!!", "Date": "July 30, 2009"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Roseville, CA", "Title": "“Great Experience!”", "Author": "BelindaRosevilleCA", "ReviewID": "UR36180521", "Content": "Great value for money. Orig booked back in Jan, but checked rates again in June and got the same room for half the price! Nice location - next door to tons of restaurants, a shopping mall and ten min drive to down town La Jolla. We asked for a midfloor room, away from the dreaded ice machine and noisy evelator. The staff were very friendly - all went above and beyond what you would expect. Our room was nicely appointed - microwave, mini fridge, super clean. Housekeeping rushed over to bring extra`s when requested. Breakfast was excellent. Try to make it down prior to 8am, or expect to wait, (school`s out so nothing new there?!). We chose to sit ouside on the patio, which was nice. Indoor pool was super - my kids met up with other`s in the pm, and swam for hours. Big hotel with an intimate, friendly atmosphere. Just two area`s that could be improved upon - evening snacks were limited - veggies or pizza silces (even at a cost), would have been appreciated. The onsite parking is $19, also one way - so lots of backing up to let others past. Try down town La Jolla on Sunday - live music and a fun time. You can download directions to the local attractions in the hotels business office. We had great fun and look forward to visiting ASAP.", "Date": "July 29, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "2", "Location": "3", "Rooms": "3"}, "AuthorLocation": "Southern California", "Title": "“Not the best Embassy Suites”", "Author": "craigandstef", "ReviewID": "UR35598550", "Content": "We made a reservation at least 3 weeks ahead of time requesting a lower floor suite. This particular Embassy Suites is 12 stories and I'm not great with heights and made that very plain to them. They didn't seem too interested in our request. You guessed it! Our suite was on the 11th floor damn, my worst nightmare. Now parking. At every Embassy Suites I've stayed at we've had complimentary parking unless of course you use valet. This one in La Jolla you park yourself and it's a $19 a day, I'm serious! Wow...horrors. Please make sure if you're looking for your microwave and your refrigeratorcheck inside the closet next to your bathroom. Internet service? You bet and it's $9.95 a day to use. One more thing, when the air conditioner comes on at night you REALLY hear it when trying to sleep. Bring your ocean machine and earplugs or take a xanax. We did like Indulge the restaurant. Dan the bartender was personable and made our stay most enjoyable considering the other challenges. I believe you can find better deals elsewhere in La Jolla.", "Date": "July 23, 2009"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Overall": "2.0", "Value": "1", "Location": "2", "Rooms": "1"}, "AuthorLocation": "Valencia, CA", "Title": "“Not a place to stay”", "Author": "roystravels45", "ReviewID": "UR33975981", "Content": "Small breakfast area. Very difficult to get in and out of the one-way parking structure. Suggest staying at one of the nearby hotels like Hyatt, Hilton, etc.....", "Date": "July 5, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Location": "5", "Rooms": "3"}, "AuthorLocation": "AZ", "Title": "“Too Many Sports Teams”", "Author": "RichieBAz", "ReviewID": "UR31246114", "Content": "This is a good hotel BUT, it is also a hotel that caters to kids soccer teams, B-ball, any youth team where they can pack 200 kids into a room. Thus, kids running around all the time. One fun trick is to push every button on the elevator. Parking structure is way too small and they charge for it, parked or not. Always full at night.", "Date": "May 31, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "San Diego, California", "Title": "“Excellent Value, Perfect location”", "Author": "Dr_WarEagle", "ReviewID": "UR30397225", "Content": "I stayed for a full week (6 nights / 7 days) . This hotel is within walking distance to several great dining and shopping options in the University Town Center (literally across the street) and bit further to the Costa Verde shopping / dining center. The free cooked to order breakfast was amazing. At first I did not know how extravagant I could (or wanted to) order so I started with a basic omelet (the seemingly most popular order) with your choice of meats, vegetables, and cheese. The next morning I asked for pancakes which were amazing. The cooks will pile on the sides unless you ask them not to. My only complaint was that at around 4:30 am I awoke to the smell of bacon cooking as the cooks were preparing for the morning, but breakfast didn't start until 6am. The best feature was the Manager's Reception featuring complimentary beer (good and bad bear, a locally brewed La Jolla Ale or Bud light), Wine, cocktails, soft drinks and pretzels / chips and salsa. The open floor plan of the lower level gives a great chance to mingle with other guests or to just relax and people watch (there is a hi def tv as well usually on a sports channel, sometimes on news). There were two TVs in my room, a King Suite, one 32inch flat panel in the living room and one large tube TV in the bedroom. The refrigerator had no freezer in my room, but there was a microwave and sink, which worked perfectly for left overs. In the living room there was a desk, a desk chair, a one and two seat sofa. I tried out the outdoor heated jacuzzi and the steam room. Both were very relaxing. Internet is $10 per day, so I used their business center which had everything I needed, internet and a printer. Parking is expensive (19 a day) but this is standard for the area, and at least the parking spots are very close to the hotel. Overall this hotel well worth the price, once you factor in all of the amenities.", "Date": "May 20, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Calgary", "Title": "“Excellent value”", "Author": "Beverleyblvd", "ReviewID": "UR28718389", "Content": "Our family of 4 (2 adults 2 kids age 9 & 11) stayed at this hotel March 23-27. Room on 8th floor was nice - 1 King bed with flat screen in separate room, bathroom, closets, sofa bed, flat screen, desk & chair, and side chair in front room. There was also a fridge in a closet across from a separate sink - bar area. Didn`t see until 2nd day because the doors to the bathroom and main room open strangely and into the closet where the fridge is. The room was on the smallish side for 4 people - if the kids were older we would have to have 2 rooms as they shared the sofa bed. The sofa bed was uncomfortable for them so after the first night I requested a mattress pad which was brought up within 10 minutes. They were much more comfortable after that and no complaints. Breakfast included each day was pretty good - nice to have a bite without having to decide where to go. Some days the omelete station was the only hot food choice (with bacon, sausage, etc.) and other days there were hot trays with scrambled eggs, potatoes, bacon and sausage. The omelete station was open every day and the cooks are super fast. Less than two minutes wait for the food. Other choices were pancakes, fruit, cereals, muffins, bread, coffee, tea, juices. We ate in the atrium every morning and were not disappointed at all - we ate and were ready to go. There is a nightly cocktail reception which is also a nice touch. Premium liquor is offered as well as soft drinks and nachos, chips, etc. We found a place to sit and enjoy. Again - all included in the price of the room. Free internet room - great to have although I didn`t realize it until our 2nd last day. The kids found the pool to be fun and I sat with them in the hot tub which was nice. Can``t comment on the gym but looked in and saw a few machines as well as free weights as well as tv. The location is great - close to everything - ie Zoo, Legoland, Sea World, SS Midway, etc. Just a short drive to each and easy to find. Also a good restaurant in the hotel as well as PF Chang``s next door. There is a mall across the street - we walked over and ate at Cozymel`s which we all enjoyed. Ask the front desk for a list of restaurants nearby and they will provide a long one with distances to each and whether they are formal or informal and descriptions of each place. Overall - Embassy Suites was a decent hotel with a good breakfast and cocktail hour included. Our kids enjoyed feeding the Koi fish in the lobby and the glass elevators. We would recommend this place and would stay here again. Just make sure you have good directions if you arrive at night as we did. Got lost a few times as we were not too familiar with San Diego and there are no street lamps on the highways! Couldn``t see a thing! The daytime was much easier to navigate in!", "Date": "April 24, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "central cal", "Title": "“Great place to stay”", "Author": "brokecheerdad", "ReviewID": "UR28161198", "Content": "Great place to stay. They even offer a discount for family members of UCSD students. No complaints, very helpful and friendly staff.", "Date": "April 16, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Location": "5", "Rooms": "4"}, "AuthorLocation": "New York", "Title": "“Great hotel, family friendly”", "Author": "HudsonValleyNewYork", "ReviewID": "UR28012929", "Content": "We were looking for a hotel that was centrally located and the Embassy Suites in La Jolla did not disappoint. It is located about 20 mins from Legoland, 15 mins from San Diego Zoos and attractions, and 10 mins from La Jolla Cove. The staff is very friendly and service is superb. They make everyone feel very comfortable. Minor issues: would be nice if they had queen beds instead of doubles, can be very busy during breakfast and noisy in the atrium, Wi Fi is extra but they have a free business center where you can have internet and printing for free as well free WiFi in the atrium, parking also is a bit steep but well worth it since it is hard to find street parking. Definitely would stay again if in the area.", "Date": "April 14, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "seattle", "Title": "“They Were Wonderful To Us”", "Author": "sheston", "ReviewID": "UR27251435", "Content": "The day we checked in was the day our Marine son returned from Iraq and he had no place to stay. Embassy Suites was very accomodating until he found a place and we were treated Royally! It was a very emotional time for us and we appreciate everything they did.", "Date": "April 1, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "5.0", "Value": "5", "Location": "4", "Rooms": "5"}, "AuthorLocation": "Minneapolis, MN", "Title": "“Family Friendly Embassy Suites”", "Author": "lbhtd", "ReviewID": "UR26779068", "Content": "A relaxing trip to San Diego. The rooms were pleasing, the breakfast was good, bed comfy. The hotel is VERY family friendly. The only minor complaint is the exorbitant parking fees and the atrium noises can be heard on the eigth floor. It is also worth noting that the hotel is in a busy area, no where to take a leisurely family stroll.", "Date": "March 25, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Location": "5", "Rooms": "4"}, "AuthorLocation": "phoenix", "Title": "“enjoyed”", "Author": "arthanial", "ReviewID": "UR26624431", "Content": "This is a great embassy suites. Everything was enjoyable. The staff was very helpful and friendly. The pool was great. I love the embassy suites in the san diego area. they are my first choice in SoCal. They are excellent hotels especially if you have young children. Obviously you can't beat embassy suites breakfast....especially the SD properties. The location is good. There is a mall accross the street and you have easy access to two interstates. Close to SD and carlsbad. I will definitely recommend that you try this hotel if you are staying in SD and you have children with you. It is conducive to a family environment. It's not the most peaceful/quiet hotel though...but when traveling with my kids I don't expect peace and quiet. The parking is very expensive at this hotel...valet and self parking.", "Date": "March 22, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Location": "4", "Rooms": "4"}, "AuthorLocation": "Los Angeles, CA", "Title": "“Nice for families”", "Author": "dwtn", "ReviewID": "UR24762066", "Content": "Stayed for a La Jolla weekend with our young children. Pros: * great value for families: spacious rooms (all suites) and breakfast included * location in heart of \"UTC\" area of La Jolla (UTC being the large mall across the way); short drive to the upscale beach area of La Jolla Cons: * tough self-parking situation with unmanned (and no elevator) parking lot for $18 if you do not want to valet park for $30 * lots of families with kids means it is sometimes loud; breakfast means your room smells vaguely of bacon in the morning if on a lower floor (may be a pro to some) - would not be my idea of a business hotel ps - Children's Pool at end of La Jolla cove is a nice place for kids to see seals and can couple with a meal over on Prospect St. (the Karl Strauss brewery is very kid-friendly)", "Date": "February 18, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Washington, DC", "Title": "“Great Place to Stay For Visiting Tourist Spots”", "Author": "Dee-in-DC", "ReviewID": "UR23832112", "Content": "I checked reviews on tripadvisor before I selected this Embassy La Jolla for my San Diego stay. I would agree that the daily fee for parking was high, but worth it for me. I have a 3-year old and a 20-month old - trying to find parking on the street would have been too much for me. It was simpler to walk into the garage and go. We stayed for a week - November 22 to November 28. The staff was friendly and helpful. My room was clean. The refrigerator was the right size for the things I purchased (drinks, soy milk, snack cheese). We were right across from a mall and a few blocks from Trader Joe's and Whole Foods. (hey, everyone has their special requirements!). There is an advantage to getting \"free\" breakfast quickly and easily every morning for a family of four. The food was good enough and served quickly enough to get us going in the morning. It was one less thing to deal with or worry about. I say \"free\" because it is probably factored into the price. In terms of location, La Jolla is perfect for going downtown to the Zoo or driving up to LegoLand and Disneyland. We tried to get to every destination by 9AM to maximize the time spent and let my son take his afternoon nap. We had no traffic in any direction, so we were either lucky or the location is perfect for traffic avoidance. Our wedding anniversary occurred during the trip. My wife called the hotel weeks prior to surprise me with gifts and goodies. Well it worked because I forgot it was our anniversary. Embassy Suites gave us a Movie package which included a free in-room movie rental and popcorn. All-in-all, nice place, great location, great stay.", "Date": "January 23, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "4", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Austin", "Title": "“Outstanding stay with 2 toddlers”", "Author": "richm456", "ReviewID": "UR23699809", "Content": "I just finished an excellent stay at the Embassy Suites. I visited with my 2 toddlers and elderly mother. We had a fabulous stay. The staff was extremely friendly and I look forward to my next visit. The Suite was perfect for our group and was clean and comfortable. The koi pond in the lobby was probably the highlight for my two little guys. They couldn't get enough of looking at the fish. Definitely give these folks your business.", "Date": "January 19, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Check in / front desk": "4", "Overall": "4.0", "Value": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "California", "Title": "“Great family post holiday stay”", "Author": "vacation_junkie03", "ReviewID": "UR23144197", "Content": "We were a family with 2 little kids. We stayed in a suite with king side bed. There was enough room for a twin air mattress and full size air mattress in the bedroom! We got a corner room which was angular and seems smaller by comparison to a regular room. It was odd that the bathroom didn't have any towel bars. There were a couple of hooks by the sink where we hung the hand towels but the bath towels had to be draped over the shower or the bathroom door hook. Also, if you have a baby and need a crib, the hotel only has metal crib. Bring your own crib paddings - they don't suppy the bumper guards and they don't have Graco Pack and Play (which the ES in Flagstaff in AZ did). We didn't bring our bumperguard and had to use several sheets and packing tape to create one. The hotel atrium is beautiful and the koi pond was a favorite with the kids. Bring lots of quarters as it costs to get fish food to feed the fat fish. The breakfast is delicious as usual. Get there early as the lines get very long after 8am. The free drinks was the favorite with the adults. We brought in 'to go' food every night and enjoyed the drinks with our dinner. Overall, it was very good stay.", "Date": "December 31, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "minneapolis, minnesota", "Title": "“I'll stay there again.”", "Author": "jon160", "ReviewID": "UR23018898", "Content": "I've ready the other reviews. I'll be back. Clean, quiet, easy access to several freeways. The only downside are the too-low-wattage compact fluorescent bulbs. It just wasn't bright enough for my 55-year-old eyes.", "Date": "December 26, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Las Vegas", "Title": "“Quality Hotel”", "Author": "Vegas411", "ReviewID": "UR22680336", "Content": "We are regular ES customers, but the first time at this property. Easy, courteous check-in with ample garage parking minus the $17 a day fee. The King room had large flat panel in living room, but the room was slightly smaller than most other ES we stayed and it lacked the wetbar feature, but stiil had a granite top sink, fridge and micro. Bedroom was very clean, and had a down comforter. The TV was not a flat panel, but who comes to such a beautiful city to watch tv in the room? Overall stay was near perfect, the made to order breakfast was very good, as they even had a large assortment of fruit.", "Date": "December 12, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "San Diego, California", "Title": "“Attentive, courteous, beautiful!”", "Author": "mishabisha", "ReviewID": "UR22385947", "Content": "Judging by the other reviews of this hotel, it seems my wonderful experience was only one of many. I took my boyfriend here for his birthday (a kind of \"stay-cation\" if you will) for one night. I booked the room online through Embassy Suites' website and chose to purchase the \"Romance package\" in addition. The package included a bottle of champagne and a small box of See's candy. (I think it also came with robes and slippers, but I can't remember if that was standard or if it came with the package.) The price might seem a little high, but it was totally worth it. The boyfriend had no idea about the \"romance\" part and I wanted to keep it a surprise. I wrote special instructions when I made the reservation that I wanted the champagne already set up in the room when we arrived. Check-in was a breeze...the front desk clerk was very courteous and informative (those kind of manners seem to be almost non-existent these days) and told us about a complimentary happy hour in the lobby. They offered mixed drinks, wine, and beer, as much as you could drink from 5-7. We had a couple drinks and watched some football in the gorgeous atrium-like lobby. The room we were assigned was on the top floor, in the corner. It was immaculate and the view was incredible. Best of all, the champagne was on fresh ice and the chocolate and robes were all laid out. My boyfriend was so surprised he was almost in tears. I was ecstatic! I took him to dinner at The Melting Pot, a fondue restaurant in La Jolla, and we asked the valet guys to call us a cab. They offered to take us in their own hotel shuttle for free and even picked us up when we called after our meal! The pool was great, the spa stays open until midnight, and the sauna is exceptional. We DEFINITELY want to go back and can't say enough positive things about Embassy Suites.", "Date": "December 2, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Bellevue, WA", "Title": "“Excellent Emabassy Suites”", "Author": "Major12", "ReviewID": "UR20668687", "Content": "I have stayed in many Embassy Suites properties around the country and I must say this is one of the best. Great location and service! The king suite room was very nice in all respects and everything functioned properly. Every staff member I spoke to was very helpful and respectful - front desk personnel were some of the best - very knowledgeable in all respects. The morning breakfast and the afternoon managers reception were both great. Nice decor throughout the hotel. The hotel restaurant has a limited menue, but the one night we ate there was very good. Lots of other restaurants nearby and a PF Changs right next door which was wonderful. My only ding against this property is the rediculous $17 parking fee in their garage. I can see no justification for that amount, but I was aware of it going in and it wasn't a deal breaker for me. This is the only Embassy Suites I've been to with an actual parking garage - guess they're trying to pay it off quickly. Other than that issue this is a great property and one of the best I've ever stayed at around the country.", "Date": "October 6, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Business service (e.g., internet access)": "4", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "3"}, "AuthorLocation": "santiago", "Title": "“great staying”", "Author": "amantedelanaturaleza", "ReviewID": "UR20234515", "Content": "excellent room, big, clean and very confortable. good breakfast included. complimentary drink every afternoon. good business center. US$17 parking fee. Good location....far from the beach , but very accesible to all main san diego attractions. Ideal for families with kids", "Date": "September 20, 2008"}, {"Ratings": {"Cleanliness": "4", "Business service (e.g., internet access)": "4", "Check in / front desk": "5", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "richardallman", "Title": "“Overall good”", "Author": "richardallman", "ReviewID": "UR20039030", "Content": "We were booking late and found a good deal on a hotel in La Jolla, which turned out to be the Embassy Suites. We were afraid that the hotel would be less frendly and less willing to accomodate us because we booked on hotwire, but we never experienced that. I'd definately book through hotwire again just because of all the money we saved. Anyway, the hotel itself was pretty nice - about what you'd expect from Embassy Suites. Rooms were clean, big LCD TV in the living room, no complaints there. Also, the continental breakfast was EXCELLENT. The only problem was it was packed. We had to wait in line for twenty minutes before we got to it. Then, the hotel ran out of trays so we had to wait for those. The hotel was completely booked during our stay and it was overrun with families, which isn't bad unless you don't like kids. Also, two of the four elevators broke on the second day which was an absolute disaster. One time i waited ten minutes to go down and get some eggs. I got down there, waited in line for another twenty minutes, then waited another ten minutes for an elevator to go back to my room. The whole ordeal took like 40 minutes on a morning we were trying to get going early. Overall, though, I'd definately reccomend the Embassy Suites La Jolla, especially to families looking for a great beach getaway.", "Date": "September 13, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "4", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Chandler, AZ", "Title": "“Loved this Hotel”", "Author": "sparkyasu60", "ReviewID": "UR19988631", "Content": "Checked in on 9/4 thru 9/7. We had no problems checking in or getting a porter to help with the luggage. (With a wife and 2 teenage girls it was a lot!). The hotel was spaces and friendly. The rooms had a large living room with a nice flat screen TV., and the bed room was a good size with a regular TV. The morning free Hot breakfast was very nice and had a very short line for it , it must have been the beginning of the off season. The pool was nice and hot tub too. Parking was 17.oo dallors a day with no problems with spaces. It was close to every place needed to go, Sea World, Sea port Village, La Jolla Beach. The staff was very friendly to us and with fast response with any requests that were given and directions to places that we were going to. The only little problem I had not being a Drinker is the get together the hotel gives in the evening, free drinks of alcohol , soda juices. But the chips, goldfish, pretzels were kind of cheap, would have like more of some pastries or some better snacks. But for the price of a State Gov rate 110.00 a night I really can’t complain. It was a Great experience", "Date": "September 11, 2008"}, {"Ratings": {"Service": "1", "Cleanliness": "4", "Business service (e.g., internet access)": "3", "Check in / front desk": "1", "Overall": "2.0", "Value": "2", "Rooms": "4", "Location": "4"}, "AuthorLocation": "San Francisco", "Title": "“Two bad apple's can spoil the whole barrel”", "Author": "MalbertSF", "ReviewID": "UR19234791", "Content": "I am writing this review a bit earlier than expected. You see I was woken up at 5:15AM by a brand new flat panel TV in the breakfast area blasting the news to all those suckers who happen to be sleeping on the sofa bed in the front room of the 2 room suite. If you have never stayed at an embassy suites they have an atrium that all rooms face so it's either really cool or really annoying depending on whether you are deaf or not. When I could no longer take the before dawn intrusion I did what most reasonable people would do, called the front desk. What I got is \"I will call and ask them to turn it down\" funny cause the lobby is what ,30 feet from the blaring TV. So I laid back down waiting for the peace and quite I expect at 5 in the morning. Gues what? someone turned it up. I must have cheesed them off by politely asking them to do, I don't know, their job maybe. I should be ashamed of myself for bothering them and just shut my yap, but funny thing is, I then got a bit mad. I called down again. \"I can still hear it\" \"sir I asked them to turn it down\" \"OK then why does it seem to be louder?\" \"(sigh) I will call them again\" Click. She hung up on me. I must have bothered her again I guess. So again I tucked myself under the cheesy velor blanket trying to recapture my dream. 15 minutes pass. No change in the volume. I heard every news story, every commercial, every Olympic fanfare (It was NBC). That was IT. I called again \"I will get dressed and go down there and turn it down myself\" Silence (from the front desk I could almost hear her thinking \"whatever\" ) Click she hung up on me again. So I get dressed and go on down (hey I was up on the 7th floor) and walked up to the offending TV. Not a single guest watching it. Just blasting to no one in particular. I see a staff member walking by and I ask \"can you help me turn this down\" and she barks at me \"we don't have the remote, we don't know how to do it\" and she walks away. What have I done to deserve this? I checked my breath and my zipper, my nose and my BO and I honestly don't know why I was getting them so upset. I was really really bothering them maybe I should just shut up go back to my room and pay my bill and leave them alone, you know give myself a time out. But hey, I am an adult, I have atayed at maybe 15 different ES and booked trade shows and meeting for a living so I am used to dealing with hotels. The good ones trya nd make their guest feel special, the bad ones, well read on. So, last chance, I walk up to the front desk \"Hi, I am the guy who called about the TV and the folks in the breakfast area says that they don't have the remote\" \"OK sir I just got here what is the problem\" so I repeat my sad tale and she say's to me \"what floor are you on?\" the 7th. She rolls her eyes in disbelief that I could hear it way up there. So she say's \"let me ask Ellen she took your call\" so she steps back and I hear some mumbling and she walsk back and says \"Sir Ellen turned it down herself she has the remote\" \"OK its still blasting, it's not down enough\" . \"Yes it is, sir it's our ploicy to turn the TV's on at 6AM and we can't do anything about it\" Now i am normaly a tolerant fellow who expects a bit of noise from other guest rooms (kids Tv's or just chatter from folks walking down the hall) but I surely did not exext to get \"attitude\" from the front desk for just asking them to turn down the volume. So I say to her \"It's 5:45, and I'ts been on for a while\" \"sir that's our policy, how long will you be with us\" \"One more night\" \"Sorry we can't help you\" I was flabbergassed. Why in the world would I make this stuff up. Do they seriously think I sit there at 5 AM waiting to complain about something. That I am making it all up or just over sensitive? Yes they do, yes they do because what happened next summed up the whole bitter exchange. I said to her \"I hope someone would please go over and listen to the volume\" Ellen never showed her face and her flunky just looked at me and shrugged her shoulders. So I grabed one of those \"tell us how we are doing\" cards and said \"Someone is going to hear about this\" and as I walked away I heard her say under her breath \"stupid\" I turned around and said \"what di you say\" and she say's \"I said It's early\" [--] lady. I heard it correctly the first time. Remember I am the guy that can hear a TV from seven stories up. She never checked it out, never smiled or acknowleged my concern and gte theis, as i walked away she called me STUPID. Thanks Ellen, Thanks rude employee who barked at me in the lounge \"we don't know how to do it\" and a big thank you to the front desk clerk who rolled her eyes ignored my reasonable request and called me stupid. Fianlly a big thank you to Embassy Suites La Jolla. I will never forget you. You know just how to treat your guest, Like [--]. Wow,and it only took me 229.00 to figure it out. Otherwise the hotel is clean convienent and the rest of the staff was wonderful. Especially the young man that checked us in. Will I be back? If I did i would be, well STUPID.", "Date": "August 22, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "3", "Check in / front desk": "5", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Vancouver", "Title": "“Great Location, Very Good Hotel”", "Author": "CafeBohemia", "ReviewID": "UR18249354", "Content": "This hotel is in an excellent location just outside the village of La Jolla between two of the major freeways (but far enough away from them that it is quiet). You can get to all popular San Diego area attractions very easily and quickly. A large upscale shopping centre, Westfield UTC, is directly across the street. Rooms are typically Embassy Suites ... fairly large and comfortable. This property has recently been updated and has flat screen TVs and some nicer, modern furniture. The only downsides ... windows do not open and the air conditioner unit in our room was rather noisy. Pool was nice. Breakfast was also decent with a nice outdoor eating area. All in all, a very good hotel in a great location.", "Date": "July 25, 2008"}, {"Ratings": {"Service": "2", "Cleanliness": "5", "Business service (e.g., internet access)": "3", "Check in / front desk": "2", "Overall": "3.0", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Heber City, Utah", "Title": "“Great place except for customer service”", "Author": "BrendaLu", "ReviewID": "UR18156883", "Content": "This was a great place to stay overall but I was met with some unexpected surprises. Parking at $17/night was the most disconcerting. I found one clerk unhelpful on two occasions but a second was both helpful and accommodating. After all is said and done this was a great place and the made to order breakfast definitely added value to our stay (probably just enough to offset the $17 nightly parking fee.", "Date": "July 22, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Business service (e.g., internet access)": "3", "Check in / front desk": "4", "Overall": "2.0", "Value": "2", "Rooms": "4", "Location": "4"}, "AuthorLocation": "los angeles,ca", "Title": "“Billing surprises”", "Author": "verouser", "ReviewID": "UR18084279", "Content": "The billing had to be corrected for overcharges twice. We were charged for tv channels that we did not view. The free channels are not even worth watching. Everyone is charged $17.00 each night for parking. I had to prove that I did not park on the property for this charge to be removed. The parking is very tight and my friend had alot of trouble with his truck. The rooms are nice but for the inconviniences, it was not worth the money that was paid.", "Date": "July 21, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "4", "Overall": "5.0", "Value": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Baton Rouge, Louisiana", "Title": "“We Loved the Embassy”", "Author": "Takemeawayplz", "ReviewID": "UR17632868", "Content": "I try to write a review when i return from my vacations. I love this site because it gives you a heads up on what to expect. I think I owe it to all your site visitors to tell them about the good , the bad and the ugly when it comes to my hotel stays. Here we go.... Pros wonderful location. Mall across the street. Great place to stay if you plan to explore southern california. Everything is close by. We went to Sea World, Zoo, Disneyland and La. Hotel is beautiful. I read before the trip they remodeled , they did a great job because everyone in the family loved it. Plenty of room. We have a family of four and we were very comfortable in the mini suite. BREAKFAST WAS GREEEAT! Get there early to avoid line for the omelets. Loved the pool( one night it was a little wild because of some teenagers but it was ok) and free internet access in the lounge. It was really nice to be able to check email. Cons PARKING! PARKING! PARKING! 17 dollars a day are they serious? word to the wise PARK ON THE STREET. Its free and a short walk to the hotel. Everyday I laughed at the poor suckers who paid to park there. One night we parked on the street right in front of the hotel, I seen a family coming out of the parking complex. We got to the hotel at the same time they did. Even though they paid 17 dollars they still had to walk about a city block to get to the hotel. We paid nothing and got the same convience they did. Only problem when we went to check out they tried to charge us 80 dollars for parking. As you can tell I took pride in not parking there and paying those outrageous fees. I explained this to the desk clerk and the charges were removed. Overall we had a great stay and I would recommend this hotel (not parking) to anyone.", "Date": "July 7, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "4", "Check in / front desk": "4", "Overall": "4.0", "Value": "4", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Cambridge, UK", "Title": "“Weekday dream - weekend nightmare”", "Author": "fanofamerica", "ReviewID": "UR17278147", "Content": "Having read reviews of just about every hotel in San Diego, we finally decided on The Embassy due to location, price and the fact it had been newly refurbished. The rooms were beautifully decorated and very spacious. Breakfast was the usual hot buffet, but it was plentiful and the evening receptions were lovely. Parking was a problem as the spaces in the car park were small and it was often full. We were very happy with the location, and the staff were very helpful. In fact, our stay from Wednesday to Friday was brilliant, but come Friday night, it turned into a kids playground with the arrival of teams for a water polo competition. Now I do not blame the hotel, I blame the parents. What are parents thinking allowing their kids to run wild all over the hotel? On more than one occasion we had the kids knocking on our room door, riding the lifts from floor to floor and then running all the way around the hotel shouting. Do parents have no consideration for other people or can they just not be bothered to take control of their kids? The weekend spoiled what would have otherwise been a brilliant hotel and we will definitely stay there again if its during the week!", "Date": "June 27, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Davidson NC", "Title": "“Great Stay for Parents AND Kids!!”", "Author": "topterp", "ReviewID": "UR16806810", "Content": "Just stayed in Embassy Suite La Jolla with wife and 2 kids in early June 2008. What a treat! Hotel was clean, quiet, updated and conveniently located for our visits to San Diego and sites to the north. Staff was extremely friendly and helpful. Bedroom and suite were large enough for the four of us to spread out and be comfortable without crowding. Bathroom was clean and large as well. Public areas (lounge, pool, lobby) were also inviting and comfortable. Free hot breakfast buffet and manager's reception daily were awesome and only added to the great value and experience. Only minutes from downtown La Jolla for ocean, restaurants. Also within 20 minutes from Legoland. If head to downtown San Diego after rush hour, can make it there in under 25 minutes as well. Parking was convenient and cost $17 per day. Highly recommend this for families vacationing in the area. Also, I did business work while at hotel and that worked well too. High speed internet was fast and reliable. Desks in both the suite room and the bedroom made for easy computing. Would recommend this to business travelers as well. Well done Embassy Suites La Jolla! Will definitely stay again!", "Date": "June 9, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Austin, TX", "Title": "“Made trip with a toddler a great success!”", "Author": "anxone", "ReviewID": "UR16617028", "Content": "I just returned from a week in San Diego with my husband and 21 month old little boy, and we had a fantastic experience with the Embassy Suites La Jolla. We arrived the Saturday before Memorial Day and stayed through the following Saturday. On the weekend the hotel was full of kids there for a soccer tournament so it was quite lively, but we never had any issues with them. During the week it was extremely relaxing at this hotel. My little boy loved the koi pond, and the breakfast was excellent and saved a lot of time and money. In the evenings he enjoyed the pretzels and goldfish, then after he was in bed my husband or I would run down for a cocktail or a glass of wine. Having the separate bedroom was a lifesaver for us, as we could put him to bed in the bedroom, then stay in the living room and watch basketball on the awesome plasma TV. The rooms are decorated quite nicely, and I appreciated that the bedspreads seemed easily washable and very clean! We also enjoyed the indoor pool - though it is small it was never crowded, even during the busy family weekends. I liked the fact that it was out of the sun, since we spent most of our days outside. My toddler would wake up each day and the first words out of his mouth were always 'the pool!' Now we have been home a few days and if I ask him if he had fun on vacation he grins and says 'the pool!' He also loved the glass elevators and being able to look down on the people and fish in the atrium. The computer room was also extremely convenient for us to be able to run down and check our email, and we never had to wait for a computer, even on the busy days. It was also great having the big mall across the street. This is a great location - very centrally located to anywhere around San Diego you would want to go. The only tiny downside to this hotel has been mentioned before - the parking. More often than not we couldn't get our keycard to work, a minor annoyance but an annoyance nonetheless. It is also a little awkward getting out of the garage once you're parked. I think the $17 charge is more than made up for by the breakfast and drinks at night though. The staff were all extremely friendly and helpful - we felt right at home during our entire stay. We would definitely stay at this hotel again!", "Date": "June 2, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Chicago, Illinois", "Title": "“Great for the Price”", "Author": "baloney56", "ReviewID": "UR15575699", "Content": "I stayed at this hotel for a month in 2004 and found it to be pleasant. Well, now they've renovated the place and it's lovely with updated furniture in the rooms and lobby. The complimentary breakfast was good; the usual omelets, pancakes and French Toast, with fresh fruit, juices yogurt, etc. The evening reception can't be beat; free drinks including hard liquor and a few snacks. We were there over a weekend and had no problem with kids running wild; they were for the most part polite and quiet. It's not in the center of town by any means, but it is less than 30 minutes to the beach, the zoo, Old Town or the Wild Animal Park. The only drawback we found was the price for parking in their lot, but with ample FREE parking on the street if you're willing to walk up to a block or two, that's not an issue.", "Date": "May 2, 2008"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Business service (e.g., internet access)": "3", "Check in / front desk": "4", "Overall": "4.0", "Value": "3", "Rooms": "4", "Location": "4"}, "AuthorLocation": "California", "Title": "“Good Family Hotel”", "Author": "EuroDiva", "ReviewID": "UR14611543", "Content": "My family and I stayed there while I was on business. The hotel is conveniently located across the street from a shopping mall comprised of the large anchor stores of Sears, Nordstroms, and Macys. There's an array of restaurants nearby. We were happy with the spacious suite. The only glitch was housekeeping was slow in cleaning the room and it was about 3 pm when they arrived. If you are a late riser for breakfast, there are long lines for food after 8 am.", "Date": "March 28, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Business service (e.g., internet access)": "4", "Check in / front desk": "4", "Overall": "4.0", "Value": "3", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Seattle", "Title": "“Good place for a family to stay”", "Author": "indecisivetravler", "ReviewID": "UR13848903", "Content": "We stayed for 4 nights over Presidents day weekend. We arrived Saturday evening and checked right in and got to our room. Our room was nice and clean and had everything we needed, including a plasma TV. When we returned from dinner the parking garage was full. Fortunately one of the guys that works in the lobby helped us find a place to park our car. The hotel was was totally booked mainly because of a hockey tournament. There were several kids running around playing in the elevators. I was surprised the parents were letting them do this. Having boys ages 6 and 9 I was tolerant of their antics, but would never allow mine to do run loose in a hotel. The breakfast selection was good. There were 3 chefs for cooking eggs so the omelet line was never very long. The kids had a lot of fun swimming in the pool. I was glad the pool was indoor since the weather wasn't very nice. I was dissappointed the hot tub wasn't open during most of our stay because it was being re-tiled. The hotel is in a very convenient location. Would definitely consider staying here again.", "Date": "February 26, 2008"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Business service (e.g., internet access)": "3", "Check in / front desk": "4", "Overall": "2.0", "Value": "3", "Rooms": "2", "Location": "4"}, "AuthorLocation": "Washington DC, District of Columbia", "Title": "“Not as Advertised”", "Author": "Salme", "ReviewID": "UR13717606", "Content": "We stayed in this hotel over a one-week period, spanning one weekend. Although it said on the website that portions of the hotel were under construction, they did not disclose that the hotel restaurant was closed, and that therefore they were running the morning breakfasts out of the lobby. Unfortunately, the lobby was also under construction, the koi pond was drained and very unattractive, and contractors worked on it daily. What they didn't disclose was the planned carpeting re-do, which took place beginning on Monday. They didn't disclose it until the Friday before the work began on Monday, then only by slipping a memo under our doors. They did not post signs anywhere. Like many Embassy Suites, the business week belongs to businessmen. Unfortunately, the weekends belong to the kids. A city-wide little-league hockey tournament filled the hotel with kids, and the staff made no effort to control the wildness of these 75+ kids. They ran in the halls, yelled across the atrium, and played hockey in their stocking feet in the halls, the atrium, and outside. It is untenable, especially because the atrium structure only serves to magnify sound exponentially as the sound rises. The food was ok, though not stellar for the exorbitant prices. For some unexplained reason, the AC stopped working the last day we were there, and thought the engineer responded quickly that it would be back on shortly, it was not. Then it took 30 minutes for the engineer to even respond to a second call. Even with the occasional availability of the low-priced rates, I would not stay here again. They just don't disclose the truth about the state of the hotel. On the plus side, it is centrally located, next to UTC shopping center and lots of eateries. However, I cannot recommend the hotel.", "Date": "February 20, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "2", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Prescott, AZ", "Title": "“Upscale feel, great value!!”", "Author": "rierie78", "ReviewID": "UR12325477", "Content": "We stayed three nights over the weekend between Christmas and New Years, and thoroughly enjoyed our stay. The hotel has just undergone a complete renovation, and it shows. Everything is brand new, modern, and beautiful. The suite was very generously sized, had a big flat screen TV in the living/dining room area, extremely comfortable bed, and (of course) the huge, delicious, full breakfast every morning and free cocktails every evening!!! We thought the location was great as well. Whether you plan to go into town or explore more of North County, everything you would want to do is within a 15-20 minute drive. There were many really great restaurants that you could even walk to, including P.F. Changs that shares a parking lot with the hotel and a yummy mexican restaurant named Cozymel's just up La Jolla Village from the hotel. The only complaint we had was that there was no included high speed hookup (an amenity that travelers are beginning to expect, we paid something like $25 for internet for our 3-day stay) and that the parking was expensive ($17 per day) for very narrow spaces in the garage. One could say that the free (and very extensive) breakfast and evening cocktails would counterbalance these expenses. We would highly recommend this hotel and will most likely stay again.", "Date": "January 4, 2008"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Business service (e.g., internet access)": "4", "Check in / front desk": "4", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "San Leandro", "Title": "“Great location, but remodeling is bad for breakfast”", "Author": "tangster", "ReviewID": "UR12112745", "Content": "The property is centrally located, in between I-5 and HWY 805, and is literally across the street from the Westfield mall. The property has completed a multi-million dollar upgrade of all its room, but the downside is that they are now in the phase of remodeling of the breakfast area. Breakfast is temporarily being served in their restaurant, which is undersized and not equipped to handle the masses of people. Unless you get there early, you will not find a seat and will end up bringing breakfast back to your room. However, the room we stayed in was stylishly done, with modern touches and a neutral color scheme. Nice flat panel with HD TV. Parking at $17 per night is a little steep as well. Overall, a nice stay for a family of five.", "Date": "December 31, 2007"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Business service (e.g., internet access)": "3", "Check in / front desk": "5", "Overall": "3.0", "Value": "2", "Rooms": "4", "Location": "3"}, "AuthorLocation": "LA", "Title": "“Great place for unsupervised kids to run wild!!”", "Author": "SGV", "ReviewID": "UR11014740", "Content": "I am not a big fan of most Embassy Suite's properties but this one accomadation wise is good.The rooms are updated and so much better then any other Embassy I've been to in a long time.We stayed in an executive suite and it has more room with a dining table for six and a seperate vanity type (though dimily lit) vanity in the bedroom.It has a flatscreen in the living area and a flat screen fullbacked TV in the bedroom.Bathroom is OK no fan in the bathroom so showering really fogs it up. Ok the not so great part was that the majority of the people there had kids in a soccer tornaments in the area.These kids ran wild all night yelling and running and slamming doors.It was so bad my two kids who were there for the same reason wanted to change rooms because they got no sleep due to the noise!The front desk staff told me the parents get mad when asked to please keep their kids under control.........??? Front desk staff was very helpful and professional. The breakfast was ok ,the managers reception in the evening was not so great ,potato chips,pretzels were the snacks and the drink line was not worth standing in.Trying to get some napkins at the breakfast was like I had insulted the worker I had asked for them from and check to make sure the plates are clean (really) The atrium area is still under construction and parking is $17 a day although you could park on the street. It is probably a quieter place to stay during the week when there are non supervised kids running everywhere.When your own kids are bothered by it you know it's bad! The pictures of the rooms on the hotel website are accurate.", "Date": "November 23, 2007"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "San Jose, CA", "Title": "“Solid hotel”", "Author": "eyhchen", "ReviewID": "UR10742857", "Content": "The rooms are newly renovated, look fresh, clean, and comfortable. Good breakfast spread in the morning. On the expensive side but worth it.", "Date": "November 11, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Sacramento, CA", "Title": "“Kind and Attentive Service”", "Author": "CMFM", "ReviewID": "UR10087893", "Content": "Our thanks and appreciation to the staff at the Embassy Suites, La Jolla for a wonderful stay. Our family (six rooms worth) came together from throughout California for a 3 day weekend wedding event in La Jolla and we were able to make ourselves at home and have a great time in large part due to the kindness and attention of the Embassy Suites staff. Check in was efficient and welcoming and all of our rooms were ready, clean and comfortable. The front desk made sure my father (who is disabled),was appropriately accomodated. We enjoyed the breakfasts all together and though we were a large noisy group, the staff was cheerful and friendly also taking the time to visit with my father who wanted to show off his family. When we were racing out to the wedding location on Sunday morning, the concierge (Adam?) was extremely helpful in making an adjustment in our handicapped parking assignment, helped with loading Dad's wheel chair and walker and even printed out a map to the wedding location which saved us from getting lost on the way (like my brother :). This same young man also helped my parents considerably when they checked out the next day. There is a great business center that we used for some last minute communications and a convenient kiosk in the lobby to print boarding passes. Some of the family enjoyed the nice pool and steam room. Parking is a challenge if you mind paying $17 per day (ouch) - it is in the heart of an expensive area so it is understandable, but it can add up. Very nice upscale shopping across the street and down the road about a mile or two, more shopping (Trader Joes and Whole Foods) if you are staying longer and want to eat in. Unlike some ES locations, the acoustics here are very good, we did not hear much noise from the atrium/breakfast area (whether you were on 3rd, 5th 7th or 11th floor like we were). And the rooms were very quiet as well. I was encouraged by the other positive comments on this thread and my expectations were met and then some. I get to travel fairly often for work and pleasure and stay at ES's from time to time and this is the nicest one yet.", "Date": "October 16, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Michigan", "Title": "“Excellent in all areas”", "Author": "SearayBob", "ReviewID": "UR8671686", "Content": "Stayed from Aug. 24-28. The weekend is busy with families, however Sun. evening thru Tues. quieted down considerably. Rooms are large and surprisingly quiet considering the amount of kids in the building. Beds were fantasic, better than at home! Breakfast was as advertised, virtually anything you could ask for is available, hot, and fresh! The adult bevedge selection at the daily managers reception will satisfy whatever you desire, and it is free. Staff was courteous and professional. If you are new to the area and looking for tips on things to see, you may be fortunate enough to meet a guest services reprentative who is stationed just across from the main check in desk. His name is Paige. He provided us with suggestions and information that were most helpful. There is the $17.00 parking fee, get over it. It is well publisized in every hotel review forum, and is also noted on the hotel website. You will get double that back in breakfast and cocktails. The area just does not have a lot of available parking so it will be a premium. We will definitly book here again on a return trip to the area.", "Date": "September 7, 2007"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Check in / front desk": "5", "Overall": "4.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Fort Worth, Texas", "Title": "“Nice Stay in La Jolla”", "Author": "ckeaton", "ReviewID": "UR8667947", "Content": "Our family stayed at this property for one week during our visit to the San Diego area and we enjoyed our stay. This is a good hotel for families. The suite provided plenty of space for my wife and I and our 2 boys, age 3 and 7. The room and public areas, including the pool area, are very nice and clean. There is a great breakfast (come early or you may have to stand in line), including a nice buffet and cooked to order omelets. My wife and I did enjoy a relaxing cocktail after a day out with the boys, as well. There are also may restaurants and a mall within walking distance. If you are going to be in San Diego this is a very good option that we recommend.", "Date": "September 6, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "3", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Santa Fe, NM", "Title": "“Perfect”", "Author": "Chamberman", "ReviewID": "UR8657066", "Content": "Our first trip to California to visit my newly relocated brother, who recommended the Embassy Suites. (He also told us about TripAdviser.) We thoroughly enjoyed our stay here. The staff was quite friendly. Our room was large and clean. The price seemed a little expensive, but I found out that most hotels in the area are just as expensive. Would definitely recommend this hotel.", "Date": "September 5, 2007"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Business service (e.g., internet access)": "4", "Check in / front desk": "3", "Overall": "3.0", "Value": "3", "Rooms": "4", "Location": "4"}, "AuthorLocation": "SoCal", "Title": "“Family weekend in La Jolla”", "Author": "onoman", "ReviewID": "UR8511124", "Content": "Spent a weekend at the Embassy Suites in La Jolla. Got upgraded room via Hilton Honors. Large enough for 5 people--wife and me, sons 18, 15 and daughter 10 yo. Breakfast was good, did not make back for happy hour in evening. Very noisy--there was some type of soccer camp nearby and just about everyone who was there was a 12-14 yo girl in soccer gear, running up and down the hotel! Parking is an issue in this hotel, not only do you have to pay, but on one evening, the parking lot was full! Got to park in the valet parking for the PF Chang's next door, which was at no cost, as long as we left early in the morning. Location is good, across the street from regional mall, very nearby UCSD and close enough to downtown San Diego and Mission Bay. Traffic on the freeways is really nasty at rush hour and on Sunday evenings. Took 2 1/2 hours to go 60 miles from Orange Coast Plaza on a Friday evening.", "Date": "August 26, 2007"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Corona, California", "Title": "“Great Fun For Our Family”", "Author": "4famfun", "ReviewID": "UR8422614", "Content": "The Embassy Suites, La Jolla was the perfect place for our family of four to stay for our first California Vacation, as we normally travel to see family back east. The 2-room suite was perfect for us, it was roomy, clean, well decorated with many of the conveniences of home. Upon walking into the room, there was Living Room Area with a pull out sofa bed, a large ottoman, a comfy chair, a table with 3 chairs and a flat screen tv. Moving further into the suite there was a bi-fold door and behind that was a microwave, small re-frig and a counter top to prepare and store snacks. On the opposite wall was a bar with a coffee maker, ice bucket and a sink.................there was even a cupboard below for storage of snacks etc. as well. You then go through a door, and to the left was a roomy and very nice bathroom with a tub/shower combo, a hairdryer and stocked with towels and toiletries. To the right, across from the bathroom, was a large closet with mirrored doors, there was a shelf & rod for clothes, a suitcase valet, and an iron& ironing board. At the end of that hall was the bedroom, with 2 double beds, my husband and I had one bed and our 3 and 5 year old boys shared the other bed, there was a dresser/vanity with an ottoman. On the other end of the dresser was a flat screen tv. The complimentary breakfast was wonderful with many choices, cereal, friut, pastries, bagels, donuts, yougurt, juice coffee and best of all the hot breakfast bar. Grab a small bowl and choose your own ingredients, hand it to the chef and they make it into a scramble or omelett, you also can have pancakes, french toast, bacon & sausage. We too enjoyed the complimentary late afternoon/evening manager's happy hour. Crackers, chips, salsa, drinks with or without alcohol. The pool was nice, but could get a little noisy when there was more than 1-2 families with kids at a time.........Not all parents were good about keeping their children from making to much noise, or hogging the entire pool. Three suggestions would have made the stay better: Bigger Beds Better Parking Rates - $17 a day was steep Cable TV - only had the East Coast Feed for the Kids channels, not good considering you are having fun in the sun all-day and then want the kids to settle down..........and their programing is already over by 3pm, because it was the East Coast Feed. We dealt with it, rented them a couple of programs..........but that too can add up on an extended stay. This was the best 6 night, 7 day stay with our boys ages 3 and 5 years old..............the 2-room suite was supper family friendly and roomy.", "Date": "August 14, 2007"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Business service (e.g., internet access)": "3", "Check in / front desk": "3", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Kansas City, Missouri", "Title": "“Good Family Hotel!!!!!”", "Author": "phiflyers", "ReviewID": "UR8245862", "Content": "Three of us stayed at this hotel for a vacation weekend (Thursday July 19th-Sunday July 22nd) and were pretty pleased with our experience. The location of the hotel is perfect as it is about a mile off the highway and isolated from any highway noise. The hotel lobby was recently remodeled and it looked like they were putting the finishing touches on everyone when we checked in. The check-in process was very easy and we were in our room in no time after a long evening of traveling. The room was pretty spacious for the 3 of us and included an HD flat-screen in the \"living room\", mini-fridge, microwave, and even a bar-sink. 2 of us slept in the king-sized bed and 1 in the pull out queen sleeper sofa. The sleeping arrangements were very comfortable as we were able to close off the 2 sides of the suite for a little privacy. There were a couple of complaints that we had regarding the room and one of them ended up being addressed while we stayed there. The a/c system was very loud when it kicked on and would definitely wake up a light sleeper, and ended up waking me up on a few occasions. The first time we used the shower it would take forever to drain and the 2nd person taking a shower would always stand in a puddle of water. After making a call to the front desk they sent someone up to the room and it was fixed the next time we took a shower. Our rate, as well as everyone else's, included the great breakfast that they put on every morning. There is a large crowd in the breakfast area every day, but the spread that is available was one of the best I have seen in a hotel and we were all very pleased. We ordered room service 1 night and found the food to be very tasty and reasonably priced. A major that we had regarding the hotel itself was the elevators on Sunday (our check-out day). Everyone seemed rushed to get out of the hotel at the same time and this created a huge line at the elevators. We ended up taking the stairs down because it would have taken at least 30 minutes to get down had we waited for the elevator. Overall, we were very satisfied with our stay at this hotel and our choice of La Jolla.", "Date": "July 28, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "4", "Overall": "4.0", "Value": "4", "Rooms": "5", "Location": "3"}, "AuthorLocation": "Chicago", "Title": "“Great Service- Nice Hotel- NOt near the Beach”", "Author": "snowbiz100", "ReviewID": "UR8211007", "Content": "We stayed here just before the 4th of July. They are just finishing up with a room and lobby reservation and the hotel has a very fresh look to it. The rooms have plasma TVs and are well decorated. The staff is very helpful. Both happy hour and breakfast were enjoyable, no problem getting a table. As an example of excellent service, I left some clothing behind and the housekeeping manager Fed-xed them to my home. VERY impressive. The only downside is parking. The 17.00 fee is excessive and the garage is very difficult to drive through ( small and all one way, once at the top you have to drive against incoming cars to get down). Its located in more of a business area, the beach is a 10 min drive. Book with Confidence.", "Date": "July 21, 2007"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "3"}, "AuthorLocation": "Bluff, Utah", "Title": "“Awesome! Don't hesitate to stay here.”", "Author": "honey_bah", "ReviewID": "UR8139273", "Content": "Got a great rate via the hotel website. Stayed here for 2 nights while visiting Seaworld. The hotel is winding up remodeling. The rooms were very spacious and clean. They smelled brand new! Plenty of room for our family of 5, with the living room and separate bedroom. We had a corner room and these are a bit bigger than other rooms. My parents were next door and were not in a corner room, so their room was a bit smaller yet still big. Our kids really enjoyed th Koi pond. One of the hotel staff gave them some food for the fish. That was very relaxing after a long day on the road. The breakfast was yummy. The lines were long, but the food was well worth it. All of the hot foods likes eggs, bacon, sausuage, french toast, pancakes, etc. were cooked to order. Check in was a breeze. We will definately stay here again when traveling to San Diego. This is one of the nicest hotels that we've stayed at.", "Date": "July 17, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "upstate NY", "Title": "“Fantastic Hotel/ Outstanding personal”", "Author": "Luella10", "ReviewID": "UR8131444", "Content": "I was actually shocked upon reading the most recent reviews. We recently stayed there and had a fantastic experience. We spent an entire week and enjoyed every minute of it. We had just spent a week at the Disneyland Hotel, which does not hold a candle to this hotel. The housekeeping was flawless!!! Everything was perfect everyday. For the review that said they passed up breakfast, what a mistake. It was great, and we are very fussy about our hotels and food. We have stayed out at the HotelDel on Coranado Island several times, so we have much to compare it to. The parking can be a little tricky, but you will find this to be true for almost everywhere in the area. Don't be fooled by the parking fee. Some hotels say they don't have one, however it is included in the hotel price somewhere. Thats what they do at Disney. Getting back to the breakfast, we have never stayed at any hotel that offered a free breakfast that was so delicious. The staff in the kitchen area was wonderful and they worked very hard to keep things going smoothly. Well done!!! For those of you traveling on business, be prepared for families to be there as well. This is a hotel with suites, so many people with families stay there. We are a family of 5 and we really enjoyed our stay. Trust me, I read these reviews like crazy. And sometimes I change my mind and cancell. Don't cancel, its a great place. Yes, there is a bit of construction going on but we were aware of that before we came.", "Date": "July 17, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "4.0", "Value": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Portland, Oregon", "Title": "“Room for 5 in a Great Location”", "Author": "Deuga", "ReviewID": "UR8115228", "Content": "My family of 5 just got back from a 1 week vacation at the Embassy Suites, La Jolla. We stayed in a 2 room suite. Here's a rundown: LOCATION If you're on vacation, we found this hotel to be in a perfect location. We were close to everything including lots of great restaurants. SERVICE We found service to be excellent throughout the hotel, including in the food service area. ROOMS We had a king bed in the bedroom. Two of my kids slept in the foldout couch. The third slept on a cot. The foldout couch and cot were too soft in my opinion, but my kids could care less. The rooms are spacious if you're 2 people, with 5 people you might find yourself wishing for more space if you spend any down time in your room. We didn't do much of this so it was of little regard for us. If the rooms have one design flaw it's that the microwave and frig are behind the door the separates the bedroom from the living area when that door is open. In addition, you have to open a pair of doors to open to get to the microwave and frig even when the bedroom door is closed. Typically the bedroom door is open so to get to the frig you have to close the bedroom door, open up the double doors to the frig/microwave area, then open up the frig. Following that you'd close all three. The rooms have been recently redone and look great. Yes, the 42'' HDTV in the living area is awesome. I watched a few minutes of the MLB all-star game on it and it looked great. I can typically find something broken, not working, torn, or busted in any hotel room I stay in regardless of the hotel chain. I tend to think nothing of it. After staying here I week I found absolutely nothing flawed in any way. Even the shower water temperature was shockingly perfect every time and never varied one iota during any shower. PARKING They charge $17/day parking for parking. Overall in this area of La Jolla I noticed that parking was a precious commodity at some restaurants as well. To me you either accept that before you book or you book your stay elsewhere. I accepted it from this perspective: I'm paying an extra $17, but getting a complete breakfast for no additional charge. For a family of 5, I've have paid $40 per day to replace that breakfast, unless we went to McD's every day and that would have gotten very old, very fast. Parking is tight if you try to park during the evening, it's never a problem during the day. Over the course of a week I had to fight to find a parking spot once. COMPLEMENTARY BREAKFAST Overall I thought the breakfast was great. The food was high quality. The omelette's were great, they had pancakes every day, french toast some days. The selection was overwhelming, if you couldn't find something you liked here, then your standards are extremely high for what is mostly a buffet. There's been a significant amount of discussion regarding the crowding. Here's the scoop, there are plenty of tables to sit at. You can sit in the atrium and watch Koi, or eat in the Coast Cafe (they don't do breakfast in the Cafe), or outside on the terrace. The problem is that the layout of the buffet is very poorly done. The cook eggs to order line is at times too long b/c you've got people thinking that's where they're supposed to go even if they don't want an omelette. However you can get anything you want without waiting in that line if you don't want eggs. I found short lines or no lines all week everywhere else in the buffet. But I do agree that there's alot of bumping and jostling going on when you're getting your food. You can avoid all the jostling and crowd if you get to breakfast before 8am during the week and before 9am on weekends. There's can also be a huge difference in the omelette line between 8:20 during the week and 8:29, for example. I spoke with the ass't manager about the breakfast layout. She said it's not a part of the redesign they're doing. However they have been discussing it and are going to look at possible options for making the food selection process flow better. RECONSTRUCTION The front entry area is still under construction as well as the business center. They said they expect the business center to be up by next week. They expect the rebuild to be complete by the end of July. Overall, this didn't inconvenience us at all.", "Date": "July 14, 2007"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Check in / front desk": "3", "Overall": "2.0", "Value": "2", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Sparks, NV", "Title": "“Not that impressive...”", "Author": "melargo", "ReviewID": "UR8097485", "Content": "My wife and I stayed over a Saturday, July 7th...booked through Expedia for $171 but they added a $10 guest fee for my wife and $17 parking fee. Upon entering there was construction going on...they had 2 desks set up for check in. We were informed that there was no ATM on site due to the construction and that there is a Bank of America across the street. The bellhop explained that a complimentary evening cocktail buffet was going on but after dropping our bags off in our room, the only food that was left were ruffle potato chips. They offered pizza for $3 a slice and there was a line for alcoholic drinks at the bar but since we don't drink, we just went back to our room and snacked on items we had brought with us. We passed on the complimentary breakfast based on our experience the night before and checked out of there early. This place is nothing special...the beds were firm. I should have stayed at the Marriott Courtyard or the Sheraton with their heavenly beds.", "Date": "July 10, 2007"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "USA", "Title": "“Great hotel”", "Author": "Wise_One", "ReviewID": "UR7683599", "Content": "From the comfortable rooms, internet access, to the staff and the excellent breakfasts. Nothing bad to say about this place. Exceeded my expectations and a joy of a place to stay for business.", "Date": "May 23, 2007"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Business service (e.g., internet access)": "4", "Check in / front desk": "4", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Southern California", "Title": "“Comfortable hotel”", "Author": "emmysmommy", "ReviewID": "UR7637272", "Content": "We chose the Embassy Suites in La Jolla due to the location - not to mention the free hot breakfast. The hotel was nice, clean, and the staff friendly. There was construction going on downstairs - currently the gift shop and lobby area are undergoing renovations. We did not hear construction noises so that was good. The room was very spacious with a separate living room/office area and then the bedroom. I couldn't find the fridge/microwave at first but they are hidden behind a set of doors between the two rooms. We did not eat in the hotel restaurant but we did have the free hot breakfast both mornings we were there. They offered omelettes, waffles, pancakes, bacon, sausage, breakfast potatoes, pastries, cereals, bagels, and fresh fruit and other things that I can't recall!! We actually extended our stay by one night. Our request was promptly taken care of and we even were given the promotional rate for the 2nd night as well. The only negative about our stay was the sound of little kids running around downstairs in the atrium/lobby level early in the morning. The sound really carries and it seems that parents had no control over their little \"cherubs\" in the morning. (And we had our daughter with us so I'm not anti children! ) Oh, and our room keys kept getting deactivated for some reason. (they were not touching anything that would cause that to happen!) The pool was indoor and on the small side. It was a bit crowded when we ventured there in the afternoon. However, it was still functional. The hotel is across the street from a mall (University Town Center) that has a lot of shops and restaurants. There is a PF Changs Restaurant in the same parking lot as the hotel - we ate lunch there one afternoon. We enjoyed our stay and would definitely stay there again.", "Date": "May 17, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "England", "Title": "“Great Hotel”", "Author": "Andypandyengland", "ReviewID": "UR7416063", "Content": "Couldn't fault the Embassey Suites, great rooms with a seperate lounge/TV area which is handy when you have young children that tend to sleep in, breakfast was great ( busy at peak times though ) happy hour from 5.30pm-7.30pm was a must with all drinks and snacks free. The glass elevators were fun which the kids loved, as they did the indoor pool, the shopping mall right accross the street was also very convienient as it has an ice skating ring. If we visited San Diego again this would be the only hotel we would consider , a fantastic place and ONE OF THE BEST hotels we have had the pleasure of staying in.", "Date": "April 22, 2007"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Business service (e.g., internet access)": "4", "Check in / front desk": "5", "Overall": "4.0", "Value": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Orange County, CA", "Title": "“Great rooms, crowded breakfast”", "Author": "petrovich", "ReviewID": "UR7327924", "Content": "Great Rooms! * Rooms are large and newly remodeled. They just finished remodeling all the rooms in March. Decor was contemporary and classy, using dark wood. The rooms include a wet bar, microwave and fridge. * New large flat panel TVs (42\"?) in living room; regular (though large) TV in bedroom. * We were told that they improved the sound-proof quality of the rooms, which I believe is true because we didn't hear a peep from anyone else's room. Breakfast Buffet was chaotic: * The breakfast area was too small for the number of guests in the hotel. It was a nightmare trying to get food. The line for the omelets stretched 15 people long. There seemed to be lines for everything and such tight quarters that people were constantly trying to get by you with trays of food. The food was just so-so. Good pancakes, though. Limp french toast, bland scrambled eggs, overcooked omelets, good crispy bacon. Potatoes consisted of nuggets of deep fried \"tater-tot\" things. * They serve Starbucks coffee in the coffee urns, but it tasted burnt most of the time. * They were frequently out of things like clean silverware, plates, bowls, milk, fruit. * Now Embassy is going to remodel all of the common areas in May 2007. They may fix this whole breakfast situation by making the area more expansive and efficient. I wouldn't go during construction, though. 5:00pm Snack Hour was kind of fun: * They only serve potato chips, tortilla chips, pretzels, and salsa. * However, they serve shirley temples for the kids and any alcoholic drink for the parents (including, for me, a Midori Sour). Coffee and tea also included. Indoor swimming pool was good and bad: * It was nice having an INDOOR pool since it was 62 degrees outside. Pool was clean and well-kept. * However, pool was small and extremely noisy. Tons of kids running around, screaming, making canonballs, splashing. My 2-year-old and I stayed near the stairs and we made do. I'm glad they had the pool because my son loved it; but I just wish for my own sanity that it was bigger so that the kids would be spread out more. * I did appreciate the fact that the pool is right near the elevators so that you wouldn't have to traipse through the lobby in your robe and swimming suit. Front desk people and concierge were really helpful and just plain nice. They got a crib into our room in record time. When we called to ask why the heater was only blowing cool air, they offered to send someone up right away. When we explained that our son was already asleep and therefore we didn't want a repairman to come and wake him up, they promised he would be very quiet. I thought that was cute. We still didn't take them up on the offer that night, but he showed up the next morning anyway, which was kind of nice. Overall, I really enjoyed staying here but would go somewhere else for breakfast.", "Date": "April 10, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "4", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Suburban Area of Chicago, IL", "Title": "“Very Nice Rooms & Setting!”", "Author": "MisterBill48", "ReviewID": "UR7247146", "Content": "I initially had some concerns that the remodeling might still be underway during my stay, but upon arriving, I found everything to be very fresh and immaculate! The executive suite was newly remodeled, and I loved the layout, furniture, fixtures, and everything else. It truly is comfortable and relaxing! The flat screen TV in the living room was a nice surprise, and the bed was so comfortable that I actually felt I was asleep at home. Since I always got downstairs on the early side (due to normally being 2 hours ahead by living in the central time zone), I really enjoyed the breakfast, and was able to find lots of fresh selections and plenty of tables available. It does crowd up considerably if you choose to go later, though! The pool was very nice, but in all fairness, some of the parents really overindulged in letting their small children run wild! I can well understand the enthusiasm of being on vacation and having as much fun as possible, but I wouldn't want to think that anyone would get hurt as a result of kids running around on wet pavement or jumping into the pool almost on top of someone else (it almost happened to me!), etc. Perhaps the hotel should consider setting an hour or two aside for adults to swim, while children could do something elsefor fun.", "Date": "March 29, 2007"}, {"Ratings": {"Overall": "2.0"}, "AuthorLocation": "San Diego", "Title": "“Expected a lot more”", "Author": "Neutron1", "ReviewID": "UR7231169", "Content": "Stayed in a \"business suite\" here for a week that had a desk type piece of furniture but no chair and a TV on it so it was not usable as a desk. No wet bar and no table/chairs and their website advertises that every suite has this, High Speed Internet was only wireless and the only place I could get a usable signal was sitting on the floor near the door. Parking is $17/day and the garage has 1 driving lane for up and down traffic and it fills up quick so you may or may not park there even though you paid for it. Plus when you get to the top it is still 1 car wide so you have to back down 3 levels all while stopping the traffic coming up, telling them there is no parking and then telling them they have to back up as well. I will not be going back here.", "Date": "March 27, 2007"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Business service (e.g., internet access)": "2", "Check in / front desk": "4", "Overall": "2.0", "Value": "3", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Austin", "Title": "“Not a Business Hotel”", "Author": "DJH-in-Austin", "ReviewID": "UR7202106", "Content": "Good points: - very clean and well furnished - friendly staff - nice beds Problematic for Business Travelers 1) No speaker phone in room. Very annoying if your business is global and requires extensive late night conference calls. Inexcusable for such an expensive Hilton property. 2) Mobbed Breakfast Area. This property clearly markets aggressively to get huge families on vacation from Latin America. Makes the breakfast area hopelessly unusable. 30 minute waits for everything. Even worse, there is no nearby substitute restaurant (a solution I have used at other Embassy Suites) 3) No hot water circulation system. Not a business travel problem, but inexcusable for such a premium property. Have to wait 5-10 min for the hot water to warm up all the pipes between the basement and the top floor before you can take a shower. Premium properties worldwide usually have a system that constantly circulates hot water on each floor to avoid this lag. 4) Inept laundry service. Was 2 hours late. But they also forgot to charge me for it. 5) Expensive and clumsy parking system. Garage is reasonably nice, but they want $17/day for it and they have to fumble around with your room number every time you drive in and out. And they also have trouble keeping track of your charges which requires multiple visits to the front desk to correct their cooridination problems. 6) Slow room cleaning. Rooms still not serviced at 4PM on some days. 7) Sealed Windows. Again, not a business travel problem, but I hate hotels that won't let you get fresh outside air into the room... particularly frustrating when you are near the ocean and can't enjoy the offshore ocean breeze in your room.", "Date": "March 22, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Altadena", "Title": "“Great place, all remodeled.”", "Author": "Anne622", "ReviewID": "UR7191954", "Content": "This Embassy was a great place to stay for a combination business and pleasure trip. Just finishing up their 10 million dollar redo made me feel like I was in a brand new hotel. We were on the 7th floor and the suite was perfect. It was quiet at night so we slept well. Overall just very comfortable. An early cooked to order breakfast was available (included in room rate) along with many items to just pick up and run. There is a nice mall across the street and kept me busy while my husband attended a seminar a few miles away. Nice restaurants in the area, but most are off the main street so ask or know where you are heading--you will have a hard time if you just try to find something while driving around. This hotel attracts business clients during the week but there were many families staying over the weekend. I would definately return to this establishment next time I need to come to San Diego!", "Date": "March 19, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Paradise", "Title": "“Predictable Excellence”", "Author": "withay53", "ReviewID": "UR6843197", "Content": "I am a regular at this location. I stay for 12 days and nights, five to six times a year. When I check in the front desk staff addresses me by name. They are always courteous and professional. The rooms here are excellent. The housekeeping staff is professional and attentive to any special needs. The breakfast fare is excellent and the staff is capable and quite friendly. The managers reception is a nice benefit and the staff, as usual, is quite friendly. Being a two week resident, I appreciate the free laundry on several floors of the hotel. It allows me to pack light if I choose, and do my laundry conveniently near my guest room. The restaurant staff is very friendly and ready to see that your food and service meets the high standards that have come to be known worldwide with Embassy Suites. The staff that takes care of my conference needs are the best. They check in daily to ensure all my needs are met. Relating to the indoor property, my wife once said, \"this is one hotel where if it were raining all day you would not be disappointed being trapped inside\". If you have ever been to an embassy suites, you know exactly what we mean. The location of the property is perfect with top name dining within walking distance, one of the largest malls across the street and the beautiful beaches of San Diego minutes drive west. With all of the upgrades in rooms, and public meeting areas going on in 2007, I can't imaging a more ideal property for the family, business person, or group event. I feel spoiled having my conferences here and hope my organization continues it's long relationship with this property.", "Date": "February 26, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Business service (e.g., internet access)": "4", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Palm Springs", "Title": "“Highly recomend it”", "Author": "JPAMF", "ReviewID": "UR6764550", "Content": "As a frequent business traveler I have never written an \"atta boy\" for a hotel. In this case I must. It's the people that make this hotel a great place to stay. I stay here at least 5 times a year for mutiple night stays and hope that I never have to stay at another place while in the San Diego area. Many of the staff have been around for a long time and from the time you rise in the morning, the happy, helpful people that greet you at breakfast seem egar to see that you are pleased, contented and serviced. The front desk people always have a smile and a quick warm greating and they seem to thrive on making it their business making you feel welcome. The housekeeping department are adept at doing an efficient job and seldom being seen, but when you do it is always with a smile and a warm hello. I have seen a great improvement in the restaurant staff in the past visits, They have joined the team effort that permiates the rest of the building. The bartender is great and friendly, constantly looking out for the comfort of the customer. The new look of the rooms is great, first class all the way. It is so great to have a staff that work so well together at taking care of the needs of the guests. My kuddos to the management staff for creating a great team.", "Date": "February 8, 2007"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Boulder, Colorado", "Title": "“Great Base for SoCal Family Vacation”", "Author": "BoCoTraveler", "ReviewID": "UR6584650", "Content": "We stayed here with our 4 and 6 year olds as 'home base' for going to Legoland, Sea World, etc. It was a great value for our family. Breakfast was good and exciting for the kids each morning, cocktail hour was exciting for us parents each evening! Kids LOVED feeding the fish in the lobby. We walked across the street to the mall food court for budget friendly dinners and lunches. Overall a great experience, complaints were not enough to warrant mentioning.", "Date": "January 13, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "roseville, ca", "Title": "“Excellent Hotel - Awesome bed & pillows!”", "Author": "countrymomma", "ReviewID": "UR6556106", "Content": "We stayed at the Embassy for 3 nights - and we thoroghly enjoyed ourselves at the hotel! We brought a nanny with us to help with the kids - so the two room set up was great with the pull out sofabed and the absolutely wonderful bed and pillows - I haven't slept that good in years! I am actually going to order the pillows online - same ones - yeah. The hotel is super clean! The linens, carpet, everything - but it is brand new remodel for the most part - so that is great. The breakfast was excellent - just be advised to get up early - if you arrive at 8:30 for breakfast there is a huge line - so we went down at around 7 and no line for fresh made to order breakfast. The atrium is beautiful and the the koi pond is great to look at - the atmosphere is wonderful too. We ate at the PF Changs that is right next door so that made for an easy dinner - and that PF Changs is awesome. The parking costs money - but I didn't mind paying for the convenience of actually having easy parking in the garage. I will definitely stay at this hotel on my next trip - it's so easy to get to every place we went to on our 4 day stay - and that includes Sea World, Wild Animal Park, Old Town, and Coronado. And as a plus - the staff there are extremely nice and super helpful - definitely a must for me that and the clean room - so what more could you ask for!!!", "Date": "January 5, 2007"}, {"Ratings": {"Service": "1", "Cleanliness": "4", "Business service (e.g., internet access)": "1", "Check in / front desk": "1", "Overall": "2.0", "Value": "2", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Milwaukee WI", "Title": "“Never Again”", "Author": "CoCoa04", "ReviewID": "UR6021624", "Content": "From the moment I walked in the door, I felt very unwelcome. The staff was rude, in fact the entire town was so snooty. Be sure to ask how long breakfast will be served. Apparantly it is different times depending on midweek or weekend. We were never advised & missed breakfast the 2nd morning.", "Date": "October 28, 2006"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Rhode Island", "Title": "“Great Place to Stay”", "Author": "Ganymede77", "ReviewID": "UR5943800", "Content": "My wife and I stayed here on vacation for 3 nights in late Sept 2006. Despite a lot of digging I was unable to find a hotel that met our needs (quality/price) in Lo Jolla village proper so we finally decided to stay nearby and this hotel appeared to offer the best value. We were very pleased with our choice. The design of the facility is similar to other large Embassy Suites (eg. Chicago). Very dramatic lobby and interior and great suite rooms. The ES suites arrangement always seem very generous to me in comparison to most other hotels. The entire facility was clean and well maintained. Service was very attentive. Location is convenient - it's on a major travel road and across from a large mall. Convenient to La Jolla village, Scripps aquarium and Route 5. Parking is slightly extra but very convenient with an adjacent indoor garage. Embassy provides good value with an excellent breakfast as well as a nice complimentary cocktail hour with snacks (salsa and chips, etc). We avoided the in-house restaurant for dinner because it didn't look that exciting and because there a lot of good alternatives nearby. I'm a tough grader. I recommend this hotel. It's not a romantic getaway but you could do a lot worse for business or personal travel.", "Date": "October 11, 2006"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Check in / front desk": "4", "Overall": "3.0", "Value": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "So Cal", "Title": "“Good location. Small Rooms?”", "Author": "TeamIguana", "ReviewID": "UR5817493", "Content": "We stayed at the La Jolla Embassy Suites with our 18 month old for four nights. Taking the advice of others, we requested a room high up and not facing the street. The rooms are a bit small and narrow. We have stayed at other Embassy Suites and this was by far the smallest as far as room size. The walls were pretty thin and although we had a stairwell on one side (no noise there) we were able to hear the baby and singing father next door for at least one of the nights. Having kids of our own we understood but it tells you how thin the walls are. The room had a weird configuration where the door separating the bedroom from the living room opened and blocked the doors leading to the microwave and refrigerator. We found this a bit annoying. We did like the Koi ponds in the lobby. All rooms have a window facing out as well as a window facing the inner atrium. This atrium is over 14 floors high with the pond and breakfast dining area in the court yard. The location is great. Right next to the 805 freeway and across the street from the University Town Center outdoor mall. There are all kinds of places to eat and shop there. You do have to cross a major street (almost like a freeway the way people drive so stroller pushers beware) and it ends up being about 2 or 3 blocks until you find any restaurants. The UTC area is quite fun once you are there. There is also a mini play ground near Sears and a bunch of fountains through out. Some very accessible to little ones who want to get wet. The somewhat frilly Chinese food restaurant PF Changs is right outside the entrance. A bit pricey for small servings of Chinese food but from the wait and valet lines you would think they were givng it away. More on the hotel. It does have a indoor swimming pool but it is rather small. More for taking a dip than trying to do laps. And it is strange but they put the jacuzzi just outside the doors in the outside with lounge chairs available. The breakfast was not bad but they seem to limit the omelets to just one type every morning. No custom omlets which I have seen at other Embassy Suites. The Manager's reception was the usual chips and salsa and drinks but what do you expect for free? I read a review about a watch being stolen but I suppose the best advice is not to leave valuables lying around. It made me a little anxious about the staff but then again why would you want to take that chance? There is a parking lot where you basically have to pay the $15/day to park. I really don't know what happens if you tell them you don't have a car or just park across the street in the mall. There are also some unregulated spaces that do not require an entrance gate so I don't know who monitors those. The parking thing always annoys me but I know about it in advance so what can you do? Overall I would give this 3 and a half stars but there is no middle choice between 3 and 4 and I would not say that this was an exceptional hotel. Just very clean and in a good location.", "Date": "September 19, 2006"}, {"Ratings": {"Overall": "2.0"}, "AuthorLocation": "Camano Island, Washington", "Title": "“Watch Stolen from room”", "Author": "lcamano", "ReviewID": "UR5544046", "Content": "April 10, 2006. We had a wonderful stay outside of the fact that my beautiful Tommy Bahama watch dissappeared from our room while we were at breakfast. We were completely surprised to find the maids had cleaned so early (8:00am). I contacted the hotel a few times and got empty promises (from Asst Mngr. Erica) but she didn't make good on them so I am still \"watchless in Seattle\". The hotel itself is a nice. The staff is super friendly and helpful. The only pool is indoor. The made to order complimentary breakfast was really good. The $199.00 per nite for a suite would have been a great value if I didn't have to spend another $350.00 on a watch :( This hotel is not going to reimburse you if one of their employees steals from you so pay close attention to the \"DO NOT LEAVE VALUABLES\" sign in your room, they put them there for this reason.Remember, the maids come earlier than most hotels Tip: Ask for a corner room, ours was nice and roomy", "Date": "August 2, 2006"}], "HotelInfo": {"Name": "Embassy Suites San Diego - La Jolla", "HotelURL": "/ShowUserReviews-g60750-d80113-Reviews-Embassy_Suites_San_Diego_La_Jolla-San_Diego_California.html", "Price": "$161 - $261*", "Address": "<address> <span rel=\"v:address\"> <span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">4550 La Jolla Village Drive</span>, <span class=\"locality\"><span property=\"v:locality\">San Diego</span>, <span property=\"v:region\">CA</span> <span property=\"v:postal-code\">91214</span></span> </span> </span> </address>", "HotelID": "2515658", "ImgURL": "http://media-cdn.tripadvisor.com/media/ProviderThumbnails/dirs/5a/bb/5abbbd2361ae92b35d75705c9e62f9415large.jpg"}}