{"Reviews": [{"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "London, United Kingdom", "Title": "“Excellent staff, excellent location, lovely hotel”", "Author": "Olivia024", "ReviewID": "UR127129627", "Content": "I stayed at this hotel two weeks ago - seems like yesterday sorry for delay in writing this review - I was with my colleagues on a business trip and I was nervous given that I had handled the bookings, I need not have been. The hotel staff were lovely and checked us in with great speed. The hotel is small so do not expect large rooms but it is the attention to detail in each of the rooms which I found excellent for example the hairdryer was in a cupboard under the sink and it was a proper hairdryer that you could simply plug into the plug NEXT to the mirror (other hotels take note) so that you could blow-dry your hair without having to use one of those horrid things stuck to the wall that do not generate enough heat to dry your hands let alone your hair. The wardrobe had a full length mirror on the inside of the door - perfect to check your outfit before going out to a day full of meetings with potential clients. The shower had both a large fixed head and a hand held option. There was writing paper in the desk. The coat hangers were proper coat hangers not the sort that you have to unclip which I cannot abide I mean do they really think I am going to steal a coathanger? The rooms are spotless and very comfortable. The hotel's location is very central - a one minute walk to the Madeleine and Fauchon where you can buy the most divine madeleines not to mention a five minute walk to Laduree to buy macaroons! If you have to go further afield the staff can call you a taxi in a matter of minutes and there are no fewer than three metro stations within walking distance. A great place to stay in Paris.", "Date": "April 2, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Orlando, Florida", "Title": "“Excellent service & outstanding design in the heart of Paris...”", "Author": "sanschr", "ReviewID": "UR125398471", "Content": "perfectly located in the middle of Paris, the unique design, the great facilities and the high quality of service will make you trip memorable and want you to come back. The quality/price ratio for a 3 night-package is also attractive. You will definitely enjoy: The newly renovated rooms, The design and deco of the hotel facilities, The clarity of the hotel website and the speed of the online reservation, The speed of the WIFI connection, The freshness and variety of the breakfast, The perfect location (near La Madeleine, a few minutes away from Les Champs Elysees, Les invalides, ...) I only have 1 recommendation: there is no selection of international newspapers but this is not a big deal as the wifi access is really good to use ipads, iphone or laptops. If I have to go back to Paris, I will definitely stay in that hotel.", "Date": "February 29, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "London uk", "Title": "“Nice stay at the Athénée”", "Author": "Lucy H", "ReviewID": "UR125135947", "Content": "We had a very nice stay at this hotel, ideally situated near the Galerie Lafayette and the Opéra Garnier. We had decided to spend Valentine's Day in the City of Lights, and we appreciated the hotel's glamourous interior design! The staff is friendly and cheerful, particularly Quentin, who prepared some gorgeous mojitos-champagne! We already decided that this is where we will stay next time we come to Paris.", "Date": "February 24, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Kerry", "Title": "“Beautiful Hotel, great location, excellent staff”", "Author": "jimmychoo1", "ReviewID": "UR124853240", "Content": "Really enjoyed our stay in Hotel Athenne. From the moment we entered the hotel we knew that this would be a very good stay. Really friendly staff who speak excellent English (for those who's French is not so good). Aurélie in reception was so helpful to us we really appreciated the information and great attention shown to us. Our rooms were beautufully decorated, I especially I loved the wallpaper in the room on the 5th floor. Both rooms we stayed in were very quite and very clean with very comfortable beds. We didn't have breakfast as we wanted to explore the cafes around the area. But in the evening we had a drink in the bar/lounge area which was very realxing. The barman makes great mojitos! The hotel is really well located. Very close to the main shopping area plus only 15/20 minute walk to the main tourist attractions. I would recommend that you contact the hotel to arrange a taxi pick up from the airport, as we got charged €85 by a so called \"taxi\"!! It should only cost €50-55. I cannot wait to return to Paris and I am already planning our next trip and we will be certainly staying in Hotel Athenne. Merci à tout le personnel qui a rendu notre séjour très agréable (Thank you to all the staff who made our stay very enjoyable)", "Date": "February 20, 2012"}, {"Ratings": {"Service": "1", "Cleanliness": "4", "Overall": "1.0", "Value": "2", "Sleep Quality": "3", "Rooms": "1", "Location": "5"}, "AuthorLocation": "Moscow, Russia", "Title": "“Terrible desk manager”", "Author": "Nikolay V", "ReviewID": "UR124567953", "Content": "We stayed at this hotel with several friedns and occupied almost the whole hotel. When we just arrived the receptionist couldn't find our reservation and almost kicked us out. When I woke up I hear water driping from the ceiling lamp (!!!) in the hall way and told the manager about it. She seemed very annoyed with me bothering her. Moreover when we were leaving there was a scandal with the manager, because she refused to give back the bags which were left at the reception a day before. She claimed that she gave them back, however later found them in the storage room. Terrible experience! Spoiled beautiful Paris trip :(", "Date": "February 14, 2012"}, {"Ratings": {"Service": "1", "Cleanliness": "3", "Overall": "1.0", "Value": "2", "Sleep Quality": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Moscow, Moscow City, Russia", "Title": "“Bad personal”", "Author": "AlexanderIsachenkov", "ReviewID": "UR124512393", "Content": "Spent 2 days in Athenee with my friends. We left some bags with birthday gifts on reception - and couldn't receive them back!!! The manager said she didn't take it!!! So we were to leave back home, but a friend of mine from Paris watched the cameras in the lobby and pointed on bags taken by manager. So we got them back!!! This situation is so annoying! I'll never stay in Athenee anymore and don't recomend to anyone!!!", "Date": "February 13, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "3", "Sleep Quality": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Lyon", "Title": "“Nice place to stay”", "Author": "voyageur072", "ReviewID": "UR123833440", "Content": "This is a cosy hotel with a pleasant and warm design giving you the impression of being in a theater (boxes in the upper circle). Well located in Paris. Bedrooms are quite tiny but beds are large and very comfortable. Very silent. The breakfeast is ok but nothing outstanding and I would say expensive. I would have appreciated to have the possibility to have more light in the bedroom and in the bathroom. Even in theaters there are some rooms where you can see what you do: at least on the stage ;). Fairly expensive rates not totally in accordance with the services provided: Rates are in phase with a 4 star hotel, but this is not really a four star hotel but rather a good 3 stars. Relaxed and friendly service. I personnaly like this but for some people can considered as too much casual for a 4 star hotel. That said, if you know in advance the above limitations, this hotel is fine.", "Date": "January 30, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "London, United Kingdom", "Title": "“fantastic for a short break”", "Author": "ian a", "ReviewID": "UR123820808", "Content": "pleasant boutique style hotel with a central location for shopping and main attractions. Staff couldn't have been more helpful. Hotel in a 'boudoir' style (low lighting, lots of red/scarlet materials, heavy curtains etc) which is tasteful and add to the charm. Not huge bedrooms (stayed on 1st floor in standard room) but the most enormous double bed we have ever slept in!. This meant there isn't a huge amount of room around it. Perfect hotel for a short stay (1 or 2 nights) but size of the bedrooms probably not ideal for longer stays Overall a great hotel", "Date": "January 30, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Harrington Park, New Jersey", "Title": "“Great Location & Friendly Staff”", "Author": "sunset155", "ReviewID": "UR122999038", "Content": "This hotel had a great location, close to all major sites. Best of all it was charming and the staff went out of their way to make our stay more enjoyable.", "Date": "January 12, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Washington DC, District of Columbia", "Title": "“Beautiful boutique hotel, perfect location”", "Author": "SarahKMichael", "ReviewID": "UR122830856", "Content": "Hotel Athenee is gorgeous. We loved the decor of the hotel, our bedroom, and especially the spacious and luxurious bathroom. We stayed in a superior room for three nights, and it was just lovely. The bed was very comfortable, and the shower/deep soaking tub was just what we needed. We felt the staff was excellent. Every staff member we encountered was extremely helpful and friendly, and everyone spoke great English! Notably, they got us dinner reservations one evening at a restaurant that is normally booked months ahead. They are happy to arrange anything you need - reservations, taxis, sightseeing advice, etc. For our first time in Paris, I don't think I could have picked a better location. The hotel is very centrally located. We walked ALL OVER the city from the hotel. The only time we took a taxi while sightseeing was traveling from Montmarte to the Marais neighborhood because I did not think I could navigate that route by walking. In summary, this boutique hotel was very romantic, quiet, and just what we needed!", "Date": "January 9, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "5.0", "Value": "3", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "New Canaan, Connecticut, United States", "Title": "“Great hotel; Questionable staff.”", "Author": "Jillian333", "ReviewID": "UR122717214", "Content": "It was our first time to Paris - Europe in general. The hotel is located in a great neighborhood with great shops, restaurants, etc. There are different subway lines on about every corner which is totally great for people who use subways. Hint - there is a Starbucks around the corner for those of you who NEED a real American coffee! :) Our room - 401 - was decent size - a bit small for the price, but we overlooked that b/c the bed was really comfortable and since we spent most of our time OUT of the hotel room, it was great for just going back to and crashing. The bathroom was brand new and really clean. A tub with a TV too was a real bonus after a long day of walking. There are 2 windows that open up to the road - which if you are a late sleeper - don't even think about having those windows open in the morning as trash pickup is every day and the way the street echos, you can hear women trodding by with high heels on at all hours of the night. Free WIFI works really really fast as I had emails to write and Facebook check ins to post. We had breakfast there one morning - I think b/c we thought it was free - it isn't unless you pay for it in your room rate. It was very expensive and not fresh in the least. You are better off going out and finding a cafe to eat and people watch for a couple hours. The staff - it's not that they weren't nice - they just didn't make the effort that people who work at hotels usually make - i.e. help with baggage, suggestions with food, travel, etc. They also asked us for our room number just about every time we walked in the door which was annoying and still I'm not sure why they were doing this. The lobby was on the dark side - not dirty, just dark in decor. The staff did help us out with umbrellas one day, which we were greatful for, but as I hear, that should be automatic in a hotel. Oh - the conceirge isn't there the whole time - I believe they are there from 10am to 7pm so if you come in later than that you have to ring the doorbell to get it and one of the people who work there have to come and let you in. All in all, I would stay there again, but probably won't as I understand now there are cheaper places with more amenities. Elevator is really, really tiny. You can only fit two people in it - probably one of the cooler things that the hotel had to offer. Bon Voyage!", "Date": "January 7, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "4.0", "Value": "3", "Sleep Quality": "5", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Singapore", "Title": "“Well located charming boutique hotel”", "Author": "JChua", "ReviewID": "UR122656326", "Content": "We have been to Paris many times and usually stay in 4 and 5 star hotels in recent visits. The main reason for choosing this boutique hotel was because we were attending a ballet show at the nearby Opera Garnier and did not want to 'fight' for a cab after the show had ended. Plus, arriving in Paris on 30th December from Lisbon, Protugal, we would like to do some last minute shopping before both Printemps and Galeries Lafayette closes for the festive season's. Having experienced Paris well known small rooms during our younger years, I booked the Hotel Athenee's 'Largest bed in our Largest room' ie their Deluxe rooms. Our rooms wasn't ready at noon, so off we start our shopping spree ... After returning at around 2.30-3pm, our room 301 was finally ready. Upon entering the 'Deluxe room' - my heart sank for a moment, 'What have I done, was this their supposed biggest room? The door leading from the bed to the bathroom was not a normal sized door as it cannot be swing open fully. Instead, it was a cute and small double leaf door, so both doors can be swing open - how intelligient! Well, we consoled ourselves as nearby 5 star Hotels are in the range of 500-600 euros a night for the Year End, and this Hotel only charges us 300, with breakfasts and Wifi included, and its only for a night. We unpacked a little but soon discovered that the room wasn't that 'small' after all - especially if we place our two small cabin bags in the huge closet and push the table and two arm chairs (so very comfy chairs!) closer to the King bed. In that way, we actually do have some extra space to move about. Next, since this is a new hotel, the whole room and bathroom was entirely new, and it has a tub with a small TV (but poor reception!), single basin and WC cubicle. Everything worked and even the TV has one BBC channel, nice! Other pluses were - good and powerful hair dryer, good quality toiletries with rare 'hand cream', and most importantly, the most comfy bed of all the 6 hotels in this trip - even better than the 4 stars Hotel Raphael (stayed 2 nights) and 5 stars Hotel de Crillon (stayed 1 night). The road which the Hotel is located on is actually quite a lively road, with restaurants, cafes, a supermarket, a pharmacy, and one or two more Hotels. During the day, traffic was quite busy and napping was a little difficult. However, when night falls, we had a solid 8 hours of uninterrupted sleep ... we even kept referring to the Hotel Athenee's bed while staying at the other two Hotels in Paris. The common areas, though small, are very charming indeed. Cons of staying here are - at 300 euros a night, it was a tad expensive considering the Hotel Le Vignon, also a 4 stars, located on the next street which is charging around 100 euros lesser for their biggest room; the whole room was so so dark that you could not possibly read other than on the bed, a huge chandelier in the centre of the room would have been nice; breakfasts offered was simple and fine but only half a cup of coffee was offered, no fruit juices nor mineral water in sight? Overall, though the Hotel is rated 4 stars, we felt it is more like a solid and good 3 stars. If this was truly 4 stars, then why is the Hotel Raphael also rated a 4 stars (huge common areas, roof top terrace and an in-house Restaurant)? But since the Lady Boss and her staff are all so friendly and helpful, the Hotel Athenee is now brand new and located superbly for the Opera and shopping, we felt we did have a good stay here as well as a very good night's of sleep - these are good enough reasons why we are granting it a 'Very good' rating.", "Date": "January 6, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "2", "Overall": "3.0", "Value": "2", "Sleep Quality": "3", "Rooms": "2", "Location": "4"}, "AuthorLocation": "Washington DC, District of Columbia", "Title": "“Friendly staff, but not a great choice.”", "Author": "explorerlala", "ReviewID": "UR121524909", "Content": "If you are traveling for business, they do have wifi, which is helpful. But the room was so dark I could hardly see with the lights to read. I know this is Paris, but it was quite small. The location is great and close to Place Vendome, Opera and other things. If you are overweight at all, don't attempt to get into the elevator. It's tiny.", "Date": "December 8, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Location": "5", "Rooms": "4"}, "AuthorLocation": "", "Title": "“What a gem!”", "Author": "TDurkin", "ReviewID": "UR121084223", "Content": "Loved this hotel. Very convenient to everything. Rooms were clean and roomy, for Paris. We had the family room, which was two connected rooms. One had a shower the other a luxurious tub with tv. Plenty roomy for 2 adults and 2 teens. The staff is very friendly and helpful. Lots of fun restaurants nearby, so did not try the hotel breakfast. Our only wish was that the rooms had brighter lighting. Would definitely try the hotel again.", "Date": "November 27, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Zurich, Switzerland", "Title": "“A little gem”", "Author": "PaulWhitty", "ReviewID": "UR120939450", "Content": "I booked the Hotel just so that i was near the Metro. What a great bit of luck for me. wonderful location, superb staff, especially the girl on reception when I arrived. Couldn't do enough to help. Hotel is perfect location for Paris and a gentle wander around the streets. Great atmosphere in the hotel, and cant really fault it.", "Date": "November 23, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "London", "Title": "“A lovely, chic boutique hotel in a perfect location.”", "Author": "RayKhoo", "ReviewID": "UR120897876", "Content": "Given that we don't get to go to Paris every weekend, I think I can safely leave this review without worrying that the hotel will always be fully booked when we want to return! I normally stay in boutique hotels in the St Germain area, but thought I'd try a change of scene this time around as I was taking my wife for her birthday. I was also looking for bigger rooms than are usually on offer there (Paris boutique hotels have notoriously small rooms and bathrooms). The Athenee was a real find. The location is great, right next to the great shopping of Lafayette, Printemps and the Rue du Faubourg St Honoré. Great food nearby at the original La Durée, the classic Café de la Paix, and others. The hotel itself was fabulous. Small (only 20 rooms), beautifully designed (Jacques Garcia, who did Costes and the Mamounia), impeccably managed. It's less than a year old, so everything is still spotless and gorgeous. The rooms are moody and sexy, the bathrooms luxuriously comfy (flat screen over the bathtub). Breakfast is a treat of gourmet nibbles, including the best freshly squeezed orange juice I've had in ages. Most of all, though, the staff were just great. Helpful, friendly, impeccable. A very classy place to enjoy a relaxed, elegant few days roaming Paris... Enjoy!", "Date": "November 22, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Switzerland", "Title": "“Fantastic Boutique Hotel downtown Paris”", "Author": "miur69", "ReviewID": "UR119801223", "Content": "I enjoyed a couple of days there with Jean Luc and Oksana, unique hosts. Jacques Garcia decoration gives a warm ambience in this new Parisian address. I went there for business and it is perfectly located, close to everyplace but also great for shopping - a couple of steps far from Opera, Lafayette, Place Vendome. Well connected with METRO and RER to train station and airports. A recommend.", "Date": "October 27, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Albuquerque, New Mexico", "Title": "“Perfect Parisian boutique hotel!”", "Author": "Tanya M", "ReviewID": "UR119642230", "Content": "We were enchanted by this wonderful hotel with first class bedding and lovely decor. The staff were warm and very helpful. We elected to move to a larger more delux room after the first night that was very, tiny. Even the staff seemed embarrised to show it to us. It was well worth the extra cost to upgrade with french doors and a second TV in the marble bath! It is very close to the Opera house, Madeline church and Gallerie Lafayette.", "Date": "October 23, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "3", "Overall": "2.0", "Value": "2", "Location": "3", "Rooms": "1"}, "AuthorLocation": "", "Title": "“Tiny dark rooms and staff removed drying clothes when we were out”", "Author": "TravelingDeveloper", "ReviewID": "UR119468305", "Content": "Rooms were tiny and really really dark. If you wash your travel clothes yourself when traveling don't stay here. We had our clothes drying, while we were out. They removed our clothes and left us a haughty note informing us it was \"forbidden\" verboten !!! I still can't believe they removed our belonging without permission. Anyway, I sure there are better hotels form the same money. Disappointing.", "Date": "October 19, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Toronto, Canada", "Title": "“Lovely boutique hotel in perfect location”", "Author": "Vilma_11", "ReviewID": "UR119272454", "Content": "We decided to spend our 20th wedding anniversary at this romantic and welcoming hotel. Not our regular area to visit in Paris, but we were happy to try something new. The staff are lovely, warm and inviting, ever ready to help in any way. We enjoyed the quiet street despite the proximity to wonderful stores and restaurants. Beautiful ambiance and certainly a destination we will return to and highly recommend. We were in the deluxe room which may have been more spacious. The Don Giovanni themed room on the third floor, which had ample room for 2, along with a spacious enough washroom. Thank you Quentin and the great team at Hotel Athenee!", "Date": "October 13, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "London, United Kingdom", "Title": "“A nice surprise.”", "Author": "Julian M", "ReviewID": "UR119135932", "Content": "Had to travel to Paris for just one day. The usual business travel. I usually stick to the big chains as I know what to expect from the hotel but this time I booked with this small boutique property as it is very close to the Opera where my office is located. What a nice surprise this hotel and mainly it's staff was. Everything was irreproachable. WiFi in the rooms - working well. Special credit to Oksana at the reception who happened to speak fluently a few languages, including English and Russian and provided excellent concierge guidance about what's worth seeing around, where, how, etc. Clean, quiet (although my room was just above the busy street) and somehow luxurious place. Somehow, because the rooms are not that big (approx 18-20 sq.m.), but they are well arranged and stylish. I'd return there.", "Date": "October 10, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Melbourne, Australia", "Title": "“A boutique first class hotel with first class service!!”", "Author": "rita m", "ReviewID": "UR118829339", "Content": "What an amazing find by complete accident! A wonderful 4 star boutique hotel at a very affordable price.. Excellent location close to everything and if not, the fantastic staff are always happy to arrange a taxi to your door step in a matter of minutes.. the metro is also in the next street. Breakfast was great with a big variety of cold buffet and the rooms are very clean- only they are quite small... A big thank you to Quentin and the athenee team for truly making my stay that much better!! I have been to Paris many, many times and have always stayed at the larger 5 star hotels which are beautiful however, the athenee is just as good but on a boutique scale at a third of the price!!! See you next year!! RM", "Date": "October 1, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "London, United Kingdom", "Title": "“Great boutique hotel and fantastic staff”", "Author": "imaomouto", "ReviewID": "UR118469492", "Content": "We had a business trip to Paris and the Athenee was perfect. Really friendly and helpful staff, fabulously designed rooms and a great location. Would definitely stay again and recommend to others. Would be especially ideal for couples visiting Paris.", "Date": "September 23, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Venice, CA", "Title": "“Fabulous boutique! Best night of travel sleep, hands-down.”", "Author": "KBdubbadub", "ReviewID": "UR118305798", "Content": "Just checked out of the Athenee this morning. It was perfect for our weekend jaunt to Paris! The rooms are small, per the European norm, but the details are perfect. (I should note that we were originally shown to a room on the 5th/top floor, beneath the mansard roof. We politely declined in favor of a room on 3rd, larger & more comfortable for 2 friends travelling together). The bed, sheets, pillows and comforter - all perfection. Critical, as nearly the only time we spent at the hotel was spent sleeping! So comfortable that, exhausted from travel, we accidentally slept 12 hours the first night! Heaven. The other thing we did in the hotel was bathe, and the bathroom was excellent - lovely, roomy, etc. Last note - service. Perfect, warm, unerringly helpful. Many thanks!", "Date": "September 19, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "4", "Overall": "4.0", "Value": "4", "Service": "4"}, "AuthorLocation": "Washington DC, District of Columbia", "Title": "“Good Rooms for a Family”", "Author": "coolya", "ReviewID": "UR117049776", "Content": "There are not a lot of hotel options for families traveling with 2 children if you don't want to pay for 2 hotel rooms. Hotel Athenee has what they call suites that are really two rooms next to each other with a private vesitbule. It worked very well for our family. Each room has its own bathroom. I did not find the rooms to be as small as the other reviewers. Not sure if this is because we had the suite or just that I wasn't expecting a spacious room in Paris. Hotel rooms in NY are of a similar size. The immediate neighborhood is not great but it is within a few minutes walk of the Opera with lots of cafes and shops.", "Date": "August 21, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Richland, Michigan", "Title": "“Everthing and everbody was so nice”", "Author": "pipeman104", "ReviewID": "UR116125232", "Content": "My wife and I stayed 7 nights July 21 ---July 28, 2011. We liked the room, the furnishings, the breakfasts, the WIFI, and the friendliness of everybody. The hotel was close to many restaurants and attractions. Loved It!!!!!!!!!! Gordon & Gloria Lentz Richland, Michigan USA", "Date": "August 1, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "3", "Overall": "3.0", "Value": "3", "Service": "4"}, "AuthorLocation": "Cheltenham", "Title": "“5* Location..4* Staff..3* Rooms”", "Author": "AJ_0001", "ReviewID": "UR115774364", "Content": "The upside - This hotel is fantastically situated....just a couple of hundred yards from the Opera House...5 minutes walk from Printemps and Galaries Lafayette...10 minutes to the Louvre and Jardin des Tuiteries, 20 minutes to Notre-Dame, 35 to Arc de Triomphe and Hotel des Invalides. Perfect for getting to everywhere with great access to the Metro too. Fairly quiet street, with plenty of good cafes, bars and small grocery shops just moments from your door. The staff were very helpful - checked us in and out very quickly - always around to answer questions and went out of their way to sort airport transfers, recommend the best local cafes etc. The downside - We are experienced travellers ...This hotel is fine for a few nights - but no more than that really... I have to say that the 20 or so rooms are small....and I mean SMALL! We had room 502 (top [5th] floor at the front) ...just about the smallest on the hotel plan it turns out...and it was really VERY small indeed. So much so - there is no room for a wardrobe or even drawers for your clothes ...just a tiny cupboard built into the wall..you have to bend down for, about 3 foot high, with a clothes rail in that you can hang shirts from ...but certainly no room fo a dress. Because it was the top floor - the ceiling sloped a lot...and you had to watch for hitting your head all the time (we both did - and we are not tall!). The window looked out onto the road ...but the angle meant you couldnt see anything ...just the buildings opposite. You didnt really have a choice about this ...because the curtains did not really cover the window fully ...which meant the sunlight came in every morning and woke you up whether you wanted a lie-in or not! The bathroom was fine and was 4 star - again very small - but fine ...with a good shower - however - sadly this leaked out onto the bathroom floor every time it was used. All this said - the room was very clean and tidy - housekeeping was good...there was a mini-bar and small safe built into the wall ...and you did feel comfy and cosy ......just a bit too cosy really! Managable for a couple of nights...but too much of a squeeze for longer!", "Date": "July 25, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "4.0", "Value": "4", "Service": "5"}, "AuthorLocation": "Rancho Santa Fe, California", "Title": "“Great location, exceptionally clean.”", "Author": "mjkMD", "ReviewID": "UR115760299", "Content": "We stayed at this hotel for 8 nights. We loved the location. Many good restaurants and shopping within walking distance. Close to several Metro stations. The hotel was immaculate! The staff could not have been more attentive. I had early morning meetings before breakfast was served. Every morning the staff went out of their way to make me coffee and provide me with some food before I left. Our only criticism is that the rooms are quite small and tight. We made it work though by keeping our things in order and organized.", "Date": "July 25, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "3", "Overall": "4.0", "Value": "4", "Service": "4"}, "AuthorLocation": "Melbourne, Australia", "Title": "“Good midrange choice for couples in Paris”", "Author": "Tooraktraveller", "ReviewID": "UR115441447", "Content": "Nice and new, wel located for right bank and staff very helpful to us. Room size ok at this price point . Stayed at Best Western Au manor st Germain in June and it was old and decrepit as a comparison with poor staff", "Date": "July 17, 2011"}, {"Ratings": {"Service": "2", "Cleanliness": "4", "Overall": "3.0", "Value": "2", "Location": "4", "Rooms": "4"}, "AuthorLocation": "", "Title": "“Nice hotel but poor breakfast and not good service”", "Author": "Chrisml38", "ReviewID": "UR115204571", "Content": "Hotel is hard to find, but rooms are good. But, service and especially hotel's management (front desk) is not at all customer friendly nor customer oriented. The staff is more friendly. Don't ask for a taxi or service.... And carefully check the bill!", "Date": "July 10, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "4.0", "Value": "4", "Service": "5"}, "AuthorLocation": "evian", "Title": "“I loved it”", "Author": "yafeEvian", "ReviewID": "UR115157256", "Content": "The staff was very pleasant, very helpful, they found a solution for everything I needed. The position of the hotel is absolutely perfect, between Place de l'Opera and Place de Madeleine, so you can arrive by foot everywhere you want", "Date": "July 8, 2011"}, {"Ratings": {"Cleanliness": "1", "Sleep Quality": "1", "Overall": "1.0", "Value": "1", "Service": "1"}, "AuthorLocation": "London, United Kingdom", "Title": "“WORST HOTEL IN PARIS- TINIEST ROOM & THE RUDEST STAFF IN THE WORLD!!!”", "Author": "dancoen86", "ReviewID": "UR114850944", "Content": "First of all this is NOT A FOUR STAR HOTEL: There are absolutely ZERO FACILITIES, The concierge goes home at 7pm (when you'd normally ask him to advise on where to go to dinner or perhaps book you some tickets to the opera), The breakfast is APPALLING and my girlfriend got food poisoning from a rotten egg there. The rooms are TINY and the decor is unspeakably awful. This is all topped off by the fact that the hotel manager is utterly incompetent and is THE RUDEST WOMAN IN EXISTENCE!! The prices for what you get are EXTORTIONATE! We paid over £200 a night for a room that was RIDICULOUSLY SMALL (think Harry Potter's linen closet). There was literally a bed, no storage, no floorspace all surrounded by low hanging beams for you to bump your head on. The room was made to look even smaller by a horrible beige Egyptian theme wallpaper complete with sphnixes, pyramides, sinister owls and camels- so instead of feeling like I was in Paris I felt like I was entombed in ancient Cairo! The cramped hideously decorated room would be forgivable if it wasn't for the fact that the hotel has the RUDEST hotel manager I have ever met in the 38 countries I have visited. Everything you asked of her was met with a rolling of the eyes and cold contempt, she looked as though she really delighted in being rude and made you feel like you should be serving her! When I asked to change the room, I was told that although there was another one available it was going to be an extra £300 PER NIGHT to change. I explained it was my birthday weekend and asked whether the manager would meet me half way on the price she just snapped at me and said \"It's not my problem its fashion week!\" When I checked out I saw my bill came to around £800, I was shocked as I remembered paying in advance online. The rude manager said \"no we just take a deposit and charge you at checkout\", so I paid. But then I checked my bank statement and saw that I had paid in advance and she had just CHARGED ME (the best part of 1k) FOR ANOTHER STAY!! I was furious but instead of apologizing she said \"we all make mistakes, for example you didn't even bother to make your bed in the morning!\" I lost my temper and eventually she managed an insincere sorry delivered from behind a pursed contemptious sneer. The only saving grace of this hotel is its location and the lovely tatiana who is a helpful concierge. But this IS NOT A FOUR STAR HOTEL and what you get for the price is laughable. Save yourself a lot of grief and money and stay at another hotel. This place is so dire it makes fawlty towers look like Shangri-La! If you want to be cramped, get food poisoning and have cruella de-ville as your hotel manager this is your hotel!", "Date": "June 28, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Sydney, Australia", "Title": "“Tres bien”", "Author": "JOP1_10", "ReviewID": "UR114709014", "Content": "I was in Paris for business for the second time in three months. Last time I stayed at one of our \"Corporate approved\" hotels the InterContinental Le Grand. this time it was fully booked. As were many other hotels and frankly those that were available on the Corporate list were in excess of 600 Euro per night for a little piece of America..... I stumbled across Hotel Athenee through Trip Advisor and it was not Corporate approved BUT I am not looking for little pieces of Merica - unless I am in America. The entire experience at this hotel was fantastic. Pre- arrival communication was good. I arrived very early in the morning and was treated by the very lovely Tattiana and the Hotel Manager. A room was made available to me immediately and the room was beautifully styles, clean and very Parisian. Breakfasts served in the Red Bar are fantastic. continental, no buffet here but set you up perfectly for the morning and they are healthy. The Hotel Manager was unobtrusively but omnipresent throughout my 4 day stay. Although I didn't ask his name, he made me feel that I could have asked for the moon at any point during my stay and it would have not been too much trouble, he would have arranged it. The rooms are a good size for Paris but not huge. The styling and boutique service in this hotel is excellent. And unlike many of the much more expensive international chains - there was free wi fi. Outstanding. Internationals take note. I recommend and most importantly, I would stay here on my own dollar.", "Date": "June 24, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "kaliningrad", "Title": "“EXCELLENT”", "Author": "asynyaga", "ReviewID": "UR109970039", "Content": "A tiny hotel in the very heart of Paris, with cozy rooms and plenty of style. The staff is very helpful - you'll feel at home!", "Date": "May 26, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Orlando, Florida", "Title": "“Lovely hotel and centrally located.”", "Author": "forge98", "ReviewID": "UR109561504", "Content": "We enjoyed our stay very much. Great decor, great shower, great location, and very attentive service provided.", "Date": "May 23, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "London, United Kingdom", "Title": "“Highly recommended”", "Author": "saphoy", "ReviewID": "UR109366621", "Content": "My mother and I stayed at the Hotel Athenee for three nights in May on a city break. We enjoyed our stay very much indeed. The hotel staff were friendly and helpful, for example, making dinner reservations and recommending the best local shops. They were cordial at all times and, as such, I was surprised to read the previous review. We stayed in two single rooms which were certainly compact but were absolutely fine for one person with limited luggage. I have stayed in smaller double rooms in other hotels in Paris. The rooms were very stylishly decorated and the beds were extremely comfortable. The bathrooms were also very well kitted out and the shower was powerful. Robes and slippers were provided. The common areas have also been refurbished beautifully in an opulent style. Free wifi was provided. The location was great, we were able to walk to all the major sights. There were a number of good restaurants nearby, along with a number of good shops. We did not take breakfast at the hotel as it seemed a little expensive for what you got. We went to the cafe at the end of the road on two mornings and on the last day we went to Laduree on Rue Royale as a treat. We thought that the rate we paid (having booked directly with the hotel some time in advance) was reasonable in light of the quality of service and the rooms. If I had to make any criticisms, they would be, first, that the air con did not work properly on our first night so both rooms were very hot. This was remedied on the second night. Secondly, toiletries were not automatically replaced by the maid when they ran out which was rather frustrating and a little below par for a 4* establishment. These were however very minor issues in what was a very enjoyable stay in a gem of a hotel in the heart of Paris. We certainly intend to stay again when we return to the city.", "Date": "May 22, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Saratoga Springs, New York", "Title": "“What A Wonderful Hotel!”", "Author": "Bordeauxonmymind", "ReviewID": "UR109126382", "Content": "This is a great place the husband and wife team that revamped this former I believe 2 star hotel have accomplished something wonderful in the Hotel Athenee. We travel to Paris often for business and this hotel met all of our expectations. The staff and others are personable in their assistance. The entrance and main area of the hotel reflect what you will find in your rooms. We found that the comforts of the room we stayed in was what you would expect from a quality hotel. The location is perfect for walking, shopping or a launching point for any activity. If you are looking for quality in a hotel in central Paris this is a perfect place.", "Date": "May 20, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Drossia, Greece", "Title": "“ideal for opera goers”", "Author": "Siegfried007", "ReviewID": "UR106831915", "Content": "I stayed for two nights with my wife in this stylish hotel which is perfectly located near the opera house (Garnier). The room had a romantic atmosphere. The bed was fantastic and the pillows as well. However the room was rather small, but expected in the heart of Paris. The staff was very friendly. Breakfast was perfect too. We enjoyed the old photos of the opera singers on the walls of the bar. Best of all was the smoking room, a perfect place to smoke a cuban cigar and to drink a bottle of french red wine", "Date": "May 4, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Sleep Quality": "5", "Rooms": "2", "Location": "5"}, "AuthorLocation": "Zürich", "Title": "“Nice boutique hotel - perfect location”", "Author": "MarcelloZH", "ReviewID": "UR100180190", "Content": "I stayed for 3 nights with my girlfriend in this small boutique hotel, which is perfectly located to do nearly everything by foot. The hotel has 20 rooms and we got room 504, which was one of the 4 rooms on the top floor. The room was decorated in red and had a very romantic atmosphere. Beds were fantastic and pillows as well. The size of the room was rather small and a mirror was missing; one above the washing basin was the only one. All in all I was very pleased with the room and the decor; however, I would never rate this hotel as a four star. The hotel is great for discovering Paris and having relaxing nights with a romantic flavour. However, if you wish to have some hotel facilities, such as Lobby, reading rooms etc, then you will miss those things. WiFi was sending the signal, however I could not manage to get a connection. I would come back to the hotel for a reasonable rate.", "Date": "March 14, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "New Orleans, Louisiana", "Title": "“trendy boutique hotel in central location”", "Author": "alaynep", "ReviewID": "UR95600544", "Content": "american couple - great trip to paris - would definitely recommend this hotel. staff super friendly. everything was new & perfectly clean. lobby on website looks bigger than it actually is & I never saw people having drinks down there like I expected. tiny rooms expected in europe. free wifi was included - always a plus! bed comforter was very fluffy - we had no trouble sleeping whatsoever - double bed was 2 singles pushed together though", "Date": "February 5, 2011"}, {"Ratings": {"Service": "2", "Cleanliness": "4", "Overall": "1.0", "Value": "1", "Sleep Quality": "3", "Rooms": "2", "Location": "3"}, "AuthorLocation": "Copenhagen", "Title": "“Overpriced and foolish”", "Author": "roedgroedmedfloede", "ReviewID": "UR91887213", "Content": "If you want to pay way too much for a tiny room and absolutely no value, this is your hotel!", "Date": "January 5, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "new york city", "Title": "“Lovely Little Place”", "Author": "willtjordan", "ReviewID": "UR84945156", "Content": "I loved this place. Great style, great staff, etc. The design throughout was very warm and inviting. I enjoyed the opera/music references and the artwork. The room was too small for 2 people (we chose the smallest room type advertised for 2 people). But if I'd been traveling alone, this room would have been PERFECT. The bed was so comfortable I slept until 2pm everyday. And the shower (with rainfall showerhead) was very nice. There were no \"Do Not Disturb\" signs, so if you plan to sleep late, you should ask the receptionists downstairs to keep housekeeping away until you notify them. But the hotel just opened, so maybe they will have \"Do Not Disturb\" signs in the near future. There's a smoking room hidden downstairs, down a spiral staircase. I didn't discover it until my last night, but it's a perfect place for a bottle of wine and a cigar. If I had to nit-pick, it would've been nice to have 2 bath robes and 2 pairs of slippers, since we reserved for 2 people, but we only got 1. And the bathroom amenities were typical, but one would hope for something a little special in such a nice hotel & bathroom. But again, I had to really search for something to complain about. It's a lovely hotel. The staff was incredibly kind and helpful - accommodating me by speaking English and handled every special request with a smile. I really appreciated them and can't wait to stay there again on my next trip to Paris.", "Date": "October 26, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "glasgow", "Title": "“Charming, romantic and deserving of high ranking”", "Author": "jazza123", "ReviewID": "UR84376250", "Content": "Our first trip to Paris and to enjoy le Prix de l’Arc de Triomph. Very glad we choose this newly renovated boutique hotel for a 3 night break. Room wasy cosy with a fabulous bathroom and a bed that was a delight to sleep in, so much so we failed to vacate the room on time at check-out! View of a small courtyard was dull but the gorgeous fabrics and decoration throughout had pricked my interest before I’d even set foot in our room or looked out the window. With plasma TV, safe, mini-bar, free wi-fi, turn down and friendly staff we would not hesitate to return. Located around the corner from the Opera and thus great transport links, we loved the area with plenty of restaurants, cafes and shops futher down Rue Caumartin to choose. A little gem with elegance and style - book it!", "Date": "October 21, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "3", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "London, United Kingdom", "Title": "“brilliant”", "Author": "boydmulvey", "ReviewID": "UR82124920", "Content": "small hotel with almost no facilities but excellent / very stylish room, superb and comfortable bed and very elegant lounge area. staff are brilliant and so is the little very authentic (family run I think) restaurant next door - very busy and not another tourist or plastic menu in sight!", "Date": "October 4, 2010"}], "HotelInfo": {"Name": "Hotel Athenee", "HotelURL": "/ShowUserReviews-g187147-d240919-Reviews-Hotel_Athenee-Paris_Ile_de_France.html", "Price": "$267 - $460*", "Address": "<address> <span rel=\"v:address\"> <span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">19 Rue Caumartin</span> | <span class=\"extended-address\">09 Arr.</span>, <span class=\"locality\"><span property=\"v:postal-code\">75009</span> <span property=\"v:locality\">Paris</span></span>, <span class=\"country-name\" property=\"v:country-name\">France</span> </span> </span> </address>", "HotelID": "2515227", "ImgURL": "http://media-cdn.tripadvisor.com/media/photo-s/01/c5/95/63/accueil-hotel-athenee.jpg"}}