{"Reviews": [{"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Rochester, NY", "Title": "“A LITTLE TREASURE”", "Author": "tpmedia", "ReviewID": "UR127271608", "Content": "We simply love this precious boutique hotel in Paris on The Left Bank. Close to everything and as cozy as a comforter. Clean. Comfortable. Great location. The elevator is a friend-maker and the staff smiles at every turn. We'll be there again soon. The world's most beautiful city and a little treasure of a boutique hotel -- where the word was invented and honed.", "Date": "April 4, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Cambridge, United Kingdom", "Title": "“A great place to stay”", "Author": "Operafan2", "ReviewID": "UR126905786", "Content": "We stayed in a twin room for 3 nights in March 2012. We were delighted with the hotel. The room was very clean, the beds comfortable and it was very quiet. It was in a great location - down the road from two of the best cafes in Paris and a short walk to the Siene and Notre Dame etc. The staff are friendly. We would not hesitate to stay here again and highly recommend it.", "Date": "March 29, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Rutland, Vermont USA", "Title": "“Coudln't be better!”", "Author": "Vtjournalist", "ReviewID": "UR126455835", "Content": "An absolutely fantastic hotel experience. Great rooms and service and ideal location. Would stay theer this May but they're booked solid for the days I'll be in Paris.", "Date": "March 21, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Fairhope, Alabama", "Title": "“I would definitely stay here again...”", "Author": "Dan T", "ReviewID": "UR125464320", "Content": "My wife and I stayed at Balcons in February of 2012 and were very pleased with it. It's hidden down a side street which cancelled out any street noise but within a short walk are dozens of restaurants and shops. For you Starbucks addicts there is one located within a 5 minute walk of the hotel and the Odeon metro station connecting you with all of Paris is just across the street from the Starbucks. And if you don't want to catch a cab or ride the metro the Seine River and the Louvre are not that bad of a walk. We walked to the Louvre the first day we got there but once we familiarized ourselves with the metro we utilized it for all our transportation. I didn't reserve the cheapest room but also did not get the most expensive.We had two single beds pushed together. The rate was around E130/night. The elevator is not much larger than a phone booth but that really wasn't a big deal. There is no shower curtain in the bathroom but that was not a huge deal either. The water pressure was very good. I packed a beach towel with me and would recommend you do the same as you end up using at least one of the hotel towels to dry the floor. The staff was very courteous. We did not eat breakfast at the hotel so I can't testify to that.Wifi was free but if you left your device idle for any length of time you get knocked off and have to sign in again.", "Date": "March 1, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Atibaia, SP", "Title": "“Cozzy petit hotel”", "Author": "Kanamih", "ReviewID": "UR124987052", "Content": "I stayed 4 nights in this cozzy hotel. The location is perfect, in a quiet street, full of bookshops and hotels, close to metro Odeon and many restaurants and shops. I had stayed in other hotels several times, but this is much better. I will stay here again in my next visit to Paris.", "Date": "February 21, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Perth", "Title": "“Good 3 star hotel in a good location”", "Author": "davidgold", "ReviewID": "UR124557766", "Content": "Stayed here for one night as a stopover before a flight from Orly. Much better option than an airport hotel. Less than ten minutes walk to Luxembourg RER station and from there I was at Orly airport in less than half an hour. Easy - 10 Euros. The hotel. Location : Great. Easy walk into the Latin Quarter, Notre Dame, Musee D'Orsay and Le Louvre. Quiet street near the Odeon. Close to Metro and RER. Room: Clean, comfortable, compact but not too small, nothing elaborate but nicely fitted out. Was on the top floor (room 606) so had a bit of sky out the window. Single bed was like a small double. Comfortable, nice linen, two pillows, extra blanket. Bedside lamps. Free wi-fi which worked well and a small desk to sit at with my laptop. Big wardrobe for a smallish room with shelves and hanging space. Spotless bathroom with hot, strong shower. Key lock entry to the room, no Ving card. No safe in the room. Satellite TV with about 24 channels. Mostly in French. Reception : Didn't have that much to do with staff apart from check-in and out but the service was smiling and helpful. Free selection of teas and biscuits in reception when I came back from dinner in the evening. Nice. Breakfast : Started from 0700 and I was out of there by 0630 so didn't have it. Buffet for 20 Euros. Dining room looked ok and clean. Other : There's an elevator big enough for one person and a case, so no need to cart luggage up stairs. Thought is was a good 3 star hotel. Clean, nothing shabby or worn out, nice service, great location and good value for the area. Would certainly stay here again.", "Date": "February 14, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "ohio", "Title": "“Hotel de Charme”", "Author": "JTFOhio", "ReviewID": "UR123217439", "Content": "Been a while, but always enjoyed this hotel, recommended by a friend on my first trip to Paris. First person I met was Alexander, and I sincerely hope he is still at the desk. I have seen Alexander interact with the tired tourists arriving. The hotel was more basic in years past, but a great location, staff, and they remember you when you call back. I have recommended this hotel to friends and five of them stayed with them, no one failed to be impressed by the charm of the hotel and the wonderful staff. Several times I stayed there and also had friends in other rooms. My usual room was not available, but I returned the next day and was given a different key, they had moved everything to the room next to my friends and everything was in place. You are close to everything, if you do not get lost on Paris' winding streets, in the 6th district near Metro Odeon and also an RER station Luxemberg as I recall, straight to Rossy (CDG), two metro lines cross at Odeon, and you feel you are truly in a charming French neighborhood, from Crepes on the street to street markets and of course pastry shops that also serve wonderful Cafe Creme. Bravo to this place, one of my favorite in the world.", "Date": "January 17, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "France", "Title": "“Great place to stay”", "Author": "glag", "ReviewID": "UR121388150", "Content": "Quite a small room but a perfect location and very nice staff. Already booked some other dates in january.", "Date": "December 4, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Boston, MA", "Title": "“Great location, very good value”", "Author": "MDHBoston", "ReviewID": "UR119895130", "Content": "My wife and I stayed there the first week in October 2011. We hadn't been in Paris in over 25 years and therefore were not sure what area of the city we wanted to be in. We could not have been happier. Clean, comfortable and quiet rooms. Bathroom was really small, but this was expected (I am pretty tall (6'3\") and the shower adapter did not reach high enough to have me wet my hair without ducking down). Breakfast is 12 Euros pp. I thought it was good, but found it much better to skip this and have something at one of the nearby cafes. Ambiance of those cafes cannot be beat. Location, location, location. Perfect walking area. Also close to metro ( 5 minute walk) and RER line at Luxembourg Gardens (10 minute walk). I actually cancelled our van back to airport once I realized how easy and cheap it was to take the train from Luxembourg Gardens train station. Front desk was very helpful in making reservations for us. However, i would not say they were wildly knowledgable regarding suggestions. Better to use them to help coordinate your plans than to have them suggest places to eat, tours, sightseeing, etc. That is not to say they were not pleasant and willing to help. Would definitely stay there again given the location. Only issue I see is the really small bathroom.", "Date": "October 30, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Vancouver, Canada", "Title": "“Great hotel in an unbeatable location”", "Author": "Anne C", "ReviewID": "UR119495030", "Content": "This is a very cute and nice place. Our room was very clean and quiet. We stayed 12 nights and loved every one of them. The staff was helpful and spoke adequate English. Didn't have the breakfast as we always went to a local wonderful bakery (Gerald Mulot). We will stay here again. It is right near the RER line to Char. deGaulle airport, which costs 10 euros.", "Date": "October 19, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Canberra", "Title": "“Excellent for exploring artistic Paris”", "Author": "Anya_Ukr", "ReviewID": "UR119096291", "Content": "Small, cosy, quiet, clean hotel in a very convenient location - few steps away from Luxembourg Gardens and Blvd St Germain; 10 min walk to Notre Dam, Rive Gauche, Centre Pompidou, Museum d'Orsay and Louvre. Few really nice bistros, patisseries and restaurants are literally next doors. I've stayed for 2 nights in a single room on a 3rd floor - room was very small, with a single bed, but clean and convenient, perfect for a short stay. Staff in the hotel was helpful. On the downside - wifi was not free.", "Date": "October 9, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Iowa City, IA, USA", "Title": "“The real thing”", "Author": "traveling_grandmothe", "ReviewID": "UR119017621", "Content": "This was our second stay at Grand Hotel des Balcons in two years. We wanted a truly Parisian experience, and M. and Mme. Andre and their staff provided just that. Our room was very spacious, spotlessly clean, and beautifully decorated. We appreciated the double closets, double sinks, wonderful duvet covers, the safe for our valuables, and the hairdryer. The breakfast is bountiful and delicious. But it's the people who keep us coming back. M. and Mme. Andre, Marie, and all the staff want you to have authentic experiences of Paris, not the travelogue versions. To that end, they consulted the weather and train schedules to help us go to Giverny on the loveliest day and earliest train, they made reservations for us at their favorite nearby restaurants, they encouraged us to speak French and corrected our accents, and they pointed out little-known gardens open only during the journées européennes du patrimoine. We will return as often as our budget allows and wouldn't think of staying elsewhere. This family run hotel seems willing to treat all their guests like family.", "Date": "October 6, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "3.0", "Value": "5", "Sleep Quality": "3", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Newcastle, Australia", "Title": "“Value for money”", "Author": "PhredNerk", "ReviewID": "UR118998161", "Content": "Small, clean b&b style hotel in fabulous location. Real value for money. Comfortable but a bit cramped. Helpful & pleasant staff. Needs ceiling fan for hot nights.", "Date": "October 6, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Watertown, MA", "Title": "“Pleasant Stay”", "Author": "KindwomanFA19", "ReviewID": "UR118946898", "Content": "Grand Hotel des Balcons was in a great location with pleasant and helpful staff. It was the second time that I had stayed there. The price per night was reasonable. It was clean. There was no shower curtain in the shower, which we thought was odd. The room was small, but quaint. The breakfasts were incredible. I would recommend the hotel.", "Date": "October 4, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Location": "5", "Rooms": "3"}, "AuthorLocation": "Sunnyvale, CA", "Title": "“Good location near Luxembourg garden”", "Author": "paupaubean", "ReviewID": "UR118745977", "Content": "Small room but manageable for 2 people. Lots of bistros and grocers in the neighborhood for economical lifestyle. Close to metro lines. Very safe neighborhood. Walked home from Mcdonald's several nights after midnight. Just installed free wireless Internet for lodgers.", "Date": "September 29, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "4.0", "Value": "5", "Service": "4"}, "AuthorLocation": "GB", "Title": "“Clean and comfortable hotel”", "Author": "cats2120", "ReviewID": "UR117746715", "Content": "We stayed at the Grand Hotel des Balcons for 2 nights in August. It is based in a good location (the Odeon metro stop is a 5 minute walk from the hotel). The rooms are very clean and comfortable. Breakfast is quite substantial (an additional cost of €12) - tea, coffee, a selection of juices and cereals, ham, scrambled egg, etc. The staff are very polite and helpful. Overall a good, reasonably priced hotel, in a convenient location. Would certainly recommend.", "Date": "September 6, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "4"}, "AuthorLocation": "Melbourne, Australia", "Title": "“Lovely hotel, perfect location”", "Author": "Emma P", "ReviewID": "UR117690376", "Content": "I booked this trip after finding it on trip advisor and it more than exceeded my expectations. The room was small, but perfect for what I needed and it was very clean and quiet. The price was very reasonable for Paris and the location was perfect for me as I needed to catch the RER at Luxembourg to attend my conference. Would definitely stay there again & recommend it to all my friends.", "Date": "September 5, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "4", "Overall": "5.0", "Value": "5", "Service": "4"}, "AuthorLocation": "Ottawa, Canada", "Title": "“Perfect location, excellent value”", "Author": "Lulu155004", "ReviewID": "UR116443295", "Content": "I love this hotel. I've stayed here three times and the location is P-E-R-F-E-C-T - ie. it's in the 6th arrondissement and near the Jardin du Luxembourg. You can take the train from CDG to the RER Luxembourg station, then walk to the hotel. The breakfast room is on the main floor (not in the cellar as it is in so many small Paris hotels) and is full of light, with beautiful stained glass windows. Rooms are small, but comfortable and very quiet when the windows are closed. Earplugs are handy if you like to sleep with the windows open as there can be late-night revelers in the streets. There is no air conditioning (a fan is provided) so that could be a problem in really hot weather. Luckily we hit cool weather on this trip so we were very comfortable. For a splurge we also stayed in another hotel, in the 5th, for a couple of nights. It was 70 euros more per night and we both agreed that the Grand Hotel des Balcons was, without question, the better choice in terms of value and location.", "Date": "August 8, 2011"}, {"Ratings": {"Cleanliness": "2", "Sleep Quality": "2", "Overall": "1.0", "Value": "2", "Service": "1"}, "AuthorLocation": "Edmonton, Canada", "Title": "“Will never stay here again.”", "Author": "shoegirl1981", "ReviewID": "UR116424177", "Content": "We base a lot of our stays on customer service. This hotel has none. It has the most unfriendly, unhelpful and unpleasant staff. I have never met so many miserable people in one place. We will never stay at this hotel again.", "Date": "August 8, 2011"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Moscow, Russia", "Title": "“Great location!”", "Author": "Tatiana_Pianova", "ReviewID": "UR115901685", "Content": "Grate location, one step to bd. St-Michel, our favorit place in Paris. The room is small but very charming! Calm street, metro in 5 min, morning ore evening trip in Jardin du Luxemburg. Staff is very helpful.", "Date": "July 28, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "4.0", "Value": "4", "Service": "4"}, "AuthorLocation": "Bruxelles", "Title": "“Best location, close to St Germain, Odeon and Luxembourg gardens”", "Author": "inda019", "ReviewID": "UR115884380", "Content": "I stayed in this hotel a couple of times and it's the first I check for availability when I go to Paris. It's conveniently located close to St Germain (restaurants, bars, etc), to Odeon (where you can have a cocktail at La Rhumerie - in May it was in renovations, so probably no it's even nicer ) or to Jardins de Luxembourg, and from there...the Paris is yours! Sure, the rooms are small (like in all hotels in Paris) and you may hear your neighbors (if they still suffer form jetlags and they are up all night), but it's clean and good value for the money. Also close to several means of transportation (Metro, RER, etc). Go for it!", "Date": "July 28, 2011"}, {"Ratings": {"Cleanliness": "3", "Sleep Quality": "3", "Overall": "3.0", "Value": "4", "Service": "3"}, "AuthorLocation": "Toronto, Canada", "Title": "“Great location. Good value.”", "Author": "ATBN", "ReviewID": "UR115848520", "Content": "The location is, in my book of Paris, excellent if not perfect. This has been noted by other reviewers here as well. Also noted is the reasonableness of the price. As for service, maintenance and cleanliness, we had no major points of dissatisfaction, but then again some genuine warmth coming from the staff always goes a long way, and there was none of that here. The shower and bathroom was way too small, however, even for Paris. Forgettable breakfast, but then that is the norm in Paris. All in all, wont stay again, because I think there are better options in the same area with more, umm, lets say 'charm'. I would not recommend against it either though.", "Date": "July 27, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Chappell Hill, Texas", "Title": "“An excellent value near most left bank attractions.”", "Author": "rexaboyd", "ReviewID": "UR115697921", "Content": "We were two couples staying in Paris at the end of a boating holiday in the Dordogne area. We've stayed in Paris many times and the Hotel Balcons is the best combination of location, quality and service. They have a good wifi that's fast enough for Vonage calls at a reasonable cost. The rooms are clean, well fitted out and of reasonable size. We turned in our rental car after checking in so don't know the parking situation. It's never good in Paris.", "Date": "July 23, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Naples, Florida", "Title": "“Perfect if you are on a budget or not!”", "Author": "stl2naples", "ReviewID": "UR112463235", "Content": "There were 5 of us total. My parents stayed in one room and my two sisters and I stayed in a large room. The front desk was very nice and even called the front desk person who had just left to ask a question on my behalf. The only downside is you can hear (from the streetside) people who are having fun walking by and laughing or shouting. I have trouble adjusted to new places-so sound sleepers this probably would not even bother. I would totally stay in this hotel again-even if I could afford the Ritz!", "Date": "June 9, 2011"}, {"Ratings": {"Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Toronto, Canada", "Title": "“A most agreeable location”", "Author": "piratepirate", "ReviewID": "UR112073364", "Content": "We have returned from 5 nights in Paris, staying at Grand Hotel des Balcons. I booked many months ago after reading reviews, and then got a bit sidetracked when negative reviews came up. So, here's my short and, I hope, to the point. Location gets top marks. Within 10 minutes max, one can be in Jardins de Luxembourg, on Boul' Mich, St. Germaine, at the Pantheon, or looking at the Seine. Using the RER as we did took less than 1 hour to get to and from CDG, but we had only carry on bags. Hotel staff were consistently friendly and polite. Yes, the rooms are small, and the bathrooms quite compact, but they are clean, one learns to shower and not soak the room, and the bed was comfortable. I personally have issues with sweat soaked pillows, and these were fresh and comfortable. We took the 12 Euro breakfast twice, and it was a good deal for us. Juice, coffee, tea, \"scrambled egg/omelette\"combo as well as toast, fruit and yogourt could not have been bought for the price. Other mornings, my DH went to Starbucks around the corner and paid 3 Euro 50 for a large coffee. The room, #104, worked for us; we are average, or below in weight and are comfortable in small spaces since we travel a lot. Others may find the space to be less than desirable. Next time in Paris, I would not hesitate to stay at GHdB. By the way, read internet options carefully as it seemed that we could have had a week for less than 20 Euro.", "Date": "June 7, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "4"}, "AuthorLocation": "Skipton, United Kingdom", "Title": "“Brilliant hotel, spotlessly clean, comfortable and great location”", "Author": "Neilhes", "ReviewID": "UR111406377", "Content": "This is a fantastic hotel on a quiet side street in St Germain, really near Odeon metro stop on Line 4 and very near to Notre Dame/the Seine. The location is brilliant, right next to the Luxembourg Gardens and in a lovely area with restaurants, book shops and bars. The room was small but well fitted out to make the most of the space. It was spotlessly clean and had a lovely modern en suite, again small but beautifully clean with a great power shower. Bed and pillows extremely comfortable...nice flat screen tv. I would stay here again without question and would recommend to friends. This was one of the most reasonable hotels I could find in Paris and it was great value for money given the location. It was budget but not basic and a perfect place to base ourselves. The only improvement: perhaps some tea and coffee making facilities when you're desperate first thing in the morning...! Loads of Cafe's and Patisseries nearby though", "Date": "June 4, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "3", "Location": "4"}, "AuthorLocation": "London, United Kingdom", "Title": "“Good Location, Value for Money”", "Author": "Elicia_31", "ReviewID": "UR108431128", "Content": "The hotel is tucked away on a little side street in the Latin Quarter. It is a quiet area and we could not hear any other people around. The room itself is clean and tidy with 2 single beds and a small euro balcony. The size is sufficient as we were only here for one night so it was perfect to just sleep in. Pillows and bed are sufficient also.The shower is made for very short people and there was no shower curtain so the entire bathroom gets wet! The keys to the rooms are also very bizarre and it takes some time to actually work hoe the door actually locks. There is no free wifi, you have to purchase this through Orange after paying for it, it never worked. V disappointing I know this is not the hotels fault but it doesnt reflect poorly on the hotel itself. The hotel is located in a great area and there are so many restaurants around within a short walking distance. Great for a short stay where you dont actually spend any time in the room - but why woudl you because you are in Paris!", "Date": "May 16, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "3.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Basel", "Title": "“Pretty Good So Long As You Do Not Expect Too Much I'd Stay Here Again”", "Author": "Paul_In_Basel", "ReviewID": "UR103058734", "Content": "We were looking for an inexpensive hotel in the Left Bank. We paid 110 euros for a double room which is pretty good for Paris I think. We found it pretty much the same as other reviewers. The location is great a hop skip and jump and you are in busy St Germain. The rooms definately are not big, looking at the floor/fire escape plan our room wasn't big and the others must have been smaller. The room was spotless and very clean. The staff we met were helpful. The hotel was full but we didn't hear any noise form the adjacent rooms. Pity they do not have free WiFi that was a minus. Didn't bother with breakfast at 12 euro coffee toast and a croissant is 6 euro in a cafe. I would stay again but avoid the rooms on the top floor at the end of the corridor they have a dumb waiter and use it for breakfast and you will be woken by the clunking of the switch gear and the motor.", "Date": "April 6, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "3.0", "Value": "2", "Sleep Quality": "1", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Englewood, NJ", "Title": "“OK for a short stay - lacks character”", "Author": "Londonjack", "ReviewID": "UR101943798", "Content": "The previous reviews are quite accurate. There is nothing really wrong with this hotel, but if you are not fully prepared you could be in for a few surprises. Somehow I missed the fee for WiFi, but then again it's a 2-star. I ended up paying 9.40 Euros for 24-hour Wifi. Location is a Feature. After taking a tour through other sections of Paris, this location is a winner. You are kind of across the street from the Latin Quarter yet in St. Germain/St. Michel. It's also near the famous medical University which means the area is relatively safe. Tons of fun through the shops and cafes in the nearby Latin section., although quite a walk if you have young kids. Great for teens -I'm sure not pleasant in the busy summer months. The lift/elevator fits ONE person with luggage or two VERY skinny people with no luggage. It's really like walking into a public telephone box. I am sure that the street level rooms are awfully noisy. Cleanliness is clearly a priority here, however, this is relative to the fact that this it is a 2-star. Although it was as clean as it could possibly be, the tub was simply too old (well-used) for me to consider relaxing for a bath. The balconies are pretty but basically cosmetic - more like a window sill with railings. Clean room, small with odd shape. This is the true \"drop your luggage and spend the day out\" kind of room. Staff is mixed - some are superior, others surly. I was very surprised noone mentioned that the clocks would be moving forward - perhaps that's a 3-star feature? Despite requesting a late checkout, the maid thumped on our door 3 time well before checkout time. Thin walls are a very big problem. The people next door sounded as if we were all in the same room with us, and they had a baby that cried all through the night. i really didn't sleep a wink at this hotel, but yet, I felt comfortable and no-sign of bed bugs or the likes. Breakfast was nothing to write home about, however, I found myself returning after scouring the neighborhood for something better. I really would have appreciated an in-room coffee maker. It's really hard to describe - I've seen worse and better. Although there were some interesting decor features, I felt a lack of character.", "Date": "March 28, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "San Francisco", "Title": "“Great hotel with minor inconveniences”", "Author": "gregscan", "ReviewID": "UR100193163", "Content": "This is a great hotel. The front desk staff speak English, and the location is very central. It has a great classic elevator right of Casablana. The rooms are small and there is no air conditioning. The breakfast are good, but you can get a better value eating off premises.", "Date": "March 14, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Atlanta", "Title": "“Wonderful hotel in perfect area”", "Author": "paristimes4", "ReviewID": "UR91561184", "Content": "On our 5th trip to Paris, we chose the Hotel des Balcons for its location and for the details on their website. What you see on the website is exactly what you get. It is charming, spotless, large enough by Paris standards, perfectly situated between St. Germain and the Latin Quarter, and with a tiny balcony to boot. The staff are professional and wonderfully helpful. We were there during the worst of the transportation strikes and received warm and thoughtful advice on how to best navigate the city. We have enthusiastically told others about the Hotel des Balcons...a gem of a 2-star hotel. We will return.", "Date": "January 3, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "New York City, New York", "Title": "“Fantastic location,service,Breakfast, & price!!!!”", "Author": "jsulliv1", "ReviewID": "UR87181301", "Content": "Perfect location, very helpful & gracious staff; delicious full English breakfast!!! Grand Hotel des Balcons has itall & the price is right!!", "Date": "November 15, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "3", "Rooms": "4", "Location": "5"}, "AuthorLocation": "North Carolina", "Title": "“Pleasant hotel in great location”", "Author": "GT3T", "ReviewID": "UR87029016", "Content": "I stayed here for 5N in October and enjoyed it, especially for the location. It was a short walk to the busy St. Germain area and Odeon Metro stop, but I more often walked to the Cluny Metro stop because I used an internet cafe across the street from it (called Milk---it's a chain). It was less than 5 min to Luxembourg Garden, then a left turn up rue Soufflot to the Pantheon. It was easy to find places to eat (Restaurant Polidor two blocks away was quite good), though one night I was very tired and I bought a ham and cheese crepe and found a half-bottle of wine at a grocery for dinner in my room. My room was big enough, with a small, but clean and new bathroom. It faced a courtyard, so I didn't have one of the little balconies, but neither did I have street noise. The front-desk staff was warm and friendly, responding in either French or English. Breakfast was 12E, but it included bacon and eggs, cold meat, cheese and yogurt, in addition to croissants. My only negative is that it is somewhat noisy. I'm sensitive to noise and always sleep with earplugs when traveling, but I could still hear my neighbor's TV till 11:30, and later I could hear him snoring. It's an attractive, nice hotel for a modest price and you will feel safe and comfortable here.", "Date": "November 14, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Philadelphia, Pennsylvania", "Title": "“quaint, good location, helpful staff”", "Author": "suitejane", "ReviewID": "UR86944291", "Content": "We found this a perfect place for our first stop in Europe. Close to many forms of transit, restaurants and cafes, a grocery store, and the Luxembourg gardens (lovely in November!). The room is nothing amazing, but clean and comfortable. Bathroom was simple and did the job. We didn't buy breakfast, but found cafes close by or stopped at the grocery for croissants and got a coffee to go at Starbucks and sat in a park. The price was not cheap, but it was central Paris, so we thought it was good value. The lobby is lovely and welcoming.", "Date": "November 13, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Sleep Quality": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Virginia", "Title": "“Pas mal”", "Author": "bobburgess", "ReviewID": "UR82731955", "Content": "Internet deal of 90 Euros a night for a single room, steps away from the Luxembourg Gardens and Place d'Odeon was a find. Yes, the room was small but it faced the inner court and was quiet and very, very clean with good linens and towels. Remember this is a 2 star hotel but the service and staff were top rate and delightful. I don't think it is air conditioned but I am not sure. The WiFi is available for a charge by the hour or day. Excellent bath room for such a small room, modern with deep tub/shower thing.", "Date": "October 9, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Sleep Quality": "2", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Miami, Florida", "Title": "“Avoid rooms adjacent to dumb waiter”", "Author": "globegal", "ReviewID": "UR81669540", "Content": "I have not stayed in a 2 star hotel before so my expectations were low. However, I was pleasantly surprised to find this hotel clean and, albeit small, the rooms had everything in them that one would need (except a shower curtain). The internet worked beautifully so I was able to calll home each night via Skype. My only complaint: my room (107) was located adjacent to the dumb waiter which promptly started running at 6 a.m. each day. So, if you are not in need of rising early every day, make sure to avoid rooms adjacent to the dumb waiter.", "Date": "September 30, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "3.0", "Value": "2", "Sleep Quality": "1", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Montreal QC", "Title": "“Comme si, comme ça...”", "Author": "slquebec", "ReviewID": "UR81649527", "Content": "After reading the stellar reviews of other travellers, I was disappointed by this hotel. For starters they advertise wi-fi and don't state that you have to PAY for it. How tacky in this day and age... The rooms are a decent size for Paris and the location is great. Alas, the street noise at night is distressing (drunk students paraded endlessly down the street between midnight and 4 am). Moreover, the other hotel guests were ill-mannered. Not management's fault, but because the walls are paper thin, we were disturbed by a couple who fought for an hour between 11 pm and midnight, and other guests spoke loudly in the corridors at all hours of the night. Not a very classy place. The reception was lukewarm. Breakfast too expensive.", "Date": "September 30, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Oxford", "Title": "“Look no further”", "Author": "OxfordCorben", "ReviewID": "UR79215612", "Content": "our 4th visit: it's still clean, quiet, and in a good location. Rooms a bit small for the larger guest but it's excellent value", "Date": "September 12, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Iowa City, IA, USA", "Title": "“Our new home away from home in Paris”", "Author": "traveling_grandmothe", "ReviewID": "UR79070347", "Content": "My husband and I chose this hotel because a friend recommended it and because the location and price suited us. Little did we know what our long-awaited ten day vacation in Paris would bring! Within hours of checking in, my husband fell down a flight of concrete stairs in a tabac and was rushed by ambulance to a hospital, where he remained for the duration of our trip. I needed so much more than the spotless, charming room; I needed a home and friends, which is exactly what this hotel provided. The owner and the staff all went out of their way to be of help and comfort. From maps and directions to names of surgeons, the owner provided all that I needed. One night when I came back from a long day at the hospital, the woman at the desk provided a bowl of cereal so that I could just climb into bed without going out again to find dinner. I couldn't have wished for a warmer, more comfortable environment in which to go on this journey into the world of international medicine. You can read all about the amenities of the rooms and hotel from other reviews. This review is to say if you need a port in a storm, this is the place to be. The thoughtfulness and care was extraordinary. My husband and I will return, hopefully, often to Paris in our retirement, and will stay here every time.", "Date": "September 10, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "3.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "New York", "Title": "“Clean, well located and inexpensive”", "Author": "Oliviamack", "ReviewID": "UR66043504", "Content": "I stayed here in June and was very pleased. Don't expect the Ritz Carlton but for a hundred something euros a night in Paris, it's pretty perfect. The shower is tiny, that would be the only complaint. But the beds have clean sheets, and warm comforters. Balcony with window in every room. The closet has hangers. The breakfast that's served from 7 AM -9AM is pretty decent, the coffee is good. I saw anthony bourdain shooting a segment on a restaurant right down the block, so the food is good. Many cafes to go sit at and have food and wine. The Odeon metro station is very close.", "Date": "June 1, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Cornwall", "Title": "“Charming Hotel, Charming Staff”", "Author": "murraymanCornwall", "ReviewID": "UR65271225", "Content": "We returned from the Grand Hotel de Balcons yesterday after a 7 night stay. I cannot recommend it enough, the situation was excellent, close to all the attractions. The hotel was spotless and super comfortable, the staff and the owner were warm, friendly and charming. We could not fault it. We did not partake off the breakfast choosing a pavement cafe instead, but it smelt delicious. We will definately be returning hopefully very soon.", "Date": "May 25, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Albuquerque, New Mexico", "Title": "“Fabulous find”", "Author": "AMdsgn", "ReviewID": "UR63498026", "Content": "Great location on a quiet street, close to Luxembourg Gardens and the Metro. If you're taking the train from CDG airport into the city this hotel is an easy walk from the Luxembourg stop. The beds were very comfortable beds, the room was clean and offered good storage space, the staff were helpful and friendly, the breakfast buffet offered a great variety of hot and cold foods. This is a gem!", "Date": "May 7, 2010"}, {"Ratings": {"Overall": "1.0"}, "AuthorLocation": "Kildare", "Title": "“Absolutely without integrity and morally questionable”", "Author": "BernardClarke", "ReviewID": "UR62186776", "Content": "This will be a strange one: reading the good reviews from fellow visitors to Paris here on Tripadvisor led me to want to stay in this hotel. My girlfriend booked me online as I think most of us do these days. Anyway events in Iceland changed everything. We watched day by day and wondered hour by hour just what was happening in the skies with airports not open till 7am; then not open until 5pm; then 9 pm then 7 am the next morning and so on. I first emailed this hotel and told them I was worried I would not make it to Paris. My second email confirmed that I couldn't make it having missed out on chances of getting a ferry to London and the Eurostar to Paris (I live in County Kildare here in Ireland). But my third email included my new flight dates and times and asked them to put me up for another night-so now I would stay four nights instead of the original three. I got no reply to any of these emails until I was told that -and I quote- \"Despite the circumstances the first night will not be refundable.\" I was angered by this and wrote to tell them that this was unfair given the extraordinary events that happened in grounding all flights in Northern Europe. Their general manager then sent me an email saying it was beyond his power to refund anyone, this was hotel policy and so on. I wasn't looking for a refund-I was seeking to move my booking and add on another night's business for him and this hotel. I worked for 15 years in hotels in Dublin-including three 5 Star Hotels in Dublin (Jurys Hotel, Ballsbridge; The Berkeley Cort Hotel; and The Shelbourne Hotel)-and know that this is simply not true. I told him that I had acted in good faith and that clinging to \"policy\" during these extraordinary times was morally questionable, showed a real poverty of spirit and a true lack of integrity. Bernard Clarke", "Date": "April 22, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "East Coast, US", "Title": "“Superb Location- Excellent Value”", "Author": "EastCoastTravelers30", "ReviewID": "UR58442298", "Content": "Clean, comfortable and perfect location. We would definitely come back here. I'm a bit late posting this review as I've just now joined Trip Advisor a year later, but this site was very helpful in assisting me to find this hotel, so I wanted to add my review. If you want luxury, this isn't the spot, but its still a lovely stay.", "Date": "March 13, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Tulsk Ireland", "Title": "“We will be Back Again”", "Author": "medic63TulskIreland", "ReviewID": "UR56982476", "Content": "This was our 9th year to visit Paris , so we had some idea what to expect from our Hotel Every year we choose a different hotelbased mainly on our observations whilst there but also from Trip advisor reviews. Yes the room was small , they always are , but this hotel excelled in cleanliness , friendleness, and despite the previous review about \"Breakfeast\" we found it to be by far the best we have experienced in 9 years. My wife is a Coeliac and unfortunately had not brought her own bread , but nothing was too much trouble for the staff , who arranged ( I think with the owner) to have Buck wheat Crackers \" available on our second day. We do not need the 4* facilities of bars and restaurants , or lounge areas , but we do look for an hotel where we feel welcome and appreciated and Grand Hotel des Balcons delivers all of this without compromise. So next year we will break with tradition and return here again. John & Gillian Clark Ireland", "Date": "February 24, 2010"}, {"Ratings": {"Service": "2", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "London UK", "Title": "“Clean, comfortable, excellent location”", "Author": "Hoocha", "ReviewID": "UR54935608", "Content": "My husband and I just visited Paris for a long weekend for our 15th wedding anniversary, and found ourselves on a budget due to the dire exchange rate of the pound to the euro. We saved 10% by choosing an advance booking deal on the hotel website, though this is not refundable if you cancel. OK, our room and bathroom were tiny, and if one of us was walking around the other had to sit still so we didn't keep bashing into each other, but the bed was very comfortable and the whole place absolutely spotless. You can hear creaking floorboards, etc, but luckily there are no bars in this street with the noisy late night crowds that causes. I thought for about £100 a night it could not be beaten in this excellent location. Ironically the only disappointment was the reason I chose it in the first place over several others - we went down for the buffet breakfast a full 40 minutes before it ended and there was mayhem. The few free spaces were occupied by dirty trays. The supply of food was running low and we had to stand around helplessly for at least 10 minutes unable to serve ourselves because there were no plates, and we asked twice. The buffet area is very cramped if more than about 2 people are up there. The coffee machine was very slow and it wasn't up to much when it did arrive in the cup. Having breakfast here was a stressful let down, we skipped it the second day.", "Date": "February 1, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Virginia Beach, VA", "Title": "“Charming & Nice Location”", "Author": "BizzyM", "ReviewID": "UR49596287", "Content": "Great location, though that's relative, of course, depending on what you want. But it's quite central in Paris, which was nice. The balconies were definitely charming, though pretty much every window in Paris seems to have a similar, small balcony. The negative things other reviewers talk about (small elevator, no shower curtain) are pretty typical for France, so it's hard to say they're a negative for this hotel in particular. The staff, though not overly nice, was helpful when we needed them to be, and everyone we encountered spoke English without a problem. Our room wasn't as small as expected, after having read other reviews before we went. When we checked in, the man said he'd given us a free upgrade, and I thought he was kidding, but maybe not. It was a nice size (for a European hotel, at least). Overall, I'd say it's absolutely a great value and worth the stay. Definitely no frills, but still nice.", "Date": "November 19, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Location": "4", "Rooms": "3"}, "AuthorLocation": "Austin, TX", "Title": "“Great Little Hotel Near Notre Dame & Saint-Michel”", "Author": "lkinney", "ReviewID": "UR46274369", "Content": "My wife visited Paris for our 10th wedding anniversary. This was our first time to Europe and our budget was modest, so we asked around for recommendations. A friend of ours if from Paris and recently got married there, and he recommended this place. It was wonderful - quaint, small rooms, but quiet, off the main streets, and the staff was very nice and helpful. The rooms were clean, but very small. Since we just used the hotel as our 'base of operations' it was all that we needed. Breakfast in the lobby in the morning and off we went. Short walk to the Odeon and Luxembourg stations; not far from Saint-Michel, Notre Dame, and the Latin Quarter. When we go back we plan on staying here again. One note - the bathtub was almost comically small, but it got the job done just fine.", "Date": "October 8, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Location": "4", "Rooms": "5"}, "AuthorLocation": "Texas", "Title": "“Nice little hotel”", "Author": "PrincessNthePea", "ReviewID": "UR46004538", "Content": "We stayed only one night, but it was a nice little hotel. Down a quiet street. The room was a good size and well layed out. They had very nice linens (real pillows!), ample hangers and a room safe. The bathroom was a nice size and well lit. The room was very clean. We stayed on the 3rd floor - the stairs are a bit odd, but they do have a tiny elevator available. They offer an optional \"petit dejeuner\" in the mornings which was very nice. In addition to croissants, they also provided yogurts, cereal, cheese, eggs, etc., which is unusual for many Paris hotels. Location is good for restaurants and not to far from Metro and RER access. We would definitely stay here again.", "Date": "October 6, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Location": "5", "Rooms": "3"}, "AuthorLocation": "Montreal, Canada", "Title": "“Nice hotel and perfect locations”", "Author": "spartac", "ReviewID": "UR33860299", "Content": "I have been using this hotel as a basis for all my travel to Paris for the last 10 years, including a 3 month business stay 6 years ago. While its prices have gone up from the original bargain back then, I suspect it's still decent value. However I am a bit biased as I have an attachment to the place. PROs: - Perfect location. Relatively quiet street in the Quartier Latin (5th). It is true Paris downtown is relatively small and one can walk everywhere from other locations. But being in the heart of the best ambiance in Paris in worth paying extra - Nice and welcoming staff. The core of the reception staff did not change for the last 10 years. - I suspect prices are still competitive - Nice breakfast CONs: - No AC, which can be painful in the summer. But lack of AC is quite common in France. - Rooms can feel a bit basic sometimes. But very clean and functional - Not the best choice as a business destination. Although they have introduced paid wireless now.", "Date": "July 4, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "3.0", "Value": "4", "Location": "4", "Rooms": "3"}, "AuthorLocation": "Helsinki", "Title": "“We liked it”", "Author": "aalyela", "ReviewID": "UR30573917", "Content": "We went to Paris as a romantic getaway, for a long weekend. We choosed Balcons based on the good reviews here on TripAdvisor. The hotel was quite easy to find (with map) even though we hadn't been in Paris before. The welcome was ok, the woman in reception spoke good english. We were a little bit shocked about the size of our room, it was so tiny. But ok for 4 days. It was winter time, so the room was also a but cold. So everytime we got back from the winter cold city we warmed our selves in a hot bath. The bathtub was our rescue! Big plus was also the tea and coffee and the cookies that was provided free in the lobby. The elevator was very small but didn't bother us. When it was time to leave the receptionist was very kind and called us a taxi to the airport CDG (taxi cost us 35€). In overall, we would recommend this hotel to everyone. Small but very nice and the location was great!", "Date": "May 23, 2009"}, {"Ratings": {"Cleanliness": "5", "Check in / front desk": "3", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Ma.", "Title": "“Perfect Respite”", "Author": "Laine39", "ReviewID": "UR20846312", "Content": "I have just returned from a Paris stopover on the way home from a week spent with friends in the Alsace. I was looking for a hotel in a familiar neighborhood and wanted only a single room for two nights. I was not disappointed in my choice of the Grand Hotel des Balcons. My room (#107) was a quiet room facing the rear of the hotel. I didn't hear any of the street noise as expressed by some other reviewers (and also by some other guests staying at the hotel at the same time as I). The room was small, of course, but spotless. It may have been recently redone as I had one of the newer keys.It was more attractive than the single room as shown on the hotel website. The bathroom did lack the shower curtain, but for two nights I was able to cope by taking a bath and then using the shower head for hair washing. I recommend the Cafe Danton (down the street in the direction of Blvd. St. Germaine)for breakfast if you do not wish the hotel buffet. The waiters were friendly and attentive.", "Date": "October 13, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "3", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "orange", "Title": "“PERFECT”", "Author": "mother-n-son", "ReviewID": "UR19603243", "Content": "The location is excellent, within walking distance to many museums and monuments. The staff was wonderful and friendly. As I discovered the area, I checked prices at other hotels and found the hotel des Balcons was a bargain for this central location in paris. The room was cosy and very clean. I stayed there 4 nights with my 14 years old son for his first trip to Paris and we had the buffet breakfast all you can eat, which was just perfect for my teenager. We had a very nice stay. I would recommend it.", "Date": "September 1, 2008"}, {"Ratings": {"Cleanliness": "2", "Business service (e.g., internet access)": "1", "Check in / front desk": "4", "Overall": "1.0", "Value": "1", "Rooms": "1", "Location": "4"}, "AuthorLocation": "Maryland", "Title": "“Disappointing”", "Author": "btfu", "ReviewID": "UR19437882", "Content": "We booked this hotel because it was recommended by a European Travel guide, Eyewitness Travel I think. We were disappointed by many things. First, being a American traveler I prefer a hotel with A/C. This might not be an issue during the non summer months. I understand that this not a given in Europe, but I expected it at this price range, especially since Breakfast wasn't included. 12 euros per person is high with the restaurants in the area. Also, there are no shower currents so you have to get used to showering from the seated position since the shower head is only just above waist high. Our room was on the front half of the hotel, which is on a surprisingly loud street, especially since you need to keep the window open for air. On the other hand the staff was mostly very helpful, except for one guy who gave us the wrong directions to Gare de Lyon, but luckily we double checked.", "Date": "August 27, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "3", "Check in / front desk": "5", "Overall": "5.0", "Value": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Oxford", "Title": "“Excellent staff”", "Author": "EdwardK", "ReviewID": "UR19409433", "Content": "I thought this hotel was excellent. The only drawback was that our room overlooked the street and we were woken early by dustcarts. But I give it five stars because of the staff. They were first class from start to finish. The manager gave good advice on parking - free in August if hard to find. They have a policy of taking down dates of birth of children and therefore noticed my son's birthday fell during our stay, as a result of which we had a lovely chocolate cake delivered. And best of all, they had the politeness to reply in French to our broken French, which is extremely rare in Paris! The breakfast was excellent value for money.", "Date": "August 27, 2008"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Check in / front desk": "3", "Overall": "3.0", "Value": "3", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Staten Island, New York", "Title": "“Very Nice”", "Author": "Dina808", "ReviewID": "UR16972120", "Content": "My husband and I stayed at this hotel towards the end of April. The lobby was very nice and the staff was pleasant. Although the room we had was quite small and showed signs of aging, the room was kept clean. The room also had a balcony view which was quite nice. We were able to see the Odeon theatre. The price is reasonable considering it is situated in the St. Germain area. We couldn't ask for better since we were in walking distance to many attractions. All in all we had a very nice stay. I would recommend it.", "Date": "June 16, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Pine, Colorado", "Title": "“Great experience, great location”", "Author": "Pineguy", "ReviewID": "UR16121486", "Content": "My teenage daughter and I stayed for two nights after taking the Eurostar from London and we were extremely pleased with everything. The hotel is walking distance to the Odeon Metro station, which connects the Gare du Norde where our Eurostar arrived. Our room was very nice and normal size by European standards. It was clean and we didn't hear noise from any other rooms or from the street. The only surprise for us was the lift, which had room for only two people or one person and suitcase. But it was fun. The breakfasts were superb and we ate our fill of delicious choices. The hotel was walking distance to Notre Dame. It was our first visit to Paris and we enjoyed it thoroughly. I would recommend it to anyone thinking about an economical hotel in a good location! There is a room to hold your bags when you check out but still have time befoe your plane/train leaves. in our case, we checked out at 9 a.m. and stored our bags there while we toured Paris for almost another full day before catching the Eurostar back to London in late afternoon.", "Date": "May 16, 2008"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "New Jersey", "Title": "“Very comfortable stay, great location in St. Germain des Pres”", "Author": "TravellMom", "ReviewID": "UR15558008", "Content": "I just returned from four nights at this hotel. I had booked a twin room for myself and my 16 year old daughter. We were thrilled to be given a triple room with lots of space and with two floor to ceiling french door balconies openning into the room. The lobby and breakfast areas were charming with Art Nouveau moldings and furnishings. The rooms, however, are basic, but are kept spotlessly clean. Our bath had 2 sinks, a tub with shower (no curtain, as seems to be common in Paris) and the toilet was in its own little room. Our only complaint with the room was that curtains were shears and did nothing to block the light. We started using night blindfolds and had no difficulty after that. Hotel staff were all very knowledgeable and all spoke English well. We opted to have breakfast at the hotel (12 Euros per person) to save time and to get the European granola we love. Sliced meats were also provided as was some fruit - mainly raisins and prunes, along with croissants and other breads. An excellent make-it-yourself coffee machine was a treat. It's a 5 -7 min. walk to Odeon metro, Ile de la Cite, Pantheon, and Musee du Moyen Age. The location was excellent and the one block long , one way street was quiet. A very friendly, comfortable hotel and very family friendly.", "Date": "May 1, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Business service (e.g., internet access)": "4", "Check in / front desk": "4", "Overall": "5.0", "Value": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "woodhaven, mi", "Title": "“loved it”", "Author": "robbieb79", "ReviewID": "UR13920416", "Content": "Where to begin. The room was in fact, small. That is not very uncommon though in Europe. The room was very cozy. The staff was friendly. The location is superb. The only problems I see is that there is no A/C and the rooms are far from sound proof. In the summer, I can easily imagine it being very noisy and hot. Even so, I would still stay here. Location, price, comfort. I will come again.", "Date": "February 28, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Business service (e.g., internet access)": "4", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "N.Ireland", "Title": "“Great little hotel in Latin Quarter”", "Author": "retireeN.Ireland", "ReviewID": "UR13595181", "Content": "Stayed here for 4 nights feb 7th -11th. Hotel had been recommended to us by friends. It is a 3 star I think. Rooms are quite small ,as is the bed, but it was very comfortable. Small bathroom but had a bath and was modern and very clean. Excellent service each day with all towels,soaps etc renewed. Small breakfast room with a good buffet breakfast, had all you needed with fruit,juice,cereals, eggs and bacon. Excellent expresso coffee machine. Great location beside Odeon theatre and near RER station at Luxembourg, this line goes to CDG airport. Quiet street with restaurants all around, good bistro across the road. Will definitely book here again.", "Date": "February 16, 2008"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "Woking, UK", "Title": "“Excellent hotel”", "Author": "Voigt", "ReviewID": "UR12872937", "Content": "Stayed here January 2008. I've stayed in many hotels in Paris and this is one of the best in terms of value for money & location. We paid €100 per night for a double room with shower (I think the larger double rooms with bath/shower are €110). The room was very clean, toiletries were provided and the furnishings were good. Unfortunately the only English-language channel was CNN which is probably OK if you're American but very boring to anyone else. But that's not a major fault. Very good breakfast at €12. Staff were friendly and helpful. Location is excellent, about 10 mins from Odeon metro which is on a direct line from Gare du Nord. Good restaurants/cafes close by and easy walk to Notre Dame, the Louvre etc etc. Yes, lift is one of the smallest I've seen but again not a major problem. Definitely recommended.", "Date": "January 22, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Business service (e.g., internet access)": "1", "Check in / front desk": "5", "Overall": "3.0", "Value": "2", "Rooms": "2", "Location": "5"}, "AuthorLocation": "Sydney", "Title": "“Helpful staff”", "Author": "ghanno", "ReviewID": "UR12626527", "Content": "The location of this hotel really can't be beaten - it's just a stone's throw from Bvd. St Germain and there are lots of trendy and reasonably priced eateries nearby. it's closest metro stop is Odeon and closest RER is Luxembourg (which will go directly to Charles De Gaulle airport). The room I stayed in, however, was really very simple. In fact, it was really very small and like many European hotel rooms, the bathroom had no shower curtain. The wall-mounted flat screen TV was out of place in this room. There's also no hotel safe and you have to leave your room key (yes, it's a room key, not a card) at the reception every time you leave the hotel. I found the staff to be extremely helpful and were quite knowledgeable so that was a plus.", "Date": "January 15, 2008"}, {"Ratings": {"Service": "2", "Cleanliness": "5", "Check in / front desk": "3", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "2"}, "AuthorLocation": "Medford Lakes, NJ, USA", "Title": "“Cute, Vintage Hotel”", "Author": "pelican93", "ReviewID": "UR11009918", "Content": "I can't say that this hotel was fantastic, but for the price, I was very impressed. Let's start out with the good stuff: The hotel had a cute, 1920's vintage feel. And the location was nice because it was right by the metro station Odeon. I went with my mother, and the room they gave us was great. Our beds were in seperate corners, and it was almost like having two rooms. Not to mention the price was fantastic. If you want to experience Paris without being a typical tourist, then this is really nice place. Unfortunately: The location had its downfalls. It is right by a university, so at night, you get all the kids outside drinking and being very obnoxious. Because there is no AC in the room, and it was June, we had to have our balcony door open, making it difficult to sleep at night. This WAS summer, so I don't think there will be any problems in the Fall or Winter. Also, there are two ways to get to your room: the stairs, or the 1x1 square foot elevator. Two thin people can barely squeeze in it. This leaves the stairs, which will give you good exercise, but do you really need it after running around all day? The staff is a little bit cold, but all you need to do is be nice to them, and they will open up. If you are going to Paris in the summer, I don't recommend this hotel, but in the Winter or Fall I urge you to stay here. The price is unbeatable, and the location is very convienent (right by the Luxembourg Gardens!!) But this isn't the kind of place I would advise to people who like to stay in their comfort zone. To me, the good outweighs the bad.", "Date": "November 23, 2007"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Business service (e.g., internet access)": "3", "Check in / front desk": "4", "Overall": "4.0", "Value": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Washington, DC", "Title": "“Clean, pleasant little hotel in unbeatable location”", "Author": "travelbug61", "ReviewID": "UR10410554", "Content": "I stayed 10 days in a single room at the Grand Hotel des Balcons in October 2007, and found it comfortable, pleasant, and excellent value (85 euros/night for a single). The location is outstanding - a stone's throw from the Luxembourg Gardens and many of the foodie attractions in the 6th arr., and walking distance to many sights. I found it quite easy to take the RER train from the airport and walk the couple of blocks to the hotel from the Luxembourg station. Although the location is very central, the hotel is situated on a very quiet side street, so the rooms get much less traffic noise than many other hotels in the area. The single rooms, all facing the back of the hotel, are especially peaceful. The hotel's elevator is tiny - it can fit one person with luggage or two people without - but it functioned very efficiently throughout my 10-day stay. My single room, on the 3rd floor (it would be considered the 4th floor in the U.S.), was quite compact, but sparkling clean and quite comfortable, with large windows that made the room light and cheerful. The closet was tiny, but there were large underbed storage drawers. No mini-fridge or tea/coffee making facilities in the room, but ice and tea/coffee were available in the lobby all day. The bathroom was similarly compact, but again, squeaky clean. There wasn't just a shower stall, but a full bath too. No shower curtain or partition of any kind provided for the shower, so it took a little practice not to spray water everywhere. Excellent water pressure and temperature. The complimentary toiletries were tiny in size, so bringing or buying your own shampoo and soap might be a good idea. The front desk staff were all helpful and proficient in English. The lobby was tiny but pleasant. There was a nice breakfast room right off the lobby; the buffet breakfast cost 12 euros, and was bountiful and excellent. Overall, a very pleasant, comfortable little hotel. I'd happily stay here again on my next trip to Paris.", "Date": "October 28, 2007"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "santa rosa, ca", "Title": "“Great Two Star”", "Author": "bacchusman4", "ReviewID": "UR8242146", "Content": "This is a great Paris 2 star, especially at this price (88E/nite for 2). Very clean, very friendly staff and superb Left Bank location. Free copy of Le Monde daily (if you read French). Two blocks from the Odeon metro, which has no change metro connections to all of the train stations except Gare de Lyon. One half-block from the Odeon Theatre, a couple of blocks to Luxemburg Gardens, etc. I've stayed in lots of 2 stars in Paris over the years and I'd do this one again in a second. The rooms are tight ( I've seen tighter!), but that's what 2 star in Paris means. The amenities include TV, hair dryer, shampoo, washcloths (yeah!), shoeshine pad, cotton swabs and make-up pads. My rating is relevant to this category, and clearly those looking for 3 and 4 star locales would likely find this wanting.", "Date": "July 27, 2007"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Check in / front desk": "3", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Vancouver", "Title": "“Good Budget Choice in 6e”", "Author": "BowenLinda", "ReviewID": "UR7615638", "Content": "I checked in a single room at the Grand Hotel des Balcons on May 3rd for seven nights. While I probably would not stay there again on my fourth visit to Paris (I like to stay at different hotels in different areas), I certainly recommend it to other visitors. Good location in the 6e on a quiet street. My single room was on the courtyard side with a just-fine view of apartments. My room had been very recently painted with double French doors to the courtyard, ample storage space and pretty matching coverlet and curtains. The combination shower/tub bathroom looked recently upgraded. Sparkling clean. Comfortable double bed. Close to the metro station Odeon on the 4th line. Paid E85 per night. A few small negatives: I booked my room 36 hours before arriving from Canada and the hotel clerk would not fax or email me a confirmation. I prayed to the hotel gods and all worked out fine. The hotel also only has a E12 full buffet breakfast (which I did have twice and enjoyed) and no smaller continental breakfast available. Not a big deal as there are cafes nearby but there was a morning or two when I would have appreciated having coffee in my room. All in all, a good budget choice for Paris.", "Date": "May 14, 2007"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Check in / front desk": "4", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Arlington VA.", "Title": "“Easter in Paris”", "Author": "aliceArlingtonVA", "ReviewID": "UR7379067", "Content": "If your looking for a sootlessly clean comfortable and well maintained hotel in a good location this is the one for you In our opinion, it’s a great choice for a first visit to Paris. We stayed at The Grand Hotel des Balcons during the Easter week-end 2007 and were more than happy with this fine hotel. Our room was nicely decorated with a great parisian view out the window. The beds were beautifully made up every day. Fati, the first maid, had a keen eye on our room. (we believe tipping the maid will always make the difference). The reception staff is extraordinary, helpful and charming, and the hotel provides a very inexpensive international phone service. Breakfast is great, lovely fresh croissants and great coffee and a selection of cheeses, pastries, cereals and dried fruit, yogurt, bacon and eggs. The location is fantastic and central, we were able to walk to the main historical sites, Notre Dame and the Louvre pretty much “around the corner”. Musee D'Orsay is a further walk but definitely within reach (or you can take the bus or the Metro). The tiny street is very quiet and you barely realize you are in the middle of everything. It's steps away from the lively Saint Germain and the beautiful Luxembourg Gardens; wonderful cafes and shops are abundant in this neighborhood. The Odeon metro and bus stop are down the street so it's easy to get anywhere else in Paris. We had read Tripadvisor reviews with complaints, especially about the size of rooms and showers. Our room was fine. Are you going to Paris to stay in a hotel room all day? Paris is not a cheap city and we think this hotel is very reasonable (you have all the amenities you would expect from a 3 star hotel with the prices of a 2 star). It’s a wonderful value for money. We even got chocolate eggs on Easter Sunday. Alice Sexton Arlington VA", "Date": "April 17, 2007"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Check in / front desk": "3", "Overall": "4.0", "Value": "4", "Rooms": "3", "Location": "4"}, "AuthorLocation": "harrogate", "Title": "“Great location”", "Author": "sarah65", "ReviewID": "UR6333973", "Content": "This was our second visit to this small hotel, ideally situated near L'Odeon and only minutes away from the Luxembourg Gargens. Although so close to the Metro and plenty of good bars and restaurants the street is very quiet indeed. The rooms are small but adequate. As well as loving from the location we returned because of the excellent breakfasts, served in a charming art nouveau room.", "Date": "December 5, 2006"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "3", "Location": "5"}, "AuthorLocation": "milwaukee, wi usa", "Title": "“great location and service”", "Author": "john-lesley", "ReviewID": "UR5946198", "Content": "We stayed at The Grand Hotel des Balcons from 9/3/06 until 9/11/06. This was the third visit for us. Alexander, the night manager was still there, we met him when we stayed there in 1987! The location of the hotel was great. Just down the street from the Odeon Theater. The rooms were spotless, but as in Europe, not very large. The desk clerks were very helpful. We had rooms facing the street, the weather was hot, there was no air conditioner, but they had no problem loaning us a fan for the room to quiet the street noise and cool us down. There are also rooms facing the courtyard, but we were in Paris, and looking out the window onto the street from our window made it a great experience.", "Date": "October 12, 2006"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "3", "Check in / front desk": "4", "Overall": "5.0", "Value": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "dublin", "Title": "“I always stay here!!”", "Author": "kookie12", "ReviewID": "UR5810654", "Content": "I love this hotel, Ive seen some of the reviews saying the rooms are small, which I suppose they are, but are you going to Paris to stay in a hotel room all day? Ive stayed here twice and had one of the smaller rooms on the second time, but we were more than happy with the hotel. The location is fantastic, with the metro just 2 mins walk away, notre dame pretty much around the corner. Breakfast is great, lovely fresh croissants and great coffee. Paris is not a cheap city but I think this hotel is very reasonable. If your looking for a clean hotel in a good location this is the one for you. I would never dream of staying anywhere else when I go to Paris.", "Date": "September 17, 2006"}, {"Ratings": {"Cleanliness": "5", "Overall": "5.0", "Value": "5", "Service": "5", "Rooms": "5"}, "AuthorLocation": "Los Angeles, CA", "Title": "“Cute hotel in Latin Quarter”", "Author": "kkmrag", "ReviewID": "UR5417004", "Content": "Grand Hotel des Balcons is a nice hotel in a great location. The street is quiet but it's minutes from the lively Saint Germain and the beautiful Luxembourg Gardens (one must do: cafe and pastries at the La Rostand cafe) The Odeon Theatre and Notre Dame are also close by. Musee D'Orsay is a further walk but definitely within reach (or you can take the Metro) Wonderful cafes and shops are abundant in the lively neighborhood. The Odeon metro and bus stop are 5 mins. away so it's easy to get anywhere else in Paris. Our room was clean, with a large bathroom and great water pressure. The breakfast buffet is wonderful- the spread set us up well each morning for a full day sightseeing. The dining area is cozy and a great place to plan out the day's activities. A close by lunch or dinner place is La Cambuse, a small bistro across the street that has great steak and frites and salads (desserts looked good too but we saved room for gelato later) We enjoyed our stay here and would definitely stay here again.", "Date": "July 2, 2006"}, {"Ratings": {"Cleanliness": "4", "Overall": "2.0", "Value": "3", "Service": "3", "Rooms": "1"}, "AuthorLocation": "Alamo, CA", "Title": "“I cried when I saw my room!”", "Author": "A TripAdvisor Member", "ReviewID": "UR5227833", "Content": "After waiting a lifetime, I came to Paris with my Parisian mother. My parents had stayed at this hotel previously and found it charming. I arrived a day before them and when the shuttle left me off on this quaint side street I was so excited. The facade was charming and the lobby, although small, was cheerful...then I went to my room. When I opened the door I literally cried. The walls had 'splattered' red and black paint wallpaper that looked like street graffiti! The entire room was filled by the bed and there was no floor space to put my suitcase. I rushed down to the lobby and begged the manager for another room. He was quite accomodating and showed me two others. One slightly larger with a more cheerful motif but barely larger than the first, and another room significantly larger but with one 'slight' problem. The building was being reroofed and the top floor had scaffolding across the windows so you couldn't open the shutters, and the room was darkened by the scaffolding. I chose the smaller room that faced the courtyard and kept the window open virtually the entire time I was there so I didn't feel so closed in. (Good thing I brought earplugs since an apartment building shares the courtyard and residents were noisy at all hours of the night and early morning). I spent the entire afternoon searching for another hotel within reach of this one since my parents were planning to stay here, too, but to no avail. The pluses were that the hotel was modestly priced, offered an ample breakfast, was in a convenient location and was quite clean. After waiting 44 years to be in Paris with my mother this is NOT the type of accomodation I had dreamed of! Even my folks confessed it was much less pleasant than they had recalled. The bottom line, spend a little more and you'll probably be happier!", "Date": "May 28, 2006"}, {"Ratings": {"Cleanliness": "5", "Overall": "5.0", "Value": "5", "Service": "4", "Rooms": "4"}, "AuthorLocation": "Bromborough, United Kingdom", "Title": "“Clean, comfy, nice food and reasonable rates!”", "Author": "Fiohna", "ReviewID": "UR5181962", "Content": "We stayed here at the beginning of May. The room was average size but clean comfortable and had balcony doors which opened to give a welcome breeze. The bathroom was small but newly decorated and spotless with nice toiletries. Breakfast is good - hot bacon and sausgae and egg as well as cold meats and cheese as much as you want and fabulous warm croissants to finish. Well worth the rates. Very convenient for the Metro - get a 5 zone Paris Visite from the RER at the airport and you don't have to worry about tickets all week. We woulld stay there again!", "Date": "May 19, 2006"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "Flushing, NY", "Title": "“Wonderful little hotel”", "Author": "A TripAdvisor Member", "ReviewID": "UR5028708", "Content": "The Grand Hotel des Balcons Rue Casimir Delavigne (6th) A darling little hotel with pleasant, helpful, multi-lingual staff. The Art Deco interiors are lovely with a nice breakfast room--and what a breakfast! Paté, fresh cheeses, cold cuts, omelettes with bacon and sausages and more. The room (a single) was nicely furnished (though small) with new carpeting and fabrics on the bed and large window. Spotlessly clean. And a great location--just down the street from the Odéon metro stop. Great price, too. I can't imagine staying anywhere else from now on.", "Date": "May 2, 2006"}, {"Ratings": {"Cleanliness": "5", "Overall": "2.0", "Value": "4", "Service": "3", "Rooms": "2"}, "AuthorLocation": "Chicago", "Title": "“Clean, nice sheets and beautiful facade, although tiny, tiny rooms.”", "Author": "Tamara", "ReviewID": "UR4521925", "Content": "I should begin by saying that if you are a huge fan of the Left Bank and wish to stay in a location over run Americans, than this is the hotel for you. I have come to prefer staying just off the beaten path in a location where there are more locals and no American chain restaurants. St. Germain seems to have become a miniature Times Square. Let's face it, if that is what I am looking for, I can go to New York. Given that, the front of the hotel is stunning. The art nouveau facade and wood trim are beautiful. The entire outside of the hotel is lovely. The lobby is lovely. Sadly, out of over a dozen visits to Paris, this was by far the smallest room I have ever seen. The bath was so tiny and cramped that I must have cracked my head in the shower at least five times. On the plus side, the sheets are sublime. While the bed was miniscule, the linens were so soft and smelled so good I almost thought about swiping a set off the housekeeping cart. I restrained myself. I had been doing quite a bit of antique shopping on this trip and the size of the room made it nearly impossible for me to bring much into the room. Packing was a nightmare as I kept walking into the doors. Keep in mind, if the door to the room was open, the bathroom door could not be closed all the way. I will say that the hotel is immaculate. Spotlessly clean and well maintained which is always welcome when one is traveling. I am not sure why the words Grand or Balcons are in the name of the hotel, as the room was not grand and in actuality, there are no Balcons. Yes, French doors opening to the street, but you cannot actually walk out on to the balcony as you will find only a tiny ledge. I did not find the staff to be terribly warm or helpful, but somewhat indifferent. Not my best hotel experience in Paris, but c'est la vie!", "Date": "February 26, 2006"}, {"Ratings": {"Cleanliness": "5", "Overall": "4.0", "Value": "4", "Service": "4", "Rooms": "4"}, "AuthorLocation": "New York, NY", "Title": "“Clean Room in a Fab Location”", "Author": "tikkipembo", "ReviewID": "UR4398003", "Content": "I needed a break from the city and work so I hopped off to Paris for a few days. It was a ton of fun and everyone was pretty friendly. I think the latter was partly due to the fact that I was visiting during a non tourist month. Location - The hotel is located in the fabulous Latin Quarter (a little hard to find initially b/c it is on an off street). It is a short walk to the metro, surrounded by shops and restaurants. And most importantly, I felt safe (single female travelling alone). Rooms - The rooms are small (it is a budget hotel), but quite clean. There was a tiny table/desk, chair, tiny closet and TV. I had a room facing the back and it was pretty quiet. The bathrooms were renovated and pretty big with GREAT water pressure. Food and Folks - I ate breakfast at the hotel every morning as I planned my day. It was yummy and a good assortment of hot and cold food. The staff was very friendly and spoke relatively good English and was helpful. Bottom Line - Great hotel for the cost and location. It is a budget hotel so don't expect much in terms of decor or size... but it is clean (which is very important). For me, it suited me fine since all I did there was sleep and get breakfast.", "Date": "January 30, 2006"}, {"Ratings": {"Cleanliness": "5", "Overall": "4.0", "Value": "4", "Service": "4", "Rooms": "4"}, "AuthorLocation": "Rochester, NY", "Title": "“Great Hotel”", "Author": "A TripAdvisor Member", "ReviewID": "UR4344161", "Content": "This hotel was great. Very clean and in a great neighborhood. Beds were comfortable too. Really, no complaints. The elevator is tiny, but it seems like all the hotel elevators are small in Paris. We did not eat breakfast at the hotel, so I can not comment on that. You may be able to find a slightly fancier hotel for the cost, but we were completely satisfied with Grand Hotel des Balcons for the price we paid (100 euros a night).", "Date": "January 10, 2006"}, {"Ratings": {"Cleanliness": "4", "Overall": "3.0", "Value": "3", "Service": "3", "Rooms": "2"}, "AuthorLocation": "Stockport, United Kingdom", "Title": "“Cheap for the area but not the best”", "Author": "Sucal", "ReviewID": "UR4158177", "Content": "Expected better after reading reviews in The Times, Good Housekeeping etc in the UK. Maybe their reviewers got better rooms. Hotel is clean and staff are pleasant. The room was small but this is usual around here.The bathroom was large by some standards! The room had an odd smell and the double bed was not just firm but uncomfotably hard.Very small wardrobe but plenty of cupboard space sufficient for 3 or 4 night stays. Heating was on but there were no individual controls so it got too hot.It was very quiet both in the day and night. Hardly saw a car on the road outside. Can't understand others problem with noise. Probably wouldn't stay again as there is plenty of competition. At the price it as good as you can expect in this area.", "Date": "December 2, 2005"}, {"Ratings": {"Cleanliness": "5", "Overall": "3.0", "Value": "3", "Service": "3", "Rooms": "4"}, "AuthorLocation": "uk", "Title": "“beautiful paris”", "Author": "deenix", "ReviewID": "UR4032869", "Content": "The four great things about hotel grand des balcons: 1.) the rooms are definately among the cleanest that I've ever stayed in 2.) the location is really good (although not as good as le marais, in my opinion) 3.) the abundance of hot water to bathe in!! 4.) the area felt safe at night. By the way....this hotel isn't too much of a walk from les deux magots cafe, which is fabulous (go see!!!!! the coffee & pain au chocolat are incredible, as is the petit chablis). The not so great things about hotel grand des balcons: 1.) the bed linen is a little worn & gaudy! (it *is* clean though) 2.) the heating wasn't on in the evenings & so when we returned to our room at around 10pm, we were really cold (Paris in February is a bone chiller!!).", "Date": "October 18, 2005"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Toronto, Canada", "Title": "“Excellent Location”", "Author": "rgirn", "ReviewID": "UR3813171", "Content": "Okay so I took a long time to write this but better late than never! Also want to point out that I gave this hotel a 4 star only because our room didn't have a shower curtain. There was a shower head but no curtain or curtain rod - so needless to say it took a while to get used to! The hotel is in the 5th district, which is the Latin Quarter. There's plenty of excellent restaurants, creperies, cafes, & bars around. Alot of hip artsy college students live around there and the metero is only steps away - as well as a Starbucks. You have to leave your room key everytime you leave the hotel. Thought that was weird but someone was always at the front desk when we needed to get our key - regardless of the time. Great location, great hotel.", "Date": "August 29, 2005"}, {"Ratings": {"Overall": "3.0"}, "AuthorLocation": "Melbourne, Australia", "Title": "“Reasonable value for Paris”", "Author": "Jon Potter", "ReviewID": "UR3719268", "Content": "Cosy, clean and comfortable room (number 301) with a nice Parisian charm and feel. Had asked for a double bed but got a twin (two singles pushed together). Beds firm and comfortable. Bathroom good size and clean but no shower curtain in bath - whole bathroom gets covered in water when taking a shower. Cheap feeling bathroom supplies (single-sheet toilet paper dispenser, plastic cups, etc). Good sound insulation to outside - very quiet with window closed - but lots of internal noise (thin walls and creaky floorboards). Juliet style balcony with no real view (looks on to opposite buildings) but the balcony with the flowerpot gave the room a nice feel. Reception friendly, English speaking staff. Excellent location. Wireless internet available for a fee (Orange).", "Date": "July 29, 2005"}, {"Ratings": {"Cleanliness": "4", "Overall": "1.0", "Value": "1", "Service": "3", "Rooms": "1"}, "AuthorLocation": "NYC", "Title": "“Prison-like Accomodation”", "Author": "elpenguin", "ReviewID": "UR3617695", "Content": "Where to begin? Let's start with the photo of the rooms on the hotel's website: large, luxurious, large, huge, large. The visit to the hotel proved quite the opposite. We requested a DOUBLE room-- which usually means a bed big enough for two medium-sized people. What we received was a tiny, not even 10 feet wide prison cell with two meager beds pushed together which kept sliding apart thoroughout the night. Let's add that these were sleepless nights, since the hotel has NO A/C whatsoever. Which isn't a problem if there are windows. But the infamous balcony (hence the hotel's name) has double doors which could not be opened fully because the second bed is in the way! Not so great for fire codes, but great for the hotel to squeeze out more money from a single room. Everyone raves about the breakfast, but who can eat when the temperature of the \"eating area\" (not the luxurious palacial type restaurant they boast on the website) is hotter than it is outside? I don't like to eat with sweat pouring off myself-- no thanks. It's better, more economical, and more Parisian to grab a few croissants and some beverages and head over to the Jardins du Luxembourg and sit in chaise longues and people-watch instead of paying 10 Euros for food in a steamy, cramped room. In short, this hotel might be ok in the winter but in the summer it is definitely NOT recommended. Why suffer in the heat and no ventilation, not to mention air conditionning, when there are plenty of comporable hotels 'round the corner? Also, why pay for a double room when you are getting two not even twin sized beds hastily pushed together? If you are a fan of decor, or at least expect some sort of harmony in your surroundings, then do not stay here. At least they could have put matching sheets on our bed(s); rather, they used two clashing colors, which made it more obvious that we had been gipped with the double bed. The bedspreads are alarmingly turquoise, rough, and in disrepair-- but then again, who uses blankets in a 100 degree room? As for the bathroom, I could read the paper through the towels, which might have covered 1/4 of my body, if I used two. NOT recommended. Stay elsewhere!!", "Date": "June 28, 2005"}, {"Ratings": {"Cleanliness": "4", "Overall": "5.0", "Value": "5", "Service": "4", "Rooms": "3"}, "AuthorLocation": "Munich, Germany", "Title": "“Simple yet perfect”", "Author": "A TripAdvisor Member", "ReviewID": "UR3502208", "Content": "It is a very simple hotel but perfectly located for a stay in Paris. The rooms are small and clean - totally sufficient as you will not stay a lot inside when visiting Paris. The location is perfect near the Place Odeon. Next time in Paris, I will definitely stay there again. PS: the view from the little balconies of the top floor rooms is very nice!", "Date": "May 26, 2005"}, {"Ratings": {"Cleanliness": "5", "Overall": "5.0", "Value": "5", "Service": "5", "Rooms": "4"}, "AuthorLocation": "Pismo Beach, California", "Title": "“Excellent Experience”", "Author": "Gourmand", "ReviewID": "UR3345662", "Content": "We were most satisfied with the Grand Hotel des Balcons. After 6 months of research I decided the one bad review on this web site had to be just an off night, because this hotel is written up everywhere as excellent. We were not disappointed. First of all, the tiny lobby is just lovely. The staff were excellent, always directing us each day to the best of the area. (Later we found out just how FANTASTIC some of the places he sent us were - ask about how to get to the Patrick Roger chocolate shop.) Our room was on the top floor and had two beds, one double and one twin. We were shocked to discover we had a view of the Eiffel Tower! This may be the only room with view, but I will always ask for it now. (Yes, we would stay again.) The bathroom was very nice size, not small like other hotels. There was a long desk with phone and television, and we had to move the twin bed around, but a very large closet was in the room too. Had two chairs also. So, you can see, it was a nice larger than usual room for 130e. We did not partake of the breakfast, instead always chose to run out to a local patesserie for something unique. Turns out the famous Dalloyau by Luxumburg Gardens is very close. Also, the Odeon Metro is about 3 blocks away. Near the Metro is a tiny crepe maker who stands there all day. Yum. Have Nutella and Banana. We could easily walk to St. Supice and the St. Germain des Pres area to shop. In fact, several nights we walked all the way to Les Deux Magots! It was also not too far to Bon Marche. It is a great walking neighborhood. Our room was so quiet I actually woke up the first night worried that the City had no noise. I had never heard such a quiet city. But it was the neighborhood. We highly recommend. But ask for a large room.", "Date": "April 9, 2005"}, {"Ratings": {"Cleanliness": "5", "Overall": "5.0", "Value": "5", "Service": "5", "Rooms": "5"}, "AuthorLocation": "Washington, DC", "Title": "“Great hotel and great value!”", "Author": "RGW", "ReviewID": "UR3315626", "Content": "We have just returned from a four night stay at this hotel and could not have been happier with the location, service, immaculate room, and price. Situated on a quiet, small street near the Odeon Metro stop in the Sixth Arrondissement, our family of three enjoyed a triple room on the fourth floor that was very large by European standards. We had three single beds, two placed together to form a king. The third bed was at the opposite end of a large room with desk nicely dividing the space to create two separate areas in the room. The hair dryer was located on the desk because the electric outlet in the bathroom would only permit electric razors, but with the very large mirror, chair and large desktop, there was plenty of alternate dressing space that was very convenient. The double sink and huge soaking tub with immaculate white tile all around the bathroom made it easy for three people to get out quickly each day for four wonderful days in Paris. The staff was extremely helpful and friendly. We arrived from an overnight flight, checked bags at 9 a.m. and returned around 1 p.m., when our room was immaculately cleaned and a complete range of toiletries was provided. Following an afternoon rest, we returned to the streets nearby for a wonderful evening of dinner, strolling and activity in the neighborhood. Later, we returned to our very quiet room where we slept without any interruptions. The small balcony was just large enough to step out for views and photos of the red tile rooftops nearby. We travel frequently, and given the quality, service, price, and location, this hotel offers the best value for the travel dollar we have seen in a large city recently. One tip: be sure to allow plenty of time for a taxi to show up. We asked the desk about time estimates to get to the Gare de Lyon and planned our departure time accordingly. The taxi company was about 20 minutes late, which seemed to be due to overbooking by the cab company. The hotel staff was very helpful and called several times for us during the wait and we made our train in a rush. The RER Line B goes directly to Luxembourg Gardens from CDG airport; the RER stop at Luxembourg is a short walk, and we found that a very easy way to get into the city, although rush hour can mean very crowded trains. The Luxembourg stop is only a 10-15 minute easy walk from the hotel.", "Date": "March 31, 2005"}, {"Ratings": {"Cleanliness": "2", "Overall": "2.0", "Value": "2", "Service": "3", "Rooms": "1"}, "AuthorLocation": "New York City, New York", "Title": "“Disappointed”", "Author": "elainesl", "ReviewID": "UR3017600", "Content": "The following observations are mine (and those of my travel companion)--if others find the hotel completely to their liking I will not disagree with that. However, my friend and I didn't care for it at all. It is very well-located, about a 5 minute walk to the Odeon metro station. About a 20 minute walk to St Michel metro station which is also an RER station. Our 'twin' room was the smallest hotel room for two people I have ever seen. Two twin beds pushed together with no space in between. No bedside tables, just about 10 inches of floor space to a wall on either side of the beds. About 3 feet from the edge of the beds was a counter/desk top with some cubby holes underneath for clothes storage. There was a small closet which was a decent size. The furnishings were plastic, and clean, but far from pretty and new. Bathroom small, but ok, towels thin, Washcloths, soap, shampoo provided. Hand-held shower hose, no curtain around tub. Small tv with one English-language channel (CNN). Hair dryer provided, but not installed in bathroom, it was just left out on a shelf, and one had to crawl underneath the bedroom counter in order to find a solitary plug for the hairdryer. Worst thing was, the room, #406, REEKED of smoke. I don't smoke but am not an anti-smoking fanatic, but this odor was very unpleasant and made the room feel 'dirty', or at least, not fresh. Room rate 100 euro. The hotel's often-praised breakfast was okay. For 10 euro there was a choice of fruit juices, some dried fruit, yogurt, coffee, tea, and instant hot chocolate, good baguettes and croissants, butter and jams, and scrambled eggs (stone cold each day) and bacon and sausage. We had it twice, if we'd continued staying there we would not have had it again. By the morning of our second day we decided that our room was really too unpleasant and inquired about a larger room. We accepted, room 303. Much larger, it is a triple room, one double bed plus one twin day bed in its own alcove. Bigger bathroom, more electrical outlets, two sinks in bathroom, toilet in its own wc. A couple of area rugs, vinyl flooring. Posted price for this room 180 euro, but they offered it for 150 euro. Next morning, our third day, on our way out in the morning, we decided to check out the small hotel just two door down that we'd noticed each day. Hotel Delavigne, #1 rue Casimir Delavigne. Lobby looked lovely but since it is a 3-star, we assumed it would be much more expensive. Wrong! The hotel is lovely, fresh, modern but charming, etc. We were offered a twin room for 130 euro, less than our 2nd room at the Balcons. We went back to the Balcons, checked out, and rolled our bags down the street to the Delavigne.", "Date": "January 19, 2005"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Chicago, IL", "Title": "“Love this little hotel”", "Author": "A TripAdvisor Member", "ReviewID": "UR2987287", "Content": "My husband and I stayed in Hotel des Balcom for the New Years and we love this little hotel. This hotel should be rated 3 stars rather than 2 and the rooms are very clean and small, compare to US but most rooms in Europe are small. We had the breakfast for 10 Euro per person. They have nice arrays of American style breakfast, i.e. eggs, sausage, bacons, Brie, desserts, fruits, croissants, and so much more. Hotel is ideally located, very close to the metro/RER, Notre Dame, Latin qtr., and so on. We went everywhere by metro, highly recommend getting the Paris Visita and museum pass, and go to D’orsey & Louvre early, i.e. 8:30 AM the latest or you’ll be in a long line + hours of waiting time. Also, a great restaurant around the corner from the hotel, Chez Maitre Paul– excellent, excellent restaurant but reserve ahead. Overall, we would definitely stay at Hotel des Balcons again.", "Date": "January 7, 2005"}], "HotelInfo": {"Name": "Grand Hotel des Balcons", "HotelURL": "/ShowUserReviews-g187147-d236439-Reviews-Grand_Hotel_des_Balcons-Paris_Ile_de_France.html", "Price": "$105 - $200*", "Address": "<address class=\"addressReset\"> <span rel=\"v:address\"> <span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">3 rue Casimir Delavigne</span> | <span class=\"extended-address\">6th Arr.</span>, <span class=\"locality\"><span property=\"v:postal-code\">75006</span> <span property=\"v:locality\">Paris</span></span>, <span class=\"country-name\" property=\"v:country-name\">France</span> </span> </span> </address>", "HotelID": "2515276", "ImgURL": "http://media-cdn.tripadvisor.com/media/photo-o/01/c0/6c/1d/grand-hotel-des-balcons.jpg"}}