{"Reviews": [{"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Riverside, CA", "Title": "“Good value for Paris”", "Author": "4 Joyful Travel", "ReviewID": "UR127041610", "Content": "My young adult daughter and I spent 6 nights at the Lux Hotel Picpus during a warm spell in late March. We fit comfortably in the small twin room with shower, but a tall or large person would have difficulty maneuvering in the bathroom. The room was clean and well lit, with two comfortable beds, a desk, two chairs, a small TV with only French channels, and a storage unit that had plenty of space. The safe and mini-fridge were in a locked unit, so we just took the key with us during the day. We saved a lot of money by picking up food at one of the nearby grocery stores and making our own breakfast. The keycard to the room goes in a slot by the door to turn on the lights. The problem is that the keycard also turns on a heater in the bathroom. Since we had warm weather, we had to leave the bathroom window open to counteract the heater. The bathroom was very clean and modern with an excellent adjustable showerhead and plenty of hot water. There was also a handy makeup mirror (and a full-length mirror in the room), but the bathroom was poorly lit. The hairdryer worked well. We could hear a rumble from the metro even in our sixth floor room, but it didn't disturb our sleep. The neighborhood is fairly quiet at night but busier during the day. It seemed to be safe even when we arrived back at 11pm one night. It's a quick walk to the Picpus or the Nation metro stations, but on Sunday morning the line we wanted wasn't running until 10am. We had a good, reasonably priced Italian dinner at Ristorante Amalfi on the same block as the hotel. The hotel personnel were helpful with information and printed our boarding passes for us. They also stored our luggage on the last day. We rode Bus 351 from and to the CDG airport for 3 metro tickets each. That bus runs between CDG and the Nation station and took us about an hour and 15 minutes in the middle of the day.", "Date": "March 31, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "3", "Location": "5"}, "AuthorLocation": "London", "Title": "“Great service ... And price !”", "Author": "Brian W", "ReviewID": "UR126617850", "Content": "This was not our first weekend in Paris, but the first one in this quiet area where we found the hotel we were looking for: close to a metro hub, small rooms but great service, and above all, a very good price compared to other hotels in the city! If you need a cheap but quality hotel, pick the lux hotel!", "Date": "March 25, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Vienna, Austria", "Title": "“Wonderful city, great hotel!”", "Author": "Kathi O", "ReviewID": "UR126042485", "Content": "Me and my cousin stayed there in February for a few nights and it was a really great place! Rather central and well connected (one Metro station was almost right in front of the door and another one a 5-minute walk away so we could always chose from a great range of metro lines and get everywhere easily!) Also, it was important for us that the area was safe, as we were two young girls and I can only say that we always felt safe and were never afraid to walk around in this zone by ourselves (not even during the night)! The room was rather big (especially the bathroom) and very clean! Prices are very cheap (especially for a city like Paris), but breakfast was not included. (Still, it was not too expensive to eat at the hotel and the breakfast buffet was great!) I only had the impression that the staff was a bit cold and distant, but maybe it only felt like that because they didn´t speak any other language properly apart from French (which sadly neither of us was( is able to speak), but all in all it was ok, because when we really needed an important information the were always able to help us! I would definitely stay in this hotel again if I ever go back to Paris!", "Date": "March 13, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Texas", "Title": "“Very good value”", "Author": "collierje", "ReviewID": "UR125914159", "Content": "This hotel is a very good value for Paris. It is right by the Picpus Metro stop which is the next to last stop on the M6 line. This makes it very convenient to get around the city quickly, and you want have to walk far after a long day. There are some pretty good restaurants in the area, such as Le Picotin, nearby for when you don't feel like travelling far. The service was nothing extraordinary, but it was also not lacking. The breakfast was always great, and there were a good number of people down there each morning. I would definitely stay here again, and would recommend it to friends or family looking for an economical place to stay.", "Date": "March 10, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Hertfordshire, England", "Title": "“Good value”", "Author": "Fortynineplus", "ReviewID": "UR125821880", "Content": "Just returned from Paris, staying at this budget hotel for 2 nights. Chose this hotel after reading the previous reviews and I was certainly not disappointed. Daughter and I were given a very clean twin-bed room with bathroom attached on the 5th floor. The staff were friendly and helpful and we had a very pleasant stay. Will be back!", "Date": "March 8, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Bali, Indonesia", "Title": "“Excellent hotel”", "Author": "Nia01", "ReviewID": "UR123357673", "Content": "I've stayed in Lux Pic Pus Nation hotel already 4x starting from 2001 and and the last was in 2007 and will be staying again soon in coming March. The hotel is clean and the bath room already renovated in 2005. The area is very nice near Nation. The metro station is just few steps from the hotel. It's true that you can still hear the break of the train from your room in 1st floor where I always prefer to stay coz I love to hear the sound from distance. The breakfast all you can eat with good quality. I considered the hotel is almost perfect for the rate. It's worth it for budget hotel. It's not far from center but it's not problem if you prefer in safe area and quiet. I mostly recommend traveller to stay but don't expect you would find good pillow. I love this hotel very much", "Date": "January 20, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Lille, France", "Title": "“Great value”", "Author": "Chelsea H", "ReviewID": "UR122832329", "Content": "I stayed one night just passing through Paris, so can't comment on convenience to the major attractions, but the area is nice enough and it's a short taxi ride from Gare de Lyon. Reception, lift, stairs and bathrooms are all small, but hey, it's Paris! Nice views over the Boulevard too. Just make sure you're not on the seventh floor if you have lots of luggage; the lift only goes to the 6th! Overall, it's a good clean hotel with character at a great price.", "Date": "January 9, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "3.0", "Value": "4", "Sleep Quality": "2", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Istanbul, Turkey", "Title": "“Value for money if you dun mind noisiness !”", "Author": "Sherinwsh", "ReviewID": "UR120871810", "Content": "For the amount u paid in Paris , this place is definitely value for money . The location and service are good .. Just that my room is quite noisy maybe is at 1st floor and I can still hear the train passing by underground !", "Date": "November 21, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "3", "Rooms": "4", "Location": "5"}, "AuthorLocation": "New London, Connecticut", "Title": "“Good Value”", "Author": "James M", "ReviewID": "UR120677832", "Content": ".A small hotel,clean and calm.All taxes,fees and breakfast included in quated price.Multi-languages spoken. Two hundred yards to 5 metro and 2 rer lines, one metro line across the street.The open air markets on wens & Saturday just around the corner.Book in advance they are always full.", "Date": "November 16, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Derby, United Kingdom", "Title": "“Good location, clean (but small!) rooms”", "Author": "Wilber4orce", "ReviewID": "UR120323542", "Content": "The hotel is a little removed from the regular tourist area but is well served by the Metro at Nation and Picpus (10-15 minutes to city 'centre'). Clean and comfortable with helpful staff and good local bistros without the inflated prices. Rooms are very small and the tiny shower cubicle resulted in me being wrapped up like a Roman Senator on his way to a toga party. We stayed on the second floor and the gentle subterranean rumble of the passing Metro trains was noticeable but not a problem. Nice breakfast with a good choice from the buffet but the dining room can get a little crowded. Would recommend to anyone looking for a good value budget room.", "Date": "November 8, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Perth, Australia", "Title": "“Highly recommended”", "Author": "Misha04", "ReviewID": "UR120155756", "Content": "Stayed 5 nights and was impressed with the excellent value for the price. Service was most helpful and friendly, all reception staff were able to speak English, and the desk is open 24 hours. Room was small but very clean, very comfortable bed, TV and spotless modern onsuite with shower . Could not ask for a better location. Metro station Picpus across the road, Nation Metro about a 10 minute walk and bus stop 50 meters away. Lots of restaurants, wine shops, cheese shops, patisseries, pub and supermarkets within short walking distance. If you'd like to see a bit of Paris streets, you can walk to Place de Bastille in about 45 minutes and may come accross interesting little shops and street markets with marvelous fresh produce, antiques, 'pre-loved' items of every kind, etc. I will certainly try to stay here again when in Paris!", "Date": "November 4, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "4", "Sleep Quality": "4", "Rooms": "2", "Location": "4"}, "AuthorLocation": "Ontario", "Title": "“What you might expect for the price.”", "Author": "PianoKen", "ReviewID": "UR119347909", "Content": "I'll start by saying the place was very clean, quiet, had a great bed and in a great location, you could be at the Louvre in 20 minutes as it's very close to the Nation Metro station. Lots of shops and restaurants with local flavours. The room was very small and the shower even smaller, 2'x2' at the most. I'm 6 ft and 220 lbs so it was difficult to maneuver around in there. There was a leak in the bathroom the entire time I was there, they wrapped a towel around the pipe and said they would call someone, I woke to a large puddle on the floor every morning. The power went off about 5 times in my 5 days. Breakfast was okay when you could get a seat, same selection of croissants and cheeses, it was fresh and the coffee was good. I opted to eat out in the mornings mostly, it was cheaper and you can always get a great sandwich at a local bakery. I didn't find them very knowledgeable about answering general tourist questions but there were a lot of flyers in the foyer to get you what you need. If you're on a budget, not too fussy and you're not too large of a person, this hotel will serve the purpose.", "Date": "October 16, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "La Ferté-sous-Jouarre, France", "Title": "“Fancy Paris hotel and good value”", "Author": "Rémy N", "ReviewID": "UR119180389", "Content": "Stayed 2 nights in Lux hotel, great location, right in the fun part of Paris and very near a central station (rer and metro nation). Very kind and helpfull staff. Rooms were not too big, but very cozy, very clean and quite fancy. The price is very reasonable for a nice hotel inside paris.", "Date": "October 11, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Nice, France", "Title": "“perfect situation, very good quality price ratio”", "Author": "sandy_sandy_nono", "ReviewID": "UR116312906", "Content": "My friend and I stayed at this hotel for 4 days and were very surprised to see that besides its very reasonable prices for a hotel in Paris, the place had really everything we could expect to spend a nice time visiting Paris! The place was very very clean and even if the room was a bit small, we were very impressed by the very nice bathroom. The breakfast was very good and offered an impressively big choice of food. The metro station Nation (5min walks from the hôtel) has so many connections that we were close (in time) to every sites we wanted to see, we even had time to do extra tactivities we hadn't planned, like a very pleasant walk in the wood in the \"bois de vincennes\" that was 10min walks from the hotel (a piece of advice that were given to us by the very nice employees of the hotel!). On the whole i would just say not to hesitate to stay at this hotel because there is no way you could be disappointed for a so low price in Paris!", "Date": "August 5, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "4.0", "Value": "4", "Service": "4"}, "AuthorLocation": "Rishon LeZiyyon, Israel", "Title": "“Great, resonably priced hotel.”", "Author": "lanaz3112", "ReviewID": "UR115789512", "Content": "Stayed at the hotel for 3 nights - great location, 7 min walk from major metro station (Nation). The staff were very friendly and helpful. Room was clean and in good condition and price was very reasonable. Will definitely stay again if the opportunity arises.", "Date": "July 26, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "4.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Bucharest, Romania", "Title": "“Cozy place”", "Author": "Ciombe", "ReviewID": "UR112059001", "Content": "We stayed there for four nights and we realy enjoy it.If you not looking for luxury and want good acomodation at budget price that is the right place.", "Date": "June 7, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Taipei, Taiwan", "Title": "“Quiet and great value”", "Author": "pony1127", "ReviewID": "UR110230217", "Content": "I stayed for four nights there in May. My friend and I both like Lux hotel cause it's located in a quiet area and our room is big and comfortable, we had good night sleep. And the breakfast provided by the hotel were great too, the breakfast-attendant was nice and smiled all the time. I'll come back definitely!", "Date": "May 28, 2011"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Rio de Janeiro", "Title": "“I recommend”", "Author": "DiogoPaez", "ReviewID": "UR104514219", "Content": "Hotel recently undergone to a reform and is brand new. Is locate 8 min walking to Nation train station (RER & Metro). Nigthlife around. Great price.", "Date": "April 18, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Helsingborg, Sweden", "Title": "“Very nice and cheap hotel, metro across the street in a nice neigbourhood”", "Author": "snuddie", "ReviewID": "UR86491366", "Content": "The hotel lies perfect, takes 1 minute to get to the metro (just across the street). We bought a metrocard that lasted for a week, cost around 70 euro for two persons. We could travel all around Paris (bus, train, metro), and even to Disneyland. The Hotel was VERY cheap, 36 Euro (2 persons, 1 week). Very nice staff! They have a breakfastbuffé but we didn't tried it. The bathroom was very nice! There is a hairdryer but I recommend to take your own with you. Very nice neigbourhood, not much traffic or noise in the night. There is a little fridge (\"minibar\") in the room, perfect if you buy your own water and want to keep it cold. Not very lagre rooms, but big enough for two persons. Recomend it to everyone!", "Date": "November 9, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Indianapolis", "Title": "“A REAL European Hotel”", "Author": "EIEIOOO", "ReviewID": "UR68940970", "Content": "Stayed at the Lux Hotel for 7 nights in June with my wife and adult daughter. Room was small (as it should be) and very clean. Staff was warm and the neighborhood was very very French. Not a tourist destination and that is why we loved it! We were having trouble finding an affordable hotel for 3 in Paris until we found the Lux and we were glad we did. My wife thought the bed was better than the one at home. Breakfast was good and served until 10. Metro is very close with the RER just down the street. If you want a real Parisian experience stay here. If you want an American hotel, stay home. Also, if you are here on Saturday you MUST go to the open market on Vincennes street. This is Paris at it's best! We will stay here again.", "Date": "June 28, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Berkeley, California", "Title": "“Excellent Value and Comfort”", "Author": "FocusedGeezer", "ReviewID": "UR64743667", "Content": "This hotel was very clean and comfortable and represented extraordinary value. Located very close to Picpus Metro station, it hasan elevator and 24 hour reception. Rooms are available with small refrigerators, televisions and telephones and are serviced daily. Breakfasts were excellent with a good variety of foods. We intend to make this our lodging on all future trips to Paris and have already recommended it to numerous friends.", "Date": "May 19, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Location": "4", "Rooms": "4"}, "AuthorLocation": "Scotland", "Title": "“Quaint little Parisian hotel, good non-touristy location”", "Author": "KBScotland", "ReviewID": "UR52629722", "Content": "Stayed here over New Year, admittedly hotel and rooms are small, however our room on second floor was large compared to others we sneaked a peak at when passing by in the morning when being cleaned. Shower cubicle not good if you're on the larger side but it is adequate and very clean. Room cleaned every day. Great self serve continental breakfast. Staff friendly. Yes, you can hear the metro as mentioned in other reports but my ear plugs soon sorted that out! Very nice location, close to Picpus and Nation metro. Only small gripes would be that there was no kettle and tea/coffee making facilities in room and there's not really a public area where you can sit in the evening. Mini bar containing soft drinks and snacks at 2 euro each and in-room safe was a good idea. Would definitely stay here again and recommend it to anyone looking to stay in the real Paris, only about 20 mins from centre of Paris by metro if you stay here. Very reasonably priced at 76 euros per night including breakfast for 2 people, bargain!", "Date": "January 5, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Location": "4", "Rooms": "4"}, "AuthorLocation": "São Paulo", "Title": "“Cozy, not modern”", "Author": "camilasp", "ReviewID": "UR51128005", "Content": "I stayed 1 week in Lux with my boyfriend and we both enjoyed it. The staff is nice and breakfast is delicious. I have to admit the deco is not very modern - everything is simple and the rooms are small (specially the bathroom). However, it's a cozy and clean place to spend some days with not many people sharing the same room.", "Date": "December 12, 2009"}, {"Ratings": {"Service": "2", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Location": "2", "Rooms": "4"}, "AuthorLocation": "Montreal Canada", "Title": "“Great Hotel but too far from main attractions”", "Author": "DanBoy11", "ReviewID": "UR48270894", "Content": "We stayed at the Lux Picpus during a ten-day visit to Paris. This is a nice and very clean hotel. The breakfast is great. We found it a little bit far from main attractions (Notre-Dame for example). We travelled using the Metro and RER and it was sometimes difficul to make our way back to the hotel, especially if you are tired after a day walking. The area is nice but there are no close-by attractions. Staff at the front desk are polite but not helpful in recommending restaurants or finding the convinience store. When we will go back to Paris we will stay in Montmartre. Overall very nice hotel.", "Date": "November 1, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Tallahassee, Florida", "Title": "“Nice Quiet Hotel in Paris”", "Author": "MisterWombat", "ReviewID": "UR47906867", "Content": "The Lux Hotel is across from the metro line 5 station at Picpus less than 10 meters. Very nice and quiet hotel. Has a lift but small. Rooms nice but small. Excellent high-speed free wireless. Friendly staff. Refrigerator in room. Beds were fine,had a shower, plenty of hot water and towels. Been there several years, never a problem once you get used to small rooms.", "Date": "October 27, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "3", "Overall": "4.0", "Value": "5", "Location": "4", "Rooms": "4"}, "AuthorLocation": "Israel", "Title": "“Great little hotel, especially for the price”", "Author": "eary", "ReviewID": "UR46866766", "Content": "I really enjoyed my stay at the Lux Hotel Picpus. For a two-star hotel that offers rooms for around 60 euros, it's just perfect. It's located in a safe area with three metro stations nearby - Nation, Picpus and Bel-Air, so getting around is not a problem. The building, with flowers in the windows, is simple and charming; the hotel logo is usually lit up in the evening. There is a tiny elevator that fits no more than three people (or two with luggage). There is always someone at the reception desk, since the guests have to leave their room cards there when going out. I just have to mention the (largely English-speaking) staff - all were really nice and welcoming, especially the gentleman that worked in the evenings/nights. The rooms are small; my friend and I were given a triple room (208), but still had to be careful not to bump into one another (not that we spent much time in the room, of course... Paris is beautiful). The bathroom was also small, with a nice and strong shower. Our room was always clean, but the sheets were not changed during our stay; I personally don't find this a problem, but some people might. We slept with the window open and heard no noise other than the bells of the nearby church in the morning... The hotel offers breakfast for 8 euros, but we preferred to start our day with sandwiches made from freshly baked baguettes (oh, how I miss those!) at the lovely boulangerie on the corner, just meters away. If you want to see Paris on a budget, I think this hotel is a great choice.", "Date": "October 14, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "4", "Rooms": "5"}, "AuthorLocation": "canberra", "Title": "“Great find!”", "Author": "McGonnagall", "ReviewID": "UR36818422", "Content": "This hotel was a fabulous little find. The room was fine, very neat and clean. Lift very small but quite adequate getting luggage up and down, otherwise stairs were fine. Bathroom was adequate. Windows opened allowing a fresh breeze. The staff indulged me my very bad French and spoke English when I needed it. It is located a little out of Paris CBD in a quiet neighbourhood but is very accessible via the Metro stop across the road. Breakfast was fine and reasonably priced. I stayed five nights and found it to be a very good value stay. I very much valued the free high speed wifi internet access and I would most definitely return.", "Date": "August 5, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "4", "Rooms": "5"}, "AuthorLocation": "Columbus, OH", "Title": "“We keep coming back.”", "Author": "Dink48", "ReviewID": "UR26025738", "Content": "This review is long overdue. My husband and I have stayed twice at the Lux Picpus (summer 1999 and Oct. 2006) and we will be staying there again in May. We keep returning because we cannot find the same \"rapport qualite-prix\" anywhere else in Paris. This hotel is like a 2-star boutique hotel. It is VERY nice and yet still a value. We have had decent-sized rooms with positively large baths. Each of our rooms has had a full tub with shower attachment. We have stayed in several \"budget\" hotels in Paris that cost more and offered a lot less. Where else in the City of Light can you get a charming hotel facade and lobby, an elevator, a room with TV and minibar and a great bathroom AND a fantastic buffet breakfast for under $100? The breakfast @ 8 euros sure puts the bread and coffee @ 6 euros breakfasts to shame. We still keep searching every time we go to Paris, but we have not been able to find a better, more cost effective deal. Yes, we would like to be more centrally located, and yes, the metro tremors bother us for the first hour or two in the room, but the Lux Picpus' staff is cordial, the accommodations quite comfortable, and the price is right.", "Date": "March 11, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Business service (e.g., internet access)": "3", "Check in / front desk": "4", "Overall": "5.0", "Value": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "New York, New York", "Title": "“Nice Hotel, Great Value!”", "Author": "NYPass", "ReviewID": "UR21828408", "Content": "I stayed at Lux Hotel last october, the hotel is basic but nice, clean and close to everything, if you are looking for a good value, this is the place. The hotel is located in a good area nearby to retaurants and train station (like 2-3 blocks) and you will be in heart of Paris in 15-20 minutes. Breakfast was good, friendly staff as well. I highly recommend this hotel for people looking for a nice place to stay but nothing fancy.", "Date": "November 13, 2008"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Business service (e.g., internet access)": "4", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Sao Paulo", "Title": "“Great simple Hotel”", "Author": "LDelphim", "ReviewID": "UR20946513", "Content": "It is a very simple hotel, no luxury at all but charmed. Looks like a small hotel of Agatha Christie’s book. The rooms and bathroom are very small but clean with comfortable beds and good douche (not easy to find in Paris). The breakfast is simple but very French and tasty. The cost/ benefit is EXCELLENT. I stay there every time I go to Paris. I strongly recommend the hotel. Only a recommendation to the owners: implement a taxi call service.", "Date": "October 16, 2008"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Check in / front desk": "3", "Overall": "3.0", "Value": "3", "Rooms": "2", "Location": "4"}, "AuthorLocation": "Stevenage", "Title": "“Nothing Special”", "Author": "TaniaMacDonald", "ReviewID": "UR13594105", "Content": "The ‘Nation’ Train Station (RER ‘A’ line, which is orange) is the nearest stop to the Lux Hotel. When heading out of the train station look for two tall columns. On the right hand side there is a road called Boulevard de Picpus. Walk down this road (approx 100 metres) and you will see the hotel on the Left hand side. The ‘Picpus’ Metro line 6, which is light green, is very close to the hotel. The hotel is very small and unfortunately not very modern. There wasn’t even a kettle. It is definitely a 2* hotel, very basic. We stayed in room 315 which was very small for a 3 of us. The room needs a make over and the bathroom is soooo small you can hardly move. You will be banging your head on the sink when using the toilet. The beds and pillows were very comfortable. We only paid £98 for two nights so I can not really complain. You get what you paid for. The hotel was great in terms of central access to places like Disney and/or Paris. We asked for extra pillows and towels and they brought them to our room straight away. . We had dinner in the Ristorante Amalf (located just outside the hotel). The Pizza was lovely, but avoid the Spaghetti Bolognaise. We literally had a tablespoon amount of mince on watery spaghetti.", "Date": "February 16, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Business service (e.g., internet access)": "4", "Check in / front desk": "4", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Eastern States", "Title": "“A Very French, Cute Little Hotel”", "Author": "DaffodilSparkle", "ReviewID": "UR12211462", "Content": "This was the first hotel we stayed in on our trip to France, and we were welcomed and pleased. It has nice curb appeal, a sweet little elevator, and a winding spiral staircase upward if you care to get the excersize. It was quaintly decorated while still carrying all the modern neccessities. Our room was clean and convienently held a microwave. There were windows as well, overlooking a pleasabt courtyard backed up to apartments- it was fun to see locals do their normal activities- we saw a lady hanging laundry and someone cooking dinner. Breakfast the next morning was delicious- they had hot chocolate, real croissants, eggs, biscuits, and (my favorite) little glas jam jars that we kept and brought back as souvineirs. We had a lovelty trip, beginning with Lux Hotel Picpus- it was also close to great sightseeing.", "Date": "January 1, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Check in / front desk": "5", "Overall": "4.0", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Washington DC, District of Columbia", "Title": "“Good value!”", "Author": "blondedawn", "ReviewID": "UR10001758", "Content": "Overall, we liked this hotel a lot. Front desk staff was very friendly. Room was clean, and comparatively spacious to other rooms we had had in Europe. Breakfast was tasty -- they serve actual croissants (among other things) from a boulangerie as opposed to prepackaged croissants like other hotels I have visited. And, of course, the price was right! It was very easy to reach the sights of Paris using the Nation or Picpus metro stops -- the subway lines serve the Louvre, Arc de Triomphe, and the Eiffel Tower directly. If you don't mind having to ride the subway for 10-15 minutes, this is a great value -- much cheaper than the accomodations more central in town. We also liked the area around the hotel. A *bunch* of boulangeries, where you can stop to get some bread or a pastry as an evening snack; a supermarket right at Nation; lots of brasseries. Overall, thumbs up.", "Date": "September 25, 2007"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "new jersey usa", "Title": "“clean reasonable and great staff”", "Author": "samantha107", "ReviewID": "UR8409019", "Content": "my sister and I stayed here in march 2007 for three days. the room was small but clean. the staff was very helpful and the breakfast was wonderful. This is my second stay and I would go again.", "Date": "August 14, 2007"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "4.0", "Value": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Phoenixville, Pennsylvania", "Title": "“Cleanliness, comfort and great value”", "Author": "tsl1965", "ReviewID": "UR7633404", "Content": "I have stayed here twice (Nov 2000 and May 2007) as a single tourist. This is a typical small (39 room) Paris hotel in the 11th arrondisement near Place de la Nation. Each time my room was small but extremely clean, tidy and comfortable - with a comfortable double bed, small desk and chair, closet, 13\" TV (5 channels, all French), and bathroom. The small room (48 euro)was fine for me, but couples may want to get a bigger (57 euro) room. You are required to take breakfast (7 euro), but it is a good spread with croissants, baguettes, cold cuts, fruit, yogurt, cereal, coffee and juice. The hotel is on a quiet, safe residential street just south of Place de la Nation. While the Picpus metro stop is right nearby, you are better off walking 5 minutes to the Nation metro / RER station - the 1 line is the nicest metro line in Paris and runs right down the Right Bank to Notre Dame, Louvre, Arc de Triomphe, etc. The staff is friendly, and there is 24 hr front desk staffing. You can not find a cheaper clean, safe hotel room in Paris - but be aware that this is not the Ritz.", "Date": "May 16, 2007"}], "HotelInfo": {"Name": "Lux Hotel Picpus", "HotelURL": "/ShowUserReviews-g187147-d554230-Reviews-Lux_Hotel_Picpus-Paris_Ile_de_France.html", "Price": "$77 - $111*", "Address": "<address> <span rel=\"v:address\"> <span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">74, boulevard de Picpus</span>, <span class=\"locality\"><span property=\"v:postal-code\">75012</span> <span property=\"v:locality\">Paris</span></span>, <span class=\"country-name\" property=\"v:country-name\">France</span> </span> </span> </address>", "HotelID": "2515171", "ImgURL": "http://media-cdn.tripadvisor.com/media/photo-s/02/46/96/15/lux-hotel-picpus.jpg"}}