{"Reviews": [{"Ratings": {"Service": "2", "Cleanliness": "1", "Overall": "2.0", "Value": "3", "Sleep Quality": "2", "Rooms": "1", "Location": "2"}, "AuthorLocation": "Seattle, Washington", "Title": "“If all you want is a bed and close proximity to downtown Seattle....”", "Author": "Lori G", "ReviewID": "UR121715828", "Content": "I stayed here several weeks. This is not your \"normal\" inn. It is very dirty, the towels are threadbare. There are no heaters in the rooms, you have to ask for a room heater. There are bed bugs in some of the rooms. There are burn marks on the sinks and tubs (I was in several rooms). The water temperature is dangerously hot, so beware if you have children. I personally would not bring a child here, Housekeeping doesn't clean often. The carpeting on the stairs is filthy. There are no working laundry facilities available. This facility is our tax payer dollars at some of their worst. Many families, in transition from homelessness or other circumstances, have vouchers to live here compliments of the county. There are many children, recovering and using addicts. The people are decent, but unaware that they deserve more than what they are given here. If you are seeking a place to sleep that is in close proximity to the downtown/UDistrict area and that is cheap, this is the place. It's interesting to say the least, safe enough (but you do have to be careful and aware) and you can shower.", "Date": "December 13, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "2.0", "Value": "1", "Location": "2", "Rooms": "1"}, "AuthorLocation": "", "Title": "“Swindle Inn”", "Author": "rollingstone206", "ReviewID": "UR118062110", "Content": "Well I have stayed here before and it seemed like a real nice atmosphere. It did have it's problems but the staff were making sure it was safe place. Now I recently went back and it said it was under new management. They raised the prices. Not good as far as customer service,there was blood on my sheets and I found a needle in my room with my newborn child. Not Happy!!!! I also overheard a man talking about his room hving bed bugs. As soon as I heard that it was time to go! If you want bad services, drug paraphernalia, expensive rooms rates and bloodon your sheets this iz tha place for you.", "Date": "September 13, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Location": "5", "Rooms": "1"}, "AuthorLocation": "", "Title": "“This is the Everskank Motel!”", "Author": "mzbeauty", "ReviewID": "UR117205169", "Content": "This is a bad place. I had stayed here a few times before a.d had no issues. I saw a sign that said under new management and figured i would try it again, Bad decision. Room was not clean and had a very bad smell. They charged way to much for the room to begin with. There was dirty sheets on my bed and I even had someone walk into my room. I stayed 45 minutes and drove up the street to another HOTEL! Room was cheaper and ten times nicer. DONT GO TO THE EVERSPRING!", "Date": "August 24, 2011"}, {"Ratings": {"Cleanliness": "1", "Sleep Quality": "1", "Overall": "2.0", "Value": "1", "Service": "1"}, "AuthorLocation": "Seattle", "Title": "“PRICE TOO MUCH!!!!!!!!”", "Author": "LilDJ", "ReviewID": "UR117203987", "Content": "Will I stay at the Everspring Inn the price was too much $75 for room and $15 for each person. I thing that is highway robbery!!!! Overall the hotel was not at all what it was suppose to be!!!! With new management!!!!!!!! P.S. If you have a crack friend the Everspring Inn is a good place to take her and bang her but I would recommend this for families. Don't let the quite fool you and if you don't believe me stay one night and check it out yourself. That's all folks!!!!!!!!!", "Date": "August 24, 2011"}, {"Ratings": {"Service": "2", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "1"}, "AuthorLocation": "Olympia, Washington", "Title": "“Should be the Everdump Inn”", "Author": "rockinman_10", "ReviewID": "UR78700497", "Content": "Worst hotel I ever stayed at. The carpet was covered with burns, the blinds were missing slats, a scary place.", "Date": "September 7, 2010"}, {"Ratings": {"Overall": "3.0"}, "AuthorLocation": "Seattle, Washington", "Title": "“Best Seedy Motel on Aurora”", "Author": "Squanx", "ReviewID": "UR68840791", "Content": "The Everspring is the best seedy motel in Seattle. The rooms are decent and clean enough, the price is negotiable ($50 seems to be the best rate available), the staff is friendly and attentive, and the building is secure. The problem is that the Everspring is dressed up to appear as if it should be compared to places like Days Inn, Travel Lodge, and/or Extended Stay, when in reality it's more closely related to The Orion, Seals, and/or Sunhill (which btw is owned by the same folks who own Everspring Inn). If cost is the main factor when deciding where to stay, then the Everspring Inn is the perfect place. Compared to all of Seattle's other motels, Everspring Inn offers the most room for your dollar.", "Date": "June 27, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "1", "Overall": "1.0", "Value": "2", "Sleep Quality": "1", "Rooms": "1", "Location": "2"}, "AuthorLocation": "Calgary, Canada", "Title": "“WORST. MOTEL. EVER. AVOID!!!”", "Author": "Jamz_TC", "ReviewID": "UR65205934", "Content": "The room was absolutely DISGUSTING! There were what appeared to be crusty semen stains literally EVERYWHERE, from the sheets, to the headboards, to the drapes, to the towels. It seemed as though the room had NEVER been cleaned! There was even an ominous dark stain, with drip marks leading towards the washroom, it looked suspiciously like blood. The noise level was ridiculous, and the price was essentially the same as the Ramada or the Travelodge, both places we would have stayed if there was any vacancy. We know now to plan ahead and book a room at a DECENT hotel/motel, and to avoid this dump like the plague.", "Date": "May 24, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Location": "3", "Rooms": "4"}, "AuthorLocation": "Seattle, WA", "Title": "“Diamond in the Rough”", "Author": "ssddsquad", "ReviewID": "UR48709978", "Content": "I live in Seattle with my boyfriend and sometimes we like to go out and spend one night a month in a hotel/motel just to shake things up for a night. But lately with the economy that hasn't been able to happen. Last month we sprung for a night at the Everspring Inn. Hadn't stayed there before, but we were cruising around Aurora Ave., saw it and decided to check it out. The parking lot was clean, we were greeted warmly, and there was coffee. So far so good. We got the nightly rate but it was a bit pricey at $65 so we were about the leave and the clerk stopped us and asked what we had in mind to pay! I'd never negotiated pricing before so I just threw a number out there. $45. She said she could do $50, so we took it. The room she put us in was a one bed room with a small kitchenette. Not too spacey but it was very clean. We had a wonderful, comfortable night that night and definitely plan on visiting again! Also, because our monthly escapades are known well among our friends, anytime someone asks for a recommendation, we always say the Everspring Inn!", "Date": "November 7, 2009"}, {"Ratings": {"Cleanliness": "1", "Overall": "1.0", "Value": "1", "Service": "1", "Rooms": "1"}, "AuthorLocation": "Vancouver,BC", "Title": "“Terrible!”", "Author": "A TripAdvisor Member", "ReviewID": "UR3262382", "Content": "This was a Terrible place. As soon as we got there some drug dealers attempted to sell us drugs. I feared for my child. We went in and locked the doors but we decided an hour later to get a refund and leave after we heard a gunshot in the room next door.. AVOID AT ALL COSTS!", "Date": "March 9, 2005"}], "HotelInfo": {"Name": "Everspring Inn", "HotelURL": "/ShowUserReviews-g60878-d122994-Reviews-Everspring_Inn-Seattle_Washington.html", "Price": "$89 - $109*", "Address": "<address class=\"addressReset\"> <span rel=\"v:address\"> <span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">8201 Aurora Ave. N</span>, <span class=\"locality\"><span property=\"v:locality\">Seattle</span>, <span property=\"v:region\">WA</span> <span property=\"v:postal-code\">98103</span></span> (Formerly Seattle Villager Lodge)</span> </span> </address>", "HotelID": "2515370", "ImgURL": "http://media-cdn.tripadvisor.com/media/ProviderThumbnails/dirs/16/44/1644fbb1f60fab05af2db13ef08bb2fe1large.jpg"}}