{"Reviews": [{"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Chelmsford, MA", "Title": "“Great Staff and Sparkling Clean Room”", "Author": "Musiclover9", "ReviewID": "UR127818553", "Content": "The staff here is superb! The room is comfortable; it's great to have full kitchen facilities. The location is convenient. The snacks and breakfast (included) were abundant. There is a free business center in the lobby. The pool is small, but warm! The exercise equipment was fine. This is an extraordinarily good value!", "Date": "April 13, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Buffalo, NY", "Title": "“Awesome experience at Residence Inn, San Diego (Gaslamp)”", "Author": "Ludovic R", "ReviewID": "UR127623380", "Content": "My wife and I spent 7 nights at this downtown hotel (during a business/pleasure trip). From the moment we checked in, we felt very comfortable. The entire staff, especially Anita S., was friendly and very helpful. They provided tons of recommendations (restaurants, transportation and must-see local attractions such as Balboa park and La Jolla). The room was very comfortable too-with a fully equipped kitchen and free wired / wifi internet. Also included is a buffet breakfast which increased the value of our stay. The pool and gym facilities are not big but it is convinient to have them on site. This is by far my best experience ever at a Residence Inn hotel. I would highly recommend this place to anyone on business, leisure and family trip.", "Date": "April 10, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "california", "Title": "“Perfect Downtown San Diego Hotel”", "Author": "movingeast3", "ReviewID": "UR127591817", "Content": "My family and I just spent 2 weeks in southern California, staying at 4 different hotels. This was by far the best hotel we were in. It was clean, the staff was very helpful and friendly, and it was quiet! The daily breakfast and dinner on 3 nights was a nice bonus, in addition to having a kitchenette in the room. It is very conveniently located to the convention center, Petco Park and the trolley and trains. I would recommend staying here to anyone traveling to downtown San Diego.", "Date": "April 10, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Anaheim, California, United States", "Title": "“Kelly and the Residence Inn, San Deigo - Gas Lamp Save my family vacation!!”", "Author": "Valerie P", "ReviewID": "UR127570273", "Content": "Our vacation was saved from total disaster yesterday...Easter. I'm a former Marriott employee, Marriott credit union member, Marriott rewards member, Marriott vacation club owner and a very frequent business traveler. To say that I have high expectations of Marriott (the brand) is an understatement. This means I expect the same general look, feel and servcie, across all brands. I realize that the different products speak to a different demographic, but when you pay 100,000 points for a San Diego Residence Inn that has the look, feel and smell of a cheap motel, something has gone really really wrong. This location, the one we moved from, off PCH was awful and my 9 year old said it smelled like rotten eggs. It did. One look at the tiny space (called a 1 bedroom suite) told me we were being \"punk'd\". I immediately called Marriott reservations and reached out to the \"residence inn's\" management for an immediate change. Gratefully, there were other Marriott properties available in the area, but unfortunately, none were at the same points or room type. When neither, Marriott reservations or the Residence in on PCH could help, I called the Residence Inn in the Gas Lamp Quarter and spoke with the most helpful, empathetic and professional Marriott employee, I've ever had the pleasure of begging for help. Kelly Montes (guest services rep) took me seriously and got right down to helping me solve my problem. Not only did she make things happen quickly, she went above and beyond by working with Marriott Reservations and the other Residence Inn, in order to get my points (all 100,000) transferred to the their location, for the same room type (the REAL thing). This Easter Sunday was looking to be a long and disappointing day, but Kelly made everything work for me and my family and we are truly appreciative and grateful for her efforts to make something so wrong...right. Thank you Kelly!", "Date": "April 10, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "La Jolla", "Title": "“Our Getaway in Downtown San Diego”", "Author": "Nancy T", "ReviewID": "UR127194839", "Content": "I have stayed in many Marriott hotels but this was the first time for a Residence Inn. The location was great, but what was amazing was the staff, from the valet parkers at the entrance to the front desk (Cathy Schultz could not have been nicer or more helpful), to the manager who came up to our room personally to move us to the type of room we had requested . And then Cathy called us to apologize for accidentally giving us the wrong room number! Our room was Marriott great, with all the amenities you expect and then some. We hope to go there again whenever we need a getaway.", "Date": "April 3, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Deep River, Connecticut", "Title": "“Great location ! Great hospitality !”", "Author": "Greg A", "ReviewID": "UR127147792", "Content": "I spent 5 night here for a large show at the Convention Center. The location is excellent being 5 minutes walk away. It is at the lower end of the Gaslamp District so there are plenty of restaurants close by. This quality of this Residence Inn was the best I have ever visited. The front desk staff were excellent, with quick service, great dinner recommendations, and always a smiling and pleasant. The rooms aremoderate sized, but plenty of space to work and relax as needed. The bed was especially comfortable, The breakfast has a nice varity, to please everyone. I will surely return here for our convention next year ! Overall, this hotel is very much a smaller \"boutique\" style and you really feel welcome and appreciated.", "Date": "April 2, 2012"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "1"}, "AuthorLocation": "Los Angeles, California", "Title": "“Worst Hotel in SD”", "Author": "Jenna P", "ReviewID": "UR126939976", "Content": "Worst hotel experience of my life... The staff was incredibly rude. Nothing worked in the room. We cooked breakfast in the room’s kitchen and got a $250 smoke fee charge which I am still disputing. The worst part is that I staid on my b-day and couldn't even enjoy my day. They kept harassing us and leaving us voicemail messages on our hotel phone. If you are thinking about booking a room at this hotel I would advise you to think again.", "Date": "March 29, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "new york city", "Title": "“Outstanding!”", "Author": "NewYorkCityAlex", "ReviewID": "UR126887492", "Content": "I have just returned home after five nights at the Residence Inn and I am happy to recommend it to you. The staff is great - including the people that worked the breakfast room. They were always busy but didn't hesitate with a pleasant \"good morning\" and a smile. And breakfast was excellent. Wide variety of items that were well prepared. I have to single out Nikki at the front desk. She gave me the quiet room I requested without hesitation and understands what \"hospitality\" means in the hospitality industry. The room was impeccably cleaned every day. It is in a convenient location. It's all good. Stay there!", "Date": "March 28, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Cleveland, Ohio", "Title": "“Fantastic Hotel and Staff”", "Author": "Robert G", "ReviewID": "UR126488766", "Content": "My company had our group stay here for a convention and the hotel and staff are excellent. One of the nicest Residence Inn's I've stayed at! Nice variety for breakfast. The entire staff is very courteous and helpful! Our entire group had a terrific stay. Great location in the Gaslamp Quarter.", "Date": "March 22, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "porto alegre,brasil", "Title": "“best hotel for meetings”", "Author": "pecinha", "ReviewID": "UR126487398", "Content": "really surprised with this hotel, 2 blocks from convention center,very well runned and the concierge was rate 10 because of the great attention from kelly and cathy. they really make the difference, always smillig (wich is rare in chain hotels), they gave us great hints for restaurants etc..., only one \"BIG PROblem\": when i was entering the elevator two dogs (size of a small horse) with their owner. form that time on I was thinking that dogs like those could have been walking on my room carpet and that's disgusting. they shouldn't accept pets like those.very good breakfast included in rate.", "Date": "March 22, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "New York", "Title": "“Great hotel. Amazing staff.”", "Author": "Natalia M", "ReviewID": "UR126363291", "Content": "I love the design and the decor of the hotel. Rooms are spacious and nicely decorated. Staff is friendly and helpful. Breakfast was excellent. Location is great. I definitely recommend this hotel and I will stay here again.", "Date": "March 19, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Costa Mesa, California", "Title": "“I would pay double the valet fee!”", "Author": "Carrie K", "ReviewID": "UR126214722", "Content": "The first impression is always the most important thing in a business. Generally starting with a phone call but these days reservations are made online. So with that said our first impression started with the valets AMAZING! My door was opened with a big smile and greeting, our bags were unloaded and taken inside and things just kept getting better. Front desk service is fantastic, rooms are impeccable, and the breakfast is not bad for a buffet. When we phoned for our car it was waiting for us curbside EVERYTIME and the valets had great recommendations for restaurants. We love this hotel and hope to stay here on every business trip.", "Date": "March 17, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "LA", "Title": "“Excellent place”", "Author": "AHM", "ReviewID": "UR125957143", "Content": "Attending a meeting at convention center with family including two kids. This was a very well run and maintained property. Excellent staff from valet to practically everybody else we interacted with. It is new'ish and clean. Smack in middle of gas lamp area but not the noisy part i.e. it is a block away. It is 5 min walk to convention center. I had a AAA package which included valet parking. I did not try it but the family said the breakfast waffles and everything else there were excellent as well. The only reason I did not give it a 5 was because the rooms are much smaller than expected from my past experience with the brand. But I still highly recommend it if visiting with kids or for longer stays if you want to have a kitchen. I would not recommend it if you are traveling with more than one kid and plan on staying more than two nights because it is too cramped for that long since you have to open the sofa bed.", "Date": "March 11, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "St. Louis, MO", "Title": "“Best Overall Marriott stay ever”", "Author": "auntpp", "ReviewID": "UR125943777", "Content": "Special thanks to Maria Elena - my 9th floor housekeeper (room 904) who took special care of me all week. Made my long stay so comfortable. Staff at this hotel is fantastic!", "Date": "March 11, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "4", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Columbus, Ohio", "Title": "“San Diego trip.”", "Author": "Victoria S", "ReviewID": "UR125596088", "Content": "Me and my family went to San Diego for a family trip. We stayed at this Marriot and it was just fabulous! the beds where very comfy and the room had everything we needed to feel at home. We will definatly stay here again sometime. I also want to add that the breakfast was simply amazing! It was everything I had expected and more! Well done!", "Date": "March 4, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Idaho Falls, Idaho", "Title": "“Awesome Stay”", "Author": "doopysmiles3", "ReviewID": "UR125574026", "Content": "We stayed at the Residence Inn Gaslamp on a long weekend. The staff was very helpful. Nikki was able to check us in early when we got into San Diego earlier than planned. Cathy made dinner reservations for us. The only downside of the stay was a little bit of street noise that I'm sensitive to. As always, Residence Inn has a great breakfast. All in all it was a great trip. I plan on staying there again when I'm back for business.", "Date": "March 3, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "ohio", "Title": "“Great location!”", "Author": "ChrissyOhio", "ReviewID": "UR125046515", "Content": "Arrived Saturday and got lucky with street parking. We did not pay for valet during our stay. We called earlier in the day to request a king bed. We were not able to select that online. They said they noted our request. At check-in we were told that they only had queens available. If we had been staying more than 2 nights this would have been a big problem for us but the check-in staff was very friendly. The room was very nice. The layout of the room. was a little strange. The bathroom sink is right next to the bed outside of the bathroom door. The breakfast selection was very nice and the staff was very attentive and cleaned up the tables after people were finished very quickly. Very nice stay. Really glad we had the car to explore more of the area. Ocean Beach, Old Town, Balboa Park and Little Italy.", "Date": "February 22, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Pierre", "Title": "“We had a great stay.”", "Author": "Brian L", "ReviewID": "UR124964742", "Content": "Great people at the desk. Good value for our money. Convenient location to explore the Gaslamp Quarter and the San Diego Zoo. We would stay there again.", "Date": "February 21, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Ventura, California", "Title": "“Well rounded!”", "Author": "Joelcjr", "ReviewID": "UR124884485", "Content": "Love the conviniance, location, and amenities. My wife and I came to sandiego to celebrate our 8 year wedding annaversary. So many restaurants with in walking distance. We took the train. It was EZ to get around.", "Date": "February 20, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Ann Arbor", "Title": "“Clean and comfortable”", "Author": "terri9AnnArbor", "ReviewID": "UR124834381", "Content": "Didnt expect this property to be so nice. Good staff, good location, great accommodations. Was crowded at breakfast time, tho, but that was the ONLY negative. We solved this by hitting breakfast earlier the second morning.", "Date": "February 19, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Doylestown, Pennsylvania", "Title": "“Outstanding hotel and conference center”", "Author": "Kurt M", "ReviewID": "UR124723327", "Content": "This Residence Inn in the heart of the San Diego Gas Lamp district is an outstanding place to stay or to have a business conferences. The rooms and the facilities are new and modern. Great bar to hang out in the evenings and you are right in the heart of the gas lamp district that has ample restaurants, clubs, and shopping. The staff are the friendliest I have ever encountered. We held a conference at this location and everything went great. Ruby the Events Coorindator went to the extreame to make sure everything was great. I would definitely go back to this hotel again for vacation or a business conference.", "Date": "February 17, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "1000 oaks, ca", "Title": "“Great Service!”", "Author": "flyn2lax", "ReviewID": "UR124503943", "Content": "Nicki at the front desk started our visit out with a smile and never stopped amazing us with her personality and kindness. We were allowed to check in early and shortly after checking in we received a knock at the door with a personalized letter welcoming us and wishing me a happy birthday with her desire to hear all about our adventures. The valets were very personable, and nice. Each of the employees that we encountered took the time to say hello. The breakfast crew in the mornings were efficient and welcoming as well. The breakfast offered something for everyone with hot and cold dishes available. The pool area was nice, although there is no jacuzzi. The rooms were very nice, but the sliding doors of the bathrooms were able to be heard from one room to another. The sink area was more suited to a single person. the kitchen was well equipped and even came with microwave popcorn. The location was perfect for exploring Gaslamp, the Embarcadero and Seaport Village. Overall, this was a fabulous experience with a lot of it due to Nicki and her warm and inviting welcome!", "Date": "February 12, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Tucson, AZ", "Title": "“Great hotel in a wonderful location”", "Author": "AZgolferMom", "ReviewID": "UR124256446", "Content": "We spent a long weekend here at this hotel. It was clean, had friendly staff and was in a perfect location near the water. We rented a one bedroom suite that had a queen size bed. We had asked for a king but the queen was fine. Our flight arrived in San Diego early in the morning and when we arrived at the hotel at about 8:30 AM, they had a room available and we were able to check in early. They even were still serving breakfast that we were invited to enjoy. Since we checked in early, they did not have a chance to make our room feather free but in a few minutes after we arrived, they sent someone up to change out the pillows. I celebrated my birthday while we were there and my husband had the front desk arrange for roses to be placed in our room. They took care of everything and the roses were perfect. We opted out of housekeeping service over the weekend and just exchanged our dirty towels for clean ones. The housekeeping staff was swift and very helpful. The kitchen in our room was perfect and lacked nothing. This Residence Inn was great and I would suggest you take advantage if you have the opportunity to stay in the Gaslamp District of San Diego.", "Date": "February 7, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Irvine, California", "Title": "“Great location & upgraded room”", "Author": "Annew1217", "ReviewID": "UR123989583", "Content": "We were in San Diego & stayed one night & asked to be upgraded to a one BR suite (Platinum member). Friendly front desk person at check-in. The location is near the Gas Lamp district & we walked to the marina & Sea Port village. The room was spacious enough with a sliding door to separate the living room. Dark wood furniture which made it modern & cozy. Small kitchen included. Clean and well appointed. Wonderful breakfast buffet included. The waffles were delish! Parking is $35 but we were able to find street parking on Sunday (free). We were on the side where there is a club & on Sat. night you can here the music from our room, however, we were watching tv late into the night so it didn't really bother us. We used the gym, but not the pool. They have 2 elipticals & 2 treadmills with tv viewing on each machine. This hotel is fairly new. We enjoyed our stay.", "Date": "February 1, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "4.0", "Value": "3", "Sleep Quality": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "montreal", "Title": "“Comfortable stay in downtown area”", "Author": "rexbo", "ReviewID": "UR123859914", "Content": "Decent room, although showing somehow unusual settings, with the sink and vanity mirror between the bed and the wall mounted tv. Great location, in walking distance from everything downtown. Parking tip: for those who find the hotel valet parking a little on the high side, there are overnight public parkings on the 6th, 2-4 minutes walks away. In the ACE PARKING across the street at 298 on 6th, I paid $13 for one night, 9 for 2nd, and 11 for the 3rd night. The hotel internet connection range does not fully cover the gym area:( There are two treadmills, two elipticall machines and a byke in the small gym area, which can get very crowded in the morning:( Be prepared to pay $3/page, if you want to send a fax from the hotel.", "Date": "January 30, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Washington DC", "Title": "“Nice stay during quiet season”", "Author": "apodis10", "ReviewID": "UR123458165", "Content": "I stayed here 4 nights (Monday-Friday) during what was probably a non-convention time. The hotel was mostly quiet and restaurants weren't packed. I think this probably made a (positive) difference. Check-in was very quick as was check-out. Staff was friendly. The hotel, as others have mentioned, is quite new. The hotel was well situated to shopping, good dining and the obvious, convention center and ballpark. There is a CVS 2 blocks down which was nice for things I forgot to pack and didn't want to check if the hotel had any. My room was very nice. Clean, well laid-out. I only made use of the kitchenette for the refrigerator. It is a full sized refrigerator. The dishes, pans, utensils, etc. were ample. The bathroom was impeccably clean noting that the the sink is outside of the sliding bathroom \"door\". I had 2 (non-opening) windows in my room. The bed was reasonably comfortable. My colleague's room was slightly different in layout but not by much. His room was also impeccably clean and tidy. Internet wasn't charged which is nice since the Marriott across the street and, well, basically all other nearby hotels charge for it. I saw other guests at the computer terminals in the lobby though I didn't personally take part. The breakfast was fairly standard. My colleague and I ate there once but decided to try local restaurants for the other breakfasts. We didn't partake of the happy hour. I noticed that in the room, you can make a grocery list and they will shop for you (plus a convenience fee) which I thought was kind of neat. The valets were very quick. They always opened the doors for the passengers. The car was always quick to arrive. They even began to know our faces so they didn't need to ask for the tag. $35/day for parking is a little ridiculous even though it is the regular price anywhere nearby. I can't really blame them for keeping up with the Jones's. There is not a self-parking option. I used the coin laundry not the send-away laundry option. It was convenient. There were probably 6 washers and 6 driers. The change machine didn't work but the front desk was able to give me change. My only complaint with the laundry was that I had NO idea how long the drier was going to take. Some of the machines had timers on them but many did not. I certainly wasn't going to wait around until it finished but I really didn't know when to come back. Since no one else was using the machines at the time, it wasn't a big deal that my laundry hijacked a machine after finishing and before I returned. The workout room was clean and stocked. There were towels, antibacterial wipes, lotion and water. There were TVs on the (2) treadmills and (2) ellipticals in addition to one on the wall for people who were weightlifting. It is a small hallway with windows on either side. I served its purpose and was more than I have had at other similar hotels. The only complaints I had were minor. First, as others have noted, the walls are paper-thin. Inside walls and outside walls. So, in addition to the sirens outside (not often), I could easily hear my neighbor up puking all night. Fortunately, (s)he only occupied the room that 1 night. Because the hotel wasn't fully occupied, the sounds of doors opening/closing wasn't a big deal. If it had been full, I would probably have been driven crazy by the noise. The second complaint was that the hotel staff didn't know much about some of the restaurants nearby. When I asked for recommendations, neither the staff at the front desk nor the 2 valets could give me a recommendation. I was asking about 3 different restaurants and none of them had been to any of those 3. It is very helpful as an out of town guest for the hotel staff to have at least visited the restaurants within walking distance (3 blocks even) so they can make personal recommendations. Again this is a very minor point. The third complaint I had was that you had to use your room key to get anywhere in the hotel. You had to insert it to take the elevator up/down. You had to use it to get into the pool area and again to get into the workout room. It became a hassle, especially when my room key wasn't keyed well, so it sometimes took 5 tries for it to register. I finally took the key to the desk and got a replacement. The only other minor thing to note is that there is a small place for smokers. It is immediately when you leave the 3rd floor headed out to the swimming pool. So, you have to walk past the billows of smoke to go to the pool or workout room. Overall, it was a very pleasant stay. I typically only stay at Hiltons or Hilton chains (Embassy Suites or other). This was my first stay at a Residence Inn and I was delighted. I will consider these in the future. I would also stay at this hotel again.", "Date": "January 22, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "3", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "San Francisco, California", "Title": "“One of the nicer Residence Inns with a great location”", "Author": "Heckler987", "ReviewID": "UR123411081", "Content": "My wife booked us here over the holidays and honestly I didn't expect too much because I've stayed at a few Residence Inns and most of them have been very basic and are usually in an out of the way location. I was completely surprised. The hotel seems brand new and modern, with a very nice room. Even the little kitchen area is modern and nicely integrated into the room. The hotel is in the Gaslamp District with tons of restaurants and bars within a few blocks. The lobby was very nicely done and modern. Everybody we dealt with in the hotel was helpful and courteous. We went to the lobby bar both nights and the staff there was great. The hotel has a a free breakfast in the morning that not only has the usual high carb/high sugar cold items, but some hot items like eggs and potatoes. They also had fruit and yogurt. It was a pretty nice spread. The days we stayed there were some large families with kids who did a pretty good job of eating just about everything in sight and would leave everything a mess. The staff did a wonderful job of keeping everything stocked and clean. The only things I think I could complain about were how expensive it was to valet park and have our dog stay with us. The parking issue isn't totally their fault. It is a city and parking is always a premium, but $20 day is pretty steep. I went to see how much it was in the garage next door and pricing seems to vary on what day and what time you come in, etc. so I didn't bother. It's great that they are dog friendly and we even got to have our dog sit with us in the lobby bar area near the fireplace. $100 is pretty steep for a non-shedding, well behaved, seven pound dog and I'm sure it's pure profit for them. You can't tell me they had to clean any more than usual. When I complained they reduced it a little, but still it's a bit much. I really like this place and I'll gladly stay there again next time I'm in town.", "Date": "January 21, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "3", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Indianapolis, Indiana", "Title": "“Superb location, helpful staff, surprisingly nice rooms”", "Author": "Travelin_JC", "ReviewID": "UR123107421", "Content": "I stayed one night for business. The location is central to the Gaslamp District, with restaurants and bars three short blocks from the hotel. The staff treated me like royalty. With an upper-floor location and pool view, my room was large, quiet, and nicely-furnished. I would recommend this hotel to everyone, and stay here again in the future.", "Date": "January 15, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "New Jersey", "Title": "“Great hotel in Gaslamp Quarter”", "Author": "RoyU", "ReviewID": "UR122537246", "Content": "My wife and I went on a quick 1 week vacation to San Diego. We stayed 3 nights at this hotel at the beginning of our trip, left travelling for 2 nights and then returned for our last night before flying out. The front desk staff was extremely courteous and professional. They made is really feel at home and were very helpful in all regards. I got a great AAA rate when I booked online not expecting too much. On arrival and check in I felt I had hit the jackpot. This hotel has a simple but elegant feel. Our suite was comfortable and clean. The exercise facility and pool area were well maintained and perfect for our purposes. We never made use of the lobby bar but others seemed to be enjoying it. The daily, included breakfast, exceeded our expectations with hot scrambled eggs, potatoes & meats. Additionally there was assortment of cereals, yogurts, breads, juices and coffee. There was always a selection of fresh fruit too. The location is right in the middle of the trendy Gaslamp Quarter with scores of restaurants, bars and shops in the immediate area. It's a short walk to the convention center and has easy access to buses and the tram for longer trips. Even though it was in a busy area it was very quite in our room. I would definitely stay here again - especially if I got the great rate again!", "Date": "January 4, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Honolulu, Hawaii", "Title": "“Great location”", "Author": "ITravel4Business_12", "ReviewID": "UR122433458", "Content": "Parking is downside of hotel. Other than that everything else was fabulous. The location was a plus. Breakfast was a nice touch and the food kept coming.", "Date": "January 2, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "3", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Santa Barbara, California", "Title": "“Great value in the heart of the Gaslamp”", "Author": "Desertdiva24", "ReviewID": "UR122383574", "Content": "This hotel far exceeds other Residence Inns. It has an excellent location: right in the heart of the Gaslamp District, and is modern, clean, and has a friendly staff. The hotel has valet parking, but you can park right across the street for at least $10 less (lot only accepts cash payment). The rooms are modern and clean. I had a Queen-sized bed; I'd make sure you get a King. They offer all the kitchen amenities as well. Free breakfast and weekday evening snacks are also a plus and a great incentive over other hotels. The breakfast offers eggs, potatoes, oatmeal, bagels, cereal, yogurt, fruit, etc. The gym and pool are located on the rooftop of its third floor. The gym is small, but overlooks the crowds in the Gaslamp and each cardio machine offers its own tv. I will definitely stay at this hotel again. It offers a great value over others in the area.", "Date": "January 1, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "New York City, New York", "Title": "“Beautiful hotel, great location and a friendly staff.”", "Author": "NYtraveler247", "ReviewID": "UR122340709", "Content": "Everything about my stay at the Residence Inn was amazing. My sister and I were visiting San Diego in November. We choose the hotel for it's great location and closeness to the convention center, which was only a 4 block walk away. From the beginning the staff at the hotel was friendly and helpful. The bell boys, front desk staff, maid service and morning breakfast staff all made our stay at the hotel amazing. The area in itself was also great. The Gas Lamp is a busy area with numerous restaurants for eating and stores to shop in. In the evening many of the homeless come out, which makes the area seem a little seedy, but I've heard this is the case all over California. We arrived at the hotel early for check in, but the staff was happy to give us a room. We had booked a King bed, but our room had a Queen. When we mentioned this to the staff they were more than happy to change us to a room with a bigger bed. The rooms themselves were beautiful. From the decor to the kitchen, which had every tool and device I could ask for, the room was contemporary and comfortable. Being from NY I can tell you that the entire room would be the envy of any resident used to small apartment living. One of the other reasons we chose the hotel was for the morning breakfast that was included. I had to arrive early at the convention so I didn't want the hassle of trying to find someplace to eat. I was pleasantly surprised at the diversity of the food that was offered. They had different types of hot/cold cereal, breads, hot eggs, sausage and a waffle maker so you can custom make your own waffles. Of course, coffee/tea and various juices. All presented in a very clean and pleasant atmosphere, albeit a little small for the number of people that were staying at the hotel. At the end of our stay, checkout was a breeze. I had an early morning flight to catch and had to leave before breakfast. When I inquired about where I could get breakfast before leaving they told me not to worry. The breakfast attendant was there and he made me up a box of food to take with me on my trip home. It was so very nice of them. If I return to San Diego I will definitely be staying at the Residence Inn again.", "Date": "December 31, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Ft Worth", "Title": "“Great Hotel in Great Location”", "Author": "Sandshell", "ReviewID": "UR122255778", "Content": "This is the nicest Residence Inn I've ever stayed in. Beautiful lobby and friendly, helpful staff. Room was comfortable and had everything we needed. Hotel is within walking distance to all the Gaslamp Quarter has to offer. Free breakfast was great!", "Date": "December 29, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Newington", "Title": "“\"Great Location\"”", "Author": "Dana W", "ReviewID": "UR122246648", "Content": "I recently stayed here for one night and was pleasantly surprised on how nice the room was and you couldn't ask for a better location if you want to explore the many bars and restaurants of the Gas Lamp district. Everyone at the hotel was very nice and were happy to point you in the direction of a great restaurtant. I would definately stay here next time I am in San Diego.", "Date": "December 29, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Indian Rocks Beach, Florida", "Title": "“Outstanding staff”", "Author": "Bill M", "ReviewID": "UR121855959", "Content": "The entire staff had a \"can do\" attitude toward every request, including housekeeping, the staff in the second floor breakfast/happy hour area, the front desk, and the doormen. Everyone was extremely friendly and professional. Location is good - in the downtown Gaslight district and close enough for us to walk to the ferry to Coronado. Excellent property.", "Date": "December 18, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Encinitas, California", "Title": "“Home Run”", "Author": "Elizabeth S", "ReviewID": "UR121473211", "Content": "We used the Residence Inn Gaslamp as one of the room block hotels for the weekend of our wedding, and I could not be happier with the decision. The staff was courteous and helpful to all of our guests, the rooms and common areas were lovely, and the location is incomparable. It's such a relief to deal with a business (hotel or otherwise) with a culture of professionalism--it is clear that customer service and quality of presentation are a serious priority at Residence Inn Gaslamp.", "Date": "December 6, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Richmond, Virginia", "Title": "“WILL COME BACK!!”", "Author": "Silvia P", "ReviewID": "UR121099826", "Content": "The location is great. Walking distance to many2 things. Restaurants/stores/mall. Complementery breakfast and evening snacks on Monday, Tuesday, Wednesday. The room is nice and big, with kitchen, large fridge, microwave. Sliding door to the bathroom with lock. in terms of design it's very different compared to all the residence Inn, I have stayed in. Friendly staff during breakfast and evening snacks, don't forget to tip them a few bucks will make their day. Valet will cost $35, but it's no secret since they tell you that on their website. You can find alternative parking, as long as you don't go in and out. We parked our car next door for $15 for the night, and we went places during the day, so it worked out perfectly. There are so many meter parking too. If you are coming with your family this hotel would be spacious enough, plus there is a sofa bed. The pool is on the rooftop, so we didn't use because it wasn't warm enough, even when the water is heated. Overall a great hotel, and only a few miles away from the airport.", "Date": "November 27, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Zevenbergen, The Netherlands", "Title": "“Good hotel.”", "Author": "Jan V", "ReviewID": "UR120529697", "Content": "Good hotel in the Gaslamp quarter. Rooms were big and clean. Hotel staff was helpful and friendly. Valet parking for 35 USD a day. Breakfast is complementary and was very good. There's a swimmingpool and some fittness equippment on the 3rd floor. Lots of stores and restaurants in the area and the San Diego convention center is within walking dinstance (5=10 minutes).", "Date": "November 13, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "California", "Title": "“A great gaslamp hotel”", "Author": "cabogolf19", "ReviewID": "UR120388042", "Content": "I have stayed here several times and always find this property a great choice. Despite its location in the heart of the Gaslamp, you’d be surprised how quiet the property is even on the busiest of weekends. If you are going to be in town for more than a couple of nights, you’ll appreciate the fact that each room at this hotel has a fully equipped kitchen. As a frequent visitor to San Diego and the Gaslamp in particular, when I get burned out on local eateries, I can walk to Ralphs, pick up a few groceries and stay in for dinner. Each time I have stayed here, the staff has been friendly and helpful from the time you reach the front door until checkout. You’ll also enjoy the breakfast each morning included with your room rate. You should definitely consider putting this hotel in your rotation when traveling to San Diego.", "Date": "November 9, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Stateline, Nevada", "Title": "“We'll be back”", "Author": "sunnski", "ReviewID": "UR120362960", "Content": "Stayed for five days. Nice room with filtered views of the bay. This is in a good central location to the Gaslamp area, waterfront and convention center along with Petco Park. Staff very friendly and knowledgeable. Lobby clean and modern. Check in was easy. They have complimentary meal service in the evenings only on M-T-W. I know this is an extended stay hotel but I think it needs to be on Thursday too. Full breakfast served seven days a week. I had bagels and yogurt. But there were eggs, cereal, juices, fruit etc if you like breakfasts. Rooms were clean. Maid service was OK. Didn't clean the toilet at least one time. But there is a full kitchen to use if you want to cook. I would stay here again without hesitation. Elevators were quick. Rooms were quite and AC worked well.", "Date": "November 9, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "New Orleans, Louisiana", "Title": "“Above the high standard for a Marriott”", "Author": "acoulter", "ReviewID": "UR119123753", "Content": "I selected this property based on Trip Advisor advice. I was Not disappointed. The room was commodious and clean. The fitness center was adequate but everything was operational. Breakfast was hot and well-prepared. The staff are typical Marriott-trained and very courteous. I will definitely stay here again.", "Date": "October 9, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Location": "5", "Rooms": "3"}, "AuthorLocation": "", "Title": "“Great location, not so functional.”", "Author": "Ogilviesonthego", "ReviewID": "UR119109066", "Content": "We booked this because of an extended stay in San Diego and wanted a kitchen. The location can't be beat. And the staff were wonderful and friendly. We ended up not really using the kitchen since space was limited. We'd like to also be able to open windows and our temp in our room was never right no matter how much we tried to adjust it. We would also appreciate a hot tub in the pool area! If you just need a hotel room and want to be in Gaslamp you probably can't beat this.", "Date": "October 9, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Location": "3", "Rooms": "4"}, "AuthorLocation": "melbourne", "Title": "“Solid choice in gas lamp quarter”", "Author": "vicsze", "ReviewID": "UR119071917", "Content": "Good location -short walk to everything, good size rooms & very good service. A couple of areas the hotel could improve on are (1) buffet breakfast. The room resembles a mess hall rather than o hotel restaurant & thefood was just edible. At least it was included in the rate. (2) TV - dominated by news & sport channels, very difficult to find something to watch. I can only assume that this hotel is mainly servicing a business clientele.", "Date": "October 8, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Rockville, Maryland", "Title": "“What a wonderful experience!!”", "Author": "Sandy B", "ReviewID": "UR119021484", "Content": "I booked a block of rooms for myself and some of my co-workers. Ruby Grieme was amazing, with all my shifting and changing arrangements up to the last minute. Even with all of the changes everything went smoothly. Upon arrival we were greeted with amazing, professional and friendly staff. The rooms were awesome, the hotel was pleasant and immaculate, and we could walk to all of our different destinations. The highlight for me were the wonderful Valet Team Members. Every one of them was pleasant, professional and really made you feel good when you returned to the hotel. I would like to especially thank Tony Heath, one of the shift managers, who always had a great smile and pleasant greeting whenever I saw him. The Manager of this hotel has a wonderful staff that he should be proud of. I will definitely stay here again if I ever return to San Diego. Thank you everyone.", "Date": "October 7, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "", "Title": "“Great location, great service, great time”", "Author": "MicheleKL", "ReviewID": "UR118758568", "Content": "We were recommended to this hotel for a weekend event we were attending in the Gaslamp Quarter, and we are so glad we stayed here. The location was fantastic-- within very short walking distance to Petco Park, the convention center, tons of great restaurants, shopping, movies, and Horton Plaza. And the Gaslamp Quarter is hopping in Friday and Saturday nights... just like you see in bigger cities like Chicago and New York! The hotel is fairly new, was very clean, and the staff was very friendly. There is a gym with a couple of elliptical machines, a couple treadmills, a bike, and a free weight set, and it overlooks 5th street below. The pool, only 3 feet deep, is on a rooftop and next to the gym. The room was well-laid-out but cozy with a bed, small couch and flat-screen TV that moved around, a little kitchen (and they offer to do your grocery shopping for free!), and dishes and utensils for your use if you decide to cook in the room. (Again, there are tons of great places to eat nearby... kind of hard to resist!) We would definitely stay here again. The regular rate for the room was $500 a night, according to the placard on the door... kind of steep, but we got a deal with the group we were with... and so for a similar rate up to $250/night, I would definitely stay here again.", "Date": "September 29, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Los Angeles, California", "Title": "“Nice hotel with friendly staff!”", "Author": "skamikirn", "ReviewID": "UR118679333", "Content": "1st time staying here and was very impressed. Located in the Gaslamp district and within walking distance from everything - Petco Park, Convention Center, plenty of restaurants, bars, theater, Horton Plaza. Also very close to San Diego Zoo and the museums. Everybody was so friendly from the valet staff to the front desk to the housekeeping. Rooms were very clean which included a kitchenette - fridge, stove, microwave, plates, cups. Widescreen TV was offcenter from the bed which I thought was interesting, but it was adjustable so it wasn't bad. Don't know if it's like that for all the rooms though. Had a view of the pool (located on the 3rd floor) which looked small and the gym. Comfy bed, shower no tub. Internet is free as well as the breakfast buffet from 7a-10a on the 2nd floor. They serve scrambled eggs, potato pancakes, biscuits and gravy, oatmeal, waffles, yogurt parfait, cereal, bagels, toast, fruits, juice, coffee (am i missing anything?). There is a bar in the lobby called Barvie. Didn't get to check it out. If you're an elite member, you get complimentary chips and salsa from the bar. The only downside to this hotel is the mandatory $35 a day valet. You really can't get away from it unless you park elsewhere. Will definitely stay here again.", "Date": "September 28, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Redwood City, CA", "Title": "“Great place to stay in the Gaslamp”", "Author": "davidbh1453", "ReviewID": "UR118588844", "Content": "Stayed for one night. Super clean room. Seemed brand new. The sink was oddly placed but that's just a nit. Very comfortable bed. Delicious full breakfast buffet, 'til 10 on weekends! Free Internet. Highly recommended if you want to be in the middle of the fun in San Diego. Near the ballpark as well.", "Date": "September 25, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Lumberton, New Jersey", "Title": "“In the center of it all”", "Author": "jmarone1969", "ReviewID": "UR118358588", "Content": "Great hotel. During power outage bar stayed open thanks to generators! Power was supplied in the lobby area as well, people from all over Gaslamp were there powering their laptops and cell phones. Hotel staff was fantastic! Only knock is that it would be nice if you can crack the windows open a bit to get some fresh air in the rooms instead of having to rely on the A/C or heat.", "Date": "September 20, 2011"}, {"Ratings": {"Location": "5", "Overall": "5.0", "Value": "5", "Service": "5", "Rooms": "5"}, "AuthorLocation": "No. San Diego County", "Title": "“This is the place to stay if going to Petco Park”", "Author": "sulphursister", "ReviewID": "UR118234398", "Content": "We stayed at the Residence Inn Gaslamp for one night following a Padres game. Very close to the ball park. Got a screaming deal on the room via price line.com. $179 for a queen city view room. Room 1402 (top level) has view of convention center, Coronado, downtown, Point Loma and even the Bay through the buildings. NICE! Has a pullout sofa bed, full size fridge, well equipped kitchenette. Really nice buffet breakfast included...eggs, bacon, sausage, etc...not the typical continental breakfast fare. Pay parking. Best value for a nice hotel in the gas lamp. There is no room service. John at the front desk is very helpful!", "Date": "September 17, 2011"}, {"Ratings": {"Location": "5", "Overall": "5.0", "Value": "5", "Service": "5", "Rooms": "5"}, "AuthorLocation": "Houston, TX", "Title": "“Easy 5 Stars”", "Author": "Rolayna", "ReviewID": "UR118168884", "Content": "I've stayed at this hotel twice within the last two years, including the week after it opened for business, and have nothing bad to say. It is updated, modern, and comfortable. The lobby is inviting, and its location in the Gaslamp district provides access to a lot of entertainment and dining options, and Petco Park is a couple of blocks away (San Diego Padres play there, and I recommend seeing this park even to non-sports enthusiasts). Giving this hotel 5 stars is a no-brainer for me. I've also recommended it to friends and colleagues who have all had great experiences. I recommend Richard Walker's for Breakfast (the wait is worth it), and Mickey Rotten's casual fair, and Nobu for dinner. A lot of other options, but these stood out from the rest for me, and both Mickey Rotten's and Nobu are within walking distance from the hotel.", "Date": "September 15, 2011"}, {"Ratings": {"Location": "5", "Overall": "5.0", "Value": "4", "Service": "5", "Rooms": "4"}, "AuthorLocation": "Bremerton, Washington", "Title": "“Outstanding Service!”", "Author": "Norm T", "ReviewID": "UR118023885", "Content": "I have stayed at this hotel twice on business. The last night of my stay last week, the power went out in all of San Diego, including the hotel. The entire hotel staff worked tirelessly to meet the needs of hotel customers, all the time with unflagging courtesy. The hotel itself is in a great location for access to the Gaslamp District, the rooms are clean and comfortable. The service of the staff sets this hotel apart, in a good way. The only problem was that the public printers in the hotel lobby were low on toner. I can live with that.", "Date": "September 12, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Manchester, United Kingdom", "Title": "“Really lovely”", "Author": "vonbe123", "ReviewID": "UR117857940", "Content": "Lovely hotel, great staff, spacious rooms and a fab roof top bar. Breakfast was also amazing. Central location and you can even see baseball games from the roof top bar. Nothing bad to say about the place!", "Date": "September 9, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "4", "Overall": "5.0", "Value": "4", "Service": "5"}, "AuthorLocation": "Roseburg", "Title": "“In the middle of everything!!!”", "Author": "LuckyLaRue3715", "ReviewID": "UR117683368", "Content": "I traveled to San Diego for a week and was very fortunate to have training in the Gas Lamp District. The Residence Inn was a perfect hotel, located in the perfect spot. The hotel is one block from Petco Stadium, in the middle of numerous great restaurants, and a short walk to the San Diego Convention Center. My room was very clean and modern. The kitchenette was stocked with everything a person would need for a meal or storing a snack. I was warned that late night parties in the area may keep a person awake night but this was not the case. I would recommend this hotel for both families and business travelers alike. A small breakfast was provided in the morning that was a great way to start the day. A restaurant was in the hotel but with so many great venues in the area I went out each night. Dont hesitate to stay and enjoy the local area from this great hotel.", "Date": "September 5, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "4", "Rooms": "5"}, "AuthorLocation": "", "Title": "“AMAZING STAY!!!!”", "Author": "kllrmom", "ReviewID": "UR117538015", "Content": "This place was absolutely amazing. I've never met a more friendly staff. The valet were quick and courteous. Daily breakfast is included with your stay and its REAL breakfast. Valet is the only option for parking and its a little pricey ($35) a day. My family and I were there for a month and we had NO complaints!", "Date": "September 1, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "", "Title": "“Best extended stay ever!!!!”", "Author": "cosmocrys", "ReviewID": "UR117519321", "Content": "This hotel is amazing, our house flooded and this is where we ended up staying. Best choice ever!!! Close to everything in downtown!!! From the moment we arrived everyone was so helpful and courteous (we stayed a month) service was impeccable from housekeeping to the buffet style breakfast, to the valet guys, who were super courteous and always had your car out in no time. So sad to leave it truly was like being at home but in a hotel!!!", "Date": "September 1, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "3", "Overall": "4.0", "Value": "4", "Service": "4"}, "AuthorLocation": "San Jose, California", "Title": "“Great Location, nice rooms, but it's a little noisy”", "Author": "travelchyc", "ReviewID": "UR117518728", "Content": "The hotel is located in the heart of the Gaslamp District. There are great restaurants and bars within a short walk from the hotel. (There is a great cupcake place called Heavenly Cupcakes that is two blocks away from the hotel.) The hotel is nicely decorated and the rooms are nice. I was staying on the 11th floor and we could still hear the street noise in the evenings. Parking costs $37 per night but you have in and out privileges.", "Date": "August 31, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Tucson, Arizona", "Title": "“Great hotel - great location”", "Author": "vacationgirl006", "ReviewID": "UR116587578", "Content": "Terrific new hotel - two blocks from Petco park, about 15 minute walk to Horton Plaza and close to lots of restaurants and shopping. Easy to find and close to airport. Staff was friendly and helpful. Special kudos to Emily and Ruby for their help arranging a room block for us. Very accommodating. Would not hesitate to recommend this property - we'll be back!", "Date": "August 11, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Hampton Va", "Title": "“Excellent Hotel”", "Author": "Dmbeland", "ReviewID": "UR116575265", "Content": "Awesome hotel.. The staff and accommodations are excellent.. Highly recommend.", "Date": "August 11, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "4", "Overall": "5.0", "Value": "4", "Service": "5"}, "AuthorLocation": "South Bend, Indiana", "Title": "“What a pleasant surprise”", "Author": "crmj1951", "ReviewID": "UR116348299", "Content": "We have stayed at Residence Inns in other cities. They were pretty standard as extended stay hotels go. This one however is far and above any other. The rooms are modern, bright, spacious and comfortable. The breakfast is a real breakfast, not \"an apple & bagle\" kind of breakfast. The food is hot and plentiful, and the staff is VERY courteous. I highly recommend this hotel!", "Date": "August 6, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "2", "Overall": "3.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Fontana, California", "Title": "“Great hotel for families”", "Author": "studentwork", "ReviewID": "UR116266203", "Content": "We had a perfect room in the corner not far from the elevator. We also loved the fact that the room came with pots, plates and silverware. We were there for comic-con, but once we got to our room, we never heard any of the outside noise. The only down fall was the windows in the room don't open if your cooking something. At times the room got smoky and the vent didn't work that great. All in all we would stay here again!", "Date": "August 4, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Tennessee", "Title": "“Great place to stay”", "Author": "thetractorman", "ReviewID": "UR115875274", "Content": "If you're looking for a great place to stay near the Convention Center and PETCO Park, this is a good choice. My wife and I stayed here 8 nights for a conference and were very pleased. We had a good room rate that incuded complimentary breakfast and WiFi. We were greeted by staff every time we came in, and they kindly took care of any requests or provided information about local businesses. The rooms are mini suites with a fully equipped kitchen, nice bathroom, very comfortable bedding and large flat panel TV. Climate control in the room worked well and was very quiet. They take security rather serious here, and you must use your room key card to make he elevator go anywhere except the Lobby level. So, don't forget your key card when you leave your room. The breakfast area on 2nd floor is nice and they offer a decent selection of foods, included in your room rate. But if you want to pay for a big breakfast, go right across the street to Broken Yolk. The pool on 3rd floor is rather small, and there is a fitness center next to the pool. But, I did a lot of walking each day and didn't want to ride a bike to nowhere or walk on a conveyor belt on this trip. Yes, I'll definitely try to book a room here next year.", "Date": "July 27, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Laguna Hills, California", "Title": "“We loved it and the staff was very friendly!”", "Author": "sweetmeg1980", "ReviewID": "UR115592972", "Content": "The service we experienced was amazing. The front desk staff was very friendly, the room was spacious with a wonderful view and the location was wonderful. Everything was within walking distance.", "Date": "July 20, 2011"}, {"Ratings": {"Cleanliness": "3", "Sleep Quality": "4", "Overall": "4.0", "Value": "3", "Service": "4"}, "AuthorLocation": "Houston, Texas", "Title": "“Modern hotel in great location”", "Author": "ploaco", "ReviewID": "UR115232000", "Content": "PROS: The lobby is beautiful and modern for a residence inn and makes a great first impression. We stayed in a King bed studio suite and the room was spacious enough for a family of four (2 toddlers.) The room is updated with granite counter tops and stainless steel appliances. The ,ovation is fabulous with restaurants, shops all around the hotel. The harbor is just a short stroll (15 minutes). CONS: Get to breakfast early because we noticed the one day we were late, it was hectic. The other thing I noticed is that the hotel does not have a check in system in place and I was sure people who were not staying at hotel were eating for free. One day we went across the street because it was so crowded. The other thing you should worry about is the noise. Since this is party central, you will hear lots of noise at night in area. Lots of young people stay here ready to party so be prepared for lots of young 20 somethings in the hotel. The final complaint $35 valet!!! Super pricey but the valet guys are awesome and very friendly about help getting to your location and recommendations. Also, tiny pool but we went there to swim. Overall great experience. Oh and try the BBQ pizza...it's pricey for a small pizza but yummy.", "Date": "July 10, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Stuttgart, Germany", "Title": "“Lost luggage made better by wonderful staff”", "Author": "Tara_LM", "ReviewID": "UR115211112", "Content": "Steve and Rebecca, the night crew, really helped me feel more comfortable when I hadn't received my luggage AND was starving in the middle of the AM! They were more than helpful to get me milk to drink with my vitamins (as I am quite nauseous/pregnant) before breakfast was even open!! This hotel and the people (from valet attendants to those working at the Front Desk) have definitely been the saviour when the rest of the trip so far (first night) hasn't been going as planned!! :) Thanks!!", "Date": "July 10, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "4"}, "AuthorLocation": "Chicago, Illinois", "Title": "“New hotel in a great location!”", "Author": "dmbRJR", "ReviewID": "UR115090914", "Content": "My wife and I stayed here for a few days over the 4th of July weekend. The hotel is very new and updated with nice spacious rooms. The hotel is located in the heart of the Gaslamp Quarter and just a block or two from Petco Park. It made for a perfect location for us and puts you in the center of great restaurants and bars. Hotel staff was good and the valet guys were awesome! There is a fitness center and pool on the third floor. The pool is small and just OK but workable if you are there for a short stay.", "Date": "July 6, 2011"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Toronto", "Title": "“Spacious suites in a great location”", "Author": "DBAToronto", "ReviewID": "UR115067823", "Content": "We spent 8 days at the Residence Inn for a conference followed by a family holiday. We had debated about moving to another hotel further from the Convention Center after the conference ended, but decided to stay put. We're glad we did! The staff were exceptionally friendly and warm. They were very accommodating with our rambunctious kids running through the lobby, and knew their names within a day. The location was great: close to lots of restaurants, shops and cafés. Short walking distance to the Convention Center and to Horton Plaza. We had a large, one-bedroom suite which had lots of space for the two kids to run around in and lots of windows to bring in light. It was kept extremely clean each day. The well-stocked kitchen facilities were very handy with modern appliances. The guest laundry was a valuable feature, and the small swimming pool was warm. My only complaint would be the breakfast buffet. The food was mediocre and sometimes ran out before the end of the breakfast period, but the staff were very friendly. The valet parking with the hotel was $35. The neighboring lot was only about $15–$20 per day — so if you don't need in-and-out privileges, it's a much better deal.", "Date": "July 5, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Fort Worth, Texas", "Title": "“Great location and service, highly recommend!”", "Author": "TexasAggie1211", "ReviewID": "UR114890461", "Content": "My wife and I stayed here for 5 days on a babymoon. The location was terrific. We were steps away from excellent food and entertainment. We rented a car for only one day and felt this was sufficient. My pregnant wife waddled around the Gaslamp quarter and we took a cab to the San Diego Zoo, Balboa Park, Old Town and La Jolla. We bought tickets to a baseball game on Stub Hub ($71 tickets for $25) and thought the stadium and entire experience was awesome (not to mention 1 block away). We also walked to the harbor, Seaport Village, local shopping and Horton Plaza (mall and movie). We stayed busy for all 5 days and felt that it was a great experience overall. The hotel was perfect and featured good breakfast, a nice bar, good snack shop, spacious and clean rooms and of course a prime location. It's hard to imagine a better location for a hotel in all of San Diego. I think that Marriott offers a terrific product for the money and would recommend this hotel to everyone.", "Date": "June 30, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "3", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Stuart, Florida", "Title": "“Great Location and Convenient to Convention Center”", "Author": "TSchenk", "ReviewID": "UR113625195", "Content": "My wife and I stayed 6 nights in this great downtown hotel for a conference being held at the Hilton. The rooms have a wonderful home appeal. The decorators did a great job with the furnishings. The staff were all very friendly and responsive to our needs. This visit was for business and we were able to ship our demo equipment to and from the hotel without any additional charges. The hotel that hosted the conference we attended wanted $50 to $100 per box for the same service. The hotel is within short walking distance to a World Market and a full service Ralph's grocery store that also had beer and wine. Several evenings the hotels happy hour snacks were enough for our entire dinner. One evening they served a full spaghetti dinner. The free breakfast was also very nice and changed each morning so you didn't get bored with the same standard offerings most hotels present.", "Date": "June 15, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "San Diego, California", "Title": "“First stay at a Residence Inn and we'll be back”", "Author": "ColleenMP", "ReviewID": "UR112805035", "Content": "My husband and I were going to the Smooth music festival promoted by FM98.1 here in San Diego and didn't want to have to drive home that night so we stayed at the Residence Inn. We regularly stay at various Marriott hotels but this was our first stay at a Residence Inn. Excellent! Beautiful, very accommodating to those who are there on business or those who are vacationing. We were told by the front desk staff that they would even go grocery shopping and have the food in the kitchen if we so required for a stay. Now that is service. We will be back even though we live in San Diego. It's a great place to stay, close everything in the Gaslamp Quarter and well worth it. The only drawback was the hefty parking fee which the hotel has no control over due to it being contracted to a parking company.", "Date": "June 11, 2011"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Overall": "3.0", "Value": "2", "Sleep Quality": "2", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Phoenix, Arizona", "Title": "“Front desk service bad”", "Author": "werefun", "ReviewID": "UR110625146", "Content": "When we checked in, the front desk clerk told us all he had was a Queen room, to which I replied, \"You don't have any kings available?\". He said, \"We're very limited. We're sold out\", which left me thinking \"what exactly are you saving them for\"? We're Marriott Rewards members, and my husband travels for business, spending between a month and three months each year at Marriotts. I asked again, \"you don't have anything in a King?\" to which he replied, \"oh, I do have one available.\" The room was fine, other than some outdoor noise and the fact that the cable kept going out and the volume didn't work on the bedroom TV. When we checked out the receipt had 2 valet charges on it, although we used the garage next door. We brought it to the attention of the heavyset man at the front desk, who picked up the phone and said \"I need you to verify that a customer didn't use the valet.\" He might as well have said \"I need you to verify that this customer isn't lying\", because that's what we heard. Another woman comes to the desk, and starts flipping through a book with names and room numbers - apparently a valet book. She spends approximately 3 minutes flipping pages before my husband says \"you're not going to find our name because it's not in there\", and she replies, \"it could be under a different name\". She continued to read the same pages over and over, convinced that we were liars. Wow. They eventually conceded that we were, in fact, not liars, and credited the charges. By that point, however, they had lost our business forever, and cost us over 10 minutes while they investigated THEIR mistake. The girl who eventually checked us out was named Mona, but the heavyset man wasn't wearing a nametag, nor was the tall, thin girl who is likely still looking for proof that we used the valet. The man never spoke again after making the initial phone call, and pointed anyone who walked up to him over to Mona for assistance, making them wait in line while he served no one. Both Mona and the other girl finally asked \"How was your stay, other than this?\" after I walked silently to the other end of the counter and picked up business cards for both the Guest Service Manager and TripAdvisor reviews. If they find this type of investigation necessary when encountering this type of error, they need to do it in the back room rather than at the counter. We'll never go to this Marriott again and I wouldn't recommend it either. There are too many other nice hotels in the area - try the U.S. Grant or the Omni or Hilton.", "Date": "May 30, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Worcester, Massachusetts", "Title": "“Great Hotel”", "Author": "Kayte205", "ReviewID": "UR110302601", "Content": "My two sisters and I stayed at the Residence Inn in San Diego's Gaslamp district for two days and had a great experience. I would have to say the most positive aspect of this hotel was its incredible staff. Everyone I encountered was friendly and seemed to genuinely care about our needs at the hotel. Parking is $35 a day, which is pricey but the valet guys were awesome and it helped make our trip much smoother. We stayed in a suite that was very clean, comfortable and roomy. We also had decent view from the room and we were located in a great,easily accessible section of San Diego! The continental breakfast was great as well, lots of variety to choose from. Overall, its a great hotel to stay at!", "Date": "May 29, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "3", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Tacoma, Washington", "Title": "“great”", "Author": "hillmel", "ReviewID": "UR109957087", "Content": "every employee was very friendly and helpful-never had to wait to get help-location is great for being in the heart of gaslight but not where all the party noise is. Turn the ice maker off in refrig or it will wake you up in night with the clicking of the ice moving. In my room the wall tv was located in an odd place in relation to the bed- my friends room was ok. The wifi worked great-the computer in lobby for all to use worked great. The common area in lobby was very comfortable. The bed was too hard for my liking. They use those super cheap plastic sacks for the waste baskets which slip down into the basket", "Date": "May 26, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Philadelphia, Pennsylvania", "Title": "“Sorry for being cliche, but it's a home away from home!”", "Author": "RUtoSD", "ReviewID": "UR109563913", "Content": "I have stayed at this hotel frequently over the past year, so a lot of the staff has gotten to know me by name. It's a very friendly environment and I don't even think twice about booking a reservation anywhere else when I am traveling to The San Diego for business. As it's a suite, the kitchen amenities are sufficient enough to get me through extended (2 weeks or greater) travel stays. In particular, Erick and Emily at the front desk have been extremely accommodating with little things like an extra room key or bigger things like helping me to extend travel plans or changing travel dates.", "Date": "May 23, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Hemet, CA", "Title": "“Great Hotel”", "Author": "GIKimber", "ReviewID": "UR109396226", "Content": "For being on a business trip, this was certainly nice. I found it to be pricey because of the prime location, but my company was paying for it. I wouldn't be able to afford to stay there otherwise. I understand paying for parking when downtown, but I think $35 daily is excessive. But the valet personnel were on it! They had my car in custody and my bags in my room in no time, and when it was time to leave they were equally efficient. All staff was friendly and did their best to accommodate everything. I had a mistake on my bill and they quickly remedied it with a smile. The room has a full kitchen, which is a big plus. I'm dieting, so eating out isn't in my best interest at the moment. It gave me the flexibility to eat the way I want. The living area was spacious and the bed was comfy. It had a queen, but that was ok. The fitness room was nice, and had a nice view of the street outside. The only complaint I have there was that the windows faced the west and the sun was blinding in the late afternoon and there were no blinds to pull. The equipment was state of the art. High speed internet was free, and they served free breakfast in the mornings which allowed me to supplement my own food with fruit and yogurt, although they offered much more. The staff even offered to make eggs the way I wanted. The hotel was walking distance from PETCO staduim so getting to a Padre's game is easy and you don't have to try and park there. The Gaslamp District in San Diego has a lot of great restaraunts and clubs to partake in, so the location is certainly prime. I just wish I could have stayed longer for leisure and not had to work.", "Date": "May 22, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "California", "Title": "“As good as you'd like”", "Author": "Discerningwon", "ReviewID": "UR109362281", "Content": "This hotel is in a great central location for the Gaslamp Quarter and is clean, modern, well decorated and has a very pleasant staff. We could not have asked for better treatment than we received and I could find no fault with anything in our room. It was very nicely maintained. My only \"nit pick\" would be they should open their bar and hour earlier to coincide with check-in time and perhaps they should plug their food service a bit more. We enjoyed the appetizer selection and the two we tried were exceptional. The breakfast bar was very well stocked and items were replaced quickly when needed. I definitely recommend this hotel.", "Date": "May 22, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Park City, Utah", "Title": "“Best Residence Inn Yet!”", "Author": "StableProgramKris", "ReviewID": "UR109130086", "Content": "From the moment I left my car with the friendly valet staff to the moment I (reluctantly) had to check out, I was completely satisfied with this hotel! I have stayed in Residence Inn facilities many times as that is my preferred hotel for longer business trips and this one was by far the best one yet. The rooms are beautifully appointed, comfortable, modern and clean. But one of the best features was the location. As a woman traveling alone, I felt completely safe walking out of the hotel right into the Gaslamp district. There were so many great restaurant and shopping choices, including a great outdoor mall that was a perfect (exercise) walking distance away. That was sweet to find - made my solo trip much less boring! The hotel staff were so friendly! I've stayed in two other Residence Inns in San Diego and have to say this one is the one I'll always select from now on when I'm visiting there.", "Date": "May 20, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Havre de Grace, Maryland", "Title": "“absolutely fabulous”", "Author": "awickedwench", "ReviewID": "UR108531331", "Content": "First time visit to San Diego for a convention and the convention hotel was booked so we stayed here. What a delight. The staff was heloful and friendly. The rooms were roomy, comfortable and clean. The buffet breakfast was hot and delicious. And the location as perfect! It was close to our convention location and just a block off of all the fabulous dining and shopping of Fifth Avenue. We had the best time and not a single complaint about the hotel. Included a kitchen, a pullout sofa and free wifi! Just wonderful. We plan on staying there again next year when we come back for our convention again!", "Date": "May 16, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "", "Title": "“Why would you stay anywhere else?”", "Author": "juztincredable", "ReviewID": "UR108323422", "Content": "I had a FANTASTIC stay! The staff was incredibly friendly and really helpful from the warm gentleman who checked us in (and was kind enough to move us when we weren't comfortable in our room) to the delightfully helpful woman who helped me figure out parking at Sea World and the Zoo and then checked us out while checking in on our conversations from the morning before. We felt incredibly well taken care of and the morning breakfast was delicious! Who doesn't love steel-cut oatmeal? Well...I might be the only one who loves it, but they also had a full spread of eggs, fresh fruit, waffles, a variety of yogurt, a variety of cereal, tons of beverage options and probably a bunch of other things I'm completely forgetting. The building is quite nice, great design and a perfect location close to just about everything. I highly recommend this location (so much so that I'm writing this from my phone as I'm heading back home!)", "Date": "May 15, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Lakewood, Colorado", "Title": "“Excellent Service, Great Value.”", "Author": "2306Sunset", "ReviewID": "UR108143335", "Content": "The service was excellent, the staff was well trained and friendly. The breakfast buffet was very good. I left a book behind in my room, Mona packaged it up, mailed it, and I received it three days later.", "Date": "May 13, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Memphis", "Title": "“Best Residence Inn”", "Author": "HunterMemphis", "ReviewID": "UR108095772", "Content": "This was an awesome hotel. Super clean, super modern, the breakfast was awesome as well as the nightly snacks. Excellent location I would stay here every time I come to San Diego. Fantastic staff was super helpful.", "Date": "May 13, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "3", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Johannesburg, South Africa", "Title": "“Great location and comfortable suites”", "Author": "LoveJozi", "ReviewID": "UR106575243", "Content": "Stayed here for two nights, but a longer stay would have been welcomed. Nice and central. The gym is a bit small, but it is functional. Breakfast is a bit tricky with a lack of healthy options. The waffles were great - the scrambled eggs were not! Rooms are large and comfortable, and the small kitchenette is perfect for longer stays. Very comfy bed! Internet connection is free and fast. Staff professional and helpful. Other hotels include a free shuttle to the airport (Residence Inn does not do this). However, shuttles and taxis are readily available and relatively cheap.", "Date": "May 2, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Irvine, California", "Title": "“this is a great place”", "Author": "buffy23", "ReviewID": "UR105878830", "Content": "From the moment we stepped out of our car we were greeeted by pleasant friendly staff. We arrived way earlier than the regular check in. No problem, there was room availableand in not time we were in our suite.. The front counter staff, valet parking and breakfast room staff counld not have been more pleasant and accomodatingl. Howeer, if you want info on the surrounding area and in fact all of San Diego it is better to ask the front desk staff as the valets didn't seem to know, but then that isn't their area of expertise. Any time we came back to the hotel we were greeted with \"welcome back\" from the valets/doormen. Anytime we left the hotel we were told \"have a good day\" We were certainly made to feel welcomed. The one bedroom was just great, not too big nor too small, and it had everything that we wanted. The full fridge and well equipped kitchen was great as we had a soon to be two year old who need sustance at any hour. The kid size bed was totally comfortable! Gaslamp area has so many bars and restaurants not exactly a family place to be but there were parks were nearby and the Martin Luther Walkway approximately two blocks away was a great place for a walk with our little one. The Old Town Trolley Tour was fabulous, though a bit pricey but the guide sure knew his stuff and you saw quite a bit and learned alot about San Diego. All in all we had wonderful time at the hotel and in the city. We would return again!", "Date": "April 27, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "3", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Kailua, Hawaii", "Title": "“Ideal Hotel in downtown San Diego”", "Author": "Jollymon22", "ReviewID": "UR105454879", "Content": "This Residence Inn is a newer Hotel in the Gaslamp district just minutes from the convention center and Petco park. It is ideally located in the Gaslamp allowing you to walk everywhere including dining and shoping. The staff was exceptional from the breakfast servers in the morning to the manager and even the GM. They are all extremely well trained. This was my second stay here and I would not stay anywhere else in downtown San Diego during future visits.", "Date": "April 25, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Location": "4", "Rooms": "5"}, "AuthorLocation": "london", "Title": "“Great location for tourists”", "Author": "cnctravels", "ReviewID": "UR104935483", "Content": "Hotel is very well locate for tourists. Easy access in and out of town to major attractions, plenty of restaurants and bars to choose from locally, and gaslamp is relatively quiet for a large city. Be careful with parking (valet), $35 per night. I found a multi-storey car park 1 block down and across the road that was only $8. Overall though, good hotel.", "Date": "April 21, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "brooklyn,ny", "Title": "“hospitality at its best”", "Author": "dean2800", "ReviewID": "UR104513223", "Content": "As soon as we pulled up to the valet we felt very welcome. the hotels doors were opened for us and we were greeted with smiles. the lobby was nice, the room was very comfortable. the kitchen was great especially with 2 small children. the location is central to all the great dining in the area. no need to drive for food. the free breakfast was a hit. full breakfast not a boring continental. i will be sure to stay again. P.s. There is a pool !", "Date": "April 18, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "3", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Westminster, Colorado", "Title": "“This hotel was very nice for a Residence Inn.”", "Author": "Parke_Chris", "ReviewID": "UR103815793", "Content": "Most of the Residence Inns I have stayed in have been nice but basic. This had much more. The décor was modern with a nice bar in the lobby that was well lit for doing business but way too bright for having a romantic drink and conversation. The location is great with the heart of the Gaslamp district a block away and the ballpark across the street. The pool area was small but nice and my girlfriend said the gym was way too hot. And it must have been hot for her to say that. It sound like they need to put a couple fans in there. The room was very nice. The bed was very comfortable and the kitchen well stocked with everything you may want for cooking in your room. The cleanliness was outstanding. The only negatives were the lack of a good workspace in the room and the vinyl shower curtain liner needed to be replaced. Overall, it more than met my expectations.", "Date": "April 12, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Seattle, Washington", "Title": "“Great location, family-friendly, very helpful staff”", "Author": "T-LO11_11", "ReviewID": "UR103346687", "Content": "We stayed at the Residence Inn Gaslamp for 3 nights, with our 2 young children, and were extremely pleased with our experience. The staff went out of their way to be helpful, especially for a family with young children. The kids were given an activity book and crayons upon check in and each time we found ourselves at the front desk during our stay, staff members made sure to ask if the kids had already received this. The room key(cards) were Nickelodeon-themed and the front desk allowed us to check out board games, such as Chutes and Ladders and Candy Land. The staff was also very helpful with directions (10-15 min. to SeaWorld, 45 min. to LegoLand). The location was excellent, as it is right in the heart of the Gaslamp Quarter, lots of restaurants and retail establishments just blocks away, so easy to walk somewhere for dinner each night. There were lots of folks outside on Sat. night, but the noise was not a problem. The 1-bedroom suite was perfect for us, as the kids slept on the pull-out sofa and we slept in the bedroom which had a sliding door. As others have noted, the bathroom is not in the bedroom and the sink is outside of the actual bathroom, but this didn't prove inconvenient for us. Lovely free breakfast with plenty of seating. Yes, valet parking is expensive at $32, but we knew about this upfront and the valet staff were super friendly and our car was always waiting for us by the time we reached the entrance. All in all, an excellent experience.", "Date": "April 9, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "HIlo, Hawaii", "Title": "“Pretty good hotel”", "Author": "Imua_Warriors", "ReviewID": "UR103113967", "Content": "Valet were very attentive and always opened the front door for you even when I tried to sneak by. Free breakfast is a full breakfast, not just continental like in most other hotels. Room was nice, however, maid only made bed and changed towels. She never put ironing board away or wiped up around the bathroom sink.", "Date": "April 7, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Trabuco Canyon, California", "Title": "“Great Hotel and Great Location”", "Author": "kplusJx7", "ReviewID": "UR102178751", "Content": "This property is great! The staff was very helpful, rooms extremely clean, and the kitchenette was a wonderful bonus. The location is fun - right in the middle of the Gaslamp Quarter, a fun area full of dining choices and some shopping. The harbor is close by, too. It was a fun destination, and we never needed our car once we parked it. I do suggest parking in the public garage next door or across the street where it only cost $21 to park Sunday through Tuesday. I think the hotel charges $32 per day. Also, the USS Midway is within walking distance and was a very interesting tour. We would definitely choose this property for a return trip. Added bonus: the breakfast buffet is included, and it is better than most.", "Date": "March 30, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Centennial, Colorado", "Title": "“Great location for after work dining and entertainment”", "Author": "TimInColorado", "ReviewID": "UR101427326", "Content": "The hotel is one block off 5th Avenue which is where the majority of the Gaslamp Quarter restaurants and bars are located. The hotel was in very good condition and the staff very helpful. I found the hotel to be very quiet, clean and comfortable considering it's downtown location. Everthing you want to do in San Diego is relatively close, so getting to the airport, Old Town, Mission Bay or even La Jolla was a fast trip from downtown.", "Date": "March 24, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Sacramento, California", "Title": "“Beautiful location, luxurious room, and enthusiastic staff!”", "Author": "jcatalan", "ReviewID": "UR100776588", "Content": "I attended a conference at the Convention Center in San Diego last week and thankfully stayed at The Residence Inn Downtown. The location allowed me to walk everywhere. The convention center, the marina, the gaslamp quarter and the trolley car! Even better, my room was luxurious with down comforters, fluffy pillows and a beautiful spa-like bathroom. I travel more than most people and a nice hotel is valued by the staff. Emily, at the Front Desk, set the tone for a nice stay. She offered help, directions, and tips about the area. Other staff (breakfast crew, doormen, and the bartender!) indeed followed in Emily's style too. Thank you---I will indeed return.", "Date": "March 19, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Elkhart, Indiana", "Title": "“Great location, wonderful staff”", "Author": "jenjens1023", "ReviewID": "UR100666143", "Content": "We stayed here the night before a cruise. The hotel is in a great location with lots of restaurants nearby and it's only two blocks from the trolley station. The rooms are a little smaller than I've had at other Residence Inns, but were perfectly adequate for three of us. I was never aware of sounds in the hall or from other rooms. Big breakfast with eggs, sausage, make-your-own waffles, biscuits, hot and cold cereals, and much more. Breakfast room was always clean and picked up. Small pool, but big enough for a quick refreshing dip. The internet was fast and more reliable than what I have at home. After our cruise San Diego harbor was closed due to the tsunami threat, causing us to miss our flight and needing to spend another night in San Diego. We called the Residence Inn and they were very helpful. They actually remembered us from the week before and told us to come on over, they would take care of us. And take care of us they did. They were friendly and simpathetic to our frustration. Even the valet was great. When my daughter realized her cell phone had fallen out of her pocket in the cab, one of the valets ran a block and a half down the street waving his arms. The cab stopped and he got the phone for her. I would highly recommend this hotel.", "Date": "March 18, 2011"}, {"Ratings": {"Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "San Diego, California", "Title": "“this place is AWESOME, plus its colse to everything... love it.!!!!!!”", "Author": "mike_horner", "ReviewID": "UR99152182", "Content": "wonderful. we were a little loud and had a lot of fun. we will be back with another crowd in may. its my kids 21 b-day", "Date": "March 6, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "3.0", "Value": "3", "Sleep Quality": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Houston, TX", "Title": "“Spotty internet. Small rooms”", "Author": "AnotherHoustonian", "ReviewID": "UR98849342", "Content": "So, it's hard for me to not have my review tainted by the fact that I had trouble connecting to the internet and no one seemed to care. For me, being able to connect is a pretty big deal. The front desk was totally indifferent and gave me an offshore help desk, which after 45 minutes was able to assist. I called the front desk while waiting, and they simply told me that the internet was working for them and implied it was my computer. Eventually, the offshore folks called me back and helped me connect. Even once connected, the service was spotty. I really couldn't stay here for business, simply because I must have reliable internet. The rooms were very small, which was a suprise for a Residence Inn. There was the traditional frig, stovetop etc. However, it was tightly wedged within the room. The room certainly isn't any larger than a traditional downtown hotel. The bathroom vanity is actually in the room itself, which is just odd. I wouldn't stay in the room with anyone other than a spouse, because it's a little close. The location is really wonderful. However, looking around there are two very nice hotels within the same block. I certainly would consider investigating them if I were to return. The workout room was undersized. This is a fairly large hotel from a room number perspective. The workout room consists of two treadmills and two ellipticals. Wake up early if you are planning on working out or do some research ahead of time and see if there is a nearby gym. Despite a great location, I wouldn't choose this hotel again.", "Date": "March 4, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Shelby Township, Michigan", "Title": "“World class service”", "Author": "tiede1231", "ReviewID": "UR98585037", "Content": "I have stayed in world class hotels, from the Tower Thistle in London to the Aksaka Prince in Tokyo and the RISD/GQ has the best customer service I have ever experienced. The managers are so accomidating, valet is fast and curtious and even the cook is very polite. I will recommend this hotel to all headed to San Diego. Thank you for the hospitality Chris Tiede", "Date": "March 1, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Sleep Quality": "3", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Anchorage, Alaska", "Title": "“Nice hotel with terrible service”", "Author": "AKMicaiah", "ReviewID": "UR98392773", "Content": "The hotel is nice and updated. The rooms were cleaned daily for the most part. The location is great. The only issue I had with the hotel was the service. The staff is not helpful or friendly. They practally hang up on you if you call with a question and act like you are in their way if you approach the desk for anything. For the price you pay for a room the poor service is unexceptable.", "Date": "February 28, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "4.0", "Value": "3", "Location": "4", "Rooms": "4"}, "AuthorLocation": "", "Title": "“Good”", "Author": "818cj", "ReviewID": "UR96663806", "Content": "Overall I enjoyed my stay. There were a few things that I didn't like such as the male individual who checked me in. All other personal were very helpful and went the extra mile to make me comfortable. The two other minor bumps were the bath tub drain plug didn't hold the water and one of the blinds didn't retract up. Overall it was a good visit.", "Date": "February 14, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "5", "Overall": "3.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "5"}, "AuthorLocation": "San Diego, California", "Title": "“Great Hotel, Lousy Customer Service”", "Author": "JMNap", "ReviewID": "UR96607808", "Content": "This hotel is very nice. The location is walking distance to some great restaurants and bars. Parking in downtown San Diego can be difficult at best, especially on the weekends, so this is a real plus even though you will pay $32 a night to park your car at this hotel. The rooms are clean and updated. There isn't much room around the bathroom sink to put your essentials, especially for two people, but we only stayed for one night. The free breakfast they offer is ok. If you are looking for someting nice, it's probably better to walk across the street or up the block for some other options. We stayed over Valentine's Day weekend. My husband made arrangements with this hotel to have flowers delivered to our room for me. They weren't there when we arrived, but he thought maybe the flowers would be brought later after we got back from dinner. No flowers ever showed up. So when we checked out the next day my husband checked at the front desk about the flowers and apparently they had been in a side office since the day before. Nobody knew why they weren't taken up to us. The flowers had our name on them. Also, we had called down to the front desk to have someone come up and assist us with our luggage, we also contacted valet to have our car brought to the front so that we could leave. Our car made it. Nobody ever showed up to get our luggage after we waited 30 minutes. So we decided to bring our luggage down ourselves. When when got down to our car we told the valet we were sorry our car had to sit so long, we told him we had been waiting for a half hour for help. He said he was sorry but he was unaware of anyone from the front desk contacting them for luggage assistance. So from our experience, don't depend on the front desk for anything, especially if it is important. The funny thing is when we left it wasn't even busy.", "Date": "February 14, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Allentown, Pennsylvania", "Title": "“Very pleasant stay at the Residence Inn”", "Author": "msgodorov", "ReviewID": "UR96181135", "Content": "The desk staff was very accommodating with my requirements and changes to my plans due to a flight cancellation. When I arrived they told me I may have to stay at another hotel for one night due to overbooking, however they were able to accommodate me at the Residence Inn without issue.", "Date": "February 10, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Norfolk, Virginia, USA", "Title": "“Excellent hotel in the perfect spot!”", "Author": "kurtprough", "ReviewID": "UR95931528", "Content": "This hotel is great! Cheerful, helpful staff, clean, well appointed, and in the absolute perfect spot. It is within walking distance to everything in downtown San Diego. It is right next door to PetCo park. As a Marriott Platnium member, I can say this is a great hotel and highly recommend it, just make sure to leave me a room!", "Date": "February 8, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "3", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "South Dakota", "Title": "“Fabulous”", "Author": "sdprairiegirl", "ReviewID": "UR94759246", "Content": "We had a King Suite with a pak-n-play for our 2.5 year old. The kitchen was awesome. Other reviewers warned it was smaller than expected, but it had a full-size frig, micro, stove, toaster, dishes, etc. Really awesome for eating in the room. We like the layout of the rooms, too. It felt roomy, but had a good-size sofa, two-person dining table, coffee table. The bedroom was great - a little light on the drawers, but not many people unpack, anyway. Bathroom was nice, too. Everything was impeccably clean and the housekeeping staff was awesome. We have rarely been to a hotel where the staff seems so eager to be helpful. We made a request for a foam pillow - it was there in minutes! Other hotels, I'm lucky to get it by that night. We used the laundry facilities regularly, since we're potty training. They were clean and an awesome feature. We also liked being in the Gaslamp district. We were one block off 5th, where all the action is, but that was actually better. We had a dozen restaurants to choose from in a few blocks. And with a 2-yr-old, having options is a good thing. The valet parking was the best I've had at a hotel. Other valet experiences I've had, you had to give the valet a good 15-20 minutes lead time before you actually wanted the car. We would call down on the way to the elevator, and the car was already sitting on the curb every time. It was impressive. Overall, we loved this hotel, would definitely recommend it, and would stay there again.", "Date": "January 28, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "San Jose, CA", "Title": "“Nice Place To Stay”", "Author": "CABeachlady", "ReviewID": "UR94684579", "Content": "This hotel is fairly new. Rooms were very nice and comfortable. There is no restaurant on site, but they do have carry out available that you can take to your room; however, the menu is limited. Staff was very helpful about local attractions, restaurants, etc. Centrally located to things downtown.", "Date": "January 27, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Caracas", "Title": "“Excellent choice”", "Author": "happyview", "ReviewID": "UR94489364", "Content": "Spent a great time at this hotel. In the heart of the Gaslamp Quarter, near Petco park, and Convention Center, and walking distance from nearly everything. It is a bit small property, but space is well distributed. We booked a small room, so I don't know how the bigger ones look, anyway, it was, actually, quite comfortable and roomy. Just a little noise from the street, but not a great deal (anyway, if you're looking for a peaceful relax-and-meditation-inner-peace realm, you just don't stay at a Hotel in the Downtown) Clean and neat bedrooms, bathroom and kitchen, specially carpets and beds, as we are both the allergic kind. Staff was great, always with a smile. My wife isn't very fluent in english, and they don't speak spanish, but really managed to help her in absolutely anything she needed. There's free internet at the lobby, and an ATM, there's also another ATM across the street. Only had valet parking, which seemed to me a little expensive, but was in fact on the average prize range for the area. Breakfast was included, served 6 to 9 on weekdays (7-9 on weekends) and there were a lot of options in the menu. I agree pool is small, in a shadowy area of the building, but we weren't gonna use it anyway. Bar at the lobby looked really good. There's a nice, familiar environment all around that makes you feel comfortable, as if you weren't staying at a Hotel at all. 150% reccomended.", "Date": "January 26, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Location": "5"}, "AuthorLocation": "New York City, New York", "Title": "“Great hotel for family with kids - and for food allergy travelers”", "Author": "datogaisland", "ReviewID": "UR91007657", "Content": "We spent 5 nights here and the rooms were clean, the service was fast, and the in-room kitchen allowed us to provide for our child with food allergies by cooking our own food, which also saved us money when we didn't feel like eating out. We had called ahead and asked for a room cleaned without strong chemicals and there was virtually no 'typical hotel' smell when we walked in. The hotel's location provides multiple grocery and supply options within walking distance including CVS, Ralph's supermarket, and Cine mini mart (convenience store). The only parking is valet at $32 per day but you can just call from your room and the car is down there when you get down making it a very convenient option for loading/unloading kids. Anything we asked the front desk for (extra towels, pillows) was delivered within 10 minutes. The front desk and valet personnel were very helpful and would give you a pedestrian map with highlighted directions every time you asked for a specific type of destination close by. The free breakfast was great with ample sitting room and the takeout option was helpful as well. Given the hotel is less than 2 years old I wasn't surprised by the chic decor and fast elevators. The restaurants within walking distance were great as well. Mexican, Indian, Chinese, Italian and American establishments in Gaslamp quarter offer a variety of delicious options including vegetarian. The hotel is a short drive from the 5 freeway for day trips up to Legoland and Los Angeles. It takes 7 minutes to get to the airport and the same for Balboa Park which houses San Diego Zoo and other great museums and activities for kids.", "Date": "December 29, 2010"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "los angeles, ca", "Title": "“good location, good service and good price”", "Author": "lov3totrav3l", "ReviewID": "UR90353829", "Content": "I definitely recommend this hotel to anyone looking for a room in the Gas Lamp district. I have no complaints with the hotel, the rooms are nice and big, the staff is very helpful and is right in the middle of the Gas Lamp.", "Date": "December 20, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Milwaukee, Wisconsin", "Title": "“Great stay, glad I picked it.”", "Author": "travellingtuba", "ReviewID": "UR89776444", "Content": "I stayed here for 4 nights while I was attending a conference at the Convention Center in December. I am really glad that I chose this hotel, as opposed to the designated conference hotels (Omni, Hyatt, ginormous Marriott). I got a reasonable rate for the area, which I was glad included breakfast and free internet, since my conference breakfast left much to be desired... Anyways. I stayed in a king suite, which was a great corner room with 2 different views of the city (stay on higher floors for better views-- I was on the 11th). I was impressed by the tiny, yet full kitchen with quite modern, stainless steel appliances, including a dishwasher. My only complaint is that the burners on the stove are really close together, so two big pans don't fit at the same time. Oh well. No oven, either, but I don't think most people would need one. The decor was modern and very clean, and I liked the layout of the room: a studio, but the kitchen was around the corner from the living/sleeping area. There is a vanity that serves as a half wall between the kitchen area and the bathroom, and the bathroom was very spacious. My only complaint with that was the lack of lotion, which of course, I had forgotten at home. The daily free appetizers down in the lobby were really nice, and one could fill up on them as dinner if you so chose. The bar looked nice, but I didn't partake. Breakfast was basic but good, and there seemed to be enough space to sit, unlike many other Residence Inns I've been to. The location of the hotel is perfect: enough off of the beaten path so that it's a little private, but within walking distance of tons of restaurants, shops, bars, public transportation and the convention center. The fitness center is pretty tiny, so you might have to wait to use the equipment if it were a busy time. The equipment was nice, though. I also liked having valet services outside, and you had to use your key to access the elevator. Both made me feel just a bit safer, as I was traveling alone. Overall, I would 100% recommend this hotel to anyone else, whether for business or pleasure.", "Date": "December 13, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Alberta, Canada", "Title": "“Good value for Downtown San Diego”", "Author": "GetawayGangAlberta", "ReviewID": "UR88111543", "Content": "We stayed in a one bedroom suite for 2 nights on the weekend. The hotel price was excellent for this location, there was a least one large convention going on and hotel prices were very high. We booked the room 5 months ahead of time and got a great deal. The door, front desk, breakfast and housekeeping staff were all great. The room was very clean and modern, they only flaw being the great looking sliding glass doors to both the bathroom and bedroom which didn't provide much privacy (especially to the bathroom). Our teenager said the hideabed was fine and he slept well, our bed was good but firm. The kitchen was well stocked and included decent wine glasses. We looked at but didn't use the pool, it is very small but in a private protected area. The location is great, with easy access to transit and close to lots of dining and entertainment options. The hotel is trying to cut down on room parties and you have to sign a form saying you won't host parties. You need to insert your room key to select your floor. We didn't think anything of it when 4 young women joined us in the elevator and waited until we selected our floor to select theirs. On the way up they were talking about the party they attended the previous weekend in one of the rooms in the Hard Rock hotel , they got off at a different floor so we don't know if this was a party too. Later there was a large number of people arriving and knocking at the room next door, followed by some noise. It wasn't horrible so we didn't call the front desk. In retrospect we should have called the desk about both things to give them a chance to deal with it. I don't think these incidents were related to the convention (usually that kind of noise comes much later in the evening) or unique to this hotel but were instead pre-clubbing warmup parties. We like to have fun like everyone else but we try to be respectful of our neighbors. Again we don't hold these things against the hotel but looking back feel that we should have helped the hotel by letting them know and would encourage our fellow responsible travellers to do the same.", "Date": "November 24, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Mexico City, Mexico", "Title": "“Sensational service and great hotel”", "Author": "Distinctivetraveller", "ReviewID": "UR87058596", "Content": "I had the most incredible experience. I stayed at this very nice hotel: clean, modern and functional. What was amazing was that I encountered an employee that went out of his way completely to help. I called down to get a suit pressed in the evening and John from front desk answered. As I described the situation (needed suit pressed in the evening for an early morning meeting), he said he would take care of it immediately. And I did not know it then, but he meant it literally. Afterwards, when I checked out, I learned from his colleague that even though the service was not available (it was late when I asked for it), he took it upon himself to iron it in the back office! Wow, I was so impressed that he had not even mentioned anything (he was not expecting anything, just giving the service to a customer). If I would of known, I would of probably told him not to worry about it, but I was impressed to learn of this incredible gesture on his part. It would of been as easy as to say \"service not available at this time\", but he did it with no expectation of any sorts. I hope he becomes EMPLOYEE OF THE YEAR for Marriott as a whole. Impressive!!!! I will return again just to say hello to this fantastic employee. The hotel is excellent, but the service is impressive....much has to do with management at this property, I am sure.", "Date": "November 14, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "1", "Overall": "3.0", "Value": "3", "Sleep Quality": "1", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Louisville, KY", "Title": "“Superb Hotel Except for the Bedbugs”", "Author": "Bizmarkky", "ReviewID": "UR85759787", "Content": "My pregnant wife and infant daughter stayed in a one bedroom suite for two nights. The first night was uneventful. However, on the second night I slept on the pullout sofa because my wife was feeling some discomfort and I wanted to give her plenty of room. To my surprise, I woke up and found my arms and back covered with insect bites. I assumed they were bedbugs and alerted management. The person at the front desk told me that it was probably fleas from a guest that had a pet in the room. It seems as though the word \"bedbug\" is taboo in the industry now. Either way, she offered me $50 or some Marriott reward points. I politely declined and she directed me to her manager who was not on duty for further compensation. I never spoke to the manager but someone from Marriott corporate did get in touch with me to \"settle my claim.\" Apparently someone from legal called me rather than someone from customer service. In any case, I agree with all of the other reviews. I would definitely stay at this place if I could be assured of a bedbug free experience. Sadly, if it's in one room, they are probably in more.", "Date": "November 2, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "chennai. India", "Title": "“Good place”", "Author": "aylur", "ReviewID": "UR84530414", "Content": "I stayed for a night here and must say, it is a very good place. Lovely rooms, great exercise facility, dependable WIFI and right in Gas Lamp quarter- walking around is easy and staff are friendly. We were booked on 14th floor and view from our room was good. The lay out of the bathroom was neat and for the first time happened to see a shower cubicle in a Residence Inn- way to go!!", "Date": "October 23, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "3.0", "Value": "3", "Sleep Quality": "2", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Peru, Indiana", "Title": "“Beautiful hotel, noisy room”", "Author": "rslangley", "ReviewID": "UR83624614", "Content": "The customer service was fantastic and the hotel clean and quite nice. I really liked my room as well and the location was great, just 2 blocks from the convention center. The only negatives were the lack of room service (a minor issue) and the noise in my room at night. I was on the top floor and they must have the hot water heaters or some other water handling device, for the entire hotel over our heads. A fellow traveler down the hall had the same issue. The noise didn't seem to start until night time and then kicked on and off all night long. Hard to sleep. Others on lower floors did not have this issue, so stay on 1 - 12, not 14. Overall the hotel was very nice, just too noisy at night.", "Date": "October 15, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Raymond, Nebraska", "Title": "“The cleanest hotel with the best service and value”", "Author": "Brewster68922", "ReviewID": "UR83210710", "Content": "We were greeted at the curb and all the hotel staff made a point of greeting us each time we were seen. The rooms were modern with a small kitchen. The Gas Lamp area has tons of places to eat and find entertainment. Check out the piano bar Shout if you get the chance. I think I liked the location, close to the convention center, places to eat, and places to be entertained.", "Date": "October 12, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Location": "5", "Rooms": "3"}, "AuthorLocation": "", "Title": "“This hotel is new, so obviously the...”", "Author": "yamahakc", "ReviewID": "UR77928138", "Content": "This hotel is new, so obviously the cleanliness and accomodations are great. For the first time...EVER... It was the service staff that made it memorable, specifically the breakfast attendants. It has been my experience that service staff that work the early morning shifts in hotels are generally grumpy and could care less about the customers... Definately not true at this hotel! They made breakfast a joy... They were engaging, remembered us and made our stay FUN! Kudos gals (and guy) for reinventing your position. We just had to get a pic of them to include in our photos of the trip... And they took a great pic (posing with our travel mascot)... A picture speaks a thousand words and you can just see that they work well as a team and have turned a generally unpleasant job into a VERY important part of the whole hotel experience. Keep this group together and your success is inevitable... Again thumbs up from KC--- Jared/Kathi/Limo , and of course Sparkey the Travel Shark", "Date": "September 2, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Melbourne, Australia", "Title": "“New property, good location, friendly staff”", "Author": "travelerMelbourne", "ReviewID": "UR74871859", "Content": "I stayed here for 4 days attending a conference. It's a new property 10mins walk to conference center, in heart of Gaslamp district, one block from 5th Avenue where most restaurants are located, 5 mins to Petco Park, and felt safe walking around this area at night. CVS is 2 blocks away, Ralph's for groceries 7 blocks. All the staff I met were friendly, efficient and helpful. Mona at the frontdesk was outstanding. It's an all-suite hotel, each suite with a fully equipped kitchenette, free fast in-room WiFi, 2 widescreen TVs, comfy sofa, but no baths. Hotel Salomar across the road is noisy on sat nites, but it wasn't too bad when I was there and I wasn't bothered. Breakfast is included but basic. Head across the road to Broken Yolk for a good breakfast. Coin laundry is also available in hotel. Overall, thumbs up, congratulations to all the staff for making my stay enjoyable!", "Date": "August 12, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Los Angeles", "Title": "“Great stay...perfect for travelling with little ones.”", "Author": "givingitback", "ReviewID": "UR74846283", "Content": "Breaking away from work for some quality time with our 20-month old was tough, and we wanted a hassle-free, relaxing vacation (an ambitious goal with an energetic baby). So, we opted for Amtrak over airplanes and chose the Residence Inn by Marriott in San Diego's Gaslamp district. Choosing this hotel was the best decision for our trip. The free breakfast, free internet, swimming pool, small in-room kitchen and fantastic location all proved to be FANTASTIC pluses for us. The location is steps away from a variety of restaurants, Petco park, the Children's museum and public transportation. And, just a few more steps landed us at seaport village and horton plaza. The staff was friendly, incredibly helpful and was able to fulfill our room requests including providing a crib and room away from the elevator for quiet time during those coveted naps...which mean quality time for mom and dad. We very much enjoyed our stay. Thank you Marriott for giving tired parents a great time off.", "Date": "August 12, 2010"}, {"Ratings": {"Overall": "3.0"}, "AuthorLocation": "California", "Title": "“Clean, stylish, Friendly..... and TINY!!!”", "Author": "Kalifornia77", "ReviewID": "UR74101975", "Content": "Some friends and I stayed at this hotel during Comic-Con as it was the closest hotel we could find to the convention center that wasnt sold out. All i can say is, do NOT believe what you see in the photos on the website! We were in utter and total shock when we walked into our room and saw the size of it. The \"full kitchen\" is literally 5 feet long with a dishwasher, fridge, microwave, and 2-burner electric cooktop all wedged into a tiny corner of the room. Well I immediately called the front desk to confirm that this was the room seen on the webstite that i had booked. What i was told was, Every room is the exact same sq footage but some are laid out different than others. The room was very clean and well kept, and the staff was very friendly but we simply couldnt get over the size of the room. It looks NOTHING like the pictures online. Here were some of the more strange and confusing things about the room and the hotel in general: THE BAD 1) There was no sink in the bathroom!?!? The sink and counter is setup outside the bathroom right next to the bed. Great, the last thing i wanna see is other people washing up, brushing their teeth and shaving. 2) No vent in the bathroom!?!? First time ever i have seen a hotel bathroom with no vent system whatsoever. 3) The hotel pool maxed out a 3.5' deep!?!? For a hotel this size how do you not have a pool where the water level comes above adults waists?? 4) The hotel resteraunt and bar. OK im used to paying huge overblown prices for small portions, i mean it is a hotel resteraunt, but when my buddy spent $15 for 4 buffalo wings and 10 french fries, i was kind of shocked. Also the resteraunt/bar area is like the room, tiny! On the website they make the resteraunt look huge and the bar look like a seperate area for drinking, its not and its not. 5) The elevators. I dont know if this is a new trend in hotels but you have to swipe your room card in the elevator panel everytime you want to use it....EVERY TIME. Gets very old when your going in and out a lot. THE GOOD 1) Hotel and room were sparkling clean and updated with new carpet, fixtures and very stylish decor. 2) Staff was very friendly and helpfull. 3) There was a free breakfast every morning, but i didnt have a chance to get at it, but the area they served it in looked very cozy. Overall, clean, friendly, but way too small for the money. Theres no way id reccomend a family of four staying in a room that tiny.", "Date": "August 6, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "3", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "phoenix, arizona", "Title": "“Loved this hotel.”", "Author": "juljayw", "ReviewID": "UR73302907", "Content": "I loved staying a week in this hotel. My Husband needed to attend a seminar for a 5 day period so my 6 year old and I tagged along. The Hotel breakfast had a great variety of foods for my picky child and were very attentive to make sure we had what we needed. The best part was the customer service. I spent an afternoon at La Jolla Cove (13 miles away) with my son and I fell and cut open my leg. Not knowing the area, I returned to the hotel to tend to the wound but my first aid kit has been destroyed during my unplanned fall into the ocean (hence the cut). The valet noticed it first and asked what he could do to help. He helped me into the hotel where the front staff took over and found us bandages and antibiotic ointment. They were very sweet and soothed my 6 year old who was worried. The room was nice and accommodated the 3 of us but I would recommend the upgrade if you have more than two. We were slightly cramped and privacy was an issue. Our only issue was there is no room service and the rooms have no movie service . That would have made the stay perfect. Walking distance to seaport village.", "Date": "August 1, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "3", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Guelph, Canada", "Title": "“Cool, Contemporary, and in the centre of things”", "Author": "Marcello74", "ReviewID": "UR72046684", "Content": "Booked a king one-room suite for my wife and I, as she joined me in town for a post-convention vacation. Despite my request for a higher floor, we ended up on the third floor, and since the hotel was booked full, we had to stick with the room for the first night. Room(s) are not massive, but space enough for two people to survive a week. The building has some nice features to remind visitors of its history - including exposed brick at reception, and sliding \"barn-style\" frosted glass doors in rooms. Ultra cool. The only issue is that such a door doesn't allow for much privacy when it's between the bedroom and the bathroom. Our first room was a king with a full bathroom (including small tub/shower) and pull out sofa, as well as kitchen. When we finally got moved to a higher floor on our second night (I had to pull some attitude with front desk, who maintained that the hotel was still \"very full\"...though in the end, it turned out there were several other rooms available) we were downgraded to a queen bed -- still with pull-out sofa, full kitchen. Our bathroom had a glass and tile shower, though, and no tub. This was fine -- the shower was spacious. Noise from hallways was an issue -- the elevators chime very loudly, and voices of other guests seem to travel right in to the room. When tucked away into the bedroom with the sliding door shut, it wasn't an issue. The kitchen is fully stocked. I was a bit wary of the housekeeping staff replacing used glasses in cupboards, as we knew they weren't going through the dishwasher in our suite. (Hopefully the new glassware came off a cart, and wasn't just wiped and replaced!) Overall, the suite was well-cleaned each day, though the couches in both rooms we had were already fairly grimy. Our shower door leaked a lot of water, but since housekeeping was so good at replacing towels, we just mopped up as we went. Our only issue was not being able to open a window -- long term stays in hotels can make one claustrophobic. An opening window would have been nice...but obviously that's just not possible the way things were built. The free breakfast is a bit of a zoo -- this is a family hotel, and as such, the eating area is over-run with families of all sizes. Still, the food is varied and healthy options are available. Staff work really hard to clear tables and meet the demands of even the rudest guests -- and should be commended for keeping a smile on their faces! Pool itself is small, but the roof top terrace it's on offers a relaxing space to lounge in the hot SoCal sun. Didn't use the fitness room, but loved its location looking down on busy 5th Avenue. Laundry facilities were a most welcome thing as I was travelling over 12 days in total. Free internet was a great perk. Lobby was large, with seating for several groups, a business centre of sorts, and a bar/resto around the corner. The mini-shop in the lobby was handy though priced high. Parking may be priced a bit steep, but the valet guys were amazing at fetching cars and hailing cabs. Overall, this hotel is a relatively cool and fairly reasonable option for staying in the Gaslamp District. Far enough away from train tracks as to avoid those midnight blaring cargo trains, but still in thr heart of the busy and noisy bar/restaurant zone of the Gaslamp. Ask for a higher floor to help with the weekend noise, if you're sensitive to that. Given its popularity and proximity to the convention centre and Gaslamp district, though, you may not be given much choice!", "Date": "July 23, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "New York", "Title": "“Excellent Value for Money”", "Author": "joegold80", "ReviewID": "UR72028131", "Content": "I've spent enough time in Residence Inns (and other low-end Marriott properties) to appreciate great quality. Big, clean rooms, that are well decorated and very comfortable to spend time in. Good service and a decent bar in the hotel (which closed far too early) - also very convenient for the Convention Center and for the restaurants in the Gaslamp Quarter.", "Date": "July 23, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "4", "Overall": "2.0", "Value": "1", "Sleep Quality": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "San Diego, CA", "Title": "“Customer Service is a nightmare!”", "Author": "Henleyco", "ReviewID": "UR71960985", "Content": "Property may be new but they have not spent anytime with customer service. I was basically told, when I complained that the room I was given was not the room type I requested, that they had lots of people that wanted the room (due to a major city wide convention) so either like it or leave it. Front desk has no authority to make any concessions to try to rectify a situation and continued to say that they are very busy so there was nothing they could do. For a premium price, I am amazed that this is the level of customer service and will not recommend the property to future clients.", "Date": "July 22, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "OC", "Title": "“The Best Place For Family and/or Large Group”", "Author": "honeyloveca", "ReviewID": "UR71502232", "Content": "I have stayed here 3 times with family and friends...and will continue to return. The location is walking distance to the heart of the Gaslamp restaurants, pubs, clubs and stores. The room is spacious and complete, like your own studio apartment. The price definitely is a bargain for all the amenities and accommodations that are offered to guests. Breakfast buffet had everything and was completely satisfying.", "Date": "July 19, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Myrtle Beach, South Carolina", "Title": "“Great Place”", "Author": "LJVC", "ReviewID": "UR70846485", "Content": "We have fully enjoyed this Residence Inn and the service has been outstanding. Upon arriving in our room, we could hear the jackhammering going on outside our window. We immediately call the front desk who offered to move us to another room. They then met us at our original room and walked us up to a higher floor and one on the opposite side of the jack hammering. We were told there was construction going on and they apologized. We have valeted our car (even at the high price of $32/night) and the valet staff has been outstanding. We hardly waited at all for the car to be pulled up. The room has been nice also. Only wish there was a desk and a speaker phone but otherwise, it has been very satisfactory.", "Date": "July 14, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Los Angeles, California", "Title": "“Good service, spacious rooms, adequate breakfast”", "Author": "CalAlumTraveler", "ReviewID": "UR70456576", "Content": "My wife and I stayed in Room 1402 from July 2nd through July 4th. We had just come from a hotel in Mission Bay (San Diego) for a work conference. We didn't know what to expect, but we knew not to park there because it costs $32 per night. We found that the hotel was close to public parking ($17 per night). When we entered the hotel we were immediately assisted by staff. He was very efficient and professional. He also gave us a choice between a king bed and a lower floor and a queen bed and a higher floor. We chose the former. We were very glad because we had extensive views of the bay and ocean from our spacious room. The room had a very comfortable bed, a superior television, and everything was clean and in order. The bathroom was ample and the toiletries were of a high quality. Breakfast is on the second floor. Get there early so that you can find a seat; otherwise, you have to take your food back to your room. The food itself was hearty. They had scrambled eggs, potatoes, french toast and a waffle bar. Decent coffee too! Overall, we intend to make this our hotel for summers in San Diego. We typically spend the cooler months in a place in the Little Italy area of San Diego.", "Date": "July 11, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Sleep Quality": "3", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Vienna, VA", "Title": "“Nice, but not for family with 2 teens.”", "Author": "NorthernVirginian", "ReviewID": "UR70090063", "Content": "My employer registered us here for a five-day business trip on which my wife and two teenage boys accompanied me to enjoy San Diego while I worked. While very nice, the two-room suite was too small for us, and we were able to move after two nights to the more spacious rooms at Embassy Suites. The problem was that all rooms in this hotel contain only one double bed and a small pullout sofa that's barely big enough for one person, let alone two people. This might work for a family with two small children, but not for two big teenagers. Also, they were aghast at the tiny pool, no bigger than a small room and only 3 feet deep everywhere. The two rooms were small, although the suite had a fully equipped kitchen. They serve a free breakfast every morning, and are in a great location. A very nice hotel, but best suited to no more than two adults and a child.", "Date": "July 7, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "4", "Overall": "1.0", "Value": "3", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Pembroke Pines, Florida", "Title": "“Great Hotel - HORRIBLE CUSTOMER SERVICE! NIGHTMARE!”", "Author": "Mev1991", "ReviewID": "UR64858598", "Content": "Where to begin? Ah yes, April 14th, a full month prior to arrival when I made our reservation and paid for the entire 3 night stay UP FRONT via the ADVANCE PURCHASE RATE directly through Marriott's site onto my credit card. Stated very clearly on the reservation is \"LATE CHECK-IN\" as my husband and I, along with our 3 y/o would be driving from Disneyland. Guess what happened? Yup, finally made it to the hotel and was told that our room was \"sold away\". Huh? How can this be? It is already paid for, thus already mine. At 9:46pm (as per my cell phone statement) I called the desk to remind them that we would be late and are coming form Disney. I was told that my room was waiting for us and that my request for a sofa bed for my toddler would be honored. At 10:45pm I called again to report that we were lost, but that we were still coming. This time the same clerk stated that there were only 8 rooms left and to hurry. I reminded her that I had a reservation, and she just reiterated to \"hurry\". At 12 o'clock at night, our super-tired family was ushered across the street to another Marriott, told that the room would be compt'd (I'd certainly hope so) and to pack up all our stuff and return the following morning. Again, whaaaaat?!?! So we go across the street like the Griswalds amid a bustling lobby filled with clubbers and ask for our room key. The room was fine, but lacked the kitchenette we reserved with the Residence Inn for all the food supplies we had stopped to buy on the way. Had to toss all perisables. And this other hotel didn't offer the free breakfast like the Residence Inn, either. The next morning, called the desk at Residence Inn. The manager on-duty was very nice and knew who we were and said to come anytime as our room was ready. Got over about 11am and being from EST, were starving for breakfast and mentioned how we missed out. Promptly given a $25 credit and a 10% coupon for the Broken Yolk restaurant across the way. That was the only discount given for the hassle from the night before. And the 10% coupon is given to any guest that asks. Only got the $25 credit because I complained. And the super-nice corner room they supposidely upgraded us to? Well, my brother and his gf happened to be staying there with us, and they got a corner room. So much for the upgrade. They got there from Disney just before us. NICE. Had to stay in a different hotel from my family. I mentioned how I was not satified and asked if the $32 a night valet fee could be taken care of. \"No\" was the answer. Nothing more was done to try to make us happy, so here is your warning. Later, I went to the desk looking for the clerk that said my room was still available the night before. Kelly appears and seems nervous. When asked how on Earth she could give our room away even after talking to her twice prior to arriving, she first blamed the guy that replaced her shift for the night, then said that on busy evenings it becomes \"first come, first serve\". Again, WHAAAAAATTTTT?!?! Then why bother making a reservation? She had no answer. I left the desk uphappy once again. Upon check-out, I had given up on trying to get some satisfaction, a discount, somethng other that $25 for a breakfast we missed out on, not to mention the food we had to throw away. The lady at the desk was different, given in was now Monday and asked the usual, \"How was your stay\" question. Mistake. BIG MISTAKE. Quickly went though the events that had happened upon arrival, and went so far as to mention how we were still not happy. Strike Three....nothing more was done and the general manager's business card was requested. Right after this review is posted, the letter to the GM is getting written. UNBELIEVABLE. The hotel is very nice, new hotel and turned out to be where all the families were. This is a very busy downtown. Try not to go during a game as the Petco stadium is right around the corner. Double and triple check your reservation, just as I did, but understand that at this hotel, a reservation means ABSOLUTELY ZERO to the staff, especially on a busy night.", "Date": "May 20, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "2.0", "Value": "2", "Sleep Quality": "1", "Rooms": "3", "Location": "5"}, "AuthorLocation": "San Diego, California", "Title": "“Unsatisfactory Excursion”", "Author": "AmericanTrekker", "ReviewID": "UR64781926", "Content": "Our 15 May 2010 stay at the San Diego Downtown / Gaslamp Quarter Residence Inn is an unsatisfactory excursion, and as enthusiastic Marriott Rewards participants we are unhappily furnishing the following negative testimonial. DREADFULLY DISAPPOINTING: Although the king size bed and crisp lines are accommodating; comfort is absent because the mattress is exceedingly rigid and the pillows are not firm. Sleep-deprived best describes our excruciating un-restful experience. Management is unsympathetic and apathetic to our request to cancel, penalty free, a pre-paid reservation for next September. BENEATH EXPECTATIONS: Room, in general, is clean; we found a hair beret on the floor next to the sink. Bathroom is extremely small; toilet and shower (no tub) are co-located; with the sink vanity located in the sleeping area. Shower stall is scarcely sufficient to move around in. Roof top pool is small and the chairs and tables are limited even though the space will accommodate twice as many chairs and tables. No in-room safe; only safe deposit boxes at the front desk, which we did not use. Hotel only offers valet parking, which is an expensive $32 per night. MET EXPECTATIONS: Inviting front desk and lobby includes a two-way fireplace. Location is walking distances to many downtown activities and by private or public transportation only minutes away from numerous other attractions and landmarks. Check-in is a quick and effortless experience. Employees provide standard Marriott service; Kelly is sociable and exceptionally courteous. Room décor is well appointed, and the neighboring occupants cannot be heard. Windows do not open; however, the panorama view of downtown is pleasing. San Diego bay is partially visible from the 9th floor. Television is 32” flat screen, mounted on the wall, with a decent cable/satellite channel selection that includes local channels, CNN, ESPN, Explorer, and HBO. However, noticeably missing from the choices are the Travel and Discover channels. Make sure to bring your portable DVD player or laptop; on the side of the television composite plug-ins are available. Sofa and overstuffed chair are comfortable for relaxing, reading, or watching television. Additional furnishings include small kitchen table, and coffee table; no desk. Medium closet contains three drawers, extra blanket and sheet and small ironing board with standard size iron. Individual climate control is simple to operate. Standard amenities, coffee and tea maker, alarm clock, and hair dryer are available. Breakfast is continental; muffins, bagels, fruit juices, fresh fruit, egg sandwiches – with ham or bacon – cereal, yogurt, milk, coffee, and waffles are made hot and fresh by the guest. Fitness Facilities include a reasonable amount of exercise machines. Express check out is uncomplicated. Building interior and exterior architecture is attractive. BEYOND EXPECTATIONS: Car valet is quick and first-rate; after calling ahead, we did not wait for our car as is customary. Dinning choices are abundant. Kitchenette amenities are ample and include dishwasher, stove, microwave, toaster, refrigerator, icemaker, pots, pans, serving dishes, and silverware. Exceptional: The brand new Residence Inn is a short walk to Petco Park, which are the two reasons we choose this hotel. INVOLVEMENT OR INSPECTION INADEQUATE TO INTERPRET: Evening and Manager’s reception. Restaurant dinner delivery. Internet access. Laundry facilities. Pet accommodation. Vie; on-site bar.", "Date": "May 19, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Boynton Beach, FL", "Title": "“This is a great property, modern, upscale, convenient and dynamite staff”", "Author": "Comitis", "ReviewID": "UR63354932", "Content": "I loved this residence inn. It was perfect for my needs during a training course I attended as an instructor. We had the class in the hotel. We could walk to very nice eateries as well as simple fare (e.g. Subway). The Padres stadium is in walking distance as well as the waterside. The staff was very accommodating and genuinely friendly. I'd stay here again. The hotel just opened recently and everything was brand new. The rooms are terrific (the best room was a corner one with huge windows and a view of the harbor - one of my co-workers had it and it was awesome). They could increase the wattage of the light bulbs over the sink, but other than that - thumbs up!", "Date": "May 5, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "3", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "alberta", "Title": "“awesome stay”", "Author": "mountainmanAlberta", "ReviewID": "UR61209298", "Content": "stayed their for 7 days for conference. great location to everything (covention center, gaslamp restuarants/bars, grocery store). i could not believe how friendly,polite,professinal everyone at the hotel is (from the doorman,frontdesk,restuarant staff, and even housekeeping). the best part was the daily HOT breakfast they served, not this continental garbage at other hotels. the room was large with modern kitchenette. came in handy to keep my drinks in the fridge and the leftover dinner from last night just use the microwave oven. i really like the modern decor. you can tell it's very new. the only downfall was the pool (quite small and on the 3rd floor-not much sunshine as you would like and very quiet) and the gym was very small as well. the hotel across the street had a pool on the top floor. now that's the way to do it, with a bar. the other concern was the valet parking, at $32 night, very steep. however, i'm sure other hotels were like that as well. if you rent a car, the best parking is in a car park, much cheaper. overall, awesome stay. had no problems with the hotel. hey, they even have free computer use if you needed to email someone but have no laptop. recommended for anyone to come here. best part was the breakfast, unless your just coffee person in the morning.", "Date": "April 13, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "3", "Sleep Quality": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "New Orleans, Louisiana", "Title": "“Pleasantly Surprised”", "Author": "Gallerygirl_Aug08", "ReviewID": "UR60118101", "Content": "I really enjoyed my stay here. It was close to where we wanted to be. The room was great. The bed was the best. I couldn't believe how comfortable it was. The staff was accomodating and friendly. They explained everything and were very helpful.", "Date": "April 1, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Pine, Arizona", "Title": "“Delighted with my stay”", "Author": "EAZELIFF", "ReviewID": "UR57620298", "Content": "I was booked through Priceline and stayed at this three month old hotel. Excellent in almost all respects. The hotel room, while not what I would call lavish, was one of the best I have stayed in anywhere and was in pristine condition. I give out 5 stars for rooms sparingly, but this room rated. The staff was fine. My only criticism was that at breakfast on the third morning, the French toast and sausage were almost cold, and told the front desk about that. Fortunately, I had not driven to San Diego, so did not have that high parking fee. Even the dining room manager at the Solamar Hotel across the street ( where I stayed a year ago and is a hotel of which I think well of ) spoke glowingly of the new Residence Inn.", "Date": "March 3, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Charleston, SC", "Title": "“Great Hotel!”", "Author": "eakthomas", "ReviewID": "UR57481110", "Content": "We always like Marriott hotels, so we decided to give this one a shot. We loved it! The rooms are some of the nicest we've seen- tastefully decorated to appear modern and minimal, very clean, spacious. Kitchen had everything we needed, down to a measuring cup! Even a dishwasher, which was perfect since we eat cereal in our room for breakfast! We especially liked the 'added touches' that lent to the high end feel. Granite countertops, patterned tile floors, red accent walls, 'shoji screen...' Bed was very comfy. Only gripe would be that there was no bathtub, only a shower. Aside from the room, still no complaints...Lobby is very inviting and gorgeous. Staff was friendly and helpful, including front desk and valet parking. Location was perfect- walking distance to everything we needed. Definitely recommended!", "Date": "March 1, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Palm Springs, California", "Title": "“good location, but very expensive parking fee”", "Author": "yam1978", "ReviewID": "UR55847661", "Content": "great location, walking distance to lots of things, nothing can beat that...although parking for $30 is really expensive, there is a parking lot for $5 a day behind PETCO park...another option good breakfast, included with your rate, comfortable beds bizarre thing about a room, we had a studio suite, and all residence inns i stayed at (and i stay at many) all have pull out sofas in studios with one bed...this one did not; we were travelling with friends, so some of us had to sleep on the floor...just something to consider if there are a few people staying in the room", "Date": "February 12, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "3", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Honolulu, HI", "Title": "“Awesome for access to San Diego Conference Center”", "Author": "bluehawaii2003HD", "ReviewID": "UR55354383", "Content": "This looks like a new hotel and is in a great location. Close enough to the Gas Lamp area and conference center to walk but, far enough away to keep things quiet. The breakfast is good and free. There is a nice place to eat right across the street if you want something better. Parking is expensive at $32 a day valet only so maybe best if your only doing business in downtown to catch a taxi to the hotel. The biggest issue I had with my room was the lighting for the sink. It's only on one side. For my room that was the right side. That made it hard to shave in the morning because of the lack of lighting. I'll try to post photos of what I was talking about for the sink later. Other wise this hotel is great to stay at. Has a kitchen to heat the left overs nice little area to workout in and people watch or have people watch you.", "Date": "February 7, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Newport Beach", "Title": "“Love This Hotel!”", "Author": "Alinachka", "ReviewID": "UR54438536", "Content": "I visited this hotel for a “girl’s trip” with my Mom (she was visiting me for my birthday from Chicago). The hotel is brand new – I believe only about 3 months old (it still has a new smell to it). The lobby is really swanky and you wouldn’t think you were at a Residence Inn. Our room had a full kitchen, with a full size refrigerator, dishwasher, stove, etc. Also, they have a great breakfast each morning (it ends a little early on the weekend – at 9:30 am.) The best thing about the property is the location. You are right in the middle of the Gaslamp district. We parked our car and didn’t touch it for the entire time that we were there. Overall, a great experience, we will definitely be back!", "Date": "January 26, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Orange County", "Title": "“Amazing Experience”", "Author": "acepatrol", "ReviewID": "UR53574775", "Content": "From the prompt and courteous staff, to the clean fresh rooms and hot breakfast this was the best residence inn i've have ever stayed at, and i've stayed at residence inn's all over the country for business travel. The hotel is very well designed, and offers a full bar with food that was actually comparable to the restaurants in the Gaslamp! Also, the bed was supremely comfortable as i got some of the best sleep i've ever had! Thank you residence inn gaslamp!", "Date": "January 15, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Colorado", "Title": "“New Hotel in Gaslight District”", "Author": "scooterpie66", "ReviewID": "UR51822084", "Content": "We stayed here on two different weekends and loved it. On arrival they saw we were celebrating our 25th wedding anniversary and cheerfully upgraded us to a one bedroom suite on the 11th floor. The breakfast was scrambled eggs, bacon or sausage, different breads, oatmeal, waffles, yogurt and fruit. The hotel does only offer valet parking (all hotels in area only offer paid parking) but since it is in the Gaslight district a car isn't totally necessary since public transportation is available. A taxi ride cost $11.80 plus tip from the airport, I do wish it had a shuttle service available to the airport. Many restaurants, pubs, and bars are within walking distance, we had dinner at the Old Spaghetti Factory. There is a CVS Pharmacy and a Borders bookstore and a liquor store called the The Wine Rack within a block of the hotel. We found the hotel very quiet, we stayed on the 11th floor the first time and the 8th floor on our second visit.", "Date": "December 24, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "3", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Salt Lake City", "Title": "“Nice hotel, good location”", "Author": "dizneguy", "ReviewID": "UR51313962", "Content": "We stayed at the Residence Inn San Diego Downtown/Gaslamp Quarter for a long weekend. The hotel had only been open a week when we arrived and everything was clean and well maintained. The staff was friendly. The hotel provided a hot breakfast daily and has the only full service bar/restaurant in any Residence Inn. They also have a manager's reception although we didn't take advantage of it. It is in the hear of the Gaslamp Quarter not far from the convention center so there was quite a bit of activity within walking distance. One drawback of the hotel is that the only available parking is valet and is $32.00 per night. The do have a pool on the third floor roof but it holds 11 people and is 36\" deep so don't plan on doing much more than standing in waist deep water. All-in-All, it was a nice hotel in a great location.", "Date": "December 15, 2009"}], "HotelInfo": {"Name": "Residence Inn San Diego Downtown/Gaslamp Quarter", "HotelURL": "/ShowUserReviews-g60750-d1502048-Reviews-Residence_Inn_San_Diego_Downtown_Gaslamp_Quarter-San_Diego_California.html", "Price": "$191 - $350*", "Address": "<address> <span rel=\"v:address\"> <span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">356 6th Avenue</span>, <span class=\"locality\"><span property=\"v:locality\">San Diego</span>, <span property=\"v:region\">CA</span> <span property=\"v:postal-code\">92101</span></span> </span> </span> </address>", "HotelID": "2515437", "ImgURL": "http://media-cdn.tripadvisor.com/media/photo-s/01/62/0f/82/residence-inn-san-diego.jpg"}}