{"Reviews": [{"Ratings": {"Overall": "4.0"}, "AuthorLocation": "washington state", "Title": "“better than i remembered”", "Author": "mommysunshine", "ReviewID": "UR127571202", "Content": "stayed here two years ago and again this year for a mini spring break vacation. rooms seem like they have been remodeled, cleaner and brighter. halls still a little shabby. breakfast is good, pool area was clean, work out room decent. free parking and walking distance to shopping and dining. well worth the money for Seattle. will stay here again for our next Seattle visit.", "Date": "April 10, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Anacortes, WA", "Title": "“Great hotel for University of Washington area visits”", "Author": "pmccunn", "ReviewID": "UR127569641", "Content": "This hotel is next to the University Village shopping center and near the UW campus. It has a Free shuttle (within 3 miles). Hotel staff were professional, friendly, and very clean cut. Free hot breakfast was good. Their coffee was excellent. The breakfast room gets crowded though. Standard queen room had a microwave, fridge and coffee maker. We had a room in the back of the hotel and it was very quiet..", "Date": "April 9, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Madison, Wisconsin", "Title": "“A good hotel”", "Author": "gaskk", "ReviewID": "UR127303883", "Content": "Staff was very friendly and helpful. Free breakfast, computers, and a free shuttle anywhere within 3 miles of the hotel. Standard rooms - clean, nice, decent location near the University. Free parking.", "Date": "April 5, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Seattle, Washington", "Title": "“Great Staff”", "Author": "s r", "ReviewID": "UR127107210", "Content": "Bank of America was kind enough to cancel my debit card right before I checked in to the Silver Cloud. I was severely sleep-deprived, without cash or another card and stressed out about an upcoming job interview. The front desk could have sent me into a spiral of despair with as much as an exasperated sigh. Instead, they were understanding and offered coffee, food, a ride to BOA and generally made what was a quickly deteriorating day much, much sunnier. Huge thanks to the front desk folks for restoring my faith in customer service and humanity. Oh, and the room was nice for the price, too.", "Date": "April 2, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "3", "Location": "4"}, "AuthorLocation": "NY", "Title": "“Great value and location”", "Author": "Triptaker244", "ReviewID": "UR122900130", "Content": "Feels a little low end compared to fancy-schmancy \"brand name chains\" in terms of updating decor but the service cost shuttle service convenience can't be beat. Also the breakfast is free and convenient with hot coffee available all day. The cost seems very reasonable/cheap. Super friendly service. Close to shopping as well as the hospital/university.", "Date": "January 10, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Comox", "Title": "“Good value in Seattle's University District”", "Author": "hasherdoug", "ReviewID": "UR122472947", "Content": "Booked this hotel through Hotwire for a three night stay over New Years. Very helpful front desk staff. Clean comfortable rooms. They have a shuttle which will take you anywhere within a three mile radius (though not downtown) which we used to go out on New Years Eve. The rooms are nicely appointed and very clean. Breakfast was fairly good with the standard waffles as well as scrambled eggs and sausage, cereals, yoghurt etc. Decent indoor pool and Hot tub.", "Date": "January 3, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Edmonton, Canada", "Title": "“Great experience, great staff”", "Author": "sarahbear74", "ReviewID": "UR122440757", "Content": "We went to Seattle the first week in July for a baseball camp that my daughter was attending at the University. Not only was the price great for the location and amenities, but the staff were very helpful and friendly as well. The Inn/room was very clean but our room was a bit cramped for 5 people. We had 2 queens and squeezed and roll away in there. Parking is also free. There is a shuttle bus that will drive within a 2 mile radius which worked great for us as the University was just down the road and we didn't have to worry about driving and parking fees at the UW. For those wanting to take the bus, there is a bus stop a few blocks away so the walk isn't too bad. The only thing I found wrong and the kids were a bit disapointed in was that the hot tub was down however since the pool was operational, it was only us adults that really missed the hot tub. The next time we go to seattle for ball, I will stay here again. I originally had a hard time trying to find a hotel to stay at that was cheap enough for 5, had a pool for the kids and during the first week in July due to not only Independance day and travelers but the Lions club was also having a get to together/parade with other members from around the world. It was a very busy time :)", "Date": "January 3, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Ponderay, Idaho, United States", "Title": "“Wonderful experience, GREAT staff!”", "Author": "Cat M", "ReviewID": "UR122382097", "Content": "The true meaning of hospitality is alive and well at this GREAT hotel. The staff was friendly and helpful, the rooms were clean and spacious. My daughter was so excited to get to use the pool and hot tub. I work in the hospitality industry and I was amazed at how truely awesome this hotel was. We travel to Seattle every month and I will NOT be staying anywhere else. 110% recommended to anyone who would like a clean, comfortable room with staff that are always smiling and eager to help! Management was also very friendly and took the time out of their busy day to talk with me... EXCELENT experience!", "Date": "January 1, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "camellia10", "Title": "“Good value, good location”", "Author": "camellia10", "ReviewID": "UR121670707", "Content": "The Silver Cloud is in the U Villiage, close to the big newish shopping center. It is in a nice location where you can walk to the UW campus and also to shops and restaurants. The staff was VERY nice. (I was there with a loosely organized group this summer). They offer umbrellas for walking to various local places, and they're really big nice golf umbrellas. The breakfast is nice. The hotel decor does look a bit old, but overall, I think it is a decent stay for the price and location.", "Date": "December 12, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "4.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "3"}, "AuthorLocation": "New York, NY", "Title": "“needs updating”", "Author": "DutchgirlNY", "ReviewID": "UR121282917", "Content": "I stayed here in October 2011. As mentioned in other reviews the service is great and there is free parking. It's next door to a mall and there is a supermarket nearby. The room is equipped with a fridge and microwave. The hotel needs updating though. It felt more like staying in a motel and the decor is tired. I got this through hotwire which was a fair price. If I'd had to pay full price I'd stay somewhere else.", "Date": "December 1, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Winlock, Washington", "Title": "“Great for activities at the UW!”", "Author": "drmorf", "ReviewID": "UR120767936", "Content": "I stayed here for a UW Husky football game in October 2011. I arrived at the hotel at about 9 AM, and inquired I could check in. The game was at 12:30 PM, but I was able to park my car at the hotel and check in after the game. :) The clerk even offered that I have breakfast at the hotel before I went to the game, but I was too anxious to get to the tailgate. :) The hotel is about a 5-10 minute walk from the stadium parking lot as well as the UW campus. Having stayed at other Silver Cloud Inn properties in Seattle and having been impressed, I will once again say that I was impressed. The rooms are large and comfortable...flat screen TV, easy chair and ottoman, nice work desk and chair, mini-fridge, microwave, and wet bar. Free Wi-Fi, free hot breakfast, and free parking! Being close to University Village shopping center, there are numerous shops, bars, and restaurants within walking distance of the hotel. I have booked a room here for a Husky basketball at the end of December, and I hope my experience then will be as good as it was in October.", "Date": "November 18, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "3", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "san juan islands, washington state", "Title": "“Love it here!”", "Author": "lilyroses", "ReviewID": "UR120516309", "Content": "We always stay here when we are in Seattle. Sure there are places that are trendier, but we like comfy, clean, and nice. The heated indoor pool is the best. The hot tub is the best. The beds are soft. With good quality linens and pillows and nice thick towels. Free parking, where our car is safe. Just love it here. Definitely can not go wrong here. There is room service from the restaurant next door. Oh yes, the television movies cost $17 +tax, beware. But the regular TV is free. Nice Aveda products in the room.", "Date": "November 13, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Honolulu, Hawaii", "Title": "“convenient and comfortable”", "Author": "krubin", "ReviewID": "UR119237003", "Content": "Nice rooms, comfortable beds, decent breakfast, coffee always available, free wireless and an indoor pool all make this a good place to stay if you are conducting business near UW. There aren't many restaurants in walking distance from the hotel", "Date": "October 12, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Dallas, Oregon", "Title": "“Nice stay”", "Author": "MMMoore", "ReviewID": "UR118654913", "Content": "We have stayed at this Silver Cloud location on several trips to Seattle. It's comfortable and convenient to the Capital Hill area, where you can find many restaurants and enjoy the beauty of Volunteer Park.", "Date": "September 27, 2011"}, {"Ratings": {"Location": "5", "Overall": "5.0", "Value": "5", "Service": "5", "Rooms": "4"}, "AuthorLocation": "Irvine, California", "Title": "“University of Washington game day hotel”", "Author": "Par71", "ReviewID": "UR118169192", "Content": "Great location and fine hotel near the stadium and the university.", "Date": "September 15, 2011"}, {"Ratings": {"Location": "5", "Overall": "5.0", "Value": "5", "Service": "5", "Rooms": "5"}, "AuthorLocation": "Ocean Shores, Washington", "Title": "“Very Best North Seattle Hotel.”", "Author": "montanasal", "ReviewID": "UR118094621", "Content": "I stay here at least once a month & it has become my home away from home. The staff is always very courteous, friendly, & very caring. The rooms are large with fridge& microwave, also, coffee maker. Tea & coffee are always available in the common room & this room has 4 computers for the guests to use along with a small library. The included breakfast is one of the best..you will never go hungery. The pool is wonderful, always spotless as is the whole facility. The beds are very comfortable & I love all the pillows. The courtesy van is always on time [ best to make a reservation } & will be more than happy to take you to places in the univ. area. You can't go wrong picking this hotel for your stay in the Univ. of washington area.", "Date": "September 14, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "1", "Overall": "4.0", "Value": "4", "Service": "1"}, "AuthorLocation": "Seattle, Washington", "Title": "“Rude Front desk clerk, but very nice room!”", "Author": "RosiePosie135", "ReviewID": "UR116952472", "Content": "The room was small but nice for a hotel that is close to the \"U\" district. The male staff member at the front desk during my check in made me feel unwelcome as he was barking orders to another staff member about which room I was to stay in. I thought that I was getting a top floor room, but I was put in a bottom floor room next to a back door. It was very noisy as people were entering and exiting the hotel to the parking lot. Since I was only staying for the night, I didn't request a different room. The breakfast was crowded, but the food was plentiful and hot. Other than the rude man at the front desk, I would recommend this hotel to anyone who wants to stay in the area.", "Date": "August 19, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "4", "Service": "5"}, "AuthorLocation": "Winthrop, Washington", "Title": "“Very Nice”", "Author": "Pattywilson", "ReviewID": "UR116649869", "Content": "Check in staff very helpful and courteous. All areas very nice and well kept. The breakfast was very good and the breakfast room comfortable. Lots of pillows and the beds are very comfortable. Location was great within walking to great food and shopping.", "Date": "August 13, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "4", "Service": "5"}, "AuthorLocation": "HalfMoonBay, CA", "Title": "“Nice location, courteous staff.”", "Author": "swimbc", "ReviewID": "UR116263732", "Content": "I stayed here for two nights in late July. I stayed in a King Suite on the 4th floor. The room was quite spacious although a little overkill for one person. The breakfast was convenient and quite good so far as free hotel breakfasts goes. The exercise room was well stocked and all was functional although the treadmills have magnetic safety latches which kept coming off. That was rather annoying. Rooms were clean. Restaurant suggestions were good. Parking was plentiful.", "Date": "August 4, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "3.0", "Value": "4", "Service": "3"}, "AuthorLocation": "Port Moody, Canada", "Title": "“Good for an overnight”", "Author": "ColleenMaitland", "ReviewID": "UR115928977", "Content": "We have stayed here twice, the location works for us when visiting family in the area. The price is good and the breakfast is included, one of the best breakfasts from a chain hotel. The location is walking distance from the University Village Shopping Centre and really close to the medical offices in the area.", "Date": "July 28, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "4", "Service": "5"}, "AuthorLocation": "Yakima, WA", "Title": "“A Great Place to Stay!”", "Author": "FoodieFemale", "ReviewID": "UR115597534", "Content": "This hotel was very clean and comfortable. The cost of the room included a very generous breakfast buffet. There was an indoor pool which pleased my significant other and I was delighted by our proximity to my son's home in Laurelhurst and the University Village shopping center. There's a free shuttle service which will take guests anywhere within a three-mile radius. We definitely will stay there again!", "Date": "July 20, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "4.0", "Value": "4", "Service": "4"}, "AuthorLocation": "Edmonton, Canada", "Title": "“Nice place to stay, close to shopping with good service”", "Author": "lostcomma", "ReviewID": "UR115003025", "Content": "It was a friday night in june I had decided on to go to the baseball game and needed a hotel for the night. I shopped around and a week and a half before most of the hotels downtown were booked or needed my right arm for payment since it still works I decided to look outside the downtown area. That meant about $20 outside of downtown by taxi with light traffic. The University area was recommended by a forumn so I looked at the silver cloud. I got the last room and at a cheaper rate which was nice but still on the upper end of my budget but I am cheap. I arrived via a wild goose chase, that gps sent me on, surprising how if you mix up one digit how fussy those thing can get!! Well I had driven by it several times in my chase and missed it even when I had corrected my navigation. The Foliage out front had foiled my recon. I checked in quickly and noticed that the staff was definitely a notch above from what I am used to dealing with, they were profession, obvious, and neatly attired. They at the time, were checking in Senoirs and treated them like gold and I saw this more than once on my stay. The breakfast room/lounge with coffee and tea all day is just to the left of the Front Lobby. The lounge also is the shares a wall of the inside pool which is flank by windows for you viewing pleasure. I saw no such pleasure during my stay though. Off to the room, I missed the shuttle so I had to walk, just kidding but man are those hallways long. To me, a room is a room, is a room. When I do pay a lot for a hotel room, it's because of demand (location) so they don't spend a lot of money on the accoutrements . This place was not like this, very nice but don't expect the Ritz. Oooohh a fridge and a micowave hidden below the TV, maybe I had forgotten about this but I was glad to have a place to put a cold beverage. The fridge in the end made my drink a little too icy cold. Some one had turned down the control and it made for somewhat slushy drinks, still drinkable though. The internet is the old wired kind wired kind so bring your own wires. This may seem like an inconvience but most wifi at hotels is spotty and inconsistent so throughput was high and so was I, surforically speaking. I was happy as a lobster that will never turn red. The parking is tight, if you have a Smart car it will be commodious, if you have an mid sized SUV your going to take up more than one stall and if you arrive late you might be SOL. I have a compact car and it's definitely door ding heaven for a autobody guy. It especially nice when you see a white mailbu taking up two space on purpose to avoid such periles. I ALMOST....Periled him. Location, pretty good. Their is a newish mall just down the hill called University Village . http://www.uvillage.com/welcome/ William-Sonoma, VS, Crate and Barrel, Pottery Barn, Pottery Barn for kids, Restoration Hardware store, a local chocolate store called Frans, a large two Floor Barnes and Noble with two café's?, two sweet shops, two confection shops, plus more, and a fried chicken store called QFC. Quality Fried Chicken hmm it was so large it could have been a grocery store and then again maybe... There are several Starbucks on site, the largest one you really don't need to buy coffee in, as the level of decibals is enough to wake the dead. I guess it was Sunday morning. Their is a street called university something with a collection of bars, shops, eating est. not far and definitely gear for the local demographic that's worth checking out. I went for a walk up the hill and past Barf Donalds , Papajohns pizza, econotune for cars and Local fast food joint called Kidd Valley. http://kiddvalley.com/ It seemed to be the favourite of the town with all the \"best of\" awards on the walls. The shake was good, the fish thingee I chose was nothing special but burgers are their mainstay. If you need your Volvo serviced or traded their is a dealer ship at the top of the hill also. Their were a Italian or fancy pizza restaurant and Mexican restaurant on the other side of the road. I also hear, their is a University near by if your into to that kind of thing. The bed was comfy and the room was extremely quiet for a hotel. I had issues with the tv. Normally I don't even turn the thing on but I just wanted to look at the weather channel. It's optimized for Pay for View so the local channels are all fuzzy and to many button pushes away for my liking. If you remember what channel, and input it directly after getting out of the payperview menu it is slighty easier but still fuzzy. For some reason I got a wake up call at 9. I was just about to go back to sleep, when I realized that I could take advantage of the free breakfast I had missed out at the last 4 places I had stayed at. I knew I might be getting the remains of the morning but hey, I was up and hungry and in for a pleasant shock. The place was packed. They had real food, snausages, scrambled eggs, coffee, juice, begals, toast, fruit, and a place you could make your own waffles. I was enamoured by this process and anticipation of fresh waffles. Don't for get to spray each side of the waffler maker and pour the batter from the cup provided by the batter dispenser quickly on to the waffle iron. I did it slowly and then tried to add more batter which just ended up runniing over once I flipped the iron to do it's thing. First and only place I have ever had this opportunity. I am either a 5am checkerouter or a right to the wire and this time I left the room at exactly 12noon to take one of two trips to load the car to leave. I couldn't get back in to the hotel, some one let me in, then I could not get back into the room. I asked the maids for help but I had to go to the front desk to re activate my card. I paid more but got more. The staff are good at their jobs because it's what they do for a living and the place reflects that. It is also means they look after the details which is probably why I couldn't get back in my room after checkout time. Would I stay again, if I could fanagle a bit cheaper rate to assauge my scottish frugality, Yup. The rates here reflect the value and level of service. You pay more and their is more, which where I live isn't all that common. Remember though, it's just a hotel don't expect it to change your life. On a final note the foliage at the front provided a nice recluse with two benchs and an ashtray for those who want a smoke outside (non smoking hotel and legally away from the front door ). The location puts you very close to the streets and traffic but the foliage provides a quieting effect that works well. Again with the attention to detail.", "Date": "July 4, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Ogden, Utah", "Title": "“Great location, quality service and friendly, helpful staff.”", "Author": "twopot", "ReviewID": "UR112810613", "Content": "My new son-in-law was recently named the new President of the University of Washington. We came from Utah, along with several other family members and friends, for the wedding ceremony which was held at their new residence. While we all stayed at this hotel I am only speaking for myself and my husband - we were very pleased with the accommodations and the friendliness of the staff.", "Date": "June 11, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Tacoma WA", "Title": "“Very nice hotel”", "Author": "arlenejoe", "ReviewID": "UR98550149", "Content": "This was a terrific hotel! Perfect for our visit with our UW students who live in the immediate area. Parking is free and easy. Breakfast is free and tasty. Service is excellent and friendly. The room was impeccably clean and tastefully furnished. It was QUIET!!! Good value for the area. Highly recommend!!", "Date": "March 1, 2011"}, {"Ratings": {"Overall": "3.0", "Service": "1"}, "AuthorLocation": "seattle", "Title": "“Don't Let Them Put You On Hold on Phone, Don't Rely on PCs or Printer”", "Author": "SensitiveEars", "ReviewID": "UR95665428", "Content": "The breakfast is good, the pool is great (because I was the only guest using it. But boy, how can they say (when they put on hold!) \"We care about our guests\" when they feed you all these tiresome messages about Silver Cloud Tacoma and other things you have no interest in?!! Why don't they show some true caring and consideration for their guests by NOT making us listen to their awful propaganda while on hold. Why don't they let us GET SOME WORK DONE, treat us as they prefer to be treated, and play soft music while we're stuck on hold. Oh, the wireless was generally good and if there's a problem they can fix it or work around it. But watch out if you need to print something! The printer that is for laptops to connect to is terrible, and the PCs for guests to use are even worse.", "Date": "February 6, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "3", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Fairfax, Virginia", "Title": "“Comfortable and Convenient”", "Author": "2CountryWalkers", "ReviewID": "UR92024221", "Content": "Clean, comfortable and convenient--the Silver Cloud--University did a fine job of meeting my needs while I was in Seattle visiting family in the Greenlake area. There aren't as many hotel choices in this northern section of the city. My relatives, who live near the hotel, recommended it and said that they often put up out-of-town guests there. While the Silver Cloud wasn't cheap, the lowest price I could get for my room was $129, it was more than adequate and included a substantial breakfast. The king size bed was comfortable, the room was immaculately clean, and the hotel was just a short walk from the extensive University Village shopping complex. I wouldn't hesitate to stay there again.", "Date": "January 6, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Mililani, Hawaii", "Title": "“Nice hotel, near great mall and complimentary breakfast.”", "Author": "melia57", "ReviewID": "UR85811940", "Content": "I enjoyed my stay at the Silver Cloud Inn. The location was great in the University area and right next to University Village where you can do lots of shopping. Nice, friendly staff and clean rooms. I enjoyed the complimentary breakfast, especially making my own waffles. They also provide shuttle service in the area which is a plus if you don't have a rental car.", "Date": "November 3, 2010"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Olympia, Washington", "Title": "“GREAT TIME”", "Author": "angelabrake", "ReviewID": "UR82685987", "Content": "highly recommended, free shuttle service is a great ammenity.", "Date": "October 9, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "4", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Dallas, Texas", "Title": "“Great price, incredible service”", "Author": "dukefan2331", "ReviewID": "UR82086031", "Content": "Great execution all the way around. Provided us with an upgraded room (as requested) that was fabulous. What we really liked though was the \"going the extra mile\" level of service. Two great examples: 1. We are very anxious to get to our destination, and often arrive well before check in time. We know the drill (drop our bags in the back, stop back later). Here at a very minimalist place, the staff not only stated they would run our heavy bags to our room - they actually did it! So when we came back later, we were simply handed keys and did not have the burden of carrying the bags. Since the shift on was a different shift, the people that provided both the promise and the level of service did this without receiving a tip, and knowing that they probably wouldn't. An excellent way to start the stay! 2. When we arrived, we asked to take the shuttle to the U District. It was occupied when we arrived. But rather than make us wait, the same Front Desk people gave directions on how to walk over to the U District via the Burke-Gillman trail. We had much more enjoyment walking over via the Trail and walking through UW's campus. Great room, great service, filling breakfast, very efficient place. I have stayed before, and I would stay again.", "Date": "October 4, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "3", "Overall": "3.0", "Value": "4", "Sleep Quality": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Kennewick, wa", "Title": "“Wonderful staff, great location...the hotel needs a little face lift.”", "Author": "willshawna", "ReviewID": "UR82055396", "Content": "I can't say enough about how helpful the staff was! Being right near the U and shopping was great. The breakfast was ok, a little too crowded. Free self parking. The hotel's interior is looking a little tired. Very noisy betweeen 6-8 in the morning with doors slamming. The rooms are fine. It is always nice to have a frig and microwave.", "Date": "October 4, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "oxpress", "Title": "“best customer service I have ever experienced”", "Author": "oxpress", "ReviewID": "UR77835086", "Content": "Really impressed with this place. It had free wifi in rooms, excellent breakfast included, local free shuttle service. The staff were without exception amazingly friendly, helpful, efficient. The room itself was very nicely equipped.", "Date": "September 1, 2010"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "washington state", "Title": "“perfect for what we needed”", "Author": "mommysunshine", "ReviewID": "UR59627308", "Content": "i traveled here with my family (husband and two young girls) for a conference at the university. Although not the fanciest hotel we have stayed in it was perfect for our needs. We stayed in the one bedroom suite, there was a fridge and microwave. The local shuttle was a plus, although it did only go to a 3 mile local radius. (I think the previous reviews that talk about it being close to pike place and downtown were actually reviewing the downtown silvercloud inn- this one is not close enough to walk downtown.) It is close to the university including the medical center and childrens hospital. It is right next to the university village which is an upscale outdoor shopping mall, and there are many close restaurants.", "Date": "March 27, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "3", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Northeast", "Title": "“Great value, nice location, helpful staff”", "Author": "tripsrfun07", "ReviewID": "UR57755981", "Content": "Had no problems with check in. Staff seemed friendly enough. Could tell the cleaning people really work hard to keep the place spotless. A little disappointed that the \"local shuttle\" did not bring us downtown to Pike Place, Space Needle, etc. It only brings you around a 3 mile radius. However, the lady at the front desk was helpful with which bus to take and where to get it. Room was clean, beds were not so comfy. But, for the price, it was worth the stay. The location was great as it was near a nice mall. It also had a nice path for a nature walk. The path is used by people of all types, college students, seniors, moms and their kids. We didn't use the pool, but it was a nice size and looked clean. Breakfast was okay. Had the basics + a waffle maker. Would've liked a hot egg entry instead of the hard boiled eggs. Would definitely stay here again.", "Date": "March 4, 2010"}, {"Ratings": {"Overall": "3.0"}, "AuthorLocation": "Holland, Michigan", "Title": "“Ok place, switched my room for better paying client ?”", "Author": "Rocstdy", "ReviewID": "UR48238034", "Content": "much like a comfort inn, but try's to be more prestigious if in the area, decent location to move around town actual stay was in the mid 90's", "Date": "November 1, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "4", "Rooms": "5"}, "AuthorLocation": "Ottawa, Canada", "Title": "“Very nice hotel”", "Author": "snuggsie", "ReviewID": "UR46646088", "Content": "We stayed here for our first visit ever to Seattle. The hotel is very classy place and we got a great, quiet room in the middle of the hotel. it seems to be in a good past of town with a 20 minute walk of Pike market (there is also a periodic free shuttle bus available). The only downsides were the fairly basic, continental breafast and the relatively high overnight parking rate of $16 plus tax.", "Date": "October 12, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Washington State", "Title": "“Clean hotel, nice experience”", "Author": "Scmita", "ReviewID": "UR46587978", "Content": "I stayed two nights while attending a conference at the hotel. The king room I had was VERY clean. It has been some time since I stayed in a room that clean. The room was nice, if not deluxe. It had a microwave and small fridge, something that seems to be rare as of late. I am picky about beds, this one was fine but nearing the end of it's comfortable life. Big flat screen tv was nice. Quiet except some limited early evening heavy-footed walking above my room. My colleague stayed in an idetical room next to mine and also liked her room, noticed how clean it was as well. Standard hotel breakfast. Waliking distance to lots of things. Overall I liked it very much.", "Date": "October 11, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Location": "4", "Rooms": "4"}, "AuthorLocation": "San Diego, CA", "Title": "“Excellent Experience Overall”", "Author": "Fashionating", "ReviewID": "UR43469768", "Content": "When we first pulled up and I saw how close we were to the hospital, all I could think of was, \"Oh, no.\" I am a very poor hotel sleeper and all I could think about was how tired I was and how much I needed to be able to sleep. BUT, this hotel was like an oasis in the middle of an urban area. My family and I have stayed at a lot of hotels and I think this one is excellent. The staff was super friendly, knowledgeable and they really took care of us. Additionally, the restaurant, \"Cayenne,\" was pretty darn good and the wait staff treated us so well that we ate there a lot. Overall, an excellent experience and I would definitely stay there again should we make it to Seattle again. Make sure to get the top floor -- maybe that helped our situation. Also, for the kids, there's a really nice pool to unwind after a loooonnnnngggggg day of walking. Oh, and before I forget, they have a free shuttle with the nicest drivers -- truly, it was a great deal, and if we knew then what we know now, we would not have rented a car -- we never used it except to get from the airport and then to the airport. A huge waste of money!", "Date": "September 22, 2009"}, {"Ratings": {"Service": "1", "Cleanliness": "5", "Overall": "3.0", "Value": "3", "Location": "3", "Rooms": "3"}, "AuthorLocation": "Seattle", "Title": "“Poor Front Desk Service”", "Author": "MooreT20", "ReviewID": "UR27200451", "Content": "Based on my negative experience with the front desk staff, I will not return to any Silver Cloud. Everyone I encounter behind the desk acted cold and indifferent. It appeared that they were more interested in surfing the internet than answering general hotel questions. While I found the front desk customer service skills terrible, the housekeeping staff did a nice job and were always friendly. As I was preparing to leave, I saw a Silver Cloud customer service survey in the room. I filled one out highlighting both my positive and negative thoughts. I guess management (or the hotel in general) just throws them away. As of today, I’ve received no indication that my concerns were ever received. Don’t have comment cards if you don’t want to hear what your guests have to say. To me, customer service is a big deal and it appears the staff and management does not care to make any improvements.", "Date": "March 31, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "4", "Check in / front desk": "4", "Overall": "4.0", "Value": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Pouilly-en-Auxois, France", "Title": "“Very well situated”", "Author": "FredLong", "ReviewID": "UR20635115", "Content": "I stayed at the Silver Cloud almost 3 weeks under some heavy circumstances, one member of my French family being hospitalized at the University Hospital. The staff was always kind to me, helpful, smiling. The rooms had nothing extravagant, but were very practical, quiet and clean. At last, the hotel is well situated, not far from the Huskies stadium, the hospital and the University village, where you'll find any convenient store.", "Date": "October 5, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Business service (e.g., internet access)": "3", "Check in / front desk": "4", "Overall": "4.0", "Value": "3", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Georgia", "Title": "“Nice Place to Stay”", "Author": "sjenks183", "ReviewID": "UR19972967", "Content": "I haven't stayed at many hotels in Seattle however I travel alot and this hotel is very nice. This is my 2nd time staying here within a 10 month period and I always feel safe in and out of the hotel. They have wine and o'dourves on Tuesday evening 5:30-6:30 which is really nice. It was also nice to see some of the same staff members still working here from the last time I stayed here.", "Date": "September 11, 2008"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "4.0", "Value": "3", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Wilmington, MA", "Title": "“Spotless Hotel”", "Author": "anitajd", "ReviewID": "UR19094271", "Content": "My family of 5 stayed at the Silver Cloud-University for 4 nights in Aug. 2008. We reserved a \"Suite\" which included a king bed and a pull-out sofa. Unfortunately, it made the room(s) much smaller. The family really liked the 2 large plasma TVs in each \"room.\" Although the room colors seem outdated, we were all impressed as to how CLEAN the room and the bathroom were (it's been a while since a hotel bathroom impressed me). The breakfast buffet had a great selection and was constantly being replenished. I thought the price was a bit high, but breakfast and free wireless internet was included. The hotel also has a nice pool. Our one minor complaint (which was partially our fault) is we believe our son's stuffed animal was accidently put in a trash can (by his brother). I wish the hotel maid would have taken it out or turned it in to the front desk. oh well.", "Date": "August 18, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Business service (e.g., internet access)": "4", "Check in / front desk": "4", "Overall": "3.0", "Value": "4", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Richmond, Canada", "Title": "“Good location if visiting University of Washington”", "Author": "SJ46", "ReviewID": "UR18824333", "Content": "The Silver Cloud near the University of Washington is very functional and family friendly. It has the usual continental breakfast included with the cost of the room common to other Silver Cloud Inns which we find very good. You can basically make a simple breakfast like most of us eat at home: toast, bagels, coffee, juice, yogurt, waffles, that sort of thing. The shuttle service is common to all Silver Cloud Inns and this one will take you to points within three miles of the hotel. We took the shuttle up to the university bookstore (which was big and excellent by the way). Later the shuttle picked us up and brought us back to the hotel when we phoned for it. I noticed not too many people tipped the shuttle driver which I thought was kind of cheap as the shuttle service saved us a lot of hassle if we had taken a taxi, bus, or driven ourselves. Note: the shuttle service at this hotel won't take you to downtown Seattle as it's over the three-mile limit. There is a big shopping center right next door to the hotel with plenty of shopping & restaurants. This hotel is great if you are attending any functions at Husky Stadium. We walked to the stadium from the hotel in about 15 minutes through a very safe area. The rooms are clean and big enough. We were two adults and two teenagers and got by ok with two queen beds and a sofa bed roll-out. There are no spectacular views from the Silver Cloud Inn University like there are at the Silver Cloud Lake Union. However it is functional, safe, and easily accessable from Interstate 5. The staff are very friendly and helpful. It also has free laundry facilities which can be used till 9 P.M. The fitness area is not great and there are no mats in it at all so plan to do your stretching in your room rather than on the hard floor of this fitness area. There are some aerobic machines and free weights as well as a universal gym aparatus. We would stay there again if we were visiting the university or going to a Husky football game.", "Date": "August 10, 2008"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Check in / front desk": "5", "Overall": "4.0", "Value": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "south carolina", "Title": "“great for university visitors”", "Author": "juanm13", "ReviewID": "UR16989765", "Content": "Stayed for three nights for graduation festivities for our son. The rooms are average but spotless. The continental breakfast offers a wide selection of cold foods. There is a waffle maker, and plenty of comfortable seating space. We made use of the hotel shuttle on several occasions , an added plus. The front desk staff were extremely helpful and pleasant. I would definitely return to this establishment and recommend it to all who want to stay near the university.", "Date": "June 17, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Business service (e.g., internet access)": "5", "Check in / front desk": "4", "Overall": "3.0", "Value": "3", "Rooms": "3", "Location": "2"}, "AuthorLocation": "midwest", "Title": "“OK. Kind'a pricey with nothing to justify it”", "Author": "egatrop", "ReviewID": "UR16389582", "Content": "The hotel was clean, well kept. The rooms were average to perhaps slighty above average. Some have nice plasma TVs. The location has nothing going for it except two things- It is near the heart the University, and there is a pedestrian/bike trail right along side it. PROs- Front desk staff was very good- nice, helpful. They will shuttle you around to local places, but their schedule is somewhat regimented. House keeping people did a good job and were friendly. The complimentary breakfast is good. It actually had food that contain protein- hard boiled eggs, cheese, yogurt, peanut butter, self made waffles, lots of fresh fruit (whole oranges, apples, bananas, etc) oatmeal, cerals, etc. CONS- My \"discount\" rate was very high- $179/night. The \"PRO\"s do not justify the price. It is not exactly \"just off the highway.\" Seattle traffic is bad, and you will thoroughly understand that statement after staying at this hotel. There is no nice place to sit outside. The only outside benches are for smokers, and they sit right next to the busy street. Bummer, for being in such a nice climate. Recommendations- Get a room on the 3rd floor or higher, on the north side. (South side faces student housing and we had a student party go on until early morning hours.) The 1st floor is the basement and the view is the parking lot. The Second floor is the reception floor. The 3rd floor rooms have nice(r) views.", "Date": "May 25, 2008"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Business service (e.g., internet access)": "3", "Check in / front desk": "3", "Overall": "1.0", "Value": "2", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Sacramento", "Title": "“Show me your money, credit cards and luggage”", "Author": "annworthi", "ReviewID": "UR10294314", "Content": "My husband and I have stayed at the Silver Cloud and recommended it to other friends who have also found it to be convenient to the UW stadium. Recently, during a home game at the stadium, we left our purses in one of our friends' rooms and came back to no purses, wallets and a suitcase was gone. The maid hadn't made up the room and it is our belief that someone on that staff alerted a thief to grab and run. Management didn't see that way although the Seattle police certainly felt strongly that it was more than likely an inside job. So, the rooms are nice but don't leave your suitcases, jewelry, money or packages in the room. Better yet, sleep outside, but make sure you get a pass to put in your windshield or your car will be towed.", "Date": "October 24, 2007"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Business service (e.g., internet access)": "4", "Check in / front desk": "4", "Overall": "4.0", "Value": "4", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Brooklyn", "Title": "“Great place to stay”", "Author": "TravelLawyerFamily", "ReviewID": "UR10078767", "Content": "In a small commercial area near a residential one. Couple blocks away from major supermarket and shopping center. We stayed a week and found it reasonably priced. We don 't eat out much so being near the supermarket was handy. A little difficult getting to with the nearby exit off the Interstate but we got used to it. Good continental breakfast. Pool was good. Needs a TV in the workout room.", "Date": "October 14, 2007"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "Worthington, OH", "Title": "“Sliver Cloud University - Great Hotel”", "Author": "tinkerelle", "ReviewID": "UR10006373", "Content": "What a gem of a hotel in the University district of Seattle. The rooms were clean and had wonderful amenities. But what makes this place tops in my book was the staff. They were so knowledgable and helpful for two tourists from Ohio. We send kudos to the night desk guy (Mark?) who was so helpful to us as we checked in and gave us all kinds of great tips and really made our stay enjoyable. The breakfast was a bit more than continental (waffles, etc.) and was wonderful. My only complaint is the parking. Spaces are really tight due to lack of real estate in the area.", "Date": "September 26, 2007"}, {"Ratings": {"Cleanliness": "4", "Check in / front desk": "3", "Overall": "4.0", "Value": "3", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Benicia, Ca", "Title": "“We enjoyed our stay”", "Author": "TZK", "ReviewID": "UR8245170", "Content": "Driving to the hotel from Interstate 5, there are a couple of confusing turns but the directions we printed from the hotel's website got us there without a problem. Parking is free & we didn't have a problem getting a space. Because we booked late for a special event weekend, we had a king suite, which was bigger than we needed - also more expensive. However, it was nice having the extra room. The sitting area had a large, flat panel TV mounted on the wall but, as far as we could tell, there weren't any HD channels. There was also a TV in the bedroom. The kitchenette area had a microwave, refrigerator, bar sink & 4 sets of dishes & silverware. The vanity/sink was outside the bathroom. The hotel recently opened a new fitness center which was a lot larger than their old one. The continental breakfast was ok but was very crowded. There are lots of restaurant choices at the upscale University Village mall just 2 blocks from the hotel. We thought the food at Atlas Foods was excellen; there was a lot of fresh seafood but other types of food as well. The front desk clerk recommended Speciality's Cafe for lunch; the food was good & the cafe seemed to be very popular.", "Date": "July 27, 2007"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "4", "Overall": "5.0", "Value": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Brisbane", "Title": "“Excellent Value and Comfortable Close to Uni”", "Author": "C J Mitchell", "ReviewID": "UR5797625", "Content": "Fantastic value and comfortable room and bed. Quiet, even next to elevator. Staff were very helpful and happy. Breakfast was continental and sufficient for my needs. Great location near Uni Village shopping mall as the fridge was empty. I stayed for 5 days. The pillows and bed were very comfortable. Shuttle bus to Uni was responsive, great service and great location. A mix up with the check out date was the only inconveience and thankfully the staff corrected the situation with ease. Great spot for conference attendees.", "Date": "September 13, 2006"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Boulder, CO", "Title": "“Perfect”", "Author": "mav111", "ReviewID": "UR5518781", "Content": "Wonderful. Room was clean, comfortable, in excellent condition. wireless internet worked perfectly. Bed was super comfortable - slept better than at home. Quiet, even next to elevator. Breakfast was continental plus - very adequate. Excellent location, on the bike path to campus. Staff was perfect.", "Date": "July 27, 2006"}, {"Ratings": {"Cleanliness": "5", "Overall": "5.0", "Value": "5", "Service": "5", "Rooms": "4"}, "AuthorLocation": "New York City", "Title": "“Previous Reviews say it all”", "Author": "chrismtlnyc", "ReviewID": "UR4144215", "Content": "I got to agree with all the previous reviewers, this hotel is awesome. I stayed here back in September visiting the University and everything was great. It's right next to a classy mall, the hotel has shuttle service to many places. It does not go downtown, but that's ok, you can hop a cab and it's really quite cheap. The staff is incredible, come straight to your need whenever you ask for them. Breakfast was wonderful, a lot more than your standard continental, that's for sure. I will definitely be back.", "Date": "November 26, 2005"}, {"Ratings": {"Cleanliness": "5", "Overall": "5.0", "Value": "5", "Service": "5", "Rooms": "5"}, "AuthorLocation": "Port Angeles, WA", "Title": "“Unequalled Service Anywhere!!”", "Author": "cjcrowson", "ReviewID": "UR4049326", "Content": "I stayed at this hotel for my birthday last January as a present from my my daughter, and I can honestly say it was a most wonderful birthday present. I was treated like a king there; the staff was wonderful, and the room exceeded all expectations. I am in the hospitality industry myself, so I tend to be critical when I stay at other properties; knowing what good service should be I am not easily impressed. If you have a chance while in Seattle, WA., don't miss a night at the Silver Cloud at the University district; you will not be dissapointed.", "Date": "October 24, 2005"}, {"Ratings": {"Cleanliness": "4", "Overall": "4.0", "Value": "4", "Service": "3", "Rooms": "4"}, "AuthorLocation": "Pacific Northwest", "Title": "“Great Location!”", "Author": "jxnmom", "ReviewID": "UR3426119", "Content": "We stayed at the Silver Cloud for 3 nights while attending a wedding. Because we had 3 adults, we chose a 1 bedroom suite. The bedroom was a separate room with a sitting room area and small kitchenette. The room was very comfortable and reasonably priced. The complimentary breakfasts were excellent with a wide assortment of items to choose from. The hotel is within easy walking distance of the University Village Shopping Center with restaurants and great shops!", "Date": "April 29, 2005"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "Aberdeen, WA", "Title": "“Great place to stay!”", "Author": "vegasORbust", "ReviewID": "UR2479295", "Content": "We stayed there on July 18th, 04. If you are going to Childrens Hospital, this is the place to stay. It is about 5 minutes away. Has a pool for the young ones and an excellent continental breakfast in the morning for free. Restaurants right across the street. Friendly staff and free internet access. Alson provides a shuttle to hospital if needed. Very quiet and safe neighborhood location. Is a little off the beaten path, but well worth the search!", "Date": "August 20, 2004"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "Chesapeake, Virginia", "Title": "“Excellent choice”", "Author": "A TripAdvisor Member", "ReviewID": "UR2082006", "Content": "While visiting Seattle over Mother's Day weekend I had the opportunity to stay at the Silver Cloud Inn. The staff was top notch, the room was large, the jetted tub was a fabulous treat after a long flight. I can guarantee continued visits.", "Date": "May 20, 2004"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "Santa Fe, NM", "Title": "“Fabulous location in University District”", "Author": "A TripAdvisor Member", "ReviewID": "UR1428965", "Content": "Clean! Comfortable! Fantastic location for the area!!", "Date": "October 30, 2003"}], "HotelInfo": {"Name": "Silver Cloud Inn - University", "HotelURL": "/ShowUserReviews-g60878-d123021-Reviews-Silver_Cloud_Inn_University-Seattle_Washington.html", "Price": "$148 - $194*", "Address": "<address class=\"addressReset\"> <span rel=\"v:address\"> <span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">5036 25th Ave. NE</span>, <span class=\"locality\"><span property=\"v:locality\">Seattle</span>, <span property=\"v:region\">WA</span> <span property=\"v:postal-code\">98105</span></span> </span> </span> </address>", "HotelID": "2515028", "ImgURL": "http://media-cdn.tripadvisor.com/media/ProviderThumbnails/dirs/de/d7/ded70beba485fa662bc7e09dddb0e0c51large.jpg"}}