{"Reviews": [{"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "3", "Location": "4"}, "AuthorLocation": "USA", "Title": "“Good location and charming hotel”", "Author": "Abe G", "ReviewID": "UR119219961", "Content": "Had a brief 2-night stay at this hotel. We picked this since it was close to the apartment we were renting but could not get for a consecutive 5-night stay. The hotel is located in a quiet area but 2-5 minutes away from restaurants and cafes. There are a couple of good bakeries (one right opposite the hotel, the other near Rue Larribe/Rue de Constantinople) - we relied on these for breakfast and skipped the one at the hotel. The hotel is very clean and so are the rooms & bathrooms. Room size is smaller than your average hotel in the US but in line with Parisian standards. The staff put up a baby bed for our son without we requesting for it so was a nice touch. Staff was very friendly. The lady at the reception one morning (and the kitchen staff) went out of the way to help get warm milk (no charge) for our son. Also helped call a cab for us when needed. The Villiers metro is minutes away (under 4 min.) & there are at least 2-3 ATM's within easy reach - again 2-4 min. away. Would definitely stay here again.", "Date": "October 12, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Aurach bei Kitzbuehel, Austria", "Title": "“Pretty location and pleasant stay”", "Author": "amankora", "ReviewID": "UR118969228", "Content": "Friends of mine live in this street and recommended this hotel. It is one the nicer three star hotels in Paris with pleasant lounges and pretty rooms for the standard with spacious bathrooms. The beds are good, the decor is simple but nice and it is clean. The rates are o.k. during the week and very attractive on week-ends. As usual in Paris the staff is not very friendly but o.k. Will book there again next time.", "Date": "October 5, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "", "Title": "“This is a charming hotel in a great little area.”", "Author": "Kb1220", "ReviewID": "UR118572240", "Content": "This hotel was a great find. This was our first time to Paris and we would definitely stay here again. The desk staff was very helpful and spoke English well enough to communicate with us. Great restaurants and bakery within steps of the hotel. We chose to walk to all the sites, which allowed us to explore the neighborhoods between. The metro was only a 2 minute walk from the hotel and is a link to everything. Again awesome area without being over the top.", "Date": "September 25, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Brussels", "Title": "“Great decoration, excellent service”", "Author": "Calinnn2007", "ReviewID": "UR118442097", "Content": "I have stayed in this hotel 5 times until now. Design rooms, quiet, very close to the metro and not far from the Champs Elysées. Personnel is very helpful, price very competitive.", "Date": "September 22, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "4.0", "Value": "3", "Service": "4"}, "AuthorLocation": "Vancouver", "Title": "“Nice hotel and location, typical small/simple Parisian room”", "Author": "brently55", "ReviewID": "UR116529842", "Content": "The staff were friendly and helpful. Cozy feel upon entering. Breakfast was very good, liked to fresh squeeze my orange juice. Wifi was spotty in the lounges. Good central location. Room was quite small and fairly basic but comfortable enough. Bathroom was a good size with good quality finishings. We faced the inner courtyard so it was very quiet. Would stay again if able to get a decent price.", "Date": "August 10, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "4", "Overall": "4.0", "Value": "3", "Service": "5"}, "AuthorLocation": "London", "Title": "“Very Parisian, good small hotel.”", "Author": "Swish_tripper", "ReviewID": "UR115749905", "Content": "If you can get a rate of around 100-140 euros I think this is a good choice for central Paris. As others have mentioned the bakery across the street is lovely and means you have a way of avoiding the overpriced breakfast at the hotel. (I stayed over Easter saturday/ Sunday and so the bakery was closed and I did have the hotel breakfast which was ok, but for 12 euros...!!) The room; Small but with lovely old style windows, short double bed (sheets and blankets, rather than duvet though were clean) good desk, TV with lots of international channels. Plenty of storage/ hanging space and a safe and minibar. Classic furnishings in dark colours (red, dark gold/yellow) Bathroom: Needs better lighting and would be better with a sliding door as is so small. Was lovely to have a bathtub with showerover though, Great toiletries (olive oil, rustic, simmilar to L'occitane- :-) French country style sink. Staff were helpful and arranged taxis etcet. Bar is small, but had everything, you just need to ask. Local area very good. Near park, metro and good local shops. Easy walk to main sights.", "Date": "July 25, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Sydney, Australia", "Title": "“Great neighbourhood and close to transport”", "Author": "glinkot", "ReviewID": "UR115015771", "Content": "We stayed here in late Jun for 5 nights. Ash cloud delayed our arrival by 1 day and hotel didnt charge us for that night- a very nice gesture. Our Window looked out at the artisan baker across the road. Not far to Rue Lepic, a great little culinary heaven. Movies and lots of restaurants to choose from. 24 hr reception also and helpful staff. Room clean, renovated and lift was handy. Would stay again.", "Date": "July 4, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Reading, United Kingdom", "Title": "“Lovely small hotel in a chic area - but a few annoying quirks”", "Author": "PrettyGoodLife", "ReviewID": "UR102400093", "Content": "The hotel is in a lovely non touristy area, and it does feel special and boutique. Pros Lovely area Just by Parc Monceau - great for kids Nicely done, with good attention to detail (i.e. large soft towels Feels quite exclusive Friendly staff Close to Metro and taxis Cons Bathrooms are pokey, not sure why they need 2 basins rather than room to move or an effective shower screen Bar facilities are very limited. It is not 4 star so lacks details like someone to help with luggage, bathrobes etc. if that is what you are looking for A wide variety of prices quoted. We were part of a large party most of us paid E150 (at the top end looking at some reviews) but others paid even more E180! If you are sleeping on the street side the rubbish collection early in the morning is VERY loud. Some of our party had problems with the air conditioning not working", "Date": "April 1, 2011"}, {"Ratings": {"Cleanliness": "4", "Overall": "4.0", "Rooms": "4", "Service": "3"}, "AuthorLocation": "London, United Kingdom", "Title": "“Strategic position,nice rooms and reasonable price.”", "Author": "TheTravellingGabo", "ReviewID": "UR65211054", "Content": "Given the average price of the hotels in Paris,this one is just perfect. We paid 90 euro per night,the room was nice and clean,the location is just fine,everything is at reasonable distance and the area is nice!", "Date": "May 24, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Location": "4", "Rooms": "4"}, "AuthorLocation": "Vevey, Switzerland", "Title": "“A little gem!”", "Author": "sassydove", "ReviewID": "UR36550230", "Content": "I stayed at the Relais Monceau for 3 nights with my mother. The rooms are parisian style small but perfectly formed, with comfortable beds and extra pillows. We didn't really watch much TV but it was a modern set with mainly french channels but also a few foreign ones. The bathroom was nice and clean, with a bath and shower and 'his and hers' sink. Breakfast was very good, with nicely cooked bacon and fresh scrambled eggs plus the room where breakfast is served looks very nice. Staff was very friendly and spoke english. The hotel is located at the expensive and exclusive 8th arrondissement and very close to the Villiers metro station. I found the area safe and clean, with great restaurants and bars. I would highly recommend a visit to the famous Lenôtre patisserie/traiteur which is just around the corner, absolutely delicious! If you are the sort of person who likes to spend a lot of time at the hotel, then you might get bored as there is no swimming pool, gym or films on TV. We only used it as a base for a few hours in the morning and late at night but it did exactly what we wanted it to do, to serve as a safe and comfortable base to explore Paris. I would definitely recommend it to anyone who wants to stay in a pleasant, no fuss hotel.", "Date": "August 3, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Location": "4", "Rooms": "4"}, "AuthorLocation": "Cologne, Germany", "Title": "“3 wonderful days in Paris”", "Author": "joel11", "ReviewID": "UR31463209", "Content": "This charming hotel is situated in a small street close to the Metro Station Villiers. It is a very nice little hotel with rather small but clean rooms, bathroom with tub, a modern TV-set as well as a fridge. Breakfast ist very good, fresh scrambled eggs every morning, fresh fruit salad and a variety of cheese and marmelades. The only thing missing was cold cuts. I am sure if we would have asked they would have privided us with some. The staff is very friendly and helpful. There are some restaurants and cafes in the near vicinity of the hotel. We highly recommend the Risi E Bisi (81, Rue Rocher), a small and nicely decorated italian restaurant with great food at good prices. You should definetly stop by the La Petit Rose ( 11, Boulevard Courcelles) a great pastry shop full of sinfully delicious sweets!", "Date": "June 3, 2009"}, {"Ratings": {"Cleanliness": "4", "Check in / front desk": "3", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "London", "Title": "“Decent, well-appointed hotel in convenient location”", "Author": "Reviewer13", "ReviewID": "UR10237868", "Content": "Room was booked by our Australian friends for the World Cup rugby semi-finals, but they didn't need it and unexpectedly we did! The room was very quiet, end of corridor overlooking a courtyard. The decor was pleasant and the room was a reasonable size for Paris. The hanging space was behind the headboard which was a good use of space, but only room for a few items (fine for a weekend). The bed was a small double (140cm) rather than king size (150cm) but comfortable. The bathroom was a bit cramped (with the basin behind the door), but decent shower with the usual shower screen that is too small so you soak the floor. Everything was clean and in good condition. It seemed to me that this hotel (or at least our room) was most suited to a single person on a business trip. However, we were perfectly happy there and had a good night's sleep (although short after staying out late to celebrate the win over France). The price of 170 euros seemed very reasonable considering the completely exceptional demand and high prices for accommodation that weekend. Can't comment on breakfast or other aspects of the hotel as we didn't use anything and did not have time to explore the local area. However, it was easy to get to and from (Villiers metro or 15-20 mins walk from Gare St Lazare).", "Date": "October 22, 2007"}], "HotelInfo": {"Name": "Hotel Relais Monceau", "HotelURL": "/ShowUserReviews-g187147-d229609-Reviews-Hotel_Relais_Monceau-Paris_Ile_de_France.html", "Price": "$153 - $257*", "Address": "<address> <span rel=\"v:address\"> <span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">85 Rue du Rocher</span>, <span class=\"locality\"><span property=\"v:postal-code\">75008</span> <span property=\"v:locality\">Paris</span></span>, <span class=\"country-name\" property=\"v:country-name\">France</span> </span> </span> </address>", "HotelID": "2515251", "ImgURL": "http://media-cdn.tripadvisor.com/media/ProviderThumbnails/dirs/47/7c/477cdead8a41e7692af4733cdd6eeb8d11large.jpg"}}