{"Reviews": [{"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Mexicali, Mexico", "Title": "“Good stay, great service.”", "Author": "jfernandez76", "ReviewID": "UR128491893", "Content": "Located near Tijuana border makes this hotel a good choice if you happen to take a plane in Tijuana Airport or if you are there for business. Rooms are clean and spacious, service was outstanding, breakfast is standard Holiday Inn. There are some fast food restaurants nearby, like Carl's Jr, Jack in the box, Wendy's and Little Caesar's. Will definitely stay here again, have to mention that price was more than adequate.", "Date": "April 23, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "5", "Location": "4"}, "AuthorLocation": "California", "Title": "“Reasonable Fares”", "Author": "WolverineX", "ReviewID": "UR128397368", "Content": "The staff was very polite and friendly. The hotel is far from everything, very close to the border with Mexico. We went for a three days stay and everything was great...I read the reviews before booking this hotel and must agree with most of them. I read someone saying that this hotel was boring and there was nothing to do so, it was perfect for me since I was looking for a hotel not close to a highway and far from everything, this was it! My only \"complaint\" is that the carpet in the hallway could use some deep cleaning or be completely replaced.", "Date": "April 23, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Corona", "Title": "“Good location for Cricket Amphitheatre events”", "Author": "David M", "ReviewID": "UR127312864", "Content": "Stayed here in March for a concert at Cricket. While the hotel was well off the beaten path, it worked out well for us. Hard to get a bite to eat though. Wendy's at the Pilot gas station down the street was the closest option...That's something you should know if you decide to stay out this way. The hotel itself was very nice. Good rooms, comfortable beds and nice staff. The breakfast in the morning is up to par with any other HI Express, so it was good. This property is very close to the Border - that wasn't a factor for me, but it makes some folks uncomfortable. I didn't have any anxiety about it and I don't think that you should either. If you need to be down this way, well away from the heart of San Diego, this is a fine place to stay the night.", "Date": "April 5, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "3"}, "AuthorLocation": "Orem, Utah", "Title": "“Very reasonably priced but far from city center”", "Author": "PrasoonChoudhary", "ReviewID": "UR119978834", "Content": "The room was very good and clean. The breakfast was adequate. But the location is not very close to city attractions. I would recommend if you want good hotel at good price and willing to commute little", "Date": "October 31, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "4.0", "Value": "4", "Service": "5"}, "AuthorLocation": "Seattle, WA", "Title": "“Very happy with my stay!”", "Author": "Fibbersfan", "ReviewID": "UR117104184", "Content": "I usually stay in the Hotel Circle area when visiting San Diego with my children. I read many good reviews of this hotel near the border and decided to book it! My children and I both were very happy with our stay. The staff was polite and professional! The pool/jacuzzi area was clean and well maintained. The rooms were clean and comfortable! The free breakfast offered many items and tasted great! I felt totally safe and secure in the hotel! The hotel can be a little hard to find, so print directions before you head there! The drive to downtown San Diego is really no big deal and we never hit any significant traffic! I will be staying at this hotel whenever my family heads back to the San Diego area.", "Date": "August 22, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Santa Barbara", "Title": "“Very nice hotel”", "Author": "judyr460", "ReviewID": "UR117091001", "Content": "We were in San Diego as tourists and stayed here because the price was right even though it's a bit off the beaten patch. It's a suprisingly nice hotel and the service and staff exceptionally helpful. We enjoyed it and certainly recommend it to others. Jose and Gloria at the desk get special mention for being helpful.", "Date": "August 22, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "3.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Mumbai (Bombay), India", "Title": "“Great Place to Stay if you are on Official Trip and your Office is nearby”", "Author": "sonia2302", "ReviewID": "UR116972000", "Content": "Its a Great Place , value for money if you are on business Trip and your office is nearby . You can save on lot of time of Travelling . Its near to Border and LAs Americas outlets , a great place for Shopping . Staff is very Friendly . Rooms are very Spacious , clean . The only disadvantage is that it is bit far from Downtown. On weekdays you can use Public Transport like Bus which you can easily get from nearby stop and the Tram form IRIS station which is the cheapest option . But on sundays , Private Cab is the only option to visit town .Cabs are easily availbale near the Border . Even the staff is very helpful and guides you for transporation", "Date": "August 20, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "4", "Service": "5"}, "AuthorLocation": "Edmonton, Canada", "Title": "“This is a must-stay!”", "Author": "OKTraveler82", "ReviewID": "UR116321226", "Content": "Rarely have I stayed in a hotel where the staff seem to genuinely care about their guests. Everyone we dealt with (especially Gloria at the front desk) were extremely helpful and never too busy to serve us. Even housekeeping was very friendly. The room was very nice as well. We found it quiet, spacious, and very relaxing. Good continental breakfast too. The location is a bit out of the way but otherwise no complaints. Highly recommended!", "Date": "August 5, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Monterrey, Mexico", "Title": "“A little hidden jewel”", "Author": "MTYMatilda11", "ReviewID": "UR116003242", "Content": "This hotel is located near the Mesa Otay Border, inside of what I only describe as a Business park. But, this makes it very quiet at nights! Also, the price is notably lower than the hotels near San Ysidro or San Diego. I stayed only for 1 night in a suite... and wow! I was amazed when I opened the door. The room was really big, with a kitchenette, a small sitting area and a big and comfy bed. Location offers complementary breakfast with a variety of things to choose from and start the day with the right foot. Is a good choice if you are travelling to Tijuana and don't want to stay there... the border is so close, that you could get there in 5 mins.", "Date": "July 30, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "3"}, "AuthorLocation": "Dallas, Texas", "Title": "“nice quiet and clean”", "Author": "dallasjohnjohn", "ReviewID": "UR101151147", "Content": "cheap, nice, a little far from downtown but its worth it", "Date": "March 22, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Riverside, California", "Title": "“Better to stay here than in TJ”", "Author": "Trader1109", "ReviewID": "UR81666795", "Content": "I had business in Tijuana Mexico across from the Otay Mesa border crossing. I like to stay on the US side when possible and this hotel is about 1/2 mile from the border. The hotel is newer, clean and quiet. Everything in the room worked well. This is the second time I have stayed at this hotel and again, I was pleased. I like the Holiday Inn Express setup. The shower head always works well, there were two kinds of pillows, hard and soft. The free internet access was fast! The desk was big enough and plenty of sockets for my gizmos. The room also smelled good. What I do is drive my car to the paid parking lot right near the border then walk across and take a taxi to my destination. There is a long line now to enter Mexico and you never know how long the line will be to drive out, so I walk. The line to walk through the check point is almost always faster.", "Date": "September 30, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Trumbull, Connecticut", "Title": "“Fab value clean and friendle”", "Author": "efoden", "ReviewID": "UR56618451", "Content": "Stayed here for 9 nights easy to get to with major highways. Yes, it is very close to the border however it is an easy 20 min car ride to San diego. This saved on city hotel parking fees at $14 a night. Hotel staff very helpful and pleasant. Breakfast nothing exciting but fruit and cereal available as well as greasy stuff. Coffee is horrible there is a Starbucks up the road which really helped. Housekeeping left the room really fresh every day with new soap, towels every day. Great to have a microwave and fridge, laundry was useful too as we needed to freshen clothes as only brought a few. Rooms were spacious - we had a suite which had a little seating area with a sofa bed and table, beds very comfortable and so were the pillows. There are some really good restaurants in Otay ranch to the north 14 miles away or 4miles via 125 toll rd $4.50, local fast food places too. Free internet access and a business centre with a printer so we bough discount tickets before we went to attractions an saved a load of $ doing this too. For our family this was ideal as we got breakfast and no parking fees and were going to be going in the car on trips every day. Easy to get to legoland, San diego zoo, etc, we even ended up in Yuma AZ one day! Better than some 4* i have stayed in you wouldn't know it was rated 2.5*", "Date": "February 20, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "California", "Title": "“Was a great stay”", "Author": "relaxed520", "ReviewID": "UR25896007", "Content": "A little tucked away new and quiet hotel. The staff was great and gave me perfect directions to get there. I brought my kids for a day at the pool. The hotel was clean and the pool was warm. The breakfast with hot items was great. We had biscuits and gravy and scrambled eggs. There were a few good restaurants in the area for dinner. We will be back again and again.", "Date": "March 9, 2009"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Check in / front desk": "1", "Overall": "1.0", "Value": "1", "Rooms": "1", "Location": "1"}, "AuthorLocation": "Las Vegas", "Title": "“ABSOLUTELY TERRIBLE. Will never stay here again.”", "Author": "bestabillojr", "ReviewID": "UR21101632", "Content": "This was a vacation for a family of four (two kids) to San Diego. First of all, location is too far from Zoo, LegoLand, SeaWorld, downtown, restaurants. If you want quiet and away from everything, this is for you. We stayed seven (7) days and had the free breakfast everyday and were out of the room by 9am everyday. For three days, the room was not cleaned when we got back. We always got back at 4pm or after. They never sent anyone to clean the room. They always said \"housekeeping is gone for the day.\" They did not send someone up to bring fresh towels. We had to go down to the front desk and pickup new towels ourselves. We also had to throw out the garbage ourselves. For two days, the toilet got clogged. The first day, they partially unclogged it while we were away. It was not fully unclogged when we returned and generated a \"slow flush.\" The next day, it became fully clogged again and I reported it as we left for the day. They did not unclog it while we were out. When we returned, I reported it over the phone to the front desk right away and they said someone would be right up. 30 minutes later, no one showed up and I called again. Same reply, \"someone will be right up.\" 30 minutes after that, still no one, I went down to the front desk and reported it in person. Same reply, \"someone will be right there.\" 20 minutes after that, I went down to the front desk and asked for a plunger which they gave me and I unclogged the toilet myself. They also did not serve their advertised cinammon rolls for 2 days and one of their vending machines was out of order for the entire 7 days. This was all reported to management and to Holiday Inn Guest Relations. The only reply I got was from Guest Relations saying they would contact the hotel general manager. I never heard from anyone from the hotel directly. This is the worst hotel stay experience I have ever had. I have been traveling for 10 years and have over 100K miles with 4 different airlines and have stayed in many hotels. I am currently a Gold member with Holiday Inn. I have stayed at Holiday Inns from Hawaii to the East Coast. I have no problem with the chain in general. This one single hotel and its management is the problem. Holiday Inn should terminate their franchise agreement with this hotel. I will never stay at this hotel again no matter what it is called. I highly recommend the same to everyone.", "Date": "October 22, 2008"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Baltimore", "Title": "“Very Good”", "Author": "EarlyToBed", "ReviewID": "UR19826288", "Content": "New Hotel, clean and taken care of. Rooms were nice, beds very comfortable. Good breakfast in the morning. I would recommend this hotel. The neighborhood doesn't offer anything in the way of ambiance, mostly offices and industrial park. But, it's safe and clean and well run. Good for the business traveler or those passing through the Otay Mesa border crossing.", "Date": "September 6, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "4", "Rooms": "5", "Location": "3"}, "AuthorLocation": "San Diego, California", "Title": "“New & nice in a far off location.”", "Author": "hanzors", "ReviewID": "UR13305534", "Content": "The Otay Mesa, CA Holiday Inn is very new and really a nice place to stay. We did get lost and I'm from San Diego. It's in a very off location (905 freeway) and in a business/industrial area. I kept second guessing if I was driving the right way and we called the front desk like 4 times for directions. They were very helpful each call. It is located in south, San Diego so if you're planning to tour the central part of the city, it's about a 25-30 minute drive north to get to downtown San Diego.", "Date": "February 6, 2008"}], "HotelInfo": {"Name": "Holiday Inn Express Hotel & Suites San Diego Otay Mesa", "HotelURL": "/ShowUserReviews-g60750-d631235-Reviews-Holiday_Inn_Express_Hotel_Suites_San_Diego_Otay_Mesa-San_Diego_California.html", "Price": "$74 - $153*", "Address": "<address> <span rel=\"v:address\"> <span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">2296 Niels Bohr Court</span>, <span class=\"extended-address\">Otay Mesa</span>, <span class=\"locality\"><span property=\"v:locality\">San Diego</span>, <span property=\"v:region\">CA</span> <span property=\"v:postal-code\">92154</span></span> </span> </span> </address>", "HotelID": "2515655", "ImgURL": "http://media-cdn.tripadvisor.com/media/ProviderThumbnails/dirs/66/ab/66ab93fe11e22b2462e7461463f7dcfa8large.jpg"}}