{"Reviews": [{"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Langley, Washington, USA", "Title": "“Great value and location”", "Author": "Posted by a cheaprooms.com traveler", "ReviewID": "UR127629833", "Content": "We would stay there again if we had a function or were flying out of Seatac Airport. Clean, safe and very nice for the price.", "Date": "April 10, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Yakima, Washington", "Title": "“Not the best I've ever been to”", "Author": "Madog7famly", "ReviewID": "UR127331748", "Content": "I can say it was clean and it served its purpose, but there are things I did not like. First, we had to stop to get directions and the person giving directions told us it was a bad neighborhood and not to get out and walk around. Parking is underground, very crowded, and not too many spaces. The shower was clean, but the paint was peeling above the showerhead. The teenagers in the family complained the whole time. Limited does mean limited. The continental breakfast was adequate, but not very extensive and not much seating. It was about 20 minutes to downtown Seattle, so that worked well. The people working the counter were very friendly, can't say so much for reservations. When I called the guy couldn't understand what I was saying and I couldn't understand what he was saying. There's also the matter of the people in the floor above stomping around at 7:00 in the morning. We could hear every step they took, and it did sound like a herd of elephants. We chose the low cost to save money for spending in Seattle for two days, so that was the bonus with staying here.", "Date": "April 5, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Iowa City, Iowa", "Title": "“Accommodating stay at the Ramada”", "Author": "genealogyresearch", "ReviewID": "UR126500724", "Content": "Ramada made my impromptu overnight stay a pleasant one. My flight was cancelled and I was able to book a room at the Ramada. They did a great job handling many passengers from the cancelled flight, polite, understanding, and friendly.", "Date": "March 22, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Sleep Quality": "4", "Rooms": "3", "Location": "3"}, "AuthorLocation": "San Francisco,CA", "Title": "“Gets the job done.”", "Author": "craig_traveler", "ReviewID": "UR126371770", "Content": "Stayed for two nights over a weekend. No frills, but offers modern conveniences including mini-fridge, microwave, scores of TV channels, free wi-fi propertywide, parking, and noon check-out. Downsides are an early check-in fee, even if they have rooms available, of $25, and old school AC units that can be a bit noisy. Also, dont be fooled by the location. The poperty is located a bit set back from International Blvd. and is very easy to miss.", "Date": "March 20, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Location": "4", "Rooms": "4"}, "AuthorLocation": "Palmer, Alaska", "Title": "“Clean comfy great!”", "Author": "viva-sabata", "ReviewID": "UR121765282", "Content": "We stayed in a room with two queen beds. With two teens in tow it would be better if they had rooms with one queen and two twins. Overall great. We stay here every time we have a SEATAC layover and will repeat.", "Date": "December 15, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Manchester, United Kingdom", "Title": "“A good standard hotel”", "Author": "Pete27_10", "ReviewID": "UR121349981", "Content": "A good location to explore the city, good food, especially the eggs benedict for breakfast. This trip was prior to the date on here.", "Date": "December 3, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "3"}, "AuthorLocation": "Lafayette, Colorado", "Title": "“Horrible place to stay”", "Author": "amlawley1", "ReviewID": "UR119109168", "Content": "I would recommend that you stay anywhere but here. We had planned a family trip to Seattle and had stayed in many Ramadas before that were very nice. This place was centrally located between the family and friends that we were visiting and the attractions we wanted to see in Seattle. One of our rooms was filled with ants the other smelled so bad it became unbearable. The beds were uncomfortable and the staff was unwilling (or able) to help us in any way. We asked to change rooms and their answer was that we were in the rooms that we had paid for. The place was so bad that we ended up sleeping on the living room floor of a family member. That was much better than having to spend another minute in this horrible place.", "Date": "October 9, 2011"}, {"Ratings": {"Location": "4", "Overall": "1.0", "Value": "3", "Service": "1", "Rooms": "3"}, "AuthorLocation": "Austin, Texas", "Title": "“Booked through hotwire, hotel wanted to charge me!”", "Author": "SunniK", "ReviewID": "UR118162494", "Content": "I had a terrible experience with this hotel and hotwire. I'm not sure what their arrangement looks like, but the hotel was unwilling to give me a room for three adults as I had reserved (and had printed confirmation of) (they claimed to only have one room with a queen size bed) without charging me for a rollaway. Suddenly, a cancellation came through and they had a room with two queen beds, but still would not surrender the room without charging me extra. It was just a bad experience.", "Date": "September 15, 2011"}, {"Ratings": {"Cleanliness": "2", "Sleep Quality": "3", "Overall": "2.0", "Value": "2", "Service": "2"}, "AuthorLocation": "jettalady", "Title": "“won't recommend...”", "Author": "jettalady", "ReviewID": "UR117237374", "Content": "This is a very small hotel, the parking is underground with limited above ground. We requested & were told our room was non-smoking... yet as we walked into our room the door was open to our across the hall neighbours who had a smoking room...? I suppose they figure smoke doesn't travel across the hall? The room was very small (2 queen beds & one chair). There were no face clothes in the room (2 hand & 2 bath towels) The wifi was a nightmare to use... and was not secure. (and we were on the bottom floor close to the office) The bathroom tub had holes in the walls above the shower... and looked like it hasn't had a good scrub down in a long time. Looking around the whole place could use a major reno. Breakfast was the typical; bread, english muffins, cereal & (1) machine to make your own waffles. There was fruit as well including bananas that all looked like they were ripe a couple of days ago. We went down for breakfast at 7am, there are only 3 tables for the whole hotel to sit down... so my family sat at a table while I took a couch as there were no more chairs... soon people were standing to eat.", "Date": "August 25, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "4.0", "Value": "4", "Service": "5"}, "AuthorLocation": "Houston, Texas", "Title": "“This is the Great Ramada \"Limmited\" - NOT the OTHER \"questionable\" Ramada down the road...”", "Author": "FishFinderDoug", "ReviewID": "UR116637686", "Content": "I wish to make things straight. This hotel was wonderful. There is nothing to complain about. Seeing the reviews, I was worried, especially with the not-so-stellar comments. I need to point out that this hotel does not have a Chinese restaurant in the lobby. This is not the hotel referred to in some other reviews. The staff was very knowledgeable and friendly. I would stay here every time I come to Seattle. Our driver picked us up within minutes and had us at the hotel quickly. Check-in was super fast and the room was excellent. They even had in-room internet. Warning-there is only one restaurant walking distance. It's right out the front door, that is if you're daring and want to try Somalian food. Had a great time.", "Date": "August 12, 2011"}, {"Ratings": {"Cleanliness": "2", "Sleep Quality": "4", "Overall": "3.0", "Value": "3", "Service": "3"}, "AuthorLocation": "Boulder, CO", "Title": "“A slightly dirty room, not much more”", "Author": "cosoxfan", "ReviewID": "UR116565921", "Content": "got this place at a low rate thru Hotwire, so expectations were low. And they were met. The beds and bathroom were clean, but the rug could use a serious once-over. Our ground floor room had a screen hanging off its rail, so we couldn't open the window on a nice night. But on the plus side, it was pretty quiet and relatively convenient to SeaTac. All in all, got what we paid for.", "Date": "August 11, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "4.0", "Value": "5", "Service": "5"}, "AuthorLocation": "", "Title": "“I can refer this Hotel...”", "Author": "mjello98", "ReviewID": "UR116547702", "Content": "Has enough room space for 4 persons clean, good and friendly service, just no warm breakfast aside from the waffel.", "Date": "August 11, 2011"}, {"Ratings": {"Cleanliness": "1", "Overall": "1.0", "Value": "1", "Service": "1"}, "AuthorLocation": "Seattle, WA", "Title": "“I am here now for a business conference, the place is terrible!!!”", "Author": "1beachroamer", "ReviewID": "UR116383104", "Content": "We are here in this hotel the service is horrible! The room is boiling hot, management has been notified at least 3 times with no response. The mens room is disgusting. It is not yet 9am and there is paper all over the floor, the floor is dirty, no paper towels in the dispenser, but on the back of the toilet, the soap dispenser is broken. All this being said, the parking lot is filled to capacity. Stay away from this place until better reviews are posted. You can see my history, this is not my character to write in such disgust.", "Date": "August 7, 2011"}, {"Ratings": {"Cleanliness": "2", "Sleep Quality": "2", "Overall": "3.0", "Value": "4", "Service": "4"}, "AuthorLocation": "Huntington Beach, California", "Title": "“Wrong side of Seattle”", "Author": "CatHendron", "ReviewID": "UR116036459", "Content": "They had a reasonable rate & provided a continential breakfast. The staff was very nice & professional. The smoking room had burned blankets, very dirty carpet, dirty curtains, broken air deflector on air/heat unit, & no screen in the window. After leaving the maid a tip, we were given better blankets & sheets, extra coffee & our room was well cleaned daily. The biggest surprise of our stay was the neighborhood. There are signs stating that the area is known for drug activity & prostitution. Also, all license plates are video recorded. The Ramada neighborhood was obiviously scary & not a place to be alone at night.", "Date": "July 30, 2011"}, {"Ratings": {"Cleanliness": "2", "Sleep Quality": "2", "Overall": "2.0", "Value": "2", "Service": "3"}, "AuthorLocation": "Houston, Texas", "Title": "“Mediocre-basic at best”", "Author": "houstonturtle", "ReviewID": "UR115720105", "Content": "I stayed at this hotel during a last-minute business trip because it was the only hotel available in the Seattle area (Manchester United was playing so all hotels were full). The hotel is basic at best. Location is 2 minutes from SeaTac International airport, easy access to I-5 to downtown. The staff is friendly and helpful, but one can't help but get the sense that manning the front desk is their \"side job\" (everyone was dressed differently like they just rolled in from the nearest coffee house and their demeanor was friendly but nonchalant). There is a Chinese restaurant in the lobby which is not affiliated with the hotel, the food is not good - but I ate there anyway because it was late and I had an early start the next day. The rooms are your basic Ramada rooms. A bit dated, comforters, sheets, and towels were a bit worn and stiff from too much washing in bleach (hey, at least they bleached them!!). The bathroom was clean. Free internet was good. Microwave & ironing board in the room. Coffee maker didn't work. What bothered me most, and the reason for the low rating, was that the carpets in my room felt dirty, which made me feel that the entire room was dirty. It's one of those places that I just didn't feel comfortable walking barefoot. All in all it was OK since I didn't have any other choice, but I would not come back if other options were available.", "Date": "July 24, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "5", "Overall": "3.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Temecula, California", "Title": "“We were scared, WE WERE WRONG. It was just what we needed!!!”", "Author": "wetravelforwork", "ReviewID": "UR115466163", "Content": "We read the reviews, we re-read the reviews, we said \"no way\" it could be that bad. The staff was polite, attentive, and accomodating. The room was worth the price, the parking was excellent, the access to everywhere we needed to go was easy. The nieghborhood was older, but we never felt unsafe. I'm not sure what the bad ratings stem from, but our experience was \"just what we needed!!!\" Thanks.", "Date": "July 17, 2011"}, {"Ratings": {"Cleanliness": "1", "Sleep Quality": "1", "Overall": "1.0", "Value": "2", "Service": "1"}, "AuthorLocation": "Hawaii", "Title": "“What a nightmare!”", "Author": "mka1021", "ReviewID": "UR114746006", "Content": "Where to begin? The hotel is NOT on that street so the GPS could not locate it. I booked a total of 3 rooms. Room 3 had dirty sheets and smelled of smoke. My daughter had to go get sheets and change the beds! Room 2 had a dirty tub, what looked like dried blood on the side of the dresser and large burns on the bedspreads. My room had only two towels (4 reserved for this room) and there were people doing \"business\" outside my window! I heard a prostitute talking to the front desk about this time she would not be staying the night, another who danced half naked in the hallway, and the man who walked to the ice machine in only his BVD's. It was a nightmare! We were scared of all the weird people walking in and out of the hotel, there were deals being made through the windows right in front of the office, and the hallways were loud thru the night. I could not wait to get out of there! If this is what Ramada has become, I will not ever go back to one! We were in the van with another family with children, they echoed our concerns. How awful!!!!", "Date": "June 25, 2011"}, {"Ratings": {"Cleanliness": "2", "Sleep Quality": "3", "Overall": "3.0", "Value": "3", "Service": "3"}, "AuthorLocation": "Iowa", "Title": "“Torn review: friendly staff, questionable location, and cleanliness”", "Author": "IowaCruisers", "ReviewID": "UR113728155", "Content": "We stayed at the Ramada Limited for one night before embarking on our Alaskan Cruise. I had already reserved the room at a price I thought I would be guarenteed. We had a free shuttle from the airport, which is nice. ( Wish there would have been one to the pier, but they were able to find a company that could bring all 5 to the pier for $55 total, which we appreicated. The hotel is located right across the street from a Mosc, and several run down liquor stores where there were very questionable people lurking. My advice would be once there, stay there and order in. Our room appeared to be clean, but once ready for bed, we peeled back the sheets to climb in and there was pubic hair all over our sheets. We called to the front desk and they brought new sheets to our room and left. We had to change our sheets ourselves and when taking a shower the next morning, guess what I found on the towels too!!! The same type of hair. When checking out I expressed our gratitude for the things we appreciated about the hotel, the shuttle, the friendly staff, cont. breakfast, but explained my disapointment in the cleanliness and how the matter was handled. He appologized and said he could not give us any compensation and charged us matter of fact for 2 more people. FYI: The workout room in located in the parking garage with only 3 machines- only one that worked properly and no working T.V. Needless to say I don't think the good outweighed the bad in this situation.", "Date": "June 15, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "3", "Overall": "4.0", "Value": "5", "Service": "3"}, "AuthorLocation": "Wrightstown, Wisconsin", "Title": "“for the price...great”", "Author": "mcjohns", "ReviewID": "UR110916330", "Content": "the previous reviews really scared us, but since our rate was non-refundable we decided we would give it a try and if it was that bad we would find a different hotel for the second night! but..it was just what we were expecting and a little more! yes the sheets and bedding were not top quality and thread worn, but the hotel was very clean and the breakfast a plus! helpful front desk help as well, all this coming from a very picky customer! i am all about clean and this met our expectations! for the price and location...so worth it!", "Date": "June 1, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "2", "Overall": "2.0", "Value": "3", "Sleep Quality": "2", "Rooms": "2", "Location": "3"}, "AuthorLocation": "oregon", "Title": "“If you have a choice - stay somewhere else. I wish we had.”", "Author": "oakgrove_oregon", "ReviewID": "UR90844068", "Content": "This is an old, sad, dingy hotel. We were in Room 203. Thin sheets and towels. Stained carpets. Worn surfaces. The staff seemed nice. Our room was quiet - except for the heater, the refrigerator and the bathroom fan. The bathroom fan sounded liked a 747 taking off. The free Wi-Fi only worked sporadically, mostly in the lobby. The surfaces in our room were clean - just stained and dingy. Overall it was a depressing place to stay.", "Date": "December 27, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "3", "Overall": "4.0", "Value": "5", "Location": "3", "Rooms": "4"}, "AuthorLocation": "", "Title": "“Good choice for one night”", "Author": "Aviashey", "ReviewID": "UR85231032", "Content": "If you're stranded in Seattle it comes handy but not for more than 2 days", "Date": "October 29, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Asheville, North Carolina", "Title": "“There are TWO Ramada Inns on International Blvd.”", "Author": "Kodiakkatie", "ReviewID": "UR85206462", "Content": "The Ramada at 13900 International Blvd. is new, clean and a good place to stay. The Ramada at 16720 is a dump! When I arrived in Seattle I called the wrong one (16720). I asked them if there were any other Ramada Inns in the area and they said no. After staying one night I looked things up on line and found the nice one was just down the street! The folks at 16720 Ramada Inn will not tell you that! Check the address!", "Date": "October 28, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "4", "Sleep Quality": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Columbus, Ohio", "Title": "“Ramada, Sea-Tac 16720 International Blvd - not as scary as some say.”", "Author": "TCS90", "ReviewID": "UR84777881", "Content": "I almost forfeited my pre-paid reservations based on other reviews of this hotel. This was a mother daughter trip. I took a chance, we stayed there, and I am glad we did. Our rooms were clean. We were there two nights - the night our plane landed and the night before our flight back home. The service was fine (I mean the rooms are approx $70/night so I did not expect first class). Beds and pillows were comfortable. There was some noise - but it is at the airport. We had clean towels and clean sheets. All said, I would stay there again. Breakfast from the hotel restaurant was so-so for the price. We had the cinnamon toast and pancakes. Any problems with airport shuttle pickup are not because of the hotel; rather it is an airport design flaw in my opinion.", "Date": "October 25, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Idaho Falls, ID", "Title": "“Customer Service really made it a worthwhile stay.”", "Author": "RiverDrifter", "ReviewID": "UR69158052", "Content": "My wife and I traveled to Seattle to take a cruise. We arrived one day early and stayed one day after. While there we stayed both times at the Ramada Limited in Tukwila which is about 10 minutes from the airport. We arrived at SeaTac and called for the van. It arrived shortly. Some words of advice for those who call for the shuttle. Look for a van with a large red ball with white numbers painted on it. If it doesn't have this, it will be a van for the other Ramada which is also located in the area. Our driver verified that we were on the correct van as we boarded. We were somewhat concerned that the motel might not meet our needs as it is not located in an area where there are a lot of Seattle attractions. Nor are there other than fast food restaurants in the immediate area. Nor is it located in an upscale neighborhood. Everything worked out fine thanks to the manager, Jaspal Singh, and his staff. It turned out to be a very good place to stay. The staff is friendly, courteous, cordial, and very helpful. They will make the van available to you for a very reasonable fee to take you to nice restaurants that are located in the immediate Tukwila area but that are too far to walk to. We used the van the first night of our stay and tried a cab the second night. The van was much better. They also went out of their way to help us set up a self guided walking tour of downtown Seattle, patiently answering all our questions and what-ifs. We used the light rail system to get there. ($5 per adult round trip ticket and $2.50 for seniors. Such a deal. Taking a cab would break the bank.) The van dropped us at the light rail station which is about 3/4 mile from the motel and 25 minutes later we were in downtown Seattle. Taking the train will get you near the main Seattle attractions such as Pike Street Market, the pier, the Space Needle and downtown. You will also see the big sports stadiums before you enter the underground tunnel near down town. On our way back we called the motel from the train station and the van again came to pick us up. It took us back to the motel where we later collected our luggage that the manager had put in storage for the day and we were later delivered to the airport. All the while of our stay we were made to feel like valued customers. With regard to the motel itself, it is not a large one. But it is clean, well maintained and relatively quiet. Continental breakfast is of the coffee, milk, juice, oatmeal, cereal, bagel, English muffin, fresh fruit variety. It is enough to successfully get your day going. The eating tables and chairs are fair sized and comfortable. Underground parking is available and there are a few stalls in front of the building. There is a computer and printer for checking e-mails or e-checkins for flights. The rooms have older type televisions but they work well once you master the quirks of the cable provider. Bathrooms are separate from the vanity area which will make the ladies happy as it avoids steaming mirrors. The vanity itself is wide and has good room to put all your stuff. Storage is ample. While the location may not be the greatest, we thought the motel was a good value and it is the staff that made it that way.", "Date": "June 30, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Raleigh, North Carolina", "Title": "“Good Hotel”", "Author": "bogeorge", "ReviewID": "UR64812088", "Content": "I stayed at this hotel for 6 days. Was given reasonable business rates and I found the rooms to be clean, quiet & comfortable. Staff was friendly, helpful and easy to interact with . Close to light rail and bus stations to explore Seattle and its surrounding areas without having to drive. East African restaurant near the hotel has delicious food , check them out also.", "Date": "May 20, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "1"}, "AuthorLocation": "Walla Walla, Washington", "Title": "“Don't stay at this trash heap!”", "Author": "wearytraveler3333", "ReviewID": "UR61379613", "Content": "I’ve had my share of unsavory hotel experiences during my recent trips to the greater Seattle area, but it was my stay at the Ramada limited that managed to scar me for life! I knew our stay at the Ramada Limited was going to be an unpleasant one when my mother, two sisters, eighty year old travelling companion and I drove up to the shady looking establishment. Several pimps and prostitutes were loitering around the area and the neighborhood appeared to be one of ill repute. Upon entering the hotel, we noticed it’s outdated and worn out appearance. The carpet in the hallway leading to our room smelled and looked like something had recently died and decomposed on it. The horror show really began when we entered our room. It smelled like a pack of bums had previously inhabited it before we did. The carpet was stained, the furniture was dusty, and the beds were dirty and unkempt. I was inspecting the room further when one of my earrings fell off of my ear and happened to roll underneath the nearest sofa. It was when I was reluctantly lifting the flap on the sofa that I received a horrifying shock! I found the earring and was about to reach for it when I noticed some suspicious looking objects! Words cannot described how sickened I felt when I finally indentified the objects as being a clear plastic bag of white powder and a bloody syringe! My mother then called the manager. We informed him that we wanted a refund and he said that he already had charged our credit card for a full night’s stay. He adamantly continued to refuse to give us our money back and said that he would give us a new room instead. Later on, I went to the ice machine and was totally disgusted when I saw that the dispenser was covered in slimy green residue and surrounded by garbage! I did not get any sleep that night due to the fact that I was paranoid of getting pocked by a needle! If you care about your well being and health, please do not stay at this horrible excuse for a hotel!", "Date": "April 14, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Location": "3", "Rooms": "1"}, "AuthorLocation": "FL", "Title": "“What a dump!”", "Author": "xyz10", "ReviewID": "UR40638502", "Content": "This place was a Hotwire surprise. This is the kind of establishment that makes you afraid to use Hotwire. The kindest thing I can say is that this place has seen better days. The carpets in the common areas are filthy, and there's a musty odor in the rooms. The rooms themselves reasonably clean, but the hallways and other common areas give it a distinctly icky feel overall. The towels were were covered in mysterious stains as were the sheets on my bed. All the linen was worn to the point of being threadbare, and had the luxurious feel of 100 grit sandpaper. There were no cups or glasses (probably a good thing here...) Sure, there are worse places, but frankly, this place is only one step removed from being on par with a seedy low-rent boarding home in an inner-city Baltimore housing project.", "Date": "September 10, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "3.0", "Value": "4", "Location": "2", "Rooms": "4"}, "AuthorLocation": "Oroville", "Title": "“Clean and quiet”", "Author": "serneskyb", "ReviewID": "UR37358496", "Content": "We were skeptical after reading the horrible reviews and were pleasantly surprised. The room was clean, quiet and everything worked good. I'd stay again.", "Date": "August 11, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Location": "4", "Rooms": "3"}, "AuthorLocation": "Austin, Texas", "Title": "“Early shuttle and breakfast was great!”", "Author": "travelsande", "ReviewID": "UR33203815", "Content": "They had the breakfast out at 4 am and then I took the shuttle to the airport for a 6:00 am plane trip. Rooms were quet and clean. The reviews I had read weren't good, but I even took a bus to and from the hotel to Kent where I was headed and had no problems. I stayed on a Wednesday and Monday night and it was great and I'm a single female traveler.", "Date": "June 26, 2009"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Business service (e.g., internet access)": "1", "Check in / front desk": "1", "Overall": "1.0", "Value": "1", "Rooms": "1", "Location": "1"}, "AuthorLocation": "WA", "Title": "“The Pimp n Whore Hotel”", "Author": "boocatwa", "ReviewID": "UR21985111", "Content": "This place is advertised as a business class hotel, but the type of business aren't ones to speak about in polite conversation. The rooms smelled, had estensive damage from cigarettes and slashed chairs with what looked to be blood. When I complained, they said that some of the furniture was old. But the rooms were filthy and smelled filthy, and the night manager kept replying the furniture was old until I convinced her to run her finger across the back rail of a chair. Then she said she would move me to another room. I got into the next room only to find the same situation-filth and damage-but now there was an added element. A pimp training his girl next door now filled this room with words that I can't write up here on a public board. I called the Marriott who sent a taxi to pick me up. The taxi driver said that the place was notorious for drug dealers, prostitutes and the like. As a woman who travels solo, this place shouldn't advertise as a business class hotel. When I communicated with Wyndham Worldwide about the place they said that this location was a franchise but that they would check into it. I just check my bank card and the Ramada is trying to collect a nights stay from me!", "Date": "November 18, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Business service (e.g., internet access)": "4", "Check in / front desk": "5", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Seattle WA", "Title": "“Good room nice staff closer to downtown is located in Tukwila”", "Author": "Love_the_MouseSea-WA", "ReviewID": "UR17911864", "Content": "My family stayed here after walking away from Howard Johnsons down the street. This hotel sits one block back from Hwy 99. There is a coffee shop next to the hotel that the local taxi drivers hang out at. Some other reviers have regarded as scary. They are devout Muslims. The closed down card room that is on the other side of the street and af ew blocks down will soon be turned in to a mosque. Just felt the need to clear up how \" Scary\" some feel the area is. This section of Tukwila is under going a major facelift. The staff at the Ramada were very nice and offered late check out to my family after hearing about our trouble at the nasty motel down the street. The management was changed in 2007. I felt this was a good place to stay for a night or to be close to downtown with out the high price of the downtown rooms. In downtown Seattle you can expect to pay over $ 180.00 a night off season. When we arrived at 11: 30 PM after a long journey on the train and canceling a prior reservation at another nasty motel. They understood and let us look at the room prior to checking in. My family enjoyed the stay had a nice clean room with a comfy bed. They were on the 2nd floor and had no noise issues. The lobby had a nice clean smell. Unlike the other 2 hotels or motels we walked in to. Got a good deal on the price was $20.00 less than the other ickey hotels. So don't let the other rating scare you. I think things have changed for the better at this location. They are about five to ten minutes from the airport but closer to downtown,", "Date": "July 15, 2008"}, {"Ratings": {"Cleanliness": "1", "Check in / front desk": "2", "Overall": "1.0", "Rooms": "1", "Location": "1"}, "AuthorLocation": "Seattle", "Title": "“The Absolute Worst....”", "Author": "auwing1978", "ReviewID": "UR14272664", "Content": "In terms of the cleanliness, smokiness , shifty characters hanging around and remote location from the airport, this is all true. And it does not surprise me that folks have had credit card issues with this hotel. Here is our experience. We checked in for a 3 day stay. We ended up checking out a day early because this hotel apparently uses their facility as a Park and Ride. We came back at 10 am on a Sunday from breakfast and there was absoutely no parking spots in the lot or underground. We checked out at that point. 30 days later we are checking our credit card statement and there was a $353 extra charge from the hotel. ??? We called and were informed that we stole computer equipment from our room????!!!!!!??? We were dumbfounded. They said they had proof. The manager told my wife nobody was in the room for 4 days and then the computer equipment (a wireless router he said) was discovered missing when the next people checked in. And he said that we stole the router and he charged our credit card! (can you spell fuming mad at this point??) We called the Tukwila Police Dept. and no police report was filed about any theft. We contacted our credit card company and they put the courtesy credit on until situation was resolved. We called Ramada corporate and filed a complaint. We called our relocation company (I was being transfered to Seattle for my job). We called American Express who made the reservation for us. We called my employer where I have worked for 30 years. A week later my wife got a call from the manager with a tepid apology saying in fact it was the people who stayed the night after us who stole the wireless router. Of course he forgot that originally he told us that nobody stayed in the room for 4 days and then they discovered it. He said our credit card was being credited and the next day the credit showed up. My wife coldly told him that he called us thieves and he should be ashamed of his conduct. In 30 years of corporate and leisure travel, we have never had such a horrible experience at a hotel. I think the guy thought we were out of towners and perhaps we would not review our credit card statement. I did not read any of the comments prior to mine until after this expereince was concluded. My employer says that they will make sure that no other of the 30,000 employees of my company ever will stay at this hotel. BTW, we have yet to hear back anything from Ramada corporate. Shameful.", "Date": "March 14, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Business service (e.g., internet access)": "3", "Check in / front desk": "4", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Los Angeles", "Title": "“Nice hotel staff and nice simple clean room for great price”", "Author": "gobookgo", "ReviewID": "UR11603004", "Content": "I stayed this hotel for 3 weeks and it was great. The hotel staff are very helpful and nice people. The room are clean and simple. Only thing didn't like was coin laundry in the hotel was expensive $3.35 per wash and $3.75 per dry. The other coin laundry is near by (walking distance), but I wouldn't go there not safe to walk around, ask hotel shuttle driver to take you there if want cheap wash. The hotel shuttle does not have schedule and at the time I was there they were short on drivers, so if you need to go to an airport or anywhere show up at the lobby well before your planned time.", "Date": "December 16, 2007"}, {"Ratings": {"Overall": "1.0"}, "AuthorLocation": "Vancouver", "Title": "“Do Not Stay At This Hotel For Any Reason.”", "Author": "BudsterVancouver", "ReviewID": "UR10364718", "Content": "This \"hotel\" was the filthiest most disgusting hotel I have ever had the displeasure of booking into. It is located in the seediest area of town. We had a sick feeling when we saw the neighbourhood, the two men watching a porn movie at the business across the street in clear view, the numerous pawn shops and the list goes on. Upon entering the hotel it appeared slightly presentable......until you get on the elevator. The entire hotel smells of some kind of stench hiding chemical. The carpets were very dirty, the walls had marks all over them, the room doors were scratched and dirty metal. The room....oh the room......the first thing we found was a curly black hair ont he bathroom floor and a semi-dead bug rolling around the floor. The holder for the toilet paper was silver and badly stained with finger prints and unknown smudges and substances. The shower was passable. The bed appeared clean, but we slept very poorly. We checked out the window in the morning and were shocked to find our vehicle there still and undamaged. I went downstairs at 10:30 with my teenaged daughter to use the free internet and had a very quick and unsettling computer visit as the front desk cleark and an unknown male visiting him were leering at my child and speaking punjabi VERY loudly. IN retrospect, we should have run away fast but we weret ired , it was late, we had been lost for an hour and we were too tired to fight about a refund. HEADS UP- THIS IS NOT A REAL RAMADA HOTEL...IT IS A PRIVATELY OWNED HOTEL AND THEY ADDED THE WORD \" LIMITED\" TO GET AROUND THE LEGALITIES OF USING THE RAMADA NAME.", "Date": "October 27, 2007"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Business service (e.g., internet access)": "5", "Check in / front desk": "3", "Overall": "3.0", "Value": "3", "Rooms": "3", "Location": "1"}, "AuthorLocation": "Sacramento, California", "Title": "“Not luxurious, but okay -”", "Author": "CAtraveler47", "ReviewID": "UR6358311", "Content": "My daughter loves Seattle and was going to spend a weekend there (alone). She did this before and spent a lot of $$ downtown - so this time she decided on a package that included airfare and was near SeaTac. Her dad and I decided that maybe we should go with her and booked this same hotel that her package included. At first glance (esp when we arrived at noon and was told that we couldn't check until 3 PM) the experience didn't look promising. As others have said - the surrounding area is definitely on the downside. (our daughter is a recent college grad and her new job doesn't pay all that much - so she wanted a bargain). I was really glad we (parents) barged in because the area isn't really a place that I'd like a young person to travel back and forth from, alone. We had discussed just cancelling and just paying for the one-night penalty (getting a nicer place in the City) - but decided that it was just a weekend and give it a go. However, when we finally got back from the City proper to check in (early in the evening) we were pleasantly surprised. The amenities are good - wireless access; hairdryer, fridge, microwave, coffeemaker service. The rooms were very clean (we travel in Europe quite a bit - and have experienced quite a bit of variety in terms of \"cleanliness). I have high standards and had no complaint about our rooms here. The staff was very cordial and accomodating and I have no reservations recommending the place if you are on a budget and want a quick get-away from the airport. We rented a car, so the pick-up wasn't necessary for us. All in all - it was an okay experience.", "Date": "December 10, 2006"}, {"Ratings": {"Check in / front desk": "1", "Overall": "1.0", "Value": "1", "Service": "1", "Location": "1"}, "AuthorLocation": "Washington, D. C.", "Title": "“This place DOESN'T deserve your patronage!!!!!”", "Author": "juniorbubba", "ReviewID": "UR6044362", "Content": "I had business in the Seattle are that required me to stay down at the airport. In baggage claim, I found the hotel contact kiosk and called the \"Ramada Limited\" at SEA/TAC. I assumed (since there wasn't an address listed), that it was the Ramada that was located adjacent to the airport property. Since the hotel wouldn't send the hotel van until I gave them a credit card, I gave them my credit card number and was told to call when I got to the hotel pick up point (outside of baggage claim). When I got to the hotel pick up point, I noticed, with some surprise, that the hotel was actually located north of the airport in Tukwilla. When I called the Ramada Limited, I immediately tried to cancel my reservation (The hotel is located in a not too savory neighborhood that caters to prostitution, hourly motels, strip clubs etc.) The Ramada limited wouldn't cancel my reservation. The women that I talked to said that they \"Required a 24 hour cancellation notice\". I tried to explain that I had just made the reservation 10 minutes prior. The women, who was the same women who took my reservation, told me that they were still going to charge my credit card for one nights stay. Sure enough, I just received a letter from the general manager, Mr. Jay Kim, stating that since there is no record of the cancellation (The women who I talked to at the time would not provide a confirmation number for the cancellation), my credit card would be charged for 1 day of a three day stay. Sine I have received this letter from Mr. Kim, I have tried to contact him, but have yet to hear back. Based upon the responses from other disappointed travellers, I would suspect the the positive responses have been written by people connected with the hotel, I am actually lucky that I didn't stay at this place. Based upon the way that they do business, I would imagine that repeat customers are not really their concern. The lady that I talked to, wouldn't give me the name of the franchise owner, wouldn't let me talk to her manager and actually hung up on me. These people don't deserve your business.", "Date": "November 1, 2006"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Business service (e.g., internet access)": "1", "Check in / front desk": "2", "Overall": "1.0", "Value": "1", "Rooms": "1", "Location": "1"}, "AuthorLocation": "Benicia, California", "Title": "“Learned my lesson - major disappointment”", "Author": "platinumWM", "ReviewID": "UR5811492", "Content": "I've used the online service on which I booked the Ramada Limited - Tukwila (where you find out the attributes of the hotel and the general location, but not the name until you pay your non-refundable $$) numerous times in three years. I've always been satisfied. This experience changed my travel reservation habits forever. Dissatisfaction doesn't even begin to describe my experience there. \"Stunned\" is more like it. There seems to be large confusion in Seattle about Ramadas. There are 4 or 5 of them. Most of them are called \"Inn's.\" Such as the Ramada Inn and Suites very near Sea-Tac. This place I'm talking about is the Ramada Limited in Tukwila. \"Very\" should be part of the name. I will never again book a hotel without knowing which one it is. And, I will never again stay at a Ramada. Just the fact that they have this facility in their system scares me. I stayed two nights, and wanted to run from there one hour after arriving but I was stuck as I already paid in full and it was late. First, the van they picked me up in was very old and didn't look business-like, and the upholstery was very stained. Next, it was well over 2 miles North of Sea-Tac, on the old Pacific Highway, in a run-down/transitional neighborhood. Casinos and \"smoke rooms\" in the area. Two miles North of the Ramada Inn and Suites (someone in October confused them in a review). Last, on arrival, there was a group of around 6 or 7 very unsavory (scary) looking characters hanging out on the corner on 139th, just as we were arriving. Only a few feet from the door. I walked into the lobby at night, after getting out of a medical conference at the Marriott-SeaTac and the lobby was very small and \"Court-TV\" was on full blast in the lobby. The lobby had a look of decay, with old, dusty fake flowers and unhealthy plants and ugly furniture. The place only has 38 rooms, so (lucky me) I got the room right off the lobby. Could not sleep as the lobby TV was so loud. I was too afraid to ask them to turn it down as I didn't want to leave my room or draw attention to myself, being alone. Decided to have a cup of Decaf coffee, and turned the coffee cups over and both were totally filthy. Had coffee residue (easily seen and felt) from the last resident, (not washed) as did both water glasses. Absolutely filthy. Almost made me sick. I turned them in the next morning and there were clean ones in my room when I returned late last night, but still? When I pulled back the covers to go to bed, someone either did not know how to make a bed, or they didn't make it --- from the last person in there. Everything was very rumpled and unkempt-looking. I've never seen anything like it in all my years staying in hotels. Furniture was very old, spare and plastic. Plumbing didn't work well, as both the bathtub and sink did not drain. I took a shower in the morning, and when I left the room an hour later, there was still standing water --- despite my attempts to get it to go down. Not to mention the hair and ground-in dirt on the floor. This morning, when I left for the airport, I showed up downstairs and they said the driver would take me right there. In actuality, he spent 30 minutes doing other things, while I both waited and made two more requests. Paid no attention to my need to get to the airport. Ignored me, while I was standing there. And, I had to get to my flight! Even with making reservations online, there were so many problems and \"misses\" with this hotel that I'm appalled and will definitely change my reservation habits. Evidently, they call it \"Limited\" because it is. Not to be confused with the other Ramada Inn's, including the Ramada Inn and Suites near the airport. The \"limited\" is very far from the airport and not in any neighborhood a tourist would ever want to visit. People probably confuse them because they are both on \"International Blvd.\" But, the other one is near the airport and is probably much nicer. This one is out in the boonies and, for the price I paid (opposed to what I got....I could go on), is definitely a dump.", "Date": "September 18, 2006"}, {"Ratings": {"Overall": "1.0"}, "AuthorLocation": "Antelope, CA", "Title": "“Watch Out For Ramada Seatac”", "Author": "A TripAdvisor Member", "ReviewID": "UR5446924", "Content": "After returning from an Alaska cruise, I booked a room at the Ramada Seatac for one night. The hotel is located on International Blvd just minutes from Seatac. I left the airport, turned left on International Blvd and one block later, there was the Ramada. Unfortuantelly, it was the wrong Ramada. The Ramada Limited did not tell me there were two Ramada's on International. The Ramada Inn and Suites that I ended up at also did not tell me there were two Ramada's. I noticed the marquee advertised a lower price than what I reserved over the phone, so I booked a room with a lower price than what I was quoted. Just to be sure I wasn't charged for the other room, I mentioned to the clerk that I had a reservation and didn't want to be charged twice. She looked on the computer and said everything was fine. Last week, the Ramada Limited sent me a notice that it was charging my credit card for a \"no-show.\" I called and mentioned that I had stayed at a Ramada and that I had done due diligence by asking the clerk about my reservation (see above). They said that is not their problem and that I had to take it up with Corporate. Needless to say, Corporate also said it is not their problem and that I have to deal with the Ramada that I stayed at. I wonder how many other out-of-town travelers are caught by this seemingly collusive tactic? Looks like I am out $100. So if you are going to Seattle, please check the address of the Ramada you are staying at. To make matters more confusing, they are both listed as Ramada Seatac and, by the way, the Ramada Limited Seatac is not very close to Seatac at all.", "Date": "July 10, 2006"}, {"Ratings": {"Cleanliness": "1", "Overall": "1.0", "Value": "2", "Service": "2", "Rooms": "1"}, "AuthorLocation": "Kennewick, Washington", "Title": "“Not somewhere I would stay again.”", "Author": "juliebug52", "ReviewID": "UR5372064", "Content": "My room was a smoking room and did not seem clean. Stains on the furniture and the furnishing are outdated. (I am not a smoker and it was all they had.) The screen on the window was falling off. The floors in the elevator were gross (dirty). Very noisy with the airport traffic. The pillows were horrible. Spend a little more money and go elsewhere.", "Date": "June 21, 2006"}, {"Ratings": {"Overall": "1.0"}, "AuthorLocation": "Bellevue, Washington", "Title": "“Hands down the worst hotel experience of my life.”", "Author": "A TripAdvisor Member", "ReviewID": "UR5362869", "Content": "Needed to stay at a hotel down in Seatac for an early am flight. I was looking for a clean, simple place to get a couple hours of sleep. Instead I stayed at a place that was (a) in no way like the photo's on their website, and (b) smelled funny and felt very dirty. Bathroom smelled like urine and the floors looked dirty. There was still some soap in the bathroom from the last guest and the shower curtains had mildew on them. The chairs in the rooms were so stained and dirty looking that I refused to sit on them. I won't be staying at a Ramada Inn anytime soon.", "Date": "June 19, 2006"}, {"Ratings": {"Cleanliness": "5", "Overall": "4.0", "Value": "5", "Service": "4", "Rooms": "4"}, "AuthorLocation": "Oakville, Ontario Canada", "Title": "“Fabulous Stay During a Taxing Medical Conference”", "Author": "A TripAdvisor Member", "ReviewID": "UR4000687", "Content": "Many thanks for a wonderful stay in Seattle...as we were attending a medical conference it was so convenient to be near the airport. The Ramada Inn and Suite Staff were so helpful and the service was excellent. In my down time it was wonderful to swim and relax in the indoor pool...and the Food - it was amazing... the wonderful blend of Asian and American cuisine was perfect in tantalizing my tastebuds - sure beat the boring fast food or regular restaurants we probably would have visited.", "Date": "October 7, 2005"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "VANCOUVER BRITISH COLUMBIA", "Title": "“Waiting For Another Trip”", "Author": "A TripAdvisor Member", "ReviewID": "UR3831973", "Content": "We have just returned from a week away and I thoroughly enjoyed. It was so clean and friendly enviroment. I was impressed as the staff were also so good and sure went out of their way to help me. As I am an asmatic patient and have to carry my nabulizer machine with me and one evening on returning to the hotel, I was very short of breath and to my surprise the gentlemen ran towards me and gave me had and got my machine plugged and I sure was in good shape in no time. I have no words to express just to say that the hotel is just magnificient and one will have no problem staying there.", "Date": "August 31, 2005"}, {"Ratings": {"Cleanliness": "1", "Overall": "1.0", "Value": "1", "Service": "1", "Rooms": "1"}, "AuthorLocation": "Moscow, Idaho", "Title": "“Never Again!”", "Author": "A TripAdvisor Member", "ReviewID": "UR3722707", "Content": "This hotel was a TOTAL waste! We stayed two nights and did not have hot water, clean room, or ice (in the middle of JULY!) There was dirty underware in the pool for two days, the exercise room was give yor some terriable fungus if you used the facility. The back \"safty\" door was propped open day and night because the lock was broken, there was trash EVERYWARE!!!! Scary location, UNHELPFUL manager, overall experience was AWEFUL!!!!! This is the LAST time we will ever stay in a RAMADA!", "Date": "July 30, 2005"}, {"Ratings": {"Overall": "1.0"}, "AuthorLocation": "Anchorage, Alaska", "Title": "“Wow, this hotel was an utter disappointment”", "Author": "ryanflaate", "ReviewID": "UR3198473", "Content": "Do not waste your money by staying here. The location was terrible-further hotel on the Sea-Tac Hotel strip. Area around the hotel made me wonder if it was safe to go outside. No parking, quaint parking garage that had no room to manuever whatsoever. The excercise room was a complete joke. The continental breakfest was adequate, nothing great. Staff was completely helpful-some did, others weren't. I WILL NEVER STAY HERE AGAIN.", "Date": "February 16, 2005"}, {"Ratings": {"Cleanliness": "1", "Overall": "1.0", "Value": "4", "Service": "3", "Rooms": "1"}, "AuthorLocation": "Arlington, WA", "Title": "“Housekeeping and breakfast almost non-existant”", "Author": "A TripAdvisor Member", "ReviewID": "UR2222729", "Content": "I confess that I shopped hotels by price on Expedia but felt safe in booking the low price since this is a Ramada Inn. Wrong! The bathroom was cleaned with so little attention to detail that we certainly didn't want to step on the floor barefooted or touch the clothing on the back of the door left by a previous resident. The elevator walls were sticky and the hall floors visibly dusty. Breakfast was little more than toast and coffee with juice machines hidden behind construction.", "Date": "June 25, 2004"}, {"Ratings": {"Cleanliness": "2", "Overall": "1.0", "Value": "2", "Service": "2", "Rooms": "2"}, "AuthorLocation": "Anchorage, Alaska", "Title": "“Nothing to Be Proud Of”", "Author": "A TripAdvisor Member", "ReviewID": "UR1835895", "Content": "I recently spent the night at this location on my way to Florida, what a let down....I was just looking for a clean room and a good nights sleep. I got neither. While the courtesy bus was prompt, the friendliness was lacking. Lobby appeared nice enough, clean and neat. Too bad the room was not the same. I do not see any reason for no toilet paper or open and used coffee grinds still in the pot. When I called and asked about this I ended up having to go down to the lobby and get them myself. The room appeared as though someone had used it for a \"short\" time and had not been cleaned and restocked. A little maintenance is needed as the toilet seat almost fell off. The rooms need a through cleaning and going over. I would recommend a different location", "Date": "April 25, 2004"}], "HotelInfo": {"Name": "Ramada Limited Tukwila/SeaTac", "HotelURL": "/ShowUserReviews-g60878-d557193-Reviews-Ramada_Limited_Tukwila_SeaTac-Seattle_Washington.html", "Price": "$62 - $75*", "Address": "<address> <span rel=\"v:address\"> <span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">13900 International Boulevard</span>, <span class=\"locality\"><span property=\"v:locality\">Seattle</span>, <span property=\"v:region\">WA</span> <span property=\"v:postal-code\">98168</span></span> </span> </span> </address>", "HotelID": "2515339", "ImgURL": "http://media-cdn.tripadvisor.com/media/ProviderThumbnails/dirs/60/7a/607a5532f4b8c35428f95f278dab7b264large.jpg"}}