{"Reviews": [{"Ratings": {"Service": "2", "Cleanliness": "1", "Overall": "1.0", "Value": "2", "Sleep Quality": "2", "Rooms": "2", "Location": "4"}, "AuthorLocation": "Yakima", "Title": "“They are in the middle of remodeling so I trust/hope huge improvements will be made”", "Author": "ExpeditionMan", "ReviewID": "UR126661582", "Content": "I read the reviews and decided to take my chances at this property. Upon pulling up, I thought, this doesn't look that bad as the outside painting and lighting was somewhat modern looking. I checked in around 11pm-midnight and the evening clerk was friendly and helpful. I walked down the hall and it doesn't smell the freshest. Head upstairs, there's a door held open by a washcloth as it was for the 3 evenings I was there. My room was just okay. I tried not to look too closely. So, here's what I think. I needed a place near Children's Hospital, this property was about half the price of others within this vicinity. I was at the hospital all day and came back tired and would crash from about midnight until 5-6am and then back to the hospital. For the amount I saved over other properties, and the amt. of time I was actually in the hotel, it worked. Or, if I was partying with old college buddies and we had too many adult beverages I'd be okay. But, I would not bring my wife here in its existing state, I would not bring my kids here in it's existing state. I hope the remodel makes the difference for them. It is a very convenient location. Across the street from University Village. In fact, I ran from the hospital to grab lunch for us and a benefit was I was able to park in the Travelodge parking lot to run in and get lunch across the street. There was no room in the University Village parking lot and parking was crazy due to a UW bball game. I filled out a review that they sent to me and I was impressed with the quick response from their team. So, i hope they get it cleaned up.", "Date": "March 26, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Tacoma, Washington", "Title": "“I was happy with my recent 8 day stay at Travelodge”", "Author": "Lorelei O", "ReviewID": "UR125359924", "Content": "I stayed in room #119 at Travelodge in Seattle Washington near the University of Washington. The room was clean. I inspected it for cleanliness before I brought my luggage into the room. I even pulled back the sheets and inspected the mattress edges. It was perfectly clean and there were no odors. I have stayed at another popular hotel near the University several times and because their prices went up and I am on a budet, I tried this one. This room had a refrigerator and a microwave which I had to supply my own at the other more expensive hotel. The lower cost was reflected in the more trimmed down breakfast bar, which I did not care about. No one bothered me at all. I did not opt to have my room cleaned during my stay but each morning the cleaning staff was on hand and happy to give me fresh towels or anything I needed for my room. It felt safe. I never had the feeling of being afraid during my visit there. If you stay in the winter I would advise bringing an extra blanket for the bed or use the heater in the room. It was a little loud, but it also served as a good \"white noise\" machine. Every hotel I have ever stayed in has hallway noise of doors opening and closing so this would drown that all out. Overall I felt that it was a good value for the money.", "Date": "February 28, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Sleep Quality": "4", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Portland, Oregon", "Title": "“A Nice place to stay”", "Author": "David_F52024", "ReviewID": "UR125002452", "Content": "A quiet place to stay outside of downtown, in close proximity to U of W and good shopping and resteraunts. Free Parking and not too expensive.", "Date": "February 21, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Sleep Quality": "2", "Rooms": "1", "Location": "2"}, "AuthorLocation": "Boston, Massachusetts", "Title": "“Awfully dirty and unmaintained place, no breakfast”", "Author": "Frank_O_advisor", "ReviewID": "UR121753700", "Content": "This is a very ill-kept place. The carpet in the room was so dirty that it painted my socks and feet black as I walked around. The bathroom was barely ok, I dared not sit on the chair, and the bed was suspicious. And it's certainly not in the price range where this is the norm. The breakfast is a joke, even if you get a chance to sit in the \"dining room\" that can only seat about four people, I suggest going to the mall on the other side of the road for a quick bite. During my stay the \"menu\" was lukewarm coffee, orange juice, and individually packaged magdalenas. As for the location, UW is very close, but not much else in Seattle is.", "Date": "December 15, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "1", "Overall": "2.0", "Value": "1", "Sleep Quality": "2", "Rooms": "1", "Location": "5"}, "AuthorLocation": "Twisp, Washington", "Title": "“Dirty, stinky room”", "Author": "Karen W", "ReviewID": "UR120508728", "Content": "I was afraid I was going to get bed bugs. Great location, but room smelled as soon as I walked in. Bathroom smelled like urine. Sheets were wrinkled like the bed had not been changed. Old crummy shower no light bulb in lamp. Very over priced for what you got. Hallways filthy. Only thing good is location.", "Date": "November 12, 2011"}, {"Ratings": {"Service": "2", "Cleanliness": "1", "Overall": "2.0", "Value": "2", "Sleep Quality": "1", "Rooms": "1", "Location": "5"}, "AuthorLocation": "Vancouver, Canada", "Title": "“I'm not picky but avoid at all costs!”", "Author": "cypanadero", "ReviewID": "UR119052256", "Content": "I stayed here with my gf and another couple for a short 2 day shopping trip at the beginning of September. The location is very good as it is located in the university village and across the street from a good mall. We stayed on a room on the third floor and it reminded us of an old, outdated apartment. We had read some poor reviews but we were willing to give it a chance based on the great rates offered to us by expedia. It wasn't worth the value. Although the girls were disgusted by the carpeting, the draping and the stains on the couch and the sunken in cushions, it was spacious and the bedrooms seemed adequate enough. However, all 4 of us received a maximum of maybe 2-3 hours of sleep each. The beds were extremely uncomfortable, and would constantly creak at every movement. There was also a construction crew that began working outside the hotel at 6am and that woke all of us up as the paper thin walls allowed us to hear every word said between the construction workers as well as the constant drilling and sawing. I've stayed in some pretty bad hotels, but this one takes the cake by far. Like another previous review stated, unless your homeless..AVOID!", "Date": "October 7, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "3.0", "Value": "4", "Sleep Quality": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Montana", "Title": "“Good Location”", "Author": "retiredtraveler142", "ReviewID": "UR118856573", "Content": "Across from University Village (Mall) and near the University of Washington, the Travelodge is probably the most reasonably priced motel in the neighborhood, but we have watched it slowly go downhill the last few years we have stayed there. The rooms are typical in size and furnishings, and are clean for the most part, but, wear and tear is becoming more obvious: there were hooks for pictures on the walls, but one picture was missing. Similar hooks remained in the wall for a bedside lamp, but it had been replaced with a table lamp. The corners of the bathroom floor hadn't been cleaned recently. The pool and hot tub are not open. There are cracks walls. Still the location is great and there is (limited) free parking. The breakfast room is tiny and therefore crowded. The breakfast is very limited. A few annoying things include a charge daily for the safe in the room even if, like us, it is not used. The phone also has to be set up by the front desk for \"800 number\" calls, something that is not apparent unless you ask after getting continued busy signals. Yet the staff is accommodating and the location is very good.", "Date": "October 2, 2011"}, {"Ratings": {"Location": "5", "Overall": "2.0", "Value": "1", "Service": "3", "Rooms": "2"}, "AuthorLocation": "Salt Lake City", "Title": "“OUTDATED AND DIRTY.”", "Author": "UsFromSaltLakeCity", "ReviewID": "UR118063644", "Content": "The only good thing about this hotel is that it is close to the starting line for the Seattle to Portland Bicycle Classic.", "Date": "September 13, 2011"}, {"Ratings": {"Cleanliness": "1", "Sleep Quality": "1", "Overall": "2.0", "Value": "1", "Service": "1"}, "AuthorLocation": "Bellingham, WA", "Title": "“Yuck. Avoid unless homeless.”", "Author": "BellinghamSojourner", "ReviewID": "UR117241322", "Content": "Old, run-down, not clean, overpriced. We are travelers who don't mind small, budget or older lodging, but this was really unpleasant all the way around. Had the 2-bedroom apartment (reminded me of some of the cheap apartments I had to rent as a poor college student) updated in the 70's, perhaps. Air conditioner didn't work, so it was extremely stuffy all night, noises from neighbors on balcony precluded opening windows for ventilation, and paper-thin walls which let us hear the snorer next door made it not a good sleep. There was very old furniture and the unit was not maintained. The office smelled heavily of smoke, though the surly clerk insisted it was a non-smoking hotel. Cramped little breakfast room with packets of oatmeal, cereal, and the smell of smoke. Bottom line, only if you can get an extremely low price ($50-60?) and have nowhere else to go, might it be worth it.", "Date": "August 25, 2011"}, {"Ratings": {"Cleanliness": "1", "Overall": "1.0"}, "AuthorLocation": "Vancouver, Canada", "Title": "“Will never go back!”", "Author": "grosssss", "ReviewID": "UR116926389", "Content": "Our hotel room had bed bugs! My 6month old daughter got bitten and we brought them home with us. Had to clean our entire house. Super dissaprointed.", "Date": "August 19, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "3.0", "Value": "4", "Service": "3"}, "AuthorLocation": "Winthrop, Washington", "Title": "“Great location, comfortable, good value”", "Author": "Pattywilson", "ReviewID": "UR116168709", "Content": "We read the reviews after we had booked 4 rooms for 2 nights at this motel. We all felt like the location was great, the rooms we clean, parking was good. The check-in staff could have been friendlier but she was efficient. All the rooms were booked at the same time but we didn't get our rooms near enough to each other. The pool isn't heated but was clean and nice. The hot tub is out of order..looks like indefinetly. The beds are double beds not queen like they say but were very comfortable. The breakfast room was very small. The halls were stuffy but the room temperature controls were just fine.Overall the stay was fine. We weren't there to spend a lot of time in our motel and for the price we were all satisfied", "Date": "August 2, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "4.0", "Value": "5", "Service": "4"}, "AuthorLocation": "Honolulu, Hawaii", "Title": "“Great bargain & great location”", "Author": "HawaiiHuskyParent", "ReviewID": "UR115363062", "Content": "This hotel is located just 2 blocks from an entrance to the University of Washington. Husky Stadium is just down the street. The daily rate is very reasonable and includes a free breakfast (cereal, oatmeal, muffins, fresh fruits, coffee/tea/juice). The room where breakfast is served is a little cramp but adequate and includes a flat screen TV. There is also a PC in the same room which you can use to check in for your flights. Our room was clean and pleasant. The walls are a little thin, so you can hear the doors to nearby rooms closing. Not a major problem, though. The University Village Shopping Center, which is an upscale shopping center, is located right across the street. There are some good restaurants and a 24 hour supermarket located in the shopping center. Very convenient!", "Date": "July 14, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "seattle, WA", "Title": "“Great Value, Great Location, Great Stay”", "Author": "uw28", "ReviewID": "UR105148696", "Content": "We stayed here mainly because of the price and location. My daughter and I went to visit UW. The hotel is within walking distance and I was able to leave my car without paying additional parking. It is directly across from University Village and the shopping and dining were really fun. The rooms were clean and the staff was extremely friendly. I would not hesitate to stay here again.", "Date": "April 23, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Sleep Quality": "2", "Rooms": "1", "Location": "5"}, "AuthorLocation": "Oregon City, Oregon", "Title": "“Tear it Down!”", "Author": "raganm", "ReviewID": "UR102990374", "Content": "We reserved a 2 bedroom suite - which was essentially a run down old apartment. The tile floors in the bathroom had huge cracks large enough to pour water in. The toilet rocked when you sat on it. The towel racks had been relocated up the wall 3 times and the old holes remained in the wall - unpatched- wall paper torn. The sliding glass door to the balcony took 2 people to open and close. A complete kitchenette with empty cupboards - no utensils, dishes, pots, pans. The outlets were not grounded so the microwave had an adapter plug to accomodate the 2 prong outlets. I can only imagine how long its been since the carpet was cleaned- and I had to wonder what sort of activites had taken place on the couch - ick. There was a dirty spoon behind one bed. The upside... surprisingly enough we did NOT see any bugs and if you looked beyond the rusty drains and fixtures - the tub, sink and toilet appeared to be clean. The front desk staff was pleasant and the housekeeper was very helpful. This was not worth $120/night.", "Date": "April 6, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Sleep Quality": "2", "Rooms": "3", "Location": "3"}, "AuthorLocation": "PNW", "Title": "“ok”", "Author": "RLB_28", "ReviewID": "UR89554494", "Content": "Nothing nice but ok if you are just passing though and need a place to sleep. Nice shopping across the street. Parking is cramped.", "Date": "December 11, 2010"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Overall": "3.0", "Value": "2", "Sleep Quality": "3", "Rooms": "2", "Location": "3"}, "AuthorLocation": "Cincinnati", "Title": "“Thanksgiving in Seattle”", "Author": "RF2009", "ReviewID": "UR88145452", "Content": "Was traveling in Seattle to visit with family and although most of reviews were unfavorable, I still chose the Univesity Travelodge given the proximity to my family. Generally, my opinion was the hotel is overpriced considering the quality of the accomodations but was still a reasonable alternative when compared to the other hotels in the University area.", "Date": "November 24, 2010"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Overall": "2.0", "Value": "3", "Sleep Quality": "3", "Rooms": "2", "Location": "5"}, "AuthorLocation": "Salem, Oregon", "Title": "“Run down two bedroom suite”", "Author": "jeff1949", "ReviewID": "UR83883596", "Content": "Very run down 2 bedroom suite which was in a seperate building behind the main hotel. Full kitchen with old and dirty range and completely unstocked with pots or pans or dishes or utensils, etc. Small bathroom had peeling paint and loose wallpaper. Holes in the wall where towel racks had been removed and not spackled or painted. Medicine cabinet was very rusty although mirrored front was fine. Paper thin walls and floors so neighbors sounds were a problem at times. Smoke detectors were missing their batteries so did not work. A towel was stuffed in the crack between the A/C and the outside wall. Furniture was old and saggy and not enough of it to accomodate 4 adults. The unit was very spacious however.", "Date": "October 17, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "3", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Seattle", "Title": "“I had a great stay at the TRAVELODGE!”", "Author": "gurl_on_the_go", "ReviewID": "UR83162685", "Content": "A lot of people have written bad reviews... And it sounds like they have REALLY high standards! Me and my daughter came the night before a day FULL of doctors appointments at Seattle Childrens Hospital, and the TRAVELODGE was in an incredibly convenient spot for being at our appointment early in the morning. In 1 word for my stay at the TRAVELODGE it was FANTASTIC!!!!!!!!!!!!!", "Date": "October 12, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Sleep Quality": "4", "Rooms": "2", "Location": "5"}, "AuthorLocation": "Bellingham", "Title": "“Kinda surprised”", "Author": "tennisniese", "ReviewID": "UR82916794", "Content": "Let's be frank. If you are looking to stay in your room or enjoy the amenities this is not the place for you. As you enter the carpet need to be replaced and it is a old property. Our greeting was great though and the front desk gal was very friendly. We were there for a Husky football game and it was a pleasant mile walk to the stadium. This may sound like a distance but when you are walking with many other fans and through the tailgate parties it is entertaining even in the rain. We also were able to enjoy the shopping at what I think is one of the best malls in the PNW which is and outdoor University Mall. All you have to do is walk across the street. Yes, the rooms are dated, yes, the water is iffy, yes, you may go hmmmm, when you walk in...BUT if you are looking for a great place to shop, go to the UW Campus AND get free parking, this is your place. If you are looking to visit Seattle this would not be for you as you are quite away from the sites. Ask for a room in the back and yes you will be facing a unattractive apartment complex but I was shock that we heard NOTHING from them all night long. I slept better here than in some 4 stars that we normally stay. If you are looking to get out of your room and shop and visit campus this place if for you. If you are looking for a more boutique environment I would recommend the Hotel Deco on the other side of campus which is also a great property.", "Date": "October 10, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "3", "Overall": "4.0", "Value": "5", "Sleep Quality": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "London, United Kingdom", "Title": "“A great base for realistic travellers”", "Author": "Cornopean", "ReviewID": "UR81402547", "Content": "I read the reviews after I'd booked and seriously thought about changing hotels. When I arrived, I was pleasantly surprised to find things much better than I'd expected. If you want $150 a night service, don't expect it for as little as $75 a night (check out the midweek and fourth-night free deals). This is also a hotel that will under some circumstances allow under-21s to stay independently. So what of the complaints? I found the staff very helpful with things like getting around on buses, taking a lot of time and effort. Yes, they were more reserved and purposeful than some hotel receptionists, but one Sandi is worth ten obsequious bellhops and made my trip run really smoothly despite a tight budget. Rooms, a little dated but clean. Mine was by the pool so smelled a little of chlorine but I soon stopped noticing. The pool, incidentally, looked clean and I saw it being cleaned. Air conditioning units are noisy but not needed most of the year, I just opened the window, even in August. Showers did vary in temperature particularly when someone flushes, sometimes I just stepped out of the (powerful) flow for a minute until it sorted itself out. There is a bath option to avoid this. Some rooms are by a door or stairwell so will have some noise, ask when booking if that's a problem. My bed was comfortable and the towels and sheets were not torn or dirty. Continental breakfast consisted of two cereals (varying), packs of hot cereal mix, small packaged muffins, brown and white bread for toasting, two flavors of jelly, apples and bananas, tea/coffee and two fruit juices. More than enough for me. The room was small so many people took it back to their rooms, but it did encourage you to meet the other guests. Location is excellent - University Village opposite, which is basically a mall disguised as bijou shops. The University of Washington is a fifteen minute walk away, including an uphill section, or a bus goes from down the street. From UW you change for buses to most places in the wider area. Don't get me wrong, I can see why some people commented negatively on some aspects, but I have stayed in many worse US motels and hotels and, for the price and star rating, this is a well-situated and good option. If you prefer cooked breakfasts, updated rooms and nothing but insincere smiles from your check-in staff, look elsewhere. Ultimately if I was returning to Seattle, I would definitely stay here again.", "Date": "September 28, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "3", "Sleep Quality": "1", "Rooms": "1", "Location": "1"}, "AuthorLocation": "Pacific Grove, California", "Title": "“Never Again”", "Author": "Baxter213", "ReviewID": "UR72285222", "Content": "We booked this \"hotel\" for our 3 night stay in Seattle mostly because of the price. We certainly got what we paid for. Dark, dingy hallways with a weird smell and stained carpets, the same 3 cigarette butts and crushed red Lifesaver on the outside steps the whole time we were there, the key card was hit and miss, the ugly, ugly hot tub area at the opposite end of the building from the pool, thanks, that's very handy. Now for the room: it's quite large, so that was good, but we were put right next to the stairwell so we could hear people going up and down at all hours, the air-con was soooo loud there was no way to sleep with it on so we had to open the window and listen to the street noise and people checking in at 2 am. First day I pulled back the bed looking for an outlet for my laptop and there was a pile of goldfish crackers that had been there for who knows how long. The sheets on one of the beds was torn and the towels were frayed. The continental \"breakfast\" was horrible, and they were out of orange juice 2 of the 3 mornings we were there. And now, I have saved the best two things for last: the fuse for the room would blow each morning while I dried my hair. I guess we were foolish to think I could dry my hair with the TV and one light on. And finally, the shower would fluctuate from scalding hot to freezing cold every shower, every time. We were nervous for our young son to take a shower for fear he would burn himself. I think the shower thing bothered us most of all. For compensation from the front desk we got a paltry $30 taken off our bill. I guess the location is good if you need to be near the University or the hospital, but for us it was a bit of a trek to the downtown area. So folks, consider yourself warned!! Thanks Travelodge for being a memorable part of our visit to Seattle,", "Date": "July 25, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Business service (e.g., internet access)": "1", "Check in / front desk": "1", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "1"}, "AuthorLocation": "Minden, NV", "Title": "“Horrible”", "Author": "donnerdog", "ReviewID": "UR67552626", "Content": "Our son was touring the University of Washington. I selected this motel because I wanted to be close to the campus. I have to honestly say that if I could have found another place that night, I would have moved. The room was filthy and smelled. I was seriously concerned that the bed may have bugs since they were old and very uncomfortable. When my husband and I left to meet our son for dinner, we noticed that the door would not lock. When we advised the front desk about the door, they told us don''t worry, we'll fix it while your gone. Of course we were uncomfortable leaving with our belongings in the room. Although they claimed the door was fixed, the door never closed properly. Breakfast consisted of OJ, Coffee, cereal, small packaged little blueberry and banana muffins.This property is close to the campus, but the location is not great and it's in a VERY congested area. I was happy when the morning came and we were able to check out. I've always relied on trip advisor for reviews before staying at motels. This time I was fooled by some who reviewed this place as decent. This is NOT a good place to stay. There are many motels in Seattle. Be wise and avoid this place.", "Date": "June 15, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "5"}, "AuthorLocation": "Grandview, Washington", "Title": "“For being in the U District, you'd think Travelodge would upgrade”", "Author": "WSUgrad", "ReviewID": "UR67426147", "Content": "Paid $200/night due to UW graduation, staff wouldn't guarantee me parking, had to kill a spider in the room- webs all over, room very dirty, black mold in bathroom, and the batteries died in the TV remote control! Few hotel accommodations in the University area so you'd think Wyndham would invest a little to upgrade this Travelodge! It was disgusting-", "Date": "June 14, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Boise, Idaho", "Title": "“Highly recommend this hotel”", "Author": "emberhawk", "ReviewID": "UR61819179", "Content": "The staff was SO nice and helpful. The location was great. The hotel was clean. Housekeeping did a great job. It was just a very lovely stay that we had there. The pool and hot tub was also crystal clear and beautifully kept and all the other guest were friendly. With an atmosphere like the one that the staff provides, I see why everyone was in a good mood. I give them a HUGE two thumbs UP!!!!! Thanks! Lani and Sergio Mendoza", "Date": "April 18, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "3.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Mexico City", "Title": "“Functional, friendly, great location!”", "Author": "trishazMexicoCity", "ReviewID": "UR57333169", "Content": "Never stayed in a Travelodge before and it was a good experience.. staff v helpful friendly and accommodating.. for the cost it was amazing value. Location for the university ideal. A great experience.. only possible complaint would be the breakfast ! perhaps why bother.. when good places around but other than that it was excellent ! Would recommend it !", "Date": "February 28, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "3", "Location": "4"}, "AuthorLocation": "California", "Title": "“Better Than I expected for a Travelodge!!!”", "Author": "asnpanda", "ReviewID": "UR56823799", "Content": "My wife and I where on our way to Canada for the winter Olympics and decided to rest in Seattle because we where driving all night from California. There was a lot of traffic getting to the hotel because of it's close location to the University. Initially I was a little worried because Travelodge hotels are usually run down or worst...filled w/ prostitutes and drugs as of my experience in a Travelodge in Tennessee. But the reviews led me to try again. As we arrived, the location is situated across the street from a huge mall and in a well kept neighborhood. The building had a more modern architectual look to it and very nice colors. The clerk name Zaira was very helpful....service compared to a more luxury hotel. She helped us w/ all types of tourist questions and was not even annoyed...which can happen a lot. As we proceeded to our room, there is a security door for guest only, which is very safe. The room it self had great space and very clean, looked recently remodeled. Everything was functional and in order. The only problems I had was that the walls are very thin, the bed was a little out of shape and it took 10 mins for the hot water to come out...ironically being that they want you to reuse towels to save water? Also the Manager SHIRLEY was very nice to us as we asked her questions during the evening. The breakfast was juice, oatmeal, muffins, two types of cereal (both nasty), and fruit. Luckily all food products were individually wrapped or sealed because the clerk had a vicious cold (coughing, and spitting mucous) when I was IFO the door. I would highly recommend this place.", "Date": "February 22, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "georgia", "Title": "“Enjoyed this one, Sandi is very knowledgeable”", "Author": "smilesGeorgia", "ReviewID": "UR56082856", "Content": "I really enjoyed stayng at the Travelodge. I as a little nervious about visiting a big city such as Seattle, but Sandi was very helpful. She helped me find the best and safest ways to get around the city, going to downtown and the University. My rooms was very confortable and clean. Thanks to everyone, they made my stay a lot less stressful.", "Date": "February 15, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "home", "Title": "“We'll be back”", "Author": "whomeHome", "ReviewID": "UR56073640", "Content": "After seeing some of the past review I wasn't sure I wanted to stay but it was close to the area we wanted to be. Got to the hotel early and was able to check in early, then went to room and checked out everything to make sure all was okay. We were pleasantly surprise with the room and the staff was definitely some of the friendliest people. I was happy that I didn't overlook this place because of the past reviews. And the next time I go to Seattle I will be staying at this Travelodge.", "Date": "February 15, 2010"}, {"Ratings": {"Service": "2", "Cleanliness": "2", "Overall": "3.0", "Value": "4", "Location": "3", "Rooms": "2"}, "AuthorLocation": "Vancouver BC", "Title": "“Not bad”", "Author": "spabdolphin", "ReviewID": "UR39154650", "Content": "We decided to travel to the states and upon our journey realized a lot of hotels were booked out. We had a coupon book called roomsaver and noticed the travelodge with a good price. It was getting on 11pm, so we contacted the hotel and got availability. The hotel is in a good location, beside a lot of great shops. The hotel itself seems a bit dated. Front staff was decent enough (being it 12:30AM by the time we got there). Got keys and into room. Room was a bit small but okay. We are used to staying in all sorts of hotels, this one was clean. Mattress was comfy and bathroom though a bit small, shower was nice and spacious. There is a hot/pool outside but it looked like it had a bit of scummy/yucky stuff on top. ugh..Free wi-fi, continental breakfast was decent enough. Cold cereals, muffins, yogourt and bars. Kept us going for most of the morning. Decent enough to just sleep in...don't expect too much more!", "Date": "August 29, 2009"}, {"Ratings": {"Service": "2", "Cleanliness": "2", "Overall": "1.0", "Value": "1", "Location": "2", "Rooms": "1"}, "AuthorLocation": "Northern Virginia", "Title": "“Do not stay at Travelodge--especially this one, room burglarized.”", "Author": "ThudPilot", "ReviewID": "UR37833209", "Content": "Room burglarized while out of room for 3 hours during the day. Computer, wife's jewelry, Passport, Checkbook and other personal items stolen from locked room. Notified Seattle Police and Manager/Travelodge. Travelodge insurance would accept no liability for even a portion of loss. Rooms adequate, obviously security is a large concern.", "Date": "August 16, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "3", "Overall": "4.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "minnesota", "Title": "“Update on some good, some bad”", "Author": "ustrav54", "ReviewID": "UR32619088", "Content": "About two weeks ago I wrote a review titled SOME GOOD, SOME BAD. When I was checking out, I had a long conversation with the manager about the concerns I mentioned in the review. The manager was very receptive to my concerns and I feel that she took them seriously. I believe that she will be acting on some/all of the things we talked about. As I was checking out, I was pleased to find out that there was no charge for printing my boarding pass. Also, I wanted to highlight the fact that -- throughout our stay -- the manager and the staff were extremely helpful and friendly!", "Date": "June 18, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Edmonton", "Title": "“love it, love it, love it”", "Author": "vacaEdmonton", "ReviewID": "UR30942325", "Content": "Great location and a great price. It is an older hotel undergoing renovation/updating but the rooms were adequate and very clean. Cannot stand spending 150-200/night for rooms, I think it's money better spend elsewhere, so this was fantastic!", "Date": "May 27, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "East Wenatchee", "Title": "“Greatest!”", "Author": "smtchbtch", "ReviewID": "UR30178574", "Content": "I have stayed here befroe and it was not so good, but Now it is the greatest. They have done alot of changes there, like new beds and new carpets and lighting in the hallways including painting of the halls and the breakfast room is so much better now instead of being in the office area. The employees Realy take care of their guest and it shows in their attitude when helping everyone. Their curb appeal in front of the hotel in a mass improvement over what they had before. I am going to stay there again in the future soon as I will be traveling to Seattle alot in the future. I will mention them to ALL my familiy and friend's to stay there if they want to feel special and pampered.", "Date": "May 17, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Business service (e.g., internet access)": "4", "Check in / front desk": "5", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Tehachapi, CA", "Title": "“Loved the Travelodge”", "Author": "ClaireBurton", "ReviewID": "UR20288999", "Content": "Very friendly and helpful staff. Good location with fancy shopping center across the street & good eateries close by. We enjoyed our talks with staff & felt they went the extra mile when necessary.", "Date": "September 22, 2008"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Business service (e.g., internet access)": "1", "Check in / front desk": "3", "Overall": "3.0", "Value": "3", "Rooms": "3", "Location": "2"}, "AuthorLocation": "Madrid", "Title": "“Not a very special place”", "Author": "gcanizal", "ReviewID": "UR19208240", "Content": "I've been there for 4 days in August in order to visit Seattle. It is far from Seattle downtown and parkings are expensive there, so that I recomend to choose another hotel to visit the city. The swimmingpool of the motel is very big and the spa is also perfect to relax after a long day walking around Seattle. Rooms are big and clean, however it is a little bit old and breakfast is not too good... In my opinion the motel is a little bit expensive for what the offer.", "Date": "August 21, 2008"}, {"Ratings": {"Service": "2", "Cleanliness": "1", "Business service (e.g., internet access)": "2", "Check in / front desk": "1", "Overall": "1.0", "Value": "1", "Rooms": "1", "Location": "4"}, "AuthorLocation": "San Francisco, CA", "Title": "“Bad Experience”", "Author": "ConstantVisitor", "ReviewID": "UR17590022", "Content": "The building smelled like cigarettes despite being a non-smoking hotel. Our room smelled pungently like bleach. I had to take my comforter down to get a replacement because it had large stains on it. The mattress was exposed, old, and filthy. The shower alternated between very hot and very cold water. We could hear everything going on in the halls. I did not feel comfortable at all in this hotel and was glad to get out.", "Date": "July 6, 2008"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Business service (e.g., internet access)": "3", "Check in / front desk": "1", "Overall": "1.0", "Value": "1", "Rooms": "1", "Location": "5"}, "AuthorLocation": "hawaii", "Title": "“junk hotel --- hiden charge”", "Author": "tsanah", "ReviewID": "UR13394138", "Content": "AC is very loud -- worse then sleeping on an airplane. hiden charge on Safe Warranty --- trick you during check in to sign an agreement --- take advantage of people who are tired to check for a rest... staff very rude ---- worst hotel i have ever stayed in my life time.", "Date": "February 8, 2008"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Business service (e.g., internet access)": "3", "Check in / front desk": "3", "Overall": "3.0", "Value": "3", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Houston, Texas", "Title": "“Single Traveler”", "Author": "35000ft", "ReviewID": "UR12397099", "Content": "1. Cheap- you get what you pay for. 2. Easy and convenient for a single individual traveling alone. 3. Internet service. 4. Close proximity to University of Washington. Village Shopping Center. 5. Clean bathroom, room.", "Date": "January 7, 2008"}, {"Ratings": {"Service": "1", "Cleanliness": "2", "Business service (e.g., internet access)": "1", "Check in / front desk": "2", "Overall": "1.0", "Value": "1", "Rooms": "1", "Location": "3"}, "AuthorLocation": "Sacramento", "Title": "“Avoid this place”", "Author": "fern12345", "ReviewID": "UR12219669", "Content": "This was the worse hotel I have ever stayed in, and prompted me not only to check out early, but also to write my first hotel review. For $80 a night, I stayed in a room that: - had warm, but not hot water, so I could never take shower without getting cold, and I had to wait about 2-3 minutes before any warm water came out of the faucet in the first place. - was \"non-smoking\" but directly across the hall from the smoking rooms, so that the smell travelled into my room at 6 am when my neighbors decided to light up. - was darkly lit, smelled strongly of cleaning detergent and had stains bed cover - was cleaned by very polite housekeepers, but a remarkably rude and unfriendly staff. Today, I checked out of the hotel and for $20 less a night am staying in a friendly, clean chain with warm water, a sauna, and a room that reminds me that my Travelodge experience was rare and not to be tolerated.", "Date": "January 1, 2008"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Business service (e.g., internet access)": "1", "Check in / front desk": "1", "Overall": "1.0", "Value": "1", "Rooms": "1", "Location": "2"}, "AuthorLocation": "Vancouver", "Title": "“Utterly disgusting”", "Author": "ozufan", "ReviewID": "UR10083718", "Content": "Without a doubt one of the worst hotel experiences I have ever had. A friend and I mistakenly chose to stay here for a conference at the University, and from the moment we arrived, the stay was completely revolting. Upon trying to check in, there were problems with both of our reservations, about which the clerk only laughed. His attitude was that this is what we deserved for daring to stay in this dump. After waiting a good 30 minutes to get our room keys, we entered the wing where our rooms were. We were first greeted by an atrocious and overpowering smell - something along the lines of a mixture of mildew, urine, and some toxic chemical probably used to attempt to clean. The hallways were barely lit. Then we entered our rooms to a slightly less strong stink - no toxic flavor, just mildew and urine. On turning on the light, one of the (at most) 25 watt bulbs was burnt out. Turning on the others gave only slightly more light - a nice dim, dank look complimented the smell nicely. The carpeting was slightly damp - I tried not to think about what I was walking in. The room was a bit chilly when we arrived, so I turned on the \"heater/air conditioner\", but no matter what knobs I turned where, no heat came out - only cold air - no matter how long I waited. At least I was able to turn mine off; when my friend tried the same with his, he found that it just kept going - so the thing was blowing cold air into his room all night. The bathroom was crap, but ok. It took a good 5 minutes for the shower water to become remotely hot. The walls were dirty, had various stains and marks, and rusty outlines told us where some racks used to hang. I had a good bathroom, it seems, as my friends' toilet didn't flush, he was unable to get more than a tiny stream of water to flow from his faucet, and his bathtub had numerous brown stains throughout. Oh, and he had one less lamp in his room than I did. The bed was uncomfortable at best and there were numerous holes in the sheets/blankets. The pillows were comically thin - I had to stack two to get a reasonable \"pillow\". And on top of everything, when I figured to myself I could at least do a little work to take my mind off the decrepit surroundings, I found that the wireless signal was too weak to get internet access. I proceeded to walk around the floor, open laptop in hand checking to see if the signal ever improved, but no such luck. The complimentary breakfast: disgusting. I took one bite of the soggy, plastic-wrapped muffin and instantly threw the rest away. There was cereal, but no milk for it. I couldn't make this stuff up if I tried - heed this and all the other awful reviews of this complete embarrassment of an establishment and simply stay away. This heap should be a tourist attraction in and of itself - visit to see the squalor and to laugh at those who stupidly paid money to stay here, but don't spend a cent to stay yourself.", "Date": "October 15, 2007"}, {"Ratings": {"Overall": "2.0"}, "AuthorLocation": "Illinois", "Title": "“University Travelodge, Seattle”", "Author": "ningoIllinois", "ReviewID": "UR8472119", "Content": "This lodging was obtained through priceline.com. While the room was clean it was cramped for 2 adult women. We had to share a double bed, request extra linens, and no luggage cart or elevator was available. There was some sort of event and was told to make sure we had a lodging indicator in the car windshield because the also cramped parking lot was going to be full. It is too far for downtown sightseeing, especially with heavily announced I-5 changes due to putting in light rail from downtown to airport. This may have been better for a single person having business at UW, or someone accompanying some one to the UW hospitals which are close. There was a nice mall across the street with shops, Starbucks and grocery. No microwave or minifridge in room.", "Date": "August 22, 2007"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Check in / front desk": "2", "Overall": "1.0", "Value": "1", "Rooms": "1", "Location": "5"}, "AuthorLocation": "Spokane, WA", "Title": "“Terrible”", "Author": "Sadeb", "ReviewID": "UR8461418", "Content": "Very bad experience. Dirty, poor maintenance, poor service, poor security. Pool and spa are dirty. Rooms are dirty. No check in until 4 p.m. no matter what your situation. There were several families here for a wedding with us and we all hated it. Nothing else available in the area because of UW. We would never, ever stay here again!", "Date": "August 21, 2007"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Business service (e.g., internet access)": "3", "Check in / front desk": "4", "Overall": "1.0", "Value": "3", "Rooms": "1", "Location": "4"}, "AuthorLocation": "Seattle", "Title": "“Not for Familys”", "Author": "daeg", "ReviewID": "UR8409075", "Content": "My family needed a place to stay while our son was to have surgery, travelodge offered a reasonable price. We requested a Ground level room and a crib, when we arrived we were told that our room was upstairs. After inspecting the room there was no crib, the bathroom had rust stains on the walls, the light was burned out, cobwebs in the corners, peeling wallpaper, and broken locks. We asked about getting a crib, after a long wait we called the front desk and were told that 2 of the 3 cribs were in use the third was missing. Our son slept in his stroller for a few hours. after a long wait we went to the front desk to complain we were blown off since we had got a discounted price we got discounted service. the manager had eventually arrived after buying a new crib. We were pleased that they had gone through the effort however our pleasure was gone once we asked the manager about the crib she said \"I just bought one, now don't you feel stupid?\". It took a while to set the crib up and the mattress was thin and our son slept poorly. We will never stay there again.", "Date": "August 14, 2007"}, {"Ratings": {"Service": "3", "Cleanliness": "2", "Check in / front desk": "3", "Overall": "2.0", "Rooms": "2", "Location": "4"}, "AuthorLocation": "Portland, Oregon", "Title": "“Great location but worn”", "Author": "i4travel", "ReviewID": "UR8129437", "Content": "Second time I've stayed here. The pluses have been location - safe, nice area, free parking and good sized rooms. The minuses, both stays - sheets and towels are rough and very thin, below Motel 6, the worst I've ever experienced, bathrooms are very worn looking and a little dirty, ie faucet handle center had not been cleaned. Pillows were \"wimpy\", bed didn't stay made. Room size good, carpet & fixtures looked much newer than towels & sheets. I like a bargin and don't mind some trade offs for price, but the AAA rate for the room with all taxes & charges (1 queen, 2 people) was $112.87. I'm looking for other places for future stays, but the location is definitely the draw for me.", "Date": "July 16, 2007"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Business service (e.g., internet access)": "1", "Check in / front desk": "2", "Overall": "1.0", "Value": "1", "Rooms": "1", "Location": "4"}, "AuthorLocation": "Seattle", "Title": "“Totally unacceptable!”", "Author": "Racerhead2", "ReviewID": "UR7648898", "Content": "I reserved 2 rooms for my parents and relatives first time visit to Seattle. I was very excited to show them a good time. I noticed the Travel Lodge next to the University Village and thought it might be a great idea for them to stay there since they can go and shop across the street. So convenient, I thought! I read some of the reviews on this site but I made the mistake of not taking it more seriously. I had the same experience with some of the other reviewers. The room wasn't ready for check in until 4 in the afternoon. When we enter the room it stunk badly. The exterior had a fresh coat of paint but it didn't hide the decaying interior. The beds were dirty and the pillows stunk of oily dirty hair. The lights on the bed side table were out. They didn't refill the tissue paper in the bathroom. Worst of all we found that they didn't even clean the room. Just made the bed and that's it! Can't believe they are charging people for staying in this dump!", "Date": "May 20, 2007"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Business service (e.g., internet access)": "2", "Check in / front desk": "1", "Overall": "1.0", "Value": "1", "Rooms": "1", "Location": "4"}, "AuthorLocation": "Vancouver", "Title": "“the worst hotel experience ever”", "Author": "travelnightmare", "ReviewID": "UR5535113", "Content": "Our son was getting married, and we needed 4 bedrooms for our family, so we booked this hotel, thinking that it would be great to have a living room, dining room and kitchen for our 3 night stay. We had two 2 bedroom units. It was the worst hotel we have ever stayed in, and we tried desperately to find anything else to get out of this dump. On the first night, returning from the rehearsal, my daughter found that her room key would not work, and that another couple was standing at our other door, attempting to use their key to open the room. The clerk had given them our room number as their room. The clerk sneered at my daugher when she went to the desk to sort out the problem. No apology, just ridicule. He then totally berated our other daughter when she paid for a parking pass for a third car - he even threatened that our cars might be damaged or that he might have them towed away by morning. Understand that we weren't unpleasant to him, we just seemed to catch him in the middle of a nervous breakdown. To top it off, when my husband went to the desk (we were afraid to send our adult daughters back under any circumstances) to ask for pillows and blankets for the bed chesterfield, the clerk handed my husband 6 towels and said he had no more pillows or blankets. Our bedding was stained, my mom's blanket was dirty, the bathroom was shabby and the floor was cracked. Some walls had pictures, some had bare hooks where pictures had once been. The wallpaper was dirty and marked. Our dining room table had 4 chairs (2 of them broken), while the other room had only 1 chair to go with the table. That room also had no dishes at all. Ours had 1 cup, 1 glass and an assortment of broken, unmatched dishes and cutlery. We gave our other room 2 of our 3 spoons. The pots were beat-up teflon that had rust on the bottom. I wouldn't boil water in them. Neither two-bedroom unit was clean and the furniture and rugs were noticeably stained. The door to the deck had no handle, and in my sister's room the vertical blinds were falling off when she tried to open her door (which also was broken). The beds had a flat mattress protector and thin, flat sheets - so when we slept we ended up on the bare mattress. It was enough to send chills down all our spines. This was the worst dump we have ever experienced, and we would gladly have packed and moved on the first night, despite it being almost 11:00 P.M by the time the clerk finished with us. I was so embarassed to have my mom with us, and my sister also renting a room. How can Travel Lodge allow this dive to carry its name? We expected a basic room, but we expected it to be clean and reasonably furnished with dishes, cutlery and pots, and bedding. I have never heard of a hotel not providing extra pillows and blankets (we only had 4 pillows in each room, and were not being unreasonable requesting pillows for the bed chesterfield). To top it off, there is major construction next door and it starts before 7:00 A.M. Don't call this a \"Travel Lodge\", call this a \"Travel Nightmare\".", "Date": "July 31, 2006"}, {"Ratings": {"Cleanliness": "1", "Overall": "1.0", "Value": "2", "Service": "1", "Rooms": "1"}, "AuthorLocation": "Seattle, WA", "Title": "“Unclean and terrible service”", "Author": "vau604", "ReviewID": "UR5312968", "Content": "I stayed here to save money on a 3 day campus visit at the University of Washington. When I arrived, I was told I was too early to check in so I asked if they could check my bags while I went for a walk to the UW. They agreed and just put them behind the front desk without taking my name or giving me a check tag, which might've been okay if there was a person there too, but when you walk into the office, there's just an empty front desk area while the staff hide away in a back room. In other words, it would take about 5 seconds for someone to reach over and steal my bags. I asked them to store my luggage which contained a camcorder and my laptop in the backroom like any normal hotel would but they refused. When it came time to check into my room I was horrified. Both of my chairs were badly stained as was the bedskirt. I had to lay towels down on the chairs to feel comfortable sitting on them. My lampshade was also stained with what was either coffee or blood. I'm not sure which and didn't care to find out. At night you could either choose to freeze your butt off or turn on the ridiculously loud heater. The pipes and shower head had a lot of visible rust and the bathroom just didn't seem clean. This was one of the worst motel/hotels I've ever stayed in. I know you have to lower your standards when you go budget but this was just intolerable.", "Date": "June 5, 2006"}, {"Ratings": {"Cleanliness": "1", "Overall": "1.0", "Rooms": "1", "Value": "1"}, "AuthorLocation": "Salt Lake City, UT", "Title": "“Don't Bother”", "Author": "A TripAdvisor Member", "ReviewID": "UR3611062", "Content": "What a dump! The door to the room was warped and the room and hallway stunk big time. The bedding was stained as was the pillows and the box springs. Dirty room. The other one they offered was not any better. Was supposed to be a non-smoking room but couldn't tell it by me. We had reservations for 2 nights but could only tolerate one and that was only because we couldn't get our money back. Will never go back!", "Date": "June 25, 2005"}], "HotelInfo": {"Name": "Travelodge Seattle University", "HotelURL": "/ShowUserReviews-g60878-d100577-Reviews-Travelodge_Seattle_University-Seattle_Washington.html", "Price": "$88 - $141*", "Address": "<address class=\"addressReset\"> <span rel=\"v:address\"> <span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">4725 25th Avenue NE</span>, <span class=\"locality\"><span property=\"v:locality\">Seattle</span>, <span property=\"v:region\">WA</span> <span property=\"v:postal-code\">98105</span></span> </span> </span> </address>", "HotelID": "2515379", "ImgURL": "http://media-cdn.tripadvisor.com/media/ProviderThumbnails/dirs/35/d5/35d5707b9959fbdf0058f77f2fdb7d2e5large.jpg"}}