{"Reviews": [{"Ratings": {"Service": "3", "Cleanliness": "2", "Overall": "2.0", "Value": "2", "Sleep Quality": "1", "Rooms": "3", "Location": "2"}, "AuthorLocation": "Portland", "Title": "“Find something better”", "Author": "Lisa B", "ReviewID": "UR127889043", "Content": "The hotel was far too noisy. Used ear plugs and STILL had a hard time sleeping. The room didn't have enough towels stocked for the number of guests even though they knew ahead of time given our reservation. No fan in the bathroom. You get what you pay for.", "Date": "April 14, 2012"}, {"Ratings": {"Overall": "3.0"}, "AuthorLocation": "", "Title": "“Felt safe”", "Author": "Ngina", "ReviewID": "UR127843801", "Content": "I stayed five days in Seattle at this hotel. I picked this hotel because of the free parking, free Internet and shuttle service. The wireless Internet did not work the whole time I was there. The shuttle service was fantastic! But I was surprised that the people at the desk didn't know a lot about the downtown area. The shuttle dropped off and picked up at certain places and I asked one of the ladies behind the desk how far the library is from the drop off site and she said \"I don't even know where the library is.\" huh? Really? Anyway the hotel wasn't bad for the money but I don't think I'd stay there again.", "Date": "April 14, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Spokane, WA", "Title": "“College-parent/pet-friendly property”", "Author": "nkjanzen", "ReviewID": "UR127607583", "Content": "If you are looking for a clean, well-located property with nice amenities, this is your place. We regularly visit our daughters in college and this is close to their university on lower Queen Anne. it is also nearby UW, the Zoo, Fremont, Green Lake and other north Seattle locations. It is pet-friendly and has a great breakfast! AAA and senior-rates as well!", "Date": "April 10, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Indiesblue", "Title": "“Reasonable price, friendly staff and central location”", "Author": "Indiesblue", "ReviewID": "UR126590796", "Content": "If your goal is to have a reasonably priced hotel to use as a base while you go out and explore Seattle this hotel is perfect. It's not a resort. It's not fancy. I've stayed here a number of times while visiting my daughter and we find it works great. The price is reasonable and breakfast is included. Parking is free which is a plus also. A big plus is the Saffron restaurant just across the parking lot. Great food and you don't have to trek out again after a day of sightseeing or business. Front desk staff are very friendly.Sign up for the hotel newsletter and get a discount / internet price. It's not sent out often so your inbox isn't flooded!", "Date": "March 24, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "indiana", "Title": "“So lucky to have found this hotel”", "Author": "gobluebeatbucks", "ReviewID": "UR123424153", "Content": "We were visiting my son in Seattle over the holidays, but had to stay at a hotel with my mother who requires handicap facilities. The staff at the Nexus couldn't have been more accommodating. From the moment we checked in, to checkout 8 days later, they helped make our stay comfortable. All requests were quickly filled. The hotel is not overly pretentious, but it provides the traveler with all the comforts that make guests happy. The rooms were clean, simple and well appointed. Bathrooms were recently renovated. They were clean, modern and attractive. The hotel offers a free laundry on site, as well as a workout room. The breakfast is always busy, but food is constantly replenished . Free newspapers and computers in the lobby, are always available, as is coffee 24 hours a day.", "Date": "January 21, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Sleep Quality": "4", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Liberty Lake, Washington", "Title": "“Great customer service!!!”", "Author": "Arthur S", "ReviewID": "UR123404961", "Content": "My wife and I stayed for a couple of nights. Our heater in our room was not working at full capacity. I spoke to the front desk staff. They were so nice. They sent the maintenance person up ASAP and it took him 15 minutes to get it working. Thank you so much for the wine and chocolates as well!!", "Date": "January 21, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Saint Louis, Missouri", "Title": "“Best shuttle service, nice amenities, and this hotel tries harder”", "Author": "Chessie_System", "ReviewID": "UR122290009", "Content": "For starters, the hotel shuttle service is the BEST I've seen for the price of your hotel stay. It isn't just a shuttle to and from the airport like so many others--this FREE shuttle goes to area attractions and runs constantly throughout the day. There are scheduled times and you do need to sign up the day before, but the hotel is remarkably flexible and will work with you if you need service at random times (a definite benefit when relying on the often unpredictable Amtrak arrival schedule). The location IS a little ways away from some of the more notable attractions (Space Needle, etc), but the shuttle eliminates that problem. And frankly, with Seattle traffic being absolutely horrific and the only drawback to an otherwise beautiful city, I strongly recommend that you take advantage of the shuttle and leave your car in the hotel parking lot. The amenities are very nice. The hotel rooms are comfortable, clean, and modern. The fitness center is convenient, and the guest laundry? Don't let the term \"coin laundry\" on the hotel's website fool you--both the washers and driers are 100% free. Beyond that, this hotel does try harder than places in similar or more expensive price ranges. I came into Seattle with a severely pinched nerve in my neck--it was so painful that I could barely lift my luggage getting off the train. By chance, I happened to mention it to the front desk clerk just to see if he had any local advice--within 30 seconds he was on the phone to a local chiropractor and masseuse setting up my appointment and saving my vacation in the process. This is my third visit to Hotel Nexus, and based on this latest experience, it certainly won't be the last.", "Date": "December 30, 2011"}, {"Ratings": {"Overall": "1.0"}, "AuthorLocation": "Vancouver, Canada", "Title": "“PLEASE READ THIS REVIEW IF YOU DO NOT LIVE IN THE USA!!”", "Author": "katamos", "ReviewID": "UR122069035", "Content": "The stay was good, hotel staff wonderful and friendly athough the rooms could have been cleaner. We had booked the room as a package with a bunch of people for the seahawks game. The package was PRE-PAID in advance. Upon arrival they had asked for my credit card for incidentals and anything extra and said that's all it would be used for. When I got home I realized they had charged me for the room on my credit card, but returned the charge when I left. BUT the problem is I'm Canadian and because they charged my card and returned it, I lost out $20 in the exchange rates. You always get back less because the exchange is worse when it is put back on the card. I called to let them know that it wasn't that big of a deal but wanted to make sure it didn't happen to anyone else. The girl stated that she didn't know how and why it happend but that she would call me the next day after she talked to a supervisor. THE CALL NEVER CAME....NON-RESIDENTS OF THE USA, be aware of this and make sure that they don't do this to you!!! I even asked them before I gave them my card what they would do with it, and they said they would not be adding anything unless I had upgrades or additions to my stay.", "Date": "December 24, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Jacksonville, Florida", "Title": "“sweet modern room and even sweeter staff”", "Author": "supertramp94", "ReviewID": "UR121230392", "Content": "We stayed in this hotel for 5 days and not a single one was unpleasant. Its very close to both mainstream shopping (like, walking distance close) and just a short drive from downtown or some the more interesting areas like Fremont or Queen Ann. The morning breakfast was fairly good and the free access to a gym and laundry was a big help. Will definitely be staying here again next time im in Seattle. P.S, do be warned, they dont have wifi but free to use computers in the lobby, so if you have a computer stuck to your hip most the time, it may be an inconvenience, though there is a Starbucks right across the street.", "Date": "November 30, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Nederland, Colorado, United States", "Title": "“Really enjoyed our stay here!”", "Author": "M0untainM0mmy", "ReviewID": "UR121226763", "Content": "We had a great experience here! The staff was exceptionally helpful and friendly, the suite we stayed in was spotless and had the most comfortable hotel bed I've ever slept in. The complimentary breakfast each morning was delicious with a rotating menu of items such as scrambled eggs and bacon (a huge hit with my entire family), sausage, egg and cheese muffins, and my husband's favorite... biscuits and gravy!. My kids really enjoyed the \"do-it-yourself waffle making station\" and frequented the \"free hot chocolate\" in the lobby several times. We felt very safe and secure (a major plus for this mom of 2 young kiddos). During our stay we also really enjoyed having access to a very nice complimentary laundry room and gym. Aside from all of the convenience, the hotel is also quite stylish and easy on the eyes with a classy retro feel (apparently it has been renovated recently... not sure what it was like before but its definitely fun and vibrant now!) We will absolutely stay there again if our travels ever take us back to the area and recommend it to others.", "Date": "November 29, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Bellingham, Washington", "Title": "“Great location, nice rooms ...”", "Author": "Lana_in_WA", "ReviewID": "UR121145667", "Content": "I've stayed here fairly often over the past 5 years, so I've seen the transformation of the hotel over the years. PROS: The rooms are clean and comfortable The breakfast is good Service from everyone is exemplary Restaurant next door is superb Microwave and fridge in the room -- YES!! Room rates very reasonable for Seattle Location is great -- just off the exit ramp from I-5, a few miles north of downtown Seattle Elevator CONS: Can be a bit noisy Don't count on having wi-fi service -- it's spotty at best, and super slow when you manage to connect. A lot of hotels seem to have this problem, so if having wireless access is critical to you, keep this in mind. They REALLY need to work on this. This remains one of my favorite places to stay when I have concerts in Seattle. For the money, it's a good deal.", "Date": "November 28, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "2.0", "Value": "2", "Sleep Quality": "4", "Rooms": "2", "Location": "3"}, "AuthorLocation": "Auckland, New Zealand", "Title": "“Think again if you need internet access or a quiet room.”", "Author": "dibbyfromtheblock", "ReviewID": "UR120962293", "Content": "The restaurant in front of this hotel is excellent but the hotel itself falls down in many ways. The location right near Northgate Mall may be advantageous, however the hotel has dire technical problems and some infrastructure issues too. Internet is almost impossible, and allthough the staff were friendly and helpful, they themselves could do nothing about the contract with a lousy internet company which apparently runs through December. Definitely check how internet is running before you book. The outside walkways shake when people walk on them, which you can feel inside the rooms, and the breakfast room has meager offerings which stop exactly 10am, without a second to spare. As a European guest I found this difficult. Parking sufficient and rooms clean enough.", "Date": "November 23, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Ogden, Utah", "Title": "“Great value!”", "Author": "CherylPowderHound", "ReviewID": "UR119647121", "Content": "The Nexus has a lot of great free stuff and the staff were all very friendly and helpful. Great price for a Seattle hotel, nothing fancy but was everything you would need. Close to a mall and lots of restaurants. Their restaurant, the Saffron was very tasty. We will stay here again when we return to Seattle.", "Date": "October 23, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Pacific NW", "Title": "“Nice stay in Seattle”", "Author": "HairGalNW", "ReviewID": "UR119012406", "Content": "We used the Hotel Nexus because we were taking a cruise out of Seattle and needed a place to stay the night before we left and also wanted a place to park our car while on the cruise. Hotel Nexus was a perfect spot for us. It is not super high end, however, it was very clean and staff was very friendly and they have done a good job restoring what looks like an older motel. The price was fair, for what it was. The location is just north of downtown, by about 15 minutes or so. However, they have a free shuttle to go pretty much to any of the tourist areas. I do suggest scheduling your shuttle pick up in the hotel BEFORE you depart. They took my husband and I downtown the evening before we left on our cruise, and to the pier 91 for the cruise and picked us up after the cruise also!! We did tip the driver a small amount, but didn't see too many other passengers do so. But, we figured a small tip is still cheaper than a taxi. I would suggest if you want to go to Pikes, not to go to their recommended drop off of (I believe it was 6th), but to go to the Pier 66 stop (I think that was the stop), and walk up to Pikes, vs. the 6-8 blocks that they recommended. The pier 66 stop seemed closer!! But both were fine. The breakfast was decent, beds were comfortable, staff friendly, good shuttle. I would stay here again without a second thought!! I didn't notice any traffic noise, but our room was located on the back side. Starbucks was right across the street (fairly busy street), and it shares a parking lot with a restaurant, which we didn't get to try to our dismay! It's also just across the freeway from a mall and movie theater, which we did catch a movie too. Very nice stay!!! Hope this helps if you're considering Hotel Nexus!", "Date": "October 6, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Sleep Quality": "4", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Bellingham, WA", "Title": "“Tried hard”", "Author": "82nd_Airborne", "ReviewID": "UR118912146", "Content": "I agree with previous reviewers that it's an old property that is trying hard to be upscale. Still looks like an old motel, where you park your vehicle in front of the room. Nice effort on sprucing it up though. I liked the lobby's fancy lighting behind the desk clerk. Kind of interesting that the same swirly pattern was in the elevator. Still looked like an old elevator, but it was a nice touch. The rooms are accessed via walkways that on a windy day would leave you pretty wet, they must work their butt off if it gets icy out. The room was exactly what I was looking for since I was there to take a 5 hr test at a testing center. It was clean, the bed was comfortable, and I enjoyed using the big desk-like table that was part of the room. It had nice access for plugging my laptop in, etc. It smelled like old BO, when I first went in, but that rapidly cleared up when I fired up the AC. I masked it myself with some popcorn. I like it when they have a microwave in the room. Tub had a big gouge in it, and the tub faucet dripped, but I didn't notice until the AM. Still, a very clean bathroom. I was overall pleased with the room/hotel. It was old, but they have tried hard. The other options in the immediate area didn't look that great on tripadvisor. BUT, after reading the recently posted review which must have hit after I booked the room, I have my luggage quarantined since one reviewer had a bedbug problem. I did NOT have any problem, and I know that even the best hotels can get infected. Knock on wood, no evidence of any bites, and I hope no stowaways.", "Date": "October 3, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Arizona", "Title": "“What a delightful stay!”", "Author": "TamiPowell", "ReviewID": "UR118743060", "Content": "We thoroughly enjoyed our stay at Hotel Nexus. The staff were friendly and accommodating—even the maintenance/housekeeping staff. The room was spacious and clean and comfortable beds! Close to anything you could need and the amenities were wonderful—fitness, pool, hot tub, lobby. Delicious breakfast was provided every morning as well. Wouldn't hesitate to stay again or recommend to family/friends!", "Date": "September 29, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Pacific Northwest", "Title": "“Perfect for our needs, staff could not have been nicer!”", "Author": "Mary O", "ReviewID": "UR118386008", "Content": "Great location near hospital and Northgate mall, walk to Starbucks and dining. The lobby is updated in fun and comfortable style, the staff were absolutely the best in their assistance, accommodation and attitude, and the rooms were nicely appointed with microwave and fridge. We weren't there for the scenery, so it didn't matter to us that the rooms didn't have a great view. Found the prices reasonable for Seattle (we traveled from out of state) and our family group received a great discount for booking a number of rooms well in advance. Rooms were clean, beds were just right and even the pillows were a combination of soft and firm for those picky people like us. I actually prefer outside access to rooms rather than indoor hallways. Breakfast offered variety of choices, even for those with gluten allergies. Very family friendly, and staff truly made us feel at home. Will definitely stay again and recommend it very highly.", "Date": "September 20, 2011"}, {"Ratings": {"Location": "5", "Overall": "5.0", "Value": "5", "Service": "5", "Rooms": "5"}, "AuthorLocation": "Lacey, Washington", "Title": "“Great Comfort and Value”", "Author": "Scott D", "ReviewID": "UR118175850", "Content": "We stayed for one night to go to a Saturday Husky Game. The rooms were modern, clean and comfortable with competive pricing. I would definitely stay there again.", "Date": "September 15, 2011"}, {"Ratings": {"Location": "3", "Overall": "2.0", "Value": "2", "Service": "3", "Rooms": "4"}, "AuthorLocation": "NC", "Title": "“Not impressed & won't return”", "Author": "QuirkyIntellect", "ReviewID": "UR118160166", "Content": "My hubby and I stayed here for 2 nights for his birthday weekend to see the city. The hotel's website was pretty deceiving, showing it to be a pretty upscale place, with very upscale prices, but it is more like an old motel. The rooms are accessed from the outside, which if given the choice, I never stay in. The bed was uncomfortable, but the room was clean and the breakfast was good. The thing that most annoyed me was when I booked the reservation, I let them know I would be bringing our dog with us (a very small lab-dachshund mix). However, when we showed up, the guy seemed very confused and asked if the dog would be staying with us. Obviously, otherwise why would we have brought him along? I'm not sure if we were in a pet-friendly room, as it was on the 3rd floor, and the lady I made the reservation with said it would be on the 1st floor. I was a little annoyed to find that there were no grassy areas for our dog to potty in, only mulch/dirt and rocks, but they claim to be a pet-friendly hotel, etc. The other thing I found very annoying was that they placed a $25/day pre-charge on our credit card. When I called and asked about it, I was told that they do this mostly on holiday weekends, etc. This should have been made very clear before booking, or at time of check in. I don't understand the need for this pre-charge when their prices are already nearly $200+/night for a simple motel room. Needless to say, I was not overly impressed, and will not be staying here again.", "Date": "September 15, 2011"}, {"Ratings": {"Location": "1", "Overall": "1.0", "Value": "1", "Service": "2", "Rooms": "1"}, "AuthorLocation": "Maryland", "Title": "“BED BUGS!!!!”", "Author": "Jim21701", "ReviewID": "UR118022767", "Content": "Noisy, bed bug ridden hole. Avoid at all costs. This expensive former RAMADA is just that. A Ramada that lost it's franchise. Run down, moldy, infested ,noisy and expensive all describe this hole. I stayed about an hour as soon as I was bitten by bed bugs I checked out and moved on to a decent hotel. No good words can be uttered about this place. AVOID!", "Date": "September 12, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Location": "4", "Rooms": "3"}, "AuthorLocation": "", "Title": "“I will be back”", "Author": "Redacted", "ReviewID": "UR117919380", "Content": "We stayed here for three nights on a family trip to Seattle. It was clean, comfortable and the service was great. Nice hot breakfast included that changed every day, and free shuttle service into town to help save on parking. The only two negatives were that the pool was out of service while we were there, although it was a lovely flourescent green colour, and they had a full house the first night which made them run out of parking spaces on the property, so some guests had to park in a lot across the street.", "Date": "September 10, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "3", "Overall": "3.0", "Value": "3", "Service": "4"}, "AuthorLocation": "Victoria", "Title": "“Many things going for it, but something about the hotel didn't quite gel for us”", "Author": "Laura_in_Victoria", "ReviewID": "UR117749293", "Content": "This hotel is a converted motel in a northern suburb of Seattle, charging close to downtown rates. We stayed there because we picked a busy weekend, and had few other accommodation choices. The property was clean and re-done to have a funky, playful vibe, although things have started to get a bit worn, notably the bedspread in our room, which looked quite chintzy. In-room fridge very noisy -we had to unplug it to sleep. Staff were very friendly and quick to problem-solve around how to address our bicycles (which came with us on this trip). Unfortunately I never could get the internet connection to work reliably, even with the 24/7 tech support. The breakfast included with the price was actually quite good, compared to many other US hotels with free self-serve breakfasts. Free shuttle service is a good idea. I think there were a lot of good efforts, but something didn't quite fit. I just couldn't see paying the price I did for what still felt like a motel. (I have seen other motel conversions in California that were more effective.)", "Date": "September 6, 2011"}, {"Ratings": {"Cleanliness": "3", "Sleep Quality": "4", "Overall": "3.0", "Value": "3", "Service": "4"}, "AuthorLocation": "Pacific NW", "Title": "“Mixed feelings about the Nexus”", "Author": "TariTari", "ReviewID": "UR117515406", "Content": "We were coming into town for a Friday night Mariner's game then Saturday trapeze lessons for the kids. I could find nothing in the downtown or Seattle Center areas under $450 per night (apparently there was a very large convention in town and they had all the rooms booked). I was therefore left to look outside the downtown/Lake Union/Seattle Center core. Our usual places to stay when coming into Seattle overnight are Silver Cloud Stadium (pricey, but fun rooftop pool), Marqueen (love, love, love it here), Holiday Inn Express near Space Needle (cookie cutter hotel, but convenient), Silver Cloud Lake Union (great breakfast area - like a huge living room overlooking marina), Paramount (great to stay if taking in a show at Paramount Theatre and we love the Dragonfish Restaurant), Watertown by the university etc. I only mention these so you know what kind of places we customarily stay. Now for the Nexus.... hmmm... we upgraded to a \"suite\" for an additioinal $50, since there were 4 of us (2 adults, a teen and a tween). One room contained the living area and sparse kitchen, the other room contained 2 queen beds. Everything in the room seemed clean, but I was still leary of the couch and carpet. The beds were comfortable and the bath area was clean. There was 2 robes provided (didn't use them) and enough towels which were fluffy and clean. The place still has the \"motel\" feel to it even though they've tried to spiff it up a bit. Maybe the Nexus should do away with their shuttle and they would get better ratings...this is where things were both good, then a bit bad for us. You can reserve the shuttle up to 24 hours prior to your arrival and I was very impressed when a desk clerk called me on Thursday morning at my home to verify our Friday afternoon check in and shuttle reservations to go to Safeco Field for Friday's game. Great! Off to a good start. We checked in and verified our shuttle to the game. We were in lobby ahead of time and loaded up in the 11 passenger van (plus one seat for the driver) The driver was dismayed that there were reservations for 12 passengers and we, of course, couldn't all fit. ... so after a bit of time, we changed vans and headed onto I-5 stopped traffic (I completely understand that traffic is not the hotel's fault) but when we eventually got to the ballpark area, the driver seemed lost and made a series of rights and lefts - we could see the stadium , we just couldn't get there. He eventually dropped us in a parking lot about 3 or 4 blocks from the stadium - no problem, we walked... only now it is getting really close to game time, and we had hoped to be there an hour or so early. The biggest glitch with the shuttle is that we were (unknown to us) SUPPOSED TO SCHEDULE THE RIDE BACK TO THE HOTEL AS WELL. Well, the shuttle reservations for the ride back were full, so we ended up paying $30+ tip for cab from Safeco to Nexus. I suppose it is my fault for neglecting to confirm, but I assumed the shuttle service was ROUND TRIP.- so my tip is to reserve both legs of your shuttle at the time of reservation. Breakfast was drearily bad the next morning. We got to the breakfast room about 1/2 hour before it was due to close and they were out of many items. No eggs, bacon crumbs only in floating grease etc. But the worst part was how dirty the whole breakfast room was. We were told the hotel was completely full the night before - so maybe they just were unprepared for a full hotel eating breakfast... \"Free \" breakfasts can always be a bit \"hit and miss\" so we just took this with a grain of salt. Of note, the closest open place to get a drink once we got back to the hotel after the Mariner's game was The Ram - on the other side of the freeway (5-10 minute? walk), but the walk felt a little unsafe.... the bar and grill on the hotel property closes at 10pm. I'm not sure I'd recommend this place or stay here again. It wasn't creepy horrible, but it wasn't great either. If we couldn't find a place in the downtown area, i'd try somewhere else in the northgate area before staying here again.", "Date": "August 31, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Kennewick, Washington", "Title": "“We found the Nexus to be a very welcoming hotel.”", "Author": "Jo L", "ReviewID": "UR117476923", "Content": "The people at the front desk were very wecoming and helpful. There is a very nice breakfast included and shuttle service available some locations. It's only a few minutes to downtown and easy to get to the Edmonds and Mulkiteo ferries.We definitely plan to stay there again.", "Date": "August 30, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "3", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Surrey, Canada", "Title": "“Great hotel, expect us back in the future,”", "Author": "lwitzel", "ReviewID": "UR117337056", "Content": "We planned a trip to The Woodland Park Zoo and so we looked for a hotel close by. When we saw the Nexus we decided that it was the right fit for us. When we arrived we were helped promptly and courteously. Our room was clean and very comfortable, I loved that it had a fridge, microwave and a coffee maker it made waking-up so much easier. As for the Free \"HOT\" continental breakfast, that was awesome. Even my picky 3yr. old son cleaned his plate. I love how the hotel has the package deals for different attractions around town. We bought out tickets for the zoo through them at a reduced rate and they even gave my son a stuffed Penguin as a gift. We planned to take the \"FREE\" shuttle to the zoo but we make the mistake of not booking ahead because space is limited so we drove but that was fine with us. I would stay there every time we go just for the convenience.", "Date": "August 28, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "4.0", "Value": "5", "Service": "5"}, "AuthorLocation": "San Jose", "Title": "“Accommodating for our wedding guests!”", "Author": "laivie", "ReviewID": "UR117097498", "Content": "The Nexus Hotel was very accommodating and affordable for our out of town wedding guests. In Seattle, there seems to be a big handful of expensive hotels, and not so many mid-range \"I need a place to sleep,\" hotels. Our guests spent a lot in getting to Seattle and staying where the actual wedding was (outside Seattle), so the Nexus served as a very functional, well-maintained and easy choice for us. Thank you to the group coordinator, Kiri Jacobsen, who continuously reached out to us to make sure all of our guests had what they needed. Great Hotel!", "Date": "August 22, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "3.0", "Value": "3", "Service": "4"}, "AuthorLocation": "Nanaimo, Canada", "Title": "“We'll be back”", "Author": "Sleptthere", "ReviewID": "UR116949459", "Content": "Booked the room for one night, four rooms in total. The rooms were fine, the bed comfortable. Staff friendly and helpful. Booked the free shuttle for 12 people to go to the Mariners vs Blue Jays game, and we arrived early to line up. One shuttle parked and guests poured into it, except for us. The next shuttle came and that one filled up. At this point 5 of our party decided to take a vehicle to the game. We barely got onto the next shuttle. I don't blame the hotel, it was the rude guests that ignored the 12 people lined up. Mind you, shuttle service could use better organization. We decided to spend another day and the hotel had no problem accommodating us. Though we did decide to cab it downtown and back. $20 cab fare each way. Shuttle or cab the hotel is convenient, right off the I-5. We will definitely use this hotel again. It is a little pricey, have had much nicer larger rooms for less. There are a lot of medical patients here, and across the street by Starbucks seemed to have a few odd looking people hanging around. Mc Donalds across st, mall in walking distance, 7-11 and a restaurant in parking lot.", "Date": "August 19, 2011"}, {"Ratings": {"Cleanliness": "2", "Sleep Quality": "2", "Overall": "1.0", "Value": "2", "Service": "1"}, "AuthorLocation": "Spokane, Washington", "Title": "“Shuttle left us stranded at 11 pm with a 4m old baby!”", "Author": "jeu7171", "ReviewID": "UR116852613", "Content": "My daughter has monthly trips to Seattle Childrens and Nexus is always where we stay. This time we booked 3 rooms and brought both sets of grandparents and planned on staying 5 days and have some fun. Our reservation was a mess when we got there and my mother was put on a seperate floor on the other side of the hotel. We had tickets to the Mariners game on Friday night and booked the shuttle 24 hours before the game as the hotel suggested. The shuttle left the hotel 20 minutes late and then the driver went straight on the freeway into rush hour traffic rather than go around through back streets. Thus we arrived right before the game started instead of an hour and a half early. We were booked on the return shuttle and were told to meet outside the amtrack station directly after the game (around 1030 pm) We arrived at the spot at 1015. At around 1045 2 vans from the hotel arrived. One of the vans had a rear facing car seat in it for our 4 month old. The driver didnt check the roster and allowed a large group of people that were not scheduled to board the van. The driver refused to ask the people to get of the van and allow us to board. Even though our party was on the list. The driver said another van was coming and left us! 1100pm with a 4 month old baby! We called the front desk and were told by someone who said it was his last night that another shuttle was not coming. That the driver had to drop everyone and come back to get us. Long story short, we didnt arrive back to the hotel until 1245. We were in a seedy part of town, where we had to deal with bums and prostitutes for over 2 hours with our parents in their 60's and our new baby. The kicker is the trip takes about 15 minutes with normal traffic. No excuse for them making us wait! Very disapointed! We will not return! Sidenote-we had no maid serivce our entire 5 days. We had to call and ask for towels 4 times before we were sent clean ones.", "Date": "August 17, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Service": "4"}, "AuthorLocation": "Seattle, Washington", "Title": "“Great hotel for my wedding guests!!”", "Author": "Erica72", "ReviewID": "UR116635136", "Content": "Hotel Nexxus was more than perfect for my wedding guests. Not only did they provide beautiful rooms with a great staff the hotel was able to provide the Breakfast Room...which was a lot more spacious than I thought....at no cost and we used that for our rehearsal space the night before. The hotel has a great pool and outdoor seating area with large tables with umbrellas and chairs. This area ended up being the gathering place for many of my guests. The hotel also ended up providing a complimentary shuttle from the hotel and wedding venue...Golden Gardens Bathhouse...for the guests that were staying at the hotel. The hotel was also very easy for my out of town guests to find because it is right off the freeway. Everyone I talked to before hand responded to calls really fast and were really usefull with information. I would definately recommend Hotel Nexxus and am very pleased to have used them for my wedding.", "Date": "August 12, 2011"}, {"Ratings": {"Cleanliness": "1", "Sleep Quality": "3", "Overall": "1.0", "Value": "2", "Service": "2"}, "AuthorLocation": "ggojai", "Title": "“Dirty, not a bargain or good value. Great location”", "Author": "ggojai", "ReviewID": "UR116502739", "Content": "I stayed in room 228 for 5 nights and I was shocked at the level of dirtiness. I spilled something on the floor and when I wiped it up the towel was filthy from the dirty rug. Towels were not not delivered for hours when requested. My sink and tub was not cleaned during my whole stay. The stairways were concrete and the walls were spray painted and it was sprayed all over the bare steps. I liked the management and the location was great but during my stay 2 times emergency services were spotted on the property. All room windows open to an open walkway so for any degree of privacy the curtains had to remain closed.", "Date": "August 10, 2011"}, {"Ratings": {"Service": "2", "Cleanliness": "2", "Overall": "2.0", "Value": "1", "Location": "3", "Rooms": "2"}, "AuthorLocation": "", "Title": "“Horrible value, not worthy of being called a \"hotel.\"”", "Author": "SeaBusTraveler", "ReviewID": "UR116076820", "Content": "I recently stayed for 5 days on business at the Nexus. The hotel touts itself as being remodeled and modern, yet they still have 20 yr old televisions in some rooms. The colors make it look like it was used as a drug dealer motel in Miami Vice in the 80's. And the Breakfast is sparse and of low quality. I stayed in one of the Hydrotherapy suites. Do not believe the advertising. It is a overgrown tub that you can sit in. They are noisy and keep you awake if your neighbors happen to run theirs at night. Oh, and they are all bottom floor suites. Worse yet, there is little privacy in the rooms, given only a piece of glass separates the sleeping area from the toilet. Also, the Nexus has a policy that only your bed gets made and towels changed if you stays less than seven days. No counters or toilet cleaned, nothing else. Maids are in and out in just a few minutes. The Nexus is nothing more than an old outside-door motor inn that has had a feeble attempt at remodeling on the outside. It is still a noisy, cramped, and cheaply furnished motel on the inside. For your $150, the are many newer hotels (the Nexus is a motel still) that offer much better accommodations and service.", "Date": "July 31, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "4.0", "Value": "4", "Service": "3"}, "AuthorLocation": "Vancouver, Canada", "Title": "“Good value”", "Author": "tortitabby", "ReviewID": "UR116036754", "Content": "I have stayed at this hotel several times for business and family purposes, as I find it to be great value. Clean rooms, good breakfast selections, shuttle to various Seattle locations with decent times for drop-off and pick-up, adequate service. If you choose to drive into downtown Seattle, it's only about a 15-20 min drive. It's close off the highway too.", "Date": "July 30, 2011"}, {"Ratings": {"Cleanliness": "3", "Sleep Quality": "2", "Overall": "3.0", "Value": "2", "Service": "3"}, "AuthorLocation": "bc, canada", "Title": "“Mediocre property-not retro as advertised.”", "Author": "mizzie", "ReviewID": "UR115932390", "Content": "Recently stayed here a couple of nights with family to attend some Mariners' games. The potential is here for a retro \"boutique\" style property; but at the moment it is far from retro, unless the definition of retro is tired and worn with slaps of 60's style colors. It resembles a motor inn and not a hotel style at all. The rooms are very basic: with a crowded sink/microwave/mini-fridge area, old style TV's, very spotty WiFi connections and the old fashioned heater/ac units under the window.The bathroom is small and when we checked into our room, towels and hand soaps were missing. I do have to give kudos to the staff for getting our missing amenities to the room very quickly. While we were there, a group of teens were there for a conference and over two nights, it was ridiculously noisy with running on the outdoor hallways late into the night and van alarms going off at 7am. My sister was a few doors down and was up til 3am listening to a ruckus on the floor above them; she finally went down to the front desk after repeated calls to the desk didn't address the problem. We did use the shuttle to get to Safeco Field and it was great getting there. Coming home, there seemed to be some confusion as to how many were going back, with not enough vans or seats available to porter us back. We stood around while the hotel staff tried to figure it out and finally after about 20 minutes all were accommodated. This shuttle confusion continued the next day when we tried to use the shuttle to get to Pike Place Market. I had put our name in at the front desk about an hour prior to the scheduled departure and when the time came, again the staff seemed confused as to where they would put the people in the couple vans that were going to various places. Had they kept us all updated of what they were trying to do instead of running in and out of the hotel lobby and looking confused, it would have been a lot less aggravating standing in the driveway awaiting some kind of direction. When they asked where we were going and what our room number was, the driver couldn't find it on his clipboard and this seemed to confuse them even more. We finally gave up after waiting 30 minutes and took a cab into Pike Place Market. They really need a more organized method for their shuttles so they could run more efficiently. We decided to cut our stay short by a day and checked out the third morning; the front desk staff did seem slightly apologetic but basically said that the noise they had with the teen group had cost them some business and remarked to me \"I guess we won't be seeing you at this hotel again.\" No, I don't think you will.", "Date": "July 28, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "usa", "Title": "“Large rooms,free shuttle service”", "Author": "3bear", "ReviewID": "UR115828163", "Content": "We stayed here before and after a cruise. They offered free shuttle service to the port and back. After the cruise we stayed to enjoy the sights of Seattle. The shuttle brings you to selected sights like Pikes Place market and picks you up at arranged time schedule. The front desk staff was very professional,caring, and helpfull, unique in this time. The rooms (we were on second floor, access via an elevator) were large and everything we needed (micro,coffeepot,refer). We very much enjoyed our stay here. A mall is around the corner too! In Seattle, we will be back for a vist and will stay here again!", "Date": "July 27, 2011"}, {"Ratings": {"Cleanliness": "2", "Sleep Quality": "1", "Overall": "1.0", "Value": "1", "Service": "1"}, "AuthorLocation": "Riverside, Illinois", "Title": "“Terrible awful service, crappy rooms”", "Author": "Anne987654321", "ReviewID": "UR115307109", "Content": "First, I'll start by saying that I think there may be 2 different Hotel Nexus in Seattle and this review is for the one on Northgate that is not downtown Seattle... This is an overpriced motel. I stayed here because I was in town for the Seattle to Portland bicycle ride, and the Nexus had advertised on the ride's website. They advertised a special rate, shuttle your bags to the start line, etc., etc. Fabulous! After making the initial reservation, any time we called to ask a question about the shuttle or whatever, nobody knew anything about it and told us to call back later. Finally we arrived. The lobby was nice and the staff was ok, but often was so difficult to get an answer to anything. Three of them standing there doing nothing, pretty annoying. The rooms are small and while some things seemed clean, the bedspreads looked old and shabby. The halls and elevators were small and hard to maneuver large luggage through. We got up the morning of the ride. Now, the hotel was full of cyclists and they couldn't bother to put the hot breakfast out a little earlier. They knew all the riders would be gone by the time they usually put it out. We were left with cereal, dry overboiled eggs and bagels. Half my bagel was dry, the other half was soggy. So gross. My friend wanted a photo of us so she asked someone who we think was another guest to take a photo. The man at the desk was apparently offended that she didn't ask him and made some comment. Fine, she handed him her camera. Then he didn't get off his lazy butt to take the photo. Seriously, he just turned his chair and took a crappy shot. WTH? Finally it came time for them to shuttle our bags to the start line. We dropped our bags in the lobby, and when we came back down with our bikes... the bags and shuttle were gone (they weren't supposed to drive us, just our bags). But now we had no idea where to meet the shuttle. We rode on to the start line and hoped for the best. We couldn't find the shuttle. My friend called the hotel. The man who answered was extremely rude (the same one who \"wanted\" to take our photo) and just kept telling her the driver was at the start line. \"He's at the start line.\" \"He's at the Start. Line.\" \"He. is. at. the. start. line.\" It was his only answer. Snottier each time. We tried to explain that there were 10,000 people there and we could not find him. Could he patch us through to the driver? No. Could he call the driver? No. Could he give us the number? No. What is your name? Click. He hung up on us. Several minutes later I called and asked for the manager. I was told she wasn't there. Again I politely tried to get him to help us. He spoke to me like I was the biggest moron in the world for wanting to find my bags. Again, I asked for his name and again he hung up. If you won't give someone your name, and your solution is to hang up on them, you know what you're doing is wrong. Finally, we located the driver. The driver, Dan?, (the only person with a clue at this whole hotel) informed us that he had just spoken to the man at the front desk and that they could have called him. This place is awful and the service sucks. The location isn't all that hot either if you're wanting to see Seattle. If you are going to advertise a special rate for a special event, don't act like jerks to the guests you attract.", "Date": "July 13, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "3.0", "Value": "3", "Service": "3"}, "AuthorLocation": "Sheridan, Montana", "Title": "“Nice enough with a great restaurant”", "Author": "sfp25", "ReviewID": "UR115229573", "Content": "Stayed here due to the advertised hospital discount. Booked two days but they actually only had me for one. Good thing I caught it before I left for UW and they cleared out my room . That would have made it for a pretty stressful day! But the \"deal\" I thought I had certainly wasn't a deal. It's within walking distance to the mall, but the restaurant Saffron was in the parking lot and it was amazing! Rooms were comfortable enough and adequate. If you're an Alaskan Medicare recipient it would be a great hotel, as they take care of it all, even taxis. It was out of the way for downtown or the university district but they did provide a scheduled shuttle for guests.", "Date": "July 10, 2011"}, {"Ratings": {"Overall": "1.0", "Value": "1", "Service": "1"}, "AuthorLocation": "", "Title": "“Hotel Suxus”", "Author": "pbstravels", "ReviewID": "UR115028480", "Content": "After a long airplane flight and arriving at 1am. We were told that our reservations \"had been kicked out of their system\" and the hotel was full. The desk clerk was very unsympathetic to our plight. Thank goodness the hotel manager was there. He arranged to comp our night at one of \"their sister hotels\" but we must return for the second night of our stay. He arranged a night at Staybridge Suites in Mukilteo, 20 minutes north of the city, Definitely not near the city of Seattle. Staybridge was wonderful. We later found out that Hotel Nexus was in a very seedy part of town. We had planned to stay there later in our stay...we immediately canceled.", "Date": "July 4, 2011"}, {"Ratings": {"Cleanliness": "3", "Sleep Quality": "3", "Overall": "3.0", "Value": "2", "Service": "3"}, "AuthorLocation": "Point Roberts, Washington", "Title": "“It's clean”", "Author": "statue1", "ReviewID": "UR113159914", "Content": "Not very exciting, but close to Northgate Mall for shopping and eats, a bit of a trip to downtown Seattle due to incredible traffic. A great donut shop in strip mall next to hotel.", "Date": "June 13, 2011"}, {"Ratings": {"Cleanliness": "1", "Sleep Quality": "2", "Overall": "1.0", "Value": "1", "Service": "1"}, "AuthorLocation": "Sierra Vista, Arizona", "Title": "“don't stay!!!!”", "Author": "dbarkley", "ReviewID": "UR112770691", "Content": "I was forced to stay at this hotel again (2nd time) because it was the contracted hotel for my job. I checked in on 6 June 2011. I did the \"obligatory\" walk through. At first sight, it didn't look too bad. When I got up the next morning to take my shower, there was alot of hair on the wall. You couldn't see it at first since it blended in with the color of the wall (brown). I went down and requested the front desk to ensure housekeeping fix this issue. When I came back that night after work, it still wasn't clean. I had to have housekeeping come by after 7pm to fix this problem. I had co-workers that the staff checked in, and the room was filthy!. bed wasn't made, trash was left in the room. I think there is a communication problem, even management issue within this hotel.", "Date": "June 11, 2011"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "5"}, "AuthorLocation": "St. Albert, Canada", "Title": "“A One Dressed Up As A Four”", "Author": "ILoveTooTravel", "ReviewID": "UR108496776", "Content": "My stay at this hotel was one night only, thank goodness. We came to this hotel very late at night and from the outside it looked like a very nice hotel. The lobby looked newly decorated, and so our thoughts were that this place would be great for the price, $110.00 a night. A lot of reno's were done to the room but when we turned the heater on in the room, what a racket. We had to sleep with the heat off if we wanted any sleep at all. The heaters need to be replaced as well. I was very cold for most of the night and too tired to ask to be moved. I have looked at other reviews and was a little confused because I saw some great reviews. I guess we were one of the unlucky ones.", "Date": "May 16, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Massachusetts", "Title": "“We would stay again”", "Author": "chiefj", "ReviewID": "UR101519897", "Content": "Our grandson was having surgery at the Children's Hospital and my daughter booked us here at a very good price. Four of us stayed in adjoining rooms and it was perfect with only about a 10-15 minute drive to the Hospital. The Interstate is right there and only a 15 minute drive to downtown, except during rush hour. The staff was friendly and helpful (save for one of the women who took care of the breakfast area - no smile or personality and needed to be a bit more attentive to cleaning tables and spills). On the other hand, they have one of the better continental breakfasts that we have experienced at a hotel. You can tell they are trying to do a good job. The building may be a little old but it is obvious they have made renovations, painted and decorated nicely, especially the lobby, which was also comfortable. The rooms were clean and bright and despite being on a busy and noisy thoroughfare, it was quiet. We had a good nights sleep every night. There is a nice Indian Restaurant next to the hotel that we liked and they provide room service. There is a Starbucks (of course they are everywhere) and convenience store across the street. A mall, with many different restaurants, is within walking distance. This is not a luxurious hotel and some people my not care for the exterior, balcony access to the rooms. That did not bother us at all and we found Nexus to be the perfect place to stay. It is in a good location and the price is right.", "Date": "March 25, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Salem, Oregon", "Title": "“It was amazing”", "Author": "jrksparkman", "ReviewID": "UR100873234", "Content": "We were treated so kindly. They had a great variety for breakfast that suited all our needs. They were curtious and promt with any need we had.", "Date": "March 20, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Everson, Washington", "Title": "“Nice and Convenient”", "Author": "hdblackandblue", "ReviewID": "UR100559493", "Content": "We were in Seattle for an overnight stay. We needed a place that was convenient to Seattle and the south side of Seattle . We really thought this is a great place to stay if you want to visit Seattle and save some dollars as it's pretty close to downtown. It wasn't exactly cheap, over $110.00 but we we're ok with it. They take pets so that was a bonus for us as our first choice didn't. The rooms were spacious but we found the furnishings to be a little dated. It was very clean and the bed was comfortable. Towels and bedding were nice and the fridge and micro conveniently located in the room. Breakfast was ok - the norm. We had a dog and there was hardly anywhere to walk her (the street behind the hotel). They charged $10.00 and thought that fair. One more thing, I called the front desk to ask where the vending machine was and the man who answered said \"fourth floor - elevator in lobby\" then click . . .he hung up on me before I had the chance to ask him about where I could find the ice. I went into the lobby looking for ice, I found the desk clerk chatting with the employee who hung up on me and I told him how rude he was. When I told him I would put this in my review, he fell all over himself apologizing. Management should work with staff on being polite, even if I was interrupting a conversation. All in all this was an nice place to stay and we'd stay again if we don't want to stay right downtown.", "Date": "March 17, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Anchorage, Alaska", "Title": "“Great beds, quite, dog friendly”", "Author": "Retired_Mom2010", "ReviewID": "UR97776182", "Content": "My husband and I and our small dog had a pleasant three night stay at Hotel Nexus in Feb '11. The beds were VERY comfortable and it was quiet, which inabled us to get a good nights sleep. My husband loved the free breakfast each morning. I appreciated the helpful and cheerful staff.", "Date": "February 23, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Salem, Oregon", "Title": "“Really Cool Rooms!”", "Author": "rsteckly", "ReviewID": "UR97234258", "Content": "I recently had a quick stay here as I was traveling through town. A friend of mine stayed here a few months before and recommended that I skip the downtown and University area hotels and stay up here. It was really sound advice. I took a short walk to the Mall and had dinner at the Ram (Great Beer!) The room was great, (not huge, but not small either), very clean, and the bed was better then the one I just paid $1,000 bucks for. The only thing I would change is that I would stop by in the summer when I can relax by the pool instead of being stuck inside with the crappy Seattle rain.", "Date": "February 19, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Seattle, Washington", "Title": "“5 Star Service, perfect location, comfortable room, my choice of pillows.”", "Author": "drdougm", "ReviewID": "UR92354159", "Content": "As an extended stay guest for business, for leisure, and as my choice for where to stay while I moved to Seattle; I was always impressed by the Hotel Nexus staff and by the comfort/cleanliness of the rooms. The decor was contemporary, warm, and welcoming, ,The bed was very comfortable, and I had my choice of pillows. Breakfast was free, fresh daily, and much better quality than I have had in many years of business travel. There was always hot coffee, and the staff was prompt and courteous with any request. The shuttle was timely, and they often gave me rides to and from work when needed. 5 Stars...way to go team Nexus! Dr.Doug", "Date": "January 9, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "2", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "3"}, "AuthorLocation": "Vancouver, Canada", "Title": "“Website misleading - not a retro hotel, just old”", "Author": "funkynalime", "ReviewID": "UR90862477", "Content": "Lumpy pillows, saggy bed, upraised carpets this is not a cheap and cheerful hotel. When I asked for non-lumpy pillows, I just got more lumpy pillows. It is a motel that is for the cheap traveller. Breakfast was also lacking including the hard as nails bagels. Will not be staying there again.", "Date": "December 28, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Olympia, Washington", "Title": "“Very friendly, clean and comfortable.”", "Author": "nwpeach", "ReviewID": "UR90359742", "Content": "I found the staff very nice. The rooms were large and the bed very comfortable. The decor is very bright and welcoming. I really liked the bathroom shower head which was very large and shower gel dispenser.", "Date": "December 21, 2010"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "4"}, "AuthorLocation": "Portland, Oregon", "Title": "“Book at your own risk”", "Author": "Disappointed121040", "ReviewID": "UR89960958", "Content": "First, and most egregiously, this is not a hotel - it's a motel. I would never have booked a room there if I had known this. How many ways did this motel disappoint me? Not counting the really nit-picky stuff, like not having a towel rack by the sink, or the fact that the room gave me the creepy feeling that a \"Criminal Minds\" episode featuring a bludgeoned hooker could easily be set there: It's non-smoking now, but the renovation didn't clear out the skanky old stale smoke smell. The refrigerator made a loud, obnoxious noise so that I had to unplug it for the sake of my sanity. I could hear my upstairs neighbor walking around and showering. The \"shower gel\" and \"shampoo\" in the dispenser were the same creamy green mystery fluid, and the touted curved shower rod led to a large puddle on the bathroom floor. There's no breakfast room service; the complementary breakfast is served in a very small room that is reminiscent of a school lunchroom and was far skimpier than Laurie S. describes. Worst of all, the battery in my smoke detector failed at 3:00am. While someone did arrive quickly to replace the battery, all I got from the desk staff was a \"Sorry about that,\" as if it happens all the time and it's just no big deal, rather than an uninvited assault on a decent night's sleep. I've stayed at a number of perfectly lovely hotels in the Northwest, and this is the first time I've been so offended I was moved to write a review. When I got to my meeting they said, \"Oh, we would have suggested the Hotel Deca.\" Live and learn.", "Date": "December 15, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "2.0", "Value": "2", "Sleep Quality": "4", "Rooms": "2", "Location": "5"}, "AuthorLocation": "Seattle, Washington", "Title": "“Not Impressed”", "Author": "Methow-Dreams", "ReviewID": "UR87802224", "Content": "The Japanese Hydrotherapy room got my attention. My wife and I like to splurge for jacuzzi-style hot tub rooms whenever we can and the price was right at Hotel Nexus ($116). However, the old adage \"you get what you pay for\" was in full force. It felt like a old motel trying to be cool and hip but not quite making it. The room was small and felt cave-like with it's low ceiling. The soaking tub easily accommodated two people and the water was hot, but the bubbles were not even close to the \"hydrotherapy\"of a jetted tub. The bed was great and the free breakfast was okay. Overall, it left us both a bit dissatisfied when compared to a newer Holiday Inn or Best Western.", "Date": "November 21, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Wrangell, Alaska", "Title": "“Best Hotel Ever”", "Author": "rcwenzel", "ReviewID": "UR86893542", "Content": "Simply a great hotel. The staff are friendly, courteous, and go out of their way to help guests with any problems. Beds are comfy, rooms are clean, service is prompt. The staff are great about remembering repeat customers and will jump through hoops to help them out. Ask for Johnathon if you need anything! A+++", "Date": "November 12, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Corvallis, Oregon", "Title": "“The Best Experience at Nexus!”", "Author": "juneinoregon", "ReviewID": "UR86876872", "Content": "When my husband bought me Seahawks tickets for my birthday, I immediately started looking for hotels close to the venue. I was shocked at how expensive hotels were AND how all of the hotels downtown charged $25+ for parking. I started looking into hotels with shuttles and I'm so thankful I found Hotel Nexus. We had an absolutely fabulous time! The staff were all so friendly. Free parking! Free internet! The shuttle was GREAT! I've had \"hotel shuttle service\" before (aka...say they will pick you up at a certain time and they are still not there 2 hours later), but Hotel Nexus exceeded our expectations. The free breakfast was great (waffles and even biscuits and gravy one morning!) When we arrived we were offered an upgrade to their spa suites for only $10! The tub was HUGE and it was well worth the few extra bucks. Finally, our first evening we ate at the Saffron Grill which is the restaurant associated with Hotel Nexus (I believe they even do room service!). It was hands down one of the top 5 meals we've ever experienced! All around great stay!", "Date": "November 12, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "2", "Overall": "3.0", "Value": "2", "Sleep Quality": "2", "Rooms": "2", "Location": "4"}, "AuthorLocation": "Vancouver, Canada", "Title": "“Pretty Junky”", "Author": "TR1PADV150R", "ReviewID": "UR78516033", "Content": "Following peoples ratings can be hard as it comes down to what you're used to in a hotel. If you're used to things being spotless, this is not the hotel for you. A water leak, upraised carpeting, patched walls and ceilings, grease all over the window, patched and repainted sections everywhere (including behind the front desk) is what welcomed us. The staff is young and 1 was more interested in texting than helping me. I will say however, that the location is good and the hotel was quiet. Room service was polite and fast. Shopping and a couple good restaurants are close by. Service can fluctuate everywhere you go, but I couldn't get past the patch jobs. Hate to be a snob, but I'm looking for spotless.", "Date": "September 6, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Forest Grove, Oregon", "Title": "“Awesome trip, great service”", "Author": "footballfans123", "ReviewID": "UR77167243", "Content": "We have been going to this hotel for about 6 years now. The service we received was excellent. The breakfasts were great...so much to choose from. The beds are oh so comfortable! Our room was clean and just what we needed. We didn't use the pool, but it looked clean. You shuttle service was awesome! We went to the Seahawks game one day and to the Space Needle another day, and just knowing we didn't have to drive there made it even more wonderful. The one thing we liked the least is there was no seating in the room other than a plastic computer chair. But we were there to see the sights not stay in our room all day.", "Date": "August 27, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "3", "Overall": "2.0", "Value": "2", "Sleep Quality": "4", "Rooms": "2", "Location": "3"}, "AuthorLocation": "Salem, Oregon", "Title": "“Incompetent Staff”", "Author": "vacationmom02", "ReviewID": "UR74353918", "Content": "Upon arriving I was told that I had four rooms booked under my name. I had reserved one room online and showed the desk clerk my paperwork. He said that if I booked it online, then sometimes the reservations were entered more than once by other staff members. I was assured I would only be charged for one room. However, several weeks later I was billed for two more rooms. Also, the young girls working at the front desk were not able to answer my questions. When asked about a grocery store in the area, one of them sent me to a town 30 minutes away!", "Date": "August 8, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "3"}, "AuthorLocation": "Ucluelet, Canada", "Title": "“Great Stay”", "Author": "missjennymarie", "ReviewID": "UR73161093", "Content": "The rooms were clean and comfortable. We stayed for a concert that took place and found the rooms to be more than suitable for our needs. The bed was extremely comfortable. The room was clean and sufficient for our purposes. We did not dine in for the complimentary breakfast though it did look like typical fare: cereals, bagels/toast, limited hot buffet items. There was a mix up with our reservations. They did not have them when we checked in. We had a trainee who was still learning but very friendly. The front office manager gave us a reduced rate for the mix up in our reservation and we were very grateful for this gesture. We thoroughly enjoyed our stay at this motel and would definitely consider returning if found in the area again. Though it is somewhat far from the downtown core, it is not a far drive and there is a shuttle service offered at the hotel. All in all we had a great time and would recommend this hotel to our friends and family travelling through the area.", "Date": "July 31, 2010"}, {"Ratings": {"Service": "2", "Cleanliness": "1", "Overall": "2.0", "Value": "3", "Sleep Quality": "2", "Rooms": "2", "Location": "3"}, "AuthorLocation": "Anchorage, Alaska", "Title": "“If cleanliness is a priority, not the right place for you...”", "Author": "leahcar8", "ReviewID": "UR69016735", "Content": "It never ceases to amaze me when hotels don't do a better job cleaning--it's probably the cheapest and easiest thing they can do to make a good impression and also the thing customers care about the most. So for this reason, I would definitely not recommend staying at this hotel. Which reminds me, why is it a hotel when the doors are on the outside? The comforter had a stain on it in plain sight that looked like seman or some other bodily fluid. Now I always take off the bedspread immediately anyway because I know a lot of hotels do not wash these in between each guest but come on...if there's a stain in plain sight i think you should wash it. Also, I don't even think they wash the blue blanket on the bed because when I saw them cleaning other rooms they did not take away the old blankets and they did not have any clean blue blankets on their carts. The good news is they were changing the sheets at least. The bathroom had strands of hair on the shower walls and on the bathroom floor (wasn't my hair), and all around the ledge of the tile was built up dust. The toilet was also not thoroughly cleaned...the part where the toilet seat and cover is attached to the toilet had some kind of white crud caked on it. Also, the hair dryer had dirt or makeup smeared on the handle, so they obviously do not clean this in between guests either. So, overall I guess it just depends on what your definition of clean is, but this hotel was unacceptable to me. We had room 303 and our other family members had the room next door (to the right from the outside). We paid $100 per room for one night. To be fair, our family who stayed in the other room did not have any complaints. I will not be staying in anything less than a Holiday Inn in the future.", "Date": "June 28, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Sleep Quality": "1", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Chilliwack, Canada", "Title": "“fire alarm going off for almost an hour is terrifying to a toddler!”", "Author": "lilymorg", "ReviewID": "UR68207172", "Content": "We were pleased with the rate we received by booking in advance. $104 for the Japanese Hydrotherapy room. The tub was very nice. The room was also very clean, and we had a room on the bottom floor and was pleased that we could not hear much street/highway noise. However, we found the beds to be too firm...the pool to be on the chillier side (this could have been due to using it on a cloudy day...but it was too cold to stay in for long) And the breakfast room to be far too busy. There were 2 waffle makers that had lineups both days...we ended up passing on breakfast as there was no where to sit. The fire alarm of the hotel went off at 8:45 at night...and then continued to go on and off for almost an hour. Our poor toddler was woken up from his sleep and terrified of the noise. We ended up sitting in our vehicle until the alarm was turned off for good. We also had a problem with the wifi, with too many subscribers logged in, we could not get logged in half the times we tried. The front desk gave us an ethernet cable to use, but when we got to our room there was no where to plug the ethernet in....after a call to front desk we were told that our room did not have an ethernet port...even tho it was advertised on our reservation sheet. Overall the rate was decent....but we would probably not stay here again.", "Date": "June 21, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "3"}, "AuthorLocation": "Sacramento, California", "Title": "“Best deal around!”", "Author": "Debwillow", "ReviewID": "UR68018659", "Content": "In this case, you get MORE then you pay for! The suites, with 2 queen beds and a living room and kitchen are well worth $129, especially considering we'd spend that just in food for two teenagers and we need to spread out a bit. Within walking distance to a mall with food/food court/Target, and a park, etc. A room this size is usually twice the price. The \"upscale retro\" is pleasent. The staff were helpful and accomodating. Most important to us, the hotel was very clean. WiFi available in our room allowed us to look up local attractions and map our day. Breakfast includes a hot meal (eggs/sausage-type of service), make-your-own-waffles, and typical pasteries, toast, yogurt, fruit, etc. The room that breakfast is served in is a bit small and often filled on the week-ends. We did not rent a car but relied on shuttles, which took us everywhere we wanted to go, but were often full - be sure to sign up for your shuttle early! The pool was heated, spa nice (next to freeway and noisy) but the gym's 2 of 3 cardio equipment did not work, however this hotel does not advertise a gym, so I was happy to find anything. Additionally, there is a laundry room for longer stays (soap available at nearby convienience store). We won't look any farther and will stay here for any future trips to Seattle. We'll return to Hotel Nexus", "Date": "June 19, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "3"}, "AuthorLocation": "", "Title": "“Excellent Hotel for singles and tourist for a short stay.”", "Author": "Desicooltraveler", "ReviewID": "UR67665819", "Content": "They also provide you Breakfast which is not bad. The service is not bad either", "Date": "June 16, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Spokane, Washington", "Title": "“Jumping on the Beds”", "Author": "yourgirl22wa", "ReviewID": "UR56813768", "Content": "My daughter and my mom decided to surprise my step dad for a last minute Valentine weekend getaway. I was told about this hotel and booked 2 rooms. One for my daughter and myself (2 queen beds), and one for my parents (King). Stepping into the lobby was as if in a time warp-in a good way. Everything was accessible from the computers to the breakfast area. After we found our rooms, my daughter found the joy in jumping from one bed to the other. (she can't do this at home). Everything in the room met my needs especially how clean the room was. This hotel had some of the softest beds I've slept in for a hotel. I was pleased. The next day, we experienced the breakfast. This was Sunday and on this day, they serve bisquits and gravy. There was also a choice of 3 cold cereals, yogurt, assortment of bagels and bread, fruits, juice, coffee, milk, and of course the famous belgian waffles. This was the best breakfast I've ever seen in a hotel for not being a restaurant. Before leaving our room for the day, the maid came by. I asked her not to worry bout the beds but we needed cups and the garbage taken out. She didn't quite understand what I was saying, a little English/Spanish barrier, but she was incredibly nice. Sunday night, my daughter (my valentine) went to the restaurant in the parking lot. Saffron Grill. The food was amazing and we didn't have to walk/drive anywhere. After going to bed, I did have a neighbor above me that would fall down every 5 or so steps with a loud \"thud\". This happened most of the night but I reminded myself we were in a hotel. Check out was a breeze on Monday... we left very happy. This hotel was close to EVERYTHING. Just a few minutes from Woodland Park Zoo, the Northgate Mall, and downtown Seattle. I loved it. Thank you and we can't wait to come back.", "Date": "February 22, 2010"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "Topeka, Kansas", "Title": "“hotel nexus”", "Author": "LydiaH4", "ReviewID": "UR53910624", "Content": "awesome hotel close to a lot of tourist sites in seattle. good breakfast and awesome hot tub in room.", "Date": "January 20, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Spokane, Wa", "Title": "“Diamond in the rough”", "Author": "rrearle", "ReviewID": "UR53787283", "Content": "We stayed at the Hotel Nexus on a weekend getaway with our family. The room rates were very reasonable and very economical. When we arrived the appearance was not what we had expected but upon entering the lobby and rooms all of our expectations were matched and then some. The rooms are retro in style yet modern in comfort, the beds are extremely comfortbale and shower had plenty of pressure. The breakfast area, rooms and lobby were all spotless. This hotels comfort was only topped by the ease of travel to Downtown Seattle. It is a quick 5 minutes to the Seattle Center and was very easy to travel. It was very nice being able to shop and tour downtown without having to stay right downtown and pay for parking! I'll be staying here again on my next trip through!", "Date": "January 18, 2010"}, {"Ratings": {"Service": "2", "Cleanliness": "5", "Overall": "2.0", "Value": "1", "Location": "3", "Rooms": "2"}, "AuthorLocation": "Seattle", "Title": "“Looks much better online”", "Author": "Onanonano", "ReviewID": "UR51934049", "Content": "I made reservations on the morning of the 26th online. When I got to Hotel Nexus the front desk clerk took it upon himself to lecture us about how making reservations the same day online doesn't actually work. I have a suggestion, how about making it impossible to make same day reservations online then?????? The external appearance of Hotel Nexus screams 1960s MOTEL. They ought to change their name to Motel Nexus. We wanted to have a relaxing evening so we got the Japanese Hydrotherepy suite. The bathtub is worth the extra money, although it gets really hot in there. The room is nice, but the bathroom wall is not solid. The bathroom light illuminates the entire motel room and you better be ready to share every yucky sound you make with everyone else in the room. :( The heater doesn't actually keep the room at the designated temperature. We have it set to 60 degrees F right now and it is really more like 75 in here. We had to turn the heat off completely just so we could stop sweating. The coffee is just horrible. I thought I was drinking sugared dirt water. Maybe I'm spoiled from living in Seattle, but the coffee is just disgraceful. I'm about to go try the breakfast. If it is horrible I'll write a second review entitled \"What did I just eat?\". ^_~ All in all I'd recommend staying somewhere else. This place is far overpriced for what you really get. They seem to think that the website is the most important part of their business, it makes the hotel seem spectacular....and it isn't.", "Date": "December 27, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Antwerp", "Title": "“Good place to stay, central to everything.”", "Author": "Expat_American", "ReviewID": "UR48306816", "Content": "I booked this hotel via Priceline and got a room on the front side of the hotel with a \"view\" of the city and I-5. Better than looking at the backside of stores on the backside of the hotel. The front side once you get in your room is very quiet. The rooms are very large and we had plenty of space to put out 4 suitcases and carry on's and spread out a bit even. Bathroom is a bit small, however there is a 15 minute timer heat lamp for when you get out of the shower or bath which is very nice. Water pressure is great and temperature can be as hot or cold as you want it. The vanity area is nice, but the sink pressure is a bit weak and the water is split out into a lot of small jets instead of one stream. Big plus in the room is the small refrigerator and microwave along with a coffee maker. We did not use the last 2 items but the refrigerator was great! Airco/heater units are a bit dated, but quiet and cool or heat your room pretty fast. Check in was simple and fast even when arriving at 8pm at night. The first room we got had a problem with the bottom of the door,which the maintenance guy on duty said he could not fix on his shift and went back to the front desk and got us another room within 5-10 minutes. We had 2 other minor issues which were responded to quickly during the day. Houskeeping starts at 8am, but does not check occupied rooms until after 9am. Very friendly staff and they keep the rooms spotless during your stay. Check out was fast, but the bell carts were nowhere to be found and a housekeeping person had to go look for one which took 10-15 minutes. That was the only down side. Wireless internet is fast in the room with excellent signal strength as there is a repeater on every floor. There are 2 older desktop pc's in the lobby that are free to use, however being public pc's there is no privacy programs to erase your history or filed in field entries. The CPU fans get very noisy when there are a lot of graphics being displayed. However web browsing is very fast! No charge to use them or to print documents out. A very nice thing to have. Lobby was spotless and modern and lots of daylight. Continental breakfast is good, you can make you own \"Belgian\" waffles, fresh fruit, eggs of various styles each day and bacon or sausage to go with them. Menu varies each day with waffles being the main item. Coffee and juice are also available. Wireless internet if you need it, with plug in's around the walls. Big screen TV's tuned to CNN. Breakfast is from 6-10am each day. We did not use the restaurant. Location is great, just off of I-5 at Northgate. Short distance to the mall from the hotel. A bit of a walk or a short drive with the car. Overall a pleasant place to stay.", "Date": "November 2, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Vancouver, Canada", "Title": "“Seattle Seahawks game & stay a value beyond words!”", "Author": "TheCanadianVoice", "ReviewID": "UR47501461", "Content": "I am a Canadian citizen in Vancouver, BC. I am a big Seahawks fan and had a friend coming in from the UK that is a “massive” NFL fan from afar. She had never been to an NFL game so my wife and I wanted to take my brother-in-law and her to Seattle for an experience. My wife and her brother are no football for sure but this experience had both of them wanting more. I had been sourcing tickets through e-bay and Craig’s List but was looking at about $100 for any ticket no matter its location in the stadium. Adding hotel on top of that and we were getting to be very pricey. It was only in the eleventh hour that I Googled “Seattle Seahawks game and hotel” and came across a couple of options including this package offered by Nexus Hotel. The others were over priced and just out of my range. I called the Nexus and spoke with Sarah who was more than helpful and accommodating with my questions and requests. It was when she said that it would be “$213 per couple” that I asked how much was the hotel on top of that assuming that the $213 was for the Seahawks tickets. I was pleasantly shocked when Sarah stated “that includes a night in the hotel and transport to and from the game”. Getting to Seattle and finding the Nexus was easy as pie using Google Maps. The Nexus is right off of the I-5 and can’t be missed. With the Seahawks package we all received a collector’s glass (nice touch) and a coupon for a free beverage at the Saphron restaurant next door. Now this is a motel set up with each room having a door to the outside world but it met expectations and passed them in terms of cleanliness and the “continental breakfast”. My wife checks for bed bugs wherever we go and this place was clean and had a recent remodel it looked like. We had two rooms for the four of and each of them had queen sized beds, a fridge and a microwave (those two were bonus items to us). Parking was ample and again… location, location, location! The next day was the Seahawks game and it was a bit confusing to find out when and where the bus left from as some of the staff had no idea but in hind sight the bus leaves at 10:30am and it goes from right out front of the hotel. On the bus is where we met our self-proclaimed “party hostess” and she had the most-est! Randi-Sue was a big Seahawks fan and it showed, she was enthusiastic and excited and she got the bus going and ready for the game. The fact they also brought along some beers for all of us to enjoy on route the game was just another bonus that we hadn’t expected. It was a short 20 minute ride to Qwest field but longer would have been ok too as the beer was cold and FREE! Randi-Sue took an interest in everyone’s experience and when she learned that I had three NFL virgins with me she offered us her discount card at the merchandise shops that offered us 15% off of souvenirs. Thanks again Randi-Sue! My English friend and I made good use of it and spent a couple hundred dollars on jerseys, towels, scarves, a jersey for her dog and countless other souvenirs. The fan experience at Qwest Field is second to none and my voice was horse for days after yelling and having a wonderful time for four hours during the game. The Seahawks were horrible this game but the experience of an NFL game at Qwest Field made for some awesome memories and my wife and my brother-in-law are asking when we’re going again already! We got back to the hotel after the game (thanks for waiting for us Randi-Sue while we shopped) and went to the Saphron for our free beers. We were expecting to have a full meal there as it was dinner time but when we walked in the owner and the staff were meeting and the owner looked at us like “how could you come in the restaurant right now”. We sat at the bar and ordered our drinks and spoke with the bartender who was less than impressed with the owner. Most of the other staff were moping around like their dog had been shot so needless to say we had our drinks and left. We asked the staff at the Nexus where we should go next and they pointed us in the direction of the Ram Pub. Awesome place to have some great bar food, some cold drinks and the service and atmosphere was what we were looking for. Upon check out the Nexus could have some more staff (more than one) at the counter for 11:00am on a Monday but I finally got my receipts only to have a phone call hours later that I was under charged. As it turned out they had over charged my credit card but when I called Sarah to sort it out she again was more than helpful and had the charges reversed in an instant. I will ABSOLUTELY return to the Nexus hotel providing they continue to offer the Seahawks package!", "Date": "October 22, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Location": "4", "Rooms": "4"}, "AuthorLocation": "Portland, OR", "Title": "“Excellent customer service and a great room!”", "Author": "coop786", "ReviewID": "UR46783604", "Content": "I walked up to the front desk after driving for three hours to Seattle and was in a lousy mood but was soon put at ease by the staff when I was given excellent customer service. I am a student and needed a great deal on a room and the guy at the front desk told me that he could give me a discounted rate and offered me coffee, which made me very happy. I found the room to be clean and the beds very comfortable. I will definitely be staying there again the next time I am in town.", "Date": "October 13, 2009"}, {"Ratings": {"Service": "1", "Cleanliness": "5", "Overall": "3.0", "Value": "2", "Location": "2", "Rooms": "5"}, "AuthorLocation": "CRW", "Title": "“Great room but poor services”", "Author": "WVSpelunker", "ReviewID": "UR46271270", "Content": "The issues started as soon as we arrived as we had called asking for the shuttle service to pick us up from the train station, but the van never showed. The hotel said that the driver could not make it due to a soccer game letting out. After we arrived to the hotel by taxi, we checked in and was given the wrong room (paid for the Japanese hydrotherapy spa) and had to convince the desk clerk that our original room didn't have the spa. The hydrotherapy spa rooms are very nice and everything else was very clean. No complaints about the room. Next day, we scheduled for the shuttle again to explore downtown and we were \"bumped\" to a later shuttle that didn't allow us to visit most attractions due to the late time that it left. A better shuttle service and more knowledgeable staff, and this would be a great hotel.", "Date": "October 8, 2009"}, {"Ratings": {"Service": "1", "Cleanliness": "2", "Overall": "1.0", "Value": "1", "Location": "3", "Rooms": "1"}, "AuthorLocation": "blaine, wa", "Title": "“Third time's a charm? NOOOOOOO !!”", "Author": "twotravelBlaine_Wa", "ReviewID": "UR44235836", "Content": "If you are staying at this property to use their free shuttle for sporting events - DON'T. Being the apparent idiot that I am, I gave them three tries in 3 years. 1st time, shuttle was full, had to take a $75 cab ride, second time they couldn't find a driver, 3rd time, they could get you there but you had to leave the game an hour after you got there to catch the early shuttle back because they couldn't find a driver to get you back AFTER the game....they can fill 3 shuttles to get you there, but then you're stuck.. The staff is uncaring, the management doesn't respond to complaints. It's a weird place. The restaurant/lounge is across the parking lot and is only open until 10pm. The rooms are sorta art-deco in an old fashioned sorta way. It's noisy and not very clean. If you need transportation to a game, take the bus, it's easier and not as frustrating as these folks.", "Date": "September 24, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Pullman", "Title": "“Tub in room was amazing!!”", "Author": "PullmanDrJones", "ReviewID": "UR43408987", "Content": "I absolutely enjoyed every minute of this trip and Hotel Nexus Seattle was an absolute pleasure to work with. We called to notify them we would be delayed and coming into town late and our reservations were updated on the spot. The front desk personnel was extremely helpful and always courteous. We upgraded from our king bed room to the hot tub room and I recommend that to anyone. It was amazing to get to the room run the water and soak in the hot tub while sipping some cold ones. The location of the hotel was key we jumped on I-5 and were never more than a few minutes away from anything we wanted to do. The zoo was like right down the road literally. We enjoyed our stay and look forward to staying again. Oh and the restaurant in the parking lot is amazing and a must visit. Their Chi tea is absolutely amazing!", "Date": "September 21, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Arizona", "Title": "“What a pleasant, relaxing stay....wouldn't hesitate to book again!”", "Author": "TamiPowell", "ReviewID": "UR41881888", "Content": "We loved our stay. I very seldom sleep well in hotels/motels, but we both got a great night's sleep all three nights we were there. The staff were courteous and helpful and the breakfasts were delicious with a wide variety. The hotel is in a great location and close to everything we could need...shopping, drug stores, public transportation, Target, loads of great restaurants. The room itself was spacious and comfortable and when we called for assistance to use the wireless internet, the staff was wonderful in getting us what we need. We wouldn't hesitate to stay here again. Made our visit a pleasure! And have already recommended to family planning a trip out West.", "Date": "September 15, 2009"}, {"Ratings": {"Service": "1", "Cleanliness": "3", "Overall": "2.0", "Value": "2", "Location": "4", "Rooms": "3"}, "AuthorLocation": "notpleased123", "Title": "“Nice hotel...HORRIBLE FRONT DESK!”", "Author": "notpleased123", "ReviewID": "UR40907642", "Content": "I booked this hotel before I read reviews and then before we got here I was nervous because of all the negative reviews. The hotel itself was very nice but I couldn't believe how rude the front desk people were. I thought maybe people exaggerated about how rude they were, but there is no exaggeration! Useless front desk people seemed like I was inconveniencing them by making them do there job and pay them money to stay at there hotel. Probably wouldnt consider this hotel again because of it.", "Date": "September 11, 2009"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Overall": "3.0", "Value": "2", "Location": "2", "Rooms": "2"}, "AuthorLocation": "Perth, Australia", "Title": "“Old apartment block with a tacky renovation”", "Author": "Hails81", "ReviewID": "UR37881026", "Content": "Photos look nice on the website but dont be fooled this is an old apartment block given a tacky and wacky renovation - booked a spa room and the spa didnt work, plumbing problems had to get toilet unblocked twice - very small room and bathroom. I think there was a wedding going on one night and we had to park way over at the credit union and didnt feel safe leaving the car there and then the breakfast room just doesnt have the capacity to cope with a full hotel - overcrowded, no tables or chairs avaliable, messy and goods not replenished. Some of the front desk staff are the most shocking ive come across - truly unprofessional and lack of knowledge on the other hand, there were a couple that were helpful. Dont ever bother emailing them as you will be waiting a week for a reply - thats even if you get a reply. Waited over 1/2 an hour on 2 occasions for the hotel shuttle - not good enough when you have to book in advance and reserve your seats for the scheduled shuttle. We often stay at Hyatt Summerfield Suites and thought this hotel maybe similar - obviously not.", "Date": "August 16, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Location": "2", "Rooms": "3"}, "AuthorLocation": "Georgia", "Title": "“Far north of the main tourist attractions and restaurants.”", "Author": "JustRelaxGeorgia", "ReviewID": "UR36831354", "Content": "This hotel is far north of the main tourist attractions and restaurants. The hotel and rooms are pleasant and the hotel shuttle is essential but planning your activities around their infrequent schedule is very inconvenient. BE SURE TO SIGN UP FOR THE SHUTTLE IN ADVANCE or you will be left behind! The staff is excellent and helpful. The medical center is nearby and many guests seem to find that convenient. If you are coming to Seattle and wish to be a tourist visiting the sights, you may be happier with a downton location, or near Pike Market, or Pioneer Place.", "Date": "August 5, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Location": "3", "Rooms": "4"}, "AuthorLocation": "Florida", "Title": "“Just Right for our group”", "Author": "SeaPuffer", "ReviewID": "UR35937953", "Content": "We are a group that specializes in travel/cruises for oxygen dependent people and their friends and family--called SeaPuffers. We were going on an Alaska cruise-roundtrip out of Seattle. We chose Hotel Nexus because of the price, but we found out a lot more! Everyone, from the front desk to the shuttle bus drivers were MORE than accomodating!! These folks did everything to make our stay enjoyable. They even changed a couple of folks' room because of a preferred location. Fresh coffee, warm cookies and smiling faces, clean but basic accomodations, what more could you want.", "Date": "July 27, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Kalispell, Montana", "Title": "“Nice place, very helpful.”", "Author": "Buddy21", "ReviewID": "UR35494557", "Content": "My wife and I stayed here for 4 nights while my Dad was having a heart procedure at the U of Washington Medical Center. The shuttle to the hospital was extremely helpful and the staff was very friendly. The room was clean and had a fridge, microwave and coffee maker. The breakfast provided had plenty of variety to chose from. There were plenty of eating places to walk to and the shuttle made getting around very easy.", "Date": "July 22, 2009"}, {"Ratings": {"Service": "1", "Cleanliness": "2", "Overall": "1.0", "Value": "1", "Location": "1", "Rooms": "1"}, "AuthorLocation": "uk", "Title": "“Not meeeeeeee!”", "Author": "Averill42", "ReviewID": "UR31044362", "Content": "This is classed as an hotel but more like a motel, did not feel safe at night, people hanging around outside your rooms, doorlocks broken for entry to parts of the building. Barricaded myself in with s/cases chairs etc. Lesson to be learnt sorry but never again.", "Date": "May 28, 2009"}, {"Ratings": {"Service": "1", "Cleanliness": "3", "Overall": "1.0", "Value": "1", "Location": "3", "Rooms": "1"}, "AuthorLocation": "Alaska", "Title": "“worst customer service experience ever!”", "Author": "AK-Traveler04", "ReviewID": "UR25342935", "Content": "The front desk had four employees on, including the manager and of them only one had any decent customer service skills. The manager was incredibly rude and unprofessional, and confrontational when we told him that we'd been hung up on by his only female front desk person when we called to ask why nobody had come to fix the lack of hot water in our room (after having been told an hour before that someone would be right up). We were shocked at how quickly this manager shoved aside the nice and helpful male clerk to tell us his clerk would never hang up on anyone and that we were obviously lying. He then told us that it was too bad but there was nothing they could do for us and we were wasting his time. We demanded our money back (we'd only been there one night and not one of us had gotten a hot shower!) for the remainder of our stay and were told, \"no, if you leave early you pay for the whole five days\". We eventually got our money back but had to get very upset in order to do so. Since then we have heard other people talk about bad experiences like this at the same place, when we bring it up there's always someone who's been there and can relate. Small world.", "Date": "February 28, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "3", "Check in / front desk": "5", "Overall": "4.0", "Value": "4", "Rooms": "5", "Location": "3"}, "AuthorLocation": "calgary", "Title": "“Great value”", "Author": "McNeils", "ReviewID": "UR20421129", "Content": "My wife and i stayed at this hotel for four nights. The shuttles that this hotel offers are incrediable. We used them to go to an NFl game, as well as pikes place, space needle and other venues as well. The shuttles made the tyrip because we never had to search for parking. The room was very large. Ask for a top floor room on the back side, these are the quietest rooms. This hotel will be great for travelers wanting a clean room to sleep in. This hotel will not work for people wanting to spend a great deal of time at the hotel , as there are few ammenties. we will stay here again.", "Date": "September 27, 2008"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Business service (e.g., internet access)": "3", "Check in / front desk": "3", "Overall": "3.0", "Value": "3", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Okemos, Michigan", "Title": "“It's okay”", "Author": "LAH_in_Lansing", "ReviewID": "UR20374688", "Content": "A very average hotel for the money. The room was very small and it can be a very long walk down the outdoor walkway from your unit to the nearest staircase. The room was clean, however. And the shuttle was a well-appreciated amenity considering the cost of parking downtown. Overall, I probably wouldn't stay here again or recommend it to anyone.", "Date": "September 25, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Business service (e.g., internet access)": "4", "Check in / front desk": "3", "Overall": "4.0", "Rooms": "3", "Location": "3"}, "AuthorLocation": "MI", "Title": "“Great for pre and post cruise”", "Author": "rkramadh", "ReviewID": "UR19703661", "Content": "I did a lot of research online before booking this hotel. I took it for its location and low price, as we needed to be close to the Pier prior to our cruise. There is a huge mall within walking distance and also a Target etc which came in handy for us to pick up some last minute items prior to our cruise. We got free shuttle service to and fro from the pier and the van driver Bruce was friendly, helpful and courteous. The room had two queen beds, small fridge, coffe maker, TV. Room was not fancy but was clean (especially the very clean bathroom) and more than sufficient, particularly given the price of $129 per night in peak summer in Seattle! We took the shuttle even to downtown and got picked up late that night after our dinner...cab would have cost us close to $100 two way!!! It can take time sometimes if they have lots of passengers to pick up and people are not in their designated spot on time. People expecting luxurious hotel in Seattle for THIS price haven't done their research or are not well travelled is my conclusion!", "Date": "September 3, 2008"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Business service (e.g., internet access)": "3", "Check in / front desk": "3", "Overall": "3.0", "Value": "3", "Rooms": "3", "Location": "2"}, "AuthorLocation": "london", "Title": "“Room ok, breakfast disappointing”", "Author": "eurotourist75", "ReviewID": "UR19387676", "Content": "As others said, this is not a luxury hotel, so, manage your expectations! I have been to better hotels at a similar price, but it might be that it's Seattle in general that is more expensive... Our room at Nexus (at the back of the hotel, quieter) was clean, modern and spacious, although one may not like the external corridor. We didn't use the free shuttle as the schedule was not convenient to us, but bus 16 runs just outside of the hotel. I know free breakfast is always a plus, but this was disappointing. Food was the same you would get at similarly priced hotels, however the ambience was the thing that really made me realise I was in budget hotel: plain walls, disposable dishes and cutlery, black tablecloths giving an idea of dirt, big black rubbish bins with the lid open... If you care about these things you may prefer to skip the free breakfast at the hotel and go to Starbucks just across the road. Overall, this hotel is not bad, but not exciting either.", "Date": "August 26, 2008"}, {"Ratings": {"Service": "2", "Cleanliness": "4", "Business service (e.g., internet access)": "1", "Check in / front desk": "3", "Overall": "2.0", "Value": "2", "Rooms": "2", "Location": "1"}, "AuthorLocation": "Washington", "Title": "“OVERPRICED!”", "Author": "cougarpride", "ReviewID": "UR18830752", "Content": "I stayed a week and regretted it. On the website it seemed modern, but when I got there I was seriously disappointed. It was trying to be something it obviously isn't. It said it was pet friendly, however, when I got there with my two dogs I had no place to walk them. They didnt even provide a patch of grass. So why the pet fee? If you want to go to walk your dog you better be prepared to either walk or drive 2 miles to Green Lake Park, which can be hassle to do in the morning before going to work. The toilet was backed up and despite calling the front desk the afternoon it happened they sent someone the next morning. The shower curtains are so short that the floors get easily wet. The wireless was non responsive...most of the time not even working. I called the internet service provider but even after doing so it never worked. I had to get an ethernet cable. They only offered about five channels and HBO so if you are there for an extended stay you may get a bit bored. The layout of the building was pretty bad too. You can't open the curtains to your room without everyone being able to see in there...no privacy at all. So i had to stay there with the curtains drawn which can get a bit sad. It is also located on a very busy street and I heard sirens mulitple times a day. On a positive note, the breakfast was good, front desk staff were very accomodating with faxes I needed sent or received and the housekeeping staff provided good service and friendly. I was expecting something more for almost $200 dollars a night with a govt rate. For overnight stays it is ok, but anything longer or a person with pets can do better elsewhere.", "Date": "August 11, 2008"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "Chicago", "Title": "“Hotel Nexus - Great for Seattle visit”", "Author": "ChicagoBruce", "ReviewID": "UR18385616", "Content": "Spent 2 nights at Hotel Nexus in Early July with my wife and 2 children. We chose it because of the reasonable rates AND the shuttle service provided to downtown. What a convenience! After reading other TripAdvisor reviews I booked a room, requesting the back side of the Hotel. I don't know if was noisy on the street side, but it was quiet as can be where we were. The room was clean and comfortable. The was a small problem with air flow from the air conditioner, but after I called the front desk a member of the engineering staff showed up in ~5 minutes and fixed it. The continental breakfast was good. The best amenity was the shuttle service to points throughout downtown. We were dropped off by the Space Needle in the morning and after a full day sightseeing we walked to a Mariner's game and got picked up south of the ballpark after the game for our return to the hotel. It was great! Parking downtown would have been at least $20 staying in one spot. I'm so glad we stayed at the Nexus and I would do it again. (P.S. tip the shuttle drivers, they're worth it.) Bruce from Chicago", "Date": "July 29, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Business service (e.g., internet access)": "1", "Check in / front desk": "1", "Overall": "2.0", "Value": "2", "Rooms": "4", "Location": "2"}, "AuthorLocation": "Alaska", "Title": "“Pros and cons of Hotel Nexus”", "Author": "AKaroundtheworld", "ReviewID": "UR15634188", "Content": "I stayed at Hotel Nexus from a Thursday afternoon through Sunday morning. There are some good things and some not so good things about this hotel. I chose the hotel primarily for the location and for the fact that they provide a shuttle to the Childrens Hospital (as well as other area hospitals and attractions) where I was visiting. The good things about the location are the proximity to the freeway, and the Northgate mall. Also there is a very good restaurant next door. The bad things about the location are the proximity to the freeway (noisy) and the fact that the hotel is located on a busy road that connects to the freeway. The best thing about the hotel itself was the housekeeping staff. The room was very clean, the housekeepers were friendly and I never woke up to the sound of housekeeping calling to each other or vacuuming next door like I have had in some hotels. In fact, the housekeeping staff were the friendliest people at the hotel. The front desk staff, one in particular, were cold and not so efficient (almost as if they just didnt care) and unfriendly to the point of being rude. I noticed this with all the guests, not just myself. The other not so good things about the hotel was the look from the outside - very like a budget motel, with the rooms on several levels with their entry doors along a corridor on the outside facing the street (which is not always secure) and the outside just had a shabby tired look. One of the most frustrating incidents involved the internet access. The hotel boasts high speed internet in all the rooms. I was able to get online on Thursday but not at all on Friday or Saturday - it seems the hotel was full and the internet was busy and the signal was very weak. It was very frustrating as I was not able to be online again until Sunday morning. The hotel was very noisy, you could hear the guests in all the surrounding rooms, and while this is not the fault of the hotel, I had an upstairs neighbor who paced his floor (my ceiling) ALL NIGHT LONG for both Thursday and Friday night. Overall, I would not recommend this hotel. I was not in one of the premium rooms with the soaker tub however, but for the amenites and room I had here, you could get a room at another hotel for a better price, like an 8 or Motel6.", "Date": "May 4, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Business service (e.g., internet access)": "3", "Check in / front desk": "4", "Overall": "4.0", "Value": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Victoria, BC", "Title": "“Perfect for the game”", "Author": "Victoria_BCMark", "ReviewID": "UR12475419", "Content": "My son and I stayed at the Nexus overnight from Victoria BC. The hotel was affordable and perfectly located to get to the game in less than 20 minutes. It is also very close to Northgate Mall where we did some shopping and had a good meal. The room was clean and the staff were very friendly. The parking lot was well lit and safe. It is exactly what you would expect for the price. Great bargain, great location.", "Date": "January 9, 2008"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Business service (e.g., internet access)": "2", "Check in / front desk": "3", "Overall": "3.0", "Value": "3", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Seattle", "Title": "“perfectly fine”", "Author": "SamPatch", "ReviewID": "UR11977150", "Content": "Nothing fancy, but slightly better than some of the usual chain motels. Recent construction upgrade probably helped. My room was clean and on the less noisy, non-highway side.", "Date": "December 27, 2007"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "saipan", "Title": "“The bad reviews are decieving”", "Author": "blatro", "ReviewID": "UR10764225", "Content": "The only reason that Im writing this is to object to the bad reviews. This is not a resort hotel and one shouldnt expect it to be. My wife and I were there from Saipan for 8 days to visit family. The heat and hot water were perfect. Everything in the room worked. The room was clean and the cleaning staff were friendly. The location and service was great. Public transporattion is right up the street with a direct bus to the U district and downtown. The hotel van will take you for free to anywhere near their route. Lots of convient shopping and eats nearby. I think that those who write the negative reviews are delusional or expect much more than they are willing to pay for.", "Date": "November 12, 2007"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Business service (e.g., internet access)": "1", "Check in / front desk": "3", "Overall": "2.0", "Value": "2", "Rooms": "3", "Location": "2"}, "AuthorLocation": "Chicago, Illinois", "Title": "“Ok, but not a business hotel”", "Author": "ChicagoTrav", "ReviewID": "UR8580174", "Content": "I stayed at this hotel because it was close to a conference I was attending. I would not choose to stay at this hotel if you need to do business. The wireless network barely worked. The signal was so weak that it did not work properly, even after numerous calls to the internet provider. I ended up having to buy an ethernet cord to use my laptop. Also, my phone did not work the first evening of my stay. But, if you want a clean, no-frills place, this will do. The staff was friendly enough, and the continental breakfast in the morning is pretty good. The hotel is not close to the sights, so I would not find it convenient to stay here if you are sightseeing in Seattle. There is really nothing in the neighborhood and very little within walking distance unless you want to visit a below-average shopping mall down the street. If you have problems walking, make sure you room is near the elevator, which is inconveniently located if you were placed, like me, at the end of the hall on the top floor. I ended up taking the stairs, but if you have bad joints or are out of shape, it is not convenient unless your room is near the elevator.", "Date": "August 30, 2007"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Washington State", "Title": "“Loved the hydrotherapy spa”", "Author": "luneytunz", "ReviewID": "UR8263865", "Content": "Enjoyed my stay, room was clean, had a broken iron, but not a problem. Very busy, close to shopping, and a good complimentary breakfast, from cereal, oatmeal, boiled eggs... The japanese hydrotherapy spa was great, would def rent that room again!!", "Date": "July 31, 2007"}, {"Ratings": {"Service": "3", "Cleanliness": "1", "Business service (e.g., internet access)": "3", "Check in / front desk": "1", "Overall": "1.0", "Value": "1", "Rooms": "1", "Location": "2"}, "AuthorLocation": "minot,north dakota", "Title": "“Not recommended if looking for clean.”", "Author": "Minotmom", "ReviewID": "UR8226991", "Content": "Carpet was filthy! Our feet and socks were black within minutes of being in room. The walls in the full kitchen suite were splattered with grease or food. Our 17 month old son had to sleep in a second-hand (manager admitted they purchased used from another business), stained, dirty playpen because they do not provide cribs even though their website stated they did. Front desk was lacking. Cabs were not called when they said they would, we did not get a wake up call the morning of our departure when we requested one the night before, and the free shuttle service was slow. Allow plenty of time to get to your destination. It took one hour to get to the Space Needle from the hotel. We understood this was not a 5 star hotel, but when paying almost $200 a night, we hoped things would have been nicer. We will never stay at this hotel again!", "Date": "July 24, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "3", "Business service (e.g., internet access)": "3", "Check in / front desk": "4", "Overall": "4.0", "Value": "4", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Agassiz", "Title": "“Hotel Nexus Seattle Washington Great Place to Stay”", "Author": "RoadrunnerAgassiz", "ReviewID": "UR7749803", "Content": "My wife and I had to go to Seattle, where our daughter had been flown from Vancouver B.C. Canada to give birth to our premature granddaughter. Our daughter had been staying at the Hotel Nexus for approximately three weeks and recommended the Hotel to my wife and myself. Upon calling the Hotel to make reservations the Hotel accomadated our request for a room close to our daughters. Next door in fact. As well the staff were well informed of our daughter and her family. Upon arrival the desk staff were extremely helpful in booking us in, and demonstrated an understanding and knowledge of what was occurring with our daughter and her family and ensured that we were informed while at the same time maintaining confidentaility in regards as to being overheard. We found our Hotel Rooms clean, the pool was in very good condition, and the staff was excellant. I had read previous reviews on the Hotel Nexus which were negative and to be honest I was quite concerned however as I have stated I found the Hotel Nexus to be higher rated than stated.", "Date": "June 3, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Phoenix", "Title": "“What a gem”", "Author": "criverz", "ReviewID": "UR7657266", "Content": "What a gem! We just concluded a perfectly delightful stay at the Hotel Nexus in Seattle, WA. We flew in on a blustery, rainy day, feeling a little bedraggled by a day of traveling, and were immediately warmed and uplifted by the sparkling, personal greetings and reception of the friendly hotel staff. The lobby, and come to discover the rest of the hotel as well, was artfully and tastefully decorated with funky, eccentric, neomodern retro-furnishings, the likes of which I have not seen anywhere else in my travels. In speaking with hotel personnel, they informed me that each piece was handmade exclusively for them by local furniture crafters, and were entirely unique. In our room, the unique and progressive design features continued, and we enjoyed the most comfortable mattress that I have ever slept on. Normally, I make it through a hotel stay with varying amounts of discomfort, but I slept like the proverbial baby and didn't want to get out of that wonderful bed in the morning. All during our stay the staff was extremely helpful, cheerful and genuinely concerned about both our comfort and our \"tourist\" experience, recommending (without prompting) any number of local attractions and activities. We loved the area and we particularly enjoyed the hotel. We can't wait to go back!", "Date": "May 20, 2007"}, {"Ratings": {"Overall": "2.0", "Value": "2"}, "AuthorLocation": "Washington", "Title": "“Incompetence”", "Author": "lmmidpoint", "ReviewID": "UR7586318", "Content": "I booked ( on the hotel's own website) a room at this hotel specifically for the hydrospa tub in the room. I was taking a test at the University of Washington the next day and wanted to relax the night before. Upon arriving I was informed that they did not have my reservation and did not have any more tub rooms either. Once I did finally get another room, it was just okay, nothing special. The staffer at check out was a joke, I spent 30 minutes waiting for him to shuffle papers, find things he had but got lost in the mess of papers he had going, and to say that my shuttle reservation was on another sheet of paper and that's why they didn't have that one either. After two trips back to the office to get my key turned back on so I could load my stuff in the car (it was 6:30 am), I ended up missing breakfast because of the runaround. Shesh!!!!!!", "Date": "May 10, 2007"}, {"Ratings": {"Cleanliness": "1", "Business service (e.g., internet access)": "2", "Check in / front desk": "3", "Overall": "1.0", "Value": "1", "Rooms": "1", "Location": "2"}, "AuthorLocation": "vancouver BC", "Title": "“stay away!!”", "Author": "myfamilyof5", "ReviewID": "UR7014429", "Content": "We stayed at theis hotel when it was the Ramada Inn a few years back- didn't like it then either We thought they really renovated and upgraded. The website makes it looks good- the only thing nice about it is the lobby. The rooms are small and cramped, yes we are a family with 3 kids but have never had a problem at a Hyatt or other hotels. Aside from that the room looked and felt dirty- when we checked in there were no towels or soap. The bedspreads looked very shabby and when you actually see the covers underneath they has several holes!!- The pillows were a joke- the 1st morning we went out and came back at 2pm- the room hadn't been cleaned- okay- so when they did come in she changed the sheets, not pillowcases, no did she even wipe down the bathroom or sink- Oh yes, when you used the sink it filled up- maybe drano would work- no closet just an area near the bathroom- and yes a plus with microwave and fridge but the area was so tiny, the fride also leaked all over the floor (a nice puddle to step into.) We didn't get a chance to go for the breakfast, so can't comment on that. It is a a very busy street. You can't open the drapes to see light as everyone can see in- The rooms were quite dark-poorly lit. Would not stay there again-", "Date": "March 12, 2007"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Check in / front desk": "4", "Overall": "4.0", "Value": "3", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Chilliwack, British Columbia", "Title": "“Good value, good location”", "Author": "exiled-scot", "ReviewID": "UR5780995", "Content": "We last stayed there at the end of August for a couple of nights, as we had stayed there previously. This is a hotel that offers good value and is in a good location for shopping. We found the room very clean, and the bed comfortable. The front desk staff were very friendly and helpful and we would definately stay there again. I can't believe all the negative comments about this hotel our experience was excellent.", "Date": "September 8, 2006"}, {"Ratings": {"Overall": "1.0"}, "AuthorLocation": "zurich", "Title": "“Loud”", "Author": "Speedy-Vesper", "ReviewID": "UR5691709", "Content": "Front desk personnel were unfriendly and not helpful throughout the stay. Couldn't sleep, because so close to highway. Public Transport not available", "Date": "August 22, 2006"}, {"Ratings": {"Overall": "1.0"}, "AuthorLocation": "Honolulu", "Title": "“Nightmare on Northgate Way”", "Author": "oahutraveler2", "ReviewID": "UR5488117", "Content": "We were visiting family close to this location so decided to try it over much nicer hotels in Seattle. The first morning of our stay water started pouring through the light fixture in the bathroom. We called the front desk who suggested that we take a key for a dirty room and use the shower there. I was told that they did not want to give us a key to a room with a clean shower because they would have to re-clean the room. When they finally agreed to allow us to use a clean shower they told us that they did not know when they would be able to fix our room. We were considering checking out when the manager told us that if we stayed the next night that we had reserved she would make sure that we would be taken care of. Although the room was cleaned when we returned, taking care of us was a $10 discount on the room which frankly was less than we tipped the maid. The front desk staff was disinterested and somewhat rude, parking was difficult to find and although they said that the hotell was newly remodeled it still looked like a run of the mill Ramada Inn. It's near a hospital and you will hear sirens all night long. Good luck if you stay here.", "Date": "July 19, 2006"}, {"Ratings": {"Cleanliness": "2", "Overall": "2.0", "Value": "2", "Service": "2", "Rooms": "1"}, "AuthorLocation": "Honolulu, Hawaii", "Title": "“New Name-Nexus, Old Hotel Look”", "Author": "kennygH0n0lulu", "ReviewID": "UR5405848", "Content": "We're out of State visitors to the Seattle region visiting our daughter and stayed at the Ramada Inn @ Northgate for 3 nights which were 3 nights too much. There were a few some pro points about the hotel-near the Northgate Mall and highway on-ramp entrances, free parking and continental breakfasts but the cons over-ruled the pro points. Cons- Check in was messed up with a confirmed reservation for a two double bed room, but front desk told us that they had us for a room with single queen size bed. No bell man to take our baggage to our room. The lobby's single elevator is too small to transport 4 adults with baggages. Room number configuration is confusing-odd number & even number rooms on either side of the building. Strange hotel design-coming out of the elevator where all room doors are exposed to the outside part of the building. Hate to check in this hotel when the temperture is in the 20's-30's. Tiny cramp rooms and out-date furniture- lamp with blue poka dots shade & green plastic swivel chair. Room's only window is fronting tthe corridor preventing privacy. Air conditioning is NOT central air. It's a stand alone a/c unit that is built in the exterior wall under the window. Our a/c unit's control was broken and could only work when the gauge is at the coldest settings. Instead of freezing, we turn the a/c off and slept in a musty but warmer room. The blankets were thin and the bed sheets were stiff, regardless of their claim of upgrading their beds with new Serta beds, our sleep were not restful. The bathroom faucet couldn't give us any warm water when we turned the handle to the middle, it was hot, hot water. The shower head was loose so on our first shower, water sprayed all over the bathroom floor. The name has changed from the Ramada Inn at Northgate to the Nexus, but it's still an out-dated and a budget class hotel that we definitely won't come back to. For a few bucks more, I'd rather stay at a Marriott and enjoy their superior rooms ,service and ameneties. Overall grade for the nexus hotel- D", "Date": "June 28, 2006"}], "HotelInfo": {"Name": "Hotel Nexus Seattle", "HotelURL": "/ShowUserReviews-g60878-d124044-Reviews-Hotel_Nexus_Seattle-Seattle_Washington.html", "Price": "$109 - $169*", "Address": "<address> <span rel=\"v:address\"> <span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">2140 N. Northgate Way</span>, <span class=\"locality\"><span property=\"v:locality\">Seattle</span>, <span property=\"v:region\">WA</span> <span property=\"v:postal-code\">98133</span></span> </span> </span> </address>", "HotelID": "2515395", "ImgURL": "http://media-cdn.tripadvisor.com/media/ProviderThumbnails/dirs/50/2e/502e032d42132e53e02f260452e081fe8large.jpg"}}