{"Reviews": [{"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Owings Mills, Maryland", "Title": "“Great price Great value”", "Author": "squigy0", "ReviewID": "UR75056274", "Content": "Very reasonably priced hotel. Wireless internet was stable. Room was clean enough. Neighborhood was kinda sketchy but safe.", "Date": "August 13, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "2", "Location": "3", "Rooms": "1"}, "AuthorLocation": "Nokomis,Florida", "Title": "“Nasty, gross & disgusting”", "Author": "941FoodFan", "ReviewID": "UR33805104", "Content": "The beds were rock hard, the rooms had flies....lights flickered on and off in the rooms. The service was poor at best. Seemed like a shady place. Wouldn't recommend this flea trap to anyone.", "Date": "July 3, 2009"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Location": "2", "Rooms": "1"}, "AuthorLocation": "Portland, OR", "Title": "“Do not stay here”", "Author": "NorthwestlTraveler", "ReviewID": "UR26712453", "Content": "I stayed at the Eighth Avenue Inn last weekend and it was the worst place I've ever stayed. The room was dirty and the facilities were run-down.The management allowed people to loiter in the halls and parking lot all night long which prevented us from getting any sleep. The next morning we found a different place to stay and checked out. I waited until we got to the new room to shower because I was too scared to get in the dark, tiny and dirty stall at this dump.", "Date": "March 24, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "4", "Location": "4", "Rooms": "3"}, "AuthorLocation": "Portland, Oregon", "Title": "“Good Enough for the Money”", "Author": "tobeginwith", "ReviewID": "UR26154351", "Content": "I got this room for $48 plus fees on Hotwire (2* hotel Space Needle zone). After reading the reviews here I was concerned about this place but my fears were largely unfounded. This is a solid 2* hotel with no frills: a small but clean room that was cheaply furnished but the bed was comfortable enough and there was also a microwave and fridge (a nice plus). Plus you get free wifi and a decent complimentary continental breakfast in the morning. They charge $10 for parking (cheesy!!) but for less than $75 total it's a hard to beat price considering you're in the downtown core of the city.", "Date": "March 14, 2009"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Location": "2", "Rooms": "1"}, "AuthorLocation": "Portland", "Title": "“Not what my family wanted!”", "Author": "skyjordan23", "ReviewID": "UR24692204", "Content": "I wish I knew about Trip Advisor before I stayed at the Eighth Avenue Inn. I would have booked at a different hotel. I booked a room with a queen sized bed and a pull out sofa bed. My husband and I do not like to sleep in double beds so a queen was a must for us. When we checked in and went up to our room we were shocked to see two double beds.. no queen bed and no sofa at all! Also there was a strange metal box in the middle of the room. My husband told me it was an ozone machine, to remove odors. So we went back to the front desk and told him this wasn't the room we had booked. We wanted the queen bed with the sofa sleeper for the kids. He looked at us like we were crazy and said that they didn't have any sofa beds! We said it's right there on your website and so he called someone on the phone and said nope we don't have any sofa beds. At this point the kids are tired and cranky so we gave in and just took the double bed room. A maid later came and took the ozone machine away. Besides being the wrong room in the first place, it was just plain gross. The room looked nothing like the photo's. The carpet had stains. The bedding and curtains were dated. I went to take a shower and the shower head was way too low for a normal person. I'm only 5.6 and had to bend backwards to rinse my hair. We thought maybe this was intended to be a handicap room but one of the beds was almost up against the bathroom door. Overall we didn't feel safe here with the kids. The only good thing I have to say about the place was they had a good breakfast!", "Date": "February 17, 2009"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Check in / front desk": "3", "Overall": "2.0", "Value": "3", "Rooms": "2", "Location": "5"}, "AuthorLocation": "Vancouver, Canada", "Title": "“Good for the price...”", "Author": "sneaknsmiles", "ReviewID": "UR24670598", "Content": "I just returned from an overnight trip in Seattle. The hotel was sufficient for what we paid - $59 after taxes. I will admit that it was a little sketchy looking. It was a small room with a double bed, the bathroom was kind of gross looking with a rusting mirror and the shower was a single stall with no tub. I think you get what you pay for at the 8th Avenue Inn. The hotel is in a great location close to shopping, the space needle, etc. We didn't have any problems during our stay. It was just the furniture/rusting/chipped tiles that made our stay unappealing.", "Date": "February 17, 2009"}, {"Ratings": {"Service": "1", "Cleanliness": "2", "Business service (e.g., internet access)": "1", "Check in / front desk": "1", "Overall": "1.0", "Value": "1", "Rooms": "1", "Location": "2"}, "AuthorLocation": "Vancouver Island, Canada", "Title": "“biohazardous! do not enter!”", "Author": "discerningdweller", "ReviewID": "UR24646109", "Content": "My friend and I, being young people, decided to save a few bucks on our hotel to save more for our shopping trip that brought us to Seattle. NEVER AGAIN! We ordered TWO queen beds when booking, was told this was fine when I booked and then called to CONFIRM the whole thing, then ended up with ONE tiny double bed. There was a stained nasty pull out couch; however, this did not come with any sheets and we arrived late at night and didn't feel like asking the dirty, gangster looking staff to bring some. Had to wear flip flops in the shower...and didn't dare go anywhere near the bathroom walls! Come on..I've seen cleaner /nicer youth hostels!", "Date": "February 16, 2009"}, {"Ratings": {"Service": "2", "Cleanliness": "1", "Check in / front desk": "3", "Overall": "1.0", "Value": "1", "Rooms": "1", "Location": "2"}, "AuthorLocation": "San Francisco", "Title": "“Absolutely disgusting”", "Author": "sfmwh", "ReviewID": "UR23201254", "Content": "My reviews tend to be on the optimistic side, so it means quite a lot that I'm giving this property only 1 star. I'll concede that the staff was decently friendly during check-in. But I booked my room before I'd heard of Tripadvisor, so nothing prepared me for the less-than-ideal experience staying there. Despite my requesting a non-smoking room, the previous guest apparently had smoked heavily, with the hotel making no attempt to flag it as perhaps inappropriate for a non-smoker like myself. There was no way to prevent the smell from getting all over my clothes, etc. After some polite complaints, I was given a 10% discount, but the front desk employee said he couldn't change my room without his manager's authorization (and the manager's shift had already ended.) The smoking issue aside, the rest of the property was also not in the best shape. There were faded logos for the Motel 8 chain, and my travel partner surmised that the hotel must have been kicked out of the franchise for failing their quality standards! Thankfully we had only planned to stay in Seattle for one night, as we were on our way to Vancouver, so we didn't have to look for another hotel. And I'm also thankful that I've now discovered Tripadvisor, which has allowed me to avoid properties like this while travelling in other cities.", "Date": "January 2, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Business service (e.g., internet access)": "4", "Check in / front desk": "3", "Overall": "2.0", "Value": "3", "Rooms": "1", "Location": "3"}, "AuthorLocation": "columbus, ohio", "Title": "“Jesus god, don't do it.”", "Author": "laurensaturn", "ReviewID": "UR20322885", "Content": "Priceline \"hooked me up\" with this hotel. I should have been more careful. I can't complain about the location, it was pretty central to all of the fun in Seattle. The room, on the other hand, was pretty scary. At first it seemed normal enough-- clean sheets, clean towels, not pretty but no complaints. Then I got bedbug bites. After 3 nights I am covered in bedbug bites. I was too embarassed to complain about it and I had a feeling they'd make me take it up with Priceline anyways. The sheets were damn near toxic and I think they also gave me a rash. It smelled really weird and it had really nasty carpet. Anyways, if you want a cheap room close to the action and you don't care about your skin, this is your hotel.", "Date": "September 23, 2008"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Business service (e.g., internet access)": "1", "Check in / front desk": "1", "Overall": "1.0", "Value": "1", "Rooms": "1", "Location": "1"}, "AuthorLocation": "Portland, OR", "Title": "“Gross! Gross! Gross!”", "Author": "tamarama80", "ReviewID": "UR20202735", "Content": "I made reservations at this hotel based on their website. The pictures are really deceiving, and do not at all reflect the real condition of the hotel. Sure wish I would have checked around! The first room we were given was not was we had reserved. The second one wasn't either and was infested with monstrous cockraoch looking bugs. Just one word for this one: Eeeeeeew!", "Date": "September 19, 2008"}, {"Ratings": {"Service": "2", "Cleanliness": "2", "Check in / front desk": "3", "Overall": "2.0", "Value": "2", "Rooms": "2", "Location": "3"}, "AuthorLocation": "Europe", "Title": "“OK, but not more”", "Author": "cactusofa", "ReviewID": "UR19627532", "Content": "This hotel is within convenient waking distance to Downtown Seattle (about 10 minutes from the Hotel which itself is in a not very attractive area, but if you're on a budget, you might find that not too bad). There are also some nice coffee shops and a Whole Foods market right around the corner (on Westlake). But DO NOT expect spectacular Skyline views or any great atmosphere out here. There might be some intresting views from the rooms with a patio but even then it's mainly huge parking-area-car-dealership-atmosphere in the surrounding blocks, despite some trees). We never felt anything close to unsafe, though. This place is ok to have some sleep and a shower and then hang out in the city most of the time, not more. The official website photos tell you - as in most spaces - not the whole story. We stayed there three nights (1st floor, usually very noisy from staff working and people outside by the parking spots; room 105 is facing the laundry which is a big noise source) and then one night on the 2nd floor a week later, this time on the back side which was somewhat more quiet. You could, however, always clearly hear noises from rooms around ours. So, take earplugs with you. The rooms are OK at first sight (not more, let's say there are slightly under the level of usual 60$-motel averages in rural areas and clearly under newer chain motels), but they definitely would need some touch up or lower pricing. There are no terrible \"holes\", I guess, but it's all far from super-comfy. Bathrooms are OK, but you'd expect more quality and space for the price. Some mold on the ceiling, not too much though. One leaking water tap, water flowing down the shower drain only very slowly, toilets OK. The beds are OK. It just all has that 70s-style-look-and-feel somehow. A/C in one of the rooms looked messy (dust, missing switches). Some not-so-hidden spots in the room haven't been vacuumed in weeks. No big eye on details in this facility! The TVs didn't work properly in either rooms - a channel listing with 99 stations isn't worth anything if there are only five snow-stormy channels available. During the first stay we asked three times to have it fixed - the last night, there was a note from the maintenance guy \"I replaced the TV, seems to work better, sorry for the inconvenience\" - OK, that is charming, but I'd expect more. And even after the \"fixing\" channel reception was awful. And any technician should see that the loose TV cable wire needed to be fixed, not the TV set. Staff besides that was average friendly, not more, but no problems here. Wireless reception was poor in both rooms (lots of outages), and it's a slow network. Bottom line: I guess there are better places for that price. We gave them a second chance since prices dropped after labour day, but no positive surprises unfortunately. Average to below average place, just conveniently located, that's it.", "Date": "September 2, 2008"}, {"Ratings": {"Service": "3", "Cleanliness": "2", "Check in / front desk": "2", "Overall": "2.0", "Value": "2", "Rooms": "3", "Location": "3"}, "AuthorLocation": "brooklyn, ny", "Title": "“BEDBUGS!!!!!!!!!!!!! Don't stay at this hotel”", "Author": "lajeba", "ReviewID": "UR19402350", "Content": "Our stay at this hotel was above average until we woke up eaten up the next morning! Dozens of bedbug bites all over our bodies! The worst part is that now that we're back home, we have to make sure our house doesn't get infested with bedbugs. What a way to end a vacation.....", "Date": "August 26, 2008"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Business service (e.g., internet access)": "2", "Check in / front desk": "1", "Overall": "1.0", "Value": "1", "Rooms": "1", "Location": "1"}, "AuthorLocation": "washington", "Title": "“OVERPRICED DISGUSTING DIVE”", "Author": "mswindydawn", "ReviewID": "UR17090508", "Content": "Our first room was still dirty from the previous guests, so they rudely (as if it were my fault the room wasn't ready) moved us to another room. There was literally 3 inches between the bed and the wall to the bathroom, you had to jump the bed to get there! They charged me $180 for one night! The rooms were disgusting, dirty, stinky, and there was mold in the bathroom. There was nothing extra, even though for the price you would think there would be a pool or something...nope nothing, in fact there was NOTHING to do after 5 pm with kids near this dump. The staff was rude, the management was even ruder. I will never return to this garbage hole.", "Date": "June 20, 2008"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Business service (e.g., internet access)": "1", "Check in / front desk": "1", "Overall": "1.0", "Value": "2", "Rooms": "1", "Location": "1"}, "AuthorLocation": "vancouver bc", "Title": "“Hotel or Motel?”", "Author": "mendosa55", "ReviewID": "UR16806267", "Content": "I was travelling to Seattle with my girlfriend for her birthday as a surprise...... little did i know that the surprise was on me when i got to my reserved motel through hotel hotline dot com. When i arrived immediately the seediness was visible from the outside. I was charged $140 us for a room i didn't even stay in. When i approached the front counter and asked for my money back, the staff said that i had to contact the site i had booked my room with in order to get a refund. So I did. The site had an answering service which i had left a message with and it took then 2 days for them to get back to me. At the time i was at the hotel i was assured by the front counter staff that i shouldn't have a problem getting my money back. So we moved on to the Roosvelt, paying double but worth it compared to what we saw with the eighth ave inn. When the website got back to me regarding my refund, they said that they require 24 hours notice for cancellation or i am subject to a charge for the 1st nights stay. Well since i was there only for 1 night i got nothing! Beware of this site and this hotel the advertising was false and the rates are way too much for what you get. Even after reading the reviews on this website i found out people paid a lot less than what i did for a room that they did stay in. This whole event left a bad taste in my mouth. I feel ripped off and unfortunately due to legalities there is nothing i can do.", "Date": "June 9, 2008"}, {"Ratings": {"Service": "1", "Cleanliness": "3", "Business service (e.g., internet access)": "4", "Check in / front desk": "1", "Overall": "2.0", "Value": "3", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Colorado Springs, CO", "Title": "“Very convenient”", "Author": "Mouwoohze", "ReviewID": "UR16680351", "Content": "It's sad that the old adage, \"You get what you paid for\" is true. The positives were: the rooms were nice; beds were comfy; breakfast was good. The location was also great for the Experience Music Project, Science Fiction Museum and the Space Needle ... we walked there even in the rain!!! A big negative is that the four times we talked to the reception staff about directions, checking in and routine traveling questions, all times they were completely uninterested. We felt that we were a burden to them when enjoying their day sitting down doing nothing. It would've required such little effort on their part to be polite and friendly by smiling, standing up and even coming to the counter instead of talking to me behind a wall. When I asked for my fax, they stayed in the office behind the wall, but I am pleased they gave me my fax instead of asking for me to come to them. I guess this is the service I should expect when a name was not on the \"Manager On Duty\" plaque. I would only recommend this hotel if they got rid of their current reception staff and replaced them with college students who took an ounce in their job.", "Date": "June 4, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Check in / front desk": "4", "Overall": "4.0", "Value": "4", "Rooms": "5", "Location": "3"}, "AuthorLocation": "Idaho", "Title": "“Great Place to Stay”", "Author": "Allie64", "ReviewID": "UR15071078", "Content": "This was a GREAT place to stay! It may be an older hotel, but it was extremely clean and comfortable...my bed was awesome, better than I've had at way more expensive hotels. Staff was very professional and courteous; I had booked a room with a single bed, he upgraded us to double beds for the same low price. Our room had all the smaller appliances, iron and board, coffee maker, blowdryer, etc., plus a microwave and a nice size refrigerator...convenient for longer stays. Sure the bathrooms could use a little updating but they were still clean and it is an older hotel so don't go expecting the newest version of the Ritz. Do expect to be comfortable and treated well...the free breakfast was more than I've seen in some places, the lady staffing that area was excellent, and it all added to the value of the hotel. Definitely would stay there again.", "Date": "April 16, 2008"}, {"Ratings": {"Service": "2", "Cleanliness": "2", "Business service (e.g., internet access)": "2", "Check in / front desk": "2", "Overall": "1.0", "Value": "2", "Rooms": "1", "Location": "4"}, "AuthorLocation": "Vancouver, BC", "Title": "“Clean sheets, but otherwise a fleabag motel”", "Author": "OffTheBeatenPath", "ReviewID": "UR13940477", "Content": "Staying in this hotel makes you feel like you're up in one of the fleabag, by-the-hour places up on Aurora in Seattle. Avoid it if you can. I, unfortunately, couldn't. I booked through Hotwire for the first time, trusting their website when it said that 2 star hotels were quality brand names like Best Western, La Quinta and Days Inn. All three chains have hotels in the same three blocks, so I assumed it'd be one of these or maybe the Holiday Inn Express. But no, the result was that I was locked into the Eighth Avenue Inn -- not a quality brand name or even a \"quality independent hotel,\" as Hotwire told me they carried in their response to my message requesting to be let out of the reservation due to false advertising. Okay, so, grudge against Hotwire aside. (But I do have to say -- book through Priceline -- I stay in Seattle / Bellevue every week and I've never had trouble with Priceline as they do carry brand names.) The good (I'm stretching to find it...): - The sheets appeared clean. - The towels appeared clean and relatively fluffy. - The shower had good water pressure and plenty of hot water. - Supposedly the hotel had free wi-fi (although I didn't want to sit on one of their chairs long enough to find out -- see below -- so I never tried it). - The tile grout in the shower couldn't mildew because there was no tile and no grout (they'd covered it with cheap plastic). - Parking was free. The bad: - Everything else in the hotel was torn, stained, beaten. Both chairs in my room had stains and rips. The carpet was waterstained and had other stains all over it. Basically I didn't want bare skin to touch anything in the room, so I was very careful to make sure it didn't. - The walls were really thin, so I could hear the TV and couple next door until 1 a.m., and the guy upstairs doing jumping jacks (or who knows what) at 5:50 a.m. - The elevator was upholstered all around with torn grey carpet, and hadn't been renovated since the 50s (and there were more modern elevators in the 50s). - The motel backs up on a 24-hour restaurant. There aren't many of these in Seattle, and so you can imagine who they attract at 4 a.m. and how likely they are to yell, scream and get in fights right outside your window. - I had to wear earplugs to sleep. Without earplugs I wouldn't have slept. The basics are clean, so the hotel has its place for those in their late teens / early twenties trying to save money (I've been there, somewhat recently, and can see it throught that lens). But for anyone else, just the appearance of the place will make you question your self-respect.", "Date": "February 29, 2008"}, {"Ratings": {"Cleanliness": "3", "Check in / front desk": "3", "Overall": "3.0", "Value": "3", "Rooms": "3", "Location": "2"}, "AuthorLocation": "Brisbane", "Title": "“Good Value For Money”", "Author": "Adventure2008", "ReviewID": "UR12427283", "Content": "We booked the Eight Ave Inn Hotel the day before we arrive in Seattle and wasn't expecting much. But it turned out to be a pretty good hotel/motel and also found it quite comfortable for the price we paid. We arrived 2hrs early and was still able to check in, the staff were nice, they were younge and helped with all our questions, like where the local bars were and the famous sights. The hotel is a small two story hotel, and is in a slightly shady part of town, but walking distance to the Space Needle and also Belltown. It is also easy to walk to the markets and the downtown shops, but would take you around 15mins. The room we were in was on the bottom floor and was fine. There were two double beds, the heater was working which was a change from other hotels I have stayed in, the shower was good - a little too much pressure but I was able to get clean! There was parking on sight for $8 which was ok I guess. The only problem I had were the shady people around the hotel at night and it sounded like someone was having some sort of buck party in the parking lot out the back, but they were no bother at all and just ignored us when we were walking home. I would stay here again if I went back to Seattle with no hesitations.", "Date": "January 8, 2008"}, {"Ratings": {"Service": "2", "Cleanliness": "2", "Business service (e.g., internet access)": "1", "Check in / front desk": "3", "Overall": "2.0", "Value": "2", "Rooms": "2", "Location": "4"}, "AuthorLocation": "Tacoma, Washington", "Title": "“totally cheap dive”", "Author": "firewalkwithmelissa", "ReviewID": "UR11612757", "Content": "Booked two rooms for ourselves and a couple of friends for a concert at key arena. Lobby is totally small and cheap looking. Staff looks like they are in high school. We got our key and took thier elevator to our room. Elevator jerked to a stop and was briefly stuck. I was freaked out. We went to tell the counter and they stated this was fairly normal. We got to our room and found it small, with the elevator connected to the room. We asked to be move and were put in a room that was twice the size. The other room literally had the elevator in it. The furniture was as cheap as it gets, filthy curtains and a pretty eighties feel to it. Dated, tasteless art. Old carpet with burns and ashes ground into it. The shower in the bathroom was tiny and had a door on it so small that a really heavy set person would be unable to get in. I swear it was a camper shower. No place to set soap or shampoo besides the floor. Our friends room had TV problems and was smaller than ours with a horrible view of the skanky parking lot they share with a bar. Pretty seedy people on the next block. Ice machines were out of ice, making it hard to make a drink in our room. Side staircase smells like hot urine and puke. The carpet is definately from the 70's and was a filthy huge print design coupled by dark woodgrain. We had to take pictures of it because it was so extraordinary. Had people knocking on our door in the middle of the night looking for the obvious drugged out hooker fest going on across the hall. Had to call front desk as party kept spilling into the hall. Thankfully we spent little time in our room. Would not recommend this hotel.", "Date": "December 16, 2007"}, {"Ratings": {"Service": "3", "Cleanliness": "1", "Check in / front desk": "3", "Overall": "1.0", "Value": "1", "Rooms": "1", "Location": "3"}, "AuthorLocation": "vancouver", "Title": "“Seedy”", "Author": "supermodel", "ReviewID": "UR11224378", "Content": "We booked based on an online ad. Though I shouldn't be too surprised given that it was the cheapest hotel in the Seattle area I was still pretty grossed out. It smells bad (combination of mold and urine) and you get the strong sense that they book rooms on the hourly basis as well. We checked in and then checked out again in about 3 minutes. There are quite a few decent and reasonably priced hotels in the area so it wasn't too much of a hassle. Next time I won't book the cheapest. You get what you pay for!", "Date": "December 3, 2007"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Check in / front desk": "4", "Overall": "3.0", "Value": "3", "Rooms": "2", "Location": "5"}, "AuthorLocation": "Portland, OR USA", "Title": "“Good Value in the heart of Seattle”", "Author": "Susan001", "ReviewID": "UR7835411", "Content": "My husband and I stayed here for two nights. The location can't be beat, its within walking distance to downtown AND the Seattle Center. We didn't use our car the entire time we were there. They charge $8 a day for parking which is reasonable. This is the least expensive hotel in the area. We did have a small problem...the walls are pretty thin...we could hear our neighbor's television and talking, which went on until past 1 am. They weren't loud, so we didn't complain to the front desk because there was nothing they could do anyway. Also, loud footsteps on the floor above us. So we turned on the air conditioning and that alliviated most of the noise. We slept okay...the beds were very comfy! We had a nice sized room, and it was clean, but very basic. Its an older hotel. The staff was very friendly (they even found an item we left in the room upon checkout and shipped it back to us), the continental breakfast was great, and free newspaper every day. All in all I would recommend this to anyone looking to save a few dollars, who don't expect a lot of extras and don't mind a little noise.", "Date": "June 11, 2007"}, {"Ratings": {"Overall": "1.0"}, "AuthorLocation": "Florida", "Title": "“Not a Happy Camper from Florida”", "Author": "TADick", "ReviewID": "UR7835260", "Content": "We stayed here 1 night in mid May of 2007. They told us we would have 2 queen beds on the first floor (ADA traveler)....we were told we'd have 2 rooms next to each other with our family members. After flying for the last 10 hours and getting here was not pleasant. Our ADA room was on the second floor and our family members weren't close by. The (OLD) room we got had 2 full size beds for 3 grown people! Then they said they had no roll away ,and we were tired. Finally they got one somehow from a nearby hotel at like 1:30 in the morning. We checked out about 1100 the next morning. About 4:00 that afternoon we realized we had left behind a shaving kit in our bathroom hanging on the door. I called right away, and the guy that answered the phone put me on hold. He came back on the line and assured me he had it. I asked him if he would mail it to our house as we needed some important items in there. He confirmed he had our address and it would be sent. Upon return home and several phone calls later, they now say they never did find it, and so sorry charlie.....between the condition of this hotel and their customer service, I'd look elsewhere to stay in Seattle.", "Date": "June 11, 2007"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Check in / front desk": "3", "Overall": "1.0", "Value": "2", "Rooms": "1", "Location": "3"}, "AuthorLocation": "Kennewick, WA", "Title": "“what a pit!”", "Author": "oldtravelerKennewick", "ReviewID": "UR7544124", "Content": "In 1st room the shower didn't work, nor would the tub drain. Moved up a floor to have a shower which blasted half it's volume out the back of the shower head onto the ceiling. Teenagers were partying in hall outside our door till past 1 AM. Fresh vomit on the sidewalk just outside the front entrance in the morning. We'd have enjoyed ourselves more if we'd just piled our money in the street, burned it and then slept in our car.", "Date": "May 4, 2007"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Check in / front desk": "3", "Overall": "3.0", "Value": "4", "Rooms": "2", "Location": "3"}, "AuthorLocation": "Eindhoven", "Title": "“little room for little price”", "Author": "q_ne", "ReviewID": "UR7407187", "Content": "we stayed here at the end of our roundtrip. Everything was small: the bed, the bathroom, the doors and the height of the room, but also the price. For one night stay okay, near to space needle and the monorail. Good complimentary breakfast too!", "Date": "April 21, 2007"}, {"Ratings": {"Service": "3", "Cleanliness": "1", "Business service (e.g., internet access)": "3", "Check in / front desk": "1", "Overall": "1.0", "Rooms": "1", "Location": "2"}, "AuthorLocation": "calgary", "Title": "“Would you like warm or cold water for your shower”", "Author": "pigasus", "ReviewID": "UR7238104", "Content": "Well to start we were to have a non-smoking room but it was far from that even with them vouching that it was a non-smoking it still stunk of smoke pretty bad. Shower water you had to run at least 45 minutes just to get water warm enough to get into. Told the front desk about it and she said that was strange because that only happens on the second level. Phone in room did not work so they replaced it with one with dial tone but it would not ring in room. No I would not reccomend this place unless you were homeless and it would be a small step up from that.", "Date": "March 28, 2007"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Check in / front desk": "3", "Overall": "3.0", "Value": "4", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Bethlehem,Pa", "Title": "“Good low-budget alternative”", "Author": "tohsdl54", "ReviewID": "UR6543065", "Content": "This is definitely a no-frills hotel, but if you're looking to save a few bucks on a long weekend in Seattle it's a very good choice. The room was reasonably clean, and had a nice small balcony to hang out on. A friend and I flew from the east coast to attend a Seahawks game, and although this hotel was a little out of the way it really worked for us. Though we admittedly aren't too picky after a few beers. Like i was saying, it's not right in the middle of downtown, but if you don't mind a little walk (took us about 10 minutes to the space needle, 35 to the stadium), and you just need a place to lay your head at night, this is a good choice.", "Date": "January 2, 2007"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Business service (e.g., internet access)": "3", "Check in / front desk": "3", "Overall": "3.0", "Value": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "NYC", "Title": "“way to stay for people on a budget”", "Author": "traveltourist", "ReviewID": "UR6482369", "Content": "A friend and I stayed at this hotel for 2 days. The hotel comes with free parking (ample parking at the front of the hotel the first night we were there, packed at the front, but ample parking at the back the second night) and free continental breakfast (muffins, bagels, toast, cereal, yogurt, tea/coffee). there's a charge to use the in-room safe, but we didn't. the biggest negative is very little light in the room. the little lamp between the 2 beds worked; so did the bathroom light (we kept leaving it on with the door open). the floor lamp didn't work, and there was no overhead light. both chairs in the room were badly stained. the carpet seemed fine. the beds were fine--clean linen and blankets. the bathroom was clean, but instead of individual bottles/bars of soap, they have refillable containers on the wall (like office building bathrooms). whatever soap they fill it with smelled -horrible-, and we couldn't wash our hands with it. my friend said there seemed to be some quarreling outside during the first night, but i didn't hear anything. the second night was quiet until someone tried to break down the door into our room screaming \"come out NOW!\". turned out to be a lovers' quarrel next door, and the guy just confused our door with theirs. very sorry :) i guess that could've happened anywhere.... overall, nothing fancy, really. this is definitely NOT a hotel you want to spend a lot of time in or chill and relax in your room. however, if you want to be walking distance to EVERYTHING in seattle while paying peanuts for the stay and just needing a place to put your head down for the night, this is the hotel for you. oh, the only other thing, they didn't have city maps.... well, they did, but they were IN JAPANESE!!! go figure.... they did direct us to LaQuinta hotel across the street for the maps. the clerk there didn't seem suprised at all and did give us a map.", "Date": "December 22, 2006"}, {"Ratings": {"Service": "3", "Cleanliness": "2", "Business service (e.g., internet access)": "3", "Check in / front desk": "4", "Overall": "3.0", "Value": "2", "Rooms": "2", "Location": "3"}, "AuthorLocation": "Murwillumbah, Australia", "Title": "“Adequate for the cost”", "Author": "miffles", "ReviewID": "UR5966016", "Content": "We arrived in Seattle on Friday 13th unaware that Bob Dylan and a few other noteable talents were in town. We had not prebooked any accom just thought we would rock in and have no problem finding a room at any inn in town. It wasnt so easy. After quite a few hours of unsuccessful hunting we began to feel like \"Mary\" and \"Joseph\"....though we held back on asking for the stable accommodation. Finally, at the Eight Ave Inn we were giving friendly advice and assistance by two young front desk lads. There were no vacancies on the 13th but they redirected us elsewhere for that night and then offered us a room for the following night at the discount coupon listed price. I was very impressed by the boys thoughtfulness,friendliness and general attitude. As for the Inn, well....... really,..... what u pay is what u get. It is more of a budget Inn. The carpets and beds are getting old and are in need of replacement. The bathroom was satisfactorily appointed,though we did have a problem getting our toilet to flush.I phoned front desk and within 5 minutes a lad arrived to rectify the problem. The blankets and sheets are needing renewing also, the sheets are thin and there were some holes in the blanket, I think another reviewer also mentioned that the bath towels are quite small. ..they are. Breakfast was adequate....cereals,breads/toast,cinnamon buns,and a few other pastry type things. We were last into breakfast so the fruit bowl was almost empty. Coffee, tea or hot chocolate were available as well as juice. There was a tv in the breakfast room and one of the young employees came in to check out the state of play of the football game between Seattle and St louis.I enjoyed observing his enthusiasm and appreciated his chat about the football game. All in all the Inn seems to be run by quite young people...the only person I noticed over the age of 30 was one of the female cleaners. The Inn's position in Seattle is quite good.Its only a short walk to the Space needle and environs. Even the Pike place Market isnt too far to walk to from here, though its slighlty up hill for the return walk. It isnt far from the place where u can access the free city bus service,though we didnt use it. We had no problem with the Inn's parking, our car remained right outside the front door the whole time we were there. I think next visit I would probably pay a little more for accommodataion with a better bed and bedding but position in town is aok.", "Date": "October 17, 2006"}, {"Ratings": {"Overall": "3.0"}, "AuthorLocation": "", "Title": "“Dont forget your umbrella”", "Author": "A TripAdvisor Member", "ReviewID": "UR5185245", "Content": "No greeting or smile on arrival. The check in agent just looked at us and said \"NAME\" Continental breakfast and newspaper provided. Coffee provided in room. An additional $5 charge per day to have safe in room whether it is used or not. Room spacious and clean although establishment a little old and tired. The sheets on the bed are very thin. Iron and ironing board in room. Bath towels small. Hairdryer provided. Toiletries included tissues shampoo conditioner body lotion shower cap and decent soap. Internet access provided free of charge. A short stroll into town. Airport shuttle dropped us off at the front door. Recommended for the price", "Date": "May 21, 2006"}, {"Ratings": {"Cleanliness": "2", "Overall": "2.0", "Value": "3", "Service": "2", "Rooms": "2"}, "AuthorLocation": "Stuart,FL", "Title": "“Beware, This is a filthy TRAVELODGE”", "Author": "Southeast12", "ReviewID": "UR5183888", "Content": "I booked this hotel last minute on the internet. The hotel location is OK. The location itself is not that great, right next to a car dealer and with suspicious people behind the building, but it is a 10 minute walk to the downtown center. Once I checked in, the first thing I noticed was a hotel worker arguing with a man who parked his SUV right infront of the lobby. The parking was very cramped and I could not find a parking spot in the front or the back without waiting a few minutes. I was greeted inside by an empty reception desk and a run-down lobby. Once I rang the bell, a young teen in white socks came out of a door behind the reception, where I could hear rock music. He did not know that much about the city, but he did offer us a travel brochure. Out room was on the 2nd floor, (it was the one with the large balcony in the front). Probably the best thing about the room was the large balcony, that had just a view on the road. The carpets were stained and the matresses were hard, but the bathroom looked pretty new. An average Travelodge I guess. But my worst impression came on my first night when I entered my floor. In the hallways, there were suspicious people looking at me and candy wrappers all around the floor. This was the case most nights. I will not stay here again, and I will make sure to book a better hotel like the Ramada or Warwick, ahead of time.", "Date": "May 20, 2006"}, {"Ratings": {"Cleanliness": "2", "Overall": "2.0", "Value": "2", "Service": "1", "Rooms": "1"}, "AuthorLocation": "Victoria, BC", "Title": "“Not staying here again”", "Author": "VicGirl123", "ReviewID": "UR4989984", "Content": "I spent one night at the Eighth Avenue Inn with my daughter. When we checked in, the hotel did not have the reservation and we had to wait about half an hour while they waited for Orbitz to fax the reservation details. We had made the reservation two weeks in advance. The person working at the front desk was not very friendly. We were told there were no non-smoking rooms available with two beds despite the fact that the people in front of us had been offered one (they chose smoking). I am very sensitive to cigarette smoke and asked the desk clerk if we could get a non-smoking room with a single bed and a roll-away cot. I was told the cot would be an extra $8. So, out of principle, I decided to take the smoking room instead of having to pay for the cot, which I thought was ridiculous. When we entered the room, it was like entering a very nasty smokey bar. To make things worse, we went downstairs later and overheard several guests being checked into non-smoking rooms with two beds. I don't know why we were told there were none of these rooms available. Perhaps it was because we booked the room at such a low rate. Even if I was a smoker I would have probably been disgusted. We open the windows as wide as we could and hoped for the best. Despite the occasional squealing tires and sound of bottles being broken in the parking lot behind the hotel, we kept the windows open all night. It helped a little. Other than the smoke drenched furniture and drapes, the room was relatively clean. The sheets smelled like bleach and the bathroom appeared to be clean. There was also a nice little fridge and microwave in the room. I would not have minded the room so much if it did not reek of smoke. It was also walking distance to the Space Needle, Experience Music Project, etc.", "Date": "April 19, 2006"}, {"Ratings": {"Cleanliness": "3", "Overall": "3.0", "Value": "3", "Service": "2", "Rooms": "3"}, "AuthorLocation": "Middlebury, VT", "Title": "“Average”", "Author": "erinb83", "ReviewID": "UR4973432", "Content": "It was fine for what we paid for. The shower had a lot of calcium build-up, which was kind of gross, but not a huge deal. Room was small, but the bed was comfortable. No view at all unless you like parking lots. About a 10- to 15-minute walk to the major downtown area, and really close to the Space Needle.", "Date": "April 14, 2006"}, {"Ratings": {"Overall": "2.0"}, "AuthorLocation": "Portland, OR", "Title": "“Substandard. You can do much better.”", "Author": "A TripAdvisor Member", "ReviewID": "UR4014263", "Content": "I chose to spend my Columbus Day weekend in Seattle, only about a 3.5 hour drive from the Portland area, where I reside. I have personally never been to a Travelodge and after my visit there to the City Center Travelodge in Seattle for three nights, I won't be going to another one and I highly advise that you don't either. Why you ask? Aside from looking ratty and dingy, the service was horrid and the bed, dreadful. Let me explain. One afternoon, after arriving in the room, we found our beds made but our bathroom completely void of towels. So I politely call the front desk and ask them to deliver towels to my room and they said they would do so. A half-hour later still no towels, I call again, and ask for towels and they said they would bring them up. Over an hour later, there are no towels and I finally go down to the desk myself and demand the towels. I've just adduced a good example of how nonexistent the service was at Travelodge. Let's move on to the bed. This won't take long to describe. Just imagine sleepping on a mattress but with next to no cushioing or padding, just the metal springs. That's what it felt like. If I wasn't so damn worn out after sightseeing, I would have had serious problems sleeping on it but I survived. I think I've adequately stated my case here and if you consider yourself an intelligent and prudent traveler, you will not go to the Travelodge at City Center in Seattle and if you must, pay a nominal amount more to stay at a hopefully newer hotel/motel with better service and a real bed. I have more to say but you get the idea.", "Date": "October 11, 2005"}, {"Ratings": {"Cleanliness": "2", "Overall": "2.0", "Value": "4", "Service": "3", "Rooms": "2"}, "AuthorLocation": "San Francisco", "Title": "“stay for the LOCATION”", "Author": "A TripAdvisor Member", "ReviewID": "UR3806031", "Content": "Stayed there for two nights, Sun & Mon on the second week of June 2005. Our room was a non-smoking, and didn't smell funny. but the shower/bathroom space is quite cramp. mildew is visible. some stains on carpet. smell of cigarette smoke in elevator. free breakfast at 6am: package muffins, bagles, juice from fountain. One of their staffs didn't know what toiletries are in stock, she replied that they never supplied shower caps when we asked for another one on the second night, one was offered when we arrived the first night. Overall: liked the location for average price/nite $85. 3-4 blocks from attractions. Near free-ride area, we picked this place because we didn't drive. No problem returning late at night, area is quiet, few pedestrians, encountered only a few wanderers/homeless folks near downtown/free-ride area which is 4 blocks away from hotel, but most metro area have same problem with homeless, not a big deal.", "Date": "August 25, 2005"}, {"Ratings": {"Overall": "3.0"}, "AuthorLocation": "Manchester, England", "Title": "“Good, Bad and Ugly ....”", "Author": "midnightbay", "ReviewID": "UR3625667", "Content": "This hotel is pretty average. The best thing that can be said of it is its location. Downtown's a very walkable distance away and the hotel is also a good distance from the two big downtown sports arenas. The building itself is very rundown and could do with a facelift. The breakfast was also a little bit disappointing. However, the staff were very friendly and did their best to help-out whenever they could, which counts for a lot.", "Date": "July 1, 2005"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Reading, Pennsylvania", "Title": "“Repeat visit...not as good as last but still best value in Seattle”", "Author": "Hello_It's_Me_21", "ReviewID": "UR3424086", "Content": "I go to Seattle about 3 times a year on business and this is where I'll stay (until I can afford a more fancy place, that is). It's the best value I've found in Seattle. Short walk to the convention center or the free bus to Pike Place Market. (about 1/2 mile). When I checked in this time the desk clerk was a bit surly. She was brusk and cold. I didn't get a room on the side I wanted (back) and her reply to my question to whether I could switch the following night was again, cold and bordering on impolite. I was concerned about noise level being on the ground floor in front--but it was quiet all 3 nights. I never saw this clerk again but the morning guy is great. Nice and personable. I remember him from before. Again, continental breakfast was lame but for the cost of the room, you can afford a nice meal at Lowell's (Pike Place Market--it's the best) and still come out ahead. I'm booked here again for my next trip.", "Date": "April 29, 2005"}, {"Ratings": {"Overall": "3.0"}, "AuthorLocation": "Pasco,wa", "Title": "“Weekend Stay”", "Author": "A TripAdvisor Member", "ReviewID": "UR2112264", "Content": "We spent a weekend at the City Center Travelodge and the staff was very helpful and courtious. The hotel is old but very well kept. At least everything in the room worked. The Continental breakfast wasn't much but what can you expect for nothing. We enjoyed our weekend at the Travelodge.", "Date": "May 23, 2004"}, {"Ratings": {"Overall": "1.0"}, "AuthorLocation": "Sturgis, MI", "Title": "“Run down and dirty”", "Author": "A TripAdvisor Member", "ReviewID": "UR1377952", "Content": "is a good description of my room. Their were two chairs with upholstry in the room and both were so stained and filthy looking I wouldn't sit on them. It appeared as if the entire hotel could use a good cleaning. I have to say the staff was pleasant and helpful. The hotel is close to free downtown public transportation but it doesn't outweigh it's faults. I would not stay here again even if I got a great bargain. If your on a budget, don't sweat it. Stay out at SEATAC(by the airport) or Tukwila for half the price and take the METRO bus in. Don't rent a car, parking is super expensive and the city bus is has a large free ride area and the bus will get you closer than you could possibly park.", "Date": "October 7, 2003"}, {"Ratings": {"Overall": "1.0"}, "AuthorLocation": "Vancouver Island, Canada", "Title": "“Just awful!”", "Author": "A TripAdvisor Member", "ReviewID": "UR1377307", "Content": "This place is just awful - it smelled, the whole building is old and rundown, and the \"Free breakfast\" was prepackaged Danish or muffins & coffee if you got them by 7am. The bathroom was small, old and ugly, and the shower was a trickle. THankfully we spent almost all our time out of the room and were exhausted enough to sleep. We had to buy room freshener because it smelled so bad. For the same budget, stay at the Ramada - a much nicer facility, which we will return to before ever doing the Travelodge again.", "Date": "October 6, 2003"}, {"Ratings": {"Overall": "1.0"}, "AuthorLocation": "Folsom, California", "Title": "“Total Dump!”", "Author": "A TripAdvisor Member", "ReviewID": "UR1237858", "Content": "I was very unhappy with this Travelodge. It was semi-clean and very beat up. Broken toilet, broken facet, baseboards and bottom of doors chipped and just beat the heck up.Pillows were flat - only two on the double bed provided. The blanket was dirty, had someone else's hair on it.The porch was dirty and the plastic chair on the porch was broken.This was a 1960's hotel that has not been remodeled. The carpet seemed to be semi-new, but everything else, furniture, beds seemed to be very old and worn and beat up.I'd never go back. The only reason to stay there is that it's a Quick Shuttle stop.", "Date": "August 20, 2003"}], "HotelInfo": {"Name": "Eighth Avenue Inn", "HotelURL": "/ShowUserReviews-g60878-d112434-Reviews-Eighth_Avenue_Inn-Seattle_Washington.html", "Price": "$76 - $106*", "Address": "<address class=\"addressReset\"> <span rel=\"v:address\"> <span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">2213 8th Avenue</span>, <span class=\"locality\"><span property=\"v:locality\">Seattle</span>, <span property=\"v:region\">WA</span> <span property=\"v:postal-code\">98121</span></span> </span> </span> </address>", "HotelID": "2515371", "ImgURL": "http://media-cdn.tripadvisor.com/media/ProviderThumbnails/dirs/17/69/17698e63543c750a84ac01e6d6a8da9b1large.jpg"}}