{"Reviews": [{"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "3", "Location": "3"}, "AuthorLocation": "seattle", "Title": "“Historic property in a city without many of its kind”", "Author": "dickanddoug", "ReviewID": "UR127305367", "Content": "I agree with Nvizble, and will not repeat. Went there with my wife for anniversary weekend because I wanted to try it. The rooms are listed as 500 sq ft on Expedia, but live a lot smaller. Lots of wasted space in bath and in room, with only one easy chair and one small desk/desk chair. No love seat or coffee table, not a good layout for hanging out in the room reading paper, drinking coffee, facing one another. Service was very good, the bed was great, we enjoyed both the historic bar and restaurant Juno on 1st floor. Free newspapers including Sunday in the bar/lobby. While the location is well south of downtown and Pike Place Market, still very walkable, and equidistant to International District and Pioneer Sq., ferries, stadiums. Suggestion for breakfast - go out walking about four short blocks to Grand Central Bakery in Pioneer Sq on 1st Ave for outstanding fresh croissants with jam and/or pecan sticky buns. Open early, even on Sun. Eat there or bring back to enjoy w French press coffee in your room. The minibar fridge in room has enough space for leftovers from your dinner out, another nice amenity. Room also has DVD player. Bring your Netflix envelopes if you think you'd fancy a night in. Enjoyed our stay.", "Date": "April 5, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Ballwin, Missouri", "Title": "“Great Find -”", "Author": "Donna M", "ReviewID": "UR127074829", "Content": "fantastic accommodations, reasonably priced, large rooms, great bed and bathroom...comfortable lobby", "Date": "April 1, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "3", "Sleep Quality": "3", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Ft Lauderdale, FL", "Title": "“Swanky and old school with a lot of class”", "Author": "Nvizble", "ReviewID": "UR126828555", "Content": "The only drawback to this location is that it is in the Financial district, and not in the \"action\" of downtown/shopping. Rooms were small but comfy and the service was perfect. The on site bar was lively and active (I had an absinthe there!) and the on site restaurant was very good. Loved the French press coffee in room. Short walk to most places.", "Date": "March 28, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Big Sky, Montana", "Title": "“One of the coolest hotels around...”", "Author": "BigSkyEditor", "ReviewID": "UR126768973", "Content": "Unbelievable charming remodeled historic hotel in the heart of downtown. Feels like you are stepping back in time to the early 20th century, yet the hotels has all the modern conveniences of today (hard to even tell is part of the Hilton chain). Accommodating staff, comfortable rooms (some may think they are a little on the small side compared to chain hotels but they are plenty big enough). Nice upscale bar (Polar Bar) in back of lobby the serves small bites, and just about any drink you can imagine. June restaurant is attached to hotel, did not eat there but looked amazing. Great downtown location, can walk to just about anywhere. Would be great hotel for romantic getaway, special occasion, etc. When you have a choice to stay at someplace like this among all of the other cookie cutter chains, why not? Will definitely be back to this place!", "Date": "March 27, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Chapel Hill, NC", "Title": "“Exceptional”", "Author": "FrauReisende", "ReviewID": "UR126748321", "Content": "While offering all the modern amenities you expect from a Doubletree, this hotel leapfrogs over the sterile, bland sameness of most modern hotels, and gives you a glimpse of grand era in travel. The rooms are lovely. It you want the biggest, blandest, coldest, most ultra-modern room decor, don't go here. But if you want charm and elegance, this is a great place. But I mostly wanted to write a review because the service was so truly exceptional. I was in the room while my room was being made up and watched the care with which the bed was being made. Every staff person we encountered was just the right combination of accommodating, competent, professional and just plain nice. This place obviously has a great manager.", "Date": "March 27, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Los Angeles, California", "Title": "“\"The Perfect Place to Stay in Seattle\"”", "Author": "Joepure", "ReviewID": "UR126740509", "Content": "The Arctic Club Seattle - operated by the Hilton/Doubletree management is by far, the most interesting and enjoyable place I have stayed in downtown Seattle in many years. The former \"explorer's\" club, located on 3rd Ave in Pioneer Square is a real gem among the modern cookie-cutter hotels found in large cities. The 100 year old building has been completely renovated to a contemporary interpretation of its 19th century origins. Tall ceilings and windows, dark woods, large rooms and phenomenal bathrooms make the time spent at the property almost as fun as exploring the city. The service staff are all friendly and very helpful - to the point as if you were a member of the \"club\" rather than just another guest in a room. I can't imagine staying at another hotel when in Seattle! PS: My only small complaint is that the very efficient air/heating system in my room was a bit obtrusive - not to the point of bothering me but it is noticeable.", "Date": "March 27, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "San Juan Capistrano, California", "Title": "“Favorite Seattle hotel”", "Author": "CaTraveler7777", "ReviewID": "UR126709108", "Content": "This is one unusual place, festooned with carvings of walrus heads around the building and walrus heads above the room numbers beside the doors. They have successfully updated the 100-year old hotel and it is now in the Doubletree/Hilton chain, but the most unusual of them all, would be my guess. It's got a great lobby bar that was apparently stolen in the middle of the night by the drunken Klondike millionaires who formed the club in another hotel and were asked to vacate the premises. The rooms are very big and decorated in a modern version of that period. It's quiet, the beds are first-rate, it's within walking distance of both the ballparks and the downtown places like Pike Place Market. It's so nice to be in a hotel with some personality and there's nothing like this place anywhere.", "Date": "March 26, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Houston, Texas", "Title": "“Anniversary treat”", "Author": "inlove56003", "ReviewID": "UR126412029", "Content": "This hotel took us into a world forgotten by modernity. We loved all of the decor, comforts, high class surroundings of this place. We celebrated our 38th anniversary here, and would do it all over again.", "Date": "March 20, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "3", "Sleep Quality": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "London, England", "Title": "“Not your average business hotel......”", "Author": "BinThereAteThat", "ReviewID": "UR126182374", "Content": "The Arctic Club is a quirky ex-gentlemans club which is now a Hilton/Doubletree property. Wonderful charm to the common areas, great bar (and barman - Hi Viktor), great staff, good location - no real minus points for the business traveller who is looking for something a little different from the usual chain experience. Visited 5 or 6 times now - consistently comfy and no complaints. Wouldn't go there with kids - would feel out of place and the access has steep stairs which could be difficult for little ones. Otherwise - 2 enthusiastic thumbs up.", "Date": "March 16, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Location": "4", "Rooms": "5"}, "AuthorLocation": "", "Title": "“A welcome departure from usual corporate hotel”", "Author": "section", "ReviewID": "UR126121801", "Content": "As many have said, the decor is charming and rustic. I really liked the wood beamed ceilings versus the de facto white spackle. Due to the steep hill, the main entrance is up several steps but there is an accessible entrance around the corner with an elevator to the lobby floor. It's an excellent location and the presence of the valets and doormen deter the usual Pioneer Square junkies from lingering at the doorway. The staff was helpful and friendly and available at all hours. Would definitely stay again.", "Date": "March 15, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Long Beach, California", "Title": "“Seattle Adventure”", "Author": "Ronald M", "ReviewID": "UR126121800", "Content": "A lot of history and great service. Excellent lounge and a lot of character. Right next to City Hall and in front of the Columbia building. Exit Pioneer Square station if you take the train from SeaTac. Only negative is walk a block south and the area gets quite shady.", "Date": "March 15, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Houston, TX", "Title": "“Interesting property/ good location”", "Author": "michael77092", "ReviewID": "UR125966827", "Content": "Just left The Arctic Club after a weekend stay. I am giving this hotel a \"very good\" rating. The hotel has a great masculine vibe from the lobby all the way up to the rooms. The property is in a good location within walking distance to the Pike Place Market, the Seattle Art Museum, and good restaurants and shops. I found all of the hotel staff to be very friendly and accommodating. As a Hilton Honors Diamond member I received free internet, but even if I were paying out of pocket, internet was only $9.95/ day. Also received a $12/ day breakfast allowance which made for a nice breakfast each morning. The hotel bed was also very comfortable. The onsite restaurant, Juno, is not bad, but is also nothing super special. I would say it is standard hotel food; no better, no worse. The front desk staff and the all of the gentlemen at the concierge desk were very helpful. I was super impressed with just how genuine everyone seemed. It was evident to me that this property really stresses customer service with their staff. For anyone concerned about hotel security, this is the place to stay. Anything above the 3rd floor requires a hotel key for entry 24/7. Staff is always present and would immediately recognize anything out of the ordinary. Lastly, as a word of caution, the hotel is on a bit of an incline, so walking to and from in the area is taxing for someone not accustomed to walking much. That is not just true of the hotel, but of basically anything above 2nd Avenue downtown. I enjoyed my weekend in Seattle and this hotel played a big part in making the weekend so fun...", "Date": "March 12, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Bozeman, Montana", "Title": "“Excellent!”", "Author": "dcape", "ReviewID": "UR125895202", "Content": "Ultra cool hotel with a great staff and superb barkeeper! A bucket list hotel for sure!", "Date": "March 10, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Sydney, Australia", "Title": "“Very Enjoyable”", "Author": "Andypf", "ReviewID": "UR125875593", "Content": "Friendly staff at check in (with their delicious cookies), great location - just a short walk away from the markets, shops and cafes and right near a light rail station. Hotel overall felt very polished; the room was excellent: well appointed, relatively spacious and clean. Room service was prompt and helpful. All up, very enjoyable stay and good value.", "Date": "March 10, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "4", "Rooms": "5", "Location": "3"}, "AuthorLocation": "Philadelphia, Pennsylvania", "Title": "“A wonderful and classy place to stay.”", "Author": "Mike H", "ReviewID": "UR125806009", "Content": "I was in Seattle late February on business and needed to stay in the city. I picked the Artic Club in a somewhat random fashion and was glad I did. It's a really neat, classy hotel and definitely worth the money. The hotel was an old Gentelmen's Club (not that kind) that was later taken over by the City due to unpaid taxes. Purchased and rennovated in 2006 it really is a fun and charming place to stay. The lobby bar alone is worth the trip and the hotel staff is really friendly and pleasant. If you stay there, take a peek at the 2nd floor ballroom. The stainglass dome is worth the effort.", "Date": "March 8, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Perth, Australia", "Title": "“Good value hotel”", "Author": "westozscot", "ReviewID": "UR125724384", "Content": "We stayed for three nights and found this to be a good value, well located hotel. Room was comfortable, and service friendly. Lovely \"Club\" style bar & lounge which is good for a nightcap. Bus is just outside the door, and there is a good selection of restaurants and bars just down the street. Only downside was difficulty in getting a taxi one morning. The front desk had booked one for us and called again after 15 mins, but none appeared so we ended up just catching a bus! Staff mentioned that many taxi drivers don't know the hotel.", "Date": "March 6, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Dublin, Ireland", "Title": "“Great hotel in a very central location”", "Author": "roadtravelled09", "ReviewID": "UR125227963", "Content": "We stayed at this hotel for 2 nights and we really enjoyed our stay. The hotel is situated in a very central location to explore Seattle by foot or public transport. The hotel is beautifully decorated both inside and outside. The room was very spacious as was the bathroom and it had everything we needed during our stay. All the staff were all very helpful and the cookie on arrival is a very nice touch.The bar is a very relaxing place to chill out after a busy day in Seattle.", "Date": "February 26, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Philadelphia", "Title": "“Great staff great hotel”", "Author": "James M", "ReviewID": "UR125003475", "Content": "Excellent location. Hanging out at the bar is like stepping back in time. All of the front desk staff are really helpful and take the time to address any of your concerns. You will find Viktor and Zenee at the bar and they are the best in the city. You won't be dissappointed staying here.", "Date": "February 21, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Lancaster, Pennsylvania", "Title": "“Excellent Bar Staff”", "Author": "John Z", "ReviewID": "UR125001925", "Content": "The Polar Bar staff is the best in the country. Viktor and Zenee are the most knowledgeable bar tenders I have ever met, and make the best drinks. I look forward to seeing them everytime I come to Seattle.", "Date": "February 21, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Chicago, Illinois", "Title": "“Wonderful hotel with great character!”", "Author": "GDP33", "ReviewID": "UR125001451", "Content": "Although this hotel is in the Double Tree chain it feels like an independent boutique hotel. The whole hotel oozes character: the sense of staying at an old world gentlemen's club is invoked with wood paneling, old prints and photographs on the wall and bespoke furniture in the bedrooms. The rooms are well proportioned and whoever designed the bathrooms did a fantastic job. This hotel has a sense of place and history. It is not too hard to imagine that logger barons or those who made it big in the gold rush of yore came to stay in a place like this on trips to Seattle. There is Wifi throughout the hotel. The staff is exceptionally friendly and helpful. The location is walking distance from all the main tourist attractions in downtown Seattle and equally convenient for business. A short cab ride will take you to the hip restaurants and nightlife of the Cap Hill area. The gym has two treadmills, an elliptical trainer and a strength training machine. I had a great stay and will be back.", "Date": "February 21, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "3", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Bainbridge Island WA", "Title": "“Classy place, top notch staff and an interesting choice in Seattle”", "Author": "Kat&John", "ReviewID": "UR124181914", "Content": "Booked this hotel to celebrate my special lady friend's birthday. Front desk staff got things off to a great start by being friendly and attentive. (I wish I could remember her name, but she worked the afternoon of January 27) We chatted about the history of the hotel and when I mentioned it was my wife's birthday, she offered a few things that really made the stay special -without me even asking! This is an historic property with a real old hotel feel but none of the downside of an old hotel. The place was immaculately clean, dust free, warm, clean and stately. The decor was very stylish but also very comfortable. We had a room on the top floor with a sort of balcony that was on the roof with a great view of the city. The bed/linens were extremely comfortable and this place must be built for the zombie apocalypse since we heard no noises (other than some street noise.) The in-room amenities included a full set up to make french press coffee and a minibar. The bath had gorgeous tile. For some reason, they associate the DoubleTree brand with this property, which might not be the best idea, because of the unevenness of other DoubleTree hotels; I'd just leave that part out. This is an unusual hotel that makes you feel like you are living in the 30's. I felt like I might run into Nucky Thompson in the Polar Bar, which was also a great place to hang out. If you are flying in, bear in mind that this is directly across the street from the Pioneer Square Station of the Seattle light rail, so for just $2.50 you ride from the airport to the hotel. The neighborhood has some good restaurants and is close to Pioneer square.", "Date": "February 6, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Portland, OR", "Title": "“Staff Training must be Best in Business”", "Author": "RogerDave", "ReviewID": "UR123997682", "Content": "Hyper-attentive service in-house; get directions from desk, valets seem from out of state. Entry on Third (where GPS sent us) problematic; use elevator phone to contact desk or enter at Cherry. Happy Hour ends earlier in Polar Bar than Juno but drinks are better. Rebate for not taking USA Today. Easy public transport, connects to SeaTac. NOTE: the cool ambiance makes up for easily disernable street noise, HOWEVER there is a building site to the south. Avoid this property when construction begins: it will be too noisy. Foam pillows are available; trust the staff's willingness to accomodate you, tell 'em what you need if they haven't already anticipated it. Take in a meal & a show at Jazz Alley: free parking there.", "Date": "February 2, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Sea Cliff, New York", "Title": "“Elegant hotel in a central location”", "Author": "Joan E", "ReviewID": "UR123932665", "Content": "After struggling to narrow down the many choices of hotels in Seattle, I chose the Artic Club. I was not disappointed. The lobby and room were both styled as one would expect from a 100 year old hotel. A fireplace in the lobby with wooden accents, detailed molding in the room and a beautifully decorated bathrom contributed to an old world feel. Service was great and of course the warm Doubletree cookie upon arrival is a wonderful bonus. The hotel was a block from the Metropolitan Grill and about 1/2 mile from Pike's Market in one direction and less than that to the Amtrak Station in the other.", "Date": "January 31, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Santa Ana", "Title": "“Great Find!”", "Author": "Julie H", "ReviewID": "UR123922507", "Content": "Charming hotel convenient locale approx 10 blocks from Pike Place Mkt; nicely upgraded rooms, friendly staff. Very good value! Would go back again.", "Date": "January 31, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Palo Alto, CA", "Title": "“Awesome experience at a historic Seattle hotel.”", "Author": "Luka302", "ReviewID": "UR123628350", "Content": "The Artic Club is a Seattle landmark. The Doubletree has incorporated this history with its usual high quality service and hospitality. The setting is great in downtown, yet the intimacy of this property makes it a great place to stay.", "Date": "January 26, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Bishop, California", "Title": "“Wonderful!”", "Author": "like2try", "ReviewID": "UR123567628", "Content": "We stayed here for four night on vacation. The hotel is beautiful, and the service is great. Yes, the rooms are a little small, but I love historical buildings and I love what they have done to preserve this amazing building. The Polar Bar was awesome, and the lounge is beautiful. Juno the restaurant in the hotel was pretty good as well, especially for breakfast. The bar menu is very good. We will definitely go back. The only problem we had was the heater in our room was quite noisy. We didn't say anything because we didn't want to change rooms. I'm sure if we would have we would have been accomadated.", "Date": "January 24, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Surrey, Canada", "Title": "“Can't wait to go back!”", "Author": "sara p", "ReviewID": "UR123265342", "Content": "Stayed at the arctic club while in town for dinner with 3 couples. Paid $135 online per room. Valet parking was expensive but no options. This hotel impressed from the first step in the door. Great staff with stories of the history of the hotel, warm cookies at check in, lovely rooms, great lounge with a huge fireplace and strong drinks! Had a perfect breakfast downstairs at Luna and headed home. I strongly recommend this hotel and will definately stay there when in Seattle!", "Date": "January 18, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Ottawa,IL", "Title": "“\"Hidden Secret in Seattle\"”", "Author": "frasier10", "ReviewID": "UR123224987", "Content": "A beautiful hotel in downtown Seattle. Reasonable. $ Large rooms with historic architecture and modern amenities. Walk back in time in the former Men's club lobby and receive a warm cookie. Have a drink by the fireplace in the bar or play a game of billiards. Loved the ambiance of the entire hotel; staff, the grandeur of the dome room where my daughter was married and the 10th floor balcony rooms! We walked to Pikes Market & downtown shops. The only concern was the valet parking. While I new it was $32/day, I was not told about all the taxes adding another $9/day to the cost. Plenty of other secure parking nearby during the week, just not secure on weekends.", "Date": "January 17, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Location": "4", "Rooms": "4"}, "AuthorLocation": "Montesano, Washington", "Title": "“Warm romantic winter retreat”", "Author": "tiggerboo89", "ReviewID": "UR123134937", "Content": "We were there for new years and our honeymoon. Warm Friendly staff greeted us every time we were in the lobby. fireplace and bar in lobby, gym and restaurant.. room was quiet and private. Short walking distance to pike place market and shopping. not a fan of the valet parking fee. And that is the only parking available. but would stay again", "Date": "January 15, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "3", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Austin.TX", "Title": "“Lovely details, comfy room, great location”", "Author": "Gemutlichkeit", "ReviewID": "UR123064303", "Content": "Stayed here for 2 nights recently and the staff could not have been more friendly or accommodating. The location is great - close to transit stops, but I simply walked everywhere. I had only one meal there --- some late-night room service, and I even Facebooked to my friends how innovative and tasty that one silly snack was! Highly recommended. I can't speak to any of the other amenities of the hotel (fitness room, restaurant, bar, etc). What I particularly enjoyed was the care with which they restored the hotel. I loved the architecture of the building itself, but the care of the re-design and the details -- really great. Lovely colors. Modern but appropriately retro features, including reproduction doors and inspired lighting features. I found the elevator number panel particularly amusing, though I'm not entirely sure it was intended to sound like a submarine. I had only 2 problems while I was there. One, I had requested a corner room (which allowed for great light, but also increased street noise - be prepared if you are sensitive to this). This gave me lovely partial views of Rainier and the Sound, but also let me overlook a construction site. I asked for a room change to a better view, but they were not able to provide one with similar features. Seeing the placement of the hotel in daylight, I could see why - because it is a historic hotel, it is moderately dwarfed by its neighbors, which means no one has a tremendous view; and the hotel is blocked by other properties. But that's really just fine - I was there for sleeping and working, and you can enjoy all the fantastic views of Seattle by getting out. My other problem was a clogged sink, and I only reported it upon checkout. I do believe someone had jammed the sink with tobacco, because there was an odor of tobacco whenever I ran water. Again, as soon as I reported the problem upon checkout, the concierge was calling maintenance in to unclog the sink. Highly recommended - would definitely stay here again!", "Date": "January 14, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "3"}, "AuthorLocation": "Everett, Washington", "Title": "“Beautiful and Clean Room”", "Author": "LovellFord", "ReviewID": "UR123045510", "Content": "The staff was great, the room was clean and beautifully restored; we will stay there again.", "Date": "January 13, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Colorado Springs, Colorado", "Title": "“Love this hotel!”", "Author": "kozamel", "ReviewID": "UR122899567", "Content": "Stayed here at least once a month between Feb and June 2011. GREAT Hotel! Super friendly staff - they remembered me after the 2nd visit and always put me in a corner room. The lobby bar is wonderful, low key, quiet and classy. Everyone I encountered was helpful and friendly. I really enjoyed the history of the place. Be prepared, the bathrooms are kind of dark - but very well appointed. French press in-room coffee was an appreciated touch. Wish work would bring me back to Seattle again!", "Date": "January 10, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "SoCal", "Title": "“Wonderful stay at the Artic Club”", "Author": "Catravel0r", "ReviewID": "UR122638943", "Content": "We found the customer service during our Dec 2011 vacation at the Artic Club to be top notch. They were very accomodating about our needs and the front desk set us up in the same room when we returned from an overnight in Vancouver since we loved the room. The Artic northern light dome room is breathtaking with stained lights and carved wood shaped into a dome .....the room was being set up for a wedding and it was a sight to see. Great old bones to this hotel with charm, clean and outstanding food in hotel restaurant and room service. We will stay here again, do not be concerned with booking at this hotel!", "Date": "January 6, 2012"}, {"Ratings": {"Cleanliness": "4", "Overall": "4.0", "Rooms": "4", "Service": "4"}, "AuthorLocation": "Bellevue, WA", "Title": "“Perfect Gentelmen's Club”", "Author": "LillyPBellevue_WA", "ReviewID": "UR122636551", "Content": "If the Art of Shaving designed a hotel I imagine this is what it would be like. Loved the decor and cozy feel to the place. Had corner room on top floor (10th) with a balcony. Seating area with club chairs and couch as well as a desk. Breakfast at restaurant also tasty. Only complaint was that the wine by the glass selection was middling at best. Then again, in this setting with the prints of notable Seattlites from the 1920s and pool table adorning the lobby, it may have been a better call to have gone with the martini. Easy walk to most attractions or quick bus ride to places like Space Needle. More of a business hotel than a place to go for a romantic getaway but lots of character. Staff was also very friendly.", "Date": "January 5, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "3.0", "Value": "4", "Sleep Quality": "2", "Rooms": "1", "Location": "3"}, "AuthorLocation": "San Francisco", "Title": "“Nothing to be excited about”", "Author": "fuego2u", "ReviewID": "UR122504743", "Content": "The service was good. The cookie they gave me was tasty. The place was... rustic. I understand that was their theme, but my toilet was broken when I came into the room and the dresser is an old school awkward design that I did not enjoy using. I had to open three sets of doors to get my underwear in the morning... The flat screen tv was nice, but kind of awkwardly situated. The lobby downstairs however is pretty cool. They have a nice rustic themed bar and a pool table for use, which is pretty nice. The staff was super nice and friendly, and the hotel is situated right above the underground bus which can take you to the main shopping area two stops away. The street traffic is pretty loud, but the noise of the vents to heat the room was even louder. I did not really mind either of these as I am a heavy sleeper as it is. There was no view from the room which I was not too happy about, but other than all of these things my stay was adequate. I wouldn't mind coming back, but I am not pining for it.", "Date": "January 4, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Modesto, California", "Title": "“A grand historic hotel with wonderful rooms.”", "Author": "RDHOnTheGo", "ReviewID": "UR122106654", "Content": "My expectations are rarely exceeded, but when I arrived at the Arctic Club they were. Friends and I arrived by train and the hotel was a short cab ride from the Amtrak station (if the weather were nice we would have walked). As we pulled up to the entrance in our cab we were met by the doorman and a bellman and escorted to the front desk. Check-in was fast and friendly and we each got a Doubletree signature chocolate chip cookie (which I greatly enjoy). Our rooms were amazing! The decor is based on the historic gentleman's club nature of the hotel with countless touches including old photos. Our rooms had every convenience and the furniture was very comfortable. Like all Doubletree Hotels this one had a wonderful bed with many pillows and I had an excellent night's sleep. We had a nightcap in the lobby bar, which has wonderful 1920's decor and an expert and friendly bartender. Unfortunately, we had to check out early to catch our train, so did not try the restaurant which looked inviting. Check-out was very efficient and, again, very friendly. The bellman even showed us the grand third floor function room with elegant decor including a glass ceiling. I can't imagine staying anywhere else in Seattle! In fact, I have a reservation to return on January 13, and this time will stay long enough to really enjoy the hotel.", "Date": "December 26, 2011"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "DC", "Title": "“Lovely, Original Hotel”", "Author": "WorldTraveller27", "ReviewID": "UR122010465", "Content": "I can't stop gushing about this hotel! Not only is the property first rate but the service was excellent as well. The historic Beaux Arts building has been meticulously restored and renovated (think Restoration Hardware all the way). The rooms evoke the era of when travel was exotic and luxurious! The \"steamer trunk\" dresser and other details are wonderful. Rooms and bathrooms are spacious; the desk has ample workspace and is stocked with the basic office supplies. The manager called the room a few minutes after I had checked in to confirm that everything was to my liking. The only negative is the small, slow elevator (it looks like it is historic) and the charge for wireless access (waived for elite HiltonHonors members). Can't wait to return to Seattle and the Arctic Club!", "Date": "December 22, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Victoria bc", "Title": "“A great boutique hotel”", "Author": "daggern", "ReviewID": "UR121962201", "Content": "We had a great stay here. We were on a short break from victoria and we have stayed in several hotels in seattle before but this was by far the best. The rooms are all themed as if you were travelling in the 1800s but are a great size. The bar and the Food are excellent and the hotel is close to downtown and a 5 minute walk to pike place we will definatley stay there again", "Date": "December 21, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Sleep Quality": "5", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Palm Desert, California", "Title": "“A Lovely, Historic Property”", "Author": "DesertExec", "ReviewID": "UR121857071", "Content": "First the down side. It's located several blocks off the beaten path in downtown and close to what is a changing area somewhat fraught with urban challenges. Get used to frequent police sirens and ambulences sent to pick up stabbing victims a few blocks away. Most of the crime is related to homelessness, poverty and alcohol and drug use and not aimed at tourists or residents. Seattle has always had a plethora of Native America, African-American and other street people. The economy isn't helping. So, with that out of the way, let me state that this is a lovely, well-maintained property. The building's history is fascinating, as are some of the decor items used throughout that were part of the original property. Front desk, valet and room service staff were, for the most part, professional, warm and responsive. Rooms are varied in layout, but well appointed and extremely comfortable. Nice big bathrooms make up for somewhat smaller rooms, but it makes for a very nice stay. The main part of downtown is a pleasant 10 minute walk away, along with Pikes Place and other tourist areas. Seattle is a great walking city so take advantage of it. Your body will thank you!", "Date": "December 18, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "", "Title": "“Fantastic hotel with a \"Boutique\" feel.”", "Author": "SEAORF", "ReviewID": "UR121839718", "Content": "Absolutely fantastic hotel. Rooms had character, were clean, and the service was terrific.", "Date": "December 17, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "3.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Tacoma, Washington", "Title": "“Classic”", "Author": "Jazzierose1", "ReviewID": "UR121398983", "Content": "The room was lovely but needed more lighting and vents. Would have been nice if you could open the windows just a bit to get some fresh air!", "Date": "December 4, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Laramie, Wyoming", "Title": "“The only place in downtown Seattle”", "Author": "mtngirlnv", "ReviewID": "UR121349724", "Content": "I stayed here for three nights and these people are fabulous. From the moment I pulled up, they took great care of me. Traveling alone isn't always easy, but the staff here at the Arctic Club went out of their way to make sure I was comfortable. The valet knew my name by the second day, and my car was out and ready within five minutes every time. The Juno restaurant has an excellent small menu and nice wine list. The rooms are small, but well appointed and clean. I would give this place six stars if possible. Transportation is also a great asset for this hotel. Third Street has buses that run down to the downtown shopping area for no charge, and it's an easy walk to Pioneer Square as well. Lots of other restaurants within two blocks, and the concierge is always happy to recommend something specific.", "Date": "December 3, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Ada, Ohio", "Title": "“How Can You Not Love A Hotel That Has Walruses on the Facade?”", "Author": "kdh1716", "ReviewID": "UR121304998", "Content": "Located on Pioneer Square, steps from the light rail station, this is a wonderful hotel in a beautifully restored building. The hotel tries to catch the ambiance of early twentieth century Seattle without sacrificing modern convenience. The rooms are spacious and beautifully appointed. The staff is well trained, considerate and professional. Take a moment to visit the dome room with its leaded glass ceiling or just wander around the lobby looking at the souvenirs from Seattle's past. Connections to the airport through the light rail line are convenient and the hotel is in easy walking distance of museums and the public library. The famous fish market is a bit longer walk but is still easily done.", "Date": "December 1, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Seattle", "Title": "“Classic and Lovely”", "Author": "ild", "ReviewID": "UR121178509", "Content": "Located in a beautifully restored classic building this is a gem worth visiting. Of course, in a 100 year old building ADA access is not a forte; the main entrance off Cherry Street is a set of steep stairs off a sloping sidewalk. Once inside, the lobby is home to a gracious and spacious Polar Bar Lounge. Our room was a corner jacuzzi that was roomy and comfortable. The closet was a nice size but dark enough to require a flashlight to find anything. Bonus points for an actual tea kettle; especially nice for us tea drinkers who don't appreciate making tea with coffee tainted water. The HVAC is noisy but the room temperature can be maintained.", "Date": "November 28, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "", "Title": "“Loved the Decor', ambience, the amenities..”", "Author": "JosephGaied", "ReviewID": "UR121068418", "Content": "Beautiful room decor, amenities, accommodations. Hotel is centrally located in Downtown Seattle, making my travel across the city using public transportation a breeze. Staff is very friendly. I was greeted with a nice cookie, and the front desk called me to make sure that all is OK, about 15 minutes after i got to the room. I would definitely recommend it.", "Date": "November 27, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "San Diego, California", "Title": "“Fabulous”", "Author": "eabareno", "ReviewID": "UR121028190", "Content": "They don't build them like this anymore. We never heard our next door neighbors, not a TV set or toilet flushing, and we loved the quiet. While there is outdoor traffic noise and we are not city dwellers, it sounded like white noise to us. The location was fantastic, adjacent to all public transportation, including the underground transit just across the street. We were one free stop away from the International District and the King Street Amtrak Station, and we had quick and free access to downtown in the other direction. We could walk to Pioneer Square, and to the waterfront and the ferry to Bainbridge Island. There were many inexpensive restaurants in the vicinity. The library is two blocks to the north and a great source of free wifi (the hotel charges for wifi). While our room was small, it was very comfortable, especially the bed. There was an in-room safe big enough to hold my laptop, free Washington State apples and chocolate chip cookies at the front desk, and helpful concierge and front desk service that gracefully answered my tourist type questions.", "Date": "November 25, 2011"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Overall": "3.0", "Value": "2", "Sleep Quality": "3", "Rooms": "1", "Location": "1"}, "AuthorLocation": "Salt Lake City, Utah", "Title": "“Ok, hotel.... rooms are small!”", "Author": "TravelorSLC", "ReviewID": "UR120942341", "Content": "Hotel is just ok! The rooms are small and not in the best location. Also if you you forget your cell phone charger, they will steel it and say it was never in the room! Do not stay here, unless you want a small rooms for a large price!", "Date": "November 23, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "3", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "ARIZONA", "Title": "“ROMANTIC & CLASSY!”", "Author": "ARIZONAULI", "ReviewID": "UR120910243", "Content": "This is such a nice, clean and historically rich hotel! The rooms are very comfortable, bathrooms are nice and clean. The staff is friendly, the bar area with pooltable and fireplace a great spot to either start your night or let it wind down. The hotel is conveniently located in downtown Seattle and walking distance to many attractions. I highly recommand the hotel and restaurant.", "Date": "November 22, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Chicago, IL, USA", "Title": "“Great hotel, very comfortable rooms, great location”", "Author": "chgotrvlr71", "ReviewID": "UR120826726", "Content": "I stayed here after attending a conference at another hotel downtown but wanting to extend my stay through the weekend. The hotel was very cozy with helpful staff. My room was very comfortable corner room and a nice comfy king bed and nice bathroom. Others have commented on the hotel being noisy but even with windows overlooking the street and a huge gala going on in the hotel during my stay, I never heard anything the entire stay. The rooms were a tad small, lots of bumping into one another for two people in the room but that is typically the case in older, historic hotels. Great walking distance to everything -- Pioneer Square, Market, the stadiums....will definitely return.", "Date": "November 20, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Milan, Italy", "Title": "“Great staff, excellent hotel”", "Author": "bostona", "ReviewID": "UR120763912", "Content": "Right on the edge of downtown, within walking distance of all shops and restaurants and also the Mariners and Seahawks stadiums, I was met by the nicest people you'll ever meet at the front desk. As it was 9am and my room was not ready, they gave two of the famous Doubletree chocolate chip cookies (now warm!) and went out of their way to be helpful. The hotel has a 1930 touch, very classy and stylish. Room was great, HD tv (to make it makes a huge difference, even if I might not watch it for a long time), spacious bathroom, minibar, all the amenites you might need. They also feature a car service to the airport for 40$ (Sea-Tac is not near downtown), less than I paid the cab that got me there. I'd definitely recommend this hotel to anybody.", "Date": "November 18, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Wenatchee, Washington", "Title": "“Artic Club DoubleTree Downtown Seattle”", "Author": "WICK9", "ReviewID": "UR120708082", "Content": "A very nice hotel. We stayed on the 2nd floor which was the main floor. The room was at the end of the hallway. Upon entering it I was amazed at the size. It was a nice large room with a king bed. Bathroom had a large soaking tub. The ceiling was about 20ft high which made it seem so spacious. I really enjoyed the room and hotel.", "Date": "November 17, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "2.0", "Value": "3", "Sleep Quality": "2", "Rooms": "2", "Location": "3"}, "AuthorLocation": "Atlanta, GA", "Title": "“Disappointing”", "Author": "hotlanta2", "ReviewID": "UR120687604", "Content": "Front desk told me they had a beautiful QUIET room for me. I guess I should know that when they say that they mean sorry we dont have an upgrade for you and this is all we have. Room w/ sofabed was very small and historic quality only vaguely quaint. Unfortunalty, it was so noisy (I could hear the conversations from the parking lot and I was on the 5th floor) I thought a window was open, but not the case. So, I had to move to a smaller room (as i said, nothing else available even for a diamond HHonors member) and paid the same amount for the cheaper room which also was not acceptable. So, my 4 night stay turned into a 1 night stay. The restaurant for breakfast was good allowing ordering from general menu with good service. Also, I wound up finding this hotel really out of the way if you'll be spending your time in downtown and near Pike's market. And, the fringe location did not result in a quieter location.", "Date": "November 16, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "5", "Overall": "3.0", "Value": "2", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Washington, United States", "Title": "“Poor service”", "Author": "192Alyssa", "ReviewID": "UR120475318", "Content": "Wait at the valet, wait over an hour past check in to get to room, unsympathetic staff. I stayed here on a Saturday night, so perhaps their A team was away.", "Date": "November 11, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Chicago, Illinois", "Title": "“Great hotel”", "Author": "kate0709", "ReviewID": "UR120437555", "Content": "This hotel is an a great location (right off the light rail line from the airport), the room was lovely, new and very quiet (never heard another guest in the hallway), the lobby is gorgeous with a beautiful bar. The staff were super friendly and laid-back. They were all too happy to answer questions and give directions. They even offered us complimentary chocolate strawberries and champagne because they knew we were celebrating our anniversary. We were unable to partake, but it was a really nice touch. We were so busy exploring the city, we never got a chance to check out the pool and gym. Will go back in a heartbeat!!", "Date": "November 10, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "waco, texas", "Title": "“Comfortable downtown Seattle hotel”", "Author": "4familytravelers66", "ReviewID": "UR120387105", "Content": "While this hotel is not the most family-friendly we have enjoyed, the room was comfortable enough with nice linens, towels, plush bathrobes and a good view. We found the hotel to be very quiet also which allowed for great sleeping. It was a bit cramped for the four of us, but we survived. The hotel was undergoing some renovation while we were there and great care seemed to be taken so as not to inconvenience guests. We enjoyed the convenient downtown location of this hotel making many attractions within a nice walking distance for us. The staff was very accommodating as well. There is a very nice bar located just off the registration desk which looked like a great place to have a cocktail and recount the days' activities.", "Date": "November 9, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Bellingham, Washington", "Title": "“Charm, service and comfort in downtown Seattle”", "Author": "DeanpW", "ReviewID": "UR120109577", "Content": "The Arctic Club combines the charm of a renovated century-old building, warm service and very comfortable rooms into an appealing, somewhat quirky hotel. The valet and front desk staff greeted us warmly and the check-in and check-out processes were quick and efficient. Rooms are elegant, with high ceilings, moldings and great bathrooms. A real plus is the Polar Bar, where the bartender makes a perfect martini. It's a quick walk to McCormick's Fish House, a fine seafood restaurant. This end of downtown is a bit deserted at night, but it's very convenient to Safeco Field and light rail transit to the airport.", "Date": "November 3, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Missoula, Montana, United States", "Title": "“Wonderful experience.”", "Author": "Bagehot_11", "ReviewID": "UR120053239", "Content": "The staff was great. The room was very comfortable. The staff was very, very helpful and attentive. I enjoyed the Polar Bar and its very professional bartender, Viktor. It was a great hotel experience and a great historical experience as well. I felt like I had stepped back in time to a more elegant era. This wasn't like most Doubletrees I've stayed at (which have been just fine), this was a real \"experience.\" The location in downtown Seattle was unbeatable. You can walk to anywhere; the train station is just a few blocks away, and light-rail to Sea-Tac airport just a block away. The waterfront is three blocks away, there are two Irish bars close by, shopping is five blocks away, and Pike Street Market a nice walk.", "Date": "November 2, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "3", "Sleep Quality": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Vancouver, Canada", "Title": "“Comfortable, Helpful and Charming Atmosphere”", "Author": "PlacesT0See", "ReviewID": "UR119989001", "Content": "A lovely place to stay. The room was somewhat small, and the washroom configuration somewhat awkward however the furnishings were lovely and very comfortable. The hotel is located far enough away from the tourist attractions like Pike place but still convenient to them and the heritage area and the stadium. Very easy to recommend this hotel.", "Date": "October 31, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Chicago, Illinois", "Title": "“Excellent Service”", "Author": "Carrie L", "ReviewID": "UR119917410", "Content": "I had a wonderful experience at this hotel. The service was outstanding from every employee at this hotel. The rooms were on the smaller side, but they were antique looking and the beds were so comfortable. I would highly recommend this hotel.", "Date": "October 30, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Orange County", "Title": "“The best bar on the west coast hands down”", "Author": "Immergeil", "ReviewID": "UR119861374", "Content": "The Polar Bar, on the other hand, is one of the best bars we've encountered in a long while. I believe most of this (if not all of it) is due to Viktor the bartender. Viktor is attentive, friendly, helpful, and a wealth of knowledge relating to the Arctic Club hotel. His drinks are delicious and well served. If you like Absynthe, Viktor will put on a show! Don't forget to view the Ballroom ceiling on the 3rd floor! We look forward to returning to Seattle and to our new favorite hotel, the Arctic Club and favorite bar and bartender!", "Date": "October 29, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "4.0", "Value": "3", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Washington, DC", "Title": "“Very nice hotel.”", "Author": "karen4352", "ReviewID": "UR119671846", "Content": "The hotel is beautiful. The room was spacious and nicely decorated. The bathroom was large with a whirlpool tub and a large vanity. The hotel doesn’t offer free WiFi in your room but if you are a silver or higher Honors member they’ll waive the in room fee. Make sure you ask for it… it wasn’t offered to me at check in. The staff was hit or miss. The parking attendants are SLOW to get your car, if they are even in the valet area. More than once we had to come back because they were nowhere to be seen. When we pulled up for check in, we had to lug our luggage up the front steps. The bellmen didn’t come out to offer to help us. Only once we were in the front door did they offer to help us with our bags. At that point we could get them to our room so we declined the offer. At check in, the hotel did allow us to check in early (noon) but put us on the 4th floor (421). We asked for a higher floor but they told us we would have to wait to check in until 4:00 and they couldn’t tell us if we could get a higher floor until then. I don’t buy that… they know who is checking in and out every day. So we took the room. I thought the front desk woman could’ve been more helpful. She wasn’t rude but she also wasn’t warm and welcoming. There were times where the staff was helpful. Especially when asking about places to eat for dinner. They made reservations for us and called us cabs. As I said before, the room was beautiful but the street noise was loud. We ate lunch at Juno’s the first day. There were 3 of us and our tab was $70 before tip! That was for sandwiches and one beer each. Needless to say, we only ate there once. The food was really good… just not $70 good. The location was good. An easy walk to Pikes Place, only about 10 minutes. It is located right outside the train to the airport so DON’T rent a car unless you have to. Parking is $39 (including tax) per night. Cabs are not expensive and easy to find.", "Date": "October 24, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Milwaukee, Wisconsin", "Title": "“great hotel with a lot of character in downtown seattle”", "Author": "Britt B", "ReviewID": "UR119416509", "Content": "Great, unique hotel with a lot of character. Very tall ceilings everywhere, with rich oak walls in the lobby, reception, halls, and room which was very regal and rich looking. Fantastic bathroom - one of the nicest we've been in. Bedding was very comfortable. They gave us slippers to keep, had free newspapers to take, service was good (very helpful). Only drawbacks are that you have to valet park your car and if you don't get the right room it can seem a bit darka nd gloomy (my husband didn't mind this at all but I prefer lighter warmer rooms). Great that you could use the internet for free in the lobby. This hotel is on the historic registry of hotels which was nice to say we've stayed in! Walking distance to some great restaurants.", "Date": "October 17, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "malawimike", "Title": "“Excellent service, beautiful hotel”", "Author": "malawimike", "ReviewID": "UR119151987", "Content": "Nothing negative to report. Staff was nothing less than professional and helpful (and friendly!). The hotel is beautifully restored. Ask for the sheet of paper that gives the history of the building, and explore. Great marble staircases, but they are hidden behind stairwell doors so few people probably ever see them! The location is good too -- close to some local government offices, pioneer square, easy walk to pike market, plus the free downtown buses stop right outside the hotel. All in all, I give high marks to this hotel. See pics of my room...", "Date": "October 10, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "chagrin falls", "Title": "“Good Choice if You Have the Right Room”", "Author": "islandjule", "ReviewID": "UR118912498", "Content": "Stayed for 3 nights in late September. PROS: Good location, easy walking distance to public transportation, waterfront or Pioneer Square and cool retro vibe as it is restored gentleman's club. CONS: Dark, as in gloomy dark. Closet had no light and room lighting was not adequate; Paid for \"upgraded\" corner suite (Rm #601, $215 per nt) - had gorgeous view of parking lot on one side, and demolished building site on the other. Valet parking is $32 per nt w/o taxes. Told by valets that the next door parking lot suffered from frequent \"vandalism\" so was hesitant to \"self park\" (maybe that was just the party line?). Entire bar area shut down from 4 PM - 9 PM on Saturday for a private party. We looked forward to spending our last night with a drink at the historic Polar Ice bar - but, was not in our future. Would have been nice to know that this was going to happen (maybe a sign put up earlier in day?). Street noise is loud as well as on-site functions (wedding on-site rocked until wee hours - even on 6th floor I felt like I was there doing the 'lectric slide at midnight.) Suggestion: Ask for room facing 3rd Ave. Rooms facing Cherry and 4th Ave have the worst view. See my pix.", "Date": "October 3, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "5", "Overall": "4.0", "Value": "3", "Sleep Quality": "4", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Pattaya, Thailand", "Title": "“Problems with service, signage”", "Author": "pattayainsider", "ReviewID": "UR118720197", "Content": "The room was fine, but I had all kinds of problems with service. It started with trying to find the hotel. Their street address is one one street, but their actual entry is on the side street. It's all one way streets, and in rush hour traffic, trying to navigate to find their entry, took almost 40 minutes to literally just end up going around the block. And at their street address street, there is an entrance, but not for valet parking. And there is only a tiny sign, maybe two inches long that says something like \"ring for service\". I only saw the sign when the manager showed it to me. Their entrance for valet is on a very very steep street, and it's quite scary to get in and out, and park there waiting for a valet to show up. There were three separate instances where I was either overcharged, or a promised credit wasn't delivered. When I complained about this, the manager told me, \"you've been nothing but trouble since you arrived here\". Outside of these problems, the room and hotel were nice.", "Date": "September 28, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Nashville", "Title": "“Great old hotel”", "Author": "TN-Bill", "ReviewID": "UR118717822", "Content": "Wife and I stayed here over a weekend in August 2011. I did use HHonors points, but I think I would have payed to stay here as well. The location is good, pretty close to most everything in downtown Seattle, and what is not close you can generally use the free downtown transportation to get there (like to Pike Market). Down the hill toward the water are bars and restaurants. Plus it is right next to a light rail stop that takes you right to SeaTac airport. The room was awesome - large and very cool. There was a neat glass door going into the bathroom. The bed was very comfortable. About the only issues were a bit of street noise and if you go left (south) out of the hotel you run into a not-so-great area. Overall, I would highly recommend this hotel.", "Date": "September 28, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Lake Oswego, Oregon", "Title": "“Nice hotel in a great central location”", "Author": "s2npdx", "ReviewID": "UR118615826", "Content": "We stayed at the Arctic club the night before going to the Seahawks/Cardinals game. It is in a good central location..close to the waterfront and close to the stadiums. We were greeted and had our car parked and at noon, our room was ready. So we were able to get settled before heading down to the waterfront for lunch and some sightseeing. The place has an older smell, but was clean and comfortable. The Polar bar was a nice spot to have a couple of drinks after dinner. It has some good drinks options and very professional bartender. The hotel allowed us to keep our car parked in their valet lot until the game was over at 4:30 pm. Overall, we very much our stay at the Arctic club and wouldn't hesitate to stay there again on a return trip to Seattle", "Date": "September 26, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "San Francisco", "Title": "“Very honest and helpful staff!”", "Author": "JTSF", "ReviewID": "UR118589005", "Content": "I have always genuinely found this hotel to be very pleasant, but I wanted to share a special experience to commend their staff: I accidentally left a very expensive suit in the closet in my room. I didn't immediately realize it and when I called the hotel several months later thinking it was a very lost cause, they still had my suit in lost and found! They fed-exed it to me right away.", "Date": "September 25, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "4", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Sydney, Australia", "Title": "“Nice place to stay when in Seattle”", "Author": "FredSG", "ReviewID": "UR118434691", "Content": "If arriving by airplane the hotel is conveniently located across the road from the Pioneer Square Skytrain stop. Costs a lot less than taxi or shuttle. Worth considering depending on the amount of luggage you have. The steep hill makes carrying bags to the front door on Cherry St a problem, but there is an alternate entrance on 3rd Avenue. Seattle is a hilly city. The location of the hotel was several blocks away from the main tourist areas, such as Pike Markets and the waterfront. This meant a bit of walking but it was pleasant nevertheless. A free city bus is also available. Bell hop and concierge service varied depending on who was on duty at the time. Overall they were OK. They assisted us with instructions about getting around Seattle and had good local knowledge. The warm cookies on arrival were a nice treat. Check-in was friendly and efficient. The room, like the hotel public areas, were themed to look and feel like a Gentleman Explorer's club. It was well done. The room was large, with a separate room for a desk. It was beautifully maintained and the fittings were good quality. The bed very comfortable and the room was very quiet. Breakfast was nice in the hotel's restaurant.", "Date": "September 22, 2011"}, {"Ratings": {"Location": "2", "Overall": "3.0", "Value": "3", "Service": "4", "Rooms": "4"}, "AuthorLocation": "Denver, Colorado", "Title": "“I Should Have Choose a Different Hotel”", "Author": "Frances N", "ReviewID": "UR118276500", "Content": "Even though their web site shows bell hops waiting at the 700 3rd Ave entrance, there are none there. This is where the taxi cabs let you off and then you struggle with your luggage to get it into the building and then find that you must take an elevator to the 2nd floor for the lobby. Once you get to the 2nd floor, you must again struggle with your luggage to get to the check-in area where there are bell hops just waiting around at the Cherry Street entrance. What is wrong with this picture??? The street noise at night is loud but luckily I had brought my Brookstone Sound Therapy System with me. I think limos are the only form of transportation that drops you off and picks you up at the Cherry Street entrance. I took a limo back to the airport and it really was not any more expensive than a taxi and well worth every penny. I found the food at the Juno Restaurant to be very good. I now wish I would have picked Hotel Monaco for my stay.", "Date": "September 18, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "4", "Rooms": "5"}, "AuthorLocation": "", "Title": "“Great service and comfortable beds!”", "Author": "goobienme", "ReviewID": "UR118214589", "Content": "When we planned our trip to Seattle I was 8 mo pregnant so comfortable beds were a must! This place not only has comfortable beds but excellent service!!!!", "Date": "September 16, 2011"}, {"Ratings": {"Location": "5", "Overall": "5.0", "Value": "5", "Service": "5", "Rooms": "5"}, "AuthorLocation": "Yorktown, Virginia", "Title": "“Great staff... great hotel”", "Author": "egldrvr555", "ReviewID": "UR118206149", "Content": "We only had a limited time at this charming hotel, but every moment was a pleasure. The room was fantastic and the front desk staff exceptionally accommodating. Especially noteworthy was the front desk manager, Ms Anna Kim, who made our stay as best it could be. The hotel's location is great for connecting to SeaTac -- the light rail is right across the street -- and everything's an easy walking distance in downtown Seattle. When we go back to Seattle again, we'll be staying here... and for much longer!", "Date": "September 16, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "", "Title": "“Historic”", "Author": "smoothoney", "ReviewID": "UR118174144", "Content": "I have to say the charm of this hotel blew me away. The building was an old gentelmens club, that has been preserved and restored. The rooms although small make up for it with days gone by charm with modern amenities. The blue room doors were a hit with me. Its close to pike market, and we didn't need to rent a car. Seattle has a great public transportation system. The gem of the hotel was Angelo the bellman he was our go to guy. He really took care of us, and answered all our questions. Now, I did find a tank top behind the end table, when my watch fell. Honestly it would have been easy to miss. I had to move it to reach all the way beihind it. This in no way effects my opionion on the hotel. If you dont want the cookie cutter hotel. I highly recommend this one.", "Date": "September 15, 2011"}, {"Ratings": {"Location": "4", "Overall": "5.0", "Value": "4", "Service": "5", "Rooms": "5"}, "AuthorLocation": "", "Title": "“Cool Old Hotel, Especially for a chain”", "Author": "Rossjz", "ReviewID": "UR118151187", "Content": "The staff was great. Our rooms were updated and large. Everyone was really nice. I would recommend this place. The area is quiet at night, I think because it is the financial district.", "Date": "September 15, 2011"}, {"Ratings": {"Location": "5", "Overall": "4.0", "Value": "5", "Service": "4", "Rooms": "4"}, "AuthorLocation": "Houston", "Title": "“Unique historical building, good location”", "Author": "loves2garden", "ReviewID": "UR118031548", "Content": "Don't miss seeing the amazing ceiling in the ballroom for a look back at the gold rush era! Breakfast in the downstairs restaurant was very nice and a great way to start the day. I liked the place, the location was convenient, but the only draw-back was the noisy street. I asked for a quiet room, and was provided with ear plugs. They didn't help that much.", "Date": "September 12, 2011"}, {"Ratings": {"Location": "4", "Overall": "4.0", "Value": "3", "Service": "3", "Rooms": "4"}, "AuthorLocation": "Dallas, TX", "Title": "“Unique hotel right in the city”", "Author": "Dallashawkeye", "ReviewID": "UR118025828", "Content": "We really enjoyed our stay at the Arctic Club in Seattle. First, the location is top notch, netled right between two big attractions - Pioneer Square and Pike's market. Pike's market is approx 8 blocks away, but an easy walk. Pioneer square is approx 2 block away. The service was great. Although this is a Hilton family hotel (and you'll get your Hilton Points), you would never know it was a chain hotel. The interior is decorated with pictures of old Arctic Club members, the rooms feel like you are about to take an expedition to Alaska. Really a fun stay!", "Date": "September 12, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Boston, Massachusetts", "Title": "“Lovely Hotel - One of the best stays I've ever Had”", "Author": "FlyingHigh060", "ReviewID": "UR117869413", "Content": "This hotel is just charming. The lobby is interesting - as is the collection of top hats. The \"Arctic Club\" theme is very cute and carried out throughout the hotel. I have status with Hilton and we were upgraded to a VERY NICE Suite on the top floor which had a balcony. While the downstairs area has old-world charm, the rooms are new and beautiful. The bed was super comfy! The hotel is in a great location for sight-seeing and enjoying everything Seattle has to offer. The Staff were exceedingly helpful and I could not have enjoyed my stay more. (1 bias to add is that I love the double-tree chocolate chip cookies).", "Date": "September 9, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "4", "Overall": "5.0", "Value": "4", "Service": "5"}, "AuthorLocation": "San Francisco, California", "Title": "“Excellent Stay, Impeccable Service”", "Author": "VickyE2006", "ReviewID": "UR117710723", "Content": "This hotel really has service nailed. The room was spacious and the bed was very comfortable.", "Date": "September 5, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "4.0", "Value": "5", "Service": "5"}, "AuthorLocation": "lake oswego", "Title": "“Great hotel one of my favorites in washington”", "Author": "eric p", "ReviewID": "UR117686275", "Content": "I stayed at this location multiple nights last year and wanted to write and let everyone know that it was a great hotel. I travel a decent amount and would highly recomend this hotel. The only reason i am not giving the hotel 5 stars is that the fire alarm went of twice while i was staying there. The front desk staff and houskeeping were great.", "Date": "September 5, 2011"}, {"Ratings": {"Cleanliness": "3", "Sleep Quality": "4", "Overall": "1.0", "Value": "3", "Service": "3"}, "AuthorLocation": "Toronto, Canada", "Title": "“Juno Restaurant is over priced and the food is terrible.”", "Author": "Ron C", "ReviewID": "UR117666002", "Content": "When checking in we were encouraged to try Juno, the restaurant associated with the hotel. Our initial plan was to try a local seafood restaurant because of Seattle's reputation for great seafood. Since the restaurant was recommended to us we thought we would give it a try, big mistake. The restaurant is conveniently located next to the hotel but that was all it had going for it. After glancing at the menu we realized the restaurant was going to be an expensive proposition for the 4 of us. A full meal was in the $30 to $40 range per person, which is a reasonable price for a good seafood restaurant. Unfortunately the appetizers were disappointing (ceasar salad dripping with bad Kraft like dressing) and the seafood plates we ordered were over cooked and salty. When a restaurant charges the prices Juno does a customer should expect a level of service and food commensurate with the price. Unfortunately Juno failed to deliver in most respects. After a delay in our check-in our room in the hotel was large and very nice. The room was on the 1st floor with large picture windows. The decor was very pleasant and the Starbucks coffee was appreciated in the mornings. We did find the room noisy late at night when the party goers returned too the hotel after a late night of drinking. Otherwise our stay was pleasant and enjoyable.", "Date": "September 4, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "4.0", "Value": "4", "Service": "4"}, "AuthorLocation": "Arlington Texas", "Title": "“Surprisingly nice hotel”", "Author": "hugbandit7", "ReviewID": "UR117497219", "Content": "I always try and read reviews and look at picitures and I wasn't 100% sure about this property but the price was right. Plus it was a Hilton Hotel, surely it couldn't be that bad? Check in went very smoothly, in fact we arrived early and our room was ready unlike our friends that arrived before us and didn't get their room until hours later (but to the hotel's credit our friends had a nice room on the top floor so I'm sure someone else had to vacate the room first). The room was on the 6th floor (I believe) and it was a corner room. There was a little sitting area at the end of the bed and a huge bathroom. The hotel probably could have eliminated a chair to make a little more space, but it all fit well. The hotel was located in a good part of town that made it easy to walk around town and see the site. Across the street was a little cafe that serves a yummy breakfast sandwich. I don't really recommend the restaurant in the hotel, especially not for breakfast. The food was fine but it was way overpriced for what you get. Unfortunately the cafe across the street wasn't open on a Sunday morning. We stayed here for 2 nights before our cruise and would stay here again.", "Date": "August 31, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "4", "Overall": "4.0", "Value": "4", "Service": "3"}, "AuthorLocation": "Baltimore, MD", "Title": "“Nice hotel.....taxis are a problem”", "Author": "hbhakh", "ReviewID": "UR117464396", "Content": "We stayed at the Arctic Club for one night prior to flying home from Seattle. It’s an old building that has been renovated into a hotel. We thought the décor was well done and reflected the history of the building. Our corner room was comfortable and spacious. The complimentary breakfast (Hhonors gold) was in the hotel restaurant and was very good. The location is a little out of the way for some downtown attractions but most are still walk able. My only complaint was the lack of available taxis. The bell staff pushed a limo company that is more expensive to the airport than taxi service. It tool over 30 minutes for us to get a taxi, which I find unacceptable for a downtown hotel that advertises as four stars.", "Date": "August 30, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Florida", "Title": "“Outstanding in Every Aspect”", "Author": "HB_and_CE", "ReviewID": "UR117365745", "Content": "We are Hilton Honors members and used our points to stay at this hotel-it was worth it! The check-in staff was professional, helpful, and friendly. There was staff everywhere to help. The room was not only clean, but well-decorated and comfortable. Also, the bed was comfortable, a/c worked well, and there was no noise from the city nor neighboring rooms. We can't say enough good things about this hotel!", "Date": "August 28, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "4", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Durham, North Carolina", "Title": "“A very pleasant surprise”", "Author": "letsgosoon123", "ReviewID": "UR117252396", "Content": "We stayed here on our way to and from Victoria. The hotel itself is an historic building that used to be a men's club, and Hilton has kept the ambiance and history of the original building intact after the renovation and restoration (restored in 2009, I believe). Our concierge, Stephen, was simply the best I have ever come in contact with, and gave us tips on sights and neighborhoods in Seattle and Victoria that enhanced our trip greatly. The rooms were slightly on the small side, but immaculate and well appointed with a very comfortable bed. Every member of the staff we encountered was absolutely professional and courteous at all times - really representative of a five star hotel. Any downsides were not the fault of the hotel. The Pioneer Square neighborhood is in transition, but this hotel will be an anchor in the transformation. Street noise was an issue because of the hundreds of millions of buses that run through Seattle. The upside to this is that the hotel is literally across the street from the Pioneer Square light rail stop (40 minutes to or from the airport, $2.75 each way and HIGHLY recommended), and is also right next to a major bus stop, which makes travel through the city easy. It is also about a 15 minute walk to the famous Public Market, 20 or so to restaurants on the waterfront, definitely a cab ride to the Victoria Clipper ferry service. All in all, highly recommended, with the caveat that a room away from the street is better than one next to the street.", "Date": "August 25, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "3", "Overall": "4.0", "Service": "5"}, "AuthorLocation": "Atlanta, Georgia", "Title": "“lovely hotel, dont get room facing street!”", "Author": "europeantraveler1953", "ReviewID": "UR116999894", "Content": "stayed here before our alaska cruise.we knew nothing about seattle,so my sister used her points for this hotel.location fine but id say more of business hotel..reason,in the middle of buildings and gets noisey early as folks are going to work or where ever.actually heard yelling early in the morning several times in the 7 am hour.street car right outside our window not only makes a bit of light coming in,but very noisey.when we asked about it they said streetcars stop around 8.not true.stayed noisey most of the night.all else was fine,clean nice hotel.id say stay on the water at the marriott with the great view in the middle of it all and right by the ships!", "Date": "August 20, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "4", "Service": "5"}, "AuthorLocation": "Boone, North Carolina", "Title": "“Great Location, Great Service, Nice Rooms”", "Author": "cblack201", "ReviewID": "UR116856153", "Content": "Recently stayed at the Arctic Club in Seattle. Super easy to get to from Seatac.Service was wonderful and the free bus route makes Downtown a breeze.", "Date": "August 17, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "4", "Overall": "4.0", "Value": "4", "Service": "5"}, "AuthorLocation": "LO, Oregon", "Title": "“Lovely Remodel, Great Location for Walking to Safeco Field”", "Author": "nnl", "ReviewID": "UR116680808", "Content": "My son, husband and I just returned from a one night stay at this charming Hilton Hotel. We were in Seattle to attend a Friday night Mariner vs. Red Sox game and this was our first time staying at The Arctic Club. We usually stay at the Inn at Harbor Steps, a B&B, but it was full so we found the Arctic Club and we loved it! So many things to comment on: Pros: Warm cookies at check-in (!); friendly bell men, front desk people and valet (he spoke french with my son); walking distance to both Century Link and Safeco Fields; decor is old world and stately; beds/pillows are comfortable; room size was adequate and well laid out (we had a room with 2 queen beds); bathroom was spacious and well lit with tile floors, make-up mirror, Crabtree & Evelyn amenities, marble top counter; well stocked mini bar on the honor system; overall ambiance was pleasant and relaxing! Cons: Only 2 elevators and they are rather small; valet parking is $32.00 a day but with taxes it came to $39.04 (more than I paid in Waikiki last month!); hotel restaurant Juno which I will review separately; 4 pm check-in. We got to the hotel at 3:10 pm and had to wait until 4 to get our room assignment. Next time we will spend a weekend at The Arctic Club and hopefully have more to comment on. There is a business center and fitness room at this hotel but I did not have time to check out either one. There is also a public parking lot next door to the hotel which might be less expensive than the valet service.", "Date": "August 13, 2011"}, {"Ratings": {"Service": "2", "Cleanliness": "4", "Overall": "4.0", "Value": "2", "Location": "2", "Rooms": "3"}, "AuthorLocation": "Denver", "Title": "“Too far from downtown. Neat building”", "Author": "wilco501", "ReviewID": "UR116570619", "Content": "We needed a room for our family (2 small kids) for one night. I used to live in WA, so was familiar with area, butthis is a newer hotel. Seafair was going on and rooms were a little tight in town. I got a room at this hotel through hotwire at a decent price, having used priceline and hotwire many times in past. So we show up after a long day of travelling at about 9:30 and instantly upon check in the guy working at the desk days \" i see you booked your room through a third party site\". I said yes. He said, well we cant accomodate you with 2 beds. Kind of haughty about it as well. Actually, on hotwire you can request accomodations for 4 people, and we did it at the sheraton thefollowing week. They ( sheraton) automatically had us in a double room without asking. So with \"nothing else available\" we had a room with a pullout sofa. It was fine but you couldnt really move around. Otherwise, the bar area was cool--absinthe! Sirens all night long was unpleasant. Restaurant juno for breakfast was ok albeit slow service. I wouldnt stay here again, too many better options around.", "Date": "August 11, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "4", "Service": "5"}, "AuthorLocation": "Elk Grove, California", "Title": "“Wedding Bliss”", "Author": "beautea97", "ReviewID": "UR116362962", "Content": "Son & Daughter-in-Law chose this venue for their wedding and it was a BRILLAINT choice!!! From the time we checked in until check-out every wish was granted. Daily fresh fruit in the lobby and very helpful front desk employees! This is a PERFECT venue for a wedding... Wedding/Reception in one location and a place for out-of-towners to overnight! PLUS the location downtown is awesome!!! There is a light rail stop (guests can board at Sea-Tac) nearly at the entrance!! This made transporatation a breeze :-) Bellman were MORE than helpful with guests luggage in addition to the bridal parties additional needs. Highly recommend!!!", "Date": "August 6, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "4", "Service": "5"}, "AuthorLocation": "Pennsylvania, US", "Title": "“Amazing hotel in historic Arctic Club - restored and wonderful!”", "Author": "nylady21", "ReviewID": "UR116355521", "Content": "My family LOVED this hotel! We had two connecting rooms which gave us plenty of space for two teens and two adults. The bathrooms are amazing, including the beautiful doors. The Polar Bar in the lobby serves great drinks in an old-time 'club' atmosphere. The restaurant, Juno, had fabulous breakfasts. Service at the front desk was friendly and knowledgeable. The hotel is a few block walk to the Retail Core, but was right next to the exit from the Pioneer Square station for the LightRail link from the airport. We truly didn't want to leave.", "Date": "August 6, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "4.0", "Value": "3", "Service": "4"}, "AuthorLocation": "Oneonta, New York", "Title": "“Great place to stay”", "Author": "N_and_R", "ReviewID": "UR116283974", "Content": "My partner and I stayed at DoubleTree Arctic Club Hotel in Seattle before and after our Alaska cruise. This was our first time visiting Seattle. The location was perfect. The hotel staff were very professional and helpful. The rooms are very well decorated (very masculine). I would recommend this hotel highly.", "Date": "August 4, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "4", "Overall": "4.0", "Value": "5", "Service": "4"}, "AuthorLocation": "Yakima, WA", "Title": "“Perfect for weddings, location not great!”", "Author": "mlabberton", "ReviewID": "UR116232243", "Content": "We spent two nights at the Arctic Club and found the accomodations fine (refurbished men's club), the staff very friendly, and the wedding venue...i.e. lobby bar and ballroom truly perfect for a large reception. Our rooms were off the hall from the ballroom, so that was super convenient. Our only problem with the hotel was that it is located too far from the heart of Seattle shopping and dining. It would be great for a Seahawk football, Mariner's baseball or Sounders soccer, because it's close to the stadiums in Pioneer Square, but it's a long hike up to Pike Place Market, Pacific Place, the Seattle Convention Center, and of course, the Nordstrom flagship store. The neighborhood is definitely transitional and can get a bit seedy; however, once inside this fascinating, converted explorer's club of the 1900s...it's great.", "Date": "August 3, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Location": "3", "Rooms": "4"}, "AuthorLocation": "", "Title": "“Great atmosphere!”", "Author": "Siamesefish2497", "ReviewID": "UR116192822", "Content": "Very cool hotel! From the pictures on the walls to the warm cookies upon arrival this hotel is very inviting. The room we stayed in was a little small. But the ambiance more than made up for it. The location is within walking distance of pike place market. But is also located on some very steep hills. Bring some walking shoes!", "Date": "August 3, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "4.0", "Value": "4", "Service": "5"}, "AuthorLocation": "Lathrop, California", "Title": "“Excellent hotel”", "Author": "noonanagain", "ReviewID": "UR116139669", "Content": "Stayed here over 4th weekend. Wonderful staff--very attentive. Paid for the valet parking and they did not even blink at the condition of my car (4 day road trip). They even went back to the car later for some dvd's we forgot--don't know how in the world they found them! Comfortable beds/pillows. Very clean.", "Date": "August 2, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Fairbanks, AK", "Title": "“My new Seattle hotel!”", "Author": "goodnorthern", "ReviewID": "UR116127162", "Content": "Perfect location, service, and restored historic hotel. What a treat! A little loud but well worth it. Skip the car and take the metro to downtown from the airport. Loved every minute!", "Date": "August 1, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "4", "Service": "5"}, "AuthorLocation": "replay49", "Title": "“Wonderful historic hotel reasonably priced”", "Author": "replay49", "ReviewID": "UR116120712", "Content": "We had the opportunity to stay here during a weekend getaway, and were very pleased with the accomodations. This is a great old historic Seattle building that has been wonderfully restored and in a very convenient location close to Pioneer Square and an easy walk to the ball stadiums and Pike Place Market. The staff were all friendly and helpful and the room amenities were great....french press Starbucks coffee with enough for several cups, comfortable bedding, plush robes, flat screen t.v., and quality toiletries. Other than a little bit of street noise, it was very quiet at night. There's a very nice old high ceilinged lobby with the Polar Bar adjacent. It made us feel like we had stepped back in time. The Polar Bar was a real bar with a bartender who was a true mixicologist. The Arctic Club is a quality hotel, conveniently located, and reasonably priced. We'll definitely be coming back.", "Date": "August 1, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "4", "Rooms": "5"}, "AuthorLocation": "", "Title": "“great place in downtown seattle”", "Author": "Bert0504", "ReviewID": "UR115991863", "Content": "This is a very nice hotel downtown. My family and I had a great stay at the Arctic Club. It is located several blocks from Pike and Pine but it is easy to get there day or evening. The staff doesn't give advice unless you ask for it. But the rooms and the hotel are great.", "Date": "July 29, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "4.0", "Value": "5", "Service": "4"}, "AuthorLocation": "savannah, ga", "Title": "“Very nice hotel in Seattle”", "Author": "hawa", "ReviewID": "UR115983820", "Content": "The Arctic Club is a lovely hotel close to Pioneer Square. What makes this an excellent choice is its location near the Pioneer Station of the rail link from Sea-Tac airport. It is a half block walk and barely uphill. The hotel atmosphere is like a private club with a comfortable lobby and bar area. The rooms are on the small side but are comfortably furnished and well maintained. The hotel is located on Third Avenue with easy access to bus transportation and a manageable walk to restaurants and Pike Place market. We enjoyed staying here, especially for its convenience and would stay here again.", "Date": "July 29, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "4.0", "Value": "3", "Service": "4"}, "AuthorLocation": "Arlington, Virginia", "Title": "“Nice hotel but parking is way too expensive”", "Author": "jefinNova", "ReviewID": "UR115979521", "Content": "stayed there for one night on July 4. First of all, let me tell you that no one should spend the 4th of July in Seattle if you expect to have any fun other than watching the fireworks. Most restaurants and bars were closed. We are from the DC area and were very surprised. We did find a restaurant by the waterfront and a few bars but the majority were closed. As for the hotel, it was nice. Clean rooms, good service, good location but the parking is way too expensive (I think $30+). We tried to find a parking garage close by but of course.....yes, they were closed too. It felt like a ghost town around the hotel because of the holiday.", "Date": "July 29, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "4", "Service": "5"}, "AuthorLocation": "Keokuk, Iowa", "Title": "“great choice”", "Author": "phillie15", "ReviewID": "UR115971690", "Content": "1/4 block from the light rail connection to seatac airport, with great public transportation from hotel to whole area. the hotel is awesome, very comfortable historic building right in the middle of things to do in seattle.", "Date": "July 29, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Texas", "Title": "“Something Different from the Standard Hotels”", "Author": "CZSandy", "ReviewID": "UR115891099", "Content": "We decided on this hotel for our one night pre-cruise stay and were totally pleased. The lobby area isn't anything special so as we checked in, I was a bit worried how the room would be. Not to worry!! It was absolutely delightful. The decoration and the furnishings were a pleasant change from the standard hotels we're used to. The bed was wonderful and the french press coffee pot was special. We used the light rail from the airport. You get off just a few steps from the lower entrance to the hotel. That's a deal too ....75 cents for seniors. The free buses stop in front of the hotel and we took every advantage of that. The desk clerks were very helpful mapping out the places we wanted to go and how to get there. They arranged a town car to get 4 of us with luggage to Pier 91 for $25. A taxi is probably a little bit cheaper. If you're looking for something a little different with the same amenities as the other upscale hotels, you'll definitely want to consider this one.", "Date": "July 28, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "4", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "San Francisco, California", "Title": "“Arctic Club was warm and inviting!”", "Author": "Stilldiane", "ReviewID": "UR115878154", "Content": "We stayed in Seattle for three nights the second week of July. We choose Arctic Club over some other hotels we had researched and boy are we glad we did! Everything was great from the ability to get into our room early, the delicious warm cookies. Chipo, the Front Desk Clerk was very kind and helpful. She told us about some of the restaurants close by and how to use the transit which was across the street and down one level. The waterfront, Pike's Place were within walking distance. We would walk back and forth a few times a day from the hotel. We used the underground bus to get to the shopping area. The room itself was so nice I loved lobby/bar area. The rooms are decorated in an upscale 40s motif. It was a very romantic weekend and we will be back;)", "Date": "July 28, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "4", "Service": "4"}, "AuthorLocation": "Orlando", "Title": "“Perfect Stay”", "Author": "otownvagabond", "ReviewID": "UR115596626", "Content": "This hotel got it right. Wonderful historic building, interesting and tasteful decor, comfy beds, lots of extra little touches to meet your every need (like q-tips and cotton balls in the bathroom), plush robes, great location-it's exactly what I hope to find in a boutique hotel.", "Date": "July 20, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "4.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Seattle", "Title": "“Classy with a slightly creepy lobby”", "Author": "Lael_Lael", "ReviewID": "UR115452342", "Content": "I never quite got over the lobby walls plastered with early 20th Century black and white photographs of the solemn members of the social club that the building once housed (presumably the Arctic Club). Check in was a breeze and we were given delicious chocolate chip cookies and room keys that didn't quite work, but they noticed the mistake and delivered the correct keys before we had even turned around. Our room was on the lobby level and featured a huge loft space occupied by a bunch of duct work and such. The decor is classy, eclectic vaguely nautical reminiscent of the mens club the building once housed. The furnishings are mostly deco or revival style. I was very impressed with the ipod dock stereo system... possibly the most high tech hotel room I have encountered. The lobby bar has a pool table, although it's a bit difficult to play on. The location is excellent if you want to go to Pioneer Square but a little bit further South than most comparable hotels. We were less than thrilled with the miniature jacuzzi tub... but then I guess that's why it only cost $10 more for the upgrade! The mini bar isn't the weighted sensor kind, which is nice, and it has an actual physical key. The TVs are very nice and they offer relatively high quality (albeit pricey: $39.00 for noon to noon access) adult programming.", "Date": "July 17, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "5", "Overall": "4.0", "Value": "4", "Service": "5"}, "AuthorLocation": "Lumberton, Texas", "Title": "“Old Gentleman's club...loved the ambiance!”", "Author": "drenTexas", "ReviewID": "UR115299498", "Content": "Stayed at the Artic Club Seattle 1 night before our Alaskan cruise...had 3 rooms for 9 of us. Very interesting story of it being an old Gentlemen's club...loved the fireplace in the lobby with pool table and bar. The building is old but tastefully decorated. The elevators were very small but the room was very spacious and comfy..expecially the bed! Room service was prompt. You had to use the room key to operate the elevator to get to our room..added security. The staff were all very friendly and helpful. They arranged transportation for all 9 of us in a van to get to the pier. A few blocks from the wharf area, which we walked to and ate at Ivar's (best clam chowder I have ever eaten!). Would definitely stay there again!", "Date": "July 12, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Las Vegas NV", "Title": "“Great Stay Before a Cruise”", "Author": "lvcruzers", "ReviewID": "UR115102602", "Content": "We stayed only one night before our Alaska cruise. This was a wonderful hotel. The staff at the front desk were very friendly & tried to find us a room close to our friends. We had a queen size bed that was extremely comfortable. The location was right on 3rd Street, a great location. Seattle has a free bus system that runs right down 3rd Street. You can catch the bus to go on the Underground tour or catch the bus in the other direction to go to the Space Needle & Pikes Market. When we arrived we walked over one block & down to the water (3 blks) & caught the ferry to see Seattle at night. (Note: when the ferry drops you off at the island, it makes everyone get off. We had to wait about 30 min. to reboard the ferry for the return trip. Nothing is open on the island at night). We booked another hotel for our stay when our cruise was over & wished that we had rebooked this one. Only 2 very small complaints...1) We were there on the weekend so a lot of businesses were closed. They cater to the downtown crowd on the weekdays. We ended up eating at the hotel which had very good food. 2) We asked the front desk where a place to get a 6 pack of Diet Pepsi was. They sent us up a very steep hill about 8 - 10 blocks after our hike we looked down the street to the next block & there was a small store. We also found a Walgreens about 2 blocks away. This was an excellent hotel. We booked through AAA & paid $114.00. We would definately use this hotel again!", "Date": "July 6, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "3", "Service": "5"}, "AuthorLocation": "Greenville, South Carolina", "Title": "“Quick Stop on Way to China”", "Author": "duranfreak", "ReviewID": "UR114883238", "Content": "Loved it! I found it VERY convenient to get from airport to hotel and back from the light link rail. Pioneer stop is right across the street! $2.75/person and about 40 min. Nice and easy scenic ride. It was an easy walk from the hotel to the market and the monorail to get to the Space Needle. Hotel itself was quiet, clean, attractive and has a great staff. Our room was really nice. Very interesting hotel decor. Only negative - there was a \"gift basket\" on a coffee table filled w. snacks and a stuffed animal. Had a young child entered the room, he/she would assume it's free...we didn't have this problem, but I could see it happening to others. We had to leave our luggage with the bell staff coming and going due to our flight schedules--both young men were very helpful. We'd left something in our room at checkout. Hours later, they had it for us when we picked up our luggage. Their lobby has a bar and pool table, and best of all, a place to print boarding passes for free. The on-site restaurant was pretty good for breakfast. The in-room coffee set up is the best I've ever seen in a hotel. Again, great staff. Yes, I would stay here again and recommend it to anyone.", "Date": "June 29, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "4"}, "AuthorLocation": "New York City, New York", "Title": "“An all time favorite hotel”", "Author": "seawall77", "ReviewID": "UR114847638", "Content": "I *love* this hotel. With week after week of nice, but fairly generic hotel rooms, the Doubletree Arctic Club is a wonderful breath of fresh air. Housed in the old Arctic Club of the early 1900s, this place takes you to a wonderful different time. It's tough to describe, but I feel like I'm walking into an old hotel when it was brand new. The hotel is essentially brand new with a wonderful clubby 1910s city design. Give me an old fashioned and plunk me down in a big comfy couch in the stylish bar or let me unwind in the cozy room. Dark walls and beams, yet spacious and smartly lit. Hardly any shortcuts were taken in the design to make you feel like you're not in 2011...and that's a good thing. On my second stay, they upgraded me to a corner suite on the top floor w/ a balcony. Very nice. Staff was good to great, but not consistently wonderful. I forgave them this because of the wonderful design. The gym is wholly inadequate for a hotel of this caliber, and they should be ashamed of the tiny basement gym. Did breakfast at Juno, the restaurant, and it was decent. A little slow at times though. Nonetheless, I'd love to start out some northwest outdoors adventure with a luxurious couple of nights in Seattle at this hotel.", "Date": "June 28, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Kennewick, Washington, USA", "Title": "“Outstanding hotel in the heart of Seattle”", "Author": "CityEscapesPhoto", "ReviewID": "UR114226527", "Content": "Full of elegant charm and friendly, helpful staff, the DoubleTree Arctic Club Hotel is a welcoming place for the traveler to Seattle. Located close to the city’s center, the Arctic Club is within easy walking distance to many restaurants, museums, and Seattle’s famous Pike Place Market. The elegantly understated interior is designed to evoke the ambiance of early 20th century exploration and is replete with portraits of Arctic explorers, maps of the Northwest Passage, and stately chairs and tables reminiscent of the era. Just past the lobby is the Polar Bar, which perfectly exemplifies the hotel’s desire to provide luxury without taking itself too seriously. The Polar Bar, full of deep, comfortable chairs, cloth napkins and polished silver, has a drunken polar bear as its emblem. Our room, though small, was very well appointed. Many amenities were incorporated into the room, including some that we had never before seen in a hotel room. As well as such common things as a coffee maker, hair dryer and ice bucket, we found tea, a loose tea strainer, and a French press. In addition to the large flat screen television, there was a DVD player and a stereo system complete with CD player. The writing desk was stocked with such office basics as a stapler, scotch tape, scissors, rubber bands and a calculator – no need to go to the office center. Robes and a safe awaited us in the closet, as well as a large umbrella (this is Seattle, after all). The mini-bar was fully stocked with an array of beverages from champagne to sodas to fruit juices, and there was a basket of snacks that included an impressive array of choices. To their credit, the hotel made it clear that these items were not included in the cost of the room, but did so in an unobtrusive manner (again, their elegant understatement came through). Upon check-in, we were told that we could empty out the mini-bar to make room for anything that we might want to keep refrigerated, a welcome change from the old-style mini-bars that automatically charge you if anything inside is moved. The bathroom was surprisingly roomy, and was designed for comfort and class. The towels were plush and thick, the bathtub jetted. A marble countertop graced the vanity, which had ample storage underneath. The bathroom door was charming, and included a frosted pane in the upper half. This proved to be one of the very few drawbacks, as it allowed light to spill into the main room (only an issue when one of us was in bed before the other). The staff was extremely courteous and knowledgeable about the area. We were given many wonderful recommendations regarding everything from where to dine to modes of transportation to things to see and do. When they discovered that I was on a hunt for one particular item, the front desk staff took it upon themselves to call three different stores that they thought might carry it, and they checked with me upon my return to the hotel that evening to ensure that my quest had been successful. The housekeeping staff, too, was wonderfully warm, courteous and thorough; our room was kept in tip-top shape throughout our stay. Many small details were attended to that really distinguish this hotel as a top-notch place to stay: a hand-written note welcoming us to our room, a variety of teas (not just black, but green and herbal as well), warm cookies upon our arrival. Overall, we were quite impressed with this hotel, and we would definitely stay here again. City Escapes Nature Photography", "Date": "June 18, 2011"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Trenton, New Jersey", "Title": "“Goo Goo G'joob”", "Author": "porkroll", "ReviewID": "UR113746486", "Content": "Stayed here three nights in June. Lobby is gorgeous and the Polar Bar is a nice spot to have a cocktail (they have absinthe service). Rooms are on the smallish side but nicely furnished. Wife thought bathrooms were cute as heck. Had a room facing the rear and the HVAC system, which had a low murmur that was not disturbing but not pleasing to look at. Would request a street facing room, which may come with its own bus murmur. Loved the building, former Arctic Explorers Club with walrus tusk medallions adorning the exterior. Easy walking to Pioneer Square, which is a lively area with great histroic buildings and far from the skeezy district guidebooks make it out to be, to Pike Place Market, a tourist haven that lacks local flavor (except for the flying fish I suppose), and to Chinatown if your ideal breakfast is dim sum (Jade Garden) or pho (Pho Bac). Overall, a very good affordable stay (pre-booked the non-refundable rate online), though complimentary coffee in the morning would have been nice (restuarant downstairs does open at 6am as do a couple of nearby coffee places and a piroshky joint).", "Date": "June 15, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "4.0", "Value": "5", "Service": "4"}, "AuthorLocation": "Ontario", "Title": "“Steeped in history but with all the modern conveniences”", "Author": "sarahej", "ReviewID": "UR113479167", "Content": "We were pleasantly surprised by this chain hotel (Doubletree aka Hilton) that has lovingly restored the former Arctic Club of Seattle. It's a nice mix of modernity with historical touches including photos of the former club members in the foyer. The rooms are smallish but maybe seemed smaller because they have included too much furniture (desk, chair, ottoman, etc.). It's nice to be away from the epicenter of tourism at Pike Place Market and still be close enough with access to free transit right across the street. Front desk staff were helpful and the valets are very attentive. this hotel delivered on all points.", "Date": "June 14, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Chicago, Illinois", "Title": "“Like at home”", "Author": "vanagas", "ReviewID": "UR113478814", "Content": "Wonderful service! Special THANKS for Bartender Victor! What a personality and warm friendly welcome... After long business day it was something to look forward to :)", "Date": "June 14, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Richland, Washington", "Title": "“Unique, Vintage Experience”", "Author": "ThreeBells", "ReviewID": "UR113121510", "Content": "This hotel is located on 3rd and Cherry. It is in close proximity to walk to Pioneer Square, the waterfront for dining, Safeco Field and Qwest. The valet service was efficient and friendly. The rooms were extraordinary! The edifice was constructed in 1917 as a private gentleman's club and has an exquisite, original ballroom. The rooms were large and comfortable, much larger than most 4 star hotels. The staff was friendly and helpful.", "Date": "June 13, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "4.0", "Value": "5", "Service": "5"}, "AuthorLocation": "brockton, ma", "Title": "“CRUISE SHIP PIT STOP”", "Author": "Suzyd1964", "ReviewID": "UR111853610", "Content": "We stayed at the Doubletree Artic Club for one night prior to boarding an NCL cruise to Alaska. The location was great - we actually took the Light Rail from the Airport and it was very convenient. Walking Distance to Pike's Market, Downtown, etc. Staff was very friendly. Room was a little small - our bed took up almost the entire room. However, bathroom was great. Did miss having a bath tub but was not a big deal for one night. Only real downside was breakfast in the restaurant on Sunday morning. The room was definitely under staffed and it took forever to be served. Pricey for breakfast, although food was decent.", "Date": "June 6, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "huntsville", "Title": "“Anna Kim and her staff are outstanding”", "Author": "neilvictor", "ReviewID": "UR111496108", "Content": "This classic hotel, under the under the Doubletree flag is spotless with exceptional service. Although the rooms are small, not uncommon for a property built in the early 1900's, it has the amenities you come to expect from a hotel operated by Hilton. We had a great time in Seattle and this will be our hotel of choice when we return.", "Date": "June 4, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Pittsburgh, Pa.", "Title": "“Turn of the Century Charm”", "Author": "Nonna-Papa", "ReviewID": "UR110847832", "Content": "We stayed at the Arctic Club Hotel for three nights after a cruise. Immediately upon entering the hotel, we felt as though we could have been entering a gentleman's city club. The architecture, both inside and out, was a joy to view in contrast to today's bland buildings. Just past the reception and front desk area, where mens' starched collars and top hats were displayed in glass cases, was a large lobby containing numerous club chairs, ottomans, and sofas flanking an large wood paneled fireplace. A long, illuminated bar with fixed stools reminiscent of an elegant bygone era, was a centerpiece in the room. Our quiet, corner room didn't offer much of a view, other than the Columbia Tower building and the top of the hotel's glass ballroom dome, however the very comfortable couch and bed more than made up for the lack of scenery. The bathroom was very large for hotel standards, and after 26 days of cruise ship showers, I luxuriated in a tub once again. We found the hotel staff to be friendly and accommodating. The concierge took his time to make sure our interests in the city were pointed out and marked on a map he provided to us. As always, with Hilton hotels, internet is an additional cost, which I find very disappointing. I would recommend this hotel to anyone who wants to enjoy a taste of old time charm.", "Date": "May 31, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Sarasota, FL", "Title": "“Love this hotel...staff is AMAZING!”", "Author": "TheFiveOs", "ReviewID": "UR110276753", "Content": "We stayed at the Doubletree Artic Club when we were in Seattle for a wedding. We had reservations for five nights, but ended up staying only four due to missing a connecting flight. The staff there couldn't have been more wonderful, especially considering that we called late on what was supposed to be our night of arrival to tell them that we weren't going to make it. When we finally arrived the next day, they had a room ready for us around noon, which was three or four hours earlier than check in time, too. The front desk staff were just wonderful, and so friendly! They always had a smile, great attitude, and helpful advice. They were wonderful when we needed a cab due to a downpour, and even took our photo when we were waiting for the cab, in our wedding attire! The front desk always had apples (and cookies!) at the ready, too. The lobby and the rooms at the hotel were lovely. It was built in the early 1900's, and recently went through a historic renovation. The feel is kind of like a men's club, leather, rich fabric, and soft, comfy furniture. The bar is really nice, and serves food as well. There are comfy chairs and couches in the lobby, along with a fireplace. There was also a couple of computers with internet access, which was nice, as I didn't really want to pay for the wifi, since I was on vacation and tried not to go online!! Our room had a lovely, large bathroom with a beautiful marble topped vanity and a tub that was deep enough for a nice bath. The bed was super comfy, with nice, soft sheets and down bedding. We had no isses regulating the temperature, either. One day, we got back to our room in the early evening and realized that we'd accidentally left the \"Do Not Disturb\" sign on the door handle. When I called the front desk to ask for some fresh towels, they insisted it was no problem to send someone to come up and clean the room, which they did quickly and efficiently. One other great perk is the location. The light rail is literally right across the street, so it only cost a few dollars to go to the airport! We planned to do a lot of walking, and didn't want to rent a car. The hotel was 3 blocks from the water, and probably a ten minute walk from Pike's Place. Pioneer Square is about a five minute walk. The Space Needle, and the nicer shopping area (Nordstroms, Macy's, etc.) is probably a 15-20 minute walk from the hotel. For us, it was a great location! I would say that our stay ranks with stays we've had at Ritz Carlton's and other luxury hotels, with the cost considerably less, which is great! We were thrilled with the service, location, quality and accessibility. I can't recommend it highly enough...great place to stay!", "Date": "May 28, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Anaheim Hills, CA", "Title": "“Wonderful Stay & Staff”", "Author": "RockyRacoon058", "ReviewID": "UR110242784", "Content": "The staff was kind enough to find a room in the hotel in order to permit us to check-in early. This is something that is typically like pulling teeth. The staff called our room to make sure that we were comfortable and to see if there was anything we needed. The valet parking suggested that we park overnight on the side of the hotel for free, (no fee on Sunday), since my husband was not too keen on paying the $32.00 to park in the hotel parking garage. I am very picky and observant and found the room to be one of the cleanest I have ever stayed in. The bed was very comfortable, the room was quiet at night, we slept like babies. Love the decor in the room! For food, try the restaurant to the left of the hotel, if you are outside looking into the hotel. Great FRESH ham and cheese sandwiches. We had these for breakfast. They have others to choose from and I am sure that they are just as good. There is also a Subway just steps from the hotel to the left and of course a Starbucks just about any direction you turn. The closest Starbucks is to the right and up the street about a short block or two, (I think this street name was Cherry).", "Date": "May 28, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Downey, CA", "Title": "“SOMEWHERE IN TIME”", "Author": "Eddiesmom98", "ReviewID": "UR109839318", "Content": "The Arctic Club takes you back in time but with top notch 21st Century hospitality and customer service. As others have posted the building dates back to 1917 where it was once a Gentleman's Club. The decor throughout is of the 1930's/40's with the original crown moldings. The rooms have a masculine feel to them and are impeccably stylish. The connecting restaurant is Juno's where they serve breakfast, lunch and dinner, they also have a very nice well stocked bar however the Lobby Bar is the gem of the place. Viktor the bartender was great and full of information regarding the hotel. I would definitely recommend this hotel and am looking forward to returning again. I was on the 8th floor and heard no street traffic at all, the beds were spotless and so was the room and bathroom. Upon reading some of the other reviews regarding the Arctic Club it seemed they were speaking of another hotel. I found no negativity whatsoever in this hotel nor the restaurant. Most complaining on here possibly didn't express their concerns for a quiet room, more lighting, larger room, etc. prior to checking in but I'm sure if they would have made that known their request would have been taken care of.", "Date": "May 25, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Houston, Texas", "Title": "“Great hotel”", "Author": "GeriMc001", "ReviewID": "UR109108545", "Content": "This hotel is on the fringe of downtown Seattle, but we had a car and sights were easily reached. The staff was very efficient and friendly...great little restaurant and bar attached... our bartender, Melissa, was great as was her boss. Had a wine bar in lobby. Our room was a little noisy and the staff was ready to reassign us to another room. We declined and she then offered us earplugs. Great bathroom...comfortable bed, nice size room.", "Date": "May 20, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Murfreesboro, Tennessee", "Title": "“Great hotel”", "Author": "jandlthay", "ReviewID": "UR107717946", "Content": "We stayed one night at the Arctic Club and had a great time. Ate dinner at Juno and had drinks at the Polar Bar. Atmosphere in both was great. Food at Juno was pretty good but we can be discriminating - really nothing wrong with it. The hotel atmosphere is what really makes it - think old gentlemens club - scotch and cigars. The staff was friendly and eager to provide help and advice on local attractions. Highly recommend.", "Date": "May 10, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "3.0", "Value": "3", "Sleep Quality": "2", "Rooms": "4", "Location": "5"}, "AuthorLocation": "vancouver", "Title": "“bus traffic noise”", "Author": "fishman01", "ReviewID": "UR106978571", "Content": "A fantastic hotel in a building with lots of history in a great location, Easy access to downtown and a short distance to Safeco field. Unfortunally, planning to have a sleep past 5:30 in the morning? forget it. If your room happens to be facing 3rd street on the lower levels, the noise from the transit busses and their diesel engins will wake to up (3 rd street is a transit corridor for the am & pm rush hours and there is a constant flow of buses). Had problems with the TV with no reception which only worked once in a while. Staff are extremely helpful and always wanting to go that extra mile, great job to all. Parking is on the high side, close to $40 per night after all the taxes are included.", "Date": "May 5, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "3.0", "Value": "2", "Sleep Quality": "4", "Rooms": "2", "Location": "2"}, "AuthorLocation": "Knoxville, Tennessee", "Title": "“Good hotel but not close to anything...”", "Author": "elimtn", "ReviewID": "UR105333465", "Content": "This is a good hotel and the staff was great, but location is not convenient to anything really. If We go back we will stay closer to the Space Needle, which you MUST eat at the restaurant! No good views from any of the rooms. Also , Juno the restaurant downstairs is excellst.", "Date": "April 24, 2011"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "", "Title": "“In general, a pretty nice place”", "Author": "KuduLady", "ReviewID": "UR104560553", "Content": "My husband and I stayed at Arctic Club due to the convenient location and the reviews of the rooms and the Polar Bar. Loved: - Light rail and bus access with a stop right across the street. This made the trip to and from the airport a real bargain. - Easy walking distance to Safeco Field, Ferry Terminal, Pike Place Market and many other Seattle attractions. - General look and feel of the common areas and rooms Didn't Love: - The traffic noise. We reserved well in advance for a three night stay in a corner room and requested a high floor. Called again a couple days in advance to confirm high floor request. Went to check in early and were given 4th floor and told the hotel was sold out. After complaining a nice front desk person did switch us to the 5th floor but we were told that was the best they could do for our stay. - Rather indifferent service and only OK drinks in the Polar Bar. - Charging $9.95 for w-fi even in the common areas.", "Date": "April 18, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Vermont, USA", "Title": "“Wonderful hotel, exceptiopnal service and great location”", "Author": "riverhawk", "ReviewID": "UR102299352", "Content": "My husband and myself stayed at the arctic club for a week in March; a weekend convention with time added for seeing the sights. From the moment we checked in we knew this was going to be an excellent week! The Hotel is right on the main bus/light link line so getting back and forth to the convention center was a very easy and short bus ride. From SeaTac airport hop on the light link, get off at “Pioneer Square” the hotel is 30 steps from the top of the escalator, very convenient and very cheap! Our room was a bit small compared to some other rooms, but I chose the \"shower only\" less expensive room. The room was well equipped and my husband and myself did not find it to be too tight, but others may find it small. The bed was comfortable with very fluffy soft pillows, which I like, but there were other pillows in the closet and I am sure housekeeping would be happy to bring up firmer pillows. For morning coffee we headed 1 block up to the Columbia Tower to get Starbucks coffee and enjoy the amazing view from the 40-something floor. For $5 per person you can go up to the 70-something floor and enjoy a far better and cheaper view of the city and bay that you can get at the Space Needle. We spent our non conference days doing all the touristy sites (we bought a Seattle City Pass online before we went...highly recommended!) then headed back for happy hour at the polar Bar. Bar food (fish & chips, burgers, etc) is half off and there is a different drink every night offered at a reduced rate. Happy hour ends at 6 which was fine for us....up to our comfy room to relax. Viktor, the bartender was amazing; a true master of his trade with a wealth of knowledge and passion for not only what he does, but also where he does it. My husband indulged in a few varieties of Absinthe which Viktor makes in the traditional Czech style. Zenee, the other bartender was classy, friendly and a pleasure to be around, she always asked what we had done that day and if we had fun:) The front desk crew was amazing; from bringing us up cookies (complementary) to or room to making my husband a cup of espresso at 4 am while we waited for the cab to pick us up for our sad ride to the airport.", "Date": "March 31, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Falls Church, Va", "Title": "“Felt like I was at a Ritz or Fairmont”", "Author": "Nads82", "ReviewID": "UR101191091", "Content": "Wow - what an awesome hotel. From the historic feel of the building, the charming lobby, extremely welcoming and helpful staff, to the amazing quality rooms. I loved everything about this hotel. The in room amenities were amazing and added an extra level of luxury (e.g., robe, toiletries, tv, music system, dvd player, french press)Great location and perhaps one of the most unique Hilton hotels I have ever stayed in. I will always stay here when in Seattle.", "Date": "March 22, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "4", "Rooms": "5", "Location": "4"}, "AuthorLocation": "vermont", "Title": "“Very comfortable hotel in beautiful renovated historic building.”", "Author": "oldgreywolfVT", "ReviewID": "UR100695783", "Content": "I've now stayed here several times on business trips. Doubletree (Hilton) bought and renovated this century-old \"explorers' club\" in downtown Seattle, and it is truly beautiful. The lobby, lobby bar, restaurant, elevators and rooms all have their original dark wood paneling and \"Pacific Northwest\" decor and ambience. My rooms have alrways been surprisingly large and very comfortable. The hotel itself is very quiet, though you may get some minor street noise if you have a west-facing room. The food in the hotel restaurant (Juno) is very good, and the restaurant itself has a nice, relaxed atmosphere. The hotel staff has always been very helpful and pleasant. An added bonus - the Pioneer Square light rail station is across the street - $2.50 from hotel to airport (vs $35-40 for a cab).", "Date": "March 19, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Anchorage, Alaska", "Title": "“Great atmosphere, great location, excellent staff.”", "Author": "cgrotts", "ReviewID": "UR100200500", "Content": "The light rail from the airport drops you across the street from the Doubltree so this was perfect as we didn't rent a car. This location to the terminal was also perfect for getting around Seattle. We stayed a week and were treated very well be the friendly staff. The lounge was large and comfortable with an old time feeling with lots of wood accents and a large fireplace. The corner room with the king bed was large and very light due to the 5 windows. The refrigerator was well stocked but we had to ask to get it re-stocked. The whirlpool tub was large, clean and relaxing. We ate several times at the attached Juno restaurant and found the food very good, although slightly over priced. The location of the hotel is within walking distance of most all the attractions Seattle has to offer. I would definetly stay here again and recommend it to my friends.", "Date": "March 14, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "washington dc", "Title": "“Great place”", "Author": "emma1913", "ReviewID": "UR99339462", "Content": "The Arctic Club has made me rethink Doubletree's. This is a fantastic, distinctive place. The restoration of this old men's club was excellent. The rooms are very nice, with great beds, and the hotel has a super nice staff. The fantastic service really made our stay special. We went in and out of Seattle several times on this trip, and changed our arrangements to stay at this hotel each time we were in town. We'll make it our base whenever we are in Seattle. Great location, great people.", "Date": "March 8, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Tehachapi, California", "Title": "“Favourite historic hotel with all the comfort and sophistication of a modern high end hotel”", "Author": "fargovespa", "ReviewID": "UR98960141", "Content": "We have stayed here twice, and it is a lovely hotel, with beautiful interior. The staff are all professional and friendly. It is definitely worth checking this venue out. It makes a person feel back in the time period of a distinct sophistication.", "Date": "March 4, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Oakland, CA", "Title": "“Charming, Well Appointed Hotel in a Great Spot”", "Author": "ConnectingRoom19", "ReviewID": "UR95718986", "Content": "Stayed 3 nights for a long weekend and enjoyed just about every minute of it. Had read some reviews complaining about street noise... never had to deal with that in part because... Lisa at check-in was extremely helpful and really dedicated to quality service. She had already put us in a high floor room facing and set back from 4th Avenue which was about as quiet both internally and externally as any hotel room I've stayed in. The room was well appointed with practical and attractive vintage items rather than beautiful decorative pieces which are difficult or impractical to use. The television had several HD channels and was on a full swivel which made it pleasant to watch both in bed and in the armchair adjacent to the desk. The bathroom was large with a nice shower head and good sink/counter space. My only complaint about my stay would have been that it was a little dark in the shower even with all available bathroom lights turned on! I mentioned this to the front desk upon checking out of the hotel and was told they are looking into upgrading the bathroom lighting throughout the hotel and would send up the engineer to make sure it wasn't a structural problem specific to the room I had stayed in. Seattle's a great city and this is a wonderful hotel to stay in while you're there whether for business or pleasure. If you're inclined to have a cocktail you wont find a better bartender (Viktor) or happy hour than in the hotel's lobby (called Polar Bar).", "Date": "February 6, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "3", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Charlotte, North Carolina", "Title": "“Great Place!”", "Author": "dkseaverns", "ReviewID": "UR93893974", "Content": "I stayed here two years ago for my sisters wedding, they were nice enough to put us on the top floors! It's nice to have a smoking area when the place is non-smoking. Great atmosphere, great bar, and great for being on the free bus line section! I miss being there, and wish to come back again!", "Date": "January 20, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Portland, OR", "Title": "“Wonderful staff, great atmosphere”", "Author": "Gailfromhome", "ReviewID": "UR93290322", "Content": "I travel a lot, and it’s great to find a hotel as welcoming as this one. The downtown location is perfect, but the best thing was the outstanding staff. Everyone I encountered was welcoming and helpful, with what seemed to be genuine joie de vivre. The energetic young concierge deserves special credit for friendliness and helpfulness. My room was clean, large and filled with every comfort, updated in 21st century style while maintaining the atmosphere of the Edwardian gentleman’s club the hotel once was. I met a friend for dinner in the lobby by a pleasant fire -- the dishes from the downstairs restaurant and the lobby bar were both delicious, and the wait staff, again, outstanding. I will definitely make this my hotel when I come back to Seattle.", "Date": "January 16, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Atlanta, Georgia", "Title": "“Excellent Downtown Hotel with Great History”", "Author": "gtbrian22", "ReviewID": "UR91007025", "Content": "My wife and I stayed here for 3 nights and thoroughly enjoyed our stay. The bed was magnificent! The staff was very pleasant and the front doors were always opened for us by welcoming staff members. We were even given extra cookies upon request. The room was rather large and accommodating. We loved making coffee in our room using a French press. Our rooms were turned down thoroughly every morning. Very clean! Also, the location is within walking distance of Pike Place Market, several top-tier restaurants, coffee shops, and retail shops. Additionally, the Pioneer Square station on LINK light rail is only 50 yards away. This provides easy and inexpensive access from SeaTac airport. My wife and I loved the location and the decorative theme of the 1920s tycoon era. We highly recommend this hotel to any traveler desiring a centrally-located, well-staffed up-scale hotel.", "Date": "December 29, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Leduc", "Title": "“great stay”", "Author": "boo98", "ReviewID": "UR90946348", "Content": "We stay for 4 nights. It's a great hotel, the rooms were terrific, staff very friendly and helpful and loved the cookies. Would not hesitate to stay again or recommend it to anyone. Very central location close to everything you need or want!!", "Date": "December 28, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "3", "Location": "3", "Rooms": "4"}, "AuthorLocation": "Clarence, Ny", "Title": "“Nice stay.”", "Author": "BuffaloJohn007", "ReviewID": "UR90622076", "Content": "Stayed for 1 week on businesses. Nice hotel, parking expensive( your in a big city so it should be expected.) Cool lobby bar. breakfast staff was inconsistent, my meal was covered by hhonors so not sure of price. 15 minute walk to pike market. Would stay here again.", "Date": "December 24, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "3", "Sleep Quality": "4", "Rooms": "5", "Location": "4"}, "AuthorLocation": "New Jersey", "Title": "“Great Hotel with lots of History & Character”", "Author": "topgun151", "ReviewID": "UR89791931", "Content": "Character counts. Loved staying in this hotel. The history behind it is quite fascinating and you really get the feel you are a part of the old fraternal club while you are staying there. The rooms are comfortable and nicely designed so as to not lose that old fashioned charm. I highly recommend this hotel for all travelers, especially those in town for business.", "Date": "December 13, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Calgary, Canada", "Title": "“Nice find”", "Author": "gigiduru", "ReviewID": "UR89444525", "Content": "The hotel has been beautifully remodeled with friendly staff , Location a little out of the way for downtown shopping Our room was quite lovely, larger than I expected, and very comfortable. Nice bed and very nice bathroom. The hotel has a decent restaurant and a nice lobby bar. The only downside is that there are some homeless and beggars out at night.", "Date": "December 9, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Washington DC, District of Columbia", "Title": "“convenient to public transit, superior staff, clean/comfortable rooms”", "Author": "DLflier", "ReviewID": "UR89274555", "Content": "We chose this hotel primarily based on location, since we were planning to see a lot of areas downtown. It has a wonderfully unique old-fashioned explorer-type decor with a huge seating area past the lobby and a cool bar, and you can literally see the Pioneer Square station from the front door down 3rd Ave. We found it very convenient (you can take the Link from SEA airport directly to the Pioneer Square station, about 40 mins., then walk across up the street to the hotel). We also used the Link again to get from the hotel back to the airport. The staff was quick to help us with our bags up and down the stairs outside the lobby, and they were very friendly over the phone before we arrived and also during our stay. We were easily able to walk from here to Pike Street market and the waterfront, and the bus system was very good for getting to spots a little north of downtown since the hotel is inside the \"free ride\" area (e.g., Seattle Center). You definitely don't need to rent a car to get to/from the hotel with your bags, or around town. There is no Hilton Honors lounge, but the breakfast and service in the restaurant downstairs was very good and the vouchers were enough to get a very filling meal each morning. We had a balcony room with a sofa, nice TV, large bathroom w/ whirlpool, and a nice view from the balcony toward the stadium. I especially liked the pull out tray coffee/tea station that we used to make hot tea and French-pressed coffee each morning. The view out of the large windows is somewhat blocked by the surrounding buildings and the building facade, but from our balcony, you could still sneak a view of the Space Needle and see plenty of sky for the sunset, which we thought was really nice. There were also chairs on the balcony. The hotel wasn't crowded at all (we stayed over a long weekend), our floor was very quiet, and the management was kind enough to send us a bottle of wine when I mentioned that we were celebrating our wedding anniversary! We appreciated the gesture, and we'll be staying here again for sure on our next visit to Seattle.", "Date": "December 7, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Finland", "Title": "“A Lovely Experience, Exceeded Expectations”", "Author": "Suomessa", "ReviewID": "UR86995284", "Content": "This is just a beautiful hotel, completely different to the normal Hilton chain experience with its unique architecture and interior design. Having not traveled to the north-west before, I really liked the frontier feel of the furnishings and the sense of history. It turned a hum-drum business trip into a 5 star adventure. Service was generally very good, from check in to the ordering of taxis. The room + breakfast deal was a bit stingy but that is typical of the Hilton chain and there were enough good things to offset that small irritation. The room was not huge but it was well appointed. The bathroom was almost as big as the room itself and had a nice, old fashioned feel to it. In terms of location, it is about 10 minutes to Pike Market and a bunch of other stores like Maceys. It seemed like a good position, not too close to the crowds but close enough to walk without a big hassle. There is a really nice, spacious lobby bar as well, which looked like a great place to meet people before going out. Overall, staying here gave me a great first impression of Seattle and the staff made me feel very much at home. If I could have stayed longer, I would have and while the price was not super cheap, I thought it very fair for the quality of the hotel. I just hope the Hilton chain doesn't try to redesign it or turn it into another bland chain experience.", "Date": "November 14, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Gig Harbor, Washington", "Title": "“Beautiful- beware traffic noise”", "Author": "DisneyFan30", "ReviewID": "UR85797207", "Content": "Located in Pioneer Square, no self-parking. Lobby deco. in 1920's men's clubs/ climbing club. First rm. we were given was small and loud. Street noise is really bad, so ask for highest floor. There are huge floor to ceiling windows, great for people watchings (yes, the crazies-I wouldn't walk around after dark). Room's are very clean & have fun decor. Great plush towels, comfy pillows, sheets & duvets smelled freshly laundered. Very comfy bed- great nights sleep. Beautiful hotel, can't wait to stay again. The hotel room service from the hotel rest. \"Juno\" was horrible. It was salty, over-cooked, over-seasoned and over-priced. The famous chocolate chip cookie pudding, was raisin bread pudding. Not a single chocolate chip in it. Skip the room service & probably the rest. if it's any indication. It's a shame, such a lovely hotel should have better room service.", "Date": "November 2, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "3.0", "Value": "3", "Sleep Quality": "4", "Rooms": "2", "Location": "4"}, "AuthorLocation": "Atlanta, GA", "Title": "“Very small room; dim lighting”", "Author": "ats262m", "ReviewID": "UR85473549", "Content": "Extremely disappointed with the very small room, especially as a loyal (diamond) customer. Hardly room for 2 people to be comfortable. Lighting was very dim, I'm sure on purpose to provide old-style mood but was not practical either for reading, or for use in the bathroom. Everything else about the hotel was ok.", "Date": "October 31, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "3.0", "Value": "3", "Sleep Quality": "3", "Rooms": "4", "Location": "4"}, "AuthorLocation": "New Jersey", "Title": "“Nice hotel, but too much street noise”", "Author": "chirish61", "ReviewID": "UR84824482", "Content": "This is a beautiful hotel. it is a restored gentleman's club and they've managed to capture that vintage feel in the hotel and in the rooms as well. Beautiful architectural details throughout the building, the dome room on the 3rd floor was especially impressive. We stayed on the 3rd floor in a corner room. check in was a breeze, we arrived early from Vancouver on Amtrak and our room was ready. The room had 10 foot ceilings, lot of windows, beautiful bathroom, the only complaint I had about the room itself is it's too dim. I know it's in keeping with the atmosphere of the hotel, but I prefer a well lit room. Now to the street noise. Our room faced 3rd Ave on one side where buses ran all hours of the day and night, the bus stop was right under our window. we heard garbage trucks, recycling trucks, which all seemed to collect after 11pm at night. On our last night we were woken up about 4-5 times during the night from street noise. so although the beds and the room were very comfortable, our sleep was always interrupted. If you do stay here, ask for a room away from 3rd ave.", "Date": "October 25, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Baltimore", "Title": "“In a word...Fabulous!”", "Author": "Luv2GoBaltMD", "ReviewID": "UR84493929", "Content": "We were trying to avoid the typical hotel chains but based on the reviews and description decided to take a chance on the Doubletree Artic Club. We were not disappointed! Despite the \"Doubletree\" label, it felt more like a trendy, boutique hotel than a major chain. The classic, \"social club\" style came through in the unique architecture and elegant lobby. The walrus-theme added a fun element and the fireplace made it feel very cozy. The staff was warm and welcoming and checkin was quick & easy. Loved the chocolate chip cookies upon arrival! (We promptly made Starbucks coffee in the room with our french press to enjoy with our cookies. Nice touch!) We opted for a corner room which was totally worth the upgrade. We had windows all around and the room was lovely. The bed was incredibly comfortable and the whirlpool tub was a very nice addition. The only slight issue was the low lighting. Very romantic at night but not ideal for getting ready to go out. The entire staff was so helpful and friendly (especially Stephen who spent additional time with us making suggestions on restaurants and getting us familiarized with the area and public transportation options.) We had dinner our first night at the Polar Bar and it was one of our best meals of the trip! My husband also tried Absinthe for the first time. Interesting. We ordered room service for breakfast the day we left to save time and it was excellent as well. My only regret was not buying the stuffed walrus and more cookies to go. If we are ever back in Seattle, the Artic Club will definitely be our choice!", "Date": "October 22, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "England", "Title": "“luxurious rooms - best night's sleep in a hotel”", "Author": "carrotsarered", "ReviewID": "UR83798243", "Content": "We arrived in Seattle around ten in the morning - just off the Amtrak train from Chicago.The reception staff were efficient and friendly - checked us in straight away with no hassle and a warm cookie. I was feeling really grubby and desperate for a shower before we set off exploring the city. Our room was lovely - and although it was looking over a busy street we heard no noise. I thought the room was very spacious and well decorated like the rest of the hotel. We ate a meal in the restaurant in the evening and the food was good.I would definately recommnend this hotel to others and would stay again if I went back to Seattle. I loved the idea that the hotel had an interesting history.", "Date": "October 17, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "El Paso, Texas", "Title": "“More like a luxury Boutique hotel than a Doubletree”", "Author": "lfisgd746", "ReviewID": "UR82812696", "Content": "The Doubletree Arctic Club is not like a standard Doubletree AT ALL, it has a sumptious luxury boutique hotel feel. Not to mention it is on the National Register of Historic Places. As soon as you walk in you feel like you have stepped back in time, rich wood accents, and black and white framed photos greet you. Everything is elegant. Check-in was quick. We were using Hilton reward points for our stay and were upgraded to a top floor suite. The room was amazing! The bathroom was HUGE, complimented with marble countertop and tasteful tile work. The décor had a feel of contemporary and classic at the same time. The outdoor rooftop balcony was a nice extra. The bed was heaven! Our stay here more than pleasantly surprised us, HIGHLY recommend. The hotel is only three blocks from Pioneer Square, close to I-5 and roughly 20 minutes from the airport. For dinner, the Space Needle is touristy but worth the visit. The views are unbeatable especially if you go when you can watch the sunset. The food is very good and the wait staff extra attentive.", "Date": "October 10, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Manukau, New Zealand", "Title": "“Awesome rooms - unfortunately had a fire alarm malfunction”", "Author": "CookieM0nster", "ReviewID": "UR82542417", "Content": "I booked 2 rooms via Hotwire, and then phoned Doubletree to arrange specific room types. The staff was very pleasant and efficient, and arranged exactly what I needed with adjoining rooms. Check in was easy – although the one way streets of downtown meant we missed the valet parking on our first pass. The lobby/lounge is very stylish and clean, but seemed a bit too dark for me. The rooms are awesome, and quite large and very clean – except we found an empty water bottle from the previous guests under the window. Location is very handy to restaurants, subway, and a short walk to Pikes Market, Pioneer Square. Unfortunately, the fire alarm malfunctioned at 7:30am – which made us start our day a little earlier than we'd planned on. But the front desk was so understanding, she cleared our valet parking charge for the inconvenience. The front desk clerk even asked the bellhop to show us the Dome Room, to help brighten our 'early' morning. It did the trick. One of the most awesome function rooms I've even seen in a hotel. All in all, and great stay. Highly recommend.", "Date": "October 8, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Portland, Oregon", "Title": "“Beautifully updates to a classic property with great service and super comfy beds”", "Author": "nutmeg8629", "ReviewID": "UR82066192", "Content": "I really can't say enough about the beds. That may have been the most comfortable bed I've slept in. The hotel itself is gorgeous and sends you back to early 20th century. The renovations were done spectaculary, loosing none of it's charm. The staff were all expetionally friendly and helpful. I was a bit concerned by the most recent review before mine indicating a problem with bed bugs and so I thoroughly inspected our room before settling in and the only thing I found was an incredibly clean room. Honestly I tore up the bed, checking everywhere for the tell tale signs and found nothing. We slept wonderfully and had no bites anywhere.", "Date": "October 4, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "1", "Overall": "2.0", "Value": "4", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Minneapolis, Minnesota", "Title": "“Great Vibe,Bed Bugs!”", "Author": "dgalles", "ReviewID": "UR81545346", "Content": "I couldn't say enough cool things about this place until I came home with bites all over my face.", "Date": "September 29, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "4", "Overall": "2.0", "Value": "2", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "", "Title": "“Nice hotel, but terrible customer service. Wouldn't stay here again.”", "Author": "stp234", "ReviewID": "UR81424811", "Content": "The front desk staff at the hotel were extremely unfriendly and unwelcoming. The hotel is in a great location, nice, clean rooms, but for the price I expected decent customer service. It was obvious that the staff didn't want to deal with customers - from check in, to later when we asked for directions to a nearby restaurant. No breakfast, no cookies, nothing offered for free. They definitely did not live up to Hilton standards. We stayed at a Hampton in Oregon, on our way to Seattle, and the experience was the opposite - extremely friendly, welcoming staff.....WITH breakfast, for a much lower price.", "Date": "September 29, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "4", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Winchester, United Kingdom", "Title": "“Gentleman's club style with great rooms”", "Author": "daveandann1010", "ReviewID": "UR81232982", "Content": "Lovely hotel - great staff, lovely room (well - we got upgraded to a suite, though the room we had before the upgrade was pretty darn good!) - really great location - easy walk to centre of Seattle / ferry / pioneer square; super easy free bus service using the Seattle bus tunnels to wherever you wanted. $2.70 to/from the airport on the new light rail service - drops you off at Pioneer station (3rd and James is the exit you want) - maybe a whole 30 feet from the door of the hotel. Video on demand for a couple of nights in watching a movie. We stayed 13 nights... Restaurant on the ground floor a bit pricey for what it was, but there's plenty of better places to eat in Seattle. Would we stay again? Heck yes!", "Date": "September 27, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "4", "Overall": "2.0", "Value": "1", "Sleep Quality": "4", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Hawaii", "Title": "“Never again will I stay at a Doubletree Hotel”", "Author": "theHawaiians", "ReviewID": "UR80742845", "Content": "We have always stayed at a Doubletree hotel no matter where the location. It is always where I search for when we start researching destination. After this experience NEVER AGAIN. Upon check in we were informed that our reservation was cancelled due to not showing up on time. I had called a day in advance to inform them that we would be arriving the next morning but had booked an extra day so that our room would be ready upon arrival. We were placed in a temporary room until our room was ready. For inconveniencing us they gave a certificate for a dinner for 2 at Juno. The restaurant below. It was AWFUL. Food was bad and found a hair in the bread. Not just dropped in but actually baked in the bread. Ok so we had perfect weather and \"Seattle was great. We thought everything was good..until I got home. I prepaid for a discounted room rate prior to leaving for Seatlle. Well I guess with the mess up in cancelling our reservation they also charged us again for our stay. I called to have Hilton reverse the charges and they had informed me that they already did and that the location was responsible for the error. The hotel had charged the card that I had used to book the reservation and credited the card that I had used upon check in for incidentals. Upon receipt of my credit card bill I see that they had a field day with my credit card. Charging over $2500 ...I called them once again. They stated even though they had erroneously charged my credit card numerous amounts of time they ultimately gave me the correct credit. So tough luck for me.", "Date": "September 23, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Wisconsin", "Title": "“Wonderful Classic Hotel”", "Author": "Muskydoc", "ReviewID": "UR79945342", "Content": "We had a wonderful stay at the Arctic Club over the Labor Day weekend. It has the charm of an older hotel, but up to date in all the room and bath facilities. We had a room on the six floor which was comfortable and quiet. The bed was great. A/C kicked in and out a lot, but once I figured out how to have the fan stay on low it was better. The front desk staff were great with directions and any help needed and always offered up more of those tasty cookies! Housekeepers were great. Forgot our coffee a couple times, but were there immediately when called. Hotel is great for catching any of the mass transit vehicles and also a nice walk to the Market. Check out the ballroom even if you don't have an event there. We have no regrets and would stay again when we are in the area.", "Date": "September 17, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Wylie, TX", "Title": "“Great Location”", "Author": "KLBWylie_TX", "ReviewID": "UR79896229", "Content": "I have never been to Seattle, but my husband and I were cruising to Alaska and chose the Arctic Club because it is in the Hilton Family (Diamond members), had good reviews and seemed a good location to downtown. We stayed pre (one night) and post (2 nights) cruise. Lobby with bar is lovely and quiet place to relax. The room we were given for the pre-cuise night was on the 6th floor and very, very, very small. You really can't turn around in this room. However, we were okay with it because we were only staying one night. The room is beautiful with all new bedding (wonderfully comfortable), two tall windows (no view), dark chocolate crown moldings and a dresser with built-in refrigerator and coffee/tea bar. The desk is fitted with business traveler needs (pens, paper, highlighter, stapler). The bathroom is quite nice with hairdryer, make up mirror and small bottles of shampoo, conditioner, mouthwash and body lotion. We had breakfast in Juno which was very good, but expensive ($43 for two). The waitress seemed like she just woke up and never really seemed like she wanted to be there. We took a three hour bus tour around Seattle that I highly recommend provided by Tours Northwest. The hotel also has a car service on hand that we used for travel back and forth from the airport and Pier 91. Cale Car Service is very reasonably priced, and offers personal service. After a week cruise, we arrived back at the Arctic Club and this time we had a room on the 9th floor. Atleast twice as large as the first room with a seating lounge area. The room was outfitted the same as smaller room. I would not want to stay at this hotel if the smaller room was the only one available. Front desk and Conceirge (Stephen) were very helpful during our stays. Hotel is within walking distance to downtown and waterfront (Ask front desk for a great map). We enjoyed the walks and felt very safe on any street. Several coffee shops, restaurants and sandwich shops on every corner. I couldn't resist a bundle of flowers for only $10 at Pike's Market even though I could only enjoy them for three days. The hotel kindly provided a vase which I left for the hotel staff to enjoy upon our departure.", "Date": "September 17, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "3", "Sleep Quality": "4", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Alesund", "Title": "“Nice one off hotel - location good for airport and town”", "Author": "soundofmusicfan", "ReviewID": "UR79588004", "Content": "This hotel was a great choice for us. It is literally 2 minutes from the station for the train to the airport, which was very handy. It is not far out of town but I did not enjoy the number of homeless people heading away from town - so make sure you head towards the city centre and not towards the international district if you are walking around. Its very handy for Pioneer Square and the Underground tour though. The rooms are nice and big and you get a chocolate chip cookie when you arrive - which i appreciated as it was 8 am and my room was ready - hurray! The bathrooms are not very big but they are very nicely decorated. Most channels on the tv don't seem to work but there is a dvd player and a cd player with ipod dock.", "Date": "September 15, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "1"}, "AuthorLocation": "Newtown, Pennsylvania", "Title": "“Horrible”", "Author": "RHinBucksCounty", "ReviewID": "UR79573510", "Content": "This hotel was so bad we never checked in! We were shown 3 different rooms and all were small and had an odor! The bellman however was absolutely the greatest and tried his best to please us without success. He called us a cab and we went to the Fairmont.", "Date": "September 14, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Alexandria, Virginia", "Title": "“Wonderful Historic Hotel, Excellent Staff”", "Author": "JulieLoves2Travel", "ReviewID": "UR78273282", "Content": "While I read a few poor comments on Trip Advisor about this facility, I was leary, but it was close to the train station and we had an early train to catch to Vancouver for our cruise, so we went ahead. We arrived early morning; having come from the east coast and while the room was not ready they welcomed us, processed the paperwork, took all our luggage, including laptop, provided directions and how to get around and said they would call once the room was ready. Everything worked as planned, we had a great mini adventure in Seattle, went to the space needle and then they called and said the room was ready. Great room, amazing historic hotel, fantastic staff, great bed. Very pleased, would definitely stay here again even though it is somewhat of a distance from the hustle and buslte of the downtown Seattle happenings.", "Date": "September 4, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "aurorio", "Title": "“Coolest hotel ever!”", "Author": "aurorio", "ReviewID": "UR77918070", "Content": "I saw this hotel on a previous trip to Seattle and I knew immediately I wanted to stay there. The old walrus carvings on the building are the first thing that catch your attention. The lobby is gorgeous, full of old photos of members of the original Arctic Club. Staff is mega-friendly and check-in was super easy (the warm cookies are a nice bonus). My room was huge, beautiful, and comfortable. The furnishings are new and elegant, but designed to fit in nicely with the early 20th century vibe. The art on the walls were beautiful sepia prints of Pacific Northwest native people. All together, a very cool, old school vibe. Even the bathroom has some nice, old fashioned touches, coupled with pristine modern fixtures. It was one of the cleanest hotels I've ever been in. Also, the hotel provided a car for my ride to the train station the next day, free of charge. A nice, unexpected bonus!", "Date": "September 2, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "2", "Sleep Quality": "5", "Rooms": "1", "Location": "3"}, "AuthorLocation": "California", "Title": "“Waaaay Overrated”", "Author": "rj123456", "ReviewID": "UR77721810", "Content": "I chose this hotel over the Hilton on 6th Avenue based primarily on the ratings on this site. I don't know what I missed at the Hilton but this hotel is either riding on its past laurels or other reviewers have been smoking something. First off, the service was INDIFFERENT. We called in the morning of our arrival requesting an early check-in and the answer was \"well, you know we don't guarantee this sort of thing, just show up and see\". We got there around 1pm and there was no one at the door except for wedding photographer taking shots of the groom on the elegant but steep 19th century marble steps at the Cherry Street entrance. No one to help with the luggage nor any signs to suggest the friendlier alternative ground level entrance around the corner on 3rd Avenue. At check-in we did get the customary Doubletree cookies were promptly asked to wait pending a phone call. We chose to camp out in the totally deserted lobby. At least it was dark and cool (on a rare warm sunny Seattle day). At about 3:10 (so much for early check-in, even the \"official\" check in time was 3:00pm) having received no phone call, I stepped up to the desk and was checked in without fuss. Ok, not a big deal but certainly not the service level I expected after the ratings on this site. The hotel room itself was ridiculously small, I'm guess it is no more than 10'x10'. One half of the dresser stayed locked (I suspected it was a minibar and I didn't want to bother running a perpetual argument with our 9 year old, so I didn't bother to ask). The other half had drawers which could not be opened if you had the drop top down for the coffee center on top. I don't think I've stayed in a smaller room in Manhattan. Our room in particular had two large double-hung windows, except unfortunately, the room was located facing a notch in the building footprint so the view was that of a blank wall. The bed linens were outstanding, especially the down pillows. The modern double-paned windows, excellent climate control, and an interior location on a high floor on a weekend downtown meant that sleep quality was outstanding. The bathroom on the other hand was very spacious, tastefully decorated, and was better situated so we had (partial) views of the Seattle public library which is two blocks north. The mosaic tile floor and the marble vanity were nice touches. I understand the need to conserve water and most hotels in this class have adjustable heads that trade off water flow and pressure. However, this shower was one of those \"rain bath\" affairs - about a 8\" wide head with acceptable water volume but not enough pressure and no adjustments. In terms of location it IS very convenient to the transit tunnel but compared to other downtown Seattle hotels, that is about the ONLY advantage. This part of downtown has nothing next to it other than the City Hall and the County Courthouse and a huge empty block - presumably something interesting will eventually fill that space. But most of the shopping and touristy attractions are up further north towards the Westlake center area, or south towards Pioneer Square (which is not far). We did not use the fitness center but there is no swimming pool, which is not uncommon for older hotels of this vintage. On Sunday night there was nothing open close by for dinner so we had to take the bus uptown (which is NOT free after 7pm). On Monday we found a decent Thai place on Second Avenue - great prices after all $25-$30 per person places over the weekend. I would also recommend the Vietnamese sandwich shop whose name escapes me now but is near 2nd and James, NOT the one on Cherry & 3rd which is twice as expensive. Pick up a couple of banh mi (Vietnamese sandwiches) - we had the grilled pork and the chicken and they were both very good and a steal at $2.75. They did give us a late check out (till 2pm) without fuss and stored our bags till we took the train to the airport in the evening. All in all an unobtrusive hotel, nothing really wrong about it but I am giving it fewer points to balance what I perceive is an overrated rating but other reviewers.", "Date": "August 31, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "dungarvan", "Title": "“no problems would love to go back”", "Author": "hourigan1", "ReviewID": "UR77249656", "Content": "We stayed in this hotel for 3 nights in early august. Initial thoughts were that it was unusual but my teenage son thought it was cute. very clean, staff at reception were brilliant and very helpful. When we visit a city , we usually like a clean , handy , fairly well located hotel as we tend to spend very little time in the hotel. So a reasonably priced hotel is what we look for. Doubletree fits our criteria and i have no difficulty in recommending it. If we are ever back in Seattle from Ireland we will staying in the Doubletree. One lovely young tall girl at reception , never got her name, but she was so helpful to us.", "Date": "August 28, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "3.0", "Value": "2", "Sleep Quality": "1", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Melbourne, Australia", "Title": "“Disappointing!”", "Author": "Sal056", "ReviewID": "UR76583810", "Content": "We booked this hotel well in advance based on reviews for 5 nights as we were attending a wedding in Seattle. We found ourselves with an extra night in Seattle and couldnt add a night as they were full so we booked another hotel The Monaco. This proved to be a mistake as after one night there we were so disappointed in the Arctic Club. This hotel is a Hilton Hotel which I have found over the years to be a disappointing chain all round! We arrived to find that outside the front the building across the road had had a fire so there were massive generators going 24 hours a day making an incredible noise - while this was not the fault of the hotel we felt that given the noise we should have been allowed a refund and to move but this wasnt an option. We were given a room out the back to try and get a room that wasnt noisy - the room looked over a back parking lot and the airconditioning unit so it was nearly as noisy as being at the front. As we were there for 5 days this was really disappointing in a pretty city like Seattle. The hotel is situated on the border of new downtown and old downtown which is not bad and there are free buses covering the downtown area. The decor is based on the hotel once being an exclusive club for men in the early 1900's. It is dark and dour and victorian and seems to consist mainly of dull photos of men dressed in suites plastering all the walls. The restuaurant has a limited menu and was expensive. The room was small and dull and as I said had NO aspect. We did get a call about the room asking was it ok but no offer was made to move us somewhere better or upgrade us. Also there was no free wifi in the rooms which we had come to expect as every other hotel we stayed in it was free!", "Date": "August 24, 2010"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Overall": "3.0", "Value": "2", "Sleep Quality": "3", "Rooms": "2", "Location": "3"}, "AuthorLocation": "Richmond VA", "Title": "“Nice but some problems”", "Author": "Walt55", "ReviewID": "UR75941909", "Content": "Stayed 3 nights. Nice to have Pioneer Square light rail/bus tunnel across the street. But very small room by Seattle standards, considering the price. Front desk service fine, but the people servicing the room leave something to be desired. This place has French press coffee pots in room, a nice touch, but one day ours was missing altogether. The sink drained very slowly, we left a note and it was better but not great afterwards. Other details were not consistently attended to. And although it didnt affect us, on the 3d avenue side of the hotel there are a couple 24-hour generators or HVAC systems mounted on trucks that run all night --definitely inquire about them! We had no view, but that was better than all-night generators droning out the window! Also stayed at the Renaissance & Westin on same trip, each was better and about the same price. Skip the downstairs restaurant for breakfast and go next door to Piroshki on 3d.", "Date": "August 19, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Denver, CO", "Title": "“Delightful Hotel and Amazing Staff”", "Author": "piston11", "ReviewID": "UR75830739", "Content": "We arrived at the Arctic Club Hotel a little before check-in time and were greeted with a smile. One of the two rooms was not ready so we left the luggage in the other room and went out to explore the town. The front desk was nice enough to call us when the second room was ready. We loved the little details at the hotel like the walrus room numbers, the absolutely beautiful ballroom, the explorer decorations, the free internet and printing, and the warm cookies. We couldn't resist lounging in the bar area and partaking in the fancy-schmancy drink of the day. Our bartender made a champagne, vodka, chambord concoction that was delicious! A week after our stay, when we came back from our Alaskan cruise, we wanted to walk around Seattle, and the hotel staff were nice enough to let us keep our luggage in the hotel until we had to leave for the airport.", "Date": "August 18, 2010"}, {"Ratings": {"Service": "2", "Cleanliness": "5", "Overall": "3.0", "Value": "3", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "USA", "Title": "“Rather disappointing service.”", "Author": "Nannarpite", "ReviewID": "UR75543667", "Content": "Stayed here last weekend with my husband who is a HiltonHonors Gold member. We could have stayed at the Hilton and received a better rate but, after reading the reviews and looking at the photos, I really wanted to stay here. We got to the hotel earlier than check-in time (our flight arrived at noon, so it couldn't be helped) and were told that no rooms were available because check-out was 1pm (not true). We decided to leave and go for lunch, so the gentleman checking us in took our number and said he'd call when our room was ready (he did not). He did, however, stop to answer the phone while we were in the middle of talking with him. When we returned our room had apparently just become available. As a gold member, upgrades are given based on availability, but when my husband asked about this he was told the hotel was full and there were no upgrade available (we later found out that this was also not true). We were assigned a very nice room, but it was located right by the elevators on the 3rd floor and overlooked a stretch of 3rd Ave which was undergoing some type of construction. We were too tired to go back down to the front desk to ask to switch, and also did not realise till later that we had not been offered any of the gold perks (free breakfast, wifi, or points), and we didn't even get a cookie!!! The horror!! When we later inquired breakfast, Jackie at the front desk was very apologetic and actually mentioned that our reservation indicated that this option had not been offered to us. Overall, the Arctic Club is very nice. The decor is much more inviting than that of a traditional hotel and it is conveniently located beside the Pioneer Square light rail station. This is great for getting to and from the airport. The breakfast at 'Juno' was also very good, as too was the service from everyone else we encountered after we checked-in.", "Date": "August 16, 2010"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Chicago", "Title": "“Fun Place”", "Author": "afineguy", "ReviewID": "UR74121930", "Content": "This is not your normal Doubletree. It is an old club and has some cool quirks. My room was really small, not sure if an upgrade was possible as Gold VIP. The bathroom and closet were very large. It had a great bed and TV and an explorer theme that was fun. Location near Pioneer Square is nice. Staff was friendly and helpfuI and would stay here again.", "Date": "August 7, 2010"}, {"Ratings": {"Service": "2", "Cleanliness": "2", "Overall": "2.0", "Value": "3", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Las Vegas, Nevada", "Title": "“Once great hotel declines in quality”", "Author": "KenMundt", "ReviewID": "UR73948537", "Content": "I travel to Seattle on business one week a month. Until May of 2010 the Doubletree Arctic Club Hotel was my favorite place to stay and an excellent value. I like the location, which is in easy walking distance of both the financial and shopping districts. The check in experiance is always good and the front desk always very helpful. However, over the past three months both the restuarant (Juno) and the housekeeping have deteriorated. The restaurant service and food quality, especially room service, is now haphazard at best. Housekeeping has missed my room completely once in July and twice (so far) in August. I have had two occasions when the typical amenities (soap, shampoo etc) have not been in the room when I checked in and two more where they were not restocked after use. This is probably not a problem if you are staying for a couple of days but when you are trying to get ready in the morning and discover you have no soap, washclothes, towels or bathmats it is more than a little troubling. There is also an increasing amount of deferred maintainence at the property, mostly stained carpets, balky card readers in the elevators and things like that. When I have stayed at the hotel before this month I was able to enjoy HBO but that channel is now gone and several others are also gone. All in all this hotel has the appearence of a change in management and some severe cost cutting measures. Where I would have recommended this hotel without hesitation three months ago I now have to say \"proceed with caution\".", "Date": "August 5, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Iowa", "Title": "“Excellent Service--Great Stay”", "Author": "CAR50", "ReviewID": "UR73491646", "Content": "We arrived in Seattle via Amtrak and went to our hotel around 11 a.m. (About a six block walk from King Street Station). Our room was not ready yet, but they took my phone number and said they would call when our room was ready and would store our bags. Well, at around 12:15, they called and said we could check in. Our check-in procedure was very smooth and pleasant. The chocolate chip cookies hit the spot since we had not had lunch yet. Our bags were then delivered to our room. Since we did not have a car, the hotel was very convenient to Pioneer Square (about 3 blocks), the water front (about 6 blocks) and the transit tunnel (across the street). With the transit tunnel and the monorail, the Seattle Center (Space Needle area) was very convenient also. The room was a little smaller than I thought it would be, but was very quiet and the bed slept great. The overall service from all the employees we encountered was very professional and friendly. Definitely a very pleasant and relaxing stay. By the way, don't miss the view from the Columbia Tower (1 block from the hotel). Twice as high as the Space Needle and much, much cheaper.", "Date": "August 2, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Vancouver, Canada", "Title": "“EXCELLENT staff and slept like a baby”", "Author": "VancouverValleyGrl", "ReviewID": "UR72664369", "Content": "Wonderful, historical hotel close to many attractions. L-shaped room was nice, beds were very comfortable, bathroom was spacious and floor tile was beautiful, hotel staff was exemplary (front desk and valet). Only downfalls: our view was of a construction site across Cherry Street, no swimming pool, shower only (no tub).", "Date": "July 28, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "5", "Location": "4"}, "AuthorLocation": "orange county, CA", "Title": "“Classy, comfortable”", "Author": "pickyguest", "ReviewID": "UR71981163", "Content": "My husband was here on business, and my son and I tagged along. I picked this hotel after reading several reviews here, and they were quite helpful. This is a lovely old hotel with beautiful historic decor and early 1900's charm. Rich woods, intricate architectural details, a comfy, quiet lobby with a fireplace and pool table (though my son was bummed he couldn't play because it was technically in the bar.) Very comfy beds, room and bathroom. No bath but a generous shower. Nice view of Smith Tower and the port beyond from our 8th story room. Yes it's noisy in the area, it's in the business district and all the buses come by on Third St., but Seattle is an urban city. Things do close up early in this area of town, and it gets quiet early. Lots of restaurants in walking distance and quite possibly, the coolest toy store we've ever found, Magic Mouse, down on First. (Also, a high concentration of homeless, but we felt mostly safe.) It's a healthy walk to Pike Market, but very doable. Ferries are very close by, as is a light rail station entrance. Even the food at the hotel restaurant Juno was good, which is why we were a little baffled at how empty it was. Oh well, a lovely albeit too short stay.", "Date": "July 23, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "3", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Chicago", "Title": "“Enjoyable stay…but pricey.”", "Author": "gonezen", "ReviewID": "UR71397984", "Content": "My wife and I stayed here earlier in the week for our last night of a week traveling in Washington State. It was a great ending of a great trip for us. We're big Seattle fans anyway and I really prefer hotels with some history so the Arctic Club had a head start before we arrived. When we did arrive everyone was friendly and we got a very warm and personable welcome by the front desk, concierge and car parker. We were shown quickly to our large room which was upgraded for Diamond status. The hotel oozes history of that Northwest and Alaska variety. Yes, it's a bit dark, lobby and room, with varnished wood and sepia photographs of the original Arctic Club members. I call it atmosphere. We loved the walrus icons everywhere and only wish there was a line of logo'd items for purchase in the lobby. That walrus and Arctic logo would look good on a t-shirt or polo. The bathroom is great and has that last century feeling to it except for the jetted tub. Comp breakfast the next morning was great, service speedy and friendly. A stay here is pricey though. Our room with one night and parking came to nearly $300 once the local taxes are added on. That's a bit dear for us so I wouldn't make a long stay here unless I was on the company's dollar. But for a one night stand the Arctic Club was great and recommended if you like a clubby, historic feeling to your hotels. A complaint: why do some hotels persist charging for internet when you can stop into any Starbucks and use it for free?", "Date": "July 18, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "5.0", "Value": "2", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Sacramento, CA", "Title": "“Grand Elegance”", "Author": "Elfinize", "ReviewID": "UR71036299", "Content": "The feeling when you step into the lobby of this gorgeous hotel, is one of bygone luxury and elegance. The atmosphere is subdued and dark, but in keeping with the era, and the appointments are rich and lavish. We were warmly greeted. My sole complaint is that the room was a little over the top in price per night even given the amenities. The lobby is graced with a fireplace, reading retreats, a free pool table, a beautiful wood bar and an efficient bartender who creates great concoctions from the past and present. The rooms were elegantly appointed but the baths were dated, and there were no fans to clear steam.", "Date": "July 15, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Sleep Quality": "4", "Rooms": "3", "Location": "4"}, "AuthorLocation": "New York, NY", "Title": "“NIce historic hotel --- but extras left and right so be careful....”", "Author": "NewYorkNYTraveler", "ReviewID": "UR70955863", "Content": "Definitely historic-- if you like historic, you'll like this hotel but if you want modern, sleek, choose another spot. Very clean, huge bathroom. Rooms, halls could use some additional lighting. Also, the hotel charges for the internet, as well as for watching mostly everything on the TV except for some regular TV channels --- around $14- for a movie!!! Staff was quite solicitious--a definite plus.", "Date": "July 14, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "US", "Title": "“Nice updated older property”", "Author": "jlabsher", "ReviewID": "UR70022700", "Content": "Hotel is quite nice but older so the rooms are small, good central location about 5 blocks from Pioneer Square and Pike Place Market, however not too much in the way of restaurants/drinking near hotel. Lobby bar is exceptional for a Doubletree property, however Juno restaurant downstairs isn't the best - took us 45 minutes for breakfast one day and 30 minutes the next for just bagels. Hotel is 1/2 block from light rail station to airport.", "Date": "July 7, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Suburban Philadelphia", "Title": "“Where the \"old boys' club\" used to meet...”", "Author": "CodgersontheMove", "ReviewID": "UR69939919", "Content": "A wonderful old hotel, which has undergone an extensive renovation, is located centrally to shops, restaurants, etc. The rooms are a bit on the cozy side, but are, nonetheless, very nice indeed. The bathroom is a work of art, bringing back memories of days gone by. The hotel staff were very accommodating and helpful. Seattle suffered record heat (104 degrees) while we were there, but we enjoyed the stay anyway, in part because of this small botique hotel.", "Date": "July 6, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Detroit MI", "Title": "“Fun place!”", "Author": "Andrew_Jameson", "ReviewID": "UR68077791", "Content": "A fun hotel; it's been recently renovated, and you can get a sense of the history from the decorations in the common areas. Our room was very nicely laid out, with a large bathroom.", "Date": "June 20, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "", "Title": "“Wonderful hotel”", "Author": "tartertwo", "ReviewID": "UR67902824", "Content": "We were traveling on an Alaskan cruise and decided to spend a few nights before the cruise, I booked this hotel way in advance in it was a great deal. The hotel staff was very friendly and accomodating, the concierge, was very knowledgable and helpful with everything. This is an older hotel with alot of charm. but clean and upgraded. We truly enjoyed our stay. It was a little bit of a walk to the sites, but not too far (and I am not a walker) there is a pool table down stairs and quiet lounge just beautiful and inviting (with a fire place and everything!) I would highly recomend this hotel!", "Date": "June 18, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Chelmsford", "Title": "“A gem in Seattle”", "Author": "UKSnowbird", "ReviewID": "UR66993102", "Content": "We booked for 2 nights here before a cruise and can say the stay was very pleasant. We had requested a top floor room and this we had - no problems with traffic noise. The view was of the adjacent high buildings - yes you could see the carpark but the awesome buildings made up for that! The bed was huge - linen perfect and pillows made for a truly comfortable nights sleep. The jetted bath was welcome at the end of a long day walking/sightseeing in Seattle. The room was quite dark but this is the character of the room and it really seemed comfortable and cosy albeit not small. We would certainly recommend the hotel for a pre-cruise stay. We were grateful for the services of Aaron (concierge) who arranged a taxi to Pier 91 for only 25 dollars! Aaron was also very helpful in advising us how to get around. We used the underground bus a lot just to get from one end of the town back to the hotel after a long day but it is also easy to walk. A real gem in Seattle - don't forget to look up to see the walruses (?) on the outside of the building. We had breakfast one day in the restaurant but the bakery two doors along is good also!", "Date": "June 9, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "3", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Dublin, Ireland", "Title": "“A gem of a hotel in the Emerald City”", "Author": "sidel", "ReviewID": "UR66482215", "Content": "One of the nicest hotels you'll find, not just in Seattle but in the whole of the USA. Decor and ambiance are perfect and the staff were very helpful and pleasant. The old lobby is absolutely beautiful and is an excellent hint as to how your room will look. Free internet in the lobby was good considering that it costs about $10 per to use the wifi in the room. Free newspapers and cookies at the lobby also. Rooms are amply sized and really clean, especially the bathroom. Our room was on the first floor and the window over looked (more like under looked considering the size of it) Columbia Tower. This room was a bit noisy at night, but this was from the street outside (mainly traffic noise) but it's to be expected staying downtown in a city. Stick some ear plugs in and you'll nod straight off. Oh yeah, and the beds are HUGE! If we're ever back in Seattle - we'll be staying here again - no question about it!", "Date": "June 4, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Location": "4", "Rooms": "5"}, "AuthorLocation": "", "Title": "“Great historic hotel. Completely...”", "Author": "A TripAdvisor Member", "ReviewID": "UR65778139", "Content": "Great historic hotel. Completely restored. We had a hard time knowing where to park since we weren't from here. The bellman saw us circling and got our attention and told us about the free parking as an option to the valet parking the hotel offered. We had two queen beds and the rooms were quite large with a small sitting area and large desk area. There is a French press and coffee and tea. The bathrooms were also quite large with early 1900 feel. Lots of wide crown molding and beams throughout the room. If you want atmosphere, this place has plenty. The beds have nice mattresses, down comforters and pillows. Very plush. There is also a flat screen tv.", "Date": "May 30, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Ottawa, Canada", "Title": "“I'll be back!”", "Author": "ReluctantRoadWarrior", "ReviewID": "UR64671273", "Content": "A classic hotel that has been lovingly cared for and refurbished. Staff were extremely attentive, friendly and helpful. What a delightful experience.", "Date": "May 19, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Riverside, Illinois", "Title": "“Delightful gem in the heart of downtown Seattle”", "Author": "swaynewilson", "ReviewID": "UR63499413", "Content": "The Arctic Club Hotel is rare find in the numbing sameness of chain hotels. This delightful gem is located in the heart of downtown Seattle and walking distance to many of the night spots, sports stadiums, shopping, etc. I chose a corner, jetted-tub room. Extremely well appointed complete with stereo, flat-panel HD TV, wireless, and most importantly Starbucks in-room coffer w/french press! Staff is friendly, room service was delicious and prompt, and the Juno restaurant is a convenient stop for breakfast on the way out. I will be adding this to my list of favorite hotels. Can be a bit noisy if you are sensitive to street noise so be sure to request a higher floor room. Planning a nice event? Check out the Dome Room as a possible venue, it is really beautiful.", "Date": "May 7, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Helsinki", "Title": "“Simply wonderful - elegance and comfort!”", "Author": "BrightblueSunflower", "ReviewID": "UR63335131", "Content": "Wonderful and elegant hotel! Friendly staff - special thanks to concierges Albert and Patrick, who kindly helped us to find sport and live music events during our stay, as well as a very lovely restaurant to enjoy a perfect dinner! Beautiful and stylish lobby bar. Very comfortable bed in room. Valet service worked fast and well. Hotel's only minus was the slow and somewhat unprofessional service during breakfast in Juno restaurant.", "Date": "May 5, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "3"}, "AuthorLocation": "Huntington Beach, CA", "Title": "“One Year Anniversary”", "Author": "Pete962008", "ReviewID": "UR62623605", "Content": "My wife and I went to Seattle for our one year anniversary. We loved the hotel, the staff was extremely friendly, hotel was very clean, and they upgraded our room when we told them why we were in Seattle (every time we came back in they would give us 2 bags of cookies-we had to sweet talk em though). We took the light rail from the airport, it was very easy to use and the light rail stop is less then a block away from the hotel. We did use the light rail whenever we went to Pike's Place Market, mainly because the hotel was far away. Great hotel, very classy, staff was great, clean room, and even a nice little workout room with the bench-bars-dumbells and everything else.", "Date": "April 27, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Florida", "Title": "“Wonderful big city hotel with turn of the century feel”", "Author": "solomon5", "ReviewID": "UR61704065", "Content": "We loved this hotel from the moment we entered the lobby. The historic details are excellent and well kept. We liked the portraits, top hats, and collars displayed near the check in desk as well as the key cards with character. The mascot Walrus is everywhere. Our corner room on the 8th floor was well equipped with a good coffee press and hot pot as well as several electronic items in addition to the television. The bathroom was large and had a jacuzzi tub. We laughed that it had the word \"Bath\" stenciled on it. It was pretty obvious what it was. Lighting was not the best. If we had not had a flashlight the safe in the closed would have been totally useless and I felt the reading lights were dim. It was also somewhat noisy especially early on Saturday morning when the jackhammers started. On the whole we were very happy with the facilities. The people were even better. They went out of their way to help us with directions, suggestions, and whatever else we might need. We felt the location was excellent. We took the light rail from the airport for $2.50, got off at the Pioneer Square stop, went up the escalator and walked out right across the street from the hotel. We walked a lot and some of the uphill stretches were evil. The Pioneer Square and International Districts are very convenient and both have a lot of places to eat. Public transportation is free from 6am-7pm in a large central section of the city. There are buses outside the hotel as well as in the transit tunnel where the light rail stops. Folks at the desk will give you a print out of your route or connections. We would definitely stay at this hotel again if we return to Seattle.", "Date": "April 16, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Alexandria, Virginia", "Title": "“Classy-Cool-Histori”", "Author": "jtf98", "ReviewID": "UR61381436", "Content": "Artsy, Cozy, Romantic, Historic Hotel, wonderfully comfy beds and linens. Cool bar with great martinis--Ask for the \"Gonzo\", while you are playing pool or surf the net in the lobby level. Nice touches throughout, loved the leather club chairs, fireplace, walrus toy in room and warm cookies at check-in and at other times. Location is better for someone needing access to the business distric then for the shopping area. However very short walk to ferry terminal and bus stop right at 3rd Ave entrance. If you want to be nitpicky, only \"downs\" dim lightning throughout hotel, no swimming pool or spa and thin windows.Otherwise staff is super nice and helpful. Looking forward to my next stay!", "Date": "April 14, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "3"}, "AuthorLocation": "Honolulu", "Title": "“Don't leave me with Geronimo!”", "Author": "aug2386", "ReviewID": "UR61267604", "Content": "Very cool hotel. Like stepping back in time. Great service and consistent housekeeping service. Good value and experience. Our only misgivings is the distance to Pike Street area and my daughter being freaked out by the portraits of the old guys on walls in the bedroom.", "Date": "April 14, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Kennewick, Washington", "Title": "“Love it Great value in the downtown!!!!!!”", "Author": "friendly12345", "ReviewID": "UR61049177", "Content": "My new home when it comes to downtown seattle. very comfortable, very friendly and helpfull staff.", "Date": "April 11, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Chicago, Illinois", "Title": "“Would come back...”", "Author": "lb5vb", "ReviewID": "UR60493450", "Content": "When I think DoubleTree I don't automatically think it's going to be all that nice. I booked the room purely based upon the other trip-advisor reviews and the great deal I got for paying in advance. However, I was pleasantly surprised when we arrived and saw the hotel. It was extremely clean, very beautiful with old moldings etc and, given how old the building was, the room was very large and had a great bathroom. The only thing I'd change is the lighting in the bathroom. It was very dark and hard to put on makeup.", "Date": "April 6, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Wausau, Wisconsin", "Title": "“Classic and historic, the Arctic Club is something special”", "Author": "Standby4321", "ReviewID": "UR60139812", "Content": "Restored to its early 20th Century glory with a fabulous renovation in 2008, the Arctic Club Doubletree is unique, elegant and well-located. Immediately across the street is a mass transit tunnel that provides rail access to Seattle-Tacoma International Airport, as well as a free service area for buses in central Seattle. The famous Pike Place Market is within walking distance or you can grab a bus and ride a couple of stops for even easier access. The immediate area provides plenty of choices for dining and a plethora of coffee shops in the most caffeinated city anywhere. Pioneer Square and the waterfront are within easy reach, too. As for the hotel itself, we especially enjoyed the historic charm and comfortable beds. Rooms are nicely finished and furnished with nice touches like in room coffee using a French press coffeemaker. We've seen some renovations in which the only thing left of the building was something on the order of a paved-over shell, but the Arctic Club celebrates its history throughout -- from historic photographs of its former members on the keycards to careful refinishing and preservation of its finest attributes. The result is 21st Century comfort with an ambiance that keeps the property's past vibrant and alive. We loved it and we think you will, too. Give the Juno dining room a try and particularly the happy hour food offerings at half price. It's a funky menu the celebrates the Pacific Northwest, but you're sure to find something you like. The bar off the lobby is open later and it's a classy atmosphere that harkens back to the hotel's roots as a social club for men who made it their money in the days of the Klondike gold rush.", "Date": "April 1, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "3", "Sleep Quality": "5", "Rooms": "5", "Location": "3"}, "AuthorLocation": "", "Title": "“Unique and comfortable”", "Author": "lillah19", "ReviewID": "UR59390449", "Content": "I really liked the Doubletree Arctic Club. I always enjoy staying in hotels that have an interesting history. This hotel has information in the lobby that tells all about when it was a private club during the gold rush. Check out the ballroom it has a beautiful stained glass dome. The room I had was a corner room that was extremely comfortable and had a whirlpool tub. The furniture was attractive and I thought the french press coffee pot was a really nice touch. The location is not particulary wonderful and parking is a pain but I am glad I decided to stay here.", "Date": "March 24, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Birmingham, AL", "Title": "“Really cool renovated historic hotel - perfect for business or leisure”", "Author": "klingja", "ReviewID": "UR59384505", "Content": "We just got back from 4 nights here for a work/pleasure trip. This place has a really cool history - built in early 1900's as an exclusive men's club (photos of the members adorn the walls) and renovated in 2008 into a AAA 4-diamond hotel. The staff was all very helpful and friendly. It is literally 1/2 block from the light rail station (exit Pioneer Square station on the 3rd Ave/James St) and you can take the rail from the airport to the hotel (about 30 minute ride.) We were welcomed very warmly upon arriving and had a fun, impromptu history lesson on the way to the elevator given by one of the front desk staff. The room (we had a standard king room) was decorated very nicely, yet uniquely. You could tell the decorator really cared about the history of the hotel when he/she appointed the rooms. Our bathroom was HUGE for a Doubletree. And, it had a cool door. Bed was very comfortable, nice flat screen TV, minibar, etc...the room was nicer than any Doubletree or Hilton I've ever stayed in before. Hotel was very convenient to a lot of cool places - Pike Place Market (5 min.) Light Rail (.5 block) good restaurants (all around) coffee shops (all around) bars/late nite options (2 blocks) etc... All in all - it was great and we would highly recommend it! It did help that work was paying for it (rate was $155/nite) but it was reasonable, and definitely worth the price.", "Date": "March 23, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "3", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Missouri", "Title": "“Class Hotel”", "Author": "NWTravelerMissouri", "ReviewID": "UR59098318", "Content": "Very nice hotel with lots of character. The rooms are very nice and the staff was great. Hotel is a bit pricey and parking is valet only. Good location in downtown Seattle. I recommend for business trips and couples.", "Date": "March 20, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "3", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Sydney, Australia", "Title": "“Little gem of Seattle”", "Author": "MAB28", "ReviewID": "UR58351354", "Content": "The Doubletree Arctic Club is conveniently situated on 3rd Avenue and the corner of Cherry St in downtown Seattle. It is very easy to find if you have taken a bus to Pioneer Sq, it's one block away and less than a minute to get to the hotel. If you are travelling from the airport, the 194 bus will take you downtown directly and the fare is $2, you must also have the exact amount. When I arrived at the hotel before 2pm, my room was not ready, this was not a problem for me, as a first time visitor, it gave me the opportunity to drop my bags off and explore the downtown area quite easily. The check-in staff were very pleasant and offered me a nice warm cookie before I set off on my way and offered to call me to notify me that my room was ready and I was able to check in. The concierge team were also very helpful in ensuring that I had a good time in Seattle by offering me a map and suggestions for things to do in the city in such a short space of time. I had to leave the city early in the morning and the hotel promptly gave me a wake-up call and offered me a car to drive me to the airport at 5am, this was at a cost of $40. The room I was allocated was of an adequate size bearing in mind that I was a solo traveller, if travelling with another person, I would imagine that the room would feel smaller than most hotels. The bathroom had an old world charm about it with wallpaper on the walls and a classic cosy feel. I was on a higher floor, however, it was still possible to hear the street noise which was a little off putting at times but it didn't spoil my stay. I did not use the lobby lounge but it had a warm 'gentleman's club' type feel with classic furniture, soft lighting, which for me, made the hotel feel intimate unlike other hotels I have stayed in. If you feel like a good walk (10-15 minutes) then head to the Farmers Market then take the monorail nearby to the Space Needle, which boasts some spectacular views of the city. If you don't have an umbrella, the hotel will happily provide you with one! If you're looking for something a bit different from the usual hotels that one can stay in, then I would recommend the Doubletree Arctic Club.", "Date": "March 12, 2010"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "Eugene, Oregon", "Title": "“V-day at the Arctic”", "Author": "patiences4not", "ReviewID": "UR57570652", "Content": "OMG I LOVE THIS HOTEL! It has an old world charm that is off the map. The main staircase and the entry way. The parking was expensive but the corner room and bathtub made up for it!!", "Date": "March 2, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Seattle", "Title": "“fabulous hotel”", "Author": "thirtyishseattle", "ReviewID": "UR57097169", "Content": "I was with my boyfriend and two other couples and we all just loved this hotel! For starters, it has such great old world charm and everyone was so friendly and nice to us. The rooms were all very clean and the ameneties were fantastic, oh.. and the beds were just heavenly. We had dinner at the Metropolitan Grill and it was only a block or so away and was a very easy walk. The Juno Restaurant below has a great atmosphere and serves excellent Bloody Marys. We will definately be staying at this hotel again!!", "Date": "February 25, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Northern NJ", "Title": "“New Hotel, Historic Building, don’t bother bringing your car.”", "Author": "JETNJ", "ReviewID": "UR56999678", "Content": "I have to compliment the builders / craftsman who turned the historic Arctic building into the Arctic Club Hotel, their workmanship is of the highest quality and the decor is outstanding, (my wife and I like it so much we’re going to use their green / brown accent color scheme in our bedroom). We chose the Arctic Club for its location, a few blocks from the train station and being on the LINK light rail line to the SeaTac airport (station stop is Pioneer Square). We stayed for 3 days in a King bed - nonsmoking, and it was the most pleasant hotel experience we’ve ever had. All the staff were nice, polite, helpful, and genuinely seemed to like working there. The room was cosy, immaculate and well equipped (my wife especially enjoyed the french press coffeemaker for her morning coffee, I was impressed by the LG flat panel TV), and comfortable. WiFi internet access is available in the room for $X a day, but there are two computers and a printer available in the business center for free (a godsend for printing boarding passes) so bringing your laptop with you is not as necessary. We then took the ferry to Victoria, BC for a 3 day visit, and returned to the Arctic Club for one more night, this time in a Queen nonsmoking, shower only. While the room itself was a just as nice as the King, it felt crowded because all the furniture and amenities from the King were in a smaller space. It’s fine for one person or two people overnight, but there’s not a lot of spare space. Seattle’s public transit system makes it easy to get around using electric bus, diesel bus, and light rail lines. It’s great for tourists because the Arctic Club is within the free transit zone, which covers most of downtown. No rental cars or taxis necessary For breakfast, go next door to Piroshki’s bakery for Russian/Polish breakfast and dessert pastries and great coffee.", "Date": "February 24, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "3", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Shanghai", "Title": "“Nice boutique hotel but get a high floor if light sleeper.”", "Author": "LiangShanBo", "ReviewID": "UR55322647", "Content": "Nice hotel in Seattle. Very convenient to the undergound bus (right on the corner), which is free during day time within the downtown area. You can also walk to Pike Place etc., which 2 bus stops away, in about 15-20 minutes. Hotel was nicely appointed with photos of various Native Alaskans and Western explorers in the hallways and rooms. Restaurant was good. Lower rooms face a lot of street noise from buses, but that is with any city hotel. They do have ear plugs if you're stuck on a lower floor though (I always bring my own for same reason if get stuck next to a noisy family). Only thing I was disappointed with was didn't get a free cookie when I checked in. ;-)", "Date": "February 6, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "UK", "Title": "“Thank you - Christmas was perfect here”", "Author": "Rob S", "ReviewID": "UR55132218", "Content": "My wife and I stayed here over Christmas. We had a corner room, which was perfect. We were on the 8th floor so had no problem with traffic noise. Our first stay in Seattle was a fine one, made better by this hotel. Room service was cheap, the bar was great and the staff friendy. The Juno restaurant was good for breakfast.", "Date": "February 3, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Canton, Ohio", "Title": "“stayed w/ hubby while he was there on business”", "Author": "grapebgirl", "ReviewID": "UR55093707", "Content": "my husband had to stay in seattle for 2 weeks & i came to visit for a long weekend. this hotel is historic & beautiful. we stayed on the 9th floor in room 901. our room was clean & very comfortable. there was construction going on 4th ave that was noisy, but not to blame the hotel. my husband raved about the coffee & breakfast in the hotel restaurant, juno. i enjoyed that the hotel was walking distance to a lot of shopping & attractions! parking was steep, $36/night, but i think it was comparable to the area. the concierge & desk staff were always helpful & attentive. the fitness center was clean & nice to have on site. although if you go sight seeing you get plenty of exercise just walking around!", "Date": "February 3, 2010"}, {"Ratings": {"Cleanliness": "5", "Overall": "5.0", "Value": "5", "Service": "5", "Rooms": "5"}, "AuthorLocation": "Melbourne, Australia", "Title": "“A Hidden Gem”", "Author": "philandalex", "ReviewID": "UR54552008", "Content": "We enjoyed 2 wonderful nights at this delightful, boutique hotel. From the moment we arrived we recieved nothing other than great service from friendly professional staff. We had booked ajoining rooms and both were roomy, well appointed and scrupulousy clean! The walk to the city centre was an easy one. There is a Right Aid almost next door, coffee shops near by and it is a short stroll down to the 'old' Seattle. Only problem.... did not have long enough!", "Date": "January 28, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "2", "Location": "4", "Rooms": "4"}, "AuthorLocation": "Missoula, Montana", "Title": "“Fine Stay”", "Author": "chilly_h2o", "ReviewID": "UR54158698", "Content": "We stayed here for a baseball series last July. We have stayed at multiple hotels throughout Seattle over the past few years and this one was the best thus far. highs- Upon arrival we received upgraded room on top floor with nice (shared) balcony and view of stadiums (as a HH Diamond). This is always a sign that the hotel at least has some basics down. The hotel is in pretty convenient location for downtown, walking distance (10 mins) to NFL & MLB stadiums. The rooms were nicely furnished, flat panel TV’s, the bathroom was large & nice, comfortable (high)beds, pillows, linens. The service was generally very good. lows- Parking, when is parking not an issue? It is either too expensive, $35 /day I think, or the street parking is a bit of a pain, with hills and numerous street regulations. We stayed over a weekend, so we parked on the street one block away and it was not a problem, but the hills are kind of a pain to park on unless you are coming from San Francisco or something. The in-house restaurant average, not much in immediate area either—at least that we found. Overall we had a very nice stay. No bargains here, but hey, it’s Seattle.", "Date": "January 23, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "5.0", "Value": "4", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Germany+LA, CA", "Title": "“Very original hotel, great location”", "Author": "brunneng", "ReviewID": "UR51115003", "Content": "It was my first time in Seattle and I loved it. I guess the hotel contributed to that. The location is great: Downtown, across the street from the entrance to the underground bus shuttle and light rail to the Airport, 3 blocks from waterfront/ferries. Restaurants everywhere. The hotel looks unspectacular, there's a cozy lobby and a nice bar on the ground/first floor (and a great breakfast place, try their lox bagel) Staff is friendly and helpful. The surprise are the rooms. They are not large, but very original. The \"arctic theme\" is everywhere; walrus on the bathrobe and door sign, frosted doors, trunks instead of bedside tables.. it looks great and is full of little surprises (walrus bottle opener?). There's a city view that should be just fine from most rooms. In terms of comfort, the beds were great, the temperature just right, noise level low. I would return any time.", "Date": "December 12, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "4", "Rooms": "5"}, "AuthorLocation": "Tacoma, Washington", "Title": "“Fantastic Experience”", "Author": "maryholste", "ReviewID": "UR50886427", "Content": "My husband and I celebrated our first anniversary at the Arctic Club this weekend and it was the perfect place to do so. The staff was incredibly friendly and helpful. When they heard it was our anniversary they brought us a tray of chocolate covered strawberries and even wrote us a very nice card! The rooms are cleverly decorated with a historic Arctic Club theme and contain every amenity you could think of. The pillow-topped bed was amazingly comfortable and all the linens were fantastic. We had breakfast at Juno, the hotel's restaurant and really enjoyed it. The hotel's location is nice because it's located between the shopping area of Westlake Center and the more historic Pioneer Square. There are lots of shops and restaurants nearby, but the hotel feels like a retreat in the center of it all. And because it's a Doubletree, you get a warm cookie upon arrival! How can you pass that up?", "Date": "December 8, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "3", "Rooms": "5"}, "AuthorLocation": "Vancouver", "Title": "“Awesome!”", "Author": "lkwok2", "ReviewID": "UR50423005", "Content": "My girlfriends and I went down for a weekend getaway from Vancouver. It was quite the late check-in, but the front desk agent, Albert was superb! He welcomed us and we chatted quite a bit. He made us feel very welcome and even gave us warm chocolate chip cookies at check-in. The valet was prompt to park my car. The hotel itself is classy, clean, and you can tell they take great pride in keeping the maintenance. Our room was spacious, had all the ammenties we needed, the towels were plush, the room had an umbrella, an in room safe, the beds were super comfy, all the latest electronics, mini bar and snake bar, and the housekeepers did a great job. You can tell it was an old gentlemens club before, the quality and just the structure of the hotel itself is impressive. I would stay here again and again, and thanks again to Albert for helping us with our luggage at check-out. We had tons of luggage but he didn't hesitate to put them on a cart, and store the items in my trunk. Thanks for making our stay so memorable.", "Date": "December 1, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Los Angeles", "Title": "“Charming, comfortable, a very pleasant surprise!”", "Author": "LAcurlgurl", "ReviewID": "UR48535036", "Content": "This is one of the best Hilton brand hotels that I have stayed at. The hotel feels very historic, charming, interesting, beautiful, unique and comfortable...A really special place! The staff is very kind and accomodating (and the warm chocolate chip cookies at check-in alone are worth coming back here!) and the rooms are very nice. They are not very large, but there is a lot of attention to detail- soft and comfortable bed, Neutrogena bath accessories, great snack bar, etc. I stayed on the 5th floor, but was not bothered by the street noise. My only complaint was that the fitness room is really small with only 2 treadmills and 1 elliptical, with very low ceilings. The equipment is nice and new, but the room should be larger, have more cardio equipment and have better circulation. My only other minor complaints is the charge for wireless internet and also the dim lighting in the bathroom. I will definitely be staying here on all of my future trips to Seattle and recommend to anyone looking for a special place with great value.", "Date": "November 4, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "4", "Rooms": "5"}, "AuthorLocation": "Hanover Park, Illinois", "Title": "“The Arctic Club: One Cool Hotel”", "Author": "ChicagoDJ", "ReviewID": "UR48291418", "Content": "My partner and I just completed a two-night stay at the Arctic Club, during our first-ever trip to Seattle. I can't say enough great things about this property. Not only does it have history in spades (it began its life as a turn-of-the-twentieth-century gentleman's club), but the super-friendly staff and prime Seattle location near historic Pioneer Square make it a must-consider hotel. The rooms, as noted by other reviewers, are very nicely appointed and pay off the overall historic theme/credibility. We stayed on points, but were upgraded to a corner king with whirlpool. The room overall was very comfortable -- great bed and bathroom, in particular. In addition to the points above, the hotel also has a very nice restaurant, Juno, which we visited both mornings for breakfast. The closest thing to a negative about this property is that it's slightly off the beaten path in terms of other busier/more happening Seattle neighborhoods (around/near Pike Place, for example). But we actually liked that because it contributed to a quiet, relaxing stay. We will definitely be coming back to the Arctic Club on future trips to Seattle (oh yeah -- we totally loved the city, too!).", "Date": "November 1, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "zmurman", "Title": "“Great find in Downtown Seattle”", "Author": "zmurman", "ReviewID": "UR48043848", "Content": "If you love classic hotels with friendly, fantastic service and you're going to Seattle, stay here. They've created a real hotel gem out of a turn-of-the-century fraternal club. You get the feeling of going back in time to a more gentle era. The Polar Lounge area is warm and a lovely place to enjoy a drink or two. Eggs Benedict at the Juno restaurant is a must. A short two blocks from the best steak restaurant in town - the Metropolitan Grill - sit at the bar and enjoy the great bartenders there. Also recommend the Steelhead Diner in the Pike Place market area about 10 blocks away. We loved our stay here and would for sure stay here again. I'd read on some of the reviews that the rooms were on the small side, but our room was plenty large, clean and well appointed, and the staff was very nice and helpful. Enjoy.", "Date": "October 29, 2009"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Boulder", "Title": "“Classic”", "Author": "reb-boulder", "ReviewID": "UR47665725", "Content": "A classic older hotel now run by Doubletree. Classic and classy. Great place for a special event like a wedding. Close to the sound. Walking distance to downtown area and the market. Easy to get to. Staff very courteous and responsive. Internet a bit expensive as are other add-ons like telephone. Would stay again.", "Date": "October 24, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "3.0", "Value": "2", "Location": "2", "Rooms": "2"}, "AuthorLocation": "So. Cal", "Title": "“Different strokes for different folks”", "Author": "socalbeachbum97", "ReviewID": "UR47600638", "Content": "Being Hilton Honors, we chose this hotel due the rave reviews on Trip Advisor and a write up from Conde Nast. As international travelers, we've stayed in many Hilton properties and this ONE was disappointing. It isn't that there was anything terribly wrong with it, there just anything great about it. The rooms were extremely dark and small. My experience the bathroom lighting was horrible and kudos to the other Hilton Honors who had a top floor with a balcony. Otherwise, the 'feeling' is very clostrophobic. The location is undesirable and removed from the heart of the city and attractions. Staff was pleasant, but nothing that stands out. If I were doing it over again; I would not stay here. Two nights was more than enough.", "Date": "October 23, 2009"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "manchester", "Title": "“Cosy, Friendly, Full of Character”", "Author": "Alextrips", "ReviewID": "UR47307905", "Content": "I've travelled quite a lot and have to say that this is my all time favourite hotel. The staff are very friendly and helpful, Steve the concierge was great and seemed to know the answer to any question we threw at him! The gym is well equipped, there's free internet access in the lobby, warm cookies on arrival, starbucks coffee in the rooms and lovely complimentary toiletries, the beds were super comfy, the showers great, lots of lovely hot water. The decor of the hotel and rooms were lovely and tied in with the character of the place. All in all, in my opinion, unbeatable.", "Date": "October 20, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Long Beach, California", "Title": "“Excellent! Could not have been better!”", "Author": "LongBeachJack", "ReviewID": "UR47196218", "Content": "We took the bus from SEA-TAC airport to downtown and there was a stop across the street from the hotel. The light rail station is also across the street. The hotel is very close to Pioneer Square and walking distance to Pike's Market. I would suggest becoming a Hilton Honors member. We were upgraded to the top floor which had a balcony and a whirlpool tub. The room was large and had floor to ceiling windows. The front desk was very helpful in providing restaurant recommendations and directions. The hotel has a classic feel with modern amenities. It is well maintained. We loved it!", "Date": "October 18, 2009"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "Reading, UK", "Title": "“A different class”", "Author": "PeteLanc", "ReviewID": "UR47077540", "Content": "We normally book the interesting budget hotels, but this had a a very good deal so I took the plunge. From the moment you walk in, it's like being back when travelling was a pursuit of the gentlefolk. The hotel has recently been completely refurbished. The foyer is covered in photos of old explorers, the staff were helpful - but not overwhelming. We had a huge room, with a walk-in wetroom. Also a firmish, comfortable bed. The downsides: Had to pay extra for WiFi (pop down the street to a coffee shop) and no hot drinks in the rooms (same solution). It's a few minutes walk from the bustle of downtown, but thats not bad. Well within the free fare zone and handy for the transportation tunnel & light rail to the airport.", "Date": "October 17, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Location": "3", "Rooms": "3"}, "AuthorLocation": "Seattle, WA", "Title": "“Vintage glamour”", "Author": "GVJS", "ReviewID": "UR46504187", "Content": "We stayed at The Arctic Club this past weekend for a wedding. This historic Seattle building was constructed in the early 1900's, as a men's social club where men with money with gather to share stories about their time during the Alaska Gold Rush. Fast forward to 2006 the property was purchased and renovated to one of Seattle's most unique hotels. The rooms and beds are very comfy. Since we were there for a wedding we were able to visit different rooms from the standard to the standard with sofa bed to the suites with balconies. Every room is done with class with vintage bathrooms with original Arctic Club color tile. The wedding was held in the stunning Dome Room with original artistic frescos, and of course the stained glass dome. Service and food were top-notch. We were also impressed with the valet and bellhops. They were efficient and quick and we didn't ever feel like we were waiting around. Well done!", "Date": "October 11, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "sf bay area", "Title": "“Love this hotel!”", "Author": "soansari", "ReviewID": "UR46270246", "Content": "We ended our Olympic National Park trip with an overnight stay at the Doubletree Arctic Club Hotel. There were many many reviews for many many hotels in Seattle, but the uniqueness of this one caught my eye. It's in a former men's club. But being newly remodeled, they kept the charm of the oldness and added all the new conveniences. It's perfectly located to walk down to pikes market (if you don't mind a leisurely stroll) and the waterfront. We have 2 young girls (10 and 12), and even though the hotel didn't have a pool, they didn't seem to miss it at all. In fact, they've stayed at many upscale hotels (Ritz, Hyatt's Hilton's, etc), and put the Arctic Club in the top 5 of their hotel picks for its comfortable beds/bed linens and room decor. We would definately stay here again!", "Date": "October 8, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Pleasant Hill, CA", "Title": "“Location, History, Comfort...Artic Club Doubletree has it all”", "Author": "RevRPB", "ReviewID": "UR46202296", "Content": "My wife and I together with two other couples...old friends going on an Alaskan cruise together...spent two nights here. The hotel was a treat from beginning to end. The staff was friendly and helpful. They were proud of their beautiful hotel and rightly so. The rooms were very comfortable. The location of the hotel is perfect with public transportation easily available. It is a Doubletree, but still feels like the private club it had been. The staff made our transfer to the Holland America pier so very easy. The six of us have fond memories.", "Date": "October 8, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "4", "Rooms": "5"}, "AuthorLocation": "Lake in the Hills, Illinois", "Title": "“Great place that no one knew about”", "Author": "ahavakamm", "ReviewID": "UR45706605", "Content": "Wow. This place is a hidden gem! I hate staying at the conference hotels when I go to conferences b/c it seems like they raise their prices knwoing everyone is on a stipend. I was lucky enough to book the Arctic Club for four nights for a conference in March. We had a great stylish room and a huge bathroom with great amenities. Our room looked out onto a construction site but if we looked up from the construction we could see the beautiful buildings surrounding us. This place had a wonderful attention to detail. My favorite thing by far was the room numbers decked out with walruses. It seemed a little off the beaten path, but that made the lush lobby all the better. We snuck around and looked at the domed ceiling ball room that was cozy and grand at the same time. The great thing was that the free downtown Seattle bus stopped right outside and I could get to conference for free!", "Date": "October 3, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "4", "Rooms": "5"}, "AuthorLocation": "Florida", "Title": "“Great hotel for sightseeing without a car in Seattle”", "Author": "OandL", "ReviewID": "UR45352059", "Content": "My husband and I are retired and we travel about three months a year. We stayed three nights here after traveling through British Columbia, Alaska, Mt Rainer and North Cascade National Parks. We loved everything about the lovely Doubletree Arctic Club Hotel; friendly and helpful staff giving us sinfully delicious cookies, clean and large room with thick towels, convenient location (20-minute walk to Pike Place Market, 10-minute walk to International District or 1-minute walk to public transportation).", "Date": "September 28, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Location": "5", "Rooms": "4"}, "AuthorLocation": "austin, tx", "Title": "“Nice Hotel Service Could Be Better”", "Author": "platinum1", "ReviewID": "UR45245697", "Content": "My husband I arrived at the hotel around 1pm and were told our room was not ready. The front desk told us the room would be ready around 3pm asked for our cell phone number and said they would call us when the room was ready. We left our baggage with the front desk and asked if they could put it in the room when it was ready. They told us it was no problem and they would take care of it. We came back to the hotel around 6pm since we did not receive a phone call and inquired if our room was ready. The room was ready but the bags were not in the room. We checked in and a bellman took us and our bags to the room. The room was very nice but on the small side. After checking out the room we went to the hotel bar for a drink. The hotel bar is very nice and large with many seating areas with couches and chairs and even a large fire place. Both days we were there we had breakfast at the hotel restaurant Juno. Since we are HHonors Diamond members we received free breakfast. The food was tasty but the service was very slow and understaffed. This hotel was the nicest Doubletree we have every stayed at. It had a lot of charm, is in a good location and was very comfortable. Even given the poor service I would stay here again.", "Date": "September 28, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "West Sacramento, California", "Title": "“Best hotel I've ever stayed in!”", "Author": "mkide1969", "ReviewID": "UR44810869", "Content": "Had the pleasure of staying at the Doubletree Arctic Club this last week on a get-away trip to Seattle. The hotel has been beautifully restored by Hilton/Doubletree. Entering the lobby is like stepping back in time to when the hotel was the Arctic Men's Club. The lobby is decked out in dark woods, fireplace, comfortable couches, dark leather chairs. The Polar Bar is right off the lobby, a perfect place to relax with a cocktail. Play a game of billiards if you like, too. The staff at the hotel is top-notch. Check-in was smooth. The front desk staff were very friendly and efficient. In fact, all staff members we encountered were friendly, professional, able to provide directions to area attractions and gave some great restaurant recommendations (as in Ivar's on the waterfront, or Wild Ginger for Thai food at 3rd and Union; both outstanding restaurants.) Our room was extremely comfortable. We were on the third floor. Huge room in comparison to most standard hotel rooms. Nice entry foyer, with desk, living room, tall ceilings, three windows (that actually open!) Comfortable chairs. Huge bathroom, with jacuzzi tub. Great view of Mt. Ranier from the bathroom. In-room coffee is Starbucks (of course -- this is Seattle!) made with your very own French press. There was a flat-panel TV too (but we never turned it on -- too much to see and do in Seattle, plus we were there for the Rodrigo y Gabriela concert at the Moore Theater.) The hotel is a very short walk to historic Pioneer Square, a short ten-minute walk to the waterfront or Pike Place Market. The Space Needle was easily reached by using the bus/light rail transit tube then transferring to the monorail. The transit tube station is across the street from the hotel. We did eat breakfast one morning in Juno. Our server did seem a bit frazzled but was friendly. The food was great! Lastly, the staff in the Polar Bar was outstanding; really made us feel welcome and made some excellent restaurant suggestions. Plus, there's a happy hour from 3 pm to 6 pm, with a special drink of the day and discounted prices on other cocktails. Would I stay here again? You bet! The staff is wonderful, the location is great, plus you get to stay in a beautifully restored building with a historic past!!", "Date": "September 26, 2009"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "Melbourne", "Title": "“Excellent hotel with great character”", "Author": "olig", "ReviewID": "UR43940198", "Content": "Fantastic hotel which was quite individual when you consider it is part of the huge Doubletree Hilton organisation. They have managed to not completely loose the identity of the hotel and blend it into a brand quite successfully. A very memorable hotel. I had a lovely breakfast in the restaurant downstairs. The service was fantastic, friendly but also professional. Mind you, all the staff that I encountered there from reception to concierege were. I experienced no problems with valet parking, assistance with luggage or getting advice and tips for the local area. Room was atmospheric, lovely, large and comfortable room. From the room during working hours you could look directly into the adjacent offices and see staff working which was a bit disconcerting. However, there are layers of different curtains for privacy. Also there are two entrances, one of which is unmanned and requires that you get an elevator/lift to reception. The location and area is great for exploring Seattle which is a wonderful place. However, I did see quite a few homeless people not to far away from the Artic Hotel. Mind you there were quite a few around the market and in several areas of the city. I would certainly go back. The hotel offers great value & experience when compared to other Seattle hotels.", "Date": "September 23, 2009"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "new york", "Title": "“Would stay again”", "Author": "lafou", "ReviewID": "UR43392635", "Content": "The transit tunnel and bus stop are right outside. You can stumble out of the front door and buzz around the major areas in no time. You would expect a stuffy atmosphere, but the \"vibe\" is relaxed. The minor complaints I had were addressed immediately and amicably. The arrival cookie was fabulous. The area around the hotel is a little strange (i.e. Bail Bonds storefront).", "Date": "September 21, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Tampa, Florida", "Title": "“Great Find, !”", "Author": "bhtpa", "ReviewID": "UR43141146", "Content": "My first impression of this place was \"Wow, is this really a Doubletree?!\" From the moment you arrive nothing suggests a Hilton chain hotel. This is a converted turn-of-the -century men's club and it still retains the dark masculine feel of one. The lobby and bar are beautifully restored and small details abound throughout the hotel, like brass walrus room numbers, My rooms was a treat in itself--a frosted glass door to the bathroom with the word \"Bath\" stenciled on it, unique furniture, cool light fixtures all done up in a warm gold and marine blue tones with old Artic explorer nuances. A very refreshing change from what is considered trendy these days. Again i could hardly believe i was staying in a Doubletree--the room was much nicer and larger than some Ritz-Carlton rooms i have stayed in (i was in a Premire King room). I do agree with a previous reviewer that the rooms are on the dark side. For me this just enhanced the mood of the hotel. Also, the front desk staff was very pleasant and efficient and the concierge offered great local, insider suggestions-not the usual tourist fare. A couple of small complaints--there was no bellman at the front door when i arrived, meaning i had to carry my luggage up a flight of stairs and through thte front doors myself. Also, my wake up call never came, which had i not set the alarm clock as a back up might have become a huge complaint. Finally--the location is great--just on the edge of Pioneer Square and in the middle of the business district with City Hall across the street. A huge bonus is the light rail and bus tunnel entrance right across the street--meaning that when the light rail link to the airport is complete in December you can ride it to the front door of the hotel for just $2.50, saving you at least $40 in cab fare. (you can still take it now-with a bus transfer for the final leg). Also 3rd Ave is a major bus route and you can hop on the free downtown area buses right outside as well.", "Date": "September 20, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Grand Forks, ND", "Title": "“Wonderful experience!”", "Author": "bombledmonk", "ReviewID": "UR42953893", "Content": "My wife and I had our honeymoon in Seattle and decided to stay at the Arctic Club for the week because of location and very nice price when packaged with airfare. Service was excellent from start to finish and everyone was friendly and helpful from the doormen to the cleaning staff. The beds were extremely comfy and the sheets were changed every day. On the 5th floor facing south, thenoise from the street was definitley always there, but was never to the point of keeping us awake. The Polar lounge in the lobby was fun to hang out in, and the restaurant downstairs was good, but a bit spendy. Location is prime for those who are going to baseball or football games, or need to get anywhere in the metro as the St James bus station exits right to the front door of the hotel. Overall, I would highly recommend the Arctic Club for a couple or single traveler, it was a great experience, price and I will definitely stay there again in future visits.", "Date": "September 19, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Location": "4", "Rooms": "4"}, "AuthorLocation": "Boston, Massachusetts", "Title": "“Classic Men's Club Now A Posh Doubletree Hotel”", "Author": "RailwayHobo", "ReviewID": "UR41565968", "Content": "I stayed at the Arctic Club Hotel in September 2009 when I overnighted in Seattle in order to make the connection between my train from California which arrived in the evening and my flight back east to go home. I had originally chosen the hotel because it was a reasonably priced older hotel that was relatively close (about six or eight blocks) to the Amtrak station. The hotel itself is classic men's club that has been converted into a stylish hotel while maintaining (or, more likely, recreating) the ambience of such a club. A lot of effort went into the decorating and it was worth it. The furniture in my room had a vaguely art deco feel to it. The bed was extra comfortable. The bathroom was spacious and very attractive (they had, once again, gone to considerable effort to make it both very modern but esthetically keyed to the period of the club itself). I didn't try the restaurants or the bar, but the latter looked quite inviting. Some huge party was going on when I checked in but my room itself was quiet. One oddity which I am sure was just a bit of bad luck: when I arrived at my room after checking in, the door was propped open. I used my key to confirm that I wasn't going to the wrong room (I wasn't) and then I checked the room and everything was in order. I then locked and bolted the door. Still, it was a bit unsettling. While common, I note that they charged for Internet access, something I consider gratuitous and annoying (especially since more basic hotels almost always offer it for free these days). Still at $200 a night (plus taxes) for a cancelable reservation, I thought it was quite decent value given the alternatives available.", "Date": "September 14, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Location": "4", "Rooms": "5"}, "AuthorLocation": "Brooklyn, New York", "Title": "“Welcoming and warm, like your own personal club.”", "Author": "Watthree", "ReviewID": "UR39496992", "Content": "We had the opportunity to stay at the Arctic Club Doubletree before and after an Alaskan cruise. We would definitely recommend this hotel to anyone staying in Seattle. Staff: All of the staff members--front desk, bell staff, restaurant workers—were extremely friendly and service-oriented. They all express great concern about customer satisfaction and take steps to ensure that guests are having a wonderful time. Facilities: The hotel is beautiful. It was re-done in 2008. The Polar Bar in the lobby exudes warmth and comfort. The grand ball room is stunning. The rooms are warmly furnished with comfortable beds, overstuffed chairs, flat screen tvs and wonderful pillows. The style is so warm and inviting that I felt at home right away. I had a corner room on the 8th floor and another corner room on the 5th floor; noise was not a problem. The tilework in the bathroom was so neat, I want to use it in my own home. I can’t say enough about how much I liked the style of this place. Highlights: The décor is stunning. Be sure to check out the relief walruses on the outside of the building. Areas for improvement: The elevators were a little slow, but otherwise, I cannot imagine any improvement. Overall impression: Wonderful staff who know what they are doing in a beautifully restored facility make this place a “must stay” in Seattle. Nearby transportation: Downtown transportation tunnel is across the street. Buses run right down Third Avenue. A short walk to the Monorail, or take the transportation tunnel. 20 minutes to airport, 15 minutes to cruise terminals.", "Date": "September 1, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "2.0", "Value": "2", "Location": "3", "Rooms": "1"}, "AuthorLocation": "St. Louis", "Title": "“NIce hotel, but the noise ruined it...”", "Author": "ikonukon", "ReviewID": "UR39396271", "Content": "At first glance, the hotel looks like a beauty. It's a refurbished men's club and is on the National Register of Historic Places. The bar off the lobby is fabulous. Then we proceeded to our room on the 9th floor, expecting a respite from the hustle bustle of the busy streets below. Were we ever in for a surprise. The windows kept out virtually no noise at all. I love the movie \"Planes, Trains and Automobiles,\" but not playing nonstop in our room. Sirens erupted constantly and loudly, as if we were on the 2nd floor. Trains rumbled by every so often, and planes could be clearly heard overhead. Luckily, we didn't spend much time in our room except to sleep. (Yes, I had brought ear plugs.) Otherwise, the room was comfortable if small. The bed and bedding were excellent. We could have done without the portraits of the brooding Native Americans over the bed, though. And the lighting was dim throughout. The iPod dock on the stereo didn't work, and a staffer sent to resolve the issue couldn't. Also, no HD TV channels worked. The staff was uniformly courteous, but there wasn't much they could do about some of the problems we encountered. It's wonderful that the building was renovated into a hotel, but why skimp on the windows and noise insulation on a busy Seattle street?", "Date": "August 31, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "4", "Rooms": "5"}, "AuthorLocation": "Silver Spring, MD", "Title": "“a standout hotel - wish there were more like it”", "Author": "lorisue6", "ReviewID": "UR39022531", "Content": "I loved everything about this hotel. The rooms were beautiful and comfortable. It had an old world feel to it but everything was absolutely up-to-date. The location is ideal for exploring the city. My only regret is that we only had one night here.", "Date": "August 27, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Alaska", "Title": "“Loved it”", "Author": "grayling", "ReviewID": "UR34348104", "Content": "Very nice quiet hotel. Location is good. Parking is the usual difficult Seattle situation. But they have a good valet service. Personal bathrobes, great views, good coffee in the rooms, and everybody was really nice.", "Date": "July 9, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Georgia", "Title": "“excellent stay”", "Author": "GeorgiaTravelerGirl", "ReviewID": "UR33702706", "Content": "The location for this hotel is great. It is a historic hotel, but they've done a fantastic job with renovations. The bar has a professional bartender and is a great place to take advantage of happy hour. You will not want to miss the bakery next door to the hotel. I recommend this for breakfast! We did eat in the hotel for lunch and found it to to be a good choice.", "Date": "July 1, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Irvine, California", "Title": "“Quite an unexpected Serendipity!”", "Author": "nexcen", "ReviewID": "UR32555998", "Content": "The Arctic Club Hotel was merely accommodations we made for a weekend trip to see Seattle. Upon arrival, I had no idea I would literally step back in time to a day when collared shirts were required, service was impeccable with a gracious attitude, and social gathering around a large fireplace was proper and expected. Collared shirts are no longer required, but this exquisitely decorated historic hotel makes you feel like one of the club owners! Though renovated to what seems historic perfection, it offers modern day amenities like Jacuzzi tubs, flat screen TV’s, in-room wi-fi, CD/iPod player, Starbucks coffee, and even scotch tape and calculators for in-room officing… (BTW – who does that???) Little touches like historic fixtures, glassed-in bathroom doors, and even the flavor of a robust coffee poured straight from a French press give your stay that memorable feeling you so often hope to achieve on vacation. This place is a treat!", "Date": "June 17, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "4", "Rooms": "5"}, "AuthorLocation": "Vancouver, Canada", "Title": "“Great value - new boutique hotel for a chain price”", "Author": "septemberfalls", "ReviewID": "UR32332157", "Content": "This is my new favourite hotel in Seattle! I have been wanting to stay at the Arctic Club since it opened last year, but the prices were too high. Since the hotel has been sold to Doubletree the prices have come way down, but you are still getting all the luxury add-ons - high thread count sheets, great mattress, nice fixtures in bathroom, and of course the great lobby and bar. The service was great - cookies upon arrival, and always greeted warmly by the front staff as we went in and out. We also ate at Juno (hotel restaurant) for breakfast - the french toast is excellent! The only negative was that during the day/early evening the traffic noise outside (we were facing the street) was quite loud. It died down at night and was no problem on the weekend though. I LOVE THIS PLACE!", "Date": "June 14, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Raleigh, NC", "Title": "“Boutique Hotel - Great Location, Service, and Value”", "Author": "traveldude2", "ReviewID": "UR31738320", "Content": "My wife and I stayed here overnight before catching a cruise out of Seattle bound for Alaska. This hotel was formerly the historic Arctic Men's Club from the early 1900's and they've refurbished it, preserving the warmth and history. Has the feel of a elite club with warm, comfortable common areas, never having the feel of a large, impersonal hotel. The room, 9th floor, seemed new (1 year old), perfectly decorated, and well appointed according to the hotel theme. The staff was very friendly and helpful in recommending local hotels and public transportation/taxis. Their in-house restaurant (JUNO) had a great breakfast, an excellent ambiance, and was surprisingly reasonable. The hotel is also right off 3rd Ave, which is where you can catch fee bus rides throughout the downtown area (if you don't want to walk a few blocks) which is great if you're tired from walking around downtown and want a quick ride back to the hotel. All this and it's conveniently located in the Pioneer Square area - walking distance to Pike's Market as well. Also, the underground bus system just opened and the hotel is 1/2 block from this as well (cheap travel to airport if needed). We've lived in Seattle before, and this is a perfect hotel from which to explore Seattle... Book online early and save a bundle on the room...", "Date": "June 6, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "3", "Location": "5", "Rooms": "4"}, "AuthorLocation": "redmond, wa", "Title": "“The feeling of a private club in a small hotel”", "Author": "feathers1959", "ReviewID": "UR31590569", "Content": "The Arctic Club has successfully captured the feeling of a private club of the Alaska Gold era in Seattle, both from the decor and the service. The rooms are decorated in the gold rush period and have large, soft queen beds, bathrooms are adquate, and the room amenities are great--including the coffee press! The Juno resturant seems to open and close with the seasons, and the menu has gone a bit more mainstream for dinners, recently. Breakfasts are still \"hearty\". The bar scene seemed lively in April of 09.", "Date": "June 4, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "3", "Rooms": "5"}, "AuthorLocation": "seattle", "Title": "“An Arctic Gem of a Hotel: cozy, comfy, clean, and very cool.”", "Author": "mimi031", "ReviewID": "UR31340609", "Content": "We spent two nights at this hotel. Great on-line price so nabbed it. Corner room with King bed and whirlpool tub. Lovely, high ceilings, super comfy bed and pillows. Elegant touches to the decor. Not your standard hotel room at all. Neutrogena amenities and complimentary extras that arrived promptly upon my request. Great office supplies/amenities such as calculator, tape, stapler, etc. Great french press coffee pot and good coffee. The robes were sumptious and terry on the inside, smooth hi-count thread cotton on the exterior. Appreciated the bathroom off the bedroom down a short hall with nice door. Made it feel like we were in a small apartment. Would have appreciated a light in the dark hall closet. A small fridge would also have been nice.", "Date": "June 1, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "3.0", "Value": "4", "Location": "4", "Rooms": "4"}, "AuthorLocation": "Kent", "Title": "“Well located, Nice Hotel. Customer Service deteriorated noticably when ownership changed to Hilton Doubletree”", "Author": "EU4", "ReviewID": "UR31203351", "Content": "The Arctic Club Hotel is well situated on 3rd Avenue and Cherry St. in the Business district. The room (designated a disabled room) was spacious, with a flat floor WC / shower room (no steps). The bed was very comfortable although rather high for a disabled person. Coffee / Tea making available as well as TV / DVD / Radio / CD. Wardrobe contains a safe and ironing board and a low level clothes rail. (oddly no high level rail so long clothes / dresses couldn't be hung up) The Air conditioning fan was extremely noisy - to loud to have on at night. The TV was temperamental in receiving digital channels (which will be all of them after 12 June 2009). When we arrived Wifi internet was available throughout the hotel free of charge, but this stopped half way through the week. (See below) We arrived late on Saturday evening after a flight from London. Staff were helpful & friendly. The next day (Sunday) the area was quiet as it's the Business District. During the week the area is busier. Buses to & from the Retail Core (free until 7pm) run along 3rd Avenue and the are bus stops are right outside the hotel. There is a coffee shop on the opposite corner to the hotel and a Russian bakery next door (both open Mon-Fri only) if you don't fancy the hotel restaurant for breakfast. On the subject of the restaurant, in the course of a week we visited the restaurant 3 times (2 breakfast & 1 dinner). Monday breakfast was OK. Wednesday (note the day) dinner was a disaster. Had to wait an hour for our apetizers then the Entree (main course) arrived about 5 minutes later being placed on the table beside the apetizer plates we were still eating from. Glasses were taken before they had been finished and to top it all 2 of out party found plastic film in their food. Profuse apologies and a free glass of sparking wine followed, but the meal was spoiled. Saturday breakfast service was understaffed and inexperienced. Long waits for food, tables left uncleared and dirty crockery / cutlery provided. Generally the restaurant was hopeless. Half was though our stay (Wednesday) the ownership of the hotel passed to Doubletree, part of the Hilton group. From that moment onward there was a noticable decline in service. Internet connections stopped working (on enquiry I was told that the new owners had decided to charge $10 per day for access - there was no warning of this although it was still free in the lobby); the overnight laundry service took 4 days to return and the restaurant got worse. Not a bad hotel but things did change later in the week.", "Date": "May 31, 2009"}], "HotelInfo": {"Name": "The Arctic Club Seattle - a DoubleTree by Hilton Hotel", "HotelURL": "/ShowUserReviews-g60878-d677260-Reviews-The_Arctic_Club_Seattle_a_DoubleTree_by_Hilton_Hotel-Seattle_Washington.html", "Price": "$187 - $321*", "Address": "<address class=\"addressReset\"> <span rel=\"v:address\"> <span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">700 3rd Ave (corner of Third and Cherry - hotel entrance on Cherry Street)</span>, <span class=\"locality\"><span property=\"v:locality\">Seattle</span>, <span property=\"v:region\">WA</span> <span property=\"v:postal-code\">98104</span></span> </span> </span> </address>", "HotelID": "2515044", "ImgURL": "http://media-cdn.tripadvisor.com/media/ProviderThumbnails/dirs/cc/58/cc58500d89693401f45390438e01f3e76large.jpg"}}