{"Reviews": [{"Ratings": {"Overall": "3.0"}, "AuthorLocation": "Houston, Texas", "Title": "“Decent place to stay off the strip”", "Author": "Gigem31", "ReviewID": "UR128489897", "Content": "Stayed here while I was in town for the SEMA show. It offered a decent place to stay with a free breakfast. The hotel Is located across the street from the Hard Rock Hotel, which was where one of the free shuttles to the SEMA show would pick up/drop off each day. Room was average, nothing special...overall I have stayed in nicer Embassy Suites. Not a whole lot around the immediate area for places to eat/things to do. If your wanting to stay at a decent place away from the noise/crazyness of the strip for a pretty good price then this place would be right up your alley. The hotel does offer a free shuttle to the airport and over to the strip, with pickup at Planet Hollywood. One caveat, the shuttle will not take you to the airport if you have a really early flight!", "Date": "April 23, 2012"}, {"Ratings": {"Service": "1", "Cleanliness": "4", "Overall": "2.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "3"}, "AuthorLocation": "washington, dc", "Title": "“Nice hotel at a good price, shame about the front desk”", "Author": "copperreddc", "ReviewID": "UR128298420", "Content": "Nice rooms, good housekeeping, good price, decent location. But one very big \"but\" The morning front staff agent Ricky was rather rude to many guests. I saw him blow off a couple who came in early to make sure that they had a group of rooms booked together and had been directed by Hilton reservations to do exactly hat upon arrival. He rudely dismissed them with a \"I don't have time for this\". They went for a walk but that was ridiculous. I saw him repeat his behavior several times during my stay, always acting stressed out and as if guests were an encumbrance. If he was doing back office work, he should have stayed in the back office where he wasn't going to be disturbed. I needed some pain medication and noted that the pantry was out. He gave me an attitude when I pointed it out. Then when I asked if perhaps they had some stock in the back he snidely said \"Oh we can't dispense medication!\" That's not what I asked. I wasn't asking for him to dispense my prescription medication. They lost a simple sale with a really high profit margin; that's ridiculous! I was fine with the flight path on take off being right outside my window. The overall cleanliness was acceptable, only a small deficiency and housekeeping did a great job overall. The shuttle to the airport supposedly ran every hour at the top of the hour and to the Strip (the loose definition thereof) but actually it didn't run between 1130 and 4PM. Why? Also the shuttle doesn't run from the airport? Seriously? Sure a cab isn't that much, but if you have the shuttle, why not use it? The line for cabs when we arrived at LAS was a couple hundred deep and took 30 plus minutes in the heat. The website indicates I need to call the hotel to find out that there's no shuttle? Bad service. The final straw was when we needed to go to the airport. The shuttle didn't run at noon. I asked the front staff to call a cab, and I got blown off again. You can be assured I won't be staying at this hotel again.", "Date": "April 21, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "3", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Baton Rouge, LA", "Title": "“Noteworthy Little Extras”", "Author": "LABillie", "ReviewID": "UR128276750", "Content": "I stay here a couple times a year when my husband has business in the area. Nice pool area and clean but small gym. The hotel offers a hearty breakfast and evening drinks/snacks like other Embassy Suites. Its across the street from UNLV (one side) and Hard Rock Cafe Casino (other side), so locations is good for visiting those places. The hotel offers a free shuttle to the strip and the airport (for your departure), so, this can help visits cut some costs. Probably my favorite little extra is the opportunity to enjoy watching 2 beautiful swans during breakfast who live inside the hotel.", "Date": "April 21, 2012"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "orlando", "Title": "“Fair at best”", "Author": "mikeflOrlando", "ReviewID": "UR127929638", "Content": "Stayed at this hotel due to location near but not on strip. Only one person on duty ast desk to take calls and do all check ins and outs. Very long wait to get anyone to anser phone and then get checked in when I arrived. Cooked to order breakfast is a nice addition but when they let people come nto the restaurant area in their bare feet and order and eat it is a little too gross and I am sure against the health code (which they have an A rating for the inispection). Not sure how that works. Lots of noise from three bus loads of kids for some event (no parental supervision at all). Next time will stay somewhere a little less noisy and cleaner.", "Date": "April 15, 2012"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Overall": "2.0", "Value": "3", "Sleep Quality": "3", "Rooms": "2", "Location": "3"}, "AuthorLocation": "Maputo Mozambique", "Title": "“Misleading and disappointing”", "Author": "ambnmaputo", "ReviewID": "UR127486971", "Content": "Embassy Suites is one of my favorite hotel chains, one that I frequent regularly. This particular hotel is not of the quality I expect of this chain. The facility is worn and outdated, especially the rooms which need serious upgrade to the bathroom, furniture, and mattresses. The service is also lacking compared to what I usually find at Embassy Suites. They list airport shuttle as an amenity but do not mention that it only takes you to the airport with no pick up from airport requiring a $15.00 taxi ride. In addition, the shuttle only operates within limited hours both the strip and the airport--NOT operating between 11:30 am and 4:30 pm with last evening runs at 10:00pm. These shuttle hours require the use of taxis at other times which makes the lower cost of this hotel come closer to the more luxurious hotels on the strip. The 1 1/2 mile walk to the srtip would not be a good idea at night or in the summer. The breakfast is good but the evening manager's reception has a sign asking that guests limit themselves to 1 drink in contrast to other Embassy Suites that have no limit on drinks and provide delicious appetizers (here they provide goldfish, pretzels, chips and popcorn. I do not recommend this hotel.", "Date": "April 8, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "2", "Overall": "3.0", "Value": "3", "Sleep Quality": "4", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Colorado", "Title": "“Just avegae”", "Author": "gogogo2", "ReviewID": "UR127085951", "Content": "The good: As a diamond HHonors member we were put on the top floor, though no one told us there was coffee available on that floor in the morning. The hotel's location not far from the strip but still near a couple of casinos and restaurants is good. Staff were all very nice. The bad: Not enough housekeeping staff. We went out and got back to our room after 4 pm and it still hadn't been cleaned. Mind you, we were on the 6th floor, the so-called gold/diamond floor and you think they would start there. When we used the hot tub in the morning the area surrounding the tub was covered by discarded cups and snack cartons from the evening before. It couldn't have been grosser. I have always wondered why people put their pizza boxes and other items outside their doors, but they do. When we got back to our room after dinner, someone a few doors down had left the remnants of a fast food meal outside his door. Someone else must have kicked them and there were french fries scattered across the corridor. We called the front desk and they said they'd take care of it. The fries were still there in the morning. Going on, we got into bed on our first night only to realize that there was no TV in the bedroom. Very strange. They brought one the next morning. Finally, we asked twice for the bottles of water we get in most Hilton properties for being Diamond and they never materialized. Not sure we'd stay here again.", "Date": "April 1, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "St. Louis, MO", "Title": "“Convenient and great breakfasts”", "Author": "STL_Teacher_traveler", "ReviewID": "UR126660052", "Content": "10-15 minutes from the airport, max, and walking distance from the strip. The place was booked solid when we arrived and the agent at the desk told us there was 'one room remaining' for us, which I thought was dubious. I was concerned since the room was the third one from the elevator and there were college and high school kids galore. I had no reason to worry. All rooms are suites, and the bedrooms are separated from the interior of the hotel by two heavy doors and the additional room. We didn't hear a thing. The biggest surprise was the amazing, cooked to order breakfast that's available to all guests every day. There are a couple of chefs on duty to take breakfast orders. The pancake batter was fresh and the omelets were fantastic! I was so impressed. THEN, there is a FREE Happy hour for a couple of hours every night where the drinks are on the house. My wife and I aren't serious drinkers and only took advantage one of the three nights we stayed. I had never seen that before. They weren't stingy on the drinks either. So - 1 - quiet 2 - close to the airport, the strip, and UNLV 3 - free delicious breakfasts 4 - free Happy hour every night 5 - very reasonably priced 6 - no casino. Which I consider a plus is you're not going to Vegas to gamble and I wasn't The down side? Housekeeping was slow and minimally responsive with a couple of our requests. I didn't care for that. There were a few minor room problems (e.g. loose mirror in the bathroom) But they weren't enough to spoil the trip. I'll be back.", "Date": "March 26, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Key Biscayne, Florida", "Title": "“Probably the only Hotel in Las Vegas with Swans”", "Author": "HollerMyWay", "ReviewID": "UR126418469", "Content": "Everyone at the hotel is incredibly friendly and greets you with a smile. The swans in the lobby are elegant, the rooms are spacious, the two flat screen TVs are luxurious and the microwave and refrigerator are super convenient. The free cooked to order breakfast is honestly one of the best I've ever had. I would definitely recommend this Las Vegas hotel if you are looking for quiet option just off the Strip.", "Date": "March 20, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "2", "Overall": "2.0", "Value": "2", "Sleep Quality": "4", "Rooms": "1", "Location": "3"}, "AuthorLocation": "Portland, Oregon", "Title": "“Worst Embassy Suites...”", "Author": "Tweester", "ReviewID": "UR125561929", "Content": "Embassy Suites (ES) is my favorite hotel chain; I've stayed in 20-25 of them in the USA. This one, however, is the worst and is obviously struggling against the newer, nicer hotels. Three words: worn and dated. Examples in no particular order: Bathroom: dark (two small flourescent tubes), old style tile darkened grout and mildewed, old shower head that drooped down and would not stand up, 7' ceiling, black-painted mirror frame with chipped paint allowed me to see only up to my nose (had to be low due to the ceiling and large frame) I am only 5'11 1/2\", no exhaust fan, steamed mirror, sloppy caulking job, patched/repaired ceiling. Coffee Bar: Coffee maker did not work (replaced), refrigerator did not fit, stuck out 2+ inches, was slanted so door could not open all the way. Old, uncomfortable and mis-matched furniture. Old fashioned striped carpet. Lamp plug-in for laptop did not work. No HBO or normal Pay-Per-View movies. Atruim is dark with old-fashioned dark green carpet, plants with two swans messing up the water feature...all just so 70's. Again, I LIKE Embassy Suites!! This one is in sad shape and looks like it is not doing well enough to invest in the major updates it needs. I will stay at other ES', but never this one again until I hear it has been refurbished.", "Date": "March 3, 2012"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Overall": "2.0", "Value": "3", "Sleep Quality": "2", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Enkhuizen, The Netherlands", "Title": "“Average property and rather noisy”", "Author": "747jet", "ReviewID": "UR125555295", "Content": "This older property hosts two pet swams in the foyer, which make for a rather interesting show on check in! Not quite sure why they are kept indoors in a chlorinated pond! In any case, the 6-floor complex is situated near to the airport and has a good shuttle service to the airport and indeed to the Strip. It is doable by foot, but no dohbt in the summer, you would be glad of the air-conditioned shuttle service. Check in was a problem when as Diamond cardholder you are told that there is a room ready but the manager won't release till closer to the standard check-in time. We were allocated a suite on the sixth floor: the HHonors floor, but we are still not sure what the difference was between these suites and the other suites on floors 1 to 5! The suite itself was boxy and not as large as we have had at other properties. The decor was good but the soft furnishings were dated, especially the bathroom. We asked for the sofa bed to be made up so on return from our show, we could get our son into his bed quickly. The check-in staff member looked inquisitively at us, and surly replied \"ok\" with a rather unusual expression. The problem was that there were no extra pillows etc in the closet. On return, one of the seat cushions had been tossed up on the sofa and nothing else had been done...still no pillows etc...fed up, we popped two on the sofabed from the main bedroom. The evening noise in the hotel was not caused by the guests but by the powerful winds whipping up fans built into the walls, fairly close to our suite. The same receptionist as earlier in the evening couldn't have been less interested and offered to send an engineer to look at the problem. Half an hour later the racket was still as bad and the receptionist again was totally disinterested and couldn't update us on what the engineer had sorted...or not in this case! Breakfast was illogically set up, with two staff members having a great conversation in Spanish whilst the guests were waiting for tables. All they did whilst breakfast was in full swing was clear tables when it suited them. There was no hot water for tea and the orange juice machine was just dispensing water... The chef, however, ran his own efficient show and was cooking all the breakfasts extremely well and in an organised fashion! Check out was brisk as the manager just winked and said I was all set, even though I hadn't seen a bill. The system was down and was promised an email with the bill...still waiting! Not impressed! I would return to Vegas, but wouldn't stay here again.", "Date": "March 3, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "2", "Overall": "3.0", "Value": "3", "Sleep Quality": "3", "Rooms": "2", "Location": "3"}, "AuthorLocation": "USA", "Title": "“Just OK...”", "Author": "texbambam", "ReviewID": "UR124022670", "Content": "Stayed in this hotel several times and everytime the drains were plugged up. The sink was stopped up as well as the shower. The shower curtain was almost falling off the wall. It was one of those curved ones, but it bent down and as a result would not say closed. I reported it and nothing changed. Happy Hour is always great, breakfast was good. Just so you know what to expect from the rooms. It's a little off the beaten path so walking is not an option, and during shows taxis are hard to come by. They are not on the show suttle route so you have to rent a car.", "Date": "February 2, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "3", "Location": "5", "Rooms": "5"}, "AuthorLocation": "", "Title": "“Excellent hotel”", "Author": "Hernandezmm", "ReviewID": "UR124022431", "Content": "The hotel is very clean, the hotel is very nice, the food is great. Excellent hotel.", "Date": "February 2, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Worthing, United Kingdom", "Title": "“Vegas in November”", "Author": "pennych", "ReviewID": "UR122757896", "Content": "We stayed in this Hotel in November 2011. We had a very pleasant stay, large rooms . The breakfast which was included in the price was huge and eggs cooked to order. The staff were very friendly and helpful & it was nice to have the use of the shuttle bus.", "Date": "January 8, 2012"}, {"Ratings": {"Service": "2", "Cleanliness": "4", "Overall": "2.0", "Value": "1", "Sleep Quality": "1", "Rooms": "2", "Location": "3"}, "AuthorLocation": "Palo Alto, California", "Title": "“Sadly not our cup of anything..”", "Author": "HPTravelGuy", "ReviewID": "UR122732716", "Content": "I am not keen on being negative, but here are some suggestions: Monitor your front end staff, perhaps expand your reception options and without a doubt the beds or bedding need to be replaced they felt several years old. Your house staff work hard to clean around the clock every employee should take on the effort. I will remain loyal to Hilton but I can't promise a return to this specific property right away.", "Date": "January 7, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "3.0", "Value": "4", "Sleep Quality": "4", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Cincinnati, Ohio, United States", "Title": "“Mixed”", "Author": "Darius S", "ReviewID": "UR122417741", "Content": "I have mixed feelings about this hotel. It really depends on your expectations though and why you are staying there. It is a decent (adequate) hotel off the strip if you are in Vegas on business or would like to use it as a base to travel in the country. If you are there for fun, to visit shows and to enjoy all that the city has to offer, this may not be the hotel for you. My wife and I stayed there because I was using my Hilton points for our getaway break. We had a car rental and traveled a lot, but we also wanted to enjoy night activities in the city. I previously stayed at the Venetian, and that was a big contrast, but again, it depends on your expectations and needs.", "Date": "January 2, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "N.W. Florida", "Title": "“This place was amazing...love it and recommend it.”", "Author": "flgirl4u", "ReviewID": "UR122304350", "Content": "They offered free home cooked breakfast every morning, clean and large rooms, and free shuttles to a casino. We loved every minute at this hotel. You will enjoy all the perks.", "Date": "December 30, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "3"}, "AuthorLocation": "amsterdam", "Title": "“Gem off the Strip”", "Author": "piddyman", "ReviewID": "UR122138694", "Content": "My wife and I stayed here while I was doing demos at the SEMA show. I had thought I had booked us at the Embassy Suites Convention Center but it turns out I had chose the airport location. I'm very glad I did as the Convention Center location is a bit more threadbare, busy and noisy compared to this location. Granted, its a bit of a walk from the convention center but its well worth it. Great staff, the rooms are in a good state and the ambiance of the hotel is relaxing. The breakfast is good but somehow wish it could be better as it seems to come up short to other Embassy Suite stays I've had. I definitely plan on staying here next time I'm in town.", "Date": "December 27, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Lake Powell, Utah", "Title": "“Two swans in the pond and koi brings joy.”", "Author": "Ekim A", "ReviewID": "UR121609354", "Content": "Like most if not all Embassy Suites, my stay was enjoyed with the likes of the comforts of home. Jason and other front desk staff were very helpful.. Every other staff member encountered were smiling and just as pleasant. Shuttle service and driver were much appreciated. I was a king in a palace away from my own.", "Date": "December 10, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "evesham", "Title": "“brilliant stay off strip but highly reccomend it”", "Author": "debbieEvesham", "ReviewID": "UR120918174", "Content": "myself and my partner stayed here in september and loved it the suite was brilliant loads of room, and the pool was so lovely even though we was off strip i prefer that and it wasn't too big and noisy , we had a car so we got around ok we would go back again the brekfast was cooked how we wanted it we just dont have a bad word to say about this hotel it was well worth the money", "Date": "November 22, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Cincinnati, Ohio", "Title": "“A great retreat from a Las Vegas conference”", "Author": "willi2k7", "ReviewID": "UR120859974", "Content": "We were at a conference in Las Vegas at the hard rock hotel but we are not into the over the top loud casino scene so we booked the Embassy Suites. What a find, there are no slot machines, the hotel is light and airy, the staff is great coming up with good food suggestions. The breakfast was great we fared so much better than our other conference friends, they do feed you well. We had lunch at the restaurant good choice and again very good. The pool looked lovely but I was too busy to spend time out there, but during the day the bar area is a great place to work if you don't want to be in your room. Internet is great value $4.99 per week. My only complaint was that our maid maybe overdid the fabreeze but the room was clean we used the sofa bed which was comfortable. Location is great really close to the airport but you don't hear the jets, there is a CVS on the same block, a lot of restaurant choices and the strip is about a 20 brisk walk away so you are probably looking at getting a taxi back at night more because of sore feet than anything else. The area felt safe, there are sidewalks although some are uneven, the biggest problem as a pedestrian is that there are very few crossing lights, both around the hotel and the strip in general. If I'm ever in Vegas again for pleasure, I'll stay at this hotel because it served as a great base", "Date": "November 21, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "2", "Overall": "1.0", "Value": "1", "Sleep Quality": "3", "Rooms": "1", "Location": "4"}, "AuthorLocation": "Andalusia, Alabama", "Title": "“Stolen Property”", "Author": "CindiCross", "ReviewID": "UR120530549", "Content": "My son and I had a wonderful weekend in Las Vegas that was only marred by the theft of my one dressy outfit. Who would think that a hotel would be unable or unwilling to get to the bottom of a stolen outfit? I attempted to contact housekeeping 7 times and received only 2 return phone calls. I asked for the general manager to call me and in fact left voicemail for him but missed his one attempt. Needless to say I am livid! The outfit was left in the bedroom closet and the hotel was contacted within 2 hours of checkout. I made repeated attempts over the next week to have my outfit located and returned but was met with a myriad of excuses...the maid who cleaned the room was out until the following Wednesday and could not be contacted at home (really?)...the head housekeeper was unavailable..etc.", "Date": "November 13, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "2", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Dallas, Texas", "Title": "“Awesome hotel”", "Author": "Sweetdeesignz", "ReviewID": "UR120438288", "Content": "Not sure why they call this the Airport location i didnt hear one plane. Pros: awesome rooms hotel staff was unnaturally nice which is exactly what a guest wants to see Restaurant was tasty room service was prompt and the hotel allows local advertisements from nearby restaurants under the door. I ordered food every night.....sooooo awesome OMG they have this store on the inside that works on the honor system soooo cool Con The beds were loomed by Satan. I had to go buy a heating pad and sleep on it just to walk again.", "Date": "November 10, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Colorado", "Title": "“Good off the strip place to stay”", "Author": "Bucketfoot", "ReviewID": "UR120387536", "Content": "We stayed here in June for a trip primarily to go see Beatles Love. Between work and family travel, ES has become one of our first choices when available. For us some of the positives were that it was off the strip, the general location, the pool and of course the breakfast. The biggest negative is by far all of the airplanes.", "Date": "November 9, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "1.0", "Value": "2", "Sleep Quality": "1", "Rooms": "5", "Location": "2"}, "AuthorLocation": "Southern California", "Title": "“Not a hotel for sleeping”", "Author": "DBR2", "ReviewID": "UR120054217", "Content": "Every 3 minutes another flight takes off from the airport so don't expect any sleep even with earplugs. Was here for a business meeting and am sure I did not get.a full hour of sleep despite turning in at 9 pm. Restaurant is only average but pricey. And I am disturbed by the fact that 2 swans live inside this hotel lobby with only a very small pond. I can't imagine this is the life they were meant to live - no fresh air or sunshine. Yes, as the sign reads, they have no predators here but at what psychological cost?", "Date": "November 2, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Charleston", "Title": "“If you want to stay near the strip but not on the strip”", "Author": "kendarCharleston", "ReviewID": "UR119914802", "Content": "Stay was okay. Cooked breakfast was good. Compared to other Embassy Suites there was not much of a selection for fruit. Shuttle hours end at 930 pm so you will need to catch a taxi or drive yourself if you are going to come back after that time. Most of the parking in the parking garages on the strip is free. Recommend using parking garage at Planet Hollywood. You will not have to go on the strip and get in traffic to park here. There were stains on the carpet in my room. Otherwise, the room was clean. Desk staff was very friendly. Ask for a room that doesn't face the front entrance unless you do not mind the University of Nevada Las Vegas band practicing across the street at night or track team practicing at 6am in the morning.", "Date": "October 30, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Atlanta", "Title": "“Clean and well kept”", "Author": "AtlantaVacationGirl", "ReviewID": "UR119875729", "Content": "We chose to stay at this hotel the night before a conference due to our conference hotel having a rate 3x higher the night before. We were pleasantly surprised at how clean the hotel was. The staff was also very nice. It's not a good location if your plans are to spend a lot of time at the strip though. Breakfast was very crowded, and there was a line through what seemed like most of the time breakfast was being served. We did not get to eat breakfast, but the nighlty manager reception was good.", "Date": "October 29, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "1"}, "AuthorLocation": "San Diego, California", "Title": "“Truck Broken Into”", "Author": "larry m", "ReviewID": "UR119005695", "Content": "My truck was broken into in the parking lot of the hotel 2 times within a period of 10 days. They stole my stereo while the alarm was sounding and the \"privately contracted security company\" was no where to be found EITHER TIME. The manager told me to file a claim knowing it would be denied to delay the group I was with from finding out before its departure. Transients bathe in the swimming pool at night and have to be chased away from the area. There are no security cameras in the parking area and the hotel has no staff security. Anyone can enter, break and enter, and do just about whatever they want to as if by the hotel managers approval. They are apathetic and nonchalant in attitude. I wonder what kind of responsibility the hotel would have to assume if I were injured in the break in of my truck in their private parking lot??? If you want to be safe, don't stay at this hotel.", "Date": "October 6, 2011"}, {"Ratings": {"Location": "4", "Overall": "5.0", "Value": "5", "Service": "4", "Rooms": "4"}, "AuthorLocation": "Aberdeen, MD", "Title": "“Great hotel”", "Author": "Margareeta", "ReviewID": "UR118159210", "Content": "I actually visited this hotel in May 2008 and have been wanting to return ever since. The location is great but if you want to partake of the strip, get a rental car. It's just easier and all of the casinos have free parking. Fortunately it's across the street from the Hard Rock. Las Vegas is fun and exciting but this hotel allows you to take a break from it. Making sure we were at the hotel for breakfast (which is EXCELLENT) and the daily happy hour helped us not lose track of time which is very easy to do if you're in Vegas. It's off the strip but not too far. The pool is nice and quiet and the staff had self-serve water that was infused with cucumber or lime and herbs in the lobby...it was a small touch that made a huge deal. The rooms are spacious with microwaves and refridgerators which is unheard of on the strip. The atrium is beautiful like most Embassy Suites. I've stayed at several other hotels in Vegas and this is my favorite so far. Great value.", "Date": "September 15, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "4"}, "AuthorLocation": "Amsterdam", "Title": "“Highly Recommended”", "Author": "Mike_Vactioner", "ReviewID": "UR117955551", "Content": "Absolutely first class with a 5* rating for value for money. Rooms are great with large LCD TV's in both living room area and separate bedroom. Staff are very friendly and extremely helpful. Complimentary shuttle bus will take you to the strip and back and also to the airport (Don't forget to give Sam the driver a good tip...great guy) .......and they have the added bonus of managers reception with 2 hours of free drinks and a made to order free breakfast. Previously I'd stayed at the 5* hotels on the strip.....never again, next time I'm in Vegas I'll be back for more at the Emabassy Suites.", "Date": "September 11, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "4.0", "Value": "4", "Service": "5"}, "AuthorLocation": "Amsterdam, The Netherlands", "Title": "“Great place to stay, wonderful staff”", "Author": "KesterMeijer", "ReviewID": "UR117449503", "Content": "The service at this hotel was very good. At warm welcome at checkin, and they had used my HHonors preferences and we got a room on the top floor which is reserved for HHonors members only. The room was spacious and had a small living area with kitchen (microwave and fridge), couch (pull-out bed with a thin mattress), sofa and desk. The bathroom was standard, the bedroom had two queens, various drawers with iron and board. Both living area and bedroom had a LCD TV. Everything was neat and tidy, and we could sleep well on the beds provided. The room did not have a safety box to keep items like laptop/ipad/passports. Breakfast was complimentary with hot and cold beverages, fresh fruit, bread and danish, and a cook to order kitchen for eggs, omelettes and waffles. We liked this a lot, a good start of the day. During weekends the offering is scaled down a bit, but that is not a big issue. The hotel was close to the airport and a few blocks from the strip. The parking was free. As most casino's offer free self parking, it's pretty easy to drive from the hotel to a casino of choice and walk around. Wifi is USD 5 per 7 days, a great deal, this should be standard for all hotels. The hotel has a nice outside pool, towels are regularly provided and refreshed. Every day there is a complimentary drink during happy hour. Management apparently invests time and care towards the staff, which in return shows off in the friendly and service oriented atmosphere towards customers. Summarizing, a great place to stay for a family due to a room with living area, wifi, swimming pool, and last but not least service with a smile!", "Date": "August 30, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "San Jose, California", "Title": "“Great stay at Embassy Suites”", "Author": "SJscrapbooker", "ReviewID": "UR117202875", "Content": "My family vacationed in the area last week and stayed at the Embassy Suites in route to and from our other vacation sites. This is a typical Embassy Suites, with a full cook-to-order breakfast. The property was in excellent condition and our room was also clean and comfortable. The light in the room was rather dark, including the bathroom. The Manager's reception included some Costco type snacks (pretzels, goldfish crackers, chips and salsa) and some cut-up vegetables with dip. It was quiet except for the occassional noise from incoming airplanes approaching the airport. Embassy Suites has a shuttle which will drop you off on the Strip and then pick you up. We would stay here again.", "Date": "August 24, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Bakersfield, California", "Title": "“An Excellent Deal”", "Author": "foxmooder", "ReviewID": "UR117136116", "Content": "I gave this hotel a 5, not because it was perfect and fancy. It's decor and furniture is not nice as the Bellagio's or the Hotel at Mandalay Bay's. But the value you get is great. The hotel is about a 2 minute drive from the strip or Caesar's Palace and Ballys. The rooms are clean and spacious. There are two flat screen TV's, refrigerator, microwave, separate sink and plenty of closet space. The pool was cold but not crowded at all; there were plenty of towels at the pool. The hotel was overall pretty quiet; did not hear much from our neighbors. The manager's receptions everyday from 5:30-7:30 PM was a plus. They give you unlimited drinks: beer, wine, mixed drinks of the day, soda, juice, etc. Plus there are snacks like pretzel, chips, and popcorn. The breakfast was pretty good. On the weekend, it closes at 10:30AM and 9:30AM on weekdays. No line for cereal, fruit, bagel, beverages, danishes, yogurts, scramble eggs, sausage or potatoes. There is a line for the made to order hot foods: personalize omelets, hashbrowns, bacon, french toast, pancakes, eggs the way you like it. The average wait for this hot food was about 10-15 minutes. The staff here was polite and nice; not overly fake friendly (that make you feel uncomfortable) like at some hotels/resorts. In the evening, they even surprised us with two free mini water bottles and two bags of snacks. We would definitely recommend this for anyone traveling to Las Vegas if their intentions are to get a great deal on a budget and get a clean restful sleep. If you want to smell like smoke, gambling all night long and want to be pampered, then go somewhere else.", "Date": "August 23, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "4.0", "Value": "4", "Service": "4"}, "AuthorLocation": "Evergreen, Colorado", "Title": "“Above average - off the strip, but not too far...”", "Author": "Travelin_Man069", "ReviewID": "UR116684928", "Content": "This hotel is comprabable to about every Embassy Suites hotel I've stayed in. Very clean and spacious, but even after the recent renovation still showing it's age a bit with certain decor/furnishings. The managers reception (free snacks and beverages-even adult beverages) and fantastic cooked to order breakfasts are always a plus. My favorite part about this one is that it's off the strip (I do a lot of business in Vegas), but it's right across the street from the Hard Rock - so you have at least a few good dinner and nightlife options there, and you can catch a cab within seconds. If you're too far off the strip it can be a pain to call a cab and wait... I'll stay here again next time I'm in town.", "Date": "August 14, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "4.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Montreal", "Title": "“Great value hotel, quiet for Vegas”", "Author": "Vic28", "ReviewID": "UR116584671", "Content": "I was here on business; big plusses were the free hot breakfast buffet with an omelet station, free wifi, free shuttle to downtown and the airport (none from the airport, unfortunately). The front desk staff were fantastic (especially Jason) as far as taking care of all requests. The hotel has no casinos or night life, so might be dull for some, but can also be considered an oasis from the strip. Apart from breakfast, the restaurant is very limited, though adequate. The rooms are quite large, with a sitting area, and utility kitchenette. Not luxurious, but adequate and functional.", "Date": "August 11, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "4.0", "Value": "4", "Service": "4"}, "AuthorLocation": "San Diego, California", "Title": "“Nice Hotel Away from the Strip”", "Author": "JacquiSanDiego", "ReviewID": "UR116123389", "Content": "This hotel is always consistent in customer service, room style, breakfast, etc. It was close enough to the strip to enjoy the action and far enough away to get a good night's sleep. It's also right behind the Hard Rock Casino so you can walk across the street and do some gambling. The room was clean and the breakfast was excellent. This was a great value for a family of 3. We will definitely stay here again.", "Date": "August 1, 2011"}, {"Ratings": {"Cleanliness": "3", "Sleep Quality": "3", "Overall": "3.0", "Value": "3", "Service": "3"}, "AuthorLocation": "Stavanger, Norway", "Title": "“Overall a comfortable family hotel”", "Author": "LivingInNorway", "ReviewID": "UR116066536", "Content": "We chose this hotel for a Las Vegas family vacation because we could sleep 5 in a room. Lovely pool, helpful front desk staff. Room was standard ES. The shuttle to the strip is fine for getting there but impossible to catch to get back to the hotel - it drops off and drives away so if you are not there at the precise moment it stops you are out of luck. We ended up taking a cab every single time rather than wait an hour for it to come back. Breakfast buffet was pretty standard although they really need to have an option of serving your own food if you don't want an omelette. Lines for hot food in the morning exceeded a 30 minute wait.", "Date": "July 31, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "4.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Seabrook, SC", "Title": "“Great experience”", "Author": "SandalSenora", "ReviewID": "UR115546309", "Content": "This has been all about the people. You have great employees, from Jason at the front desk to Armando in the kitchen to the very friendly employees we pass in the halls who say hello. Some suggestions: more trash cans in the rooms! One is not enough. Also there are no towels out at the pool today by 1:00 pm, which is a surprise.", "Date": "July 19, 2011"}, {"Ratings": {"Cleanliness": "3", "Sleep Quality": "4", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Ottawa, Canada", "Title": "“Excellent”", "Author": "kn0ws_what_she_likes", "ReviewID": "UR115265635", "Content": "Stayed here for the last 3 nights during a 9 day trip w/ husband and 2 teenagers. Awesome made-to-order breakfast (they close @ 9:30am sharp), attractive pool area w/ plenty of clean towels available,fabulous happy hour with free drinks and simple snacks everyday from 5:30-7:30 pm (food was continuously topped up or refreshed) this is especially handy if you're planning a later dinner out, small store on honour system - great idea - free, well lit parking, front desk had laundry soap to lend for using washing machine, all staff smile and acknowledge you coming or going. Smoke and noise free yet close to all the excitement. If you want to stay with the Kardashians stay on the strip...if you want to stay with the Cunninghams then stay here.", "Date": "July 11, 2011"}, {"Ratings": {"Cleanliness": "1", "Sleep Quality": "2", "Overall": "2.0", "Value": "2", "Service": "4"}, "AuthorLocation": "Norfolk, Virginia", "Title": "“If you love a room that smells of beer, this is your hotel!”", "Author": "TSpriggs65", "ReviewID": "UR115245166", "Content": "It gets better. Outlet for the desk was dead, A/C loud and barely functioning, pillows were LUMPY and WELL used, and best of all, as my 10-yr old was zipping up her bag, a cockroach crawled up her leg! Yes, I'm serious. Oh, she was a basket case for a while. Kids said the pool was GREAT. Overall, very disappointed in this Embassy - I am a Diamond member who stays at E/S a lot, my advice to vacationers - and this is based on vacation stays in Embassies in Orlando (Disney World), Santa Ana (Disneyland), Puerto Rico, Williamsburg VA, and now Las Vegas - avoid these Embassy Suites in vacation hot spots because the hotels are used and abused and not well kept, unfortunately.", "Date": "July 11, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "2.0", "Value": "2", "Service": "1"}, "AuthorLocation": "Chicago", "Title": "“Nice building, terrible service”", "Author": "Ronedog", "ReviewID": "UR115068142", "Content": "We were impressed the first 10 minutes that we were there. The room was spacious and clean, the bed was comfortable, and the fitness center was decent. Then we realized that there was no shower curtain, and we had no shampoo. Repeated calls to the Front Desk, the Guest Services line, and the Manager on Duty did not even result in anyone picking up the phone. Thankfully neither of us slipped in the standing water on our bathroom floor - if we had, a call to the front desk would have been useless! The next morning we headed down to enjoy the cooked-to-order breakfast that this hotel proudly advertised. The line was over 45 minutes long - and there were no special conventions at the time. We proceeded to the self-serve instead, and found stale pastry, utterly bland eggs, and weak coffee - which we ate from an end table while sitting on a couch in the lobby, because there were no open tables in the eating area. We took the advertised free shuttle out to the Strip, but had to pay for a taxi back to the hotel because the shuttle only runs in the morning and at night. For the same reason, we had to pay for a taxi to the airport (despite the \"shuttle service\"). We were frustrated to have paid for an Embassy Suites hotel, only to receive worse service than at a Super 8. If you're looking for a well-serviced mid-market hotel off the Strip, look elsewhere.", "Date": "July 5, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "1.0", "Value": "1", "Service": "1"}, "AuthorLocation": "Los Angeles, California", "Title": "“Never coming back”", "Author": "Ffxgurl19", "ReviewID": "UR114853659", "Content": "So my boyfriend and two friends stayed here this past weekend. It got really good reviews and it was a great price for being relatively near the strip ($132/night with the AAA discount) so why not? Biggest mistake ever. First of all, my itinerary said that the total (including taxes) would be about $443. When I checked in, the lady told me it would be $510! She didn't even ask for my AAA ID even though it was \"required\" to receive that rate. We even got someone on the phone on the 800 line who CONFIRMED and told her that that was the amount we were to pay. I asked her why the price was increased and she kept saying \"oh well, that's what it says in the computer so I can't do much abut that\" Uh, what kind of explanation is that? After trying to make sense out the rate increase with her (She was completely incompetent) my boyfriend stepped in. She then says \"Oh well, we require a deposit. I explained that to her\" (which she did NOT) And another thing, I had no idea there would be a deposit! There was no mention of that ANYWHERE. Basically, I did not have enough money in my account to pay for the room at that moment, so they authorized me for $300 and I would pay the rest later, which was nice, don't get me wrong. But oh boy I felt like a fool later on. I went back the following day to pay the rest since I came up with the money, and was told my total would be $473, since the guy was \"nice\" enough to only charge us $30 for a deposit. That was complete b/s by the way. By the time it came for us to check out, they sent us a bill for $590! WAY over what I was told, and I was told about 3 different amounts for how much our stay would be! COMPLETELY RIDICULOUS. We hassled the manager and he said the best he could do was take off $50 (he was a complete tool to us by the way, overly fake nice but extremely rude). I could keep complaining but bottom line: DOUBLE CHECK HOW MUCH THEY ARE GOING TO CHARGE YOU. I paid over $100 what I was expecting to pay which no one should ever have to deal with. They also neglected our room, we asked for extra towels and blankets which never came. The rooms are nice and quiet, but hell I would have rather slept on the damn street in the Nevada summer heat had I known I would have to put up with that. Be advised - the people who work here are completely incompetent and they have terrible business ethics. I DO NOT RECOMMEND - GO SOMEWHERE ELSE. Oh hey, one last thing. The Marriot is better ;) I will never stay at a Hilton brand again.", "Date": "June 29, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Charleston, Illinois", "Title": "“Loved it”", "Author": "panagirl", "ReviewID": "UR114719082", "Content": "Nice hotel....close enough to strip to walk. The big breakfast and manager's special was enough food that we only had to buy one meal out!", "Date": "June 24, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "4"}, "AuthorLocation": "Bangkok", "Title": "“Great. Quiet Hotel. Non smoking”", "Author": "Bangkokjim", "ReviewID": "UR114706130", "Content": "we stayed here with our family and found that the hotel is just one family needs what it wants to avoid the noise, smoke, and drunks that populate Las Vegas. Like all Embassy suites, the room was quite big and the beds were comfortable.", "Date": "June 24, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "4.0", "Value": "5", "Service": "4"}, "AuthorLocation": "Stockholm, Sweden", "Title": "“Highly recommended Hotel”", "Author": "Nikon", "ReviewID": "UR114629111", "Content": "Had 2 rooms for five nights. Booked the rooms through hilton.com. The 2 room suites were spacious and comfortable with 2 duble beds, sofabed, kitchenette and 2 large TVs. View was perfectly OK. Pool was good but could need som areas with shade. The complimentary breakfast was very good and staff was very friendly and helpful. The complimentary managers reception with a free drink and snacks is a plus. Hotel is located outside the Strip. The Strip is easy to access via the complimentary shuttle bus or with taxi. You can even walk to the Strip but maybe not on a hot day. I will probably stay here again if visiting Las Vegas. Highly recommended.", "Date": "June 22, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "4.0", "Value": "4", "Service": "3"}, "AuthorLocation": "vancouver", "Title": "“Memorable stay”", "Author": "vancouverfuntraveler", "ReviewID": "UR111169284", "Content": "My husband and I stayed for 4 days on May 28-June1 Although it was Memorial weekend and it was quite busy, we never felt it. Enjoyed the quietness and relaxing feel of the Hotel, also appreciated the non-smoking atmosphere! The breakfast was very good, eventhough Sunday and Monday was quite busy, we did feel that the staff making breakfast were tired and lacked a cheerful attitide. As well I need to make mention that Jackie the evening shuttle driver has some personality issues, one day she can be very friendly and at other times very rude, poor customer service. This is new for us because we have been to many Embassy Suites in fact this is the only chain we like to stay with, and all their staff is generally very friendly and very customer oriented. With that said, we have to make special mention of Day the bar tender who went out of his way to make my husband happy, he did not have all the ingredients at hand and when it was not busy left his post to go and get what he needed to make my husbands cocktail and then looked for us to give it to him personally. WHAT SERVICE!!! We also want to thank Jonathan morning shuttle driver who very kindly drove us around and gave us very good tips about places to go. The suites are always well looked after, I appreciate the high standard of cleanliness.", "Date": "June 2, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "3", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Philadelphia, Pennsylvania", "Title": "“Very nice place right near the strip”", "Author": "SGtravelgal", "ReviewID": "UR110755553", "Content": "We had a great stay at the Embassy Suites. We arrived early and were able to get right into our rooms. Despite the early hour (11am) we were still able to eat lunch in the spacious lobby. The lunch food was reasonably priced and came out in large portions, the burgers were awesome and the staff was incredibly friendly. The also offer a daily buffet with food cooked to order, omlettes, pancakes, bacon and sausage, hash browns, etc. They also have a nice variety of cereals, juices, fruits, and other items. At 5:30 each night there was a reception in the bar with 2 hours of free cocktails and appetizers. Cocktails were great and the appetizers were minimal but still a nice little snack before dinner. Rooms were very clean and requests for extra towels and coffee cups were brought right to us quickly. The couch pulled out into a decently comfortable bed which was nice for our large crowd. Overall a nice experience, I would stay here again.", "Date": "May 31, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "3", "Overall": "2.0", "Value": "2", "Location": "2", "Rooms": "2"}, "AuthorLocation": "Wellington, New Zealand", "Title": "“Really disapointed...not what you expect from the Hilton Brand.”", "Author": "tspeiris", "ReviewID": "UR107454554", "Content": "Totally disappointed. Rooms needed more light. Even the bathrooms didnt have enough light, even to shave. The location was not great. If you are planning to enjoy the stip, this is def. not the place to be. Their shuttle is not reliable. They said it goes at /30 every hour. But the driver says we have to call the hotel pick us up. Didnt make. Any sense and they werentcustomer focuessed at all. The male driver was great, but the woman was not helpful at all. The hotel free breakfast wasn't consistent either. First day it was great. Second and third day it was real bad. One day we asked for the food with out cheese. Surprise @ meal was with cheese. Not recommended to anyone. Not worth the money. Hotel management should take drastic decisions to change this around. This is going downhill.", "Date": "May 9, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Las Vegas, Nevada", "Title": "“Best Sleep I have had all week”", "Author": "CallieCanzoneri", "ReviewID": "UR105325858", "Content": "The staff was great, the breakfast excellent, the rooms neat and clean", "Date": "April 24, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "3", "Overall": "2.0", "Value": "4", "Sleep Quality": "1", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Anacortes, Washington", "Title": "“Deeply frustrating”", "Author": "AMMI", "ReviewID": "UR101837159", "Content": "Doesn't strike me as a service-oriented organization. Good people and all friendly enough - please don't get me wrong - I think everyone meant well enough but it just isn't an organization equipped for excellence or equipped to understand business travel. - Nice gym, but empty water dispenser on one workout. - Room service food was delivered on dirty tray. Acceptable food - not really good, though. - Glasses in room still had streaks and fingerprints. Sticky coffee table at check-in. Clean-up service stopped leaving disposable coffee cups for me to use. - There was debris inside the coffee maker \"clean water\" reservoir. - Phoned, yes, TWICE by front desk when I was trying to sleep - was here to work from about 5 pm to about 3 am... had to sleep through the morning. They said they NOTICED my \"do not disturb\" sign (which I hoped would have suggested something about my willingness to accept phone calls from the front desk!) asking me if I wanted maid service. Thanks for asking, but please honor my 'do not disturb' sign! Not everybody is hung over and absent-minded in Vegas. - Had to do laundry twice. Coin-operated machine. First time, the desk barely had enough quarters for me. Second time, I was advised to walk down the block (2 am) and ask one of the casinos. C'mon - a coin-operated service should be paired with the ability for guests to get coins when needed. - Internet slower than I am used to and inconsistent. Not a biggie, but it added to the sense of \"something is not quite right here.\" - 3 elevators and it still took forever to get to the ground floor. Stairs go to (apparently) alarmed emergency exit doors... not to the lobby. Bottom line, I can accept the place, its slow quirky elevators, its (reasonable-ish for vegas) price. It needs to polish its services to be some help. The laundry situation is the only thing that really got me upset. I'm surprised, disappointed, and really hope my organization doesn't book me here again. Okay... I'd stay here again if I have to - I will just be ready to pay more attention to taking care of myself and won't be relying on hotel services. Oh, and one of the swans in the lobby pond (well-behaved birds!) looks like it has a hurt foot. Other guests I pointed it out to agreed that something is wrong.", "Date": "March 28, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "3"}, "AuthorLocation": "New hampshire", "Title": "“Awesomes breakfast and very friendly staff, clean rooms. great price!”", "Author": "PepsieLola", "ReviewID": "UR101611347", "Content": "Beautiful lobby with koi river and gardens everywhere. The front staff was very friendly and helpful.We were here in transit to one of the resorts in Vegas. If I had my choice I would have just stayed here to take in the jacuzzi/hotubs and watch the swans swimming lazily around the lobby's indoor river. Quiet, casual, and family friendly. Airport close by but the rooms are very sound proof. If you are looking for a place away from the smoke and gambling this is it.", "Date": "March 26, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "2", "Overall": "2.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "3"}, "AuthorLocation": "Bend, Oregon", "Title": "“Did not meet expectations”", "Author": "Dogrunner106", "ReviewID": "UR99027143", "Content": "We had 3 teenagers and beds were supposed to be queens and were fulls. Too small for 17 and 15 year olds to share. Room was very dated and kind of shabby. The light from the parking lot shone directly into our window at night. The airport shuttle only takes to the airport it does NOT pick up and it only runs from 6 am to 9 pm..so if you have a flight that leaves earlier than 8 or 9 forget it... take a cab. Our room was not cleaned until 5pm just as we were getting back from shopping and hoping for some down time. We asked for extra bedding so one of the kids could sleep on the floor and all they brought were 2 sheets...no pillows and no blankets..WOW!", "Date": "March 5, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Claremont, California", "Title": "“This was the best three-day stay I ever experienced in Las Vegas.”", "Author": "krm8611", "ReviewID": "UR98289264", "Content": "I really love the fact that you have NO casino with all the attendant noise and smoke and crowds. The free business center, your complimentary breakfast and hapy hour for guests, as well as your honor-system store shows a respect for your guests--that you are not always trying to take advandage of a captive audience. I have also noticed that the lobby is very kid-friendly: this is a great place to bring one grandkids. The staff was very freindly and helpful in every department, from the moment I walked in the door until my departure.", "Date": "February 27, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Sleep Quality": "4", "Rooms": "3", "Location": "2"}, "AuthorLocation": "San Jose, California", "Title": "“Adequate Stay”", "Author": "EdUrias", "ReviewID": "UR96086458", "Content": "This Embassy Suites reserves rooms for the Gold and Diamond Hilton Members on the sixth floor and I was assigned a corner room (#601) on the northeast side. Our room was a nice room facing the UNLV running track and unfortunately right under the take off path for flights flying to the Northeast. The jet noise is noticeable even in the Manager's Reception area (bottom floor) were we did enjoy some nice drinks and snacks. Breakfast was great as was expected, and hotel is conveniently located near the airport and off the Vegas strip. The other unpleasant item was the mold noted under the toilet, but this ES has some room for improvement. I've included pictures for your review.", "Date": "February 9, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Mansfield, Texas", "Title": "“Great place near the University”", "Author": "Daddie-Ohh", "ReviewID": "UR95589191", "Content": "I have stayed here twice now and it has been a pleasure staying both times. The rooms are clean and the staff is great. Like most Embassy Suites the inside ambiance is very nice. The breakfast is great and on the house'; enjoy a fresh omelet made to order. Evening happy hour is welcome too with free food and drinks. There is a very nice outdoor heated pool too! This hotel is convenient to the UNLV campus. Can't go wrong here.", "Date": "February 5, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Pueblo West, Colorado", "Title": "“Great pladce to stay for business or pleasure.”", "Author": "Candace71", "ReviewID": "UR94310283", "Content": "My husband and I arrived after 9 PM. The hotel restaurant was closed by 9:30 but the desk clerk gave us some good choice of restaurants withing walking distance to the hotel. (We got to try a Johnny Rockets for the fist time.) The hotel pakring lot was full but we didn't hear any sounds at night. Our room was spotless except for some stians on the coverlet. The bed was very comfortable. We did hear some airplane noise but that is understandable since your near the airport. Breakfast was great and the omlet my husband got was one of the best he has every had. They had lemon and mint water in the lobby. It was refreshing. We liked this hotel better than a casino hotel.", "Date": "January 24, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Sleep Quality": "5", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Phoenix, Arizona", "Title": "“Off Strip Gem”", "Author": "desertswan", "ReviewID": "UR93763509", "Content": "The absolute stand out feature of this hotel was the hot, cooked to order breakfast, included in the price of the room. Everything one could desire for breakfst was available, hot off the grill. The omelets were supurb, hash browns glorious, and pancakes fluffy. All of the staff that we encountered were very friendly, polite, and accommodating. The hotel is not within walking distance of the strip, although is not too far. However, we had a car and were able to get around very easily to all of our destinations with the helpful directions from the front desk. There was more than adequate parking at the hotel. The rooms were clean and quiet, although some of the furniture in the sitting area could stand to be updated. The beds were very comfortable and I had no strouble sleeping. I hI enjoyed all three days that we stayed here.", "Date": "January 19, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Brooklyn, New York", "Title": "“If you want the nicest hotel near the airport , dont go anywhere other than here!!!”", "Author": "moebod2", "ReviewID": "UR90207152", "Content": "Amazing newly renovated hotel! Surprised how nice an embacy suite hotel can get!!", "Date": "December 19, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Fort Collins, Colorado", "Title": "“Great Location close to the airport.”", "Author": "boatmisser", "ReviewID": "UR89831407", "Content": "Very friendly, courteous, and helpful staff. Rooms are very comfortable and spacious. Manager's happy hour.", "Date": "December 14, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "3"}, "AuthorLocation": "Sacramento, CA", "Title": "“Great hotel close to the strip.”", "Author": "Ariktravel", "ReviewID": "UR89120213", "Content": "I have been coming to this hotel for several years. Just in the past few days, the bar area was renovated and now has several large flat screens on the wall. The bartender DAY is excellent--not to mention he has been there since the hotel opened. The meeting rooms just were renovated with nice new carpet and wall paper. The catering crew that service the meetings have always been great. If you want to be close the hotel, need a suite and a non smoking-non gaming environment, this hotel is just fine.", "Date": "December 6, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "3.0", "Value": "4", "Sleep Quality": "4", "Rooms": "3", "Location": "4"}, "AuthorLocation": "St.Catharines, Ontario", "Title": "“Bring a safe to lock up your belongings if you're stying here!!!”", "Author": "neilrich", "ReviewID": "UR85975009", "Content": "Was down for 4 days in October. Nice rooms, great pool and amenities, and the staff was great (except for the housekeepers). After the first day of our room not being cleaned i went to the reception and asked for it to be cleaned. We had no towels, no toiletpaper, no soap. A few minutes later a women came with the above and pretty much dropped them on the floor, nice. We had no problems until we complained about housekeeping and this is when things went missing!!! Brand new $100 bottle of cologne went the first day, then a $250 Fossil watch the next day. We mentioned it to the manager on duty and filled out an incident report to which nothing was done. Never recieved money or credit at the hotel for $350 worth of stolen goods. This was very disappointing considering everything else was great. Bring a safe if you plan on staying here!!!", "Date": "November 4, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Tokyo, Japan", "Title": "“Great value & great service off the strip! Will totally stay here again!”", "Author": "LizC_2010", "ReviewID": "UR79339706", "Content": "Great value! I went there for a conference. I will totally stay there for my next trip. The rooms are spacious suites! And you can't beat the quality! The free breakfast was delish! The free happy hour was great! And loved that the room came with internet! The amenities were great! And the staff (especially the front desk staff) were very nice and helpful! Love the swans and the Elvis statue! :-)", "Date": "September 13, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Minnesota", "Title": "“Great Stay Off of the Strip”", "Author": "MinnesotaRandy", "ReviewID": "UR79067615", "Content": "This Embassy is not far from the strip, however they however free shuttle service to the strip AND airport. The staff was fantastic! They went out of their way for us at check-in and also at check-out. We had an early flight and breakfast wasn't ready to be served yet. They allowed us to go into the back breakfast room for the self serve food. The shuttle staff were also great! The room was very clean. Although the pool was not on par compared to the strip pools, it was far less busy and was open until 11:00. The strip pools are only open until 7:00. Compared to typical hotel pools, this pool was outstanding and offered two separate hot tub areas. We would definitely go back.", "Date": "September 10, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "San Diego", "Title": "“Great, quiet place off the Strip!”", "Author": "beachloverSanDiego", "ReviewID": "UR78543844", "Content": "Spent 4 nights at this hotel and it was very relaxing and laid back yet close to all the entertainment of the Strip. It is right across the street from the Hard Rock Hotel where you can gamble. The shuttles were running in the morning until 11:30am and 4:30pm to 9:30pm. The room was very clean and the overall cleanliness of the hotel was second to none. The staff was extremely accomodating and friendly. We chose this hotel based on other reviews and would definitely recommend to others who wish to stay in a quiet place close to all the action.", "Date": "September 6, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Los Angeles", "Title": "“the best hotel I visited in a long time”", "Author": "angel90008", "ReviewID": "UR78158297", "Content": "This hotel was perfect. It wasn't right on the strip but it wasn't that far from it either. It was beautiful. The staff was nice. The rooms were beautiful.There was free drinks and appetizers at night and the best free breakfast I ever had in the morning. You could request to get homemade pankcakes, french toast, omeletts, hash browns, to be made on the spot. You could also get bacon, cereal, pastries, bagels, etc. The staff was all wonderful. The pool and jacuzzi was beautiful. There was a little waterfall, which was a great background for a picture. There was fish and swan on the inside/lobby of the hotel. The hotel wasn't too big, it was about six floors. Everybody was impressed with the room I found for over a little over $100.00. It was so worth the value.", "Date": "September 3, 2010"}, {"Ratings": {"Overall": "1.0"}, "AuthorLocation": "Atlanta, Georgia", "Title": "“Really Awkward Situation...Beware”", "Author": "mcadrenaline", "ReviewID": "UR72888700", "Content": "I stayed here back in December and really enjoyed it, so when I was in Las Vegas last week again I stopped in to see if they had any rooms available... Almost immediately I was accosted by a security guard who made it known that I was not welcome. He asked me who I was there to see. I tried to explain to him I wanted to see if they had any rooms but he rudely cut me off mid-sentence and kept saying \"it's closed for a private party\". He would not say what \"party\" this was but by all the Saudi Arabian soldiers walking around in their uniforms, it appears they've taken over the hotel while they're in Nevada training (I'm assuming)...there's lots of government looking vehicles in the parking lot as well as random satellites and storage containers and stuff set-up. I tried to explain to him I'm a Hilton Honors Gold member, and he got even more rude and basically at that point was showing me the door as if I had already seen too much. He looked extremely nervous and kept looking around. So awkward!!! I understand if they want have the hotel closed for a private group, but you can't be rude to people who simply don't know that AND that are loyal to Embassy Suites. How was I supposed to know?!?!", "Date": "July 29, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Salt Lake City, Utah", "Title": "“Lovely and comfortable!”", "Author": "iamleia2", "ReviewID": "UR70928027", "Content": "There are swans in the atrium! What more can I say?! Really though, this is a great hotel. The staff is wonderful (especially the chefs who cook breakfast! Hilarious!). The atrium is beautiful The parking was good. The room was updated and very comfortable (the bed was awesome!). I read some negative comments about the pool (that it overlooks a parking lot??) but we thought it was great! It has a lovely waterfall and everything! And the fitness center is one of the best I've seen at a hotel (and I've traveled a LOT). As is the breakfast. It's about a 5 minute drive to the strip. It was sooooo nice to get away from the strip at night. Overall, fantastic hotel. Will stay there every time I go to Vegas.", "Date": "July 14, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Minneapolis, Minnesota", "Title": "“Great place for escape of LV commotion”", "Author": "DennisJB", "ReviewID": "UR70672082", "Content": "Very nice hotel 3 blocks off strip. Complimentary breakfast is very good. Managers reception is relaxing. Easy access and free parking if you are driving. There was no airport noise as hotel was 11/2 miles from airport. Very friendly staff.", "Date": "July 12, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Los Angeles, California", "Title": "“great hotel”", "Author": "apsinpdx", "ReviewID": "UR70642411", "Content": "I have been to LV several times and always tried to stay on the strip. This time, since I had extended family, I decided to look for something more economical. I ended up booking a suite on this property. Very glad with my choice. Very well located property, with very clean room, and possibly the most entertaining lobby for little kids. They haven't forgotten the adults - with the 'on the house Managers Reception' every evening, and the made to order breakfast in the morning, you can't go wrong. And before I forget, they have Starbucks coffee in the corridors of each floor every morning!", "Date": "July 12, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "OHIO", "Title": "“Clean, comfortable and convenient”", "Author": "Raylandridge", "ReviewID": "UR66853883", "Content": "We were on our family vacation in Las Vegas for 4 days then traveled to pahrump for 2 days to visit family then returned to Las Vegas. We wanted to stay at a nice hotel near the airport for our early flight the next morning. Staff went out of their way to make sure our stay was nice. The employee that drove the hotel shuttle offered to take my husband to the car rental the night before to return our van, drive him back to hotel and take us to the airport in the morning. So we would not have to do the return in the morning. Many resturants in close and in the hotel. It is clean, and we always feel safe staying with embassy suites. I would highly recommend staying here. My nine year old daughter especially loved the 2 swans pricilla and elvis in the hotel lobby.", "Date": "June 8, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "3"}, "AuthorLocation": "San Diego, California", "Title": "“Great place to stay in Vegas”", "Author": "tdarrock", "ReviewID": "UR63964633", "Content": "First off, if you want to stay in the heart of the strip, don't stay here. With that in mind, everything else here was fabulous! Staff was very friendly, pool was awesome, cocktails as usual was awesome, and rooms were great. The rooms were in fact very large and included two pretty nice flat-screen tvs, and when one of ours didn't work, they sent someone up in less than a minute who swapped out the bad one for a brand new one. Although it is off the strip, they also have a free shuttle service that takes you to the shops in planet hollywood. Great stay!", "Date": "May 12, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Sleep Quality": "4", "Rooms": "4", "Location": "3"}, "AuthorLocation": "San Diego", "Title": "“Great place to avoid the crowds in Vegas”", "Author": "Sooz2", "ReviewID": "UR63150307", "Content": "We stayed for 4 nights at this hotel, and we have stayed there before--it was almost perfect. We like to get away from the strip with all the noise, congestion, and smoke ... this takes care of that. We bring our car, but the hotel does have a shuttle to the strip. The decor, although not plush, is very nice and newish. Our room was clean and the beds are VERY comfortable. Flat screen TV's in both rooms ... great quality. Nice fruit and other things at cooked to order breakfast. Great drinks at night. The price was reasonable, service very good. My only disappointment was in the towels ... they were just not up to Embassy Suites standards. I probably should have requested replacements, and would next time. We would DEFINITELY go back and I recommend it highly.", "Date": "May 3, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "La Puente ,Ca", "Title": "“Great place to stay..”", "Author": "rexfondell", "ReviewID": "UR58811441", "Content": "Embassy Suites 4315 Swenson. Stayed there twice since January 2010. Each time was great. Very nice rooms , staff very friendly , shuttle van will take you to the strip and pick you back up. Makes the off strip location no problem.Van driver was a very nice guy I think he's name was Rob or Robert , he had great tips about some of the local places to get deals on drinks and food.Do not pass on the free breakfast and free drinks at the bar. The breakfast was surprising awesome.Very quiet hotel , don't mistake that for not being busy because it was .Walking distance to Hard Rock Casino.Overall Just a great place to stay..", "Date": "March 17, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "4.0", "Value": "3", "Sleep Quality": "5", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Chesapeake, Virginia", "Title": "“Some things lacking”", "Author": "Navytravel", "ReviewID": "UR58415618", "Content": "Nice to be recognized as a Hilton Honors member at check-in, however my traveling partner got a welcome package in his room, I did not. No explanation. Rooms a little musty, just did not smell clean or well ventilated. Iron was broken. Room was quiet, bathroom clean. Good breakfast although it did not open until 6:30 which was almost too late for us to make our business appt.", "Date": "March 12, 2010"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "", "Title": "“My Birthday Trip”", "Author": "LeA121", "ReviewID": "UR58152450", "Content": "Enjoyed the hotel, very friendly staff. Conveniently located. If you stay make sure you see Elvis & Priscilla, they are such a lovely couple.", "Date": "March 9, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "3", "Sleep Quality": "4", "Rooms": "4", "Location": "2"}, "AuthorLocation": "Utah", "Title": "“Typical Hilton Quality”", "Author": "disneyloversutah", "ReviewID": "UR57667527", "Content": "Our family stayed one night at this Hotel. Overall, it was an excellent experience. It was typical of any of my experiences staying at any Hilton branded hotel. Our room was clean and comfortable. We have 4 kids, so we stayed in the suite, and we had plenty of room. Our kids loved the large pool, and there are two hot tubs. I'd have to say the best part of our stay was the breakfast buffet the next morning. Wow. You could order your eggs or omelette any way you wished, as well as pancakes or french toast. It was very good food, with excellent service (a person who seemed to be the manager was busily walking around, ensuring tables were cleared and checking in with us from time to time to see if we needed anything). The only downside is it is distant from the strip (which for us, wasn't a big deal). We were a little worried when we drove up and discovered it was right next to the airport, but I didn't wake up once because of airplane noise. I was also a bit bothered that they charge you $1.00 for any phone call you make, even if it is a local call. Just use your cell phone. Otherwise, this is a very good hotel.", "Date": "March 3, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "", "Title": "“Another wonderful stay at Embassy Suites Las Vegas”", "Author": "Mahekal", "ReviewID": "UR56698685", "Content": "We stay at the Embassy Suites near UNLV/Hard Rock hotel every year for an \"over 30\" adult men's hockey tournament. They always take such good care of us and remember us from years past. (Asking us how we did in the tournament, each day, etc.) Many of the staff have been here for years, and are so friendly. We always enjoy breakfast with Armando and Billie Ray (Back after about a year away!), and Day the evening bartender. Extra thanks to Terri in Sales, who helps us coordinate our rooming list and rates. And Gina at the front desk is a great new addition! It's a great hotel for us, and we hope to see you next year.", "Date": "February 21, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Location": "4", "Rooms": "4"}, "AuthorLocation": "San Jose", "Title": "“Nice Place for families to stay in Vegas away from the strip”", "Author": "sunnybad", "ReviewID": "UR54138914", "Content": "Great place to stay with an entertaining breakfast staff. 2 swans graced the atrium. Close to the strip", "Date": "January 22, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "3", "Location": "2", "Rooms": "3"}, "AuthorLocation": "Atlanta, Georgia", "Title": "“Solid Off-Strip Alternative”", "Author": "mcadrenaline", "ReviewID": "UR51567003", "Content": "I'm currently staying at the Embassy Suites Las Vegas (using the free WiFi to write this review too!) and I've been mostly satisfied. -Know what you are getting yourself into with the location before you arrive! This hotel is about a mile off the strip. I suppose you could walk, but it would be a long walk. You'll need to rely on cabs (which are easily accessible in Vegas) or the hotel shuttle, which runs to Planet Hollywood every half hour by request. -If you're coming from the airport, DO NOT TAKE A CAB! Instead, save yourself $12+ and take the #108 bus. It's $1.75, leaves from ground level at the airport and drops you off directly in front of the hotel. Also, the hotel shuttle will drop you back off at the airport (they just won't pick you up when you arrive) -The rooms at the hotel are very nice. They have been redone in a nice modern style with cool wall coverings, artwork, and lots of granite, dark woods and glass accents. 2 LCD TVs in each suite. -I'm not a fan of the bathrooms here. The lighting is just AWFUL...2 small florescent bulbs is all you get and they provide little light. You'll be taking a shower in the dark when you have the curtain closed. Also, the towels here are really bad. Every towel I used either had stains on it, had holes, or felt like sandpaper. I hope they upgrade these soon because they are really unacceptable for this caliber of hotel. -The public areas, while exceptionally clean, are dated. They too have been updated, but still have a late 80's vibe going on. Nice furnishings though and the tropical atrium is nice for kids to explore. -The pool is very nice and big with 2 hot tubs and a waterfall. Lots of seating. Maybe a bit noisy from all the planes taking off at LAS, but I don't mind that so much. -Great managers reception and breakfast each morning. No complaints here. Free food and booze is always welcomed by me (and those drinks were STRONG!) -Free self parking - Walk to Terrible's Casino next door for super cheap food. $10 steak dinners and the like. It's a local hang out, but very cool nonetheless.", "Date": "December 20, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "5.0", "Value": "4", "Location": "4", "Rooms": "5"}, "AuthorLocation": "Middletown, New Jersey", "Title": "“Pretty, Pretty Good!”", "Author": "ExHospitalityPro", "ReviewID": "UR43453654", "Content": "Having stayed at the 'other' Embassy Suites 2 years ago, I decided to stay at this one based on the pool as my family was coming on this business trip. My kids loved the pool, and I did find the staff at checkin, throughout the stay, and at departure to be more than accomodating. Although always a request, the van driver was our own persoanl limousine driver. Of course, i would tip the driver as much as a cab cost, but there was no wait and he picked up right on schedule at the convention center. As stated, this is always a request and not a guarantee of service. The suite were standard compared to other Embassy Suites. Cooked-to-order breakfast service was surprisingly fast (fastest at Lake Buena Vista, FL Embassy Suites), but the back area seemed a little shallow compared to other ES. Dink service depended upon the night - long waits on Fri and Sat, and faster service on other nights. Downside is this hotel is a long walk off the strip, but less than the other ES in Vegas. One side of the hotel does have planes passing, but this did not bother my family (it may for others). Whenever I go back to Vegas", "Date": "September 21, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Albany,NY", "Title": "“great place to stay”", "Author": "tripaholicny", "ReviewID": "UR42400295", "Content": "We had a great service and enjoyed our stay! the front desk men were very helpful and gave us good advice on places to eat. Our non smoking room smelled like smoke and they sent someone right up to deodorize it. Breakfast was fantastic one of the best omlettes I've ever had! ( the cooks are funny and work very hard so even though its complimentary we tipped them every morning) Our shuttle driver at night was also great! We had a great experience and are staying there again when we go out in afew weeks. Walking distance to Unlv and they have a shuttle to bring you to the airport and to the strip. The shuttle does end at 10:30pm and it doesn't run to the airport between 2-4:00 (I think so check) but all in all it was a nice quiet place to stay. The swans were an added bonus for the kids.", "Date": "September 17, 2009"}, {"Ratings": {"Service": "1", "Cleanliness": "4", "Overall": "3.0", "Value": "4", "Location": "4", "Rooms": "4"}, "AuthorLocation": "Phoenix", "Title": "“Desk staff could use some lessons on improving service”", "Author": "LovetoGo_09", "ReviewID": "UR38663468", "Content": "We checked in around mid night. The hotel was very quiet, clean and I noticed they've done alot of upgrades to the room which was very nice. However, it doesn't matter how nice your hotel is when the service is non existant. We arrived in Las Vegas from an International flight so needless to say, we'd been traveling all day. Upon checking into the hotel we asked if there was some where on property that we could purchse milk for our infant who needed a bottle. Mind you, we didn't ask for free milk, we simply asked if there was a way we could purchase milk. You wouldn't think this would be a problem since this is a full service hotel and they have a gift shop. The security guard at the desk said he would look but immediately followed that up with \"There is a CVS down the street\". Needless to say, no one tried to get milk for a screaming infant as a matter of fact they had the audicity to tell us they did try but we watched from the balcany as the desk clerk and security guy continued their conversation. When I went to the desk again they told me I would have to go to CVS and resumed their conversation as though I had imposed. I've received better service from Super 8.", "Date": "August 24, 2009"}, {"Ratings": {"Service": "1", "Cleanliness": "5", "Overall": "1.0", "Value": "1", "Location": "2", "Rooms": "4"}, "AuthorLocation": "CALIFORNIA", "Title": "“Credit Card Stolen”", "Author": "LILLYCALIFORNIA", "ReviewID": "UR38487986", "Content": "Do not stay at this hotel! Yes the hotel is nice, however, someone from the front desk stole our credit card and racked up $1300.00 in illegal charges. The Embassy Suites and Hilton corporation have not been helpful in retribution. The only thing I can say nice about this hotel, is the breakfast chefs are very funny.", "Date": "August 22, 2009"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "3", "Location": "3", "Rooms": "1"}, "AuthorLocation": "EAST COAST", "Title": "“BED BUGS YUCK”", "Author": "CTSPORTSGUY", "ReviewID": "UR38200550", "Content": "I work for a major sports television agency, the big one and our travel office booked here. First night they overbooked the hotel so sent us down to a nicer embassy but told us because our contract was there we had to come back. Upon return then next day, we had to wait until 6p.m. to check in. The Latino girl who was the manager checked us in, and was as caring as a wet blanket. She seemed to be frustrated about something. We proceeded to the room which had a odd odor; me and my colleague were running late so time to call in and complain. When we returned, later to the hotel, the young lady behind the desk (a little over-weight) was chatting with some guy very cozy like. I hope it was not a guest or a personal friend. Any on to the BED BUGS, i took a shower (water took forever to heat up) and got ready to dive into bed and as i pull back covers, i notice dirty sheets and something moving. Called down to desk and phone just rang, upon me coming downstairs i notice same guy being cozy with desk clerk. I ask for another room and explain why and young girl tells me she is sold out. She only had a smoking room, i took that and checked out of that place first thing in the a.m., BEWARE FELLOW TRVLRS, HORRIBLE PLACE, STAFF AND CRITTERS", "Date": "August 19, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Reno, NV", "Title": "“Excellent Hotel”", "Author": "kndrdsp", "ReviewID": "UR37313854", "Content": "Very nice ES. Staff was very nice, especially Brian in Guest Services. Rooms were clean. It was fun to see all the Koi Fish and the two swans they keep at the hotel. Nice quiet hotel off the strip. Would stay here again.", "Date": "August 10, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Location": "4", "Rooms": "4"}, "AuthorLocation": "Omaha", "Title": "“Leave the craziness of the strip behind”", "Author": "Opus345", "ReviewID": "UR37064554", "Content": "This is my second year at this hotel. Usually I stay for a week at a time each year for the Computer Hacker's conferences (Blackhat & Defcon). If you have never been to Vegas, then this location is probably not the right one for you. If you have been to Vegas and have a car, this is perfect. Right across from UNLV on the East side and across from the Hard Rock on the West side. Parking is right outside. The staff are great from the front desk to the breakfast folks to the Coconuts staff. Absolutely the best! The breakfast is fantastic. Be careful about asking for \"alot of bacon\". You could get a whole plate. The evening reception is fun. The pool is great with the little waterfall and hottubs. The rooms are very good. They are extremely comfortable with two flat screen TVs and numerous phones. Does anyone ever use the phone any more? In the last year of traveling, I have only used the phone to leave a wake up call, hmmm. We had a room facing Swenson and did not have any of the plane noise in the room that was noted in a previous request. If your looking for an \"off the strip\" experience, you couldn't ask for a more comfortable and better bargin than the Embassy Suites Las Vegas Airport. Oh yea, don't forget to visit Mt. Charleston, the Hoover Dam, or the Red Rock Canyon, but those are other reviews.", "Date": "August 8, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Location": "4", "Rooms": "4"}, "AuthorLocation": "Los Angeles", "Title": "“Excellent value off strip hotel”", "Author": "yadakings", "ReviewID": "UR33666366", "Content": "Pros: -Very nice hotel, curteous staff, clean and nice room. -Complimentary beverages (including some alcoholic / beer) 530pm -730pm -Complimentary cook to order breakfast (including pancake/French toast/omlette/hash brown + more. Yum!!) -Pull out sofa bed. -2 Flatscreen TVs. -Coi and Geese make your kids happy. -Free wifi Cons: -Off strip, can't walk to strip, it's pretty far, but it's right behind Hard Rock hotel if you really want to gamble with walking distance. -Some airplanes noise which can be heard, not too loud though(fortunately they don't fly at night, so you will still get a good night of sleep) -Small 2 double beds. You can't really fit 2 persons in a bed comfortably.", "Date": "July 1, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Location": "3", "Rooms": "5"}, "AuthorLocation": "London", "Title": "“Good value, quieter than on Strip and great staff. Shuttle to strip and airport.”", "Author": "ShirleyTempleLondon", "ReviewID": "UR32545076", "Content": "Embassy suites are always good value as you get two rooms and a good breakfast included in the price. This hotel was away from the strip (which is what we wanted) and so was much quieter than hotels with a casino. All staff, receiption, waiters, cooks or cleaners were very friendly and efficient. The breakfast was very good - plenty of choice of cereals, bread, cakes, fruit and drinks - and the freshly cooked omelettes were excellent. The hotel runs a free shuttle to the strip between 7.00 and 10.00 am and between 4.00 and 7.00 pm. - and also to the airport. Shuttle drivers were helpful and polite. I feel it would probably be better for guests if the shuttle to the strip ran between 9 and 12 noon as most people don't want to miss breakfast or have to get up so early on holiday. The decor in this hotel on Swenson Street was a little 'tired' - but not scruffy and it was immaculate. We felt a little sorry for the chefs and waiters as hardly anybody ate in the hotel in the evening - I suppost some people used room service. We ate there twice when we were too tired to go out again - the service was fine and the food was good though not gourmet ! It was fun to see Elvis and Priscilla the two swans who live in the pool in the atrium - they seemed very happy to be there. Our one complaint was that whilst we were there a group of teenage girl basket ball players were staying - and they were very noisy - leaning over the balconies and calling to each other - in typical giggly l4 year old manner. We felt the staff should have asked them to consider other guests. Once in our room we did not hear any outside or room to room noise. As the hotel is family friendly there are often a lot of children staying. The swimming pool outside was very pleasant. All in all a very reasonably priced hotel with great staff. Oh and there is also a business centre with two computers for you to check in online or check your emails - rooms are also set up for wi-fi if you have your laptop with you.", "Date": "June 17, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "3", "Rooms": "5"}, "AuthorLocation": "Isle Delfino SMW", "Title": "“Perfect stay at Embassy Suites !”", "Author": "Pino_Spetzberg", "ReviewID": "UR31287385", "Content": "Booked Embassy Suites through Hilton Honors as a free night. After waying up the other Hilton options to use up our points, we decided as it was our first night in Las Vegas following a long flight, it would do the job we needed ie somewhere nice to sleep. Turned out it was so much better than just that. Firstly, we were able to self-park directly outside the lobby, and were unpacking within minutes, very efficient. The room was exactly as we requested, a high floor, non-smoking, room with strip view. Perfect ! The complimentary beverages and snacks served in Coconuts Lounge 5.30pm - 7.30pm were appreciated. The complimentary breakfast is fully cooked to order every morning in the atrium, a lovely setting. We were delighted to see all the fish, and the Royal Swans, also in the atrium, they are named Elvis and Priscilla. The food in the Three Palms Cafe was also very good, as was the service. We were wondering if we would find Swenson Street easily, in fact, it is just around the block from Hard Rock, so no problem at all. Very happy with our choice to stay at Embassy Suites, spotlessly clean, and everything we wanted. Will definitely stay again, even if we have to pay !!!", "Date": "June 1, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Location": "4", "Rooms": "4"}, "AuthorLocation": "Charlotte, North Carolina", "Title": "“Great Location, Sweet Breakfast”", "Author": "jayseae", "ReviewID": "UR29386700", "Content": "We had to use up some miles, so we decided to stay in this hotel based on some reviews. The location wasn't far from the strip, but it's probably too far to walk - unless you just really like walking (we did try it once). They offer a shuttle, but the times aren't terribly convenient. It runs every hour, but it starts late enough and stops early enough that you just don't get enough use out of it, and you'll want to take a cab most times. The times you may make use of it are when you come back to the room mid-day and want to go back to the strip for a show or something. You will be able to take advantage of the included breakfast and the manager's reception, but what you can't do are gamble at the hotel (have to go to a casino for that), and though they have a pool, there isn't really much to see while you do it - you're out in the middle of the parking lot. So if you want to sunbathe, you might want to pick another joint. Other than that, the hotel works fine as a base of operations. It's just not the most scenic place in the city.", "Date": "May 5, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "2.0", "Value": "3", "Location": "1", "Rooms": "1"}, "AuthorLocation": "San Francisco, California", "Title": "“Not Expecting Airplane Roaring Overhead”", "Author": "SOMA_nomad", "ReviewID": "UR28280842", "Content": "Pro Friendly front desk personnel The breakfast cooks were awesome and very entertaining. Con Housekeeping needs a little work (took some dirty towels and tub mat, but didn't leave replacements) and need to pay attention to some of the small things that customers should not have to worry about (like running out of toilet paper). Front desk proudly mentioned the \"heated\" pool with a waterfall. We happend to hit a Vegas cold spell, but the pool was not heated. All the patrons around the pool complained about the ice cold water temperature. Hotel web site described \"up-scale hotel completed a multi-million dollar renovation in 2007\". this place does NOT look like it's been renovated in the past two years and really does not look up-scale. Big Negative Absolutely NO mention/warning of airplane noise. I realize that they're designated as the Embassy Suites Las Vegas \"Airport\", but I've had stays at hotels at the actual airport or connected property, but did not have this problem (Embassy Suites San Francisco Airport, Hilton Boston Logan Airport). If you're in a room facing Swenson, then prepare for noise and the room rattling. You're right below the flight line of the airplanes. I recommend requesting a room on the Paradise road side to minimize the noise. Location is not the fault of the hotel staff, but I did request a quiet room and the person checking us in did make it a point that he was assigning us to a quiet room. I'm shocked that they would put us in this room.", "Date": "April 18, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "4.0", "Value": "2", "Location": "3", "Rooms": "3"}, "AuthorLocation": "europe", "Title": "“Comfortable, friendly, convenient to airport and UNLV”", "Author": "europearoundtheworld", "ReviewID": "UR27845445", "Content": "Nice place for a business or pleasure visit. Very close to airport and across street from UNLV if you have business there. Friendly, international reception staff but a bit unorganized. Glass elevators and wide open atrium of hotel lobby is not great for privacy but comfortable to sit and enjoy the indoor greenery, water features, and swans names Elvia and Priscilla. Breakfast selection was not great, always crowded, but the food manager was great and worked hard along side the servers and cooks. Nice to have free parking and an easy couple blocks to the Strip. Spacious, comfy rooms, basic bathrooms, two large tvs, sitting and work area, though lighting was not the best and not all functional. Overall nice place and good location away from the hustle and bustle but close enough to get there in a quick couple of minutes by car or even on foot. Easy walk to the Hard Rock Cafe and Casino.", "Date": "April 12, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Illinois", "Title": "“Fantastic Service”", "Author": "RDH92", "ReviewID": "UR27053008", "Content": "We recieved great service at this hotel!! We traveled from the Grand Canyon back to Las Vegas to fly home We were allowed to check in early and the front desk could not have been more accomodating!! The room was neat and clean with 2 TV's ( a plus if you are traveling with children), there was a pool, and no casino. We ate at the hotel and the staff was friendly and went out of their way to help us!! Great price for great service!!!", "Date": "March 29, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "3", "Rooms": "5"}, "AuthorLocation": "herts", "Title": "“fantastic stay”", "Author": "sungirlHerts", "ReviewID": "UR26171613", "Content": "We stayed here from 2nd to 6th of march and had a wonderful time,friendly helpful staff, clean comfortable room, as we have found from all embassy suites that we have stayed in. Would definitely stay here if we come back to vegas", "Date": "March 14, 2009"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "Scottsdale, AZ", "Title": "“Great Stay during CANAM Hockey Tournament”", "Author": "jaregal", "ReviewID": "UR25449173", "Content": "We stayed at the Embassy Suites (About six rooms) for three nights during the CanAM Hockey Tournament (Adult over 30 ice hockey.) The hotel staff was great - front desk clerks actually were interested in how our team did when they saw us gathering in the lobby. (We won, by the way!) Breakfast as always was great - the food and the cooks have great personalities, and are never troubled by small requests. (I actually watched them make Mickey Mouse pancakes for the little girl in front of me - how sweet!) We look forward to next year's tournament and another stay at the Embassy Suites.", "Date": "March 2, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "2", "Business service (e.g., internet access)": "4", "Check in / front desk": "5", "Overall": "4.0", "Value": "5", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Atlanta, GA", "Title": "“Good Hotel...Lousy Bed.”", "Author": "chheal", "ReviewID": "UR24609025", "Content": "We stayed at the Embassy Suites over President's Day weekend for an extended weekend. The rate, $99, from the Embassy website was excellent compared to other hotels for the holiday weekend and was why we stayed at the Embassy instead of on the strip. The hotel is reasonably clean, I did find some stray hairs in both the bathroom and bedroom, had very good check-in staff, and had a very good breakfast included. The bed, though, was lousy. We had a king bed and it was super springy and cupped. My wife continually found herself rolling into the middle of the bed and any movement by one of us sent the other bouncing all over. We also has noise issues due to thin walls and hearing conversation from the adjacent bedroom. It is too far to walk to the strip and walking to the Hard Rock across the street is not as easy as it once was due to construction at the Hard Rock. Also, the Embassy has no strip shutte in case you want that. We had a car and that suited us well. Most people at the Embassy seemed to be staying not for vacation, but for other events being held in Las Vegas. For that, it would be a very good place to stay. Overall, price being the major consideration, we feel we got a very good value for the weekend and would stay again.", "Date": "February 15, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Business service (e.g., internet access)": "3", "Check in / front desk": "5", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Manila", "Title": "“great value!”", "Author": "DenduA", "ReviewID": "UR23502054", "Content": "excellent value because of the \"happy hour\" which I enjoyed immensely and the breakfast buffet... rooms were large and clean, not to mention well stocked.... I would recommend this hotel to the value conscious traveler... Plus, it was less smoky than most Vegas hotels!", "Date": "January 12, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Iowa", "Title": "“Very nice!”", "Author": "ia35", "ReviewID": "UR20434031", "Content": "We stayed here as part of a Wydham timeshare. This hotel is very nice and clean. Staff is very nice. The breakfast is great and all free. Good water pressure, very quite. I would highly recommend this hotel.", "Date": "September 27, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Business service (e.g., internet access)": "4", "Check in / front desk": "5", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "South Florida", "Title": "“Enjoyed our stay”", "Author": "floridianbutz", "ReviewID": "UR20209403", "Content": "We stayed for almost a week; part business & the rest pleasure. Hotel staff was very accomodating with every request. Shuttle was usually available to take us where we wanted to go. Breakfast was a perfect selection of fresh food. Pool area was enjoyable; the waterfall was very relaxing and towels were plentiful. Peaceful to come back to the hotel at night since it was away from the hustle & bustle of the Strip. The Hard Rock Hotel & Casino is just a walk across the street if so desired. Overall we enjoyed our stay.", "Date": "September 19, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Florida", "Title": "“Good value at the Embassy”", "Author": "KatGio", "ReviewID": "UR20041119", "Content": "We were going to Vegas to celebrate a \"big\" birthday and were going to stay in a strip hotel. However, after considering all things, we opted for the Embassy Suites and made the right decision. We based our decision on the following: 1. We like to be able to park our car and not walk through a casino to our room. 2. We are big breakfast eaters and like to return to our room following breakfast. The breakfast at the ES offered anything a restaurant would and it was so convenient They even had Starbucks coffee.3. My husband likes to work out and the gym/workout rooms at the big casino hotels charge a per diem of $20-$25 , while the ES gym was nicely equipped and free.4. The social hour was a nice \"extra\", although we weren't always there at that time. The staff was very nice and friendly and the location couldn't be beat. I was a little worried when we first checked in because the ES was right in the flight path for most of the airlines. However, surprisingly, you weren't all that aware of it once in your room. We would definitely stay here again!!!!", "Date": "September 13, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Camarillo, California", "Title": "“Had a nice time”", "Author": "mctrvl", "ReviewID": "UR18992707", "Content": "This is the perfect non-gaming hotel. It is only a few blocks from the Strip for those in your group who want to see the casinos but otherwise it is a nice break from all the chaos. Breakfast was served quickly despite large groups of athletic teams staying at the same time. Front desk staff very helpful in giving directions. Rooms were clean, attrractive - Embassy chain has made huge improvements in their fitness centers. The gym was great.", "Date": "August 15, 2008"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "lancs", "Title": "“loved it!”", "Author": "grimsmum", "ReviewID": "UR17302343", "Content": "We had a wonderful stay at Embassy Suites. Staff very courteous and helpful. Free shuttle van to strip. Walking, it would take about half an hour. Happy '2' hours every night any drink you wanted+titbits. Accomodation was very good my son especially liked the large tv's. Good on-site dining and ample free breakfast cooked to order. Lovely pool area.", "Date": "June 28, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "4", "Check in / front desk": "4", "Overall": "5.0", "Value": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Los Angeles", "Title": "“Super Stay”", "Author": "SoCalFam99", "ReviewID": "UR17104452", "Content": "We picked this hotel based upon discovering TripAdvisor. Although the reviews set the bar quite high, our experience exceeded our expectations. This hotel is extremely family friendly. At the restaurant, when my wife brought the baby and our toddler for breakfast (while the rest of the family slept in, the staff stayed at the table with the kids while she put her breakfast on her tray. Poolside, and all over the hotel, the staff was great, and we all raved about our experience on the drive back to Los Angeles. We shall return.", "Date": "June 21, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Business service (e.g., internet access)": "3", "Check in / front desk": "4", "Overall": "3.0", "Value": "3", "Rooms": "2", "Location": "4"}, "AuthorLocation": "Cincinnati, OH", "Title": "“Did not live up to expectations”", "Author": "CarlyMegsMom", "ReviewID": "UR16701347", "Content": "We stayed at this property for 2 nights June 2-4. Paid for one night, used Hilton Honors points for 2nd night. I was looking forward to ending a 12 day vacation at this property, and ended up being disappointed. Below are pros and cons: Cons: 1. Partly selected this property because of the nice outdoor pool area. Then the Health Department closed the pool our only whole day there (it was still closed upon checkout June 4). That in itself raises some concerns about the pool service. The management offered to shuttle us to the other Embassy Suites to use their pool. We chose to drive ourselves, and my kids did enjoy the indoor pool, but it was not nearly as nice as the Swenson property. 2. We were in room 624 - NOT an updated room, although my mother-in-law in 626 had an updated room (flat screen TV's, newer entertainment centers). Do I really care about watching a nice TV in Vegas? No. But why is one room updated, the other not, both on the Hilton Honors floor? 3. A/C issues - both nights we had problems with the room getting stuffy and the air not running properly. Tried turning down the temp - not much happened. Not great sleeping conditions. 4. Walls are thin between rooms. Each morning I heard the phone ringing for my neighbors wake up call (AT 5:45!) and then could clearly hear their cell phone ringing several times - I even got out of bed thinking it was my phone ringing. PROS 1. As others have said, the breakfast service is great. Nice selection, plus the cooks are personable and efficient. 2. Beds are very comfortable, and the rooms are spacious (the reason we chose this hotel). Nice large refrigerator and microwave, in case you have leftovers from one of the fancy restaurants in Vegas. 3. Parking is easy and a short walk to your hotel room. I like that there is no casino, especially when traveling with teenagers. 4. Location is good, and although I did not use their casino shuttle, it was nice to have it as an option. Would I stay here again? I would probably give them another chance. But this trip did not work out the way I had hoped.", "Date": "June 5, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Check in / front desk": "4", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Phoenix, Arizona", "Title": "“Close to the strip but way better!”", "Author": "Tea_Meister", "ReviewID": "UR16582387", "Content": "I have stayed at this Embassy twice. Both times were excellent experiences. I like the fact that is very close to the strip but that it does not have a casino. This latest trip we were there on business but easily walked to dinner at Treasure Island and a show at the Mirage Saturday night. it is an easy 15 mnute walk to the strip at the intersection where the Fashion Show Mall and Wynn are. The rooms are very spacious, clean and the staff are all very cutomer oriented. I like that you can park near and don't have the 30 minute walks fom the parking lot to the hotel at the typical strip hotel. Toss in breakfast and happy hour and count me delighted!", "Date": "June 2, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "PEI", "Title": "“Great Accomodations, but Unbelievably Great Staff”", "Author": "IslanderOnTheMove", "ReviewID": "UR15583654", "Content": "When I booked my vacation.. Embassy Suites was #20 in Vegas on Tripadvisor, it is now #8, and I can DEFINITELY see why. Other hotels can have all the amenities they want, at this property, the staff are unlike any others I have every came across, and I work in the business! Greeted when we walked in with a smile, William (Front Desk Supervisor) was incredibly helpful not only with getting us checked in promptly, but with our questions of the nearest casino, shuttle services, the resort ammenities. He was a dream employee, I kid you not, and Embassy Suites should be thankful they have someone like him. Next was our room, located on the 6th floor (newly renovated from what William told us). This room had everything we needed and a very nice layout. Two large flat screen TV's, microwave, kitchen sink, refrigerator, if we were staying longer than we were (2 nights) we could have made our breakfasts.. but wait.. they were free! We didn't take advantage of the complimentary hot breakfast the first day, however the second we did. And like I read on another review, these guys wowed us. Although there was a line-up, it went fast, and the chefs (2 of them) were very quick and extremely accommodating to all requests I noticed in the line. Managers Hour was for a few hours in the evening and included some appetizers, as well as free drinks. What a treat! A great way to start the evening off in my opinion, which is what we did both nights we were there. Finally, I have to mention the staff again. They REALLY do make a difference in your stay. Ralph (the hotel Ambassador) never left the lobby floor when people were around, and you could see him constantly speaking to guests and I can tell you that he spoke to us on many occasions just to make sure all was going ok and to make small talk, an incredible, incredible way to make someone feel welcome and at home. The shuttle drivers were also incredible helpful. What I thought were set schedules to and from the strip and airport, became 'where do you want to go?' and 'I can pick you up after', as we took advantage of their wonderful services, I tipped as much as a cab would have taken I'm sure, but in my opinion, these guys were worth it. Overall, I must say, it was one of the most memorable stays I've every had. And I would recommend and re-recommend this property as a choice place to stay in Vegas, even if it is a few minutes off the strip!", "Date": "May 2, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Florida", "Title": "“A Jewel In The Desert, One Of The Best!!!!”", "Author": "muttnjazz", "ReviewID": "UR15206892", "Content": "We stayed at Embassy Suites on Swenson last month to attend a conference and have a short vacation. This stay was a completely positive experince. Cristina, the meeting manager was very helpful to our group, the front desk staff were helpful in getting me directions to other locations, and eveyone greeted us with a smile. I've stayed at Hilton Grand Vacation and the Embassy Suites on Paradise in the past, and they have nothing on Embassy Suites Las Vegas. The hotel also has just completed the their renovations and the suites are welcoming... even have flat screen tvs. The outdoor pool is an oasis in itself. Highly recommend.", "Date": "April 21, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "4", "Check in / front desk": "5", "Overall": "5.0", "Value": "4", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Fort Wayne, Indiana", "Title": "“Can't praise it enough”", "Author": "SamnAnne", "ReviewID": "UR15205793", "Content": "My husband and I stayed at the Embassy Suites for 8 nights in early April. After a long flight and getting lost on our way to the hotel (since we forgot to print directions), we checked in and were given a 6th floor room (which is reserved for Hilton Honors members) facing Swenson right next to the elevator. Because I had read negative comments about being right near the elevator and hearing planes, I was a little skeptical. To my delight, I never heard anyone in the hallway or at the elevator, and was never woken by a plane (and I'm a light sleeper). In fact, even during the day we hardly ever heard planes overhead. Ralph went out of his way to welcome us and greet us every morning during breakfast, and evening at the manager's reception. All the staff was friendly, and at least attempted to be helpful (we asked for directions and we were sent completely in the wrong direction). :) The breakfast is amazing. I had cooked to order omelets, pancakes or French toast every morning. The grill cooks are efficient and the food is wonderful. We only had more than a couple minute wait the first day when we got in line behind a group that was staying at the hotel for a convention. The facility is very well cared for and the rooms are very comfortable. The beds were better than most hotels. Throughout our week there were always conferences going on, and lots of kids running around, but they never disturbed us. Even the 10-18 yr. old cheerleaders were well behaved and kept in their own row of rooms several floors below us. The \"restaurant\" is in the atrium. It is sort of segmented off, but it definitely doesn't work for the upscale atmosphere I would like in a more expensive restaurant. We had lunch there one day, and a light dinner another evening- the Strawberry Chicken Salad is heaven. The one thing that was consistently negative was that the service was extremely slow. We didn't have plans to go anywhere, so it didn't matter, but it was still a nuisance. The pool area and fitness center are exceptional. The gift shop is a joke. Go to a real souvenir shop and save yourself lots of money (two postcards with stamps cost me over $7). As we were preparing to leave, we were offered the chance to store our luggage in the bell closet until our plane left several hours after we checked out. All in all, I would rebook with this hotel in a heartbeat. Being away from the strip, but within a 5 minute drive was great. We could get away from the hustle and bustle when we were ready to relax, and had a great time while we were there.", "Date": "April 21, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Glasgow, United Kingdom", "Title": "“Ideal get away from the hustle and bustle”", "Author": "cam405", "ReviewID": "UR15179679", "Content": "We stayed at the Embassy suites for 4 nights. Initially I was afraid that we would be too far out of things but the hotel offers a free shuttle bus to the strip every hour (and also one to the airport). The driver will pick you up at other times if you require. We thoroughly enjoyed our stay here and feel the choice not to stay on the strip was the correct one. We visited several hotels and found them too big. The queues to check in /out were long and I found the atmosphere a bit anonymous. On the other hand we saw our hotel manager several times during our visit. He mucked in clearing tables etc if required. I liked the family feel to this hotel. The kids loved the pool and we used it as a way to break up out day. The adults loved the mangers reception with free drinks and snacks between 5.30 -7.30. The cook to order breakfast is fabulous with omlettes with several fillings to pancakes and waffles. There is also a hot buffet or fresh fruit, cereal, pastries. Really great value for families. Our kids loved the resident swans and got to feed them. The accomodation was very good with 2 LCD TV's. I was annoyed however by the table in the centre of the room which was an obstruction when preparing the sofa bed for the kids every night. The room had a safe and fridge. If i was visiting Las Vegas again I would definately stay there again. We did hear some noise from the planes but not enough to be a problem.", "Date": "April 21, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "omaha ne", "Title": "“Great Hotel - Great Service”", "Author": "maverick1974", "ReviewID": "UR14751895", "Content": "Stayed at this hotel for 3 nites with our 2kids. Here are the things we liked about the hotel. 1. Best exercise room ever for a htl. Great elypticals and treadmills with cardio theatre on each machine. Good free weights. Just an outstanding exercise room. Even provided earphones for the tv's. 2. Breakfast was great. If you were a little later in the A.M. the line for omelets was a little long but you could go to the separate station for scrambled eggsand bacon and continental with no waiting. A+ service down there. 3. Nice van service to both airport and the strip that ran once an hour. Definitely take the van to the strip and not your car. The strip is wall to wall cars all day and is absolutely no fun to drive at all in. Don't bring car to strip!!! 4. Occasionally I could hear a plane from the airport but for the most part the hotel was really quiet considering how close to airport it is and the fact there were a bunch of kids in the htl for spring break. 6. The suite was really nice with great flat screen tv's and lots of channels. The living room seemed a little smaller than some embassies but not much. 5. My kids loved the 2 swans in the lobby. Also, loved the fresh .lemon water in the lobby. Nice touch 6. The help at the front desk was first rate. I had a couple of requests that I called down for and they responded very quickly. When we would come back in for the evening the help at the front desk would always welcome us back which was a nice touch. 7. Had dinner in the restaurant and that too was great. I have stayed in many embassy suites over the years and this one is as good as it gets. 8. I enjoyed the free internet and printing in the lobby. They only had one computer but there was big sign saying there was a 15min. max. time so the computer was free much of the time. If I had one wish it would have been to have a little more heat in the outdoor pool. They said it was heated but it was mighty cold in that pool. If you are looking for a non gaming htl this is a great option.", "Date": "April 2, 2008"}], "HotelInfo": {"Name": "Embassy Suites Las Vegas Airport", "HotelURL": "/ShowUserReviews-g45963-d97971-Reviews-Embassy_Suites_Las_Vegas_Airport-Las_Vegas_Nevada.html", "Price": "$133 - $190*", "Address": "<address class=\"addressReset\"> <span rel=\"v:address\"> <span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">4315 Swenson Street</span>, <span class=\"locality\"><span property=\"v:locality\">Las Vegas</span>, <span property=\"v:region\">NV</span> <span property=\"v:postal-code\">89119</span></span> </span> </span> </address>", "HotelID": "2515689", "ImgURL": "http://media-cdn.tripadvisor.com/media/photo-s/02/25/f3/67/relax-by-the-pool.jpg"}}