{"Reviews": [{"Ratings": {"Overall": "3.0"}, "AuthorLocation": "", "Title": "“Great location but average room”", "Author": "toatao", "ReviewID": "UR127416873", "Content": "Located next to a metro station and a supermarket. Small and squeezy but neat and tidy room. However, we dont like the fact that the toilet has big windows that look out into the alley. terribly small lift. Troublesome wifi access. One username / password is tied to just one device. So unless you have very thick skin, you probably won't ask for more than 2 passwords and have to think hard to give your laptop, iPhone, or iPad the Internet access.", "Date": "April 7, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Melbourne", "Title": "“Was not disappointed”", "Author": "briggs_03", "ReviewID": "UR126955718", "Content": "My daughter and I stayed here in early March 2012. I was relieved to find on arrival it was exactly as it was pictured. We had a twin room and it was lovely and clean throughout, including the bathroom. I had been informed that rooms in Paris were quite small, but we had enough room for two people with two quite large suit cases. The staff were extremely helpful even with the language barrier. Breakfast although limited was lovely and enjoyable each morning. The location was great, with easy access to the metro, but also within walking distance to many attractions. There are a number of very good restaurants nearby and a Laundromat just down the street which is convenient when travelling. I would definitely recommend this hotel.", "Date": "March 30, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Antwerp, Belgium", "Title": "“Recommendable”", "Author": "anita v", "ReviewID": "UR125856818", "Content": "We spent 5 nights in this hotel and had a great time. The hotel and the rooms are very clean. It's located close to metro 'arts et métiers' and close tot Centre Pompidou. You can hear the subway a bit, but actually it's not disturbing. It's possible to get breakfast on bed for free and there are 3 supermarkets close to the hotel. The staff is very friendly. I'd definitley recommend this hotel to everyone! Tip: take the subway to \"hotel de ville\", it's perfect to do some shopping!", "Date": "March 9, 2012"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Overall": "3.0", "Value": "2", "Location": "5", "Rooms": "3"}, "AuthorLocation": "Edinburgh", "Title": "“Ok hotel in great location”", "Author": "Scoutness", "ReviewID": "UR124830217", "Content": "The hotel has nothing special to recommend it, but is in a good location if you like le Marais. The reception is staffed 24 hours which is good. The wifi is free but drops out all the time so you have to keep putting in the password. There are tea and coffee making facilities but the plastic cups are useless and taste terrible. There are three little super markets in the surrounding blocks, but no fridge to store anything - being winter we used the window ledge ;)", "Date": "February 19, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "North East England", "Title": "“Would Definitely Return!”", "Author": "Ragpie Posted by an OctopusTravel traveler", "ReviewID": "UR124744260", "Content": "Myself and my partner stayed here for a 4 day mini-vacation in February 2012. We had a double room with en suite on the 5th floor and had breakfast included. The room itself was great. I'd read that the rooms were somewhat on the small side, however, that did not reflect our experience. Especially for a Parisian hotel, the room was of a decent size. It had a double bed, two night stands, a desk and chair, flat screen TV, large wardrobe and windows that opened (something we had taken for granted in the past). The bathroom was slightly small, but nothing too bad and had a shower, basin, WC and enough room in the shower/on the basin to house all of our toiletries. There were original wooden beams in the room, which made it feel typically Parisian and the AC unit kept us nice and cool and we were able to adjust it as we required. The breakfast was okay. Each morning the tables are laid with one croissant, one other pastry (pain au chocolate, etc.) and one bread roll. Along side this there is a portion of butter and jam. You can then get your own cereal, coffee, juice and water. There is also a selection of yoghurt, some boiled eggs and a few packets of cheese available. We had already paid for the breakfast, so we had it each morning. However, if we had not paid for it in advance we would have used the local supermarket. We didn't feel ripped off by the breakfast, but definitely could have equalled or bettered it for less at the supermarket. The breakfast in the hotel is 10 Euro per person, however, about a 2 minute walk around the corner you will find a Carrefour grocery store. They have a good selection of food/drink and you could probably buy a weeks worth of breakfast products for 20 Euro or less, saving you quite a bit. We used the supermarket for quick evening meals when we didn't want to go back, we got the basics like some bread, cheese, meat, etc. The staff were friendly and if they didn't speak English they knew how to communicate enough to get the transaction done. One thing I will mention is that as our room was on the 5th floor we decided to take the elevator up. Upon entering the elevator I went in first with my bag and was suddenly confronted by a wall and the thought of \"where is the rest of the elevator\". It is a very small, one person + one bag elevator that looks like it was created from a coat closet. While it's very handy to have the elevator, especially for disabled guests, you would have to take it in turns to use it. We alternated, one would use the elevator and one the stairs. My partner and I don't require the room to be cleaned everyday, as we don't make that much mess and neither do we require fresh towels every day (trying to do our bit to save the environment)! However, even though we put our \"do not disturb\" sign out, each night we would come back and the room had been cleaned and the \"do not disturb\" sign was back on the desk, inside the room. Also, as per the instructions in the bathroom, we hung up our towels, which is supposed to tell the maid that we don't need clean towels, but everyday clean towels were provided. The staff at the hotel couldn't have been nicer. They were very welcoming and helpful. They ordered a taxis for us when needed and were available without issues whenever we needed something. The hotel is in a good location. Although all of the rooms look out onto a road or side street, the area is very quiet so you don't get street noise. We even had the windows open and didn't really hear any traffic, etc. As mentioned there is a supermarket just around the corner. There are also a few cafes within a 2-5 minute walking distance and the metro is a 1 minute walk across the road. The metro is a small line, but with changes will get you where you want to go and for 1.70 you can change as many times as you need (as long as you don't leave the metro system) to get to your destination. We bought a pack of 10 tickets for 12.50, which lasted us our whole trip. One word of advice: don't use the metro during rush hour (17:00-18:00)! We did and were astounded at how many people try to squeeze on. Just when you think there's not even enough room left to breath a few more people run up and squeeze on, to the point that the door can hardly close and if you want to get off you have to forcefully push through as they don't like moving. However, if you use the metro outside of rush hour, it's no different to anywhere else. Metro trains come every 2 minutes like clockwork. A couple of tips: 1) don't buy the breakfast, instead use the local supermarket. 2) Taxis can not be booked hours in advance, you need to ask the front desk to book you one about 10 minutes before you need to leave. 3) Get a book of 10 tickets for the metro if you're planning on using it a lot, it works out much cheaper. Overall this is a great little hotel and we would definitely stay again. The staff are great and went out of their way to be welcoming, the location is good and it feels like a little, family run hotel, just with all the amenities you require of a \"chain\" hotel.", "Date": "February 18, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Glasgow, United Kingdom", "Title": "“Local Paris”", "Author": "Franky21_12", "ReviewID": "UR124617424", "Content": "Stayed at this hotel Feb 2012 and will return when in Paris also would recommend to friends. Very handy especially if flying Ryanair - 1 change on metro from Porte Malliot (LIne 1 to line 3 at Hotel de Ville and the hotel is right beside the metro station). Room cosy and clean and the bath was a bonus as our feet ached having walked an average off 12 miles a day breakfast was included and set us up for the day. good value as you could refill as much as you wanted. This was our 5th visit to Paris and the best yet.", "Date": "February 15, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Huddersfield, United Kingdom", "Title": "“Easygoing, great location, clean and compact”", "Author": "bendles", "ReviewID": "UR124582446", "Content": "All the staff we encountered were friendly and helpful. The room was cleaned to a very high standard. The shower was great, lots of hot water with plenty of pressure. It was a freezing cold weekend outside and was nice to come back to a warm room. Didn't try the breakfast as we were surrounded by cafes and were a short walk or metro ride to all the local attractions. Nothing bad to say about this hotel, even the slight rumble of the metro didn't cause concern. I haven't visited Paris for a long time but the price seemed reasonable for location and size of the room.", "Date": "February 14, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Perth", "Title": "“Very Good Value For Money - Clean and Central”", "Author": "SirTimbo", "ReviewID": "UR122208995", "Content": "This is a very friendly hotel. Smallish but that I how I like them. The location is fantastic, 50 metres from the Metro and only 2 stops to the river. I gave breakfast a miss at the hotel and enjoyed my first meal of the day at a cafe. I would recommend this as the rooms were quite okay as far as size was concerned and it also was very clean. Lift was also okay (sick of walking up stairs by the time I checked into this hotel) and room was a/c. All in all a good place to stay. But if you want to look out of the window at sights of Paris, this hotel is not for you.", "Date": "December 29, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Plymouth, Wisconsin", "Title": "“A wonderful find!”", "Author": "onefortheroad39", "ReviewID": "UR119990145", "Content": "We wanted to stay in the Marais, and I found this hotel on the internet. We were extremely happy with our stay, and will return here again. The hotel is spotless. While our room was a bit small, it had a wood beam running through the ceiling which lent it that Parisian ambience. And the bathroom was spacious with a wonderful tub for bubble baths. The breakfast was huge with many choices. A metro stop is kitty-corner across the street, and the neighborhood is very nice with grocery stores and cafes within a block of the hotel. Sam at the front desk was so nice, and gave me special flower honey for my sore throat...thanks, Sam. I'll be back!", "Date": "October 31, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Moscow", "Title": "“Great find in the centre of Marais quartier”", "Author": "V0lta", "ReviewID": "UR119781115", "Content": "A great find amongst overpriced Paris hotels. It's not cheap comparing to most cities, but for Paris the price is quite ok, especially since it's situated in a decent Marais quartier, shops and cafes nearby, Carrefour open till 23.00 just round the corner and metro stop is a few steps away. In 20 minutes by foot you can be at the Cite district. Our room (26) was recently renovated, very charming and absolutely quite (I specially asked for it, so our windows faced some tight space between the houses, no view, but I always prefer good sleep, you have nice views as you walk through Paris, when you are back in the hotel, who needs to stare at the window?) - we heard no cars, no other guests, perfectly sound-proof. In the chilly October nights the room was always warm. It was also nicely cleaned every day. Another strong point - they had tea tray with a kettle, tea and coffee bags refilled every day - that's unusual for most of the Europe and very nice indeed! Wi-fi connection is free and very good. The staff is there for you 24 hours, nice and friendly. Didn't take breakfast in the hotel though, breakfasts in French hotels are overpriced and I'm no fan of croissants either. Summing this all up, we had absolutely no complaints and enjoyed our stay very much!", "Date": "October 27, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Covington, Louisiana", "Title": "“Really good value, excellent stay!”", "Author": "sugottfried", "ReviewID": "UR119524304", "Content": "We just got back from a three-night stay at Austin's Arts et Metiers hotel and we found it to be a great value in a perfect location. Our room on the 6th floor could not be labeled as small. We had a nice armoire for hanging clothes and putting things on shelves. We had a desk and chair, a nice sized bed with two side tables and a great window to open for the outdoor air and an adequate bathroom. The elevator, although small, was always available and fast. The Metro is just across the street as is a grocery, Carrefour, to get provisions for your days out on the town. The breakfast was included and was very generous, even including fruit and snacks you could take out with you. The desk was always staffed and the staff were very helpful and accommodating. I would highly recommend this hotel for your stay in Paris.", "Date": "October 20, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "5.0", "Value": "4", "Service": "4"}, "AuthorLocation": "St. Petersburg, Russia", "Title": "“We loved it , we would recommend it.”", "Author": "475traveler475", "ReviewID": "UR117236783", "Content": "Small Hotel, but clean, and functional. Art et Menier Train Station is across street, which lead to all attractions. 10 min walking distance to Place Republique. Aprox.45 min walking to Notre Dame. Small elevator, as any other hotels. Breakfast good with variety. Owner speaks english. For dinner recommend \"Le Vernissoir Restaurant\" Bistrot Gourmet & Bar by 18 Rue du Verthois, one block from hotel, since hotel does not serve meals.", "Date": "August 25, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "4.0", "Value": "5", "Service": "4"}, "AuthorLocation": "New Rochelle, New York", "Title": "“Clean and Quiet Hotel in Good Location”", "Author": "NewRocMom", "ReviewID": "UR115689234", "Content": "This hotel is an affordable base from which to explore Paris. It's easy walking distance to the Le Merais and Les Halles neighborhoods where restaurants and stores are in abundance. Also, there is a supermarket around the corner and a Metro stop a half block away. Since it's tucked away on a sidestreet, we found it to be pretty quiet at night. While our room was not overly spacious, it certainly wasn't small. Recent renovations made it quite nice and comfortable. If you are a large person you may find the elevator to be claustrophobic. My husband and I are thin and both managed to squeeze in together with our luggage but it was tight. A computer with free wi-fi for guests' use in the lobby was a nice bonus. My only complaint: no personal safe in the room.", "Date": "July 23, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "4.0", "Value": "4", "Service": "4"}, "AuthorLocation": "Ottawa", "Title": "“Great location, clean and comfortable.”", "Author": "Late_Harvest", "ReviewID": "UR115503159", "Content": "My wife and I stayed at Austin’s Arts et Metiers Hotel for 2 nights in early July, and were satisfied with our stay there. The greatest feature of the hotel is its location. You’re literally a one minute walk to the subway, and many of the city’s attractions are a short ride away. The hotel is situated in a safe area with many good restaurants and shops. Our room was on the 5th floor. The room was of medium size (for Europe), clean and comfortable with a decent sized bathroom. The hotel itself was quiet at night; we were not disturbed by other guests, or noise from outside. While the hotel desk staff weren’t overly friendly, they were very helpful and prompt with any requests we had. I would recommend that you ask if breakfast is included with your room fee. The advertisements in the hotel give the impression it is included. After having breakfast our first morning we inquired, and discovered it was an additional 10 euros per person. We would recommend this hotel to others.", "Date": "July 18, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Brisbane, Australia", "Title": "“Can't recommend Austin's highly enough! WILL be back!”", "Author": "NatBilling", "ReviewID": "UR115307803", "Content": "The Austin's was the perfect home base for us. Only 1 minute walk to the Metro & 2 stops off the central Metro line we could get everywhere we wanted to go in Central Paris quickly & easily. The staff were fabulous. Sam & all the receptionists were so helpful & Fatehia & the other ladies at the Breakfast Buffet looked after us so well. Room was clean and quiet. Plenty of choices on the Buffet Breakfast. Free secure Wi-Fi. Great location with a supermarket, Laundromat, bakery & choice of cafes/restaurants all on the same block", "Date": "July 13, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "4.0", "Value": "4", "Service": "5"}, "AuthorLocation": "Adelaide", "Title": "“recommended”", "Author": "Tourist014", "ReviewID": "UR115154273", "Content": "We stayed here for a night after renting an apartment around the corner and not being able to re-enter it at 11pm due to a problem with the lock! Quelle disaster! Fortunately this hotel was open and the friendly concierge gave us heavily discounted rooms for the night. The rooms were great - clean, comfortable and secure. I would have gladly stayed on but our problem was sorted out the next day. If anyone wants a review of an apartment on the fifth floor of 22 rue Montgolfier, I'll gladly supply one.", "Date": "July 8, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Seattle, Washington", "Title": "“Highly recommended!”", "Author": "McIntyre_C", "ReviewID": "UR113207456", "Content": "We stayed in this hotel from June 7-10. We were given room 55 and it was very clean and comfortable. Airconditioning worked well, lighting was sufficient, door has double lock. The free wifi signal was excellent. We are just full of praises for this hotel. The staff were very helpful, friendly and courteous (in fact, they helped me map out my metro/bus itinerary). Our room was cleaned thoroughly everyday with toiletries replenished even if they were hardly used. Location is great too! A 15- minute walk to the Louvre and St. Eustache with groceries, cafes, pharmacies/drugstores (there is even a Subway and Asian restaurants on Rue St Denis) around it. Metro is a across from the hotel. Breakfast was very good (the pasteries were freshly-baked) and filling. There was a good selection of cheeses, yogurt, pastries and jams. I would love to stay in this hotel again. (C. McIntyre)", "Date": "June 13, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "4.0", "Value": "4", "Service": "4"}, "AuthorLocation": "Oslo, Norway", "Title": "“Central location, clean, good value for money”", "Author": "RasmusB", "ReviewID": "UR111923113", "Content": "Nice hotel, with clean and high standard rooms. 10 minutes walk from Chatelet - Les halles train station (which has trains going to the Charles De Gaulle Airport).", "Date": "June 7, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "3", "Location": "4"}, "AuthorLocation": "London", "Title": "“Great spot - good value, clean and convenient”", "Author": "GCollett", "ReviewID": "UR109865508", "Content": "We booked a last minute trip to Paris and found that most hotels were full, we managed to get rooms at Austins a few days before our trip. What a good find. Very reasonable in what is an expensive city, a good central location, a short walk from The Pompidou centre, Notre Dame and other sites and well linked on the metro. The room was compact but had modern but not ikea style furniture, was very clean, well equipped and just right. This isn't a smart hotel with room service and concierge but is a great bet if you want a central, safe, clean spot to rest your head. Staff were fine, not particularly helpful but not rude either. We didn't really need any assistance other than check in and check out so maybe they could have helped if we need more.", "Date": "May 25, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Location": "5", "Rooms": "3"}, "AuthorLocation": "Fort Lauderdale, Florida", "Title": "“Small room, but comfortable”", "Author": "mbeyedoc", "ReviewID": "UR105864340", "Content": "We spent 5 nights at this hotel in March. We really enjoyed the location. There were lots of cafes, stores, and bakeries within a stone's throw of the hotel...plus the metro stop is literally across the street. The neighborhood is quiet and residential...we liked that! Our room was small, but had everything we needed. The bathroom was clean and we had plenty of hot water for morning showers. We enjoyed the double windows! Our TV only picked up one English speaking channel...BBC World, but we were not in the room very much. Each morning, the breakfast consisted of rolls, pastries and croissants with jam, yogurt and fruit. It was more than adequate. We would definitely stay here again. The funny thing about the hotel is the tiny elevator! It was so small that two of us could not fit with our luggage...but it was kind of charming. Overall...a good hotel in a comfortable neighborhood!", "Date": "April 27, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "5.0", "Value": "4", "Sleep Quality": "4", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Bremerton, Washington", "Title": "“Good hotel as a base for visiting Paris”", "Author": "travelerwmmary", "ReviewID": "UR104268550", "Content": "A clean, nice hotel off the main street but walking distance to taxi, metro and bus. Laundromat, grocery markets, bakery and restaurants less than a block away. We walked to the louvre from there. Room was well decorated and cozy. Bathroom white tile and clean with good shower. Free internet access. Staff was most helpful and patient. Breakfast was very good.", "Date": "April 16, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Northumberland, UK", "Title": "“Great location, excellent value”", "Author": "Prudhoegirl", "ReviewID": "UR103166824", "Content": "We were already planning our next visit before we checked out. This really is a super find, as another commenter has said, hotels in the Marais are generally pretty expensive but this was affordable and also in a relatively quiet street which we value! The staff were lovely. Check-in was speedy and hassle-free, which at 11pm was much appreciated.We were the last guests to arrive, and were greeted by name - and within 36 hours the lady running the breakfast room could remember our room number. Our room wasn't enormous, but Parisian hotel rooms seldom are. It was very attractively decorated and furnished, shades of deep blue, honey and cream, with deep pile carpet and crisp white bed-linen, all immaculately clean. The bathroom had a full bath with (excellent shower above it) - our only criticism was that the shower screen wasn't really wide enough to prevent the floor from getting wet. Breakfast was good - tables ready laid with a traditional French breakfast, plus other items (cereals, fruit, yoghurts etc) available at the buffet. Everything was fresh and good quality - excellent coffee in particular! Our room was at the back and looked onto a boring tatty courtyard but that doesn't matter as it meant we had no risk of traffic noise! I cannot understand another commenter's complaint about there being no restaurants nearby - there is a good variety of very pleasant restaurants, ranging from Au fil des saisons (classy, classic), through the Café Leonard just over the road from the hotel (good simple bistro fare) to La Médina (great North African fare). We shall definitely be going back.", "Date": "April 7, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "3", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Ghent, Belgium", "Title": "“Good value, friendly staff”", "Author": "Donna_Marc_Vespa", "ReviewID": "UR92570407", "Content": "Friendly staff & a room on the top floor, luckily there was a small elevator that did the job all the time of our stay (3 nights). We had a deal 2 nights + 1 free via the online service of Neckermann, breakfast included. The breakfast room was tiny, the food was correct. The choice large by French standards (cereals, fresh fruit, yoghurt, cheese, eggs .... ). We could leave our luggage before & after the 'check in/out'-time. Situated in a quiet street, but 3 mins away from the metro station & the grand boulevards, some 25 mins walk from the Gare du Nord. Room was rather spacious, bathroom clean, linen clean as well. They are redecorating the rooms, we only had some noise in the afternoon, so the standard should rise.", "Date": "January 11, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "4", "Sleep Quality": "3", "Rooms": "2", "Location": "2"}, "AuthorLocation": "Virginia", "Title": "“Clean but mediocre”", "Author": "hahn74", "ReviewID": "UR84772757", "Content": "The location is conveniently near a metro stop and a few cafes but this is definitely not a lively part of town. Not for the traveler who is looking to be near restaurants or other attractions. The hotel itself is clean but the walls and furniture need to be fixed and/or updated as everything seemed fairly old and not of great quality. A little shabby looking. It's also rather noisy, as you can hear every murmur and key-turn on the floor as if they were directly next to you. This hotel is cheaply priced though (~$150/night) and the staff were friendly and accommodating, and like I said, it's clean.", "Date": "October 25, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Norway", "Title": "“Super location, friendly staff, clean og cozy hotel:)”", "Author": "NusaNorway", "ReviewID": "UR78657106", "Content": "We stayed in this hotel for two nights, og were pleasently surprised! Great location, right by a metro station- easy access to all the sights! Small and cozy hotel, OK- sized room considering Paris` hotel room standard. Very nice and clean bathroom. Free airconditioning. Great, friendly staff. All in all, a great experience! Good value- can really be recommended!", "Date": "September 7, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Leiden", "Title": "“A very relaxed place to stay”", "Author": "davidoffski", "ReviewID": "UR74082248", "Content": "This was the first time I stayed in a hotel in Paris, and I was very satisfied with it. The room was not very big, but was clean, had a nice bed and shower, and (important during a hot summer!) airconditioning. Staff was very friendly and, to my astonishment, even understood my terrible french. After breakfast you can reach the subway in half a minute!", "Date": "August 6, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Miami, Florida", "Title": "“affordable, well located and clean”", "Author": "AndreVG", "ReviewID": "UR73031974", "Content": "stayed here for 6 nights and loved it! breakfast saved us the time and the expense to go look for food in the AM and front desk was very helpful whenever we needed them. free internet made it easy to email family and friends without looking for an internet cafe. for those that complain of the size of the rooms or the lack of tubs ummm... this is Paris not the US! I don't expect US standards in a country that's not the US, learn to embrace the difference!", "Date": "July 30, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Luxembourg City, Luxembourg", "Title": "“Small, quaint, good location and value for money”", "Author": "guan66", "ReviewID": "UR70720422", "Content": "We stayed here over an extended weekend and were quite please with the hotel. It is small and cute, and so are the rooms, but they are clean and good enough for a single person or couple for a short stay. The only downside was that the air conditioning hadn't been turned on yet, so if summer has started earlier than expected, make sure you call ahead to check that it is on. Even so, we were offered a fan for our room. The location was also quite good - walking distance to many things and metro right at the doorstep. Also, if you get a room facing the street, it may be noisy until late into the night, so if you are an early sleeper, best to request a room that doesn't face the street.", "Date": "July 13, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Los Angeles, CA", "Title": "“Quaint hotel, decent location, overall good value”", "Author": "LA_tao", "ReviewID": "UR70100552", "Content": "Stayed 2 nights at this hotel last spring and was very satisfied with my experience. The location was not as central to all of Paris' sites but the metro is just a few steps away. The rooms are well kept and wifi was free. Our reservation also included breakfast which included an assortment of breads, cheese, yogurt and fruit, as well as juice and coffee. Staff were quick to provide tips on travel within Paris and to airport. The only inconvenience was having to get the iron and ironing board from the front desk and bring it back up to the room. Overall I had a pleasant experience.", "Date": "July 8, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Boston, Massachusetts", "Title": "“Nice hotel”", "Author": "lonelyplanetpeople", "ReviewID": "UR68045969", "Content": "We stayed for a week and had a pleasant experience. It's a small but cute boutique hotel. The staff is friendly. The metro is steps away. 10-15 min walk to Hotel De Ville and the Seine. There are two nice cafe's down the street that are filled with hip young people late into the night. Minor problems included noisy traffic early in the morning and occasional loud brawls across the street. Once we shut the windows, it didn't bother us.", "Date": "June 20, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Horsham, United Kingdom", "Title": "“A near perfect 3* hotel”", "Author": "SussexGrove", "ReviewID": "UR51594842", "Content": "This hotel is of the highest standard and delivers precisely what you would hope for in a 3* hotel. Really nothing to fault it on.", "Date": "December 21, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "4.0", "Value": "4", "Location": "5", "Rooms": "3"}, "AuthorLocation": "UK", "Title": "“Great location and value, but rooms would benfit from a refurbishment”", "Author": "Goaway_leavemealone Posted by an OctopusTravel traveler", "ReviewID": "UR49654790", "Content": "The service was very nice indeed, and receptionists speak perfect English and do not mind speaking it. Room was rather small. Some haphazard work on the ceiling lights left unsightly scars in the ceiling. Room would be much improved by a refurb.The bedsheets were clean, which is the most important thing for me. Bathroom clearly has been cleaned, although I did find a hair in the soap dish... There were tea making facilities in the room, although rather basic (and only plastic cups to make your drinks in). Breakfast is definitely a winner. All you can eat and a good selection. Don't show up to close to when they stop serving, though. You will find yourself made uncomfortable by the lady who is clearly keen to wash up and wrap up). The location is great - it's in slightly less popular part of town, which has the advantage of being close to centre while still offerring good value for money. Overall, great if you treat it as a base from which to explore Paris (like bed and breakfast). Would recommend for a short break.", "Date": "November 20, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "brussels", "Title": "“This is what I call the ultimate 3 star hotel”", "Author": "nadasurf", "ReviewID": "UR49107116", "Content": "This is the best 3 star hotel you can find in Paris! Let me explain you why : First of all, location is perfect : 20 m far from arts et metiers station and also within walking distance to Beaubourg Centre Georges Pompidou and from the Gay Marais...Rooms are cozy with flat screen tv and very nicely decorated...Breakfast is also perfect and has everything you need to start the day...Staff more than helpful...For the price you can pay there, Austin arts et metiers is a must...Excelent price excelent room excelent service excelent location : Que demande le peuple???What more Can we ask,???For me , there is nothing to complain! Its the ultimate 3 star hotel!!! Well done Austin Arts Et METIERS...", "Date": "November 13, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "2.0", "Value": "2", "Location": "4", "Rooms": "2"}, "AuthorLocation": "Istanbul / Turkey", "Title": "“OK hotel if sleeping is not your priority”", "Author": "alisc", "ReviewID": "UR47427554", "Content": "I picked this hotel based on the good reviews here. I think it's overrated. Well, the location is good. And the price isn't bad. I was there in October and when I arrived at the hotel in the evenings around 9-10 pm, the temperature was good. However during the night they must be turning the heat off or something, because I spent my whole 3 nights shivering and turning, not being able to get good sleep, and I ended up very sick, despite going to bed with a wool cardigan, wool vest and a scarf! The room, while not being fashionable at all, leaves a cozy impression at first. But once it's bedtime and you lift the bedspread, a nasty orange blanket with unidentified bits of hair awaits you. I already hate it when hotels provide an old blanket and a sheet instead of a duvet. The sheets had dust marks on them. Even though I was very put off by the lack of cleanliness, I was hugging that nasty blanket by the end of the night because I was FREEZING. You do hear some vibrations from the metro, and door slamming of the other guests. I wouldn't have minded this if I had been able to get proper sleep during the night. The towels and bathroom were clean. Breakfast is sufficient, with a croissant, bread, sweet pastry, packed cheese, jams, cereal etc. The tea and coffee however were awful. I didn't know tea & coffee were capable of tasting this bad, if you're going to stay here, definitely bring your own tea bags. The staff is kind, but I would like to point to a security issue that hasn't been mentioned before. You have to leave your room key to the reception, and because the person at the reception changes all the time, they don't really recognize you. I wanted to buy water one night and the receptionist misunderstood me and just handed me the key of another room! So basically, you can go into this hotel, ask for the key of a random room number, and voila! Pros: Location, clean bathroom, good hot water, internet. Cons: Awful and rather dirty bed, freezing nights, lack of security.", "Date": "October 21, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "5.0", "Value": "5", "Location": "4", "Rooms": "4"}, "AuthorLocation": "Toronto, Canada", "Title": "“Excellent value for Paris”", "Author": "shenatoronto", "ReviewID": "UR31257943", "Content": "I stayed here for 8 nights, based on recommendations on tripadvisor, and was very satisfied. As others have said, this is a family-run business and very friendly. The area itself is not the most thrilling, being on the edge of the 3e, but it is convenient. You are right by a metro stop (2 lines) and a short walk from the 4 line at Reaumur-Sebastopol (where there is also a Monoprix), which is a very convenient one for getting to left bank, Ile de la Cite etc.. It is also a short walk to Place de la Republique, which has most lines. You can walk or take the metro to the Centre Pompidou, the Seine, the trendier parts of the Marais, Les Halles area etc. There is a velib stand close to the hotel (so bring a helmet and credit card with a chip if you want) and a small grocery store that is open late. Some have complained about room size but I don't get it. My room (#26) was larger than my (small) bedroom at home, and well equipped with a desk, bedside lights and tables, windows that open, and wardrobe. I have stayed in smaller rooms in many places in North America, in major chain business-type hotels, eg NYC, Ottawa, Edmonton. I really appreciated that the curtains blocked out outside light and there was adequate lighting, which is getting rarer and rarer in North American hotels, even at the luxury end. Washroom was fine, seemed clean, place to put stuff, good shower, no problem with hot water or anything. There was a good sized radiator in the room which I didn't need to use. However, I could see that in summer lack of air conditioning or ceiling fan could pose a problem. Not in May of course. Elevator was appreciated upon arrival and departure with luggage. The room was very quiet and I slept very well every night. It faced the back, but I expect the front rooms were probably quiet as it is on a small side street. You can hear the rumble of the metro below periodically but it certainly is not loud enough to keep one from sleeping. There is tv in the room. The English channels are somewhat limited, understandably. There's BBC world, MSNBC I think? and occasional English news on Deutsche Welle. Before long though these channels get boring so I switched to the French news channel to get the local flavour. There's lots of sports if you're into that, plus channels in several other European languages. Anyway nobody comes to Paris to watch tv so it is no big deal. The wifi was a bit come and go but the desk staff were always ready to reboot the router or help get it going again. I found my iphone picked up the wifi in the lobby but not in my room, but my netbook picked up a very strong signal in the room (same thing happens at home.) There is a desktop in the lobby for guest use, but it has a French keyboard which some will find confusing. Breakfast was very good, as others have described . In this regard I would recommend that after researching rates on the internet, you contact the hotel directly (not using any link via tripadvisor) to book, as some of the booking agency rates may not include breakfast but don't tell you. Email [--] - they speak English. I would certainly stay at this hotel again, unless I decided to go with a completely different approach such as house exchange or renting an apartment. By Paris standards it is excellent value and worked really well for me. The family has another hotel, Austin's Saint-Lazare, in the 9e, which is probably well run also, though I haven't been there.", "Date": "June 1, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Location": "4", "Rooms": "4"}, "AuthorLocation": "Bratislava", "Title": "“Would come again”", "Author": "MicroBTS", "ReviewID": "UR27482821", "Content": "Booking + Price: Booked this hotel for 3 nights, after reading the reviews here. We were a group of 11 people and took 5 doubles (100 € with breakfast per night per room) and one single (80 € with breakfast per night per room). I booked directly through hotel by email. After my first inquiry I got reply within 5 minutes and I have to say that all their answers were always within one hour. Check-in without any problem. The desk staff was helpful and spoke English. Location: The hotel is very well located, right in front of metro station Arts et Metiers. Centre Pompidou (5 min), Notre Dame (10-15 min) ... are within walking range. Other sightseeings are easily reachable by metro. There is a restaurant and supermarket just round the corner. Hotel: The hotel is rather small (about 25 rooms). In the ground floor is check-in area, breakfast room and room with internet, sofa ... Our rooms were clean, all with shower and toilet. I had the single room which was in fact double occupied only by me so I had enough space. Others had approximately the same space and nobody did complain about the size. Yes, the rooms are not big, but it is nothing tragic. The rooms were clean and thats more important to me. Some of our rooms were facing the back side (not a nice view, in fact a back side of next house) or the street. The rooms would also maybe need a better sound proof. (again nothing tragic we slept without any problems) Breakfast: Buffet style. Rolls, croissants, jam, coffee, tea, juice, cornflakes, yoghurts ... There was enough for everyone. Maybe the hotel may consider choice of some sausages, scrambled eggs? Overall: Definitely worth the money. Perfect location, clean rooms, good breakfast, nice staff ... what more do you need?", "Date": "April 6, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Location": "3", "Rooms": "4"}, "AuthorLocation": "Brussels,Belgium", "Title": "“Good but really small rooms”", "Author": "eurovoice", "ReviewID": "UR27004073", "Content": "It was good but the rooms was so small. But really nice and with quiet street so was great sleep at night. It is kinda hard to find because it is hidden a bit with the main streets. Centre Pompidou was really close - like 5 min walk but true is , when you want to see Eiffel Tower and Louvre then is better take metro what is not again very easy to drive...Paris metro is the worst and very difficult i m ever seen. But well, it is Paris and huge city so dosn´t matter where do you booking you still need public transport . But yeah overall we was like this hotel and why not get back there!", "Date": "March 28, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Kansas City, MO", "Title": "“Wonderful hotel”", "Author": "RubyV7", "ReviewID": "UR20668099", "Content": "My husband and I just returned from a week in Paris, staying at the Austin Arts et Metiers hotel. It was a lovely experience all through. The guys working at the front desk were all very friendly and helpful (and all spoke English, though we tried to use our very limited French when we could), the room (we had one of the ones facing the back - not as scenic as the ones with windows on the front, but rather charming in a big-city way) was VERY quiet and peaceful, and when they say it's near a Metro station they are not kidding; it's right in front. The location is perfect for sightseeing trips. Highly, highly recommended.", "Date": "October 6, 2008"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "3.0", "Value": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Romania", "Title": "“a nice play to stay”", "Author": "viocor", "ReviewID": "UR20439594", "Content": "First : the location...10 minutes walking from Beauborg(Pompidou Centre), about 20 minutes walking from Hotel de Ville and let's say halk hout waliing from Notre Dame.Just close to the hotel there are a metro station and bus station as well. Then...It's a nice little hotel where the stuff was friendly and so helping, the area safe and a pub across the street. Our room was ok large for Paris, the bathroom was rather small but we did manage .Everything was very very clean and this is a great + for the hotel. The view from our window was ugly ugly ugly (it was in the backyard) but I think this is the only complain I have. The breakfast was enough and the french patistry is...mmmmm.In one word...we will definitely stay at this hotel next time in Paris.", "Date": "September 28, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Sydney", "Title": "“Great Hotel!”", "Author": "Tea13f", "ReviewID": "UR19682616", "Content": "We stayed in the hotel for 5 days. The room was lovely and clean, bathroom was huge for european standards! Breakfast was very filling and they even helped us have a bit to eat at 5am before our airport transfer came. The staff were very helpful with our billions of questions about paris! Location was fabulous, pretty much across the road from the metro! Free internet was also a bonus! Highly recommended hotel for a paris trip!", "Date": "September 2, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Sydney", "Title": "“Great little hotel, good location, Nice comfortable room”", "Author": "Brocko25", "ReviewID": "UR17677012", "Content": "The rooms at this hotel are a reasonable size for Paris. And very comfortable. Our room was on the 4th floor, overlooking the back of the hotel (not a pleasant view)... But the room had opening windows, and was nicely furnished. The Bathroom was fresh, modern and clean, with a good sized shower. Our friends in the room next door also had a bathtub in their twin room. The hotel elevator is the smallest one I have ever seen. Can barely fit two people. But its no problem. The breakfast is ample, and the Arts et Metiers Metro station is right outside the door. About a 10 min walk to the Hotel de Ville. I would definately stay here again. Free internet access in the lounge downstairs was a realy help, and also a great place to gather before sightseeing, or after a night out, before bed. I stayed here with a group of 6 other people, and we all enjoyed this hotel. No fridge in the room here, which is a real inconvenience. But we managed over the 3 nights. Staff were friendly, but did not speak much English (if at all). I speak French, so spoke for our group, but non-french speakers should note this.", "Date": "July 9, 2008"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Business service (e.g., internet access)": "2", "Check in / front desk": "2", "Overall": "3.0", "Value": "2", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Seattle, WA", "Title": "“OK, not great.”", "Author": "TimHowlin", "ReviewID": "UR16506058", "Content": "This hotel was OK. No A/C, which can be a problem in the Summer. If you get a room in the front of the hotel, very noisey. In the back, no noise, but an ugly view of an ugly wall. It is right next door to a Metro stop, but that is not uncommon in Paris. My first room the the 5th floor, I could not get the wireless signal, so I talked them into moving me into a room on the second floor (and that was harder then it should have been). It worked fine on the second floor. The guy who worked the desk in the day was kind of a jerk, but the guy who worked nights was nice. All the rooms have a full size bed, so even if you are only paying for a single, you get a bigger bed, which is not always the case in Europe. I had a friend crash on the floor the last night after we both had too much to drink, and the hotel noticed this, and charged for a double on the last night. Very low class. Overall, nothing great, but it worked. If you have other options, you might want to go with them.", "Date": "May 30, 2008"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "uk", "Title": "“Great little hotel”", "Author": "rback", "ReviewID": "UR15676409", "Content": "We had a great time at Austin's Arts et Metiers when we used it as a base to explore Paris for the weekend. It is situated close to a metro station and busy road junction, yet it is off a quiet side street so that the noise does not carry. I would compare this to a well run UK B&B, but with the added advantage of a 24 hour reception. The room itself was small but well decorated and in good repair- the towels were changed daily, the bed made, etc. Breakfast was in a small room- a choice from breads, pastries and croissants, cereals, fruits, boiled eggs and yoghurts, juices and coffee- it all went down well, particularly the fact that it was included. We didn't take advantage of the lounge which had a PC with free internet access, but it was reassuring that it was there. The only two downsides were the lack of a kettle in the room (cold drinks were available from reception at a price), and that the otherwise quiet street seemed to be a meeting place for moped driving youths who would talk loudly till 11PM. The windows were good enough to block the noise out, but on a hot evening you don't tend to want to close them.", "Date": "May 5, 2008"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Business service (e.g., internet access)": "3", "Check in / front desk": "4", "Overall": "4.0", "Value": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Sarasota", "Title": "“Quiet Hotel in the Heart of Paris”", "Author": "Euroglobe", "ReviewID": "UR12981840", "Content": "Austin’s is a small traditional 6-story hotel with only 30 rooms but very well-located on a quiet street in the Marais (3rd Arrondissement), and an easy walk to the Pompidou Center or Place de la Republique. The Arts et Metiers metro station is right across the street, and there are some restaurants and shops in the general area. We stayed for 3 nights and though our room was typically (for Paris) tiny without much of a view, it was spotlessly clean and in excellent condition, as was the bathroom. The front desk staff is pleasant and helpful. There is a small breakfast room where a decent continental breakfast buffet is served, including croissants, breads, jam, cereal, cheese, fruit, juice and coffee. All in all Austin’s is a nice hotel in an excellent location and it served us well during our stay.", "Date": "January 25, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "4", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Leuven", "Title": "“Great little hotel”", "Author": "toolish", "ReviewID": "UR11907391", "Content": "Location: excellent. Value for money: excellent. Room was beautiful and quiet. Breakfast was okay. Simplicity can be beautiful.", "Date": "December 23, 2007"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "4", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Lyon, France", "Title": "“good little hotel”", "Author": "only-lyon", "ReviewID": "UR10852614", "Content": "We had a globally good experience at the Austin's Arts et Métiers. A good little hotel with small but comfortable rooms, free wifi, good breakfast. Unlike previous poster, our 2 rooms were newly refurbished, the bathrooms also new and very clean. Our double room looking on to the road was nice, with a large bathroom with a window. But our kids twin room look onto a tiny yard, so receive no day light and the only view is a dirty wall. It did not matter much as we came back to the hotel only late at night. But other travellers should be aware that the twin rooms are not as comfortable as the double. The staff is helpful, the lady in the breakfast room nice and welcoming, except for one morning she was not there and we had a terrible lady, almost rude to customers. The neighborhood is excellent. Very central location, a Métro stop very close to the hotel door. It makes us discover neighborhoods we were not familiar with, although we know paris pretty well; for example the Marché des Enfants Rouges. And while staying here, don't miss the excellent Musée des Arts et Métiers, definitively worth a visit.", "Date": "November 16, 2007"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Business service (e.g., internet access)": "4", "Check in / front desk": "4", "Overall": "4.0", "Value": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Irvine", "Title": "“Small but Nice, Convenient”", "Author": "Bear88", "ReviewID": "UR10360473", "Content": "Arts et Metiers was a decent hotel for the money. The staff was very friendly (especially when I spoke a little French to them), and though the room was small it was comfortable and clean. Convenient metro transport right across the street, plenty of cafes in the area, a bakery around the corner, and a grocery store two blocks down make this a wonderful location. The rooms are soundproofed, so we had no trouble with noise. The only problems for us were that there was no refrigerator in the room and the in-room TV had only one English station -- BBC -- whose sound was very, very soft, despite turning the volume all the way up. The French stations, of course, had perfect volume. Overall, we'd recommend Austin's Arts et Metiers to anyone looking for a reasonably-priced hotel without any frills that's clean and in a great location.", "Date": "October 26, 2007"}, {"Ratings": {"Service": "3", "Cleanliness": "2", "Business service (e.g., internet access)": "2", "Check in / front desk": "3", "Overall": "2.0", "Value": "2", "Rooms": "1", "Location": "4"}, "AuthorLocation": "Melbourne", "Title": "“Location without luxury”", "Author": "BellaMatrinez", "ReviewID": "UR10024956", "Content": "Austin's Arts et Metiers Hotel's main advantage was its central location and close proximity to transport. However, the room is uncomfortably tiny, dated and “run down”. I do not recommend this hotel, particularly for long stay and special occasions (e.g. honeymoon, anniversary). Pros * Central location, close to some attractions e.g. Notre Dame * Walking distance to metro * Tourist bus stops nearby * Close to restaurants / cafes * Reception staff spoke English and were helpful. Cons * Rooms, breakfast room and lift are tiny * Room's decor and furniture is dated and old, resembling a back packer’s hostel * Rooms are \"run down\" e.g. air dryer did not work, sink required plumbing as it kept blocking * No air conditioning in rooms, which will be unbearable during hot weather * Rooms absorbed external noise eg neighbouring rooms' doors shutting and street noise lead to sleepless nights * Hotel's computer was not operating, impacting Internet access * Room's cleanliness was not 100% for those who are pedantic e.g. stained carpet, hair on spare pillow * Breakfast lacks variety and is the same daily", "Date": "October 1, 2007"}, {"Ratings": {"Overall": "3.0"}, "AuthorLocation": "california", "Title": "“So- so hotel”", "Author": "travelor222222", "ReviewID": "UR8422488", "Content": "The hotel was fine for the price. It definately was not a glamorous hotel. The staff was nice and there at all hours of the day and night. They were helpful with directions around the city but not very helpful booking excursions. I stayed on the 5th floor. The room had an odor but was relatively clean. The bathroom was small but had what you needed. The hair dryer was a bit weak. The shower pressure was acceptable. They bed was comfortable. The hotel is not in the greatest area, I didn't want to walk alone at night. I wouldn't stay at this hotel again only because of the location. I would want to be more in the center of Paris.", "Date": "August 14, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "3", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Canberra, Australia", "Title": "“Very clean and handy to metro”", "Author": "room_check", "ReviewID": "UR8184585", "Content": "I stayed in this hotel for 5 nights. I had room 601 on the top floor which looked out over the street. This room was quite large with plenty of space, it had two cupboards for your bags and a small desk. The bathroom was small but recently renovated and very clean. With no air conditioning the room did heat up somewhat, and it was difficult to sleep at night with the windows open because of street noise, the temperature only reached about 30 degrees C when I was in Paris, so in the height of summer it would probably become very hot in the room. The staff were very helpful and allowed me to leave my bags when I arrived early and minded them again when I checked out, but had an evening flight. I received an extremely good deal booking via asiarooms.com of 62 euros a night including breakfast. The breakfast room is small, only holding about 20 people a time, so you might have to wait a little. The breakfast is all fresh and consisted of a roll, croissant, cheeses, jams, honey, three types of cereal, fruit, fruit salad, yoghurt, small cakes, orange juice, tea, coffee, hot chocolate and boiled eggs. Extra rolls and croissants are there for the taking. It is served between 7am-10am. One morning I left at 6am and they allowed me to take some rolls, croissants and jams. There is a computer in the small lounge area where you can access the internet, the connection is slow at times and it frequently froze. Free wifi is available throughout the hotel. The metro exit is practically at the front door, and just down the road around the corner was a frans prix supermarket, good for snacks and drinks. This was an excellent hotel but without air conditioning it could be uncomfortable.", "Date": "July 19, 2007"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Business service (e.g., internet access)": "4", "Check in / front desk": "4", "Overall": "4.0", "Value": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Los Angeles, Calif USA", "Title": "“A charming hotel in a great city....”", "Author": "Iggywine", "ReviewID": "UR8023342", "Content": "It took awhile to find a hotel in Paris that would fit our budget requirements, but this hotel was a special find. Located right at the Arts & Metier Metro stop in the 3rd, this hotel was a perfect location for localized strolling (to Notre Dame, the Pompidou Museum, (and to Starbucks in the 4th!!), and also close to the Place du Republique for a (disappointing, sadly) dinner at Chez Jenny. It helped somewhat that the desk clerk complimented me on my somewhat limited grade-school heritage French, but the rooms were very clean and (always important for Americans!) the bathrooms were not only up to date but they had wonderful showers as well. The beds were comfortable, but somewhat typical of European beds overall (how do they sleep there?). Other reviews have mentioned noise and vibration from the Metro, but we didn't notice any at all - then again, we were on the top floor (the 6th), with a wonderful view out to the street below. The desk clerks were always helpful with local phone calls as well, and they provided us with a converter plug to help charge our various accoutrements (which we of course took with us and had to mail back....) The morning breakfast was pleasant (although interestingly served by a somewhat dour kitchen helper, at least on one morning). This trip to Paris was my 4th (I think), but far and away the most enjoyable, and I have to think that the quality of our accomodations was a significant part of that. I would highly recommend this hotel to anyone wanting to spend more money on what goes on OUTSIDE of a hotel stay!! (Like our dinner at Angle de Faubourg, for example!!)", "Date": "June 28, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "New Zealand", "Title": "“superb smaller style hotel”", "Author": "Musclebearnz", "ReviewID": "UR6484683", "Content": "My partner and I stayed at this lovely little hotel from 18-22 December 2006. We arrived early in the morning on an overnight flight from Bangkok. The kind reception manager let us straight into the room at 9am in the morning, unlike most hotels in europe that make you wait till the official check in time mid afternoon. The room was small but had everything we needed. It was impeccably clean. The breakfast room while being criicised in previous reviews for being on the small side, wasnt a problem for us as there was never more than one or two other couples in the room at the time. The breakfast was superb, lovely rolls, crousants, cheeses, preserves, fruit, cereals, breads and all hot drinks available. My only criticism was the lack on English channels on the TV. The staff were always so frienly and helpful. This hotel made our stay in Paris even more memorable and we cannot wait to return to Paris and of course this hotel.", "Date": "December 23, 2006"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Business service (e.g., internet access)": "5", "Check in / front desk": "3", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Norway", "Title": "“great deal!”", "Author": "Terje_D", "ReviewID": "UR6176668", "Content": "We booked our trip after reading the reviews from www. tripadvisor.com and are very happy with the recommendation. Can also recommend booking the hotel through (-). Great price, great location (10 meters to the Metro), a nice walk to The Latin Quarter and St. Germain and close to my favorite Place des Vosges and small shops and nice markets. Breakfast is not included, but is nice and not too expensive.", "Date": "November 26, 2006"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "St Paul, MN", "Title": "“Great hotel”", "Author": "TPMACK", "ReviewID": "UR5807882", "Content": "My daughter and I stayed here for 3 nights and would return again without question. It is very convenient to the Metro. It is exceptionally clean and our room was quiet and comfortable. The staff was always very friendly and helpful. The breakfast is delicious and although the room seems small, we never had a problem finding a place to sit and had great conversations with other guests. When we visit Paris again, we will definitely stay here.", "Date": "September 16, 2006"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "4", "Check in / front desk": "5", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Los Angeles, California", "Title": "“Our Second Home!”", "Author": "rfloto", "ReviewID": "UR5790739", "Content": "In August of 2006 we returned to the Austin's Arts et Metiers Hotel in Paris. We had stayed there during our honeymoon the previous summer and missed Paris so much we decided to visit again and stay in the same hotel! Like most hotels in Europe, the rooms are small...but cozy. But unlike some rooms we've stayed in the Austin's Arts et Metiers Hotel has plenty of \"breathing room.\" We felt very comfortable, and very much at home! Like the previous year, we once again received the same wonderful treatment from the hotel staff. On the first night there, due to the unusual heat wave that most of Europe was experiencing this summer, we had to sleep with the window open....but unfortunately the light from the Hotel sign kept us up. So the next morning we were moved to another room...and to our delight it was the same room we stayed in for our honeymoon! So once again, the Austin's Arts et Metiers Hotel made our visit to Europe very special! The Austin's Arts et Metiers Hotel will probably always be our home when we visit Paris. We've already recommended it to some friends that will be visiting Paris for their own honeymoon in 2007...and they are already planning to stay there!", "Date": "September 11, 2006"}], "HotelInfo": {"Name": "Austin's Arts et Metiers Hotel", "HotelURL": "/ShowUserReviews-g187147-d296785-Reviews-Austin_s_Arts_et_Metiers_Hotel-Paris_Ile_de_France.html", "Price": "$132 - $228*", "Address": "<address> <span rel=\"v:address\"> <span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">6 rue montgolfier</span> | <span class=\"extended-address\">3rd Arr.</span>, <span class=\"locality\"><span property=\"v:postal-code\">75003</span> <span property=\"v:locality\">Paris</span></span>, <span class=\"country-name\" property=\"v:country-name\">France</span> </span> </span> </address>", "HotelID": "2515219", "ImgURL": "http://media-cdn.tripadvisor.com/media/photo-s/01/f9/9c/7b/double-red-room.jpg"}}