{"Reviews": [{"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Edmonton, Canada", "Title": "“loved this hotel”", "Author": "Barry L", "ReviewID": "UR126659836", "Content": "Stayed here while at a conference. Large room, friendly staff. Roof has an amazing sitting area. Although the San Diego weather was dreadful, loved this place.", "Date": "March 26, 2012"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "rosaritobeach", "Title": "“Great Location. Great View.”", "Author": "rosaritobeach", "ReviewID": "UR118009600", "Content": "This is a great resort. Different from other Worldmark properties because it is an urban location and an existing building that got renovated. It is right on the edge of Balboa Park and a short walk into the heart of the Gaslamp. Few blocks from the trolley station. And right off the Fwy exit if you do get a car, but not necessary. You can take the bus from the airport. And take the trolley down the the border. Can walk to Horton Plaza and do an all day tourist bus trip. this day bus trip is a jump on/ jump off tour. It will take you to the zoo and everywhere else for a first time visitor. It is a great location. Near everything, Just a short walk away. But back enough that it is quiet at night. A lovely roof top patio to enjoy. And not big bucks. Very nice small kitchen. Can fix the basics for breakfast. Some pasta, etc.... There is a large market downtown, near Horton Plaza. I love this location. Like many urban places, there are many homeless people in the area. During the day, there is no problem. Like anywhere, I would be careful at night. I would not rent a car here. but late at night, I would spend the money to take a taxi home after dinner, clubbing, or a move in the Gaslamp area. There are tons of all of these, just a few blocks away. You will spend less on a few taxis than you will per day to park the car.", "Date": "September 12, 2011"}, {"Ratings": {"Cleanliness": "5", "Overall": "4.0", "Value": "5", "Service": "5", "Rooms": "5"}, "AuthorLocation": "", "Title": "“Well worth the money”", "Author": "A TripAdvisor Member", "ReviewID": "UR3796992", "Content": "My family and I stayed at the Staybridge downtown for one night following a wedding. The hotel is quite nice due to its recent remodel/opening. Rooms were spacious, with a nice kitchenette and large tv/ dvd player. The roof was a nice little haven, overlooking the city. Breakfast was better than most you receive with your room but the food was nothing too great. I would recomend this hotel to anyone going to the zoo, or needing to get to the airport since it is very close to both. For the money, I think this hotel is great compared to others in the San Diego area. The area is somewhat skecthy with homeless wandering around, but probably no different than many other hotel locations and certainly nothing to be overly concerned with. I would recomend parking on the street if you want to save yourself $15, as there seemed to be plenty available spots when I stayed there.", "Date": "August 22, 2005"}, {"Ratings": {"Cleanliness": "4", "Overall": "5.0", "Value": "5", "Service": "5", "Rooms": "5"}, "AuthorLocation": "Nationwide Traveler", "Title": "“Hidden Gem in Downtown San Diego”", "Author": "Adogg", "ReviewID": "UR3574661", "Content": "I stayed at this Hotel 3 weeks becuase it was such a good hotel. They have gone through a remodel about a year ago and it feels and looks very clean. Also, the rooms are spacious, they have parties on the roof and the staff were great. I became friends with the staff and we were all on first name basis. The Hotel has a great internet connection - just like a home cable modem.", "Date": "June 18, 2005"}, {"Ratings": {"Overall": "2.0"}, "AuthorLocation": "Boston, MA", "Title": "“It was okay”", "Author": "A TripAdvisor Member", "ReviewID": "UR3423802", "Content": "My stay at the Staybridge was okay - I was in town for a huge convention and the options were not really great. So, I got the room through hotwire.com for an admittedly great price. However, there were a couple of issues: the night I arrived, they informed me that I was going to be \"walked\" (a euphemism for 'driven via cab') to another hotel because they had overbooked the hotel. I wasn't really aware that this was something that normally happened, but I went along with it because there were no other options. While I could have allowed myself to get very bothered by this, I have to admit that the staffperson helping me was very contrite and apologized up and down for the inconvenience. This made the situation a bit more tolerable (i.e., things would have been different if the staffperson were rude...) but it was definitely an inconvenience nonetheless. Being overly tired from having flown across the country (and it being fairly late at night), I went to the other hotel. The next day I was shuttled back to the Staybridge and (since I was arriving early) the staff accomodated me quite well and placed my bags in a secured locker for which I had a key. I stayed 3 more nights in the Staybridge and the experience was more or less pleasant. I suppose it's not fair to blame the hotel but this was definitely an imposition and had I the choice of doing it again, I would choose a different hotel. While the way it was handled was fine, there's something to be said for being organized enough to not allow yourself to get into the position of having to shuttle guests (upon arrival!) to a different hotel in the first place. All in all, the situation left a bad taste in my mouth and I would say the experience was okay at best.", "Date": "April 29, 2005"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Tustin, CA", "Title": "“Great place!”", "Author": "A TripAdvisor Member", "ReviewID": "UR2701205", "Content": "We stayed at the hotel the start of October for only one night but were impressed. The rooms were nice and we were easily able to accomodate 4 adults. The king 1 bedroom suite we stayed in had a seperate bedroom with a fold out couch in the living room. There is a full size kitchen with a fridge, stove, microwave, etc. There are plates and stuff and they even provide you with coffee and popcorn for the first night. Also, there is a DVD player for each of the tvs! We walked to the end of the Gaslamp Quarter (there is a SPaghetti Factory at the end of 5th street) and it was a nice walk (20 minutes) and enjoyed seeing all the nightlife. The breakfast in the morning was excellent - probably the best we've ever had at a hotel. We took the advice of a previous guest and saved ouselves the $15 parking fee by parking on the street. I would definitely recommend this place.", "Date": "October 13, 2004"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "NY, NY", "Title": "“Loved the Staybridge San Diego!!”", "Author": "A TripAdvisor Member", "ReviewID": "UR2522771", "Content": "I recently spent 2 weeks at the Staybridge in San Diego and found it to be a wonderful experience. The staff is attentive and friendly. They have the standard free laundry, breakfast and sundown reception, but the building is a converted Art Deco that has been marvelously transformed. This property apparently just opened as a Staybridge in January '04. It doesn't look like other Staybridges (they've tried to keep the art deco fee), but has all of the same amenities - including DVD players in each room. The crown jewel is the rooftop deck. It's close to Balboa Park and walking distance to everything downtown. Yet, since it's not in the heart of downtown, you avoid the noisy partiers and homeless population. I definitely recommend it!!", "Date": "September 10, 2004"}, {"Ratings": {"Overall": "3.0"}, "AuthorLocation": "Highland, NY", "Title": "“Clean But Lacking”", "Author": "A TripAdvisor Member", "ReviewID": "UR2363516", "Content": "This is a very nice hotel, since it has been recently rennovated but there are some major complaints that cannot be ignored. The walls and floors are thin so be prepared to hear lots of doors slamming and pounding from up above. One thing that would help is if the doors had self closers on them so they wouldn't slam. My wife and I wake up 4 times a night because of this. Positives: Friendly staff, clean rooms, breakfast included Negatives: Noisy, thin walls, mediocore breakfast, shady neighborhood, $15 parking fee per day.(Hint. Refuse the parking pass and park for free on the street)", "Date": "August 3, 2004"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "", "Title": "“Great hotel, shady neighborhood”", "Author": "A TripAdvisor Member", "ReviewID": "UR2281591", "Content": "My husband and I stayed here for 2 nights and thought the hotel itself was an excellent value. The room was new and clean, and it had everything you could possibly need. (It was an efficiency/suite.) They also served a good (free) breakfast in the morning. No complaints about the hotel itself except that shower pressure could have been better. The one drawback is the location. Yes, it is walking distance to Gaslamp, but it is through a slummy neighborhood. The one time we walked it, we were approached by several beligerent homeless people. Then again, most of downtown SD is like that...", "Date": "July 7, 2004"}], "HotelInfo": {"Name": "WorldMark San Diego", "HotelURL": "/ShowUserReviews-g60750-d295745-Reviews-WorldMark_San_Diego-San_Diego_California.html", "Price": "$115 - $179*", "Address": "<address> <span rel=\"v:address\"> <span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">1110 A Street</span>, <span class=\"locality\"><span property=\"v:locality\">San Diego</span>, <span property=\"v:region\">CA</span> <span property=\"v:postal-code\">92101</span></span> (Formerly Staybridge Suites Downtown)</span> </span> </address>", "HotelID": "2515709", "ImgURL": "http://media-cdn.tripadvisor.com/media/ProviderThumbnails/dirs/2c/2c/2c2c2e68c3b46e7794863d7d25d079961large.jpg"}}