{"Reviews": [{"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "5.0", "Value": "5", "Sleep Quality": "3", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Krakow, Poland", "Title": "“Nice hotel, good localizatoin”", "Author": "krk83", "ReviewID": "UR126794531", "Content": "Terminus Hotel is a nice place with helpfull staff. It is located about 20 m from metro station. Rooms are clean and comfortable but small. At night, need to close windows because of the loud noise on the street. There is a WIFI network in hotel. In area there is a lot of shops, restaurants. There is also tram and taxi station.", "Date": "March 27, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Sleep Quality": "1", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Istanbul, Turkey", "Title": "“good location, bad bed”", "Author": "onur d", "ReviewID": "UR126247947", "Content": "the location was perfect, just next to the metro station..hotel was clean, I cannot write anything about personnel because we didn't need to ask much..but bought Disneyland park ticket at hotel, that was a plus. But I need to warn you about the beds. I don't have any idea about the other beds in other hotels, because it is only hotel I stayed at Paris, but the beds were small and so disturbing... even we were exhausted due walking all day, we couldn't have proper sleep.. by the way, there was kiosk at just in front of the hotel, crepes and sandwich were so delicious.. we were having breakfast here and getting sandwiches for snack times..", "Date": "March 17, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Ashdod, Israel", "Title": "“Great location, comfortable hotel”", "Author": "Yuliya1987", "ReviewID": "UR126045473", "Content": "Me and my boyfriend stayed at the Terminus Orleans hotel in March 2012. The hotel is comfortably located near the Prote orleans (metro line 4) metro station. We took a taxi from CDG airport, but it is relativity easy to get there by train if you arrive in paris before 11 PM (the last train leaves at 10:55 PM). We got a room on the 7th floor, the only downside about that is that the elevator only reaches the 6th floor and we had to walk up the stairs to the 7th floor. also, the elevator is old fashioned , and can only fit 2 people with 2 suitcases, in the morning in the housekeeping time the elevator was occupied with the sheets and blankets and we had to use the stairs to go down - which was not so bad. The room itself was small - but sufficient if you only plan on sleeping there and being out all day - like we did. the room was very clean - sheets and towels were changed every day. The bathroom was newly renovated and also very clean, we always had plenty of hot water. The room had no air conditioning but did have central heating - since it was cold at night when we stayed it was perfect - not sure about how it would be in the summer when it's hotter. Anther downside - which was minor for us - is that the walls are very thin, you can hear everyone's everything. during the night it wasn't a problem, but in the morning when we got ready to leave we heard what was going on in the hall and the rooms on our floor. overall, it's a great hotel and great value for money! one tip, the hotel offers a shuttle to the airport for 18 Euro per person - this is a very good price and saves you the trouble of taking the train. you need to book this option one day in advance.", "Date": "March 13, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Tel Aviv, Israel", "Title": "“small and comfortable”", "Author": "Hagai9", "ReviewID": "UR120770780", "Content": "i have a good stay, the room is very small but must of the hotels in Paris are. the room is clean and looks new. nice small balcony to the street . breakfast has only coffee/tea. bread, orange juice and yogurt. location is good, just 5 steps from a subway station (1.7Euro to Eiffel tower) nice coffee shops and restaurants on the hotel street area", "Date": "November 19, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Vancouver, Canada", "Title": "“So wonderful”", "Author": "s e", "ReviewID": "UR119774552", "Content": "What makes this hotel is number one, the staff; our lovely little balcony in the trees, overlooking the street; clean, comfortable room; and of course, the coolest elevator. The bathroom was tiny, but not a problem -- we found hotel bathrooms very small pretty much throughout Europe. Really enjoyed the gracious desk staff and the room staff were very sweet as well. It's my hotel in Paris from now on.", "Date": "October 26, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Coleraine", "Title": "“Ideal Stop off Point in Paris”", "Author": "Onwards", "ReviewID": "UR119528359", "Content": "Four of us were travelling by car from Frankfurt to Cherbourg and thought that a two nights stop in Paris would break the journey and give us a day in Paris. Following browsing through Tripadvisor I picked the hotel due to its proximity to the Periferique, car parking, the Metro and restaurants and the reasonable price and we were not disappointed on any of these counts. The hotel is just off the periferique, the car park is just around the corner and is manned 24 hours (costs 21 Euros for 24 hours), there are numerous restaurants in the locality and we were particularly pleased with the Cassenova, an Italian restaurant just on the corner as you go to the car park. The entrance to the M4 metro line is literally yards from the hotel and it takes you with one change of train to just about any of the sights. The rooms were small but clean and comfortable. I would happily recommend this hotel as a suitable overnight location for car travellers through Paris.", "Date": "October 20, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Boston, MA", "Title": "“Basic hotel but cheap and convenient”", "Author": "cash1111", "ReviewID": "UR118606938", "Content": "This hotel is a basic hotel but it is cheap and very convenient to the train station. You get out of hotel, walk 20 steps and there is a train station. Grocery store, food joints all nearby.", "Date": "September 26, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "4.0", "Value": "4", "Service": "5"}, "AuthorLocation": "Cape Town Central, South Africa", "Title": "“Clean and Friendly Staff”", "Author": "Darianve", "ReviewID": "UR116503819", "Content": "Very happy with our stay here, staff were very helpful and room was clean bathroom was a little small and maybe some sort of extractor should be installed (turns into a bit of a sauner after a shower) but otherwise was comfortable and felt like we were coming home after a day out in Paris.", "Date": "August 10, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "3", "Overall": "4.0", "Value": "4", "Service": "4"}, "AuthorLocation": "", "Title": "“Good value”", "Author": "Formulaman", "ReviewID": "UR116497047", "Content": "Very close to the metro line 4 (18 minutes to Notre Dame). Parking was easy at nearby garage for 20 Euro daily with hotel validation. Rooms were small but clean. Wifi OK. Small lift (2 people max). I would stay here again.", "Date": "August 9, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "4", "Overall": "4.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Cluj-Napoca, Romania", "Title": "“Didn't expect to be such a pleasure!”", "Author": "dya_net", "ReviewID": "UR115692953", "Content": "We have stayed at this hotel for 8 nights and it was a pleasure for us. Each day they did the bed, changed the towels.We had toilet kit(shower gel-2, solid soaps-2, and a wet-sealed little towel for the shoes). Look for the hairdryer, because there is one :) The staff was very pleasant and helpful each time we needed.The metro station-Portes d'Orleans are 3-5 min far from the hotel (on the right side as you look at the hotel);there are also a tram station just in front of the hotel(this variant we didn't use it), and also at 10 min far away from the hotel there is a terminus bus station (no.28 and 38-both of them have important stops in the center of the city) which is very helpful if you don't want to take the metro and want to see the town (there is \"ticket t+\" available for metro, tram and also for the bus). There isn't an aircon, but we were lucky because in those days were 18-25 Celsius degrees max. The \"minus thing\"- the noisy doors(we could here in the morning everybody who had to close their doors, or the lady who was doing the cleaning). In other words, we did like at the Hotel Terminus Orleans a lot and we will come back.", "Date": "July 23, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Warwick, Rhode Island", "Title": "“Perfect Budget Hotel”", "Author": "Lizzabs", "ReviewID": "UR115588551", "Content": "No Frills, convient hotel. My boyfriend and I stayed here a week from the end of may to the begining of June.This hotel is located right on the #4 metro line making it easy to get to from the airport, and to get around the city. It's location is nice, I always felt safe walking around there are a few places to eat, shop, and do laundry around not too many but enough. Yes, the rooms are small but larger than many others I've stayed in around Europe the bathrooms is cramped but for the price and location I can't complain. The staff was wonderful I actually booked the wrong days when I booked the hotel originally and when I contacted them to change it they were very friendly and changed it no problem with no extra charge to me. We didnt' use the breakfest at the hotel so no comment on that, we did get crepes once at the stand outside, it runs odd hours. For my boyfriend and me this was the perfect hotel cheap and convient. We were up and out early exploring the city and didn't come back to late, during our stay the satelite for the TV was out of service but it really didn't impact us at all. It really all depends on what kind of traveler you are if you are looking for something fancy don't stay here its the basics but for some it's enough.", "Date": "July 20, 2011"}, {"Ratings": {"Cleanliness": "2", "Sleep Quality": "1", "Overall": "2.0", "Value": "2", "Service": "1"}, "AuthorLocation": "Ashburn, Virginia", "Title": "“No Air Conditioning”", "Author": "AC_monika", "ReviewID": "UR115289475", "Content": "Beware people, this hotel does not have air conditionning. We were told that it doesn't mention on the website that there is no AC even when the temperature outside is 90 F. We bought a Fan ourselves and manager promised to refund us some money but at checkout he was not there and didn't leave any message for the front desk. What a waste hotel. The restroom was like in the room so tiny I hit my elbows twice in the shower.", "Date": "July 12, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "4.0", "Value": "5", "Service": "4"}, "AuthorLocation": "London", "Title": "“Good budget accomodation”", "Author": "KatLLondon", "ReviewID": "UR111722770", "Content": "You pay for what you get and for the money that we paid this was a good little hotel. It is based right by the metro so very easy to reach from town. The rooms and bathroom are small but clean with a good shower. The walls are thin so you can hear noise from the corridor which is the only issue. Apart from that a good reasonably priced little hotel.", "Date": "June 6, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Munich", "Title": "“Cute little hotel - and very reasonably!!”", "Author": "Wayfarer_m", "ReviewID": "UR111486061", "Content": "We stayed there for 3 nights in May 2011. The personal at the reception desk was friendly and helpful. We had a room looking at the backyard, so the view was not the best but on the other hand it was quiet and we didn't have the street noise at night. The room itself was (as measured by Paris standards) comfortable sized and the furniture is just fine for the price. Anyway, we had the impression that parts of the hotel were renovated not long before. The bathroom was also very clean. Additional amenities in the room: 32\" Flatscreen TV (even with HD channels; unfortunately these just in french), Free WIFI (but signal quality in some parts of the hotel is not the best) and room service (cleaning just fine). The hotel does have a breakfast room, but we didn't book the breakfast. But there is one negative point: the walls are thin as papers. It didn't bother us so much, because running around in the city will get your tired enough to get a comfy sleep, even it is a bit louder. It may however be an issue for those suffering under fitful sleep. Over all: worth every single penny (the price was exceptional reasonable!). Maybe better than some of the more expensive hotels. Would stay there again when coming back to Paris!", "Date": "June 4, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Vancouver, Canada", "Title": "“Great Room in a Great Location”", "Author": "travellingcnuck", "ReviewID": "UR100992371", "Content": "The first thing I noticed about the hotel is the great location. It was very easily accessible from the Orly Airport (take the Orlybus), and it is steps away from the metro station. It is in a nice area with restaurants, a Carrefour, and other shops. The front desk spoke English, and was very friendly. The rooms were clean and quite spacious. The bathroom felt new and the shower was great. The big TV and the Wi-Fi included in the room were both a plus. As far as Paris hotels go, this was a very comfortable stay at a great price.", "Date": "March 21, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "2.0", "Value": "1", "Sleep Quality": "1", "Rooms": "2", "Location": "3"}, "AuthorLocation": "Leeds, United Kingdom", "Title": "“dissapointing”", "Author": "stinky1982", "ReviewID": "UR93166676", "Content": "We paid alot for this hotel and were very disapointed it was very noisey and very small. We could here people coming and going. The local amenities were poor however it was very close to the metro so we could escape easily.", "Date": "January 16, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Melb, Aust", "Title": "“Perfect Paris”", "Author": "greggylopez", "ReviewID": "UR90446854", "Content": "We arrived at 8.30 am after an allnighter from Australia and Anthony immediately arranged our room, despite having booked for the similar named hotel in Orleans and for 2011. He called the other hotel sorted it out and was great help in planning our one day in Paris. The location is perfect for the underground which was great in the snow. Some excellent and cheap cafes close by. Rooms clean, very comfortable and quiet. So happy we stayed here.", "Date": "December 22, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "4", "Rooms": "4"}, "AuthorLocation": "constanta", "Title": "“I've stayed here for 4 nights.very good...”", "Author": "cristina_ceara", "ReviewID": "UR83211354", "Content": "I've stayed here for 4 nights.very good rate for paris.near the metro. The receptionist was very helpfful and another great thing:free wireless internet. It seemed like a 3 star hotel;the room was not tiny as expected.", "Date": "October 12, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "elderslie", "Title": "“Fantastic find.”", "Author": "LGMElderslie", "ReviewID": "UR83112270", "Content": "We loved this hotel. Never having been to Paris before we read the hotel reviews and were a bit apprehensive about its location. We flew from Glasgow to Beauvais and then transferred via the shuttle bus which took 1 hour and 20 mins into Port.. Maillot. Once at Port Maillot we found the metro and after changing lines only once we arrived at the Port D'Orleans. We had been travelling a while and dreaded a long walk to the hotel. How marvellous was the site of the hotel as we ascended the steps from the metro. Seriously it was just a few steps away from the front of the Hotel. The staff on reception are very friendly and helpful and all speak English well. Patrice is an excellent Manager and a star of trip advisor (read previous reviews) but he has a real challenge for the crown from Tariq who can not only speak English but many more languages as well and is a lovely person. THE HOTEL The hotel in general is small. The rooms are small but very nice and have everything you would ever need. The are modern and light, wh had a room on the 4th floor (404) which faced the front of the building, we also had a small balcony. The cleaner came in every day and made the beds, changed the towels and tidied. The lift at reception is brilliant! It is very small and can only take 2 people with bags, it is very old fashioned and quaint,lovely. The hotel is also in a very safe area. THE METRO We had Paris Visite passes which we bought online from a British company (hello paris) which were cheaper than anywhere else. They deliver to your home address. This gave us unlimited travel on the metro, bus and RER train as well as the Montmarte Funicular. This was great and we used it well. There are other tickets you can buy for the metro, you can buy 10 tickets for 12 euros which are good value. Each journey only uses one ticket. (Sometimes you might need to change lines several times and as long as you dont come out of the underground you only use the one ticket.) The transport system is fantastic, trains are constant and it is very easy to understand. The situation of the metro to the hotel makes travel easy. Unlike home the metro does not finish early but it is still a good idea to check when it finishes on a nightly basis. PARIS There is so much to see. There are so many beggars but they do not bother you if you say no. There are also warnings everywhere about pickpockets but we did not feel threatened or worried about anything. Infact I felt is was no worse than being at home or in any other city. In the area around the hotel there are places where you can buy sandwiches etc as it is very expensive. Round the corner to the left of the hotel is an area called Alesia and this is a good area for reasonable shopping and eating. Don't be too quick to jump on the metro and miss the opportunity to have a walk here. There is a supermarket about 5 mins walk from the hotel as you turn the corner to the left where you can buy sandwiches and drinks etc.", "Date": "October 12, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Missouri", "Title": "“Great value for Paris hotel”", "Author": "jrf25", "ReviewID": "UR80880905", "Content": "We stayed 3 nights here in early July 2010. It suited our needs perfectly - very inexpensive, serviceable en suite bathroom, near a secure garage to leave our car while we were there, steps from the Metro. This far south of the city center is not the most picturesque section of Paris, but we couldn’t expect more for the price. The room isn’t air-conditioned, but even on the 3 very hot days we were there, we had a nice breeze through the window, so it wasn’t a problem for us. We also highly recommend the crepe stand right outside the front door. Wi-fi worked, the staff was very friendly (and Engligh-speakers), clean, comfortable.", "Date": "September 24, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Swansea, United Kingdom", "Title": "“Great place to stay, good value for money in Paris”", "Author": "Jones_Swansea", "ReviewID": "UR80811453", "Content": "The hotel is a little out of the centre of Paris, but being right next to the metro station, this was no problem at all. We bought a 5 day metro pass and were able to see all the sights in the city easily. The hotel was very clean, the staff at reception were very friendly and eager to help with any queries. There are quite a few restaurants. bars, bakeries and a supermarket nearby. Positives: Great value for money, Clean and friendly, right next to the metro. Negatives: a little noisy at the back of the hotel at night (an air conditioning vent or something noisy nearby) so sleep a little disrupted at times, but otherwise fine.", "Date": "September 24, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Buckingham, England", "Title": "“Clean friendly and just what you need”", "Author": "Arafdown", "ReviewID": "UR80091186", "Content": "We stayed at this hotel from the 6th to the 10th September, and found it to be just what we wanted. We arrived early but the room was already made up for us and they were willing to take our luggage and store them if it was not so that we could start our break without carrying them about the city. The room as already said (room 107) was quite small which looked onto the rear of the hotel was very clean with a fuctional and clean bathroom with a shower that was great. The view from the room was of the air vents at the rear but this was not an issue for us. The staff on reception were very friendly and helpful with a great command of english and were able to answer our questions and give advice. They offered on our last day to store our luggage as well as our train was not until 1900 that evening without being asked which was nice but we were using the lockers at the Guard du nord station which were easy to use. There are a number of places to eat close by Auto Passion which is part of the hotel has food that was great, but if you wanted to have a more upmarket meal then we would recommend Zeyer which is a short walk up from the hotel near to the Alesia metro station which the food there was fantastic and well worth the walk there - its not that far at all and allows you to walk off a few calories on your way back to the hotel. When I return to Paris then I would not hesitate to stay here again - its a great base to see the city from.", "Date": "September 18, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "London, United Kingdom", "Title": "“Fantastic value for those wanting to stay in Paris on a budget”", "Author": "chaywa", "ReviewID": "UR79216017", "Content": "Trying to find decent hotels for those on a student budget in Paris was tough but with countless recommendations from Trip Advisor, this lovely hotel lived up to its name as a fantastic budget hotel. At around half an hour on the Metro (line 4) from Gare du Nord (if travelling in by Eurostar), the hotel is in a prime location for easy access to and from many of the key tourist sites in the city, such as the Louvre, Notre Dame, The Latin Quarter, the evening boat trips at Point Neuf (a must on a clear night!) and Montmartre which is ideal for those wanting an easy way to get around the city and back to the hotel at all times of the day. The rooms are not the largest but there is ample space for two persons to adequately move around the room and the mattress and pillows proved very comfortable to sleep on each night. The bathroom was exactly what you'd expect: clean and functional and the showers were always warm no matter what time of day which proved very handy! We stayed in a rear facing room on the 7th floor and experienced no sleep disturbance from the road to the front of the hotel with the window open, which proved essential to keep the room cool as there was no air conditioning available. The staff were very helpful at all times and there were plenty of local shops just around the corner of the hotel (including a delicious crepe stand) which proved ideal to grab a quick bit of lunch early in the day so that you don't have to pay the horrendous prices to eat at many other places in the city! When all is said in done, it has everything you need if you want to see the sites of the French capital on a city break: a great location for easy travelling to/from and a fantastically comfortable place to rest your head and feet at night after a long day of sightseeing! Will easily recommend it to friends and family and the great community of Trip Advisor for those wanting to head towards Paris in the future!", "Date": "September 12, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Houston, Texas", "Title": "“Will be back again!”", "Author": "Couple_from_Cypress", "ReviewID": "UR73932475", "Content": "We spent only 1 night but the hotel is what we were expecting considering we checked the reviews first. Small hotel but very close to the Metro. The elevator is tiny though. The receptionists are very friendly and can speak English well. They are helpful if you need advise on where to go. We asked the receptionist to keep our luggage when we checked out so that we can still go to the city and they did. We were supposed to check in again for another night but our flight was cancelled thus we missed our stay with them the second time around. We will definitely use this hotel next time we visit Paris.", "Date": "August 5, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Seattle, WA", "Title": "“No Frills - But What a find”", "Author": "Accidental_Hedonist", "ReviewID": "UR73901814", "Content": "From a traveler's perspective, there are cities where a simple place to rest your head is all that is needed, as the city provides ample reasons to keep you from the hotel. In cases like this, it's good to find cheaper hotels that still provide a modicum of service. That brings me to Terminus Hotel. It's not fancy. They are not going to put a chocolate on your pillow. There is no concierge. What they do have is a clean, cheap hotel room, and minimal yet friendly staff that speak English. Bonus feature? There's a metro stop right outside. The rooms are small to smallish, and no A/C that I can recall (having been there on two 95 Degree F days in early July), but the room was still comfortable. There is Free WiFi, and several bistros nearby (as well as two grocery stores if eating in is your thing...but why?) If you're looking to do no-frills in Paris, this place can help you out admirably.", "Date": "August 5, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "3", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Jakarta", "Title": "“Excellent price/quality, helpful staff”", "Author": "Okoth", "ReviewID": "UR73812723", "Content": "Based on what was written on Tripadvisor before, we booked this hotel. And without any regrets. Although the hotel is a bit far from the main attractions, the metro is only a few steps away and will take you to all the events in no-time. We bought a Paris Visite pass for public transport (there are (a little bit) cheaper possibilities, I know) and we could just jump in and out the busses, trams and metros wherever we liked. The elevator is quite small, three people will fit in it, or two people with luggage (if you love each other very much…), but you only have to go up and down with the luggage twice. We had to leave in the afternoon, but our luggage could easily be stored, no problem. The room was quite small (because we wanted to leave our suitcase on the floor and didn’t put our stuff in the wardrobe), but other than that, it was perfect. A good, clean bathroom with a warm shower. We stayed at the back of the hotel on the 7th floor (elevator goes until the 6th) facing apartments. Away from the traffic noise, but able to smell the French cooking of the restaurant next door. Plenty of good restaurants in the neighbourhood, so I gained 3 kilos… that are still there by the way… after 2 months… For cheaper option and breakfast: go to one of the bakeries and eat your belly round. One of the extras of this hotel was the very helpful and friendly staff. Tarik and his colleagues were extremely patient answering our million and one questions on where to go to and how to get there, how things work with public means etc. etc. All answered in English to our relief. Although I must say that we didn’t have any problems with being assisted in English at all in Paris. All in all, go to this hotel! You won’t regret it (if you buy some kind of a public transport pass).", "Date": "August 4, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Charlotte, North Carolina", "Title": "“Looking for a value? This is a great deal. Nice room, nice staff. Good (not great) location.”", "Author": "TravelerCharlotteNC", "ReviewID": "UR73389508", "Content": "SUMMARY: Good, inexpensive 2 star hotel option located 20 minutes by Metro from Notre Dame and the center of Paris. I would recommend this hotel to a friend. THE GOOD: Very fair price for lodging. Metro stop is 2 minute walk (maximum) to hotel. Metro line leads directly to center city. Staff is helpful. Room is clean. Water pressure and temperature good. Comfortable bed. Neighborhood safe with inexpensive dining options. THE BAD: Not near any real nightlife (although cafes are nearby and open past midnight). If you are really here for the night life understand you will be taking the bus when the metro closes (1 or 2 A.M.?). No Air Conditioning and small shower (these two are not really \"bad qualities\" as this seems typical in Paris). I’m from the States and stayed in Paris 6 days. This is my first trip to Paris, so I can’t compare this hotel to other hotels in Paris. I have traveled in over 20 countries, so even though I can’t compare the hotel to other Paris hotels, I’ll try to give a good general overview: STAFF: Patrick at the front desk is excellent. He is a cut above most employees anywhere. That being said, the entire staff is friendly and helpful. Most at the front desk speak good English. They are very helpful telling you the transportation options. COMFORT: • The room was in good shape and clean, although small (but I would think most Paris rooms are small). There is a decent sized closet and a small desk area to leave your computer. The bed was comfortable. • There is no Air Conditioning so ask for a room away from the street if noise bothers you. I was there in July but the daytime temps never exceeded 80, so when I got to the hotel at night I opened the windows for 10 minutes and the room was very comfortable. • The shower is small (2 feet by 2 feet), but the water pressure and temperature are very good. HOTEL AREA: The area in which the hotel is located is safe and people are at the cafes past midnight. NIGHTLIFE: There are some cafes and a bar within a close walk, although true nightlife is not at this location. If you are here for the tourist sites, this location is good… if you want nightlife outside your door, you may want to consider another location. INEXPENSIVE DINING: • There is a Crepe and Sandwich Kiosk between the Metro stop and the hotel. There sandwiches are 3 to 5 Euros and very good. • Just past the bus stop (for bus 68), there is both a supermarket and a bakery. It is less than a 5 minute walk from the hotel (walk out the hotel to your left, go to the intersection and turn left… the supermarket will be on the right side of the street). Go here for milk, cereal, fruit, sandwiches, etc if you want to save a few dollars. • There is also a Pizza and Gyro spot across the street from the Supermarket, so cheap eating is plentiful. • There are plenty of Café’s are in the area as well. Breakfast (Coffee, Crepe, Bread, and Juice) is 7 Euros minimum. TRANSPORTATION: Transportation options are plentiful. The hotel is a 60 second walk from the Metro exit, the bus and tram stops are also within a 3 minute walk. Most of the central tourist area is a 20 to 30 minute trip. • Underground: It takes about 20 minutes to take the Metro (direct with no stops) to Notre Dame; less to the Latin Quarter and Luxemborg Gardens. Most areas of the city can be reached with only 1 transfer from the 4 line and are within about a 30 to 40 minute ride. The Louvre, Orsey, Army Museum, etc are about 30 minutes. • Bus: Don’t discount using the Bus system. The Invalades (Napoleon’s Tomb / Army Museum) and other sites are a direct bus ride and can get you to places quicker than the Metro. The hotel staff will give you details. AIRPORTS: Generally, one transfer will get you from either Orly or Charles Degaul. • Arriving from Charles De Gaul Airport was easy. The RER Train goes to the Denfert Rocheret metro stop, and one transfer to the 4 line takes you to Port Orleans (the end of the line). If you follow the hotels directions to the Metro exit (Brune N° impair), you will leave the metro stop and arrive on the street less than 100 yards/meters from the hotel. • I departed to Orly, and bus 68 takes you to the Denefert Rochereua bus stop, which connects you to the Orly airport bus. Plan about 90 minutes to get to the airport, although you will probably make it in an hour or a little less. If I do this again I may try the RER train instead as the bus was very crowded. However, hotel staff recommended the bus so they probably know better.", "Date": "August 2, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Sydney", "Title": "“Great value”", "Author": "SydneyMountaingoat", "ReviewID": "UR69130916", "Content": "This is a great little hotel only minutes from the subway station Porte de Orleans and a quite reasonable tariff. The room was small but big enough for two people wanting accomodation at a reasonable price. The room was clean, everything worked and the staff on the desk went out of their way to help us. You can breakfast for about $10 but it is just coffee and croissants. Plenty of cafes and shops nearby if you are hungry . Great value. We chose this hotel because of the Tripadvisor reviews and we were very happy with it.", "Date": "June 29, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "3", "Overall": "4.0", "Value": "5", "Sleep Quality": "3", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Phoenix", "Title": "“Clean no frills hotel, friendly staff with convenient access to metro”", "Author": "alr121", "ReviewID": "UR67882119", "Content": "Very nice tourist hotel very convenient to metro. No frills, but very clean but small rooms for the price. Excellent staff, very friendly and helpful.", "Date": "June 18, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Sanibel Island, Florida", "Title": "“Terrific Value, Friendly Staff”", "Author": "superdax", "ReviewID": "UR67487729", "Content": "English speaking front desk staff is friendly and accommodating. Rooms are clean and decent sized, nice bathrooms. It's a pit far out from downtown Paris, but the metro is only steps away from the front door, and there are necessities (cash machine, food, shops) just nearby. Two people with luggage cannot fit in the very tiny lift, but that's no big deal. Only stayed here one night, but would absolutely recommend it to anyone for the price.", "Date": "June 14, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "3"}, "AuthorLocation": "Prague", "Title": "“GOOD HOTEL”", "Author": "Yelena_obr", "ReviewID": "UR67456092", "Content": "nice hotel! ou room was clean ,silent and comfortable. The location is good, the metro is besides the hotel, but it takes you some time to get to the city center.", "Date": "June 14, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "3.0", "Value": "5", "Sleep Quality": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "raleigh, nc", "Title": "“Stone throw from the metro”", "Author": "paletexan", "ReviewID": "UR65805138", "Content": "The hotel is a couple steps from the Porte Orleans station (last one on line 4); and very convenient if using the Metro/RER to/from CDG. Just make sure you go up the right set of stairs. We have not stayed in many older hotels in Paris, or Europe and it's difficult to rate this place relative to others. Therefore, i will just rate in comparison to a standard 3 start hotel in the US. We got a room on the 7th floor; and it requires some acrobatics and grace to take large pieces of luggage up the lift and then up a flight of stairs. This is a limited service hotel; so don't expect help with your bags. The front desk was friendly and met all our requests. The room itself is passable in size; but the bathroom is very tight. The bedding looked a little dated; but otherwise clean and comfortable. We requested a room facing the courtyard so it would be more quiet; and we did not hear much noise from the 7th floor courtyard room. In summary, the hotel did not meet our travel style as we prefer a nicer bed; and reasonably laid out bathroom. However, the price is great for a property that has easy access to the Paris metro.", "Date": "May 30, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Renfrewshire, Scotland", "Title": "“Great Hotel in ideal location.”", "Author": "bru382", "ReviewID": "UR64892045", "Content": "Nice clean Hotel, friendly staff and a great retro lift to the sixth floor. Our room was 707 on floor 7 whch was excellent. The hotel is no more than 20 steps from te nearest Metro station (Porte de Orleans) which is the end of Line 4 and goes straight into the center of Paris in under 10 mins. We enjoyed our stay at the Terminus and would reccomend to anyone.", "Date": "May 21, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Location": "3", "Rooms": "4"}, "AuthorLocation": "Melbourne, Australia", "Title": "“Decent hotel for the price”", "Author": "tangiwai", "ReviewID": "UR64740813", "Content": "We stayed at the Terminus Orleans for 2 nights. It's located a little further out but is right next to the metro and most sights are within 20-30 mins away. Rooms are small but about what you would expect from Paris. Bathroom was also small but modern and clean. Hot water was plentiful and instantaneous, but shower door wasn't fitted properly so easy to get the bathroom floor wet. We were allowed an early check in at 9am. Breakfast is expensive at €8, but there is a delicious crepe stand outside the front door and several decent bakeries around. There is also a supemarket close by. Overall would stay there again.", "Date": "May 19, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "3", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Perth WA", "Title": "“Great value for money -”", "Author": "Sydlisa", "ReviewID": "UR64713208", "Content": "After reading other reviews we thought we would try this hotel and we were very happy with our decision. Although a little way from the centre of Paris it was very easily assessable via the subway. The staff were extremely helpful and although small, the rooms were very well maintained. Breakfast was very average so we tended to eat at the local patisserie. We were forced to stay at a hotel very close by for our last night in Paris (through no fault of the hotel) and for the same price that hotel was not anywhere near as nice as the Terminus. High recommend for the price.", "Date": "May 19, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "2.0", "Value": "3", "Sleep Quality": "1", "Rooms": "2", "Location": "5"}, "AuthorLocation": "Budapest", "Title": "“Not as expected”", "Author": "floydcsaba", "ReviewID": "UR63915718", "Content": "Just returned from Paris, after had spent three nights in this hotel. I picked this hotel relying on the reviews of other customers. When we arrived we were given room 707, elevator till the 6th and stairs up to the 7th floor. This already made me suspicious, but thought we got that room because I requested a quiet room. It obviously was the room most seldom if ever used, probably thought, it will do for some Hungarians. The room was cold as ice, the radiator not working. We were offred the chance to change the room, not too happy to do that at midnight but had no choice. The heating there was OK. The most disappointing was that there was one big blanket for the two people and it had no overdress, which in my oppinion was un-hygienic and made us feel very uncomfortable. The bed was very unconfortable,too. The walls are very thin. The location of the hotel is the only positive ( and maybe the price ) feature that I could mention. I could not recommend this hotel without reservations.", "Date": "May 12, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Paignton, United Kingdom", "Title": "“Traditional Parisian hotel, tiny rooms but clean with helpful, welcoming staff”", "Author": "thegenealogist_1", "ReviewID": "UR61676039", "Content": "I stayed for five nights in a double room. The hotel is a traditional Paris hotel, narrow building, tiny rooms. I was on the 6th floor, there is a traditional lift with a wire mesh outer door and a concertina type pull-back inner door. A bit tricky if you were disabled but the staff would have helped. The staff were very friendly and helpful. My room on the 6th floor was double glazed and since it was at the back of the hotel it was very quiet, the window at the back looked out over courtyard and garden some way off. The shower room had been upgraded, modern fittings and tiles. I didn't try the breakfast, so can't comment on the food. The area seems very safe and transport connections are excellent for the centre of town. I would stay there again, especially if on a limited budget. It is very basic but perfectly adequate.", "Date": "April 16, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Oostende", "Title": "“excellent ratio price/ quality”", "Author": "Gosseries", "ReviewID": "UR61387065", "Content": "all + points: . clean, quiet, friendly, correct . breakfast ok . nearby: save, serious parking. . metrostation at 30 metres from entrance: will bring you in 15 minutes to Place de la Concorde . If you look for a very good, not to expensive restaurant nearby with very nice French dishes and an excellent service: go to \" Les Vendanges\" next to the adviced Parking. It's typical French and not a \" tourist trap\".", "Date": "April 15, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Cork, Ireland", "Title": "“Good value”", "Author": "Ulysses100", "ReviewID": "UR60979432", "Content": "We stayed here for 4 nights in April. Overall I would echo the comments which others have made here already. Metro station is very close and 20 - 30 minutes into town depending on your exact destination. It's at the end of the M4 line which is particularly handy if you are travelling to/from Gare du Nord. It's clean, with friendly staff, bathrooms are small but with a good shower; yes there can be noise from other rooms and the corridor but overall this isn't a problem. We had a room at the back which was nice and quiet but I can imagine that a room at the front could be a bit noisey, especially in the mornings. It's not an exceptional place, but it is good value and I would be happy to recommend it to anyone staying in Paris for a few days.", "Date": "April 11, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "4.0", "Value": "5", "Sleep Quality": "2", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Israel", "Title": "“Good value for money”", "Author": "Ikorenfe", "ReviewID": "UR59994026", "Content": "Pros - location , free internet , friendly staff , clean , not expensive. Cons - small room , noisy rooms (those facing the street) , no parking , expensive breakfast. Overall - good value for the money. The hotel is not near the city center but is easily accesible by a metro station next to the hotel (30 minutes to city center). The staff is great (special thanks to ARMANDO) , very friendly and cooperative. For dinning I recomend to take to Metro to St. Michael where you can find good and cheap restaurants. Definately will stay again.", "Date": "March 31, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Bristol", "Title": "“Would recommend and will return”", "Author": "juno1611", "ReviewID": "UR59915092", "Content": "Fantastic hotel and stay. Staff are friendly and helpful. Room was well equipped and clean with a modern and clean bathroom (however the bath is small - but the shower is nice and powerful). Great location with a secure car park near by for our car and a metro stop outside the hotel. Only negative points were the lift which was awkward with luggage (but at least there was one), and walls seemed rather thin (could hear other people in the corridor occasionally, but not a major issue at all). Would definitely recommend to a friend and use the hotel again.", "Date": "March 30, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Hot Springs, Arkansas", "Title": "“Great budget hotel near the Metro”", "Author": "primediver", "ReviewID": "UR57208137", "Content": "Excellent staff at front desk, 50' from Porte d'Orléans Metro, free Wi-Fi. Small but very clean room and bath. Will stay there again.", "Date": "February 26, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Warsaw", "Title": "“Very nice hotel!”", "Author": "Nika456", "ReviewID": "UR56461960", "Content": "Nice, clean, not very expensive. Friendly staff. Small room with tiny bathroom. Maybe a bit noisy when room windows on the front side. Free internet!", "Date": "February 19, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Atoka, Tennessee", "Title": "“Excellent Hotel, Great Location, Near Metro, Wonderful Staff!”", "Author": "Brandidale", "ReviewID": "UR53275688", "Content": "My husband and I booked this hotel solely on the reviews from TripAdvisor, and we were not disappointed. The hotel is literally seconds away from the entrance to the Metro and many restaurants. The front desk staff were so very nice and helpful with directions and taxi's for when leaving for our next destination in Europe, also chosen by TripAdvisor. We definitely recommend this hotel to anyone travelling to Paris! We would stay here again in a heartbeat!", "Date": "January 12, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Location": "4", "Rooms": "3"}, "AuthorLocation": "Calgary", "Title": "“Excellent value”", "Author": "ML25", "ReviewID": "UR51902288", "Content": "We booked this hotel due to the reviews on TripAdvisor and were not disappointed. Very clean rooms, friendly staff. Just steps away from the Metro, and you pass a great crepe stand on the way! The rooms are very small and basic, and there's no view, but we were prepared for all that, and we didn't spend that much time in it anyway. Oh yeah, and the smallest elevator we had ever seen, but that was definitely part of the appeal! This hotel represents excellent value for money, and if you're not looking for a fancy place, this is for you!", "Date": "December 26, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "4", "Rooms": "4"}, "AuthorLocation": "Durham, NC", "Title": "“absolutely perfect for the price”", "Author": "tooncesDurham_NC", "ReviewID": "UR50410644", "Content": "Kind and helpful staff (although it probably helped that my companion was fluent in French). Room was small but very clean and comfortable--perfect for two women traveling together. The room was not hot, which I feared it would be--in August with no A/C. Our room was on the back--no view but quiet; no street noise. Hotel has obviously recently undergone renovations--still working on that when we were there. Steps from the metro--a real plus. Restaurants all around and it seemed like a good neighborhood. We did not try the breakfast, which seemed overpriced. Shower had a tendency to flood the bathroom. Overall, though, you can't beat this hotel--we paid only 60 euros a night and felt like we'd hit the jackpot.", "Date": "December 1, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "3", "Overall": "4.0", "Value": "5", "Location": "3", "Rooms": "3"}, "AuthorLocation": "Oregon, USA", "Title": "“Great value, helpful staff”", "Author": "Bigbob65", "ReviewID": "UR47793827", "Content": "The Terminus Orleans was no surprise given the other reviews I read about this hotel. Given that we were only going to stay two days prior to our flight out of CDG we couldn't have asked for anything nicer. Very helpful staff, good value, and about 50 feet from the Porte d'Orleans Metro station. I'd definitely stay there again.", "Date": "October 26, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Location": "4", "Rooms": "3"}, "AuthorLocation": "Toronto", "Title": "“Free internet!”", "Author": "Exchangers", "ReviewID": "UR39775861", "Content": "After staying at many hotels in Europe where internet was very expensive it was nice to have free wireless internet. This hotel is very quaint but affordable for Paris. It is very close to the metro and there affordable places to eat nearby. The bathroom was a bit small but that's not uncommon for Europe in general. Great value!", "Date": "September 4, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Location": "4", "Rooms": "5"}, "AuthorLocation": "Singapore", "Title": "“Superb location to explore Paris”", "Author": "pol2vega", "ReviewID": "UR39288739", "Content": "We booked a room for a full week at this hotel due to other reviews on Tripadvisor. No regrets about it. After lugging our suitcase on the RER/Metro, I was so relieved to see this hotel just metres away from the subway entrance. Major attractions like Tour Eiffel and Montmartre are around 30 min away by Metro so navigation is a breeze. You can get delicious crepes just downstairs, real nice cakes from a patisserie on the left opposite the road and croissants/pain au chocolat from a boulangerie on the other side of the tram tracks. Dinner-wise, I can't say there's much good stuff around the area so do visit Quartier Latin/Montmartre if you want a decent meal. The room was to our expectations. We asked for a quiet one as previous reviews mentioned the noise in front so we got one facing the courtyard at the back. The toilet was really nice and clean. One big plus is that WiFi's free. Counter staff were nice n friendly. Oh and the lift was teeny weenie so if you're a big guy, only one of you can fit. It's probably best to just take the stairs to go down. The weather in June was around 20 degrees C so the lack of air con was not a problem for us. Price-wise, it's great value considering general rates of hotels in Paris.", "Date": "August 31, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "4", "Rooms": "3"}, "AuthorLocation": "Stoneham, MA", "Title": "“Comfortable room/bed, great shower, nice people, great location, good value”", "Author": "Mel_StonehamMA", "ReviewID": "UR35559377", "Content": "The recommendations for this hotel are all valid. It's basically good value for money. Its location by map doesn't look exciting, but it's right on a major metro line with a stop not 20 meters from the hotel entrance. Our double on the 5th floor was small, and faced the back - no view, but quiet. The bed was wonderfully firm - I suspect some kind of foam, because it was perfectly smooth. No air conditioning, but when the weather was easily 30 C outside, it wasn't stuffy. Extremely clean. Wireless internet was excellent and fast. And free. Great bakeries and little shops all around, including an small \"botega\" style market open very late, selling wine and even a bit of packaged cheese. Front desk clerk Tarik was very nice and helpful. His dinner recommendation was for a place we had eaten 5 years ago, Cafe Bebert, an Algerian restaurant right across the \"quad\" at Montparnesse, and it was even better than we remembered (\"Cous-Cous Bebert\" is a Middle Eastern gastro-orgy!) I would not pick this hotel if you consider hotel luxury an important part of your visit. If a pleasant, clean, safe, convenient place to sleep is all you want, book here.", "Date": "July 23, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Taipei", "Title": "“Great hotel”", "Author": "cherryche", "ReviewID": "UR32851909", "Content": "Probably the best budget hotel that I've stayed in Paris- although it's small, it's very nice and cozy, just few steps from Metro, 10minutes to St. Germain. I stayed there last weekend, and gonna stay another weekend there. Staffs are very nice and helpful, and they let me store my big luggage there. Would definitely go there again!!!", "Date": "June 22, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "3", "Rooms": "4"}, "AuthorLocation": "Verona", "Title": "“Clean & Friendly”", "Author": "Andrea1975Verona", "ReviewID": "UR30746879", "Content": "We will definitively go back there again. The Hotel is extremely clean and situated in good position 50 mt from the M4 station of Porte d'Orleans. The staff is always friendly, polite and willing to help.", "Date": "May 25, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Location": "5", "Rooms": "3"}, "AuthorLocation": "New Albany, Ohio", "Title": "“Great Hotel--Would Stay There Again.”", "Author": "rew111", "ReviewID": "UR27175453", "Content": "I stayed there for three nights in October 2008. The location is excellent--you are about 200 feet from the Metro entrance. The staff is very friendly and speaks English. On checkout day they let us store our bags in the locked breakfast area so we could sightsee some more without having to drag our luggage with us. The rooms were clean but very small--I wouldn't recommend it for a large family. The elevator is also small, and only runs to the 6th floor--so if you are above six you will have to walk up the stairs. We didn't eat breakfast (6E per person) in the hotel; instead we visited the bakery across the street or the crepes stand near the Metro entrance. If you are looking for a clean, comfortable place to sleep for a reasonable price and friendly staff, stay here!", "Date": "March 31, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Business service (e.g., internet access)": "4", "Check in / front desk": "5", "Overall": "4.0", "Value": "5", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Malta", "Title": "“Great Location, Great Hotel!”", "Author": "170", "ReviewID": "UR20473075", "Content": "Just got back from Paris where we stayed 13 nights in this little hotel which is at a great location since its so close to the metro! It is a bit away from the city centre but the metro is very efficient and fast! The hotel is also very clean and the staff at the reception are all so friendly! The only drawback is that we had to sleep with earplugs due to a lot of noises even though our room was not on the main street. A bonus is the guy selling crepes right in front of the hotel. Yummy :)", "Date": "September 29, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "3", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Hitachi", "Title": "“Very nice hotel as others say”", "Author": "Bossaholic", "ReviewID": "UR19589186", "Content": "This is a nice clean budget hotel. Only 1 min from the subway, but there’s no lift in the station. So if you have heavy luggage and enough time, take No.38 bus at Gare du Nord. It goes frequently and takes 30 – 60 mins. The hotel is 3 mins from the terminal. To visit main spots, I recommend to ride a Velib’- rental bicycle. 15 mins to the beautiful gardens of the Luxembourg.", "Date": "August 31, 2008"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "San Bruno, California", "Title": "“Great hotel for the price”", "Author": "Wellvis", "ReviewID": "UR17622808", "Content": "I chose this hotel based on the previous reviews on Tripadvisor.com and was not disappointed. As with other French hotels, the room was small, very clean and very comfortable. The excellent location was a big bonus. When you step out of the Porte D'Orléans metro station, you see the hotel. The lobby is tiny, and the elevator is one of the smallest I've ever experienced. it's rated for three people, but the two of us felt claustrophobic in it. We were on the fourth floor (fifth floor for Americans) and walked up the winding staircase many times rather than wait for the elevator. We had a room with twin beds facing the street. It was very basic, with a writing desk, cabinet for clothing, bathroom with shower, and two beds. A smallish television rests on top of the cabinet. Six or seven channels, the only English one being CNN. But you're not in Paris for the television, right? We purchased a Carte Orange, which gave us a week travelling throughout Paris on the Metro and buses. The Porte D'Orléans is a major transit hub, so expect lots of traffic, but you also can get anywhere in Paris in a relatively short time. Due to the heat, street noise was pretty obvious (we left our windows open). If night time noise bothers you, bring earplugs. One night the Paris bicycle rally went by our window. That was pretty exciting. The staff was extremely helpful and courteous. I'd recommend this place as long as you don't have any problems with a tiny elevator (or problems walking up stairs).", "Date": "July 7, 2008"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Business service (e.g., internet access)": "3", "Check in / front desk": "4", "Overall": "4.0", "Value": "4", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Edinburgh, Scotland", "Title": "“A Great Base for Exploring at a Budget Price”", "Author": "Tammer1969", "ReviewID": "UR16044493", "Content": "I've just spent 5 nights in this hotel with my girlfriend. Keeping it simple, I'd say that the positives were: English speaking, friendly staff. Convenient location (metro just outside). Safe neighbourhood - we wandered around late at night with no problems. Great value for money. Clean, comfortable room. The only negative was that the room is a little small. As such, the bathroom was small too, but two of us fitted in the shower with no complaints so it can't have been that bad :D. All in all, I'm perfectly happy with this hotel choice.", "Date": "May 14, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "3", "Business service (e.g., internet access)": "4", "Check in / front desk": "5", "Overall": "3.0", "Rooms": "2", "Location": "4"}, "AuthorLocation": "Bangalore", "Title": "“Not bad but beware bathroom really tiny”", "Author": "karthik73", "ReviewID": "UR15560437", "Content": "We stayed in the hotel for 3 nights in the last week of April, I booked the room based on the positive trip advisor reviews. The positive things about the hotel is the Location- well connected to rest of Paris via the Metro line 4, The front desk Staff- English speaking, friendly and very helpful, and the price- 75 Euros for a double room for a hotel with a Lift in Paris. The negatives are the tiny toilet in the room I stayed in, the room was small but the toilet is uncomfortably tiny and the room had just one electric point for charging all my electronic gizmos.", "Date": "May 2, 2008"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Business service (e.g., internet access)": "4", "Check in / front desk": "5", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Edinburgh", "Title": "“Good Budget Hotel”", "Author": "kdsud", "ReviewID": "UR14749257", "Content": "Paris is getting expensive! I was looking for accommodation for a long weekend and after checking out the hotel I stayed in a few years ago (the excellent Hotel Des Grandes Ecoles in the Latin Quarter), I realised I would have to think again if my plans for a \"budget\" break were to be realised. I chose Hotel Terminus based on favourable reviews on the Trip Advisor website. It is farther out from the City Centre than I hoped but a saving of 60 Euros a night was not to be sniffed at. The Hotel is at the end of Metro line 4 with the station only 50m from the hotel entrance. This makes it an easy trip from CDG airport with only one change from the RER to the Metro at Denfert Rochereau, three stops from the hotel. The hotel is less than 15 minutes to the City Centre on the same line and Tram line 3 stops directly outside the hotel making a visit to Versailles an easy option. The hotel itself is basic, comprising a reception, small breakfasting area and six floors of rooms. There is a small, typically Parisien lift. Our room was small but adequate and was well furnished with a small but well appointed en-suite. The bed was on the small side, being no more than a standard double but sheets and towels were changed every day and everything was very clean. Our room faced the rear and looked out onto nothing in particular but as a result it was probably quieter than those facing onto the busy street. Breakfast in the hotel was an adsditional 6 euros per person and could be described as \"typically Parisien\" or \"adequate\" i.e croissant, roll, juice and tea, coffee or chocolate. One advantage of staying out with the immediate City Centre was the lower cost of dining out. there are plenty of restaurants in the vicinity of the hotel, all of them less expensive on a like for like basis than City Centre establishments. All in all the hotel provided comfortable accommodation at a reasonable cost and the distance from the City Centre was offset by the excellent transportation links and lower cost of eating out. I would certainly consider using it again.", "Date": "April 2, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Business service (e.g., internet access)": "3", "Check in / front desk": "4", "Overall": "4.0", "Value": "4", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Glasgow, Scotland", "Title": "“Small, Friendly, Clean, Good Value”", "Author": "mrsmith-underwear", "ReviewID": "UR13132739", "Content": "Our stay (3 day / 2 night business trip) at the Terminus Orleans was in a very small room with a tiny bathroom, but the place was friendly, clean and good value for the relatively low cost. Room was at the back, so minimal noise from the busy street, but it was on the first floor and right next to the stairs & cleaner's cupboard, so there was a fair bit of disturbance from those sources. Would recommend asking for a room on a higher floor (or away from the stairs) if the climb (or the miniscule lift!) don't bother you. Ideally placed for the Paris Exhibition centre at the Porte de Versailles (only 8 minutes on the excellent new tram line, from a stop right outside the hotel). Also really not too bad for the city, with a Metro (line 4) station entrance even closer to the door, and a trip of 30 mins or less depending on destination. If coming from CDG, take RER B and change to Metro Line 4 at Denfert Rochereau. Very easy. We had good weather for January, so on a spare afternoon took the tram to its western terminus at Pont du Garigliano and walked along the banks of the Seine to the Eiffel Tower, very pleasant and more to see than in the Metro. Didn't take the breakfast on offer, but the 5 euro price doesn't seem excessive. There are plenty of bakeries / patisseries nearby offering a 'sit at the counter' type 'petit dejeuner' for about the same, and a couple of reasonable Brasseries very nearby. Overall a good experience, excepting the slightly noisy room location, and we would return to the Terminus Orleans. Alisdair & Gillian from Glasgow, Scotland", "Date": "January 30, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "4", "Check in / front desk": "5", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Tegucigalpa", "Title": "“Good Value!!”", "Author": "RaCoLo", "ReviewID": "UR12696232", "Content": "Great hotel at the end of one of the metro stations. Friendly and helpful front desk staff. Hotel had great location to access by metro in 15 mins all major sites. Beware the bathroom is small and have no A/C, but it is clean, you have TV. In walking distance you can find nice restaurants and delicious pastries ECLAIRS!!!! All around great value for your money!!", "Date": "January 16, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Business service (e.g., internet access)": "4", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Dublin, Ireland", "Title": "“Excellent value - clean and safe”", "Author": "newgrange", "ReviewID": "UR11410904", "Content": "Have just returned from a two-night stay in this hotel. I had read the other positive reviews on Trip Advisor and was not disappointed. Yes, it's small, yes the rooms are a little small but it is very good value. It's about ten steps from a Metro entrance, has a tram stop directly outside, it is surrounded by a number of restaurants, bars and convenience stores. There's a lovely bakery and fresh fruit shop across the street - the hotel itself is clean, safe and has attentive staff. I would definitely return there.", "Date": "December 9, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Brandon, Manitoba", "Title": "“Great value; excellent location.”", "Author": "Bryan G", "ReviewID": "UR10169371", "Content": "Great value and excellent location sum up some of my feelings about this hotel. I spent a week there, and found it to be the best of a series of hotels (none of which were bad) of four weeks travelling from city to city. It was the least expensive place I stayed, but the best accomodation of the lot. The free WiFi was icing on the cake for me. I enjoy the Montparnesse district as a location whenever I'm in Paris, and this was close enough for me to access the Left Bank attractions in general by foot. Metro access as well as train are very convenient (the train is handy from the CDG airport, with stations within a reasonable walk, or easily connecting to the Metro if you don't want to do any walking). The staff were very helpful any time I had a difficulty or question,(and tolerated my fractured French) they all spoke far better English than I do French. A definite recommend, I'll stay there again.", "Date": "October 20, 2007"}], "HotelInfo": {"Name": "Terminus Orleans", "HotelURL": "/ShowUserReviews-g187147-d529697-Reviews-Terminus_Orleans-Paris_Ile_de_France.html", "Price": "$87 - $147*", "Address": "<address> <span rel=\"v:address\"> <span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">197 Boulevard Brune</span>, <span class=\"locality\"><span property=\"v:postal-code\">75014</span> <span property=\"v:locality\">Paris</span></span>, <span class=\"country-name\" property=\"v:country-name\">France</span> </span> </span> </address>", "HotelID": "2515269", "ImgURL": "http://media-cdn.tripadvisor.com/media/photo-s/01/6e/5a/dc/avec-le-tram-devant-l.jpg"}}