{"Reviews": [{"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Zurich, Switzerland", "Title": "“Hip & fresh Boutique Hotel”", "Author": "ZrhWorldtraveller", "ReviewID": "UR127870088", "Content": "The Tower23 is definitely a hip & fresher approach to boutique hotel style, than most other properties in the area. The rooms are very nice, despite that the bathroom looked a bit in need of maintenance.. that should not be the case for the rate they charge. The bar / restaurant area is very popular and the service, drinks and food are nice. Recommendable Bloody Mary for breakfast.", "Date": "April 14, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Arvada", "Title": "“Spring Break with my kids!”", "Author": "SfromColoradoArvada", "ReviewID": "UR127641526", "Content": "Our very first trip to San Diego and we had a great time!!! San Diego was amazing and staying at this hotel made it even better! The staff was great! They were very attentive and friendly. I would book this hotel for an adult only trip as I felt the non-locking, semi see through bathroom doors were a bit challenging. The location was awesome...the beach was right by the hotel! The second floor with the fire pit was great and had an amazing view but don't expect some of the guests to care if u were with small children as they don't seem to care about adult language in front of them! I would definietly go back without my 7 year old. This was an awesome hotel!", "Date": "April 11, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Georgetown", "Title": "“Excellent stay, we'll recommend it”", "Author": "Alexandre_TF", "ReviewID": "UR127567552", "Content": "We very much enjoyed the hotel: nice design, good rooms, very good customer service, great bar very entertaining and good food. My only disappointment was that the oysters were not very tasty (although very fresh), all the rest was very good and people was very helpful and educated. Going to the Tower 23 is the guarantee to have a high level service in a design hotel, and enjoy an authentic local atmosphere at the bar and restaurant at a very decent price.", "Date": "April 9, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Virginia Beach, Virginia", "Title": "“Nice Hotel”", "Author": "erchla", "ReviewID": "UR127563789", "Content": "We were very pleased with our stay here. Nice, clean rooms and bathroom. Very spacious. Great location - we did a lot of time in La Jolla while staying here. Only complaint we had was the lack of a coffee maker in the room. Not a big deal, but it would have been nice.", "Date": "April 9, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "london", "Title": "“Beachside fun”", "Author": "Londonluxetraveller", "ReviewID": "UR127490095", "Content": "Stayed at Tower23 over Easter break. The hotel is ideally located on a beautiful sandy beach and situated between La Jolla and San Diego. We opted for a 3rd floor room with partial sea view. Rooms are very spacious and clean. There is a busy beach front restaurant/bar and the hotel is in walking distance of all the local bars/restaurants. This is a young, fun resort and reminded me of Venice Beach, Ca. The front desk staff (Saray Jimenez and her team) are helpful and obliging. Recommended.", "Date": "April 8, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Los Angeles", "Title": "“Sexy-cool Place in Funky Pacific Beach”", "Author": "RonK_LA", "ReviewID": "UR126782160", "Content": "Tower23 opened around six years ago about 10 miles north of San Diego. It's located in Pacific Beach and either you will love the its edgy-funkiness (like Venice, California 20 years ago) or you will wonder what a sexy-cool hotel is doing in a neighborhood like this. If you have a large sense of entitlement, and seeing some grit and edge will just ruin your martini or G and T, do yourself a favor and stay in La Jolla just up the road. In PB, you are far more likely to score a tattoo than a designer boutique. That said, the hotel is a modern minimalist gem. All glass and white walls. A video loop of surfers plays endlessly on a small monitor the unpretentious lobby. The action here is in the Bar/Restaurant JRDN (pronounced a little surprisingly \"Jordan\", not \"jardin.\") Serving mostly very good food and a lively scene, it's particularly packed on weekends when the weather is good. The other great space is the Tower Deck on the second floor where white-towel covered lounge chairs surround something resembling a wading pool. I think it's six inches deep and I have never seen anyone so much as put their foot in there, so, hey, maybe it's just a water element or something. Nomenclature aside, it's a great place for a hang or a tan or to watch the joggers, surfers, runners and homeless people walk, run, or waddle by. The rooms are clean and uber-minimalist, almost sterile if it were not for the drop-dead views. I recently stayed in a Sanctuary Suite and loved the extra space and the jacuzzi tub looking out over the crashing waves of the Pacific. The bathroom also sports a small sink, a stand-alone shower and small slightly depressing room with a toilet. I am hoping it's fluorescent lighting is a green gesture and not a design choice. Yikes. Most if not all of the rooms have terraces on which you can see and/or hear the crashing of the Pacific. With \"art\" like that, who needs art in the rooms? This is not a place you come for white glove service, but the staff is young, attractive and happy to be helping you in any way they can. They try really hard, but sometimes you can really feel them trying and the strain shows. Bottom Line: This property is my first choice when I come to San Diego for any reason, business or pleasure. It's perfect for a romantic weekend, or whenever you want to get-away from it all. A recent four-day stay undid months of work/life stress. And if it worked for me, it might just work for you. Give it a try, I don't think you will regret it.", "Date": "March 27, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "cday1", "Title": "“Great deal, right on the beach!!!”", "Author": "cday1", "ReviewID": "UR126738796", "Content": "We stayed here in Feb 2012 off a deal we got on Bloomspot. The room was very nice and clean and we had a view of the ocean. It's in walking distance to many restaurants and the boardwalk. We sat on the deck on watched a beautiful sunset while having coctails, but never had a chance to eat at the restaurant. I hear it's really good! We would definitely stay here again. It's a very nice boutique hotel! The only reason I do not give it 5 stars is because of the price of parking, but that's a given pretty much in San Diego.", "Date": "March 27, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Kailua-Kona, Hawaii", "Title": "“FANTASTIC PLACE TO STAY”", "Author": "onabeachinkona", "ReviewID": "UR126653419", "Content": "Stayed at the Tower last October and coming up on a stay in April. The Surf Pad has an amazing view. The staff will bend over backwards for you. The food is excellant. The location is stunning. This is THE place to take someone special and forget about work, traffic and the hectic life you lead. Just enjoy a drink watching the sun drop beyond the horizon with the pier in view, people watch as they drift by on the sidewalk. A truly amazing package.", "Date": "March 25, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Oklahoma City", "Title": "“Beautiful Property”", "Author": "Janice M", "ReviewID": "UR126215253", "Content": "Tower23 exceeded my expectations. Situated literally right on the Pacific Ocean (with only the boardwalk separating it from the sandy shores!), it has incomparable views. We were there for a special occasion and the staff was so kind and helpful in situating the rooms, accommodating early and late check outs and answering lots of questions (as well as me exploding seltzer water in the car and holding up about 5 cars trying to valet but that's a story for another review) We got two of the balcony suites facing the ocean. The extra money is well worth it as the view is in a word: extraordinary. The rooms were also new, very clean and bright -- and the bed could give The Westin's \"Heavenly\" mattress a run for its money! We got room service and ate on the deck overlooking the ocean a few times. They also have a hoppin bar and restaurant downstairs. The food was awesome Definitely get the fresh mango margarita with chili salt. It's served in a goblet. Swoon! I also loved the LBLT -- lobster, bacon and lettuce. We also thought it was super affordable for a hotel -- I believe room service was only $10/dish. Finally, upon checking out the receptionist let me know that future visits are always 20% off for returning guests -- forever and no blackouts!", "Date": "March 17, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "New York", "Title": "“Great family vacation”", "Author": "JL5", "ReviewID": "UR125990298", "Content": "We stayed at tower 23 for 5 nights in march with two very young children (ages 2 and 9 months). Our stay was fantastic. I was concerned that it may not be a kid friendly hotel but I could not have been more wrong. The kids loved the tower deck and being able to walk right out to the boardwalk and beach. The staff was very friendly, helpful and great with the kids. The roms were very clean and comfortable. We ate at the hotel restaurant one night which was excellent. Overall we had a great stay with the family and will be back. My only complaint is that we asked for a good Mexican restaurant recommendation. Jeremiah at the front desk recommended Cafe Coyote. It was awful! Do not go to this restaurant. The food tasted more like fast food then good Mexican. Tower 23 should not be recommending this restaurant to guests. The old town area in general was very tourist...I would not recommend spending time there.", "Date": "March 12, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Chicago, Illinois", "Title": "“Great Experience!”", "Author": "JayTee80", "ReviewID": "UR125615890", "Content": "We went here for our 1st wedding anniversary and man, I think I screwed up. I have no idea how I'm going to top this one. I booked this through this great deal on Luxury Link that included breakfast for 4 days, dinner for 2 one night, 2 cocktails and a bottle of champagne. Everyone was great...from valet to room service to the front staff. Upon arrival... Omar greeted us and said he was upgrading our already great room to the sweet suite...and sweet it was! Two huge rooms, 2 bathrooms, 2 balconies with ocean views. The bed was amazing the dinner at the restaurant was one of the best fine dining experiences ever. Location was close to everything. I could go on and on about this hotel...but you get the picture.", "Date": "March 4, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "", "Title": "“Great location with amazing views and the best service!”", "Author": "Nokush", "ReviewID": "UR125074156", "Content": "Stayed with my kids for three nights. Loved the hotel... The service is amazing...the staff is all about helping! The sunsets are Amazing. The beds are super comfortable and the rooms are spotless.", "Date": "February 23, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "San Diego, CA", "Title": "“Fantastic wedding night hotel!”", "Author": "tkingsbury", "ReviewID": "UR124912874", "Content": "We live in San Diego and picked this place do to its location and ocean views and got a fantastic deal. Everything was perfect: they were flexible with check in and check out, gave us complimentary chocolate dipped strawberries and champagne, and had a perfect room with an ocean view. Would recommend to anyone, its in a great location to go out and the best breakfast in San Diego is next door!", "Date": "February 20, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "NY", "Title": "“Stunning Location”", "Author": "jsoxy", "ReviewID": "UR124350577", "Content": "We spent 4 nights at Tower 23 in January 2012. The location is spectacular....the sunsets are so beautiful. We had a surf pad with a great view. The beds are extremely comfortable, and there are several different pillows to choose from. The staff was very helpful, and the maid service timely and thorough. The bar and restaurant were busy the night we went down there, and the service was horrible, so we didn't stay to eat dinner.", "Date": "February 9, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Austin, Texas", "Title": "“Excellent Ocean Hotel”", "Author": "RTG_12", "ReviewID": "UR124070256", "Content": "We stayed at T23 for a week in early January and it was a great experience. A room overlooking the ocean with balcony couldn't be beat. The first room had an annoying electrical hum and they cheerfully moved us the next day to another room. Overall excellent service and great hotel.", "Date": "February 3, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Singapore, Singapore", "Title": "“T23 = One of our favorite hotels in the WORLD”", "Author": "DallasFlysolofemme", "ReviewID": "UR123997883", "Content": "We stayed at Tower 23 for over a week in November 2010 (I had to check March 2011 because I waited too long to write this review). This hotel is so cool, a famous indie rock band stayed in our same room the same week. Location: RIGHT ON THE BEACH. The sunsets were out of this world. We were addicted to the sunsets from our room at T23...we raced to the hotel to see them. JRDN: This restaurant is truly gourmet--and at a hotel. We shared 4 dinners at JRDN over the course of the week. We knew our waiters by name. The food was OUTSTANDING. Best oysters I've ever had--we compare all other oysters to the ones we had at JRDN. Room service: Room service was interesting because it wasn't just a room service delivery--it was like the restaurant came to you. We had loads of delicious breakfast foods included in our room rate. Every bit was executed with perfection. They were prompt and we loved our server, Meredith. And Josh--well, there were 2 Josh's. All were so much fun. Room: The products--OMG, the products!!! I can still smell them when I think back to Tower 23. The balmy lotion was my favorite. Seriously awesome products. The mini bar was well stocked, there were loads of snacks, and even souvenirs you could buy from the room. The robes were a good weight and we wore them a lot. The bed was enormous with tons of fluffy pillows. Chaise lounge was handy and comfortable. We loved our balcony, too. Nice sized closet and great TV. Service: I've mentioned the service was perfection. We were on first name basis with so many of our servers by the end of the trip. Do yourself a favor--stay at Tower 23. The vibe is unique and this place will make your trip to San Diego. It's worth going to San Diego JUST to stay at this hotel. Enchanting location for couples.", "Date": "February 2, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "", "Title": "“Loved it!”", "Author": "Paypay14", "ReviewID": "UR123861457", "Content": "Never had been to San Diego before, this is the place to be. Right on the beach over looks a huge pier, Surfing, walk way. My cousin had her wedding here it was beautiful, the food was awesome! And the people was very nice. It has outside dining and a nice bar area. I'll be back!", "Date": "January 30, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Scottsdale, Arizona", "Title": "“Look no further, this is the place you're looking for.”", "Author": "Seth M", "ReviewID": "UR123747014", "Content": "Always wanted to stay here, and now I know why. I've been to SD/PB dozens of times, this was the best, period. Let's start with the staff, very accommodating and helpful in every way(Jerimiah especially). Made sure we were happy with our room, which was full ocean view(I highly recommend this). The views are amazing. We woke up one morning to see dolphins playing about 250 ft out from the shore, my wife was in total disbelief. The Tempurpedic bed assured us 8-10 hrs of rest every night, unreal. Rooms are good size, well executed in style, and you will get too comfortable, we didn't want to leave. We are very critical of the places we stay and have found nothing to have any issue with here. The Tower23 is now the only place we will be staying for now on. We came home feeling relaxed and refreshed, isn't that what a vacation should do? Do yourself a favor, stay here, you will not be sorry. To the Tower23, thanks, we needed that.", "Date": "January 28, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Los Angeles, California", "Title": "“Beautiful boutique hotel + great service”", "Author": "LAdesigner101", "ReviewID": "UR123564122", "Content": "I booked this hotel through a Jetsetter Promotion for my friend's birthday. We stayed one night and wish we could have stayed longer. The rooms are exceptionally nice, with nice touches like plush robes, H2O plus bath goodies and tempurpedic queen/king beds. As a special treat, the hotel left gourmet chocolates for my friend's birthday! We got a nice third floor room, but due to the great design of the hotel, all of the rooms we saw looked nice. The restaurant downstairs is a bit pricy, but great for drinks! What a lucky find!", "Date": "January 24, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "5.0", "Value": "3", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Forest Hills, New York", "Title": "“Best Hotel in PB - Hands Down (Must Get 'Surf Pad' To Fully Enjoy)”", "Author": "katensteve", "ReviewID": "UR123131114", "Content": "I lived in PB for many years before moving away and was looking for a nice hotel in the area when my husband and I came back for a friend's wedding. Tower 23 is hands down the best hotel in the area - it is luxurious, extremely modern and literally looks out onto the beach with stunning views of the water and sunset everyday. That being said - you HAVE to get yourself a Surf Pad to fully enjoy the views. The other rooms look out onto a court yard which is nice - but by no means has the amazing views that the hotel offers with their Surf Pads. I was worried that it would be very noisy in the room due to this being one of the trendier spots in town (downstairs bar/eatery), but we never had a problem with noise. The rooms are a good size, so are the bathrooms. Tower 23 is also near a TON of things in PB if you're looking to explore the area - from bike rental, to literally steps from the beach, to stores, food and bars all within walking distance. I will say that the valet was slow - so either look for street parking (it exists) or call down for your car every time.", "Date": "January 15, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "New York City, New York", "Title": "“True Gem!”", "Author": "clutchbomb", "ReviewID": "UR122484021", "Content": "I was pleasantly surprised by how GREAT this hotel was! When you think of P.B. you think great beaches, frats everywhere and cheap hotels. I could not have been more wrong about Tower23! I attended a wedding and fell in love with the property and location. - Location: Ideal, right on the beach and next to the path that takes you straight down through all the shopping/restaurants - Rooms: Bright, white, clean, modern. - Bar: Right in front of the ocean; great drinks and appetizers - Communal courtyard on 2nd level: Gorgeous views, quiet, great place to suntan. My room opened right up onto the courtyard- some guests may not like this option, but I did. We had a large wedding block, so it was really nice to have everyone so close (think Melrose Place). - Staff: Service was excellent from both front desk staff and valet", "Date": "January 3, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Omaha, Nebraska", "Title": "“Jeremiah went above and beyond!”", "Author": "Kristen G", "ReviewID": "UR122416463", "Content": "We went here over NYE weekend, and we had such a wonderful experience! The front desk supervisor, Jeremiah, was awesome. You could tell he really cares about the customers' needs. I would recommend this hotel to all of my friends and I am definitely going to stay here anytime I'm in San Diego!", "Date": "January 2, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "2.0", "Value": "1", "Location": "5", "Rooms": "2"}, "AuthorLocation": "", "Title": "“Beautiful ocean view but that's about it...EXTREMELY overpriced”", "Author": "Missdaisybear", "ReviewID": "UR122359892", "Content": "My husband and I booked this hotel for NYE and my birthday. The hotel labels itself as a four star luxury lifestyle hotel and I will assure you it is not. The food, the view, and one friendly staff member were the only positives. We arrived wearing sweatpants after traveling all day to be greeted by a valet asking \" are you here for dinner?\". I believe it was more than obvious we were there to stay. True, my husband and I are young ( 25 and 26) but i think it was assumed we were just local young party people rather than guest paying 1100+ for a 3 night stay. We then arrived to our room. Absolutely wonderful view however furniture appears very Ikea like and the shower ran water all over the floor. Bed was very comfortable however and room was kept very clean. We did receive one bottle of Champagne complimentary for our anniversary and a second was sent Up by family with roses for my birthday which was very nice. However, after receiving these 2 bottles of Champagne and a 3rd to the room for NYE, we were carded by 3 different people before being allowed to be seated at our dinner reservation! The same people that had checked Us in and sent up champagne made my husband walk back up to our room to get my ID, then issued us a wristband. Even with the wristband now in place , a bouncer then came to ask us again for identification. Finally , the hostess seating us asked if we had our wristbands and if we were of age. I understand there are rules/ laws However there is a point where it is just rude. Finally, we were in and out of the hotel multiple times over our stay and other than check im and check out never received so much as a \"hello\" from the front desk staff standing right beside the elevator. From other experience, I would say friendly and respectful greeting and treatment of guests is something that helps to make a place a \"luxury lifestyle\" hotel. If you are young and looking for a truly luxurious stay and not o be treated like a local partier, this is not for you. Will most definitely opt For La Jolla or Coronado for our next visit to the area.", "Date": "January 1, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Franklin, Tennessee", "Title": "“Great Ocean View and Convenient!”", "Author": "MonBon7", "ReviewID": "UR120647322", "Content": "If you're looking to stay at a hotel with a wonderful Pacific Beach ocean view in San Diego, CA, Tower23 is the place to be! The hotel and rooms have a very contemporary flair. The full bar looks out onto the beach as you catch the beautiful sunset (don't forget to catch one of their delicious Chili Mango Margaritas). The romantic terrace off the 2nd floor boasts comfortable lounging, soft overhead twinkle lighting, a waterfall and cozy fire pit. In the evenings, there is staff to wait on you. Tower23's location is very convenient to local shops, bars, restaurants, etc. all within walking distance. There is parking in the garage (for a fee of $20 per night) for your convenience. I didn't give 5 stars for the following reasons: The hotel seems to cater to a younger crowd (20's to mid 30's) but not really family friendly. The air-conditioner must be goverened during the night, as it does not cool as much (and we like it cold when sleeping). There is no coffee pot in the room. The extra chaise lounge, although it looks good and fits with the modern decor has to be one of the most uncomfortable chairs I've ever sat in. The bathroom has very little counter space (enough for a man's hygeine products but hardly enough for a woman).", "Date": "November 15, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "3", "Overall": "2.0", "Value": "1", "Sleep Quality": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Dublin, Ireland", "Title": "“Very overpriced ordinary hotel. bad service.”", "Author": "twinkle170", "ReviewID": "UR119716950", "Content": "I wonder are friends writing reviews about the place as it certainly seems like a different hotel to the one we stayed in. My fiance and I stayed here for three nights from the 18th to the 20th of October 2011. When we arrived we were greated on one man at the front desk, No one took our bags to our room. I wouldnt expect this if there was not steps up to your room once you leave the lift. The room was of minimal design, bigger than ave size hotel and clean but nothing special, bed, chair, desk and tv, what you would expect anywhere. letters missing from the name on the hotel, shower gels not replenished. room cleaning was a bit hit and miss. you had to ring the 'schedule' and turn down service. who would bother doing this? if you are going to offer a service then just do it!? However my major complaint was the 24/7 room service they so call offer. On the second night we rang at 11.30pm to order and sandwich, we were told ham or cheese. my fiance asked could he have ham and salad and he was told no, they are premade. $12 for a premade sandwich is crazy so asked what else did they have, we were told cheese and crackers or a caeser salad.... I dont think this equates to 24/7 room service. Anyway we were hungry so we ordered two portions of cheese and crackers, the porter then asked did we want it delivered....is that not the point of room service? the tray was delivered by the security guard and we paid $24. I have attached a picture of what we received.... I have never returned any food in my life but I refused to except this, brought the tray back down to reception and received a full refund. At $860 for the three nights, this hotel is certainly overpriced for what it is, it is a BOG standard hotel with high prices. please be aware that they also $100 per night for 'incidentials, this is put back to your card afterwards but i think its is totally unnessisary, it is tower23 not Trump towers... Verdict: shop around or be screwed.", "Date": "October 25, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "San Diego, California, United States", "Title": "“The peferfect hotel for our perfect beach wedding”", "Author": "Chris L", "ReviewID": "UR119678507", "Content": "From top to bottom we could not have had a better experience having our wedding at Tower23. Every single person who was there was blown away by the beautiful setting, the great service and the amazing food. All of our out of town guests stayed at the hotel (44 rooms) so we pretty much had the run of the entire hotel on Saturday. Everyone loved their rooms, I think every one has at least a partial ocean view. The courtyard/ sunset deck area was perfect for the wedding, but was also great for family and friend to congregate over the course of the weekend. It will be a day we will remember for the rest of our lives and I cannot thank them enough for going out of the way to make it so special.", "Date": "October 24, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Bakersfield, California, United States", "Title": "“The place to be!”", "Author": "Nick S", "ReviewID": "UR119594556", "Content": "Stayed at Tower23 for a few days while working down in that area, everything was amazing. The staff was great, the food and drinks were amazing and the view from your room is stunning. If you're looking for something upscale, this is the place to be.", "Date": "October 22, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Albuquerque", "Title": "“Most awesome hotel EVER”", "Author": "Leigh ann H", "ReviewID": "UR119567753", "Content": "My husband and I were blessed to have stayed at Tower23 for our honeymoon for 7 days! The staff is amazing...always polite and extremely helpful!! I have never stayed in a place with such excellent service! The staff at Tower23 was sooo amazing that they truly made us feel that we were their only guests! Tower23 also has great food and breathtaking views of the ocean! My husband and I are planning to re-visit on our one year anniversary!!!", "Date": "October 21, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Kansas City MO", "Title": "“Fabulous beach hotel”", "Author": "LifeIsGood825", "ReviewID": "UR119500838", "Content": "Tower23 is probably the coolest hotel I have ever stayed at! Perfect location, beautiful setting, modern design, clean rooms and public areas. Fabulous common area on the second floor. My three girlfriends and I had a fantastic time and we all loved the hotel. The wave wall is intoxicating. The staff is extremely nice and helpful - everything was great.", "Date": "October 19, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Knesselare, Belgium", "Title": "“Excellent beachfront hotel with luxurious surf-attitude!”", "Author": "DavyVermeire", "ReviewID": "UR119349759", "Content": "Super 'spiffy'! Tower23 has a cool vibe and great restaurant! Stayed here for 3 nights and had a great time. Location is very good (on the beach) , only 15mins drive from downtown San Diego and near all major 'thing-to-do'. The room was very clean, big and spacious, very good and large bathroom,... Staff helpful and friendly. Quick valid parking, good roomservice, and nice design... no negative points on this hotel, only very positive points and even better memories. You have to try the restaurant: delicious! Tower 23 is my favourite hotel and restaurant in San Diego! Will come back because of the design, surf-vibe, friendly staff, restaurant, location and easy-going atmosphere. An excellent beachfront hotel with a luxurious surf-attitude in one of the coolest cities in the world!", "Date": "October 16, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Toronto", "Title": "“Wonderful Pacific Beach Hotel”", "Author": "mljc68", "ReviewID": "UR119339928", "Content": "We absolutely loved Tower 23. Great location, right on the beach, EXCELLENT restaurant. We had booked our 4 night stay through luxurylink.com and it included breakfast every morning and one dinner. When we got there, they gave us nice personalized vouchers detailing exactly what was included in our deal. The hotel restaurant/lounge was awesome; rather than go elsewhere, we would have drinks, snacks and lunch there because the food (and service) was amazing. The room itself was pretty bare, white walls and minimal decor but was very spacious with a great bathroom (separate shower and tub). The hotel was quiet when we were there altough the upstairs patio area does get busy in the afternoon (with lots of people \"reserving\" chairs by leaving their stuff there for hours!). I’m glad we stayed here rather than downtown… Pacific Beach is a very interesting area with lots of great shopping, restaurants, boardwalk, etc. We're hoping to return to Tower 23 because I can’t think of a single thing that would have made our stay more enjoyable.", "Date": "October 15, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Calgary AB", "Title": "“Our new home away from home”", "Author": "KarlPCalgaryAB", "ReviewID": "UR119205374", "Content": "My wife and I would never have even known about this hotel had it not been for a hotel mishap in Seattle. Long story short - she has a form of neuropathy that makes it impossible to sleep on a bad mattress. Trying to find a better hotel bed in Seattle eventually led to the discovery of a list of hotels in the US that offer Tempurpedic memory foam mattresses. This list led to our discovery of Tower 23 in Pacific Beach, or 'PB' as it's known by the locals. Our first visit to this little boutique hotel was in February 2011. It was a short visit, but the impression it left on us convinced us to come back for another, longer visit in September 2011. Let me state right up front, this hotel is not for everyone. It doesn't have a pool - this will turn some people off right away. We didn't care. We didn't come to San Diego to swim in a hotel pool. I've read other reviews on this hotel and noticed a few complaints about the homeless folks who pass by on the beachfront walkway. Pacific Beach has homeless people. You just can't get around that fact. We didn't find it intrusive or offensive in any way. They did not camp out near our hotel. On to what we liked. The bed, of course. If only every hotel had quality, memory foam mattresses, our trip planning would be so much easier and offer so many other choices. A definite win for Tower 23. The restaurant (JRDN) is great. Depending on the time of year, you can get breakfast there, but lunch and dinner are year-round and of high quality. One thing to be aware of when booking a room is that about half of the beach-facing rooms are directly over the restaurant / bar area. The restaurant has an outdoor patio as well and this place can get noisy when it's crowded. Weekend nights are worst. From our room on the third floor at the south end of the hotel, it wasn't too bad. We got a beach-front room and loved it. Being lulled to sleep by the sound of the surf is my idea of heaven. The bathroom is modern and well appointed. Nice big shower and a wonderful tub. The water runs into the tub from the ceiling, which is a little disconcerting at first, but it's OK. Just don't stand next to the tub for the first minute, or you'll get splashed. But it is a great tub. The rain shower is a nice touch. Tower 23 may not have a pool, but they do have a nice Sky Deck, a second floor outdoor deck overlooking the beach with lounge chairs and sofas and a fireplace for night-time. It's a popular spot and is often full of sunbathers in the afternoon. If you have a car, you may as well splurge on the $20 per day valet parking. Taking a chance to find parking on the street is taking a big risk, as the neighbourhood is very popular and I found it almost impossible to find parking near the hotel. It's just easier with the valet. I particularly love the location of the hotel, because you're right on the ocean, minutes from trendy La Jolla, a short drive from Fashion Valley Mall and easy access to the freeways that get you all around the San Diego area and up the coast to towns like Encinitas and Del Mar. We saved some money not renting a car at the airport and getting one in PB. So we're very glad we found this hotel. It is our new home whenever we go to San Diego.", "Date": "October 11, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "London, United Kingdom", "Title": "“Luxury on Pacific Beach”", "Author": "Richard P", "ReviewID": "UR118352055", "Content": "Pacific Beach is bar far the more relaxed beach that San Diego has to offer and if you can tolerate the bronzed and the beautiful its a great place to stay. Tower 23 is nestled right next to the peer and offers a little flavour of luxury and style more akin to an inner city hotel. The style is very chic throughout and the rooms are very well appointed. Friendly staff make this a definite recommendation for anyone looking to stay in the area in style.", "Date": "September 20, 2011"}, {"Ratings": {"Location": "5", "Overall": "4.0", "Value": "3", "Service": "4", "Rooms": "5"}, "AuthorLocation": "Chandler, Arizona", "Title": "“Tower 23”", "Author": "blackshirtbill", "ReviewID": "UR118072547", "Content": "Spent a week at Tower 23 located on Pacific Beach in San Diego. Room with view of ocean exceptionally nice. Bar and restaurant excellent but fairly expensive. Would stay there again", "Date": "September 13, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "3", "Overall": "3.0", "Value": "3", "Service": "3"}, "AuthorLocation": "New York City, New York", "Title": "“Stunning Sunsets and Cool-ish Design but over all a little eh”", "Author": "cjthekid", "ReviewID": "UR118014621", "Content": "I stayed at the tower23 for work and liked it. The design of the overall hotel is pretty cool, a glass box over looking the ocean. Our room however was a big eh. I did not see the other rooms but based on the lowest priced room they're not really worth the price they are asking. The room itself is fine with a nice little balcony...unfortunately the balcony faces other people's rooms. They call it a courtyard view...but in actuality it's more like a voyeurs view. Our room abutted up another's balcony....enough so that their cigar smoke came into our room. Noise travels as well. If you craned your neck out the window you could see the ocean. The service, while friendly, was a little lax. When we arrived to check in (after a long flight) there was a gentlemen in front of us asking silly questions for what seemed like forever. There was only one person at the front desk, and instead of calling for help or answering questions while checking us in...we waited 10 minutes to check in. Clearly there should be a concierge person and a check in person...not just one person. We also returned home to find the valet parking closed at 10pm on saturday night. The gate was down. We came down to hang out on the deck in the afternoon, only to find no cushions or anywhere to sit. We had to run around to the front desk and get security to come open it. That's a little strange. All of these little glitches are understandable but at the price they were charging should not have happened. This is clearly a smallish design hotel but that doesn't mean they have to be small on service. That being said, the sunsets from this location are absolutely stunning. All in all I wouldn't discount a stay at the Tower23 but I can't say it's worth it for the cheapest room. If you want to stay at the beach then pony up the cash for the direct ocean view rooms. If not just grab drink there and watch the sun set.", "Date": "September 12, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "New York City, New York", "Title": "“Gorgeous View of the Ocean!”", "Author": "Thea B", "ReviewID": "UR117906055", "Content": "My room was amazing - it was clean, spacious, and my bed was the most comfortable bed I've ever slept on. Room service was fantastic - love the french toast! The Front Desk Supervisor, Jeremiah, was such an incredibly nice person. The entire staff, including the cleaning people, were great. Thanks so much - I will definitely stay here when I visit San Diego again.", "Date": "September 10, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "New York City, New York", "Title": "“Cooooool hotel!!!”", "Author": "HUH42", "ReviewID": "UR117337251", "Content": "My family loved this hotel, location cant get better, its just in front of the beach. The food was good, the terrace was awesome and the rooms were great. First time in San Diego, we loved it. We are definitely going back to tower 23.", "Date": "August 28, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Luxembourg City, Luxembourg", "Title": "“Fantastic Boutique Hotel, definitely my place for the next visits to San Diego!”", "Author": "Goeres", "ReviewID": "UR117125401", "Content": "An excellent cold, in concrete and cool architecture. A fabulous view! Direct on the Beach! Excellent with Kids! Quit! Top Service! $20 unlimited valet parking (and the the TipAdvisor Coupon ;-)) Get an room with access to the terrace where you will enjoy the fireplace and the view over the Pacific Ocean at night (do not forget to get a glass of wine form the bar;-)) If you want to get local ambiance take breakfast next do at Konos", "Date": "August 23, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "4", "Overall": "5.0", "Value": "4", "Service": "5"}, "AuthorLocation": "London", "Title": "“Nice boutique hotel on Pacific Beach, San Diego”", "Author": "OverSeaOverLand", "ReviewID": "UR117020709", "Content": "Tower 23 is a nice boutique hotel right on Pacific Beach. Service was great with friendly staff. We were offered complimentary cocktails on arrival, which made us feel welcome. The room was lovely, with a great bed and lovely bathroom. We had an ocean view room, which was right on the front of the hotel with direct beach views 20 yards in front of us. You can watch the people go past and surfers catching the waves early morning and early evening. Hotels offers wifi, although there was no signal in the room I stayed in. Hotel might need to check strength of signal throughout whole hotel. I got reception in the lovely communal area which has decking lounger chairs and a great little fire to provide additional heat in the evening. Hotel offers it own \"business centre\" with a PC and printer, which was quite old and think they need to upgrade to a new model. Very sllllow connection, think PC more than 3 years old. You can valet your car at the hotel, costs $20 a night. The hotel has it's own restaurant and bar, with amazing changing light on the wall. Brilliant interior deco. Got the impression this hotel is where the locals come out to sample the great food and nice atmosphere at the bar as well. Would recommend Tower23, felt really relaxing and got the true Californian beach experience.", "Date": "August 21, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Michigan City, Indiana", "Title": "“This hotel is amazing. Everything about it was fantastic-the views-the staff-the restaurant. We can't wait to return!”", "Author": "lillabye", "ReviewID": "UR116967767", "Content": "Work and so many pressures made it mandatory to take a two day break. Pacific Beach is a fantastic location and this hotel is the TOPPPSSS!!! We are used to great places, but this hotel outdid many of the great ones we have stayed at. Directly on the ocean and the ocean walk, the views are spectacular, and our \"sweet suite\" was truly wonderful. It was beautifully equipped and furnished with views to die for. The bed is one of the most comfortable we've ever experienced in a hotel. Even the little things (like the soap) were amazing...and the whirl-pool bathtub...spectacular. But two things really stood out. Every person on the staff we met was excellent, from the maintenance guys to the front office folks, to the garage folks and the cleaning people. We had an amazing dinner at the showplace restaurant JRDN, and it was one of the best meals in recent memory, including some many starred places in NYC. Service was superb, personal...not overdone...just perfect. All in all this was a truly wonderful break!", "Date": "August 19, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Rockville, MD", "Title": "“Best Place To Stay In San Diego”", "Author": "JamaicaGirl50", "ReviewID": "UR116748995", "Content": "For families with teens or couples, you get hip, clean quarters, direct beach access and easy access to all San Diego and surrounding area tourist spots! After searching for the perfect San Diego experience and trying a number of other hotels, we luckily found Tower23 and it saved our vacation! The kids learned to surf outside of our front door and the hotel provided us with beach chairs and towels. The restaurant and bar scene downstairs was the place to be (and we sure enjoyed it...kids too!) NOT TO WORRY we never heard the noise from our rooms. Total peace and quiet! There is also a roof top deck with comfortable lounge chairs and bar service. The hotel had easy valet parking and as much as we enjoyed the area we took advantage of this awesome location and went to Del Mar for the races, La Jolla for kayaking and San Diego to the zoo and to see the Padres play!", "Date": "August 15, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "4", "Service": "5"}, "AuthorLocation": "San Francisco, California", "Title": "“Best hotel in PB, sexy, fun and perfect location.”", "Author": "statey", "ReviewID": "UR116523579", "Content": "I love this hotel, I love the bar, I love the location, I love the rooms, I love the views. I have been here so many times and will continue! Even when I was a walk in last minute, I LOVE this place.", "Date": "August 10, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "4.0", "Value": "4", "Service": "5"}, "AuthorLocation": "Cincinnati, Ohio", "Title": "“Very friendly and helpful staff in a convenient and popular location”", "Author": "aaronmisha", "ReviewID": "UR116449397", "Content": "My husband and I enjoyed our trip to Tower 23 and San Diego! The room(Surf Pad) and view were fantastic! All of the staff members were extremely pleasant to work with. Jeremiah, the front desk supervisor, offered lots of great advice on cool dining experiences, which was truly appreciated. The JRDN staff was also a very pleasant crew, which is tough to find in many tourist locations. Overall, our experience at Tower 23 was amazing. Our only complaint would be the popularity of the location, we would have enjoyed something a little more peaceful. If your looking for a great place to stay with an awesome restaurant and convenient beach front location, Tower 23 is the place to be!", "Date": "August 8, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "4.0", "Value": "4", "Service": "5"}, "AuthorLocation": "Washington DC, District of Columbia", "Title": "“Cute \"boutique\" hotel”", "Author": "LYKTraveler", "ReviewID": "UR116434097", "Content": "My boyfriend and I stayed here last year during Labor Day weekend. I had found some cheaper and nice hotels in Gaslamp but he wanted to pay a little more and stay right on the beach. Out of all the hotels we looked at in that area, this looked to be the nicest one. It's a small hotel right in front of the beach. The room was a good size with nice bathrooms. We wanted a king sized bed, but we ended up with two queens instead. I think the regular rooms only come with two queens instead of one king. They have a deck area at the hotel (second floor?) where you can lay out, order food/drinks, and see a nice view of the beach and watch people walk by. I thought they had a pool based on some pictures, but it's just a small little water feature. We ordered some drinks and appetizers and it was fine. Their restaurant always looked like a hip, happening spot for happy hour and early nights, but we always went out to different bars and try different restaurants in the area, so I don't really have a review on the scene at night and whether the food was good. Overall, the staff were very pleasant and it is a nice hotel, certainly the nicest by the beach. It is a little pricey but that is to be expected given the contemporary and \"sleek\" look that they have going on. I wish they had a pool though, as it would have made it more worth it. I stayed here a year ago but nothing negative or overly positive really sticks out about the place. If I were going back to San Diego and wanted to stay by the beach, I would stay here again though since we didn't really have a negative experience. It is a very basic hotel with no spa, pool, or fitness center so if you are someone who likes all the extra amenities at a hotel, this is not the place for you.", "Date": "August 8, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "4", "Service": "5"}, "AuthorLocation": "Phoenix, Arizona", "Title": "“An Amazing and Relaxing Place to Stay”", "Author": "Garethmb", "ReviewID": "UR115914853", "Content": "Strolling along the busy and bustling Pacific Beach Park boardwalk, you can gaze out upon the magnificent Pacific Ocean while dodging surfers, skateboarders, rollerbladers and tourists on bikes. It’s a San Diego experience every traveler should enjoy. But when you’re ready to leave the crowds behind and enjoy an unencumbered view of the ocean, Tower 23 offers a spectacular sight lifting you above the suntanned masses. No, not the lifeguard tower of the same number. Tower 23 is a bright gem of luxury in an already vibrant setting. While establishments along the coast know there’s no competing with the majestic ocean to attract its guests, Tower 23 incorporates the best of its surroundings in its architecture, views and decor, leaving guests feeling like they never left the beach when they step into the hotel. Bright and airy, highlighted with the hues of ocean blue, Tower 23 is sleek and posh at the same time. Accomodated in the Surf Pad, the king-sized Tempur-Pedic Serenity bed, made up with 100% Egyptian cotton linens, was heavenly to sink into. When it got too dark to gaze at the ocean from the balcony, there was a flat screen high-def LCD TV to entertain us. What work we allowed ourselves to do during our stay was aided by the free wi-fi (which is accessible even at the beach). To make your stay even more relaxing, Tower 23 also provides, upon request, in-room massage and spa services. Walking distance from a variety of cafes, restaurants and bars featuring anything from sushi, curry to burgers, Tower 23 itself houses one of the most popular lounge and restaurants on the beach. No kitschy nautical themes here, JRDN offers relaxed oceanfront dining for a great view of San Diego’s beautiful sunset. A contemporary steak & seafood restaurant, JRDN offers an oyster bar as well as a private wine room. If you don’t feel like traipsing the few steps to their main dining room, Sunset Patio or the Tower Deck for some casual Californian cuisine, 24 hour room service is available. Smack dab in the center of all things San Diego, Tower 23 puts you smack dab in the center of all things San Diego, whether you want to surf, golf, fish off the pier or just cruise the beach. Baseball caps and visors are availabe in-room for purchase in case you forgot yours (or you just want a memento). When you’re done with all that fun, Tower 23 is there to provide a welcome respite. The roomy step-in rain shower is stocked with H2O products and luxurious bathrobes invite guests to lounge and relax. From friendly and helpful valet and front desk staff, to the fully stocked mini-bar that includes personal essentials, drinks as well as snacks, Tower 23 makes sure their guests want for nothing. While there are many inns and hotels to pick from in the area, if you’re looking for the complete, luxurious and relaxing San Diego beach hotel experience, Tower 23 is head and shoulders above the rest.", "Date": "July 28, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "4", "Service": "5"}, "AuthorLocation": "Tucson, Arizona", "Title": "“Incredible vacation”", "Author": "tucazdz", "ReviewID": "UR115578794", "Content": "We booked a sex on the beach package. From the moment we arrived the service was spectacular. The staff is extremely helpful and courteous. The location is amazing. We will be back!", "Date": "July 20, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "los angeles", "Title": "“An amazing hotel!”", "Author": "oceanbluela", "ReviewID": "UR115429942", "Content": "I wanted to spend my birthday by the sea and had something very specific in mind. Right on the water, modern, beautiful, low key, and excellent service. Living in Los Angeles (and 20 minutes from Malibu), I am somewhat spoiled by close by seaside activities and options. My partner and I were tempted by many options within an hour or two drive. But after reading about Tower 23 and seeing the photos and reviews, we decided to head to Pacific Beach. I am so happy we did. The hotel is beautiful... light and airy and cool. The room was large and the bed was unreal... so soft and dense. The pillows were heaven. It was quiet with no noise from the rooms on either side. The restaurant was perfect. We had lunch one day and breakfast the next, both enjoyed at an outside table looking at the surfers and waves. The prices were extremely reasonable and the food very good. The service there was also a 10. My partner and I are very picky when we travel, and we travel a lot and prefer to stay in 5 star hotels. This hotel passed every test. We will definitely return for that little vacation two hours down the coast. Stay there... you'll be happy you did.", "Date": "July 16, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Chicago, Illinois", "Title": "“This was the best experience I have ever had!”", "Author": "cwagener", "ReviewID": "UR114937034", "Content": "We booked through Luxury Link, we had a great package that included breakfast, parking, one free night of dinner at JRDN and 2 free cocktails at the bar. We stayed in the Sanctuary Suite. The room was AMAZING. I am a nurse, so I am very picky about cleanliness and germs. I check the beds, pillows, shower, toilet, etc everywhere I go. NEVER has a hotel been so PERFECT. I mean it. PERFECT. Everyday they cleaned and it was meticulous. I could not have done better myself. Every room had an ocean view. Did I mention the color therapy hot tub in my room - and the water to fill it came from the ceiling!! It was amazing! The staff was so friendly and accommodating and the location!! OMG - right on the beach, beautiful view, wonderful sun deck (with bar service)... Walk to the beach, walk to starbucks (but why - there is a complimentary Kerig in the lobby!), walk to shopping - I will be back. Tower23 WOWed me in a way that I have never been WOWed before.", "Date": "July 1, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "4.0", "Value": "4", "Service": "5"}, "AuthorLocation": "Idaho", "Title": "“Loved the bed!!”", "Author": "katt981", "ReviewID": "UR114685176", "Content": "Stayed here for two nights after staying at another hotel in the Gaslamp District. Loved this hotel! You SINK into the bed, it is heavenly!! We arrived early and our room wasn't ready yet, so we left our bags and began wandering and checking out the area. It was our first time to Pacific Beach, and we did encounter the \"June Gloom\" but it didn't matter to us! next time we will probably go in July or August instead. We got a call that our room was ready and when we arrived back at the hotel, our bags where already in our room for us! The rooftop deck has the perfect view for watching the sunsets and the pool is more like \"stick your feet in' type one. But no worries - you have the whole ocean! We didn't get room service at all, but we did eat at Jrdn a couple of times - what great food! It was just a little pricey (everything in Pacific Beach is so inexpensive) but we expected that for the quality of food and service we received. Would definitely stay at this hotel again the next time we go to Pacific Beach!", "Date": "June 23, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "4.0", "Value": "4", "Service": "5"}, "AuthorLocation": "Chicago", "Title": "“Pleasant in every way”", "Author": "Duster4260", "ReviewID": "UR113878965", "Content": "This was a surprise 50th birthday. When we arrived Nati and Jeremiah greeted us with warm smiles, quick registration and a complimentary cocktail. When they heard it was a special weekend, Jeremiah got us situated for the evening with a reservation at the hotel restaurant, which I will tell you now has amazing food. The hotel is a modern boutique style. Perfect for a couples get away. We had a partial view on the North side 2nd floor which gave us a view of people on the boardwalk and the sunsets over the ocean. Both very entertaining. We were in the room no more than 20 minutes when a knock on the door came. A plate of wonderful brownies with rasberries and a happy birthday card was delivered by John (also smiling!) as a gift from the hotel. The restaurant also provided creme brulee as a birthday gift and tasty treat at the end of our meal. Try a sampling of the oysters... they are great, as are the scallops. In the mornings, you coffee/tea drinkers will love the Keurig in the lobby. We also recommend running just next door to Kona's for breakfast, but be sure to eat it on their \"hidden\" deck right above the beach. Even though we did the running to the zoo and sea world, it was great to come back to Tower23 early each day. There is no having to walk to get to the beach -- you're on it! The valet service is quick and friendly. Jeremiah, at the front desk always so it seemed, is a great resource and help. We didn't use this, but I heard him helping another couple with bike rentals. If you are on the street side, you do get some noise, but it was very entertaining for us. The bed is extremely comfortable and the shower is perfect for couples. If you want to stay in the heart of this beach community and want something a little special, then Tower23 is it.", "Date": "June 16, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "3", "Location": "5", "Rooms": "5"}, "AuthorLocation": "", "Title": "“What you pay is what you get!”", "Author": "TolisDiablo", "ReviewID": "UR112642682", "Content": "I visited for my first time San Diego and my gf and I picked this hotel mainly for the location. Tower 23 has everything a modern hotel can offer. Nothing special or extraordinary but enough to make your stay enjoyable. Staff was very helpful, restaurant and bar were great as well. The view from our balcony is all the money. Finally the bed is one of the most comfortable I ve ever slept!", "Date": "June 10, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "4", "Service": "5"}, "AuthorLocation": "Gainesville, Florida", "Title": "“Loved it!”", "Author": "Lexie99", "ReviewID": "UR112066917", "Content": "We stayed here for two non-consecutive nights on either end of a trip to Ensenada for the Baja 500. We booked a room without an ocean view since we weren't going to be here long enough to hang out, but when we arrived they upgraded us to an ocean view room. The room is modern, clean, and soothing. There is a comfy chaise lounger in the room that is very comfy to lounge on. The bed is like sleeping in a cloud with lots of pillows and a comforter. The AC works well and the shower has good pressure and is roomy. The view was beautiful, and the hotel is literally right on the boardwalk. We ate at the hotel restaurant which was amazing. The food was great, and we ate outside where the temperature was perfect, and the view was fantastic with lots of people and pet watching. They have valet parking and a garage. On our return stay we had a room without the ocean view, but it was just as nice. The only differences were instead of a shower stall we had a shower/tub combo and the view. Now the view was not of the ocean but it was interesting. Our room had sliding glass doors that looked right out onto the hotel's patio. It was a little disconcerting to have people right there while we were in our room. I think the windows were probably tinted and once the sun went down we closed the curtains so it wasn't a problem, it was just odd. The night of our second stay we walked down the boardwalk to World Famous. The food was really good, and we got to see the Fire Lane guys put on their fire juggling show as we were leaving. Everyone whom we dealt with from the front desk to the valet was super friendly and helpful. The proximity of the hotel to the beach/boardwalk, the room comfort, and the friendliness of the staff make this a place we will choose to return to when we come back to San Diego.", "Date": "June 7, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "4.0", "Value": "4", "Service": "5"}, "AuthorLocation": "Los Angeles, California", "Title": "“Excellent vacation at a terrific hotel”", "Author": "socaldiver", "ReviewID": "UR110855719", "Content": "We loved our stay at Tower 23. The room was clean and the decor was stylish. Really enjoyed our time spent on the hotel's wonderful deck overlooking the beach. It was especially gracious of the management to acknowledge the birthday I was celebrating. All of the staff in the hotel were professional and friendly. The only reason I rated it 4 instead of 5 stars is due to the $20 daily parking rate. It just seemed a little high.", "Date": "June 1, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "", "Title": "“Most Amazing Hotel!”", "Author": "calilove16", "ReviewID": "UR108477015", "Content": "We actually stayed at this hotel in September of 2009 but I'm just getting around to writing the review. I found this hotel by researching online, it was our first time in San Diego together and I wanted to treat my fiance to a nice hotel stay on the beach for his birthday. We got there a little early and our room wasn't ready so they put us in another room that was better, it was a corner room and had AMAZING views of the beach. The room was awesome, the bathroom was unbelievable, water came out of the ceiling into the bathtub!!! We enjoyed one of the best meals we've ever had at JRDN restaurant that is downstairs, I recommend it to anyone that is going to San Diego. We also enjoyed an room service for breakfast the next morning which we enjoyed on our balcony listening to the ocean breeze. While we were there we did the private surfing lessons that the hotel set up for us which were awesome. Honestly I can't say enough good things about this hotel, we're planning to make a stop for our honeymoon when we head out west next year. The only thing that's missing is a swimming pool, but you're literally on the beach so how can you complain.", "Date": "May 16, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Coffs Harbour", "Title": "“WOW!”", "Author": "the_perfect_h0liday", "ReviewID": "UR103955662", "Content": "Tower23 is amazing! We stayed in a surf pad inter connecting room with our 2 children (ages 10,14). The rooms are a good size with excellent bathrooms. We all loved this hotel, the staff are all so friendly & welcoming, the rooms are fantastic & the view looking out from our balcony was spectacular!!! We had dinner at the restaurant one night, food & staff were great & it had a really good feel about it. Pacific Beach is such a cool place. We hired cruisers from the bike shop across the road & rode for hours along the boardwalk. A must also is Kono's right next door to Tower23. Great food for litle cost, again really nice people & great location. We'll be back for sure!", "Date": "April 13, 2011"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "San Diego, California", "Title": "“Excellent Hotel- GREAT Service!!!”", "Author": "Coop31", "ReviewID": "UR100214409", "Content": "When a family friend told us they were celebrating their birthday in the restaurant at Tower 23 Hotel, my husband and I figured we would get a room there for the night. From the second we pulled into the very chic hotel the Valet greeted us with a smile and offered to call the Bellman for our luggage. Sarah greeted us at the front desk. Her kind demeanor was refreshing, opposed to some \"snooty\" hotels where you feel as though they are pushing you through the doors to your room. Sarah told us all about the hotel, restaurant and offered a place where we could rent bikes. The hotel room was very comfortable and amazingly clean. Our room looked out to the ocean. If I had a strong arm, I probably could have thrown a rock onto the sand…that is how close we were to the ocean. The restaurant had delectable food and a good crowd. Happy hour is very reasonable, and the sunset view is literally breathtaking. Our server Jayton was easy going yet professional. We followed dinner with a night cap on the Tower Deck, where a fire pit paired with the nice ocean breeze defined paradise. In the morning we ordered room service for breakfast. Meredith brought a ray of sunshine into our room along with her. She not only delivered our delicious breakfast, but also made some really good recommendations of places to go in the area. Overall our Tower 23 experience was nothing short of perfection. I would HIGHLY recommend anyone stay at this wonderful hotel.", "Date": "March 14, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Phoenix, Arizona", "Title": "“Relaxing at Tower 23 Hotel”", "Author": "jgk010774", "ReviewID": "UR98279414", "Content": "This is not the first time I have stayed at Tower 23 Hotel. As a matter of fact, I like to stay there every time I go to San Diego. It is right on the water, the staff is extremely helpful and friendly, the food/drinks are delcious and I truly feel at home. I am often at Tower 23 by myself and I feel very safe and comfortable, as well as being right in the middle of great restaurants and amenities in the area. My favorite part of staying at Tower 23 are the rooms. Each room feels so open and the immediate access to the ocean views are heavenly!", "Date": "February 27, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "San Diego, California", "Title": "“Great getwawy trip with wonderful view”", "Author": "Travelbuglove83", "ReviewID": "UR95780366", "Content": "My partner and I decided to have \"date night\" and chose Tower23. We live in San Diego but wanted the feeling of getting away. The hotel is overlooking the beach and the views are gorgeous. Its very close to Garnet Ave, which is the party heartbeat of Pacific Beach. The staff is very nice and attentive. I didnt have a chance to eat at the restaurant but I've heard wonderful things from co-workers. They swear by the blueberry mojitos. The room was spacious and I loved the bathroom. We had a spa which was amazing! The water came down from the ceiling and the spa had controllers that made the water warmer, controlled the pressure on the jets and changed the color of the water. The bed was very comfortable with a number of pillows to choose from. The patio area overlooked the courtyard and the beach. A great way to start the morning.", "Date": "February 7, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "1", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Los Angeles, California", "Title": "“Overpriced but a very good experience.”", "Author": "WhiteGatesNewYork", "ReviewID": "UR95009447", "Content": "I researched a number of hotels for my weekend away in San Diego. I was looking for a luxury, upscale hotel that was on the beach, yet close to late-opening bars and night life. It was quite hard to find this. A lot of the resorts are either on the bay or miles from anything. Tower 23 is a modern, small and recently refurbished hotel in a prime location. It's right on Pacific Beach and has wonderful views from its terrace and bar/restaurant. It's a short walk away from a whole host of bars and restaurants in the casual Pacific Beach neighborhood. A cab to the classier Gaslamp district was $35 (in general I felt the taxis were very expensive in San Diego). The staff were mostly all excellent and tried hard to help us have a good stay. On the first night, the hotel manager made an exception to hotel policy by turning on the fire-pit on the roof for us. It was appreciated and he didn't have to do that. Another staff member brought blankets out for us. The drinks service on the terrace was also good. The hotel's bar and restaurant is excellent. It has great views of the ocean, very good quality brunch and the ambiance is perfect. I noticed a lot of locals go there for special occasions - birthday parties or weekend nights out. I booked the Sanctuary Suite at the hotel. This room was first rate. It was spacious and modern with a wet bar and comfortable bed. The signature feature, however, was the giant spa bathtub with a tap in the ceiling that fills it. Colored lights and powerful jacuzzi jets also make for a relaxing soak. DOWN SIDE: My hotel suite was very expensive and for the money I have experienced far more. It's basically a Peninsula or Four Seasons rate without a resort that even comes close to those type of hotels. Tower 23 is nice and well run -- but it doesn't have the scale or world class service of a true luxury hotel. It's more of a well put-together local hotel with a modern edge. Aside from the expensive price, my only other disappointments were: -No hotel pool - surprising! -They couldn't give us a late check out, and the normal check out time is a rather early 11am Otherwise, a great, relaxing and enjoyable experience.", "Date": "January 30, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "San Diego, California", "Title": "“Best Beachfront Hotel in San Diego”", "Author": "mwd05", "ReviewID": "UR90956178", "Content": "My husband and I recently spoiled ourselves with a night at Tower 23. We live in San Diego and have been to Tower 23 before for dinner and drinks but recently stayed the night and WOW was it worth it! The location is the best in San Diego - one of the few nice hotels on the beach. We also love the modern luxury design. Gorgeous view of the ocean and perfect for a stroll on the beach or an afternoon surfing. I would recommend an upgrade to a view room if possible! We had excellent service from all the staff. My favorite aspects of the room were the bed and the bathtub (loved the bath soaps & shampoos too). Also loved walking right out on the deck in the morning. We ate dinner at the hotel restaurant JDRN and were really impressed with our dinner. Again excellent service and food! I had the scallops and my husband had the ribeye both were cooked perfectly and delicious. I will definitely stay here again and would recommend it to any family or friends looking for a luxury getaway in San Diego.", "Date": "December 29, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "3", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Temecula, CA", "Title": "“Unique”", "Author": "FijiJen", "ReviewID": "UR85872975", "Content": "We stayed in the \"Sanctuary Suite,\" which was expensive, but fantastic. The room is huge, the jacuzzi in the room is deep and fills from a stream of water that comes out of the ceiling. They really went out of their way to send guys up to bring a DVD player that would work so I could play a slideshow I'd put together for my husband as a surprise (the Xbox they'd put in the room for me wouldn't play it). The ocean view is beautiful, and the restaurant downstairs is exceptional! The only negative is that for a while we could hear a crying baby next door. Otherwise a perfect romantic getaway. LOVE the sundeck with big couches, where we drank our own wine (saving $), and hung out in the sun in the afternoon.", "Date": "November 3, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Carmel, California", "Title": "“We will return.”", "Author": "greekhula", "ReviewID": "UR83874000", "Content": "Great customer service at front desk and throughout the Hotel. Elizabeth H. went above and beyond providing information on their killer lights. Loved our oceanfront room and Oysters at the bar. We will be returning next year and look forward to it.", "Date": "October 17, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "New York", "Title": "“An Absolute Gem”", "Author": "Chelseaguy68", "ReviewID": "UR81673400", "Content": "I am a frequent traveler both for business and pleasure and the ocean front room at Tower 23 was one of the best rooms I have ever stayed in. I frequently stay at the Ritz Carlton and the Four Seasons so my standards and expectations are very high and I have to say that this hotel blew me away. First off, the ocean front rooms are only about 50 feet from the beach with direct views of the ocean with a front row seat to spectacular sunsets every night. The rooms have balconies that allow you to sip a nice glass of wine, read a magazine, and be treated to one of the best hotel views I have ever experienced. The decor of the room is fantastic too. It's modern, clean and stocked with a great mini bar, flat screen t.v. high end bath products, and a very comfortable bed. The hotel itself is small and there's no pool, but there is a super nice deck with lounge chairs, comfy sofas, fountains, and a fire pit. The restaurant and bar serve great food and the room service was divine: ahi tuna, grilled octopus, and oysters. This hotel is an absolute gem. I'd stay here again in a second.", "Date": "September 30, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "3", "Sleep Quality": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "London", "Title": "“Comfiest bed I have ever slept in!”", "Author": "TravelHamster", "ReviewID": "UR81064926", "Content": "We were on a big US road trip and went to PB in SD for sone 'down-time'. Unfortunately, despite it being September, we got rubbsh weather so being at this hotel was great. T23 is the best hotel in the PB area I'm sure of that. The restaurant is good - they do 1/2 price bottles of wine on a Tuesday which is worth taking advantage of -- and the rooms are so comfy. The beds are ridiculously comfortable. There is no pool - but you have the sea at arms length if you re feeling ballsy!", "Date": "September 26, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Westport Ct", "Title": "“Favorite stay in California”", "Author": "HershieK", "ReviewID": "UR77232924", "Content": "We loved the clean lines and contemporary decor of this hotel and our Surf Pad room with a view of the ocean fulfilled our expectations! Bathroom was roomy enough and the housekeeping staff were helpful, prompt and friendly. Front desk staff were all very nice and the hotels restaurant was wonderful!! Breakfast and dinner we enjoyed both! Valet parking, $20.00 a day and the convenience to the beach was exactly what we wanted. Setting is surrounded by typical surf shops/burrito joints etc. DON\"T recommend the tiny burrito drive thru/walk up stand across from the hotel parking lot .", "Date": "August 28, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Frankfurt, Germany", "Title": "“Best Beach Hotel in SD”", "Author": "Torben22", "ReviewID": "UR71994923", "Content": "I was at the Tower23 Hotel last year on vacation. The hotel is perfect situated right next to the Beach. The Beach Front Room has a perfect view on the sea. The rooms could be a little bit bigger but absolutely ok for a few days. From here you can visit for example La Jolla...Would stay here again!!!", "Date": "July 23, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "san diego", "Title": "“beautiful views”", "Author": "alykeany", "ReviewID": "UR70199034", "Content": "My friends and I went to Tower 23 Hotel for a staycation getaway. We chose this hotel so we could enjoy the beach atmosphere for the holiday weekend. The room we had was beautiful with a full ocean view. The rooms also had free wi fi internet and we loved that we could place an in room dining order the night before and they will deliver it at whatever time you request. We also had a delicious dinner at JRDN. We started off with the delicious mussels and enjoyed the rest of the meal. We all had a great time and cant wait to go back.", "Date": "July 8, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "1", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "New York City, New York", "Title": "“Great place to stay if you can afford it”", "Author": "hookem22", "ReviewID": "UR70162957", "Content": "We have stayed at this hotel twice in the last year. We absolutely thought it was great. Staff was friendly the hotel bar/restaurant was great and it is in a great location. It does get pricey but what do you expect from a trendy hotel.", "Date": "July 8, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "2", "Overall": "1.0", "Value": "1", "Sleep Quality": "2", "Rooms": "1", "Location": "5"}, "AuthorLocation": "Denver, Colorado", "Title": "“Overrated - over priced”", "Author": "eanhold", "ReviewID": "UR70047652", "Content": "Tower 23 has a great location, interesting modern design, with a nice bar and restaurant. That is about it. I had a local friend check out several beachfront hotels in person prior to booking for 4th of July Weekend, and the tower 23 manager pushed us to stay with them, enticing us with a party on the 4th that had been very successful the prior year ...once we checked in we were very surprised to find out that the party was not happening, so our group of friends got the pleasure of standing in line or waiting in traffic everywhere we tried to go on a busy overcast weekend. Also, our room had a broken toilet paper holder, broken lamp, and a shower that took about 15 minutes to warm up. The service is pretty good, however every complaint that we made from the icy water and the other issues (admittedly they were small issues, but those shouldn't be a worry at that price), were met with \"we'll do better next time\" - as though we would ever plan to come back. The staff tried to make us feel better about our inconveniences, with an 11% credit but it was too little too late.", "Date": "July 7, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Florida", "Title": "“4 star hotel for price of 3”", "Author": "KeyWestBabies", "ReviewID": "UR69157241", "Content": "Very clean and modern rooms. Amazingly comfortable beds. Trendy bar/restaurant downstairs. Beautiful beach location. Perfect weekend.", "Date": "June 30, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "2", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "4"}, "AuthorLocation": "Calgary, Canada", "Title": "“If you want to feel like an unwanted house guest...”", "Author": "WorldTrvlr788", "ReviewID": "UR68560594", "Content": "The views may be beautiful but you're definitely better off driving over to Pacific Beach from anywhere else in San Diego to enjoy them, rather than wasting your money on this trendy pit. Tower 23 touts itself as a four star - following our stay at the Four Seasons, I can assure you it is not. This hotel is an old Best Western with a fresh coat of paint and very poor service. The staff at this hotel made us feel like unwanted house guests. We were greeted by an apathetic valet that needed to be coaxed to remove our luggage from the trunk. The front desk people were nice enough but had no local info to offer us and never followed up when we asked. We asked for help getting a cab and the front desk wasn't able to accomplish this. After waiting 25 minutes, we had to go in, ask again, and make sure the front desk staff picked up the phone and actually dialed this time. There is no pool and the room amenities are low to none (no lotion at all.) The room was small and mediocre; the bed was uncomfortable and the sheets were rough. To top it off, we were kept up all night by the nightclub below us. Our complaints and request to check out later that night were answered with a \"sorry, you booked here for three days, you can't check out.\" (WHAT?!) Never once was there any question as to why weren't happy or if there was anything the staff could do to improve our stay through the night. When we confronted the manager early the next morning and asked to be absolved of our three night check-in, we were told that, \"The hotel is not for everyone and you are free to leave.\" We were prepared to list a number of reasons for our dissatisfaction, but we were never asked. There was no inquiry as to why we were displeased, any apology about our experience, or remorse at losing business. Defining yourself as a trendy, boutique hotel does not mean that you make your guests feel like an unwanted outsider... This hotel is a complete waste of time and money. We took off as soon as we could to the W downtown. My husband and I no longer speak of our 12-hour stay at Tower 23 - it was a dark time for us and we've tried to block it from our memory. However, I feel like one last acknowledgement of this experience is worthwhile if it saves at least one person from an experience like ours.", "Date": "June 24, 2010"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "nyc", "Title": "“great place”", "Author": "traveler10011", "ReviewID": "UR68360012", "Content": "stayed a few nights in june 2010 w teen son loved the hotel, excellent friendly staff clean spare modern rooms - great beds and beautiful bath ocean view w direct access to roof lounge by far the nicest property in the funky pacific beach town pacif beach is funky, not too upscale typical california town great place to spend a few days", "Date": "June 22, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Bartlesville, Oklahoma", "Title": "“A Unique Hotel with Excellent Service”", "Author": "CJL3_10", "ReviewID": "UR67131024", "Content": "We completely enjoyed our recent stay at Tower23. The room and public areas were clean, modern, and well maintained. Our room was located on the second floor and opened onto the Tower Deck with a wonderful view of the ocean. Our teenage daughters especially liked the location which is only a few steps from the beach. After returning home, we realized that one of the girls had probably left her Apple i-touch in the room safe. A call to the front desk was all it took to locate the missing item which was indeed still sitting in the back of the safe. The staff followed up with several phone calls, then boxed up and shipped the item to our home. All of this occurred over a timespan of only about one hour. Our sincere thanks to the staff at Tower23 for their excellent customer service. We will definitely be staying there again the next time we are in San Diego.", "Date": "June 10, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "chicago", "Title": "“Can't wait to go back!”", "Author": "jeno6", "ReviewID": "UR64132523", "Content": "I stayed at Tower 23 in mid-April with my husband and baby. We absolutely loved it! The room was big, extremely clean, and had a fantastic view -- and we only had \"partial\" ocean view. The staff was super helpful and very friendly. Housekeeping was fantastic -- they even lined up my baby's toys in his crib each day! We were able to hook up to the free Wi-Fi from anywhere in the hotel - which my husband loved. The location was great, lots of great restaurants within walking distance. Overall, one of the best places we've stayed at. I have already recommended Tower 23 to family and friends!", "Date": "May 14, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Redondo Beach, California", "Title": "“Great Hotel - Fantastic Location - Stayed with the Family + Dog”", "Author": "tskelton", "ReviewID": "UR63705722", "Content": "Great Hotel, service was awsome. Had a crib and roll-a-way bed in place for when we got there. Room was clean and modern, view of the ocean was great. The outside area was nice and comfortable. Was pet friendly but the pet fee at $75 was a little steep. I would stay again.", "Date": "May 10, 2010"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "Visalia", "Title": "“Relaxing and Rejuvenating”", "Author": "centralvalleytravel", "ReviewID": "UR62887871", "Content": "My husband and I just got back from Pacific Beach where we stayed at Tower 23 with another couple. We had the 2 corner rooms on the second floor. How can anyone ask for a better view ? We loved being able to watch the ocean and the sunset while sitting on our balcony with a glass of wine. The entire staff was the best ! Every question,every request is met with a smile and taken care of. We ate one night at the restaurant which is called JRDN. The food was outstanding ! If you like steak, I recommend this place. After dinner we all gathered on the second floor deck around the fire pit for drinks, what a fabulous way to end the day !! We loved the direct beach access and the whole atmosphere of this hotel. We are all over 50 and although we were there during the week the noise was not bad considering we were right above the the sidewalk and the bar. We have stayed here many times since the hotel opened and we will stay here everytime we are in the San Diego area. LOVE the ambience,the service and the location. It's fun and inviting.", "Date": "April 30, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Canberra, Australia", "Title": "“BEST HOTEL IN SAN DIEGO!”", "Author": "girlish_sista", "ReviewID": "UR61028618", "Content": "We spent 4 fabulous nights here and my only regret is that it wasn't longer! Room - We chose a Surf Pad as part of a birthday celebration package! Choose this room and you will not regret it! The views are arguably some of the worlds best! Being from Australia we are used to gorgeous beaches and Tower23's Surf Pads deliver views of one perfect beach! The gorgeous sunset views come free with the room and try are some of the best! The room was large and cleaned meticulously everyday by courteous and dedicated staff! Even a request for new pillows was met with a smile. The beds are heavenly! You will not want to get out of bed, which isn't a problem as you can lie in bed and look at the beautiful Pacific Ocean! Location - pretty hard to beat! Tower23 is right on the beach and the boardwalk, as well as being within walking distance to it her great restaurants and activities, and only a 10-15 drive to the center of SD. Parking is also abundant and the hotels valet parking was affordable and super quick. Service - the BEST! Upon check in we were sent to our room, only to discover it was still being made up. We didn't mind waiting the 10 minutes on the beautiful tower deck in the sun lounges, although the hotel made us even more comfortable with complimentary cocktails to apologize for our room not being ready! Within 10 minutes we were in our room and not 10 minutes later there was a knock at the door with a free bottle of champagne to wish me a happy birthday! Everything flowed smoothly and staff were always smiling! They genuinely make you feel welcome, and nothing is too much trouble. Noise - ignore the other reviewers! They are obviously too stuffy to be staying in such a wonderful location! We had a room right next to the tower deck and right above the restaurant and noise was Never a problem. The glass is double glazed and blocks out 95% of the noise. We were even here over a weekend and it wasn't a problem, even when there was a function on the tower deck! Oh, and you absolutely have to eat at JRDN - see my other review for this - the food is to die for! Overall, we loved Tower23, and would happily recommend it to our friends and stay here again when we are next in SD!", "Date": "April 11, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "copenhagen", "Title": "“The best staff ever!!!!!”", "Author": "fetter", "ReviewID": "UR58842778", "Content": "Hi. I have recently been staying in the hotel tower23, and as always a super experience. I have been coming there for the last three year, because of the location, the ambience, and of course the great service. the service is very important for me, and it just gets better and better. Thanks guys, for a perfect stay, and for putting a big smile on my face! Love Chistian", "Date": "March 17, 2010"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "No. Calif, East Bay", "Title": "“Tower 23 Part 2 of 2”", "Author": "ghwk", "ReviewID": "UR58838614", "Content": "Arrived at Tower 23 and was immediatly greeted by Lisa who confirmed that even though we were early that the room was available. Once checked in and back in the lobby we requested information regarding places to eat, where to find some music etc.. We were assisted by both Nancy and Lisa who within an hour had researched and printed up a list (with directions and phone numbers) of nearby places that were along the lines of what we were looking for. Both were very helpful and courteous and handeled our requests efficiently and with professionalism. The cleaning service was very good and our corner room view of the ocean excellent. The room itself was great, very comfortable, clean and with 2 queen beds and very comfortable linens and mattress. I would definately stay there again. Nancy and Lisa thank you so much for your hospitality and service!", "Date": "March 17, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Missoula, MT", "Title": "“Spectacular”", "Author": "MontanaMissyRae", "ReviewID": "UR58584983", "Content": "Reid and Sanaan were exceptional along with the rest of the very friendly staff. For full review, check out my blog: http://cultivate3f.blogspot.com/", "Date": "March 14, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "3", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "agoura, ca", "Title": "“Beautiful. Loved it! Great service, food, views!”", "Author": "ssmaggie", "ReviewID": "UR57751538", "Content": "Stayed the weekend with gal pals. It rained and there was a tsunami alert, but we still had a great time. Breakfast is fantastic and not too expensive. Gorgeous view. We walked to South Mission Beach jetty and back in the morning for a good workout. Staff was extremely helpful and accommodating. I'm planning on going back for my anniversary. The hotel is clean and beautiful. We had two surf rooms looking out over the pier and ocean. Well worth the price!", "Date": "March 4, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Calgary", "Title": "“Like sleeping on a cloud”", "Author": "wizelliott", "ReviewID": "UR57039529", "Content": "My husband and I stayed here for five days with our 18 and 21 year old daughters. We all loved it. This hotel is beautifully modern and decorated in a very \"now\" look. Fresh flowers, organic sculptures, high end finishes. Clean with very friendly and helpful staff in all parts of the hotel (front desk, parking valet, housekeeping, restaurant). This room with 2 Queen size beds was big enough for all of us. We had a problem with the toilet on the first day and it was fixed immediately while we were out. No more problems. The hotel has only 44 rooms and only three floors total. It's a nice size. It's in pristine physical condition. Our room was in the back of floor 3. Perfect. Do not be afraid of \"partial ocean view\" description. We could see the water from our room and in reality, you are either out on the Tower Deck (roof deck) or out on the beach or boardwalk most of the time anyway. Because we were in a room toward the back, \"partial ocean view\", we were set back from the wonderful (but noisy at night) restaurant and bar. If we had been in a room right out front on the water side, it might have difficult to sleep. As it was, our room was quiet and the beds are like sleeping on a cloud. I have to say we did miss the awesome breakfast served daily in the hotel restaurant, from previous visits. I believe in busier months, the breakfast will be served again daily. In the meantime, the most famous breakfast place in Pacific Beach, Konos, is just steps away and superfast and yummy. Enjoy Tower 23.", "Date": "February 24, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "3", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Texas", "Title": "“Quiet gem”", "Author": "TexasSharvi", "ReviewID": "UR55573606", "Content": "What a lovely hotel. The front desk staff was nice enough and the bar was rockin' when we arrived. Restaurant/bar area seems to be quite the place to party for the 20 somethings. Rooms are very clean and the Tempur-pedic beds are perfect! Our balcony opened up to the water and overlooked the tower deck. A delightful place. We'll recommend it and visit again.", "Date": "February 9, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "3", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Austin", "Title": "“Slice of Heaven”", "Author": "AustinMercy", "ReviewID": "UR53592889", "Content": "My husband and I who Iive in Austin, TX went to San Diego for our son's lacrosse tournament and decided to stay on our own away from the team. Tower 23 is a \"groovy\" hotel RIGHT on the beach! Being an Interior Designer, I'm very particular about my accomodations and I have to say, I was not disappointed. The decor is just what I expect from a \"boutique hotel\". Our room was decorated modernly with a bank of sliding glass doors which offered up a full ocean view. The service was outstanding from the moment we checked in to the final check out, four days later. The second story deck is where we ended every day lounging in a chaise, drinking a glass of wine and eating the steamed mussels with chorizo, capped by breathtaking sunsets. Drew, our waiter those evenings, gave us impecable service along with a nice array of menu selections , which is probably why we didn't venture elswhere. We were there mid January, and the boardwalk between the beach and the hotel was not too busy until Sunday when the locals turned out for \"Sunday-Funday\". The only drawback with being beachside, was late around 2am when the \"last call\" revelers would walk down the sidewalk and wake us up. I'm sure that could have been allieviated if I hadn't instisted on keeping the sliding door wide open every night, but listening to the ocean was a must..... There's a lot of hustle a bustle going on in and around the hotel so keep that in mind if you're looking for a really quiet atmosphere. We'll be returning for my husbands 50th birthday in April!", "Date": "January 16, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "countindayz", "Title": "“An incredible place to stay while on business in San Diego”", "Author": "countindayz", "ReviewID": "UR48156825", "Content": "I had stayed in Pacific Beach just one other time and vowed to never stay again. I love San Diego and just seemed to enjoy staying in the city in several fantastic big hotels and smaller boutique hotels. But this time my meeting was on Mission Bay and I wanted to be closer. I kept seeing Tower 23 reviews and thought I'd give it a try. Gosh am I ever glad I did! The staff was great....from the first phone call to make the reservations to check out. They gave me an incredible room that was isolated, quiet and had a view that was just incredible. I was on business, leaving me not enough time to enjoy the hotel more. But just having a beautiful, clean and very quiet room to come back to....with a bed to DIE for each night was great. Perks: - Great valet parking. First time that I've never had to wait one minute for my car. It was there as soon as I got off the elevator EACH time - Safe. Important to me as a single woman to feel safe, and this well staffed and well secured hotel made me feel very safe. You can't just pop in from the beach, its very secured. - View. The very best oceanview in San Diego....just couldn't get any better. - Room service. Unsurpased for both time and quality - Bed. Best of the best....great mattress, linens and best pillows ever. Lots of pillows! - Bath. Great soaking tub and rain shower. - Location. Great! - Staff. Very attentive Bottom line, they keep it clean and simple. Very zen. Loved the deck and \"bonfire\" each night. Thanks so much, Tower 23 for being so nice and accomodating to a real non-jett setter and for the great room. I can't wait to go back, next time I hope its for vacation! But the next time I come to San Diego on business travel, I plan on calling you first for availability.", "Date": "October 31, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Missouri", "Title": "“Wonderful place!!”", "Author": "Kelly1639", "ReviewID": "UR47817370", "Content": "If you are traveling with young children, be sure to ask for a room away from the bar....the room service is awesome!! Our room opened up onto the deck which was nice when the baby was napping. Be sure to go to Kono's beachfront restaurant just down from the hotel for wonderful breakfast and the best coffee ever! The beds were very comfortable. The location was perfect for attending a baseball game and going to Sea World. Not really designed for families, lots of younger partying people, but we still enjoyed our stay and would love to stay here again!!", "Date": "October 26, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "3", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Los Angeles", "Title": "“Better than most in Pacific Beach”", "Author": "SWTTRAVELS", "ReviewID": "UR47240111", "Content": "This is kind of a boutique hotel right on the beach in the Pacific Beach area of San Diego. The hotel is clean and chic without being snobby - retains laid back beachy vibe. The rooms are nice and the courtyard in the middle of the hotel has a fantastic view. The beach bar is fun and the service was really good. We stayed with our dog which was great as few hotels in the area allow dogs - the price for the dog was steep though - we stayed one night and it was $75 non-refundable. I would say that the price of the hotel is a little high but the only other alternatives in the area are pretty run down hotels. We will definitely stay here again when we come down to San Diego for the night.", "Date": "October 19, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "3.0", "Value": "4", "Location": "4", "Rooms": "5"}, "AuthorLocation": "San Francisco", "Title": "“A nice find in San Diego”", "Author": "javacode", "ReviewID": "UR46865400", "Content": "Tower 23 was a good find in San Diego. The hotel is right in front of the beach. Some things to consider: 1) It does no offer breakfast service in the restaurant. Only in your room or in the patio. The patio area is nice because it has a direct view of the sea shore. 2) The garage door closes at night, so if you are having to park late at night, you might have to find parking in the street. Check with the concierge to see if they open the garage door if this happens. the hotel has a modern design to it. Lots of use of concrete and glass. Had lunch at the restaurant and it was very good. in general, I would recommend this place to anyone visiting San Diego.", "Date": "October 14, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Suresnes, France", "Title": "“HAPPY RETURNERS”", "Author": "frenchandparisian", "ReviewID": "UR46111374", "Content": "This is the 3rd summer my partner and I come in SD for a few days, to end a road trip. We loved Tower23 the first time. We loved it even better the second time. And this has even improed with our third stay. So far we only stayed in the Surf Pads, right at the front of the hotel. We had different rooms each time, on the part away from the bar which I would recommend. They are all basically the same, only one got a separate shower stall, but we could noy get it this year. Same with this price tag. What do we like ? The STAFF is young and smiling and willing to help. But this is no Four Seasons by any mean ! SITUATION-situation-situation !!! It is all about it : right on the beach. Could not get any closer, except perhaps one of the privat beach house at Malibu. Anyone, if you think of a hotel of this standard on the West Coast closer to the ocean than Tower23, please share it with me. The STYLE is great. We are a very traditional same sex couple in our 40s, and we love luxury. We travel a lot. This is a special place : not the most luxurious. There is a nice vibe to it. Plenty of different people mingle, but you can have total privacy and tranquillity(that you would not have in a room right on the deck). The DECK is a highlight, at any given time. For sunbathing, for having a drink, for smoking by the fire pit. Would it be better with a pool ? My partner tends to think so, I personnally prefer the space. The UPKEEP is amazing. Despite an oceanfront situation, the whole place is immaculate. Not a glitch or a hint of ageing. They do a great job at that. HOUSEKEEPING is fantastic. I do not generally rave on housekeeping and how fantastic a clean room is; it should be standard in any accomodation, let alone a premium accomodation. But everyday, these guys clean thewindows and the glass balcony, so that he view is not spoilt. Worth mentionning, especially in the perspective of the poor job most urban luxury hotels do. The RATES; not cheap of course, but they come down year after year. Business must be slow. Breakfast food is good. Not terrific.But good. Although we got tired of the limited choice after a couple of days. And having breaksfast on the balcony is great. DIRECT ACCESS to the beach is extremely convenient. What do we dislike ? VALET PARKING is a rip-off. Given that free parking is very limited, and this is no San Francisco, they hot hard on that. Mind them, business was so slow that we managed to park free on the roads every time. CLOSED RESTAURANT until 11.00 am. So we had breakfast on the balcony. Which was great. Holding our plates on our knees was a disgrace. It as last year, and still is this year. So please guys, open up earlier for breakfast, or bring in a table ! DIRECT ACCESS from the beach is no more possible. They removed the opening device. Most unconvenient when you want to walk to the deck with a cigar. NO ACKNOWLEDGEMENT of returning customers : a bottle of something would not really hurt. They do that in other hotels where we go (Hotel Bel-Air, ...). Would we return ? Looking forward to !", "Date": "October 7, 2009"}, {"Ratings": {"Cleanliness": "3", "Overall": "3.0", "Rooms": "1", "Value": "1", "Location": "2"}, "AuthorLocation": "Dana Point", "Title": "“decided not to stay”", "Author": "kka57", "ReviewID": "UR45615729", "Content": "We booked and un-booked the last serenity room on the floor with the public deck. No serenity there. It is however perfect for a party. The deck outside your room is just feet away. NO view and No way worth the price. Very very busy place lots of bars and activity.", "Date": "October 1, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "2.0", "Value": "1", "Location": "4", "Rooms": "1"}, "AuthorLocation": "Auckland", "Title": "“Great service let down by poor building”", "Author": "mjs_nz", "ReviewID": "UR45454906", "Content": "We stayed at this hotel during a trip around the west coast. Had goodservice from all the staff however would not stay at the hotel again. This hotel although reasonably new just seemed to have really badly designed rooms and had a cheap interior feel for the price. Walls didn't block out sound from the rooms next door (we could here people talking with pretty much no problems), bathroom door didn't shut properly = no privacy in the bathroom, sharp wood surrounds on the bed and the desk chair had legs that were easy to trip over. Part of the bathroom sink also broke so just added to the overall feeling of lack of quality.", "Date": "September 29, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Florida", "Title": "“Best hotel for a getaway with friends - loved everything about it!”", "Author": "mightaswellbaby", "ReviewID": "UR45329959", "Content": "I stayed here for several nights in early May with a large group of friends - we occupied almost every room on the \"Pool Deck.\" I can't recommend this hotel enough - great location, great staff, great rooms, great food and drinks, etc. The rooms are large, modern, clean, and extremely comfortable. Rooms on the 2nd floor have sliding glass doors that open directly to the Pool Deck - each room has a small sitting area outside with sheer curtains for privacy, if needed. We spent each day lounging in the chaises overlooking Pacific Beach (awesome people-watching!), went out at night, then returned to sit around the fire pit on the deck late at night. \"Room\" service was fantastic - we had drinks and food (and more drinks...) delivered up to the deck - and Zack went above and beyond to take care of us (thanks Zack!!). Food from JRDN was excellent and provided a unique alternative to standard hotel room service. Every aspect of my stay far exceeded my expectations, and I can't wait to go back - this is the perfect way to enjoy Pacific Beach!", "Date": "September 28, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "san jose", "Title": "“the best servise i have ever had in my life”", "Author": "Remon408", "ReviewID": "UR37165003", "Content": "It was my brithday weekend and my Fiance want to take me out we didnt know the area but (Sanan Hanna) works for tower 23 gave us the best advise of where to go and what to eat where to rent boats and every thing that you have to resarch he had it on his finger tips. He was eaven able to help my fiance to get me a surprise cake for my birthday i really thank him and the hotel management for a great staff keep up the good work", "Date": "August 9, 2009"}, {"Ratings": {"Service": "2", "Cleanliness": "4", "Overall": "3.0", "Value": "2", "Location": "4", "Rooms": "3"}, "AuthorLocation": "Nyc", "Title": "“Disapointing”", "Author": "NycM26", "ReviewID": "UR35383021", "Content": "My husband and I just returned from a week long trip to SD. We split our time between T23 and the Loews in Coronado. I was hesitant to stay at the hotel because there was no pool , however I liked that it was right on the beach. I think my husband was a little shocked when we pulled in since the hotel is literally in the back of a parking lot. After checking in we were told that there would be a party out in the deck area. What the front desk failed to mention was that the \"small party\" was basically an open party to all of pacific beach. So after a long flight from NY we couldn’t even relax on our balcony because there was essentially a wet t-shirt contest going on below us. Needless to say not the kind of thing you expect from a hotel that charges upwards of $250 a night. We kindly asked the front desk to move us just for the night to an ocean front room. This way we could at least relax without having to deal with the blaring music, since our room overlooked the deck area. They told us of course we would be able to do it for another $80 a night. That really set me off because they should put the comfort of their guest first., as the money wasnt the issue for us. When the party finally ended after 6, we went back up the deck area which was by now a mess and it seemed that all of the other hotel guest began emerging from their rooms also. Our next few days at T23 weren't as bad, they sent us up some free champange which was a nice effort. The food at JRDN is very good and, the view from the deck of the beach is A+. The server on the deck Drew was great and extremely attentive, he was as attentive as I thought the rest of the staff at T23 should have been. The hotel is close to La Jolla which is nice if you want a change of scenery. My last complaint about T23 is that on our last day there was a foul mouthed hotel employee who was getting wasted with one of her friends on the deck . Apparently it was her day off and she was using her discount ... I wasn’t listening to her conversation she was just that loud that I couldn’t help but overhear. Overall Tower 23 is a bad imitation of a trendy Miami hotel, ,they definatley need to train their staff on the art of hospitalty. They should limit hotel areas to the enjoyment of paying hotel guests.", "Date": "July 21, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Las Vegas", "Title": "“Our new favorite hotel”", "Author": "pete_wendy", "ReviewID": "UR35183123", "Content": "This hotel was perfect. It was clean, spacious, and the Tempurpedic beds were very comfortable to sleep on. The staff was friendly and we were greeted with two cocktails when we checked in. We had an ocean front room with a balcony which was definitely worth the extra cost. We never wanted to leave! The hotel is absolutely gorgeous. The ocean front rooms were a long walk from the lobby, but that didn't really bother us. The only thing that might be a drawback is that the balconies are very close together and there isn't much privacy. Luckily there was no one staying in the room next to us while we were there. A smoking neighbor could get very annoying if you are a non-smoker (the rooms are non-smoking but people were smoking on the balcony). Nice bathtub and sink from Kohler, although the sink was a tiny bit higher than we are used to. No complaints.", "Date": "July 19, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Location": "4", "Rooms": "5"}, "AuthorLocation": "Manchester, United Kingdom", "Title": "“Great Hotel - Recommended”", "Author": "danieltjames", "ReviewID": "UR33305455", "Content": "Tower 23 is a cool hotel in a nice location. There are plenty of bars and restaurants close by. The room we had had a balcony with sea view which was worth the extra cost. Plenty of goodies in the room and very comfortable bed. Welcoming staff and concierge. Nice restaurant attached to the hotel which had decent good value food. The bar within the hotel is a popular destination in the evening.", "Date": "June 27, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "3", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Denver CO", "Title": "“Can't beat the location”", "Author": "Simon14", "ReviewID": "UR31775726", "Content": "The rooms I think were average, but very clean, and the beds were really comfortable - We had a surf pad looking directly over the ocean, beautiful. I recommend getting a room with the ocean view, it's worth it. We sat on the balcony and people watched and read, it was really nice. We were on the south most side of the hotel, the farthest from JRDN, which on some evenings can get pretty noisy. We only heard a little bit of music one night, not bad at all. We were there during the week however, I understand it can get pretty noisy on the weekend. The hotel is also very close to Seaworld and San Diego Zoo. The San Diego Wild animal park is about 30 miles away, but really worth going to. It was really enjoyable, splurge on a photo safari. One thing to remember is there is no pool at this hotel, this is usually a deal breaker for me, however, because of the location right on the beach, and there is a patio with some water features and heating lamps for chilly evenings we went ahead with staying here, and it was a really nice experience. A side note: Stay away from Anthony's Seafood Grotto on the harbor, it was horrible food.", "Date": "June 7, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Scottsdale, Arizona", "Title": "“We WILL be back!”", "Author": "DLB7031", "ReviewID": "UR31519083", "Content": "We can't begin to describe our stay at Tower 23. From the moment that we walked in to the lobby to check in, to the moment that we checked out, we had a wonderful experience. We stayed in a \"Surf Pad\" room with a 2nd floor balcony that looked out over the ocean. It was a birthday celebration that the hotel recognized with a complimentary room service appetizer and dessert tray. A perfect location to be able to walk to good restaurants, and short drive to La Jolla restaurants, and Gaslamp restaurants.", "Date": "June 3, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Chicago", "Title": "“Perfect for Honeymoon”", "Author": "MMChicagohearts", "ReviewID": "UR31224290", "Content": "PROS: -Rooms were very clean -Staff was extremely friendly, quick, and accommodating -We got complimentary sweets upon telling staff that it was our honeymoon -Food from room service and restaurant was AMAZING, probably the best we ate in San Diego -We stayed in the Spirit Pad room and the Sanctuary Suite; both were spacious and fabulous. -Whirlpool in suite was clean and relaxing. -Location on the beach is beautiful and convenient; the Pacific Ocean is in the hotel's backyard! CONS: -Parking was $20 a night, and the only options were the paid hotel parking or street parking, which were mostly tow zones. WEIRD: -Bathroom doors didn't lock or close all the way by design; they were open an inch or two - meant for romantic couples only! -Waterfall feature in the Sanctuary Suite whirlpool; neat at first, but got annoying fast Overall, we had an excellent experience!", "Date": "May 31, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Location": "5", "Rooms": "4"}, "AuthorLocation": "NYC", "Title": "“Great Experience”", "Author": "neumanennt", "ReviewID": "UR30999809", "Content": "On a recent trip to SD, I planned to propose to my girlfriend. I reserved the Sweet Suite and Tower23 took care of me very well. They were happy to provide and plan for me, roses, petals, candles, choc covered strawberries, and they even set the jacuzzi tub up at just the right time for our surprise, it was amazing! Elizabeth was especially helpful and pleasant.", "Date": "May 28, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Chicago, Illinois", "Title": "“Even the locals go there to get away”", "Author": "SMBMAK", "ReviewID": "UR27067718", "Content": "During our stay at the Tower23 Hotel, we met several people from the San Diego area who were staying there as a local getaway. The hotel is quite unique in the area and was a great place for our family of four. We booked two connecting beachfront rooms and the view is incredible. Some of the beachfront (\"surf pad\") rooms overlook the courtyard (ours did) so be specific in your request. It was quiet on the deck while we were there but I'd imagine summer weekend evenings would be loud. We liked looking out over the deck with its seating area and fire. Many of the rooms open directly onto the patio - some like it that way, some don't. Again, ask in advance. The rooms are what you might expect at a trendy hotel. Well-appointed but somewhat minimalist. The beds were great and baths very nice. Not much space to store clothing and with just a couple wall sconces in the room, don't plan on reading in bed too easily. The staff was great and extremely responsive to any request. They knew the area well. While we were at the hotel, breakfast wasn't available (I'd suggest you skip the \"breakfast\" package - basically yogurt and granola). However, Kono's is next door and it's GREAT! We started every day there.", "Date": "March 29, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "3.0", "Value": "2", "Location": "5", "Rooms": "1"}, "AuthorLocation": "BC, Canada", "Title": "“Don't stay here if you like quiet rooms at night”", "Author": "lookinforsun50", "ReviewID": "UR26700466", "Content": "The beautiful scene and lovely room balance my opinion of it to average as the noise was very frustrating. You can hear doors slam, and people talking from down the hall or below/above you. If there are late night patrons (there were every night), you can hear them until the wee hours.", "Date": "March 23, 2009"}, {"Ratings": {"Overall": "1.0"}, "AuthorLocation": "Round Rock Texas", "Title": "“No support for our troops!”", "Author": "cmiller68", "ReviewID": "UR25227606", "Content": "As a 21 year military veteran of the armed forces, I emailed the hotel to inquire about discounts, specifically military discounts. I was told that, and I quote, \" Unfortunately we are a boutique hotel and do not offer a military discount\". I'm certain this hotel offers discounts to various companies and organizations. It's a shame they can't do the same for our US military veteran's,.", "Date": "February 26, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "3", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Stafford", "Title": "“Unbelivable,Hotel Like No Other!!!!!”", "Author": "RileyStafford", "ReviewID": "UR24109673", "Content": "This Place was amazing. I had booked it through Booking.Com, and got a decent rate of around $199 a night. The Hotel was to be a surprise as part of our Honeymoon, and it did not disapoint us!!!! On arrival, we were checked into a wonderful room, and were lucky enough to catch the sunset, which was \"awe inspiring\". After this we had a meal in the restaurant downstairs, which was very expensive, but worth it just for the views, and cool atmosphere. As the other reviews state, there was a deck upstairs, and after dinner we sat upstairs, and spent the rest of the night there it was brillant!!!!! Yes it was expensive, but worth every penny!!! A great place for a romantic weekend, or a couple on a Honeymoon. We even had champagne served to our room, as they had heard it was Honeymoon, when they heard us talking upon check in!!!! Go here, it was awesome!!!", "Date": "February 2, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Los Angeles", "Title": "“The Fabulous Tower23”", "Author": "kjsand", "ReviewID": "UR22842627", "Content": "A couple of weeks ago (Dec 5th, 08) my boyfriend surprised me for my birthday by booking a room for the weekend at the beautiful Tower23 in San Diego. As a native of the often busy and sometimes chaotic Los Angeles this couldn’t have been more perfect. Upon arrival we were immediately tended too by a wonderful staff that was quick to make sure we had everything we needed to make my weekend memorable. This was definitely accomplished by the added extras that were put together by the staff to adorn the room in celebration of my birthday. As we walked into the room I found a great tasting bottle of wine, balloons and about six different deserts. The room itself was simply lovely. We had the perfect view of the ocean which allowed us to enjoy the beautiful sunset along with the great sounds of the waves. The size of the room was perfect for my boyfriend and I and the bed was like sleeping on a cloud. We slept like babies. The hotel also has a great restaurant where we enjoyed a romantic dinner with a view of the ocean. Here again the waiter and accompanying staff were very attentive and pleasant. After dinner we had a couple of drinks at there outside deck which had a fire pit and nice lounge seating. Overall my birthday weekend was perfect. Great company, awesome food, a fabulous room with the perfect view, what more could a girl ask for. As we woke to the music of the waves, it was a bit sad to know that I would soon be leaving the tranquility of our hotel room and have to go back to the craziness of LA. I will definitely stay again. Thank you to the staff such as Elizabeth Hermosillo the hotel manager who gave my boyfriend great suggestions which helped him plan the entire trip. The girls at the reception desk were great and our waiter Tom was awesome. He too made great suggestions for our dinner that night. In my travels I have found that a hotel is only as good as its staff. At Tower23 my boyfriend and I had a fabulous weekend and I believe it was partly due to the excellent staff who were always very attentive and courteous.", "Date": "December 19, 2008"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "London", "Title": "“The Great Tower 23”", "Author": "Anthony220383", "ReviewID": "UR22559007", "Content": "3 friends and I decided to take 3 weeks out and venture on a mini road trip around the west coast of the states. We began in New York and flew over to L.A, from there we drove to San Diego where one of my friends had booked 2 rooms at Tower 23 hotel. From the moment we arrived we were all taken away by the epic view overlooking Pacific Beach. The sun loungers and water fountains added to this exotic feel, creating a sense of surrealism. The rooms were incredibly spacious and immaculately presented. Upon arrival we were warmly greeted by a charming young lady on the reception desk who i remember by her name badge was called Rochel. She checked us in and even called us once we were in our rooms to make sure everything was ok. The restaurant and bar offered an array of well cooked food at a pleasant price, which suited us just fine. Overall the stay was by far the best we experienced in the USA, its just a shame that the most exhilarating aspect of our time in San Diego was our visit to sea world. Oh well there's always next time!!", "Date": "December 8, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Miami Beach, Florida", "Title": "“An amazing and wonderful time at the Tower 23!”", "Author": "CloieForkers", "ReviewID": "UR22422865", "Content": "A truely delightful trip! My boyfriend surprised me with a trip to San Diego. He choose this hotel because it was up scale, and on the beach with a spectacular view of the ocean and the Crystal Pier. The service was impecable both in the hotel and the restaurant. Although we were dissappointed that we could not have breakfast in the wonderful restaurant, JRDN, the food was delicious! The service in the hotel was enchanting, especially from Sabastian. His extradinary guest service and his polite approach made us feel very special and well taken care of! We needed suggestions on what to do and see while we were there. He was very helpful in pulling out his sheet with all the sightseeing in San Diego, and directions on how to get to them. We followed his suggestions to see Point Loma and the Cabrillo Monument, & the little city of Ocean Beach. We also visited Balboa Park and all the lovely museums. We finished our day with a lovely dinner in Old Town. Viva the margarita! We highly recommend this property and all of its special service.", "Date": "December 3, 2008"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "newyork, ny", "Title": "“brilliant hotel”", "Author": "emilyinusa", "ReviewID": "UR21886120", "Content": "We only spent 1 night at Tower 23, but we would have happily spent a week. it's right on a beautiful beach with a gorgeous terrace - with plenty of comfortable sofas, lounge chairs and a beautiful fire pit for the cool evenings. we sat out and watched the sunset on the Pacific - the staff were very attentive - even serving us dinner outside under the heat lamps. the room was very modern & trendy - lovely shower & very clean. i would recommend getting a room with a sliding door out to the terrace. the locale is great for walking, surfing, biking, swimming or just people watching. we can't wait to go back!", "Date": "November 15, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Los Angeles", "Title": "“Best Hotel on the Beach in San Diego!”", "Author": "ShutterbugLA", "ReviewID": "UR21580914", "Content": "This is a lovely boutique hotel right on the beach and the perfect place for a get away weekend from Los Angeles. I stayed here over the Columbus Day weekend for a little R & R and a chance to unwind by the beach. I can't recommend this hotel enough! I give the staff high marks on customer service. Everyone was super friendly and helpful - valet, front desk, housekeeping, waiters. I agreed with the other reviewer, Sabastian was great to us. We looked pretty lost trying looking at our CA map for Balboa Park and he stepped right in, pulled out a cheat sheet for getting to local attractions from the hotel, highlighted the hotel numbers and asked us to call if we needed anything. We didn't even ask, he stepped right in just handled it (luvthat!). This hotel is in a great location for recreational activities. There's a very nice bike path all along the beach so bring a bike or rent one across the street for $20. They have a bike rack in the garage. In the evening throw on a sweater and go sit outside by the gas fire pit on the patio overlooking the ocean. You can't beat the sound of the ocean waves, salty air, starry sky, and a drink from the bar downtairs. The rooms are decorated in a clean modern design and i loved the crisp white linens they change every day. The room was also equipped with an xbox but I was too busy unwinding i never bothered to ask for some game time. I'll be back soon for another three day weekend!", "Date": "November 6, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Business service (e.g., internet access)": "3", "Check in / front desk": "5", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Bellingham, Washington", "Title": "“Beautiful Pacific Beach Location”", "Author": "cmkw", "ReviewID": "UR20673575", "Content": "This is a beautiful, boutique hotel. We stayed 2 nights in the Oceanside Surfpad room - we left the door open all the time to hear the surf crashing.... The room is very comfortable, modern and airy feeling. The bed was a SUPER comfortable Tempurpedic mattress. The only thing I find missing and desperately wanting was an in-room coffee pot so I could linger in bed and hang out on the deck in the morning. The restaurant Jordan was excellent although a little expensive. If you like living like a local - I would recommend having a beer at the 710 Beach Club around the corner and for another tip go to Cass St. Bar and Grill for beers and their grilled fresh fish plates....", "Date": "October 6, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "4", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Irvine, CA", "Title": "“Great Boutique Hotel in Pacific Beach”", "Author": "dfaler", "ReviewID": "UR20285039", "Content": "Tower23 is a very Clean and Modern Boutique Hotel in Pacific Beach. It definitely has the South Beach feel to it, in vibe and appearance. The rooms are very clean and simple with very comfortable beds. My wife and I did not want to get up in the morning. It has private balconies that have white curtains that blow in the ocean breeze. The overall experience was very nice.", "Date": "September 22, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "4", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "San Diego", "Title": "“Amazing!”", "Author": "PickySanDiego", "ReviewID": "UR19968596", "Content": "I was recently married at Tower 23. It was an unforgettable event. The service was impeccable. The food at JRDN was out of this world. The view from our room was breathtaking. We had many guests from out of town that stayed at the hotel as did we. At every single turn we were greeted by professional staff that went above and beyond all of my expectations to help us accomplish everything we needed. I live in San Diego and really could have had my wedding at any number of beautiful locations but I am so happy we decided to have it at Tower 23. I would highly recommend this hotel and their restaurant, JRDN, to anyone that wants a sophisticated, relaxing vacation, or just a dinner you will not soon forget.", "Date": "September 10, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "China", "Title": "“We want to come back”", "Author": "ChinaXiaobao", "ReviewID": "UR19400381", "Content": "My parents and I did an America tour in June andstayed in many Hotels through the country. Tower23 was our favoriteHotel (we stayed there for 2 nights). Everyone of the staff memberswere very friendly and helpful and were patient when I had to translatefor my Parents. The Hotel is very clean and design. The food in therestaurant was the best we tasted on our trip. I really want to go backsoon and sit on the \"tower deck\" and watch the surfers. Very relaxing!", "Date": "August 26, 2008"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Check in / front desk": "3", "Overall": "1.0", "Value": "1", "Rooms": "3", "Location": "5"}, "AuthorLocation": "London", "Title": "“Ridiculously Overpriced !!”", "Author": "Faffey", "ReviewID": "UR18221657", "Content": "We stayed at the Tower23 for 2 nights in July. We booked it as a last minute relaxing location as we have been traveling north america and were in need of some R&R. We found the Tower23 on trip advisor and after all the glowing reviews went ahead and booked. At an average of $300 a night we were expecting ALOT more than what we got. Of course the 1* status we have listed it as is not accurate, I would state 3* to be closer but we felt it needed to be given such a low rating to make people aware!!! DO NOT WASTE YOUR MONEY! The rooms claim (and appear on the website) clean cut, modern and simple when in fact they could be more accurately described as white washed walls with self assembly furniture from Ikea. We could not believe that a hotel with this price tag did not even have shower units, just an over bath shower with a pull around curtain! The room was clean, however furniture looked old and delapidated, not fitting in with there \"chic, modern\" style it was trying to achieve. On first checking into our room we found that our \"partial sea view\" in fact meant looking onto the roadside. Unhappy with this we called down to switch rooms, they offered us another Sky suite (which is what we booked) or an upgrade to a Surf pad, for the EXTRA COST of $40 a night. We swtiched to the other sky suite not wanting to waste more money on our stay, which looked onto the patio deck, which looked onto the sea. (All of which is to be expected from a hotel, however when waiting at reception to ask a question we overhear someone checking in later than us, getting upgraded to the surf pad FREE OF CHARGE!) The staff were generally nice and pleasant. Nothing more nothing less. Because we have stayed in so many hotels for the past 2 months we really expected something special from the tower23, it simply did not deliver. You are paying for a moderate room, but a great location, and that's the only reason they get away with the price.", "Date": "July 24, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "4", "Check in / front desk": "5", "Overall": "5.0", "Value": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Auckland", "Title": "“Relaxation with style”", "Author": "ThewanderersAuckland", "ReviewID": "UR18160894", "Content": "We found this hotel quite by accident. And we are please to report that it was a very happy experience. We had been travelling for about 2 months prior and were ready for a chill out and relax period by a beach in the sun and the location of Tower 23 fitted this requirement perfectly. We stayed for 5 nights in one of the rooms overlooking the sea. (and above the restaurant). The room itself was was very sylish and contemporary and we loved sitting on the balcony watching the world go by. We found it was a real bonus having such a great restaurant in the hotel and also had food delivered to our room. We had great service from pretty much everyone we encountered. There was some noise from the restaurant in our room but this stopped around midnightish and we didn't find it a real issue at all. Overall we thoroughly enjoyed our stay. C & A Loader, Auckland, New Zealand", "Date": "July 23, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Toronto", "Title": "“A Bit of Wonderful!!”", "Author": "BeenAroundFolks", "ReviewID": "UR17264347", "Content": "What an incredible place to spend a few days, or more! From the word go it was terrific. I liked the lack of pretentious superiority so many higher end hotel staff like to throw your way. None of that here. The staff just wanted to help and be accommodating. Our room was wonderful. Minimalist, think \"W\" hotel style. Its very best feature was the private balcony overlooking the ocean. We slept at night with the windows open listening to crashing waves all night. Heavenly! Don't know what kind of bed it was (should have checked) but it and linens just perfect. Seldom when travelling do I feel at home as much as I did in their bed. The scallops served in the hotel's signature restaurant JRDN are amongst the best I've ever had. The room service breakfast equally wonderful. I might suggest doing what it takes to get a room with the ocean view. The interior rooms without just didn't appear anywhere nearly as compelling. The location of the hotel is perfect too. Literally just a few steps to the beach. The hotel is right in the middle of the action too. Just behind it is a supermarket for mixes, wine, whatever. Lots of life but not rowdy, felt perfectly comfortable night and day. Higher end beach scene going on here. Surfers out day and night. Stroll on beach, on walkway above, or along shop sidewalks. Valet parking quick and courteous. Check in informed and efficient. We had a package affair with my name personalized onto each appropriate voucher. Nice touch. As it is a popular night spot as well if you want to take advantage of sleeping with balcony doors open I'd also recommend requesting a room on the beach south end of building as the noisier action below is at the north end of the hotel building. Although I've stayed at fancier hotels, I am hard pressed to think of an overall hotel experience that I've enjoyed more. No doubt it was expensive but I think it was good value for money. Often I think that I've overpaid and not received what I expected for my hotel dollar. Not here. Highly, highly recommended. You'd almost think I have some ulterior motive, and I don't. It is just nice to see a no-name independent hotel put such a good foot forward.", "Date": "June 26, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "San Diego", "Title": "“Sanctuary Suite was just that...”", "Author": "suite_escapes", "ReviewID": "UR16711249", "Content": "My boyfriend surprised me with a romantic stay at Tower23. Our experience, starting with a quick check-in, was very positive. We stayed in a Sanctuary Suite...king size bed, that you sink into, huge bath tub, ocean view, plasma mounted on the wall, and even an X-Box. Needless to say, we had a great time! Make sure to try the sushi at the restaurant and/or breakfast in the patio. This is a great place to stay when you want to get away for some R&R.", "Date": "June 6, 2008"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Check in / front desk": "2", "Overall": "3.0", "Value": "1", "Rooms": "3", "Location": "5"}, "AuthorLocation": "arizona", "Title": "“Overpriced!”", "Author": "dtracyaz", "ReviewID": "UR16684498", "Content": "We stayed here for 2 nites...that's about all we could afford! We were shocked at the price they get. The rooms are nicely appointed, but certainly not for the price. The overall feel is pretty snotty, which does not go with a beach atmosphere! We have stayed in the past at Capri by the Sea, but it was sold out. We will definately stay at Capri in the future. For LESS money you get a 1 or 2 bedroom condo with a full kitchen! SAME VIEW! If you are concerned with price, this is not the place for you. Just go North a few blocks to the Capri, you'll be glad you did.", "Date": "June 4, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "4", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Halifax", "Title": "“Awesome!”", "Author": "Bastfx", "ReviewID": "UR14653278", "Content": "Tower 23 is a beautiful boutique hotel on Pacific Beach in San Diego. The service is good, the breakfast delicious, and the staff very attentive, professionally courteous and available if needed. This was refreshing in many ways! The accommodations are first rate, modern, hip and very comfortable. The sweetest part of Tower 23 for us was the large deck overlooking the beach. Lots of heat sources for those cool March nights (propane fueled fire pit) and well served in the day time with comfortable lounges. The location of Tower 23 is wonderful if you simply want quality accommodations and beach front location. The night life can suit middle age people like us, but there are a lot more bars etc., for youth. (I would not go to this beach anywhere near spring break.) The area feels safe for walking about in the evening, whereas in the daytime, walking the beach and watching the surfers is simply wonderful. Highly recommended!", "Date": "March 30, 2008"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "Elk Grove, CA", "Title": "“Fabulous hotel, superb customer service, and very accomodating!”", "Author": "playfulpastimes4u", "ReviewID": "UR14448814", "Content": "My family and I had an exceptional experience at Tower23 Hotel! They made our first visit to San Diego an unforgetable one! The first night that we checked in, the whole family was exhasted from an early morning flight and an afternoon spent at Sea World. Manuel, the VERY polite and accomodating gentleman that greeted us at the front desk, went WAY above and beyond the customer service that I would ever expect anywhere (and I'm VERY big on service!). It was late, and we really didn't want to go outside of our hotel room, but some how and some way, we still neded to feed our children...lol. So, since the dining room/kitchen was closed, Manuel offered to walk to any of the surrounding restaurants to get us food and then offerer d to deliver it to our room! In the mean time, the kids fell asleep (and wouldn't wake up to order), I still felt that Manuel's sweet and friendly gesture was over the top NICE and definitely set the positive vibe of our whole trip to San Diego and stay at Tower23 Hotel!!!! Thank you so much, Manuel, you are the best and you definitely should be rewarded! We will definitely return!!!! ~Jennifer Pawlak", "Date": "March 22, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "San Diego", "Title": "“Very Clean, Very Modern, Great Service, And Amazing View”", "Author": "Juan_Vera", "ReviewID": "UR14439623", "Content": "Stayed for one night on our 5 yr anniversary(march2nd) in the sancturary suite... I give it a complete 5/5! I would recommend to anyone looking for a short/long gateway. very Clean, very modern, and cannot beat the view...", "Date": "March 21, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Business service (e.g., internet access)": "4", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Visalia", "Title": "“Amazing Relaxing Time”", "Author": "daydreamer291", "ReviewID": "UR14284280", "Content": "March 9th 2008 Reviewed: Nothern Califonia Girls My sister and I stayed there for two days and will definatly be back. The Ocean views were amazing. They have a patio that you can hang out on and have drinks and it is for guests only. If you want to mingle there is a restaurant and bar below. We mainly hung out on the patio and just watched the waves and people pass by. It was exactly what we needed. It is very close to restaurants and shops, within blocks. It was also just enough out of the way the you weren't in the heart of Pacific Beach and all the bars but could walk 4 blocks and be there. We did eat at the restaurant Jordans one day for lunch and the food and service were wonderful. They serve Sushi at night but we never got a chance to try it. Our Bellman Randy was very helpful and knowledgable about the area and even filled our ice bucket up for us. The best part of the entire stay were the beds, I have a thing for down comforters and pillows. I usually travel with my own pillow but didn't have to use it. I had a tough time getting out of bed. We will definatly be back, or at least I will anyway!", "Date": "March 14, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Toronto", "Title": "“Perfect SD beach hotel”", "Author": "YClef", "ReviewID": "UR14160833", "Content": "Everything about Tower23 was better than expected. The modern lounge music playing when you enter the room sets the tone for the experience - modern and relaxing. The blend of luxury and location is ideal. Staying right on the PB boardwalk gives you the authentic SD beach experience, but with the comfort and amenities you'd expect in La Jolla. The view from the Surf Pad was stunning and worth the extra money. The service was great...very accommodating but unobtrusive. The tempurpedic beds and flat screen tv's make the rooms feel luxurious. Tower23 is now a must-stay destination for us on our SD trips. The name has become synonymous for us with paradise.", "Date": "March 9, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "4", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "St. Louis", "Title": "“Or experience at Tower23 Hotel in San Diego”", "Author": "jessigrfx", "ReviewID": "UR13999766", "Content": "Our experience with Tower23 hotel was phenomenal, we plan to stay there each and every-time we visit San Diego. I would like to share the exceptional service we received from Tower23 (Erin Brady) in planning, accommodating our guests, and perfecting our destination wedding in San Diego. I contacted Tower23, namely Erin Brady about 6 months before our February 23rd wedding date. We are partial to the pacific beach area (We are St. Louis, MO residents, but I was born and raised in San Diego) and were in search of a hotel that could comfortable accommodate about 25 of our wedding guests that we were flying to San Diego. We explained to Erin that although we planned to host our wedding ceremony and reception on Crystal Pier, we were in need of a hotel for our guests, that would be affordable, beachfront, in walking distance from the pier (Tower23 is literally a few foot steps down the boardwalk from the pier). Erin offered us a room block for our guests that included a great nightly rate, and very flexible reservation/cancellation limits, and BEAUTIFUL rooms. Tower23 is literally beachfront property; the view from your room is the Pacific Ocean, the pier, and the boardwalk. San Diego is captured right from your window or deck. The architecture is a new, modern, and gorgeous building. The rooms are crisp, clean, spacious, and soothing. The beds and linens are so exceptional that many of our guests jumped online to try to purchase the same mattresses and linens for their homes. You can literally melt into the beds for hours. The decks have a clean uninterrupted view of the water, full of lounge chairs, a fire ring, and wading pool and waterfall next to you. It is so spa like and tranquil there, a true vacation. Sure there is La Jolla, and Coronado Island, but really I feel like Pacific Beach gives a much more authentic San Diego experience to travelers. The swimming (and surfing) portion of the beach is directly in front of Tower23, and the hotel in ½ block from Garnet Avenue, which is the best street to hit for restaurants, bars, retail shops, and an authentic beach community. The food at the JRDN (Tower23’s attached restaurant) is awesome, we had the sushi, calamari, steak and fries, and the goat cheese dip, our table was very pleased, we loved everything. Oh, and the drinks, the cocktails are so good, make sure to indulge at least one night on your stay! I want to also make note that the staff at Tower23 was amazing. Erin Brady helped us, kept us updated, reassured me as “the day” approached, and accommodated even our most last-minute guests every step of the way. She was available anytime we needed her. The staff at the front desk accommodated many very unusual last minute needs or ours, and were always very willing to help in any way that they could. Just days before our wedding day we ran into a problem with our hired caterer for our reception at Crystal pier, my mom scrambled last minute to find a back up venue and caterer in case issues worsened, and sure enough Erin was there, ready and willing to help if we needed her. She was the only piece of mind that we had at that point. We had all of our guests come up to us at one time or another to tell us how friendly and helpful the staff at Tower23 was. And again everyone ranted and raved about how clean, beautiful, and comfortable the rooms were. My new husband’s exact words are, “ we will never stay anywhere else.” Thank you Tower23, we cannot wait to come back and visit you.", "Date": "March 2, 2008"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "San Diego, CA", "Title": "“Picture perfect get-away”", "Author": "SoCaliforniaTraveler", "ReviewID": "UR13504098", "Content": "From check-in to check-out, the experience was two thumbs up! The impeccable staff and service proved to be one of the best hotels to stay at on the Southern California coast. The food at JRDN's was exquisite. The view itself made for an unforgettable site. The hotel is definitely on our most recommended list.", "Date": "February 12, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Check in / front desk": "4", "Overall": "4.0", "Value": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Sacramento area", "Title": "“Great location, but slightly overrated!”", "Author": "exfarmer", "ReviewID": "UR13000016", "Content": "Our office Christmas party occupied five rooms for one night, including dinner at the JRDN restaurant on the first floor. The restaurant took very good care of our group and the food and drink was very good. We sat outside and, by adjusting our seats, there was just the right combination of radiant heat and fresh air to suit everyone. This hotel is probably the best hotel in Pacific Beach (certainly not in San Diego), but there were several small things that a hotel in this price range should do better. We had a \"surf\" room that meant the room overlooked the Pacific Ocean. Although the San Diego area isn't overly warm in mid-December, our room was too warm even with the heat control turned all the way down. The central system apparently didn't allow for cooling at this time of year. So our only choice for sleeping was to open the large sliding doors and curtains. This arrangement won't suit those who don't like the sounds of the surf, and the Saturday night boardwalk scene, to drift in. Since our doors were open, unfortunately, our peaceful Sunday morning sleep-in was marred by the sound of passing skateboards on the concrete sidewalk outside. Others in our group had \"surf\" rooms also, but with the added feature of overlooking the second floor outdoor social/firepit area. At least one of these rooms was too warm also but opening the large sliding door allowed in too much of the noise from the crowd outside until the bar/restaurant closed. Our room was clean and modern, if a little spare. The only chair was the straight-back chair for the desk. The shower drain was clogged so much that we had to stagger our showers to give the water time to drain. The lamp over the smallish wash basin hung down directly in front of the narrow mirror so that anyone over about five and half feet tall needed to look to one side or the other to use the mirror. The separate bathtub's water supply entered directly out of a chrome fixture (basically a plate with a hole in it) in the CEILING. (Alternate guess: someone had removed the shower head that might have been there originally). As you might imagine, water falling from the ceiling into an empty tub splashed out onto the floor until the tub acquired an inch or two of water. I've included a picture of the tub's water outlet in the ceiling with the water running. This is a personal preference, but in mid-December we found only an arrangement of red amaryllis in the lobby that might be called a Christmas decoration. Nothing more was in evidence. Overall the Tower23 Hotel is a very nice place. But for the price, the attention to detail was lacking.", "Date": "January 26, 2008"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "Toronto, Ontario, Canada", "Title": "“Beautiful place to hide away for a week!!!”", "Author": "Eyyelash", "ReviewID": "UR12745526", "Content": "First of all let me say that my hubby and I travel often. We get away about 5-6 times per year and all we look for is to truly get what we pay for. We want cleanliness and we aren't into the \"tourist\" stuff that others seek. We both have very demanding jobs and just like to get away to get away from the rat race and do \"nothing\" for the week. Our trip started in L.A. as we wanted to take in two hockey games there (tickets at home are just impossible to get). Our plan was to leave right after those two games and then get down to the San Diego area to watch the waves crash on the shore from our oceanview room and spend some quality time together. When we arrived at the Tower 23, the experience could have taken a horrible turn. The original check-in was done by a male (who shall remain nameless for now) who really obviously couldn't have cared less and who really shouldn't be part of the Tower 23 team!!! He lied to us and tried to give us a room just immediately over the bar/restaurant although we specifically asked what was below us. He advised \"a room\" and fluffed us off and sent us on our way asap! We were extremely early and there was really no reason why he couldn't just put us in a quiet room right off the bat. He told us he could only do it if we agreed to switch rooms during our stay and this was not something we were about to do for the price we were paying. After returning from a nice long walk (rooms are guaranteed by 4pm), we saw that the front desk person had changed and thankfully, we approached Nancy. She immediately took charge of the situation. Having told her that we were looking for quiet time and would be spending a lot of time \"in\" or on the balcony, she quickly changed us to an amazing room on the top floor...just what we had paid for! From that point on, the visit was flawless!!! The rooms are very clean, the amenities are lovely and there are housecoats and lovely linen and towels for guest use. Although we didn't eat in the restaurant downstairs, it looked to be quite well attended by all. There is an amazing rooftop lounging area off the 2nd floor which overlooks the ocean. We saw many people there who spent the entire day and early evening (when they light the firepit and heat lamps) just relaxing and taking in the view. Quite simply, we tried to do what the locals do and ate where locals eat and often picked up and brought the food back to the room so we could eat on the balcony, sip nice wine and listen to the wonderful ambient sounds on the room music player. During the day , we walked down the boardwalk and took in 2 hr strolls. We went out for a couple of \"nice\" meals but Toronto is such a cosmopolitan city that there was really little we could get there that we couldn't get at home. That wasn't the purpose of the trip. This spot is amazing. You can blend in or rent a car and go into the city. We did both and had an incredible time. Once again, cudos to Nancy at the front desk for being so professional from the time we arrived to the time when we checked out!!! We don't often go back to the same spots but this might just have to be an exception!!!", "Date": "January 17, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "4", "Overall": "5.0", "Value": "4", "Location": "5"}, "AuthorLocation": "Los Angeles, California", "Title": "“Loved it.”", "Author": "tinabeeana", "ReviewID": "UR12610630", "Content": "My husband and I stayed here for our Anniversary this year and our stay although short and rainy was wonderful. Tower 23 really helped make our anniversary special. There was even a bottle of sparkling white white and chocolate dipped strawberries sent to our room. We stayed in a Surf Pad room with a beautiful view. Room was quiet, clean, smelled great and the temperpedic bed was very comfortable. The bathroom was great. We had rain shower bathtub and the lighting was very good. We had no problems adjusting the thermostat, watching TV or getting the xBox (which includes the DVD remote) to work. A previous review stated that the TV doesn't show regular programs but we accessed basic cable stations easily as well as the PPV shows and movies. I can't complain about the service. The guy who checked us in wasn't exactly friendly but he was competent and our experience with the rest of the staff was fantastic. Including the staff of JRDN, we had two wonderful meals there. The valet was prompt and friendly.", "Date": "January 14, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Business service (e.g., internet access)": "3", "Check in / front desk": "4", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Schwetzingen, Germany", "Title": "“Amazing!”", "Author": "Thorsten12", "ReviewID": "UR10392036", "Content": "We stayed at the Tower23 and had an absolute great experience! We had a Surf Pad room facing the ocean and enjoyed every single minute there! The rooms are really comfortable and the bed is just amazing! Excellent Value! The service was also very good!", "Date": "October 28, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "4", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "London, UK", "Title": "“Life's a beach”", "Author": "Slip_Advisor", "ReviewID": "UR10346879", "Content": "A white, almost cubic, comtemporary building, Tower23 is slightly monolithic within its surroundings, which appeared to be more laid-back and relaxed (young surfer crowd). The reception staff were very helpful on arrival, and even provided an automatic upgrape to the 'Surf Pad', a twin room with views of the ocean. The rooms were very clean, spacious and comfortable, especially the bed, which was of orthopedic standards. We stayed on the 2nd floor, which meant our balcony led out onto the roof garden, where the fire pit is kept aflame all night. The bathroom is also contemporary, with a rainfall shower, but no bath. The bathroom door is a sliding door, but was not too much of a problem in regards to privacy. I would definately recommend this hotel to anyone, especially young singles, or couples. The rooms are superb, the service is welcoming and the area is perfect for a San Diego holiday by the beach,", "Date": "October 26, 2007"}, {"Ratings": {"Service": "1", "Cleanliness": "4", "Check in / front desk": "3", "Overall": "1.0", "Value": "1", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Torrance", "Title": "“Noisy and bad management”", "Author": "TravelMeow", "ReviewID": "UR10234531", "Content": "My husband and I went for a quite romantic get-away. Next door was having a party from night to dawn, we called front desk to complain about the noise. Nothing was done!!! In the morning, when we checked out again , we again complained about the noise and lack of sleep and poor experience we had. Mangerial staff did not come out and apologize. They took the ridiculous parking fee off. Overpriced, poor management. Don't go.", "Date": "October 22, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Arizona", "Title": "“Wonderful Modern Hotel in Classic Beach Setting”", "Author": "Challenger007", "ReviewID": "UR10128934", "Content": "Unexpectedly pleased with my recent stay at T23. It is a refreshingly high value modern hotel experience with all the key amenities located in an older Pacific Beach/ Mission Beach setting. This part of town can be dicey, but was cleaned up and given a fresh lease on life for the 21st Century. I really enjoyed the food despite the noisy weeked bar scene. The kitchen delivered exceptional dishes Breakfast through Dinner. The only hiccup-reconstituted OJ!! All told a great spot, great food, great service and certainly well under value for the experience. Added bonus...Pet friendly for your well mannered animal companion. Love the blowy drapes surrounding the deck-and the groovy outdoor fireplace overlooking the beach and Crystal Pier.", "Date": "October 18, 2007"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "Phoenix, Arizona", "Title": "“Tower 23 is the place to stay in PB!”", "Author": "Compasso", "ReviewID": "UR8114307", "Content": "My wife and I stayed at Tower 23 over the 4th of July and the stay was fantastic; the room, the location and staff exceeded our expectations. The rooms are modern and spacious (see photos) and the property is clearly the nicest and newest addition to Pacific Beach. We had dinner in Jordan (the hotel's only restaurant) and the food and service was enjoyable; glass partitions separating the diners from the boardwalk provided terrific, unobstructed views of the Pacific Ocean and the activity. The hotel's atmosphere is lively and relaxed, encrusted with a hip decor and eclectic clientèle. The hotel is not for those looking to save a few $$ as the rooms (+/-$400) and dining are costly, but the experience will yield a nice dividend on your investment. The noise from the boardwalk can be a little loud, but the hotel has installed large, double-paned, glass, sliding doors that filter out the noise. Overall, great place-I would highly recommend Tower 23.", "Date": "July 13, 2007"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Check in / front desk": "4", "Overall": "2.0", "Value": "2", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Las Vegas, NV", "Title": "“Upset about Tower 23”", "Author": "blondegirl1122", "ReviewID": "UR7935447", "Content": "This hotel is very close to the beach, however my stay was just mediocre. The room was okay, but did have a nice view. My major problem came upon checkout. My bill had charges on it from the restaurant downstairs. I had never eaten at this restaurant, and the name signed on the check was not even close to mine. The people at the front desk acted like they were still going to charge me. I was very upset and will never stay at this hotel again.", "Date": "June 19, 2007"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Business service (e.g., internet access)": "4", "Check in / front desk": "3", "Overall": "4.0", "Value": "3", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Chicago, IL", "Title": "“Hip but Unassuming... if that seems weird”", "Author": "CkWillTravel", "ReviewID": "UR7836259", "Content": "Tower 23 was a very hip little hotel, but also felt very laid back. Not as though we couldn't walk in if we weren't feeling fancy. The location is right on the beach which is fantastic and there's a great, great breakfast place down the street (Kona's). We still remember that breakfast! There's a pier within a very short walk where you can watch the surfers and fishermen. It was perfect for soaking up the atmosphere of PB. The public deck facing the ocean is a great design feature in that it allows everyone to relax and just take in the ocean at sunset (not just those folks who paid big bucks for the ocean view rooms.) Only drawbacks might be that you do need a rental car if you want to go anywhere else in San Diego. At the time we booked the hotel's website wasn't working for reservations, and then when it was it suggested we could have gotten a better deal/room(?) going direct thru them. I wrote and complained but never got a reply. The bar and restaurant staff are very cool and friendly, although it's a little weird that there aren't any sports at all on the bar's TV's. It was a little surreal to be sitting at a bar on the beach and there was *figure skating* on tv.", "Date": "June 11, 2007"}, {"Ratings": {"Service": "2", "Cleanliness": "4", "Business service (e.g., internet access)": "4", "Check in / front desk": "2", "Overall": "4.0", "Value": "3", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Boston, Massachusetts", "Title": "“Tower23: Nice property Which Needs New Managerial Staff”", "Author": "SYNAPSEBoston", "ReviewID": "UR7709135", "Content": "This is an upscale boutique hotel in Pacific Beach which is not readily accesible unless you have a car. It is about $30 from the airport and about the same to downtown San Diego. I was attending a business meeting /convention and was happy to be staying at this smaller property a bit away from it all with good reviews. I had a rental car which costs $20 per nite to park at the property. The rates per nite are pricey so I was expecting an experience consistent with such a rate. I arrived at about 2:30 PM after two long flights ; i travel a great deal and this was the end of a busy travel season . It was a Saturday afternoon and the front desk person indicated that the room was not ready and that they guarantee the room for 4 PM. This is approaching the late side for check in as most hotels are for 3 PM check-in. She asked for my cell phone and said she would call me when the room was ready. She did not do this and I returned after 3:15 PM and asked about my room and another gentleman indicated that my room was ready. While waiting, I saw that there was a wedding party readying for a ceremony /reception apparently at a different venue; but people were milling about by the small courtyard looking out over the beach. When I returned from a dinner meeting at 11 PM , the wedding revelers were now congregated outside my bedroom on the courtyard having drinks and making huge noise which continued until nearly 2 AM despite several calls to the front desk. This is a charming , small property and simply is not designed for such a real time celebration at the expense of guests' sleep. The nite manager was thoroughly inept and the daytime manager with whom I reviewed the matter was very gracious and abated one nite's charge by 50%. But the experience fouled my sense of the place. The bar is hopping and I enjoyed being out for drinks with colleagues on one nite. The restaurant is simply outstanding with beautifully prepared food and staff who are professional across all domains. Rivalled any restaurant experience in great dining places around the country. But the management has to decide whether this is an upscale boutique hotel or whether it is a function hall . The manager made a decision to sell drinks through the nite on the private courtyard the remnants of which I captured on my cell phone camera in the early AM and to ruin the experience of others versus asking the party to move to the very large bar at the other end of the hotel.It was a bad decision on the manager's part and which he never addressed. While the other staff were truly gracious and helpful during my stay, this hotel needs a \"top-down\" managerial review .", "Date": "May 28, 2007"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "san diego", "Title": "“Highly recommended!”", "Author": "jamiedanielle", "ReviewID": "UR7420330", "Content": "One of the best hotels I have stayed in quite sometime, everything was outstanding from the rooms, service and food! We had such a great time and would highly recommend Tower23 to friends, family and anyone looking for a truly exceptional hotel stay!", "Date": "April 23, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Essex, Connecticut", "Title": "“Perfect!”", "Author": "CT-TravelerEssex", "ReviewID": "UR7226343", "Content": "The Tower 23 Hotel in San Diego (Pacific Beach) was perfect. It's very modern/sleek. Everyone in the hotel was very helpful and very friendly. The rooms were great, the \"Tower Deck\" was the greatest - a quiet place to watch the surfers, sunsets and everyone on the beach. They even serve drinks and food on the deck. Had planned to do some sightseeing, but ended up on the Tower deck every afternoon. It's a great location, lots of shops and restaurants nearby. Very relaxing..... I'd go back in a hearbeat!", "Date": "March 26, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "San Diego, California", "Title": "“A diamond on the beach!”", "Author": "Sgoudeseun", "ReviewID": "UR6893548", "Content": "Just finished a 3-day business meeting at the hotel. The service was excellent, the rooms were spacious, and the food was great. The decor of the hotel and rooms are ultra modern and very comfortable. Flat screen digital televisions in the room and free wireless internet make the stay very enjoyable. The restaurant is open and spacious, with excellent food that makes it un-necessary to leave the premises. The PB boardwalk is just out the door for a fresh air walk along the ocean. Although this trip was for business, I would not hesitate to take my wife or family back for some R&R or fun in the sun.", "Date": "March 1, 2007"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Check in / front desk": "4", "Overall": "5.0", "Value": "3", "Rooms": "3", "Location": "5"}, "AuthorLocation": "OC, CA", "Title": "“Good times at T23”", "Author": "retaks", "ReviewID": "UR6849854", "Content": "We spent a weekend getaway at Tower23 and had an awesome time. The location is perfect - good people watching, can hear the waves, lots of things within walking distance. If you stay here, I'd recommend surf pads only. The rooms are small and the decor OK, but the views are beautiful. It's well worth the upgrade! We ate at Jrdn both days and were not disappointed. At night, the bar is very fun and hip. And the food is yummy, although on the pricier side. The only negative is the inconsistent staff. However, we enjoyed the laid back attitude - mostly college and surf kids. I can see how that can annoy some people. The staff responded to all our requests and after several attempts, were able to accommodate us every time. Overall, we had a great time. We'll definitely be back!", "Date": "February 27, 2007"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Business service (e.g., internet access)": "3", "Check in / front desk": "3", "Overall": "2.0", "Value": "2", "Rooms": "3", "Location": "4"}, "AuthorLocation": "around and about america", "Title": "“Never Quite There......”", "Author": "vocular", "ReviewID": "UR6131207", "Content": "Tower 23 really wants to be a world class luxury hotel. It doesn't have a chance. The property is situated in a fine setting: directly along the ocean in Pacific Beach. Its convenient to a lot of tourist spots and the neighborhood surrounding the hotel has some interesting shops and restaurants, all within walking distance. But the hotel itself is a disappointment. The decor, for example, is late American modernism, but the furniture looks and feels like it was purchased at Ikea and assembled by the staff. The hotel advertises free wi-fi, but the wi-fi wasn't working too well when I was there this week. They offered to provide me with a \"better\" speed internet access via a cable connector. But that would cost $12.95 extra a day. Then there's the 42 inch flat screen television. Its a great television. But the batteries in the handset needed replacement and they never got around to it, so I gave up pressing buttons that didn't respond. When I did get the television to work I discovered that it doesn't show regular programs. It offers \"selected television episodes\" of a few shows. But you have to pay for the priviledge. And so the tone is set for the hotel. There are numerous \"extras\" that all nickel and dime you to death. The hotel incorporates a bar/restaurant that is quite nice, but music from the bar drifts up to rooms on the second floor. I walked to the third floor and the music wasn't audible there, so if you go request a room on the third floor. The music also intrudes upon the second floor beach deck. Its a great deck, but the sound of the ocean is almost drowned out (no pun intended) by the hip muzak playing from speakers on the deck. The rooms were attractive and clean. But acoustics were poor. We could hear people talking in the room next door, and footsteps in the room above were thudding along almost all the time. I've stayed places where this was the norm and its fine as long as you know about it and are prepared for it. The balconies are very nice and I spent a fair amoun of time sitting out there watching the ocean. The idea of valet parking is nice but the staff is sllooooooow and request your car at least fifteen minutes in advance. Also, the garage closes around midnight and while they can get your car or park it after that hour its a time consuming and complicated process. For the price ($259 for the surf pad full view room) its not a bad deal. But this hotel desperately wants to be a new york city, soho, high tech hotel on the beach. Its not even close.", "Date": "November 14, 2006"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Check in / front desk": "5", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Olympia, WA", "Title": "“Pacific Beach Gem”", "Author": "teacher34", "ReviewID": "UR6015737", "Content": "My daughters and I just returned from our annual Mother/Daughters trip. This year we chose San Diego. We stayed a bit North in Pacific Beach. We stayed at Tower 23. The hotel is right on the beach. Our room was on the second floor and in a corner, so we had a sliding door all glass wall looking at the ocean. A spectacular view! Also a smaller side window. The beds were wonderful. The room was very roomy. Our room was just above the bar area. The noise on Saturday was pretty awful. On Friday not so bad. On Monday it was great. I would stay here again. Good granola/yogurt breakfast! Very hip place. You have to pay $12 daily for parking. The valets were great! Overall a nice experience in a great location. Lorraine", "Date": "October 26, 2006"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "washington dc", "Title": "“Nicely Suprised”", "Author": "dwardlow", "ReviewID": "UR5959113", "Content": "Having moved from a downtown harbor hotel - Mission/Pacific Beach looked a little run down --- HOWEVER, Tower 23 is tucked away at the beach and is a trendy little hotel. If you've stayed at a W Hotel then this would look familiar. Bed was GREAT. Restaurant was GREAT (dinner and breakfast). We had the partial ocean view on the second floor. It has a great patio area that look toward the ocean. Highly recommend this little hotel. Parking was only $15 a night which is considerably less than downtown. For those seeking the GasLamp dining --- it's only a 20 minute drive at most.", "Date": "October 15, 2006"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "san francisco", "Title": "“Pleasantly surprised”", "Author": "Surferleo", "ReviewID": "UR5779042", "Content": "A friend told me about this hotel and I was pleasantly surprised to discover how much I enjoyed it. I am a native San Diegan who has lived in the Bay Area for several years. I am always on the hunt for a new place to stay when I \"come home.\" Tower 23 is my new favorite hotel. The rooms are large and very comfortable. This is NOT a family hotel, but very nice for singles and couples. The staff was very helpful and friendly. When I had a very rowdy crowd keeping me awake next door, the hotel clerk and the security guard came to the offender's door and took care of the problem right away. The restaurant is excellent, particularly for breakfast and lunch. My only complaint is that they should ban cell phones in the restaurant. I do not need to hear people's personal business while I sit with my morning paper and cup of tea. The location is great, too. Also, the weather is perfect in August. Do not come to San Diego in June - June gloom, take it from a native.", "Date": "September 7, 2006"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "los angeles", "Title": "“Trendy hotel”", "Author": "gnawh2", "ReviewID": "UR5629815", "Content": "My boyfriend and I stayed at Tower23 over president's weekend in February. Very smart + unique approach to a modern boutique hotel. Located right on pacific beach where you can people watch on the 2nd floor balcony, watch the sunset in the evening next to the firepit. Great hotel for young couples and singles. Tempur-pedic mattres and H2O products in the bathroom is a plus. Eats: George's in La Jolla, Extraordinary desserts, and local eateries near Corona del mar. I would definitely stay here again!", "Date": "August 20, 2006"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Phoenix", "Title": "“Second time around...and loved it”", "Author": "Seguso", "ReviewID": "UR5609820", "Content": "I've stayed with my family at the Tower two times. Once was the first week that they were open. It was horrible...I could write a huge review on all of the many, many problems. My husband wrote the owner and to our surprise, he personally replied and invited us back for free. Wow, that never happens. We couldn't do another trip until about 9 months later, and actually, we weren't sure we wanted to go back, even for free. But we did and man, have they improved. Both visits we stayed at the sweet suite...and it is. The best beach view, wonderful bed and the coolest bathtub. Everything was really clean, and that's important, I hate dirty hotels, especially the bathroom. The Jordan restaurant is directly under the balcony, makes for good people watching but does get a bid loud at night. We were traveling with two very young kids so we were in our rooms by around 8:00 every night, so the noise was a little annoying, but really not that bad. Jordan really fills up at night, looked like fun. The food there is great, try the filet, yum. Being so close to the beach was great, I highly recommend the Tower. If staying there try the sweet suite. If not that room be sure to get one with a beach view, they are limited. Some of the views/patios are in a common area, I personally wouldn't like that, people can stare right into your room. Overall, love the place. Will for sure stay again.", "Date": "August 14, 2006"}, {"Ratings": {"Cleanliness": "4", "Overall": "1.0", "Value": "2", "Service": "1", "Rooms": "4"}, "AuthorLocation": "Los Angeles", "Title": "“TERROR 23! stay here at your peril!!”", "Author": "A TripAdvisor Member", "ReviewID": "UR4465838", "Content": "Wow, can we say \"attitude adjustment\"! My girlfriend and I stayed here for a night and were happy to escape with just an assault on our character. It all started well, nice room, good view, hip bar....until we arrived back from dinner in downtown san diego...en route to the bar for a night cap we were confronted by a belligerent staff member asking \"can i help you?\", I told him we were hotel guests and he told me to \"go f**k yourself\"! I couldn't believe it! I asked to see the manager and there was no manager available. I made a complaint to the front desk, where they told me they had had problems with that staff member previously. I emailed the hotel manager when I returned home. No response from Terror 23, still awaiting an acknowledgement or apology. The whole thing ruined our stay in San Diego and we wouldn't want anyone else to have this experience.", "Date": "February 16, 2006"}, {"Ratings": {"Cleanliness": "4", "Overall": "4.0", "Value": "3", "Service": "4", "Rooms": "4"}, "AuthorLocation": "", "Title": "“Surf Pad”", "Author": "EatSantaBarbarian", "ReviewID": "UR4446381", "Content": "We spent a long weekend at Tower 23. The view from our Surf Pad room was gorgeous. The bed was wonderfully comfortable and I loved the modern look. However, it was sometimes a case of form over function. The bath shower was somewhat broken when we arrived and the handle on the shower came off. The toilet paper holder was angling toward the ground so the roll wanted to slide off. Nothing was wrong that an allen wrench couldn't fix and when I reported the issues they fixed them promptly. Well, all but the toilet paper roll holder as I didn't report that. I really wanted the shower working properly and didn't want to confuse the issue. The lighting looked nice but it really wasn't bright enough to do makeup. I think all the minimal hard surfaces also allowed sound to travel as we could hear the neighboring rooms more than I would have expected. The Tower bar was ultra cool and there was a long line to get into the restaurant bar downstairs on the weekend nights. We only had breakfast in the restaurant and it was another ultra cool spot. I had to laugh when the waters came with mangled chucks of lemon hanging to the side. All that look and they cannot slice a lemon. I suppose it is more likely that mangled lemon is the new new thing and I am just behind. The staff was amusing. It was like watching kids play dress up. It seemed the valet staff knew more than anyone about how to handle guests. The others seemed too young for their jobs. But, I may jut have been too old for the staff.", "Date": "February 8, 2006"}, {"Ratings": {"Cleanliness": "4", "Overall": "4.0", "Value": "4", "Service": "4", "Rooms": "4"}, "AuthorLocation": "Paisley, Renfrewshire Scotland", "Title": "“Hidden Gem!!”", "Author": "A TripAdvisor Member", "ReviewID": "UR4399864", "Content": "Myself and boyfriend stayed here for 3 nights in one of the 'sky pads'. At first we were a little unsure of what it would be like when we were driving to it, as we had been in the city and been recommended this hotel by the visitor centre. It isnt too far from the main city maybe about 10 or 15 minutes drive. We knew it was just a new hotel, and it certainly lived up to the expectations of being very modern. The view was lovely from the room of the pier at the front and the sunsets were amazing. The bed was the most comfortable i have ever slept in, we had been travelling around california ,so it was just so relaxing to get great nights sleep! It was sooo good to get up in the morning and stroll along the beach front and watch the surfers! The staff were also very friendly and helpful. I would definately reccomend this hotel(i think it is even in the Conde Nast book of good hotels!) We stayed during the week which was fine for noise, but i think it gets a bit noisy at the weekends,if you want a relaxing stay here, then go during the week!", "Date": "January 31, 2006"}, {"Ratings": {"Cleanliness": "5", "Overall": "5.0", "Value": "3", "Service": "4", "Rooms": "5"}, "AuthorLocation": "Baltimore, MD", "Title": "“Pacific Beach contemporary cool”", "Author": "A TripAdvisor Member", "ReviewID": "UR4315706", "Content": "We stayed at Tower 23 because we loved the contemporary design we saw on the hotel's website. The furnishings and the rooms are very thoughtfully designed. There's a low-height table that's perfect for placing your bags if you don't want to unpack, and the Do Not Disturb sign is an electronic button on the wall rather than a flimsy piece of cardboard. The staff respected the do not disturb and let us sleep until 4pm after we had a very late night. We had a sanctuary suite which was absolutely incredible - I want this bathroom for my own house. The water falls in a perfect, quiet stream from the ceiling into a truly massive bathtub jacuzzi with colored underwater lights and three different kinds of bubble jets. My husband and I both got into it easily; I think it would be easy to fit four normal-sized people, or to swim in it if you're alone. The bathroom is separated from the rest of the one-room suite by only a curtain, which gives a nice open feel to the whole space. Later in our visit we also stayed in a surf pad room, with a full ocean view. We slept with the sliding door open to hear the waves. We also loved the neighborhood; you can walk along Pacific Beach and have breakfast by the ocean, or you can walk to funky secondhand shopping along Garnet Street which is a little like L.A.'s Melrose. There are many businesses within a third of a mile of the hotel - drugstores, supermarkets, Uno's pizza, Denny's, places that rent rollerblades and surf equipment, ice cream from ColdStone and Dairy Queen, et cetera. If you like to be in the heart of the action, this is the place. Because the hotel is small, there's plenty of staff attention paid to each guest. The front desk printed out boarding passes for me with no hesitation (their business center isn't open yet.) Every time we called for our car, it was ready for us by the time we got down the elevator. Yes, this is a pricey hotel, but I was happy with every aspect of my stay.", "Date": "January 1, 2006"}, {"Ratings": {"Cleanliness": "4", "Overall": "2.0", "Value": "2", "Service": "2", "Rooms": "4"}, "AuthorLocation": "Baltimore", "Title": "“Overrated & Expensive!”", "Author": "A TripAdvisor Member", "ReviewID": "UR4156706", "Content": "My fiance and I stayed there for 5-day vacation from the East coast and thought it was okay. I knew the reviews were mixed, but decided to stay there anyway to check it out for myself. The hotel is definitely overrated and it seems as though it didn't fit into the PB scence. Our first night there, it was obnoxious, b/c we could hear people downstairs at the bar screaming and fighting until 3AM! The other nights it was ok, noise level was moderate. Rooms are nice, no coffeemakers, but coffee was available downstairs, in a very awkward place (near the elevators), and was only available until 9am or so. The bathroom lights were dim, so you need to apply makeup in your room. Service was okay, I see where others complained about young staff and courtesy. The hotel was nice enough to print out our boarding passes before we left, but the girl at the front desk was so clueless. I had to tell her about 5 times our comfirmation # because she couldn't type? All in all, we though it was expensive for PB and probably would opt to stay in La Jolla next time.", "Date": "December 1, 2005"}, {"Ratings": {"Cleanliness": "1", "Overall": "3.0", "Value": "3", "Service": "1", "Rooms": "5"}, "AuthorLocation": "Las vegas", "Title": "“not as good as it looks”", "Author": "dustrust", "ReviewID": "UR4148759", "Content": "the service isnt all that good. there was a sanitation problem with our room that was never resolved, when i told the front desk the man just starred at me. no apology what so ever. he didnt even ask details of the problem. the employees seem young and inexperienced. the lights in the bathroom are very dim. so ladies bring a flashlight to apply your makeup.", "Date": "November 28, 2005"}, {"Ratings": {"Cleanliness": "5", "Overall": "5.0", "Value": "4", "Service": "4", "Rooms": "5"}, "AuthorLocation": "Kent, Washington", "Title": "“A Great New Beach Hotel in San Diego”", "Author": "fboosman", "ReviewID": "UR4105415", "Content": "I felt like I was taking a big chance with the TOWER23 hotel -- it was so new that it had only one review that I could find (here on TripAdvisor). I needn't have worried -- it was up there with the best hotels at which I've ever stayed, and most certainly was the coolest of them all. The TOWER23 hotel is an anomaly, an ultramodern hotel set in a bit of a funky beach town (the Pacific Beach area of San Diego). There's nothing nearby that's like it -- accomodations in the area range from mid-range condominiums to dilapidated cottages set on a pier. But the setting doesn't detract from the TOWER23, and in fact seems to bring it into sharper relief. I had an oceanfront room, a \"Surf Pad,\" which was delightful. The bathroom was stylish, the shower large and equipped with a rain-style head. The bed was one of the two or three most comfortable I've ever slept on. The flat panel TV was great, and I used the Xbox to play DVDs that I had brought with me (you can borrow movies from the front desk, or there's a Blockbuster next door). The room had both wired and wireless connections to the hotel's free Internet service. But the star of the room was the view -- a third-story, top-floor view of the boardwalk, the beach, and the ocean. Sunsets were absolutely spectacular. The TOWER23 has its own ocean-view restaurant, JRDN. I had excellent sushi rolls there on two occasions, and my companion and I both thought that the breakfast we had was one of the best we could remember, and reasonably priced. At night, JRDN becomes a very hip club, and we took advantage of this almost every evening during our stay. Bring stylish clothes! The hotel has a second-floor deck with comfortable seating and a fire pit, the modern style with flames dancing over sand. We spent some very pleasant evenings there drinking cocktails brought up from the club below. I wouldn't recommend the TOWER23 for people who want a very quiet hotel. Although the rooms are soundproofed quite well, once JRDN becomes a club at night, it becomes fairly loud, especially on Friday and Saturday nights. This wasn't an issue for us, as we were making use of it, but I can see some people having problems with it. Nor would I recommend the hotel for people with small children -- the beach is really the only place for them to run around, as there's no pool or playspace of any kind -- it's just not that kind of hotel. To travelers looking for a beachfront hotel, a trendy place to stay, or a hotel where one can party into the wee hours, I can't recommend the TOWER23 highly enough. It's less expensive than many of the dull mega-hotels in the city, but with better rooms and polite, boutique-style service. I hope to stay there again someday!", "Date": "November 11, 2005"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "San Diego", "Title": "“A fabulous hip little hotel!”", "Author": "A TripAdvisor Member", "ReviewID": "UR4081844", "Content": "My husband and I stayed at Tower 23 to celebrate our 1st anniversary. The hotel was clean, modern and the staff, very professional. We enjoyed cold beers on the outdoor Tower Bar where the waitress was friendly and courteous. As we were checking in to our room the hotel staff asked \"what brought you to Tower 23?\"...we told her we were celebrating our 1st anniversary...and after returning to our room after having drinks...we found a tasty chocolate fudge dessert with \"Happy Anniversary\" written in chocolate. A very nice touch. Their restaurant...Jordan's was packed...we didn't try it...but the ambience and menu looked very appealing. We'll be back to try it. And...Kono's...a little breakfast place right next door is terrific...as is the little coffee hut. A great stay!", "Date": "November 2, 2005"}], "HotelInfo": {"Name": "Tower23 Hotel", "HotelURL": "/ShowUserReviews-g60750-d571835-Reviews-Tower23_Hotel-San_Diego_California.html", "Price": "$264 - $605*", "Address": "<address class=\"addressReset\"> <span rel=\"v:address\"> <span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">4551 Ocean Boulevard</span>, <span class=\"extended-address\">Between Felspar St. &amp; Garnet Ave.</span>, <span class=\"locality\"><span property=\"v:locality\">San Diego</span>, <span property=\"v:region\">CA</span> <span property=\"v:postal-code\">92109</span></span> </span> </span> </address>", "HotelID": "2515422", "ImgURL": "http://media-cdn.tripadvisor.com/media/photo-s/01/d1/53/b1/endless-summer-at-t23.jpg"}}