{"Reviews": [{"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "3.0", "Value": "2", "Sleep Quality": "2", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Cologne", "Title": "“nice familiar hotel, good situated”", "Author": "MariaCologne", "ReviewID": "UR127049910", "Content": "close to the gaslamp district you'll find this very charming hotel. not too many rooms and very helpful team, they answer you all the questions and really care about their guests. The rooms are a little bit old-fashioned and dark but clean. Breakfast is very simple, serve in plastic cups/plates. The breakfast room is very small and not very inviting to stay there. Construction of walls very thin, quite load from neighbour rooms and street. room doors don't close entirely, therefore also noise from outside. I would recommend this hotel for its location but I think its too expensive for what you get.", "Date": "March 31, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "2.0", "Value": "3", "Sleep Quality": "1", "Rooms": "1", "Location": "4"}, "AuthorLocation": "", "Title": "“Thin wall, small and cold room”", "Author": "Abby60763", "ReviewID": "UR121720684", "Content": "Location is good, staff were friendly, breakfast was good. But room was humid and small with thin walls. You can hear everthińg you neighbor does... It was cold during our stay, the heater was loud and cold. They should replace the air conditioner. Overall, we won't go back...", "Date": "December 14, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Location": "4", "Rooms": "4"}, "AuthorLocation": "", "Title": "“Clean and cosy”", "Author": "Tuonofan", "ReviewID": "UR119764832", "Content": "I stayed with my wife and two boys. Rooms are small, but well appointed and comfortable. Staff were very helpful.", "Date": "October 26, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Seattle, Washington", "Title": "“Best Western near Balboa Park”", "Author": "traveler047", "ReviewID": "UR119536394", "Content": "This place was so cute - not your usual hotel. The parking was separated from the rooms with a grove of bamboo and lots of potted plants, with teak table and chairs outside the room. The rooms had hard wood floors although a bit small. Breakfast was good and everyone working there was very nice. We were very pleased with the location so close to Balboa park.", "Date": "October 20, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Sleep Quality": "3", "Rooms": "2", "Location": "3"}, "AuthorLocation": "The Hague, The Netherlands", "Title": "“A bit disappointing”", "Author": "Will de d", "ReviewID": "UR118921275", "Content": "After travelling for four weeks through the United States, we didn't want a to end a great stay in this country in a cheap city hotel. So, we decided to book a Best Western Plus, thinking that the plus meant that this is a upgrade on the usual Best Western standard. During the four weeks in the USA we had used a lot of Best Western hotels and that resultated in a promotion in their awards programme from Gold to Platinum. When we arrived the Platinum status wasn't in their booking, so I had to ask for the welcome-packet for Platinum members. Next, we didn't get the upgrade in the room that usually belongs to a Platinum status in a loyalty programme. The room we got, was small, but clean. The breakfast was average and the hotel didn't have a pool. So, we could not see what was \"plus\" in this hotel. We have stayed in much better Best Western hotels during our trip that didn't have the \"plus-status\". Finally, we wanted a late check-out at 5.30 pm, because our plane left San Diego at 8 pm that night. We had to pay a charge of $75 for keeping the room for another couple of hours, although one of the benefits the Best Western Rewards programme offers to Platinum members is a late check-out upon availabilty. And the room was available, because the hotel was virtually empty the day we left San Diego. So in all, a bit disappointing. The member of staff was the only real plus to the Best Western Cabrillo Garden Inn. He was nice and helpful.", "Date": "October 4, 2011"}, {"Ratings": {"Cleanliness": "3", "Sleep Quality": "2", "Overall": "3.0", "Value": "3", "Service": "3"}, "AuthorLocation": "Boulder, Colorado", "Title": "“Beautiful property, fairly clean, ok location, service not too great.”", "Author": "FlowerLife22", "ReviewID": "UR115255060", "Content": "We were able to check in early, upon our request, which was wonderful! The room was a bit small, but very clean. There is no fan in the bathroom, which was very odd. The bathroom was so small, I could barely get in and close the door. We enjoyed the roof top balcony area. It was very nice. Parking lot was a bit dirty with trash etc... Located across the street from a market, which was convenient. Just a short walk from downtown and gaslamp. When we asked front desk for dining recommendations, she was unable to provide us with a clear answer. She replied with something like \"well, there's hundreds of restaurants in the area\". It was more difficult than it should have been to get her to suggest a single place. Same thing when we asked what beach to go to and how to get there. Either she wasn't familiar with the area or she really was overwhelmed with all of the choices... We were in town for a wedding and upon returning from the wedding that evening, there were two parties going on in the hotel. One was two doors down from us on the ground floor and the other was directly above us and two doors down from that upstairs. I quieted the people next to us on my own, but could not get the people upstairs to stop yelling and rough housing. I called night audit who said he did not hear anything when he was outside in the parking lot. Period. End of discussion, I guess. I told him it was 2AM and I needed to sleep, and asked if he could move our room farther from them if he wasn't going to quiet them down. While he was bringing keys to our room, I was outside and the party was throwing things off of their balcony into the parking lot. We were never offered a discount or even an apology for this disruption! TIP: If you stay here, request an upstairs room- the walls/floors are paper-thin and you can hear EVERYTHING if someone is above you! Probably will not stay if we ever return to San Diego. This was our first trip to this city. Upon walking around etc, I would probably take a look at the Days Inn next door...", "Date": "July 11, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "4", "Overall": "4.0", "Value": "4", "Service": "5"}, "AuthorLocation": "decatur ga", "Title": "“great, friendly place to stay”", "Author": "jbtraveller2000", "ReviewID": "UR114320311", "Content": "booked hotel at the last minute, and got a great rate. small, very nice property. room was exceptionally clean, bed very comfortable, nice bathroom with great shower. front desk staff very nice and helpful. hotel is central to everything and cabs were easily called to area attractions. this is one of the \"best\" best westerns, i have ever stayed at.", "Date": "June 19, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "3", "Sleep Quality": "4", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Sydney, Australia", "Title": "“Clean as a whistle”", "Author": "roaming-wifi", "ReviewID": "UR86985235", "Content": "Had a four night stay at the Cabrillo in early May 2010. The room was extremely clean, so much so that we had to keep the windows open to let the cleaning fragrance escape! I guess you should never complain about a place being too clean. The room included a complimentary hot breakfast but did not include parking. The hotel was a bit away from San Diego’s centre but it was definitely within walking distance for us. If not for others, the trolley and bus stop is only a block away. The staff member at the front desk was very helpful with information regarding maps, transport, food and places to steer clear from. The nightly rate was $150USD, maybe a little pricey for what we got but we enjoyed the stay overall. We were there to see San Diego after all, not the four walls of the Best Western. Still, I would recommend this hotel if you didn’t mind being just out of the very centre of the city.", "Date": "November 13, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Denver, Colorado", "Title": "“Could not be happier!”", "Author": "jdrd57", "ReviewID": "UR84163447", "Content": "This is my first Trip Advisor review. I came here for a convention. I usually try to stay a mile or so away from the venue so I can experience the town, with a different street walked on each trip to and fro. Cabrillo Inn suits the bill for similarly disposed conventioneers. As to the property, I fell in love when I first drove up. It was a simple oasis in the big city. Lots and lots and lots of potted plants provide character and privacy. Little lanterns illuminating the property. Charming in an uncomplicated way but that does not come without effort---the property was well tended to. The room was clean and I really enjoyed the hand stenciling in the rooms--so homey. The rooms were definitely not large though they were functional--a desk for using the computer (both ethernet and wireless at a decent rate of speed), a round table with chairs if you take a meal in room, and a very comfortable bed. Slept like a baby. Screened windows open up to bring a little of the outside in. Nice breakfast with food choices and nice staff. It also afforded me the opportunity to find some off the track restaurants outside of the Gaslamp Quarter. I stayed here six nights and will stay here again.", "Date": "October 20, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Sleep Quality": "3", "Rooms": "2", "Location": "5"}, "AuthorLocation": "Martinez, CA", "Title": "“Not exactly the \"Best\" of the Best Westerns”", "Author": "165", "ReviewID": "UR69143528", "Content": "After a two night stay we're still not sure whether the pluses outweigh the minuses here. The facility is older, but well-maintained, two stories, no elevator, downtown & close to the freeway with associated traffic noise. It's clean, but the strong odor of some cleaner / freshener product took some getting used to. Bedding was comfortable. Staff was pleasant. Parking is an extra $10.00 per day . Breakfast included scrambled eggs and sausage one day, scrambled eggs and hm the other, along with the usual \"continental\" breakfast fare. Orange juice was watered down some and the only juice available the two mornings we were there. Dining area is cramped - we at at a table outdoors both mornings. I don't think our room (#215 above the office) was typical. Although fairly spacious, it was the most awkwardly arranged room we've ever stayed in. TV situated at an angle and distant from the bed, nowhere to sit near the phone, bath towels hung about 8 feet from the tub, no counter space in the bathroom, etc. (see pictures). The free Internet connects via provided ethernet cable which, fortunately, is long enough to string across the room to a good-sized table. The air conditioning took a little time to figure out but worked well and quietly. I can't say we wouldn't stay here again, but will thoroughly explore other options first.", "Date": "June 29, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "california", "Title": "“Best kept secret in San Diego.”", "Author": "trip_lady15", "ReviewID": "UR55991268", "Content": "Best little hotel in the heart of San Diego. Nothing fancy just really clean with the most courteious staff to be found. Free breakfast every morning. I stay there whenever I'm in town. Close to Little Italy and the Gaslamp District.", "Date": "February 14, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "3.0", "Value": "4", "Location": "2", "Rooms": "3"}, "AuthorLocation": "So Cal", "Title": "“Temper Your Expectations”", "Author": "clionrsqr", "ReviewID": "UR45037759", "Content": "My husband and I needed a hotel for one night close to the zoo. We were coming in late and leaving early, so just needed a bed that was clean. Based on the reviews, I may have been expecting something more. To be fair, the staff was very nice. However, the hotel is obviously a remodeled older motel. The air conditioning was window units. The room was very small; the dressing/mirror/sink area and toilet were in the same room as the shower, so two people could not get ready at one time. The carpet was very old and needed to be replaced. The location is such that I would not have walked anywhere in the evening, kind of scary area. If there were not rooms on the second level I would have really thought twice about staying. For our very specific purposes, it was fine. I would not recommend it to someone who is just looking for a nice central San Diego hotel.", "Date": "September 27, 2009"}, {"Ratings": {"Cleanliness": "5", "Overall": "5.0", "Rooms": "4", "Value": "5", "Location": "4"}, "AuthorLocation": "West of London", "Title": "“What a gem!”", "Author": "marketresearcher", "ReviewID": "UR37582202", "Content": "We took accomodation at this Inn, in trepidation I might add because we had arrived in San Diego on spec and had difficulty booking anywhere that looked half decent the night we arrived because of some large onferences taking place. We booked one night and stayed 6. Unbelievable value and particularly if you have the largest room which is at the top of the stairs outside reception and turn left. Mini suite and large bathroom. Very comfortable bed and fridge and TV. Having just stayed 4 night at the Bellagio in Las Vegas it was lovely to have staff who truly appeared to want to serve you and help you without putting their hand out! We actually enjoyed tipping (all) the staff we came into contact with. A light self serve breakfast was included and was adequate. The cleaning staff certainly cleaned and you knew they had been in. Laundry facilities, inexpensive parking, close to down town and they didn't mind you putting your own wine in the fridge!! It was the excellent value and showed us that big and expensive does not mean best.", "Date": "August 13, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Boise, ID", "Title": "“Unbeatable location, great value, cute ambience”", "Author": "stephen553", "ReviewID": "UR30680022", "Content": "I negotiated a special rate (similar to seniors, more discounted than AAA) because we were staying 6 nights. Upon checking in they first tried to put us in a dim, windowless corner room (because I requested quiet location-- or the negotiated discount?). This corner room had a queen bed rather than the king reserved, and we knew for a 6 day stay we definitely wanted a window onto the cute, heavily gardened exterior hallways. They did then change us to a true king room with window upon request. This took minor negotiating/insistence, but they were very courteous in the end if a bit formal. The room itself was spacious enough, but a little hard to navigate because of the large pieces of furniture. The tiled shower (no bath) was spacious, but the rest of the bathroom was a very tight squeeze with minimal counter space. It was great to have a mini-fridge for leftovers, and complimentary breakfast was WAY above average, including hot hash brown patties, real eggs, sausage plus the more typical cold cereals, toast, and packaged danishes. The best things about this hotel are the incredibly central location and the value for what you get. Nice furniture and bathroom tile, free internet with cables in every room in case the wifi signal is too weak, and in-room safes that fit a 15\" laptop. As for the location, it's only two blocks for buses to Balboa Park and the Zoo, and four blocks to two other, larger transit centers, with both bus and trolley stops. The Gaslamp restaurant district begins about 7 blocks away, or you can take the nearby orange trolley if going to the far end and don't want to walk. Although not terribly far from the flightpaths we had no noise even outside the room, whereas a competitor we almost booked in Little Italy had comments about both airplane noise and late-night train horns. If you like hanging out at the hotel itself, a market next door sells beer and wine plus essential toiletries, and there is a cute, gardened terrace available to all guests. Don't miss Indigo Grill/Kemo Sabe, stolling Little Italy, authentic Italian food either in Little Italy or Panovino on 4th Ave. Panovino had all Italian speaking staff and about half Italian speaking diners.", "Date": "May 24, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Location": "4", "Rooms": "3"}, "AuthorLocation": "Los Angeles", "Title": "“ol' timey motel”", "Author": "Shi Hu", "ReviewID": "UR27169515", "Content": "The Cabrillo was convenient to the Mingei Museum in Balboa Park, the objective of our one night visit. Well, it's just an \"ol' timey\" motel, but it is a small oasis amongst the high rises of this downtown San Diego neighborhood. Our room #107 was tucked away at the back of the property and was as quiet as could be. The AC worked, the linens were decent and the staff was courteous. Other than this, I would not describe it as \"impressive\". It was suitable for our purposes; couldn't have asked for more.", "Date": "March 31, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "5.0", "Value": "5", "Location": "4", "Rooms": "4"}, "AuthorLocation": "Boston, MA", "Title": "“Great Experience Under Less-Than-Ideal Circumstances”", "Author": "bostondev", "ReviewID": "UR25221856", "Content": "We recently booked two nights' stay at the Best Western Cabrillo Inn for a friend's wedding. We got in late Saturday night and, being from the east coast, we were exhausted. First impressions were that the place was adorable...really great landscaping outside and on the terraces. We went to bed and...at 4:30am San Diego time...the Fijian rugby team came home to the room next door and began singing at the top of their lungs (little had we known there was an international rugby tournament in San Diego that weekend). We called in a noise complaint and it was promptly dealt with...the man at the front desk even called us back to make sure it was better! The next day, due to work schedules, we realized we had to get out of California earlier than planned (I had to work at 7am Tuesday morning - 5 12-hour shifts in a row - and we weren't due to get into Logan until 11p Monday night). After some surfing on the FREE wireless internet while eating the great, FREE breakfast we discovered it was cheaper to rent a car, drive to L.A., get a hotel there, and book a new flight than it was to reschedule with American Airlines (jerks...and by the way, Virgin America rocks. fly them!). We explained this to the front desk - along with being very clear we'd stay another night except for needing to get home earlier than planned - and found the front desk staff to be incredibly understanding...so much so they only charged us for one night despite the fact that we'd already paid for the two nights. I can't say enough how appreciative we were of this given the rest of our travel extravaganza. In summary, this was a wonderful hotel...I don't fault them a bit for the fact they had some rowdy patrons the night we were there. I think they handled the whole thing wonderfully and professionally, and I would not only recommend it but I would stay there again in a heartbeat simply because of the wonderful service, great free breakfast, and general adorable atmosphere (and free wireless). Overall a great value in the middle of Downtown San Diego.", "Date": "February 26, 2009"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "Fairbanks, Alaska", "Title": "“Lovely hideaway; terrific value”", "Author": "cptnalaska", "ReviewID": "UR23730798", "Content": "My wife and I traveled to San Diego with two friends to hear a concert at nearby (2 blocks) Copley Hall. We had stayed here on an earlier visit and were delighted to see that nothing had changed. There is a beautiful garden patio on the roof of this charming little property where we spent a pleasant hour or two munching on pizza and chatting. The Cabrillo Inn reminded each of us of the \"Old\" California. It is meticulously maintained, the staff are friendly and helpful, and one simply can't beat the value, given that typical rooms in nearby high-rise hotels cost much more. Parking is easy and inexpensive (although somewhat cramped). To paraphrase a previous rater's comment: \"believe the positive reviews\".", "Date": "January 20, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Business service (e.g., internet access)": "4", "Check in / front desk": "5", "Overall": "4.0", "Value": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Sydney, Australia", "Title": "“Family friendly & value for money”", "Author": "Waenkrisien", "ReviewID": "UR21051536", "Content": "Great little find in a big city. Inn is located in the NW of the city, within easy walk of most attractions. Cortez Hill Market is located across the street and onsite parking is provided (@$10 a night) The Inn is a green oasis, with potted plants aplenty. Accommodation is clean and comfortable, in-room safe a bonus. Carlos at the front desk was very helpful in answering questions, suggesting things to do and wher to eat out. Breakfast was a simple, no fuss affair, prefectly adequate and we ate outside on several mornings in the glorious sunshine. A pleasant stay for our family of 4 (ch. 11 & 9).", "Date": "October 21, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Sonora, CA", "Title": "“An Awesome Small Hotel”", "Author": "iwork2travel07", "ReviewID": "UR20458160", "Content": "My wife and I went to a medical conference in San Diego. Several large hotels were associated with the conference and charging discounted rates of $250 - $300 per night. I searched TripAdvisor for alternatives and saw great reviews for the BW Cabrillo Garden Inn. We stayed 5 nights there and were very pleased. It is a small hotel surrounded by huge buildings but still feels cozy. There are plants, flowers and cacti everywhere which are what gives it a nice visual appeal. It is so close to everything downtown. Everything important is within one mile. We walked everywhere. The reception staff are very professional and courteous and everything was in order when we arrived. Our room was very clean and smelled fresh. And yes the bed was quite comfortable. We slept wonderfully. Noise outside in the busy streets of San Diego never made it inside our room. It was very quiet. And I must say that the housekeeping staff worked above and beyond what was probably required of them. Our room had a small table, a small refridgerator and a desk. The internet wireless connection worked flawlessly. The breakfast every morning was quite good. There were cereals, pastries, eggs, bacon or ham or sausage, hash browns, toast, bagels, juices, fruits, and coffee. Four hours before we left I asked the front desk person to get us a taxi at 1:00. At 1:00 the taxi was there! ($12 - $13 without tip to the airport). The only minor flaws were a small bathroom and an older tube TV (but picture still okay). My wife and I do stay at very nice hotels 30 to 40 nights a year and we were a little apprehensive before arriving. But once we were there we knew it was a perfect decision. Let the guests at the Sheraton Suites across the street pay $300+ a night. The Cabrillo Garden Inn is a much less expensive paradise.", "Date": "September 29, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Midwest", "Title": "“Nice place to stay for ESRI conference”", "Author": "TheFrostyOne", "ReviewID": "UR19215031", "Content": "I stayed here for the 2008 ESRI Conference, not exactly sure what to expect as one of the few hotels still in downtown that costs less than $200/night during the conference. It's only a few minutes walk to the trolley line (or a 20-25 minute walk to the convention center). The room was very nice, quiet, with a good bed & shower. No HBO, but they do show 3 different movies. The breakfast is a nice touch, eggs, bacon, cereal, etc. I would definitely stay there again for conferences and for personal travel.", "Date": "August 21, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Check in / front desk": "4", "Overall": "4.0", "Value": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Pennsylvnia", "Title": "“great little hotel”", "Author": "melissa328", "ReviewID": "UR18323211", "Content": "My husband and I stayed here for three nights in mid-July. We were on a road trip up the coast and started in San Diego. We really liked this small hotel. The staff was nice and we loved all of the plants and garden like features. It really made it seem like a garden in the middle of the city. I felt the location was central to a lot of things, but you do need a car to get around. The hotel is on a pretty busy street. Our room was very nice and clean and spacious. Another plus was the breakfast. They had a hot breakfast each morning and changed the menu items daily. The breakfast room was quite small and could get crowded, but there were tables set up outside and it was great eating outside because the weather is always beautiful. Also, having a hot breakfast included is really a plus. I would stay at this hotel again and recommend it to anyone staying in San Diego.", "Date": "July 27, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Business service (e.g., internet access)": "3", "Check in / front desk": "4", "Overall": "3.0", "Value": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Clearwater, Florida", "Title": "“Nothing lavish, friendly staff, decent location”", "Author": "bienemy", "ReviewID": "UR14495945", "Content": "Staff was friendly and responsive. I asked for directions one time and the check-in lady was overly-helpful. The continental breakfast in the morning was not your crappy bread and fruit breakfast. They actually had eggs, bacon/sausage and other good foods. We were pleasantly surprised. The location was very close to the Gaslamp. A little bit of a walk, but not bad at all. The rooms were small...I would say a little too small for the price. Would try to find somewhere else next time...for the same price, but would resort to the Cabrillo Inn, if necessary.", "Date": "March 24, 2008"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "leystad", "Title": "“perfekt centrally located little motel”", "Author": "geertje", "ReviewID": "UR13543510", "Content": "stayed here during our winter brake. It is a perfekt location for all the San Diego atractions. The service was perfekt and they served a perfekt hot breakfast in the lobby each morning. In fact the best of our holiday", "Date": "February 14, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Durham, NC", "Title": "“oasis in the city”", "Author": "Portokalh", "ReviewID": "UR10638894", "Content": "I stayed there for a short time during a busy conference week. The place was quiet and clean. I loved the flowers and the easy access outside. Breakfast was served in the morning and I could eat it at one of tables set outside. Good way to start the day! The staff was friendly and helpful, and made me feel like a welcome guest. Because of the minute size relative to the huge blocks/hotels nearby, and because of the many flowers in pots and hanging baskets I felt like I was staying in an oasis in the city. All these while within walking distance to the Convention Center.", "Date": "November 6, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Arizona", "Title": "“Loved the Cabrillo Garden”", "Author": "ArizonaJenniferE", "ReviewID": "UR10015769", "Content": "I just wanted to let you know that this hotel was really GREAT. Instead of feeling like hotel, it felt more like staying at someone's home. The staff was very friendly and willing to help out if we needed anything. It was the first time I felt like a guest instead of a customer. You should be very proud of the service this hotel offers it is exemplary. I will definitely be staying again.", "Date": "September 28, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "3", "Check in / front desk": "5", "Overall": "3.0", "Value": "4", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Los Angeles, CA", "Title": "“Small, Comfy, Convenient, CLEAN”", "Author": "wickedtravel", "ReviewID": "UR8511476", "Content": "I would definitely recommend this place for those on a budget looking for something that does NOT make them squeamish! This little motel is very conveniently located close the the freeway, and the Gaslamp district. I came to San Diego for a girls weekend getaway with my best friend, and we felt very comfortable to stay here. It is NOT in the best part of town, but if you were looking for that, you should plan on spending a lot more money, or staying further away from the popular areas of San Diego. I was extremely pleased with the cleanliness of our room and bathroom. The rooms are small, the beds are squeezed in, but it is CLEAN, CLEAN, CLEAN. The beds and bedding were spotless, and the mattress was very comfortable. My advice is for women traveling with a male companion to stay on the 2nd floor. If you are not a smoker, all the rooms are non-smoking, but be aware that during the free breakfast (and perhaps at other times of the day) guests who are smokers tend to congregate at the picnic tables outside the the office, which means the second-hand smoke enters your room if you have a room right by these tables, or above the tables. Do not plan on walking around this neighborhood at night - drive where you have to go. However, daytime exploration is just fine. We walked all the way down to the pier, and it was a blast. Also, my only small complaint, is that the carpet is old, and for some reason, aggravated my sinus allergies through out the night. Other than that, I cannot complain. The staff was wonderful, the room was adequate, and the breakfast was quite good! Look at the photos I posted- you can see how this place makes the most of their little space, and how clean they keep the place.", "Date": "August 26, 2007"}, {"Ratings": {"Overall": "1.0", "Location": "1", "Value": "2"}, "AuthorLocation": "Clarksville, Md.", "Title": "“Avoid this hotel”", "Author": "joelajoela", "ReviewID": "UR8453758", "Content": "The hotel is located in a crummy part of town. After looking at our room, my wife and I left to find another hotel, as she did not feel safe this this part of town. Even after cancelling the room by phone, the hotel refused to refund the deposit. The hotel lobby is tiny. It's about 15 by 15 feet. I can't imagine having more than three to four people eat breakfast this this location. For $15 a night more you can stay at a great Best Western in La Jolla; just 15 minutes north. I stayed in La Jolla for three nights before trying the downtown area. The BW in La Jolla is in a great location in addition to having a nice outdoor pool. I am a frequent Best Western user. The Cabrillo Garden needs to drop the word \"Best\" from it's name. It surpises me that a good hotel chain would have the Cabrillo Garden as part of its chain. It's a dump compared to other BW's. We ended up staying at the Embassy Suites which was fantastic. Sure it was more expensive, but well worth it.", "Date": "August 19, 2007"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Business service (e.g., internet access)": "3", "Check in / front desk": "3", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Reading, United Kingdom", "Title": "“Nice comfortable hotel for the money”", "Author": "maggs01", "ReviewID": "UR8215613", "Content": "Only one night stay at the beginning of road trip through California. Good location easy 5 min walk to Gaslamp qtr. Very clean, comfortable and quiet pretty good complimentary breakfast - usual ,,, coffee, OJ and pastries, but also good scrambled eggs", "Date": "July 22, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Business service (e.g., internet access)": "4", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Ontario", "Title": "“Still honest people in the world”", "Author": "Gr8whiten0rth", "ReviewID": "UR7293625", "Content": "My wife and I spent 5 days at the Best Western Cabrillo Garden Inn while I attended a conference at the convention centre. Hotel is convenient to Gaslamp area for eating and shopping and easy highway access for travelling around San Diego. Hotel was good value for money. Rooms were clean and reasonably furnished. Stay was enjoyable and staff were always helpful. But the reason that I am writing my 1st review was a pleasant surprise on our return to Canada. I had been walking to the convention centre and listenting to my Ipod on my daily trip. However after we had left the hotel, I discovered that my Ipod was missing. A phone call from the airport resulted in a promise from the front desk to have the staff check for it. The next week my Ipod arrived healthy and sound with no charge for shipping. Thank you staff at the Cabrillo Garden Inn for confirming my faith in people!", "Date": "April 8, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Business service (e.g., internet access)": "4", "Check in / front desk": "5", "Overall": "3.0", "Value": "4", "Rooms": "4", "Location": "3"}, "AuthorLocation": "California", "Title": "“Nice little inn close to gaslamp area”", "Author": "saddith", "ReviewID": "UR6809075", "Content": "We stayed there for two nights for a work conference at the Sheraton across the street. The hotel is clean and has well decorated rooms. Beds were comfortable. We got one of the larger rooms at the hotel, but it was right next to the street so there was some traffic noise at night. Free wireless internet in the rooms, and a coffee maker. Staff was excellent, very accomodating since we had to check out but allowed us to leave our car in the lot for a few hours. It is a short walk to the gaslamp quarter and shopping mall. Be prepared, because it is uphill back to the hotel, but not too bad. The breakfast was meager, expect some cereal and a few scrambled eggs. There is only one table inside the lobby, so you have to bring it back to your room to eat. I would definitely stay there again.", "Date": "February 18, 2007"}, {"Ratings": {"Overall": "3.0"}, "AuthorLocation": "the road", "Title": "“A beautiful motel”", "Author": "09876", "ReviewID": "UR6316700", "Content": "I booked this place after seeing the reviews here. It's pretty much as advertised. It's a basic motel, beautified. The beautification is quite tasteful and well done: nice tiles in the bathroom, stencilling on the walls (and for some reason the exact same picture over each bed???). It has the basic L-shaped motel layout, but it's been enclosed with a hedge and a line of young trees. In fact, shrubs and bushes have been introduced all along the verandah and walkways, definitely improving the ambience if not quite rising to the level of a \"garden.\" The beds were comfortable, the internet was free, parking was $10 per day. The room was smallish, but fine. The beds were comfortable, and there was a nice little desk. Free coffee in the room and in the lobby. A better-than-continental breakfast. The location is OK; it's a few blocks from the shops and restaurants of the Gaslamp district. It has the potential to be a \"Bed and Breakfast\" type experience, but the staff are pretty impersonal. Nothing wrong or badly handled, but it felt more like buying something at a shop than being welcomed into a \"luxury\" establishment. (Yes, \"luxury\" is on their sign, too. Along with Garden.) Only grumble is minor: I wanted a late checkout; they couldn't tell me until the next day, when they gave me only 1 hour. Considering we'd only checked in around 6.30 p.m., this seemed a bit stingy. Especially since they did not seem to be full. I'd stay there again if necessary.", "Date": "December 2, 2006"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Business service (e.g., internet access)": "3", "Check in / front desk": "4", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Manchester", "Title": "“Lovely little hotel”", "Author": "rebeccawhipp", "ReviewID": "UR6005533", "Content": "Stayed here towards the end of our honeymoon. Fantastic location (just five mins walk from the very busy Gaslamp Quarter) and reasonable rates. Hotel itself was vlaid out more like a motel, and car park was patrolled to keep out anyone other than hotel guests. Would definitely recommend this hotel to others staying in san Diego.", "Date": "October 24, 2006"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Check in / front desk": "3", "Overall": "4.0", "Value": "4", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Las Vegas", "Title": "“No Frills”", "Author": "luke_in_vegas", "ReviewID": "UR5614156", "Content": "The hotel, was more than most Best Western's, but compared to other San Diego hotels, was a good deal. Breakfast and coffee were good and the rooms were clean and comfortable. Just a short walk from the trolley station.", "Date": "August 15, 2006"}, {"Ratings": {"Cleanliness": "4", "Overall": "4.0", "Value": "4", "Service": "4", "Rooms": "3"}, "AuthorLocation": "boston", "Title": "“Good Value”", "Author": "kerberos402", "ReviewID": "UR5029524", "Content": "I stayed for four nights recently and I think this hotel is a great value for the money. I love the flowers planted all over the property. The room was clean and nicely decorated. The bathroom was very small but to me that wasn't a big deal. There is construction across the street so it gets a little loud in the morning but I woke up early every morning to see the sites so it didn't keep me up. The location is fine. You will probably see homeless people on the streets from time to time but they are all over downtown San Diego so you will walk by them no matter where you stay. There is also a convienet store located across the street. As far as walking up hills, yes, if you walk to the Gaslamp district by walking directly in front of the hotel then you will walk back up the hill coming home. Your better off taking a right out of the parking lot and walking a couple of blocks to 4th street, then take a left through the Gaslamp. The hill is a lot more subtle that way (you will know what I mean when you are there). However, if you are completely averse to physical activity, then I would recomend walking to the gaslamp then taking a cab back. The breakfast in the morning is a nice plus. It's your basic breakfast with scrambled eggs, fruit, cereal and coffee. Make sure you take advantage of the gazebo on the roof. I ate my breakfast there several of the mornings.", "Date": "May 2, 2006"}, {"Ratings": {"Cleanliness": "5", "Overall": "4.0", "Value": "5", "Service": "5", "Rooms": "4"}, "AuthorLocation": "Melbourne, Australia", "Title": "“fantastic value hotel”", "Author": "steveharris", "ReviewID": "UR5019039", "Content": "great value hotel within a easy walk downtown to horton plaza or seaport village. Good secure parking and easy access to the interstate 5. Free breakfast and clean rooms. Comfortable beds and helpful staff. Only small hotel compared to other big chains but you are made to feel like the only guest. Crazy if you stay anywhere else downtown. I have stayed at another bigger hotel not far away for the last six years before they jacked up their price. This is much better value.", "Date": "April 29, 2006"}, {"Ratings": {"Overall": "2.0"}, "AuthorLocation": "Huntington Beach, CA", "Title": "“Nice for the price”", "Author": "A TripAdvisor Member", "ReviewID": "UR4367188", "Content": "The hotel is cute. It is located close to the Gaslamp district but several blocks away and there's a nice hefty hill to tackle when you are coming back. There is an extra charge for parking. The rooms are nice yet very small. We had a room with 2 doubles and there wasn't much room to walk around. The bathrooms are very small. The comp. breakfast was mostly continental items along with some cold and untasty eggs. The rooftop has a cool gazebo with lights ( we think) but they didn't work. The hotel staff are impolite and very slow. Very very slow.", "Date": "January 21, 2006"}, {"Ratings": {"Overall": "2.0"}, "AuthorLocation": "gloucestershire, uk", "Title": "“not one for families”", "Author": "A TripAdvisor Member", "ReviewID": "UR4348060", "Content": "stayed late october 2005 as part of family tour (2adults, 2 children) of southern california - booked via best western but paid highest room rates ($140/night if you add the PARKING charge) of our tour for smallest rooms! rooms are too small as family rooms with little storage for more than weekend luggage for a family and tiny bathroom with only shower facility. also breakfast seating area very limited.", "Date": "January 12, 2006"}, {"Ratings": {"Cleanliness": "3", "Overall": "3.0", "Value": "3", "Service": "3", "Rooms": "2"}, "AuthorLocation": "Vancouver Island", "Title": "“Not quite what I expected”", "Author": "BillBen", "ReviewID": "UR4140905", "Content": "We spent 3 days here beginning of November. I'm afraid I was a bit disappointed. The website gives you the impression it is a \"luxury inn\", but it's really just a nice little motel. You could hear the people talking in the next room, which always disappoints me. The furnishings were very ordinary - the pictures on the website aren't really indicative of what you get. But as long as you don't expect too much, just want a place to spend the night, it's fine. I wouldn't stay there again though. It was our first trip to San Diego, but I realize now that there would have been better locations to be at. The gardens and gazebo provided a nice view of San Diego. I paid $83 per night - but I wouldn't pay more for what I got there.", "Date": "November 23, 2005"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Pasadena, CA USA", "Title": "“liked it, price is right”", "Author": "mkt_travel", "ReviewID": "UR4112555", "Content": "The positives: good price. Decent location: it's a slightly long walk to the retail area of San Diego, but not bad (uphill on the way back though). If you're infirm, it'd be too long a walk but if you're in shape it's no problem. The motel is practically across the street from where the San Diego Symphony plays, if you want to go hear them. My room was decent sized and reasonably quiet. The quality of the help at the desk was excellent. The breakfasts were your basic small buffet but with some hot food; I was satisfied. Nothing great but enough to start the day. The negatives: parking is not really quite adequate. If you're the last person to check in you might not get a parking space ... actually I did get a space, but only because the front desk person let me park in the handicapped parking space (because no one was using it). Even then the parking lot is a tight squeeze -- if you've got a large vehicle, you'll need to gingerly edge in and out. There is street parking nearby (but with parking meters which become active during the daytime) and commercial parking lots a block or two away, but that'd be a real hassle and extra expense. Bonus: the Garden Inn lives up to its name. Walk up the stairs to the roof, and there's a sort of balcony and gazebo there, with potted plants all around. The view is mainly of the somewhat gritty immediate neighborhood but it's still quite relaxing to enjoy a cool San Diego evening up there. And you can see a little of the ocean from there.", "Date": "November 15, 2005"}, {"Ratings": {"Overall": "3.0"}, "AuthorLocation": "Tel Aviv, Israel", "Title": "“Nice little place”", "Author": "ekehat", "ReviewID": "UR4052696", "Content": "We (my wife and I) stayed there for two nights on a recent visit to San Diego. The hotel is nice and clean. The decor is even \"cute\". Enough to make the place enjoyable. It's located conveniently at the edge of downtown, close to the airport, and its very easy to get to the freeway from it to drive whereever you want in San Diego (SeaWorld etc.). However, the neighborhood isn't the place I'd walk around after dark. The parking space is limited and they charge you $10 for it. There's breakfast that's fine, but there's no real sitting place, so if you're not the only guest there, you end up eating standing up. Like I said nice *little* place. Finally, there's no elevator. Get ready to carry your luggage up the stairs if you get a room on the second floor. All in all, our stay there was enjoyable, and the price isn't bad for what we got (we paid a little north of $100 per night). However, we'll definitely look into other options next time we're in San Diego.", "Date": "October 25, 2005"}, {"Ratings": {"Cleanliness": "4", "Overall": "4.0", "Value": "3", "Service": "4", "Rooms": "4"}, "AuthorLocation": "Los Angeles, California", "Title": "“Good place”", "Author": "vanillabeanspeck", "ReviewID": "UR4050005", "Content": "This was a good place to stay that was on the more affordable end of the lodging options in San Diego, although the $100/night price tag would not be considered, in general, to be a deal. It's in a convenient location as it's right next to the freeway and close to the Gaslamp District. Unfortunately the weekend I was there, there was construction on a site across the street which made it unrelentingly noisy. The staff were very friendly and helpful. It was good to wake up to a ready-made breakfast buffet although I would refrain from the faux bacon. The room itself was sizeable and everything was newly remodeled and spotless. There were nice decorative touches like plants and curtains that gave the place some character.", "Date": "October 25, 2005"}, {"Ratings": {"Cleanliness": "5", "Overall": "5.0", "Value": "4", "Service": "5", "Rooms": "5"}, "AuthorLocation": "St. Peters, MO", "Title": "“Excellent”", "Author": "PugMom13", "ReviewID": "UR3677075", "Content": "Excellent hotel and staff! While vacationing in San Diego, my husband, I and another couple stayed here for 5 weekdays in July. I choose this hotel based on reviews in trip advisor and the hotels location. It's exactly what it advertises it is, a small luxury hotel, more of a bed and breakfast or luxury motel atmosphere than a hotel. This place is beautiful. Flowers and catus gardens all around it. Lots of little seating areas for smokers or just to sit and relax. Seating is also available on the rooftop, with a lighted gazebo at night. I like the small size and cozy feel of this hotel. We were told upon arrival that we were getting the two best rooms. They sure were! They were big rooms, king size bed, beautiful and super clean. The bedding is very nice, soft, and clean smelling. Nothing bleachy smelling here. Bathrooms are brand new. Deocrated very nice. Super clean too. Room cleaned daily. The complimentary hot/cold breakfast was good too. Attractively displayed in the lobby. Saved us a lot of time running around finding a place for breakfast. This hotel has a super friendly staff. All of them. I absolutely loved this place. Location is great. If driving, easy access to highways. Close to everything. Fast food places nearby too. Two quickshop and gas station type places nearby too. We had a car and was able to find parking in the hotel lot each night, at $10 a day. There is constuction going on around the hotel and it was noisy some mornings, work crews start early, but it didn't bother us. Most big cities are noisy in one way or another.", "Date": "July 18, 2005"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Michigan", "Title": "“Wonderful Boutique Hotel”", "Author": "worldtravelfan", "ReviewID": "UR3634830", "Content": "My husband, daughter and I stayed at the Best Western Cabrillo Garden Inn while vacationing in San Diego during May of this year. Our flight arrived late morning and consequently we reached the hotel at 1:00 p.m. Having reserved our room based on the inn's previous reviews on this site, we were most pleased to see that this is indeed a very attractive, small hotel. Although situated in an urban area, the owners have gone to great effort to surround the property with beautiful flower boxes, planters and attractive landscaping. Although check-in time technically wasn't until later in the afternoon, the front desk clerk cheerfully welcomed us and showed us to our room. Formerly a typical 1950's motor court-style hotel, the inn underwent a complete remodel only a few years ago. Rather than a sterile, institutional refurbishing, the owners have taken pains to establish a more boutique-style setting. While the exterior corridors remain and there is no elevator, all guest rooms are on the first or second floor. There is a rooftop area which has seating, lush flower boxes, container plants, and a gazebo. Additionally a small patio area is located off the lobby. Our room was small (standard 1950's-sized hotel room with two double beds and not much open floor space), but it was tastefully decorated and furnished with quality furniture and bedding. The bathroom had a ceramic-tiled shower (no tub) which was spotlessly clean, as was the rest of our room. Overall, our room was much like those we have had in plush B&B's. A complimentary breakfast was offered each morning in the hotel lobby, but indoor seating was limited. However, the weather was so nice that we availed ourselves of the patio and rooftop eating areas. Breakfast itself was really the only thing we could even remotely criticize... the scrambled eggs were dry, the bacon strips were not \"real\" but a processed breakfast strip, and the danish were institutional variety-packaged in cellophane. However, cereal was available, as was juice, coffee and milk. We would be remiss if we did not mention the hotel staff! They were EXTREMELY helpful... not only did they provide us a map, but they also made great sight-seeing and restaurant suggestions which saved us both time and money. Our stay here was a great value! Wonderful hotel, excellent service and within walking distance of interesting restaurants and shopping. Public transportation is close by and taxis are available. We will definitely stay here again!!!", "Date": "July 4, 2005"}, {"Ratings": {"Cleanliness": "5", "Overall": "5.0", "Value": "5", "Service": "5", "Rooms": "5"}, "AuthorLocation": "Michigan", "Title": "“Outstanding value, friendly staff and immaculate rooms”", "Author": "cherylstar", "ReviewID": "UR3330222", "Content": "Stayed here for one night (3/24/05) based on tripadvisor reviews and it was everything I expected. Very friendly staff, small, but nicely decorated immaculate rooms, including toiletry items and decent breakfast included in the price. For all those plusses you cannot go wrong. I give it 5 stars based on the type of place it is, not that it is to be compared with a $500 a night 5 star.", "Date": "April 4, 2005"}, {"Ratings": {"Cleanliness": "5", "Overall": "4.0", "Value": "5", "Service": "5", "Rooms": "4"}, "AuthorLocation": "vancouver canada", "Title": "“very good”", "Author": "levantski", "ReviewID": "UR3287964", "Content": "March 20, 2005 reviewer: Traveller from British Columbia My wife and I and another couple stayed 2 nights at the Cabrillo Feb 28 and Mar 9 before and after a cruise on the Carnival Spirit. Decided to book the Cabrillo after reading reviews on Trip Advisor. A plus is the motel is all non smoking. Booked over the phone and from first conversation with the young lady on the desk I new our decision to book Cabrillo was the right one and we were not disappointed. We asked for and were accommodated with early check in 11:00am first day 9:30 am second. They provided us with exact directions and bus number to use from airport that stops accross the street. Fare seniors 62 and over $1.00. Convenient location, 10 minute walk to gas lamp area or $5.00 cab ride. This motel started life as an early 60's Travelodge and the outside style brings back memories of early 2 story motel style. The new owners have done a complete inside/ouside reno in the last 2 years and everything is clean, neat, functional. Breakfast has an adequate selection but not large. Cannot say enough about how helpful and friendly the staff are. We will stay again.", "Date": "March 19, 2005"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "texas", "Title": "“Great place”", "Author": "A TripAdvisor Member", "ReviewID": "UR2619104", "Content": "This place is wonderful. We stayed there for a couple of nights. The staff is excellent very helpful and the rooms are really nice. The best thing was the beds they are so comfortable. Will stay there again when in the area.", "Date": "October 4, 2004"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "Shreveport, LA", "Title": "“Wonderful hotel”", "Author": "darlindear", "ReviewID": "UR2594441", "Content": "Stayed at the Cabrillo Garden Inn on Sept. 13 & 14, 2004. It is a quaint, very clean, homey place. Absolutely LOVED it. The room was very nicely furnished and the bathroom was awesome. Lots of parking is available and the hotel is very conveniently located. As it is only 2 story, no elevator - we had quite a few bags - but the registration people offered help with our bags. Overall, a wonderful experience and would stay here again in a heartbeat!!", "Date": "September 23, 2004"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "Zurich, Switzerland", "Title": "“What a great place to stay!”", "Author": "A TripAdvisor Member", "ReviewID": "UR2496410", "Content": "One of the cutest places we have ever stayed. A real bijou! We were very pleased with the size of the Hotel, the wonderfully decorated, clean rooms and the fantastic breakfast. We have stayed in a lot of place all over the world, but the Best Western Cabrillo Garden Inn was one of the best yet! A big plus is the multi-language staff, one of them even speaks Swiss-German! We would go back there any time!", "Date": "August 26, 2004"}, {"Ratings": {"Overall": "3.0"}, "AuthorLocation": "Surprise, Arizona", "Title": "“Arrived expecting more, left satisfied”", "Author": "llisamr", "ReviewID": "UR2295456", "Content": "I expected a bigger room and a nicer surrounding. After the crankiness of driving 5 hours, and after a little nap, I realized it wasn't so bad. The rooms were clean, beds were sooo comfortable, the breakfast was great! Every morning, we went up to the rooftop and ate breakfast. View was beautiful in the morning. Service was great, and staff was helpful and nice. I've stayed at the Hilton in L.A., and I much prefer this Cabrillo Inn.", "Date": "July 14, 2004"}], "HotelInfo": {"Name": "BEST WESTERN Plus Cabrillo Garden Inn", "HotelURL": "/ShowUserReviews-g60750-d280605-Reviews-BEST_WESTERN_Plus_Cabrillo_Garden_Inn-San_Diego_California.html", "Price": "$121 - $232*", "Address": "<address class=\"addressReset\"> <span rel=\"v:address\"> <span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">840 A Street</span>, <span class=\"locality\"><span property=\"v:locality\">San Diego</span>, <span property=\"v:region\">CA</span> <span property=\"v:postal-code\">92101</span></span> </span> </span> </address>", "HotelID": "2515568", "ImgURL": "http://media-cdn.tripadvisor.com/media/ProviderThumbnails/dirs/f7/ff/f7ff4551e4907884cabd8d65da5f6bc44large.jpg"}}