{"Reviews": [{"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Rooms": "5", "Service": "5"}, "AuthorLocation": "Chicago, Illinois", "Title": "“Best Hotel in Paris !”", "Author": "jane D", "ReviewID": "UR126985572", "Content": "After trying the four seasons, Le bristol and Mandarin Oriental, we finally found our home in Paris. Amazing Service !", "Date": "March 30, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Cairo, Egypt", "Title": "“Great Experience..”", "Author": "Ashto66", "ReviewID": "UR126626698", "Content": "A beautiful hotel with beautiful staff.. You'll love every moment you spend there..", "Date": "March 25, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Evanston, Illinois", "Title": "“Fantastic”", "Author": "ebking22", "ReviewID": "UR126251866", "Content": "What I love about this hotel is that it is very subtle about how stunning it is. Every detail is amazing, the bar, the restaurants and the rooms. Everything is done to perfection without being tacky, or over the top. The spa is great, the rooms are incredibly comfortable and spacious. The staff are friendly and help with every detail to make your visit amazing. I cannot say enough about the concierge who helped arrange things for our visit. I will be back next time I'm in town.", "Date": "March 17, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "2.0", "Value": "3", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Amsterdam, The Netherlands", "Title": "“very strange visit”", "Author": "Vicky r", "ReviewID": "UR126229546", "Content": "We have stayed at this hotel twice. The first time with my husband and our 2 daughters so we took 2 rooms (suite and deluxe room) When we arrive we saw immediately high security in the building. Mr. Netanyahu was also staying in the hotel. Lots of heavily armed man in our hallway. When my daughter opened her window a sniper on the roof aimed with a riffle at her. We reported this to the front desk and tried to stay relaxed about it. but I must say that it has surprised me that the hotel did not apologies to its guests because the atmosphere was not nice. 5 weeks later I booked this hotel again for a city trip with my daughter I had booked deluxe room but received the smallest room in the hotel. Complaining did not help. Maybe I should have made a big issue out of it. But that is not my style. I am going to Paris next month and although this hotel is very lovely and briljantly decorated, I do not think with these experiences I will book this hotel again. I expect 5 star class service for al the hotel guests and not only for the politicians or high profile guests.", "Date": "March 17, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "5.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Mexico City, Mexico", "Title": "“EXQUISITE”", "Author": "marianasotoj", "ReviewID": "UR126092841", "Content": "I went 2 weeks ago and I undoublty recommend it. Trendy, fashionable and classy. Very good service. Rooms are very comfortable and well equipped. Great experience", "Date": "March 14, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Crans-sur-Sierre, Valais, Switzerland", "Title": "“Amazing service!!”", "Author": "Gaby C", "ReviewID": "UR126054444", "Content": "The service overall was great!! especially in the bar!! great attitude of the staff, always willing to serve! The hotel looks amazing, the bar is super trendy and worth having some drinks! I really recommend this property!", "Date": "March 13, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Los Angeles, California", "Title": "“Formidable”", "Author": "G Z", "ReviewID": "UR125978078", "Content": "Finally a nice palace in Paris. Designed by Philippe Starck, the hotel is an experience. The rooms are amazing: modern, luxury and warm: all the 3 ingredients i was looking for in Paris The service is aplace service and everyone does it best to offer the best to the guest. I have tried the restaurants, they are very great and not over priced like in so many palaces in Paris. Food is simple, not pretentious and so good. i had a full experience of the hotel, and the spa is gorgeous, 10 times better than the standard offered in this category hotel in Paris. Tried it once and for sure, will come back there Bravo", "Date": "March 12, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Paris, France", "Title": "“Excellent Hotel”", "Author": "Amerbeck", "ReviewID": "UR125633193", "Content": "This hotel is simply one of the best experiences I have had in Paris as I do travel very often to this cityr! The ambiance and style are simply amazing not to mention the service excellence! The bar offers many different drinks that you cannot find anywhere else in Paris and the decoration by Starck is out of this world. If you dont stay in stay at the Royal Monceau you have to have diner and hang out at the bar in order to complete your stay in Paris! I strongly Recommend!!!", "Date": "March 5, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Brighton", "Title": "“Luxury hotels and art do mix - This is the result”", "Author": "JDTRAVELBrighton", "ReviewID": "UR124345819", "Content": "This is a luxury hotel, and one of the few Parisian hotels, justifiedly awarded the coverted 'Palace' title. This is luxury, but discrete, and with quirky features. There is a rare art book shop off the foyer, and an amazing staircase, with beautiful chandeliers. This hotel is typically Parisian, and although in many ways traditional, it is also very modern. Modern art adornes the walls, and the rooms, have paintings and other object d'art in the rooms, making them less like hotel bedrooms, and more like staying a a friends extremely luxurious Parisian house. The bar is trendy but still traditional at the same time, with an amazing, and changeable cocktail list. There is a smoking room, so no standing outside in the cold and rain, it was very cold when I was there!! Both the restaurants are excellent, the French restaurant has a fabulous menu, and the staff, although incredibly knowledgeable, are also very relaxed and friendly, so you do not feel overwelmed by the staff who are assisting you. For spa lovers, you will be spoilt, as you will alos be by the size of the luxurious indoor pool. I thoroughly recommend this hotel, and will, I hope be back.", "Date": "February 9, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "3", "Overall": "3.0", "Value": "1", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Lugano", "Title": "“Royal Mistakes”", "Author": "markwlugano", "ReviewID": "UR123534702", "Content": "Take a beautifully designed suite,add a lot of electronic gadgets and what do you get.....Room failure.... Beautiful electronic toilet didn't flush....TV cleverly hidden behind mirror did not show pay movies... Internet password system failed...Cleverly designed desk not so intelligent.. couldn't fit my adapter into the plug socket.... couldn't get the lights to work in my toilet room. Other issues...poor breakfast (truffled eggs were salty and did not have a hint of truffle in the taste ...Wine stained sofa in my living room. The gallery suite i stayed in is is cool chic and elegant but is spoiled by horrible plastic smoke detectors. The service however was excellent and the lovely guest Relations lady deserves a special mention for her warmth and attention. Will not be my new hotel in town however...too many mistakes at that price. Favourite thing...Prettiest wall-safe in History,hidden behind a mirror with a intricately carved handle....", "Date": "January 24, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Doha, Qatar", "Title": "“Luxury and top food”", "Author": "fabbas", "ReviewID": "UR123107327", "Content": "Excellent location, great food, supernice rooms. Very funky modern hotel. Rooms even have guitars :) and the huge TV screen is hidden inside a mirror. Toilet was huge and modern/clean. Breakfast was amaaaaziing. Downside is that its expensive but you can see why.", "Date": "January 15, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "St. Moritz, Switzerland", "Title": "“just amazing !”", "Author": "powdersnow", "ReviewID": "UR122515233", "Content": "stayed three nights in this cosy place just before Christmas. The Starck design is well done and the technique in the room (big Screen, music programms) was fantastic. Good, lively atmosphere in the lobby bar. The absolute highlight for us, was the behaviour of the staff. At the time the attitude in a french hotel was often on the arrogant side. Not this time at the Royal Monceau. Everybody speaking perfectly englisch. This in France ! Well done! A bit costy but worthwile to enjoy some super city days.", "Date": "January 4, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Monte-Carlo, Monaco", "Title": "“Philip Starck has created a wonderful universe of beauty and luxury”", "Author": "Lisbeth R", "ReviewID": "UR121389828", "Content": "Let me tell you that this hotel is one of the most beautiful I have stayed on. Philipe Starck has created a fantastic universe with a mix of minimalistic quality design, strong colorful effects and surprising compositions. From the minute you enter the hotel you sense the high level of service, that Raffles is known for in Singapore. The staff is immaculate and it goes for all services. You are even offered help to unpack your suitcase. Fruit and mineral water is served in your room as a courtesy. Le grand salon and bar area are both grand in a modern way and you immediately want to hang out and just inhale and take in all the details of this beautiful place. The restaurant is impressive. The colors, the back wall with all the bottles lined up and the 6 chandeliers gives a special effect. All perfectly combined with a beautiful result. The rooms are amazing with surprising effects. A rose on the wall as part of in a carved wooden vase. A guitar on the floor and other special details make you feel the personal touch. And the bed is wonderful. But please remove the blue diode next to the door. It is disturbing the sleep when it lightens up the room at night. And thn I missed a makeup mirror. The food is delicate, and even the croissant and coffee is a delicious experience. Let me tell you I have fallen in love with this place. Well done.", "Date": "December 4, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "cairo", "Title": "“style, fashion, luxury”", "Author": "doudacairo", "ReviewID": "UR121160242", "Content": "near many places so you can easly walk. rooms :very comfertable in all aspects spicily the bed ., lighting , bathroom, everything is high standered . food@ the resturant and the room services excellant with excellant staff. best of the staff , by far the doormen , things need to improve , some of the reception staff + housekeeping need to improve . had bad incident with one of the girls @ the reception whom acted as if she is the guest forgetting the standered of the place but when i did thier survey that they sent me by email i received at once an apology by the hotel which was nice touch.", "Date": "November 28, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "london", "Title": "“Favourite hotel of all time.”", "Author": "dutchmike82", "ReviewID": "UR121079650", "Content": "I have stayed in many hotels, and this has got to be my favourite of all time! Every small detail is taken care of. From the personalised service to the decor. Prior to check in I informed them that it was for a special occasion (engagement) and they took such good care of us. We were given a complimentary upgrade and an amenity which was very much appreciated. If you like a modern contemporary feel this place is definitely for you. Mirrors, stripes, tv's hidden behind mirrors and the rooms have a real artsy feel about them too. A guitar in the corner, writing on the lampshade, modern writing desk and so much more. Service was great. Iron and ironing board was up within minutes and when I informed him we had a problem with the TV an engineer followed straight after. Food was delicious too, from the room service breakfast to the main restaurant. I couldn't fault it. If this is slightly above your price arrange I would say just go for it, you definitely won't regret it.", "Date": "November 27, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Brighton, United Kingdom", "Title": "“You want a design hotel, this is for you!!”", "Author": "robert m", "ReviewID": "UR120695503", "Content": "I have only ever done 1 review on trip advisor before however my experience at Le Royal Monceau in Paris has made me come back on here. I would like to say how fantastic this hotel is, I was immediately impressed as soon as I walked through th door. The room that we were allocated was amazing, very impressive. I was in Paris to take my daughter (nearly 23 months) to Disney Paris but didn't want to stay at the park as I can only take so much Disney before my head wants to explode. I'm glad we stayed at the Royal Monceau. It is actually very hard how to describe this hotel, plenty of mirrors, silver everwhere yet tastefully done. I would go back to this hotel in a heartbeat.", "Date": "November 17, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "wancha", "Title": "“I love everything of this hotel”", "Author": "luxuryFR", "ReviewID": "UR119948803", "Content": "if you are looking for a unique experience, a 2 days trip in Paris disconnected from every hotel you already know, this is the right place to stay. Outstanding and outrageous decoration (we liked it very much !!!), super 5 stars service, expensive and premium cuisine (the Chief Laurent André is just one of best chief we ever experienced), from A to Z, everything is perfect. Just get the right partner to go there and simply enjoy. Worth every penny you will spend !!", "Date": "October 31, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "CERB2010", "Title": "“Breathtakingly good”", "Author": "CERB2010", "ReviewID": "UR118642998", "Content": "This is a really wonderful place to stay. The interior design is world class (as you would expect from Philippe Starck) - the hotel is itself a piece of art. Our executive room was huge (the size of a suite in some other 5* hotels we've stayed in) and the clever use of mirrors made it look even bigger. The service was quite literally the best we've ever experienced (including in Mandarin Oriental hotels in Asia) - they even offered to unpack our bags! No effort was spared to ensure we had an amazing time. The hotel's art collection is interesting and their Art Concierge was very happy to explain all about it without any hint of pretensiousness. Breakfast was delicious - we particularly liked the baby strawberries in the fruit salad and the deliicous rose & lychee yogurt ! The beautifully deisgned new spa was also fantastic - the treatments whilst not cheap were first rate, and the pool was huge for such a centrally located hotel (again the use of mirrors made it look even bigger). We did not have the time to use the gym but it had a range of up to date equipment. Highly recommended and we will definitely be back!", "Date": "September 27, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "3.0", "Value": "1", "Sleep Quality": "5", "Rooms": "3", "Location": "5"}, "AuthorLocation": "mashhad", "Title": "“great location but highly over priced”", "Author": "hamidrezamonshizadeh", "ReviewID": "UR118460212", "Content": "first of all location of the hotel is excellent,5 minutes walk from the arc de triomphe and famous avenue des champs-elysees. the hotel is modern and also room,but not comfortable.bathroom is large with lots mirrors and tv is hidden in the mirrors in front of bed,the bed,s just perfect.the window opened out onto the lovley courtyard below so fresh air could be let in without any noise issues.you cant go to courtyard because said the manager of hotel is waitting for legal permission from neighbours!!!business center is very good and it,s open with your card 24hours day with free internet. there is a very poor buffet breakfast that served in the restaurant on the ground floor.a bit of disappointment from the buffet breakfast(poor selection of juice,yoghurts,sausage!...)it,s not your expectation from 5 star hotel as this price!!!! overall i would never stay here again,big reason for me le royal monceau paris is not comfortable hotel and you are not warm feeling welcome from staff!!traveled with family", "Date": "September 22, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "4", "Service": "5"}, "AuthorLocation": "amsterdam", "Title": "“simply stunning”", "Author": "sylvain7", "ReviewID": "UR117987070", "Content": "For anyone who has seen it all, is fed up with fake Louis XVI style interiors, has had it with luxury without fashion, go no further: this is your hotel. Completely redone by Philippe Starck, this is an absolute gem blending style with fashion and luxury. The hotel itself is stunning in style but also extremely efficiently built.The rooms are even better. Even the lay-out is different, with the bed in the middle. (Bed)lamps, chairs, the walls, everything fits and is special. the bathroom is even more unique with lot's of specially crafted and styled mirrors and great lighting. Service is also excellent, as is the location of the hotel, within 5 min walk from the Arc de Triomphe. The hotel has an great spa, a brand new and fairly large gym, with very helpful staff and even a beautiful swimming pool (very rare in Paris). There is only one problem for some: if you are not happy with your looks, dont go here, there are mirriors everywhere (the elevator is one big mirror), so there is no way to avoid yourself. Kidding aside, this is one of the most stunning interiors I have seen. Not for everyone, possibly, but again, if you have travelled a lot, are in for a change, and are in Paris, you should try this one out. You will not be dissapointed.", "Date": "September 12, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Service": "5"}, "AuthorLocation": "seattle", "Title": "“Delightful, Delicious Bedding; A Modern yet classic hotel - Paris!”", "Author": "lajolla1", "ReviewID": "UR115235092", "Content": "An excellent pairing of new meets tradtional Paris. Welcome at entry is inviting, polished and professional complete with the doormen who both look and act the part as professional welcomers/helpers with heart. Kudos to the team at the front - (and those that hired and trained them). Our welcome by the front reception was again polished and efficient. Every time we came down, we were greeted with a smile and a genuine good attitude. Breakfast in the restaurant was always lovely though we often ordered croissants (requested them to be warm) with our morning coffees to our room. They arrived warm and were so good. One day they were very late and when finally delivered, they apologized and said it was on the house. I didn't even say anything and they were proactive to assuage the situation. Kudos again to them! Again, the staff (sorry i forgot all the names...the young man who checked us in whose name begins with a G, and the lovely young woman who must be part Japanese and French were a few of the folks who stood out but all were good...and the kind doorman with the long eyelashes). Re: service: I had forgotten my hair curling iron and was told they could bring me one. This did not happen and i was encouraged to visit Sephora for one...they don't carry them. My mistake for not bringing it but it is always a plus when high end hotels carry some extras. They did manage to find a great hair stylist to come to my room, Samira - she was lovely (pricey). Concierge was fine. I asked for a print out of some specific restaurants one morning hoping it woudl be in my room that evening...but no luck. That said, they may have expected me to pop down again for the information but we were just too busy. Okay the hotel...let's start with the bedrooms. We had a great room towards the end on the 4th or 5th floor - possibly 511. Nice layout. Enjoyed the big mirrors and tv's hidden in the mirrors in front of the bed and behind it too. The murano like lights in the room were fun as were the desks with the maps of Paris marked up as if by a friend inviting you to explore the city were great. The bathroom was all mirror...wow. At first a bit overwhelming, but clean, crisp and fun. I had to use one of the sinks to lay out my make up as not enought room to spread out one's toiletries. Yet, with a washcloth laid out on one of the two flat sinks, it worked well. Bring your own lotion as Stark does not believe in lotion at hotel. , i was told. The hotel did provide me some upon request, but it was i think from the spa or a local store. That said, the bath oils and packaging of their toiletries were lovely. The only odd thing in the room was the picture of fruit, but i suppose that is a matter of taste. Overall, the hotel is modern yet you still very much felt you were in Paris! As many of you know, when designers go modern they sometimes seem to want you to forget where you are, but not Stark on this project - good job on this! (and i am not a huge Stark fan so this compliment comes from my experience at the hotel not from getting caught up in his reputation). The hotel lobby bar area is quite convenient - you can have good conversations (not too noisy and feels private enough) and yet still enjoy some good people watching. The choice of putting the books up high is interesting. The people at the hotel when we were there appeared to include a crown prince from Asia, ministers from the Gulf, and other interesting whose who...of a whose who who were not too flashy...just interesting and chic. It was a real treat to enjoy the newly unveiled Le Royal Monceau - Raffles and Stark got it right! Oh and did i mention the beds and bedding....ahhh divine. Loved the mattresses, bedding, pillows, slippers and robes, and the views to the courtyard below and greens on the terraces above...and the windows opened out onto this lovely area...so fresh air could be let in without any noise issues. Yes, the beds just made me want to dive into them - making the Parisian night special all the way through til morning. Merci! And the location is just fine...close enough to walk up the Arc de Triumph and down the famous boulevard. And if you want some restaurant ideas....oh i have many...including just go to St Germaine and wander...find an older restaurant with lots of people inside and enjoy. There are so many great culinary experiences including the new Akrame, opened about 3 months ago. low key place but chfe is talk of town...ex gagnaire/el bulli but very much his own style. Also you might like Spring restaurant.", "Date": "July 11, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "3.0", "Value": "1", "Service": "3"}, "AuthorLocation": "Venice, Italy", "Title": "“I am not a “FAN””", "Author": "aliabdulla77", "ReviewID": "UR115015349", "Content": "To make a short story short, at four In the morning I called the reception cause the AC wasn’t working, they sent the technician who couldn’t do anything. Instead of offering me another room immediately, they offered to send me a fan! When I got upset they asked me to move my stuff to another room AT 4 AM! When I got very upset they finally sent me to another room to have my sleep. They were all apologetic next morning, but forgot to send me an official apology like any other well established establishment would do!", "Date": "July 4, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "5", "Overall": "1.0", "Value": "1", "Location": "4", "Rooms": "3"}, "AuthorLocation": "London, UK", "Title": "“soulless, and terrible service”", "Author": "tbretagn", "ReviewID": "UR114709081", "Content": "report on the royal monceau, paris booked on my way to paris an executive room (highest room level) nice quick and easy booking on the phone. said i was arriving at 12 (ie 3h later). arrived at 12 h30, nice reception contact, but room only available at 2 pm (ok it's typical for hotels of that standing) reception showed me the bar but left me there on my own to find a seat. the usual way of proceeding is to bring to a table, call a waiter and offer a coffee so the guest is taken care of by bar staff and not left stranded. after watching half a dozen guys moving around pretending to be busy  i managed to grab somebody asking for an espresso macchiato (stressing macchiato). 15min later he brought me a very beautiful cup of espresso. seems the macchiato got left out of the equation. by the way there must have been 15 patrons at the time (seating capacity is around 60) i don't correct this as i don't want to have to wait another 15min. crowd is the usual blend of high net worth individuals, small business meetings, corsican mafia, etc... bar is pretty soulless, bits and pieces of art (books, photos, small objects,...) no bar per se (ie where you can chat with a barman) as all preparation is done behind a wall of bottles and glasses. cute but they have to get a ladder to reach the good spirits. pretty comical. had to rush to an appointment and as i asked to put my ipad back into my bag as they were keeping it they brought me to the bagage room at the back to do so. i don't mind as it's quicker but standing means you don't show the ropes. somebody should have brought it back to me and taken care of that. went back to the hotel around 5 h30 brought me to my room. on the first floor (not great but they had told me they were pretty full with the le bourget air show), right next to the fitness center (that full?) introduced to the usual systems blabla. first impression. it's colorful, there's design furniture but it's crammed. toilet is near the entrance. they stuck the bed with the mini sofa and basicaly there's minimal space to navigate around the bed. miniscule bedside tables (i mean the phone was hiding the light switches). bag is on its stool but space for clothes is minimal (only half dozen hangers and space only for that many) i know i said i was staying alone but that is really bad. big mirrors on both walls with integrated tvs (i do not watch tv so no real use unfortunately). bathroom is very large with mirrors all over the place, fancy bathtub. design appliances. they forgot about the fact design appliances are not functional.  the unit where the towels are out of the shower is actually a radiator (yes that means you burn your hands the first time you grab it getting out of the shower) and i couldn't find the switch for the drain in the sink (and i really looked as i'm an engineer and couldn't figure out where the designer would hide it). its always nice to find that out after you brush your teeth. shower is great but shower gel and shampoo are really bland. cubic push down  bottles of unmarked bland product. i came back at 12h30 and went to the bar to grab a nightcap. same waiters too fast paced to check on patrons, took 10min for somebody to show up, another 10 to ask for my drink and more than 15 to make a whisky sour. nice drink but there were few patrons so it shouldn't take that long. ( i was texting my wife so i had an exact timing) to give an example an american staying with his wife arrived at the bar at 1h10 and was told the bar was closing at 1h30. they brought them menus at 1h20, took the order at 1h30. the guy asked for a nice single malt whisky. nobody in the staff had any clue. they showed him in the end the most expensive (\"very nice single malt, a bit oakey\" was the commentary they gave). i left at 1h50 and don't remember seeing a glass in his hand. and by the way the first time i went out pack in hand for a smoke the staff intercepted me and asked me if i was leaving (as in you forgot your bill). not very heartening. i went the next morning for breakfast with a friend who works nearby (i had booked a table the night before but not many people where there at 9h30. was very nicely welcomed and brought to a table, offered a glass of a fresh pressed juice of our choice and some very nice coffee.  then we ordered continental breakfast with some boiled eggs on the side. eggs arrived first, perfectely cooked and presented they were delicious. but then again people were \"busy\" wisking around and after some time we managed to grab somebody to get us the bread and fruit salad (and again it took a while). his french was pretty limited. he asked us if we wanted more coffee and he had such a hard time understanding \"cafe au lait\" that we ended up asking for \"the SAME please\". i hate raising my voice but the guys were really useless. my friend was also really annoyed (and we are very laid back people so it takes a lot to get us to that level of annoyance) i returned to my room at 11 to find out that somebody had come and took the dirty towels and half the bed sheets and duvet cover. i was booked for one night only they have a log of this kind of stuff and they should know not to clean before check out. also i've never encountered a room half done before. either people are in there cleaning it or they are not doing it. i decided to leave right there as it felt of being told to go. in the end it was a pretty bad experience, completely sub standard, and also it's a very soulless hotel which made the experience a complete flop (i'm a contemporary art collector and was expecting a lot as it's the signature of the hotel). i have stayed in most 5 star hotels in paris and i know what one should expect for that level of price.", "Date": "June 24, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Campinas, SP", "Title": "“Royal Monceau - Raffles Paris is great, beautiful Palace!”", "Author": "Nanda2011", "ReviewID": "UR99283459", "Content": "It is all about luxury from check-in to rooms furniture and restaurant. The service was great. We had a wonderful and magic experience at this genuine palace.", "Date": "March 7, 2011"}], "HotelInfo": {"Name": "Le Royal Monceau-Raffles Paris", "HotelURL": "/ShowUserReviews-g187147-d197528-Reviews-Le_Royal_Monceau_Raffles_Paris-Paris_Ile_de_France.html", "Price": "$786 - $1,03", "Address": "<address> <span rel=\"v:address\"> <span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">37 Avenue Hoche</span>, <span class=\"locality\"><span property=\"v:postal-code\">75008</span> <span property=\"v:locality\">Paris</span></span>, <span class=\"country-name\" property=\"v:country-name\">France</span> </span> </span> </address>", "HotelID": "2515188", "ImgURL": "http://media-cdn.tripadvisor.com/media/photo-f/02/25/a6/5d/le-royal-monceau-raffles.jpg"}}