{"Reviews": [{"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Sleep Quality": "3", "Rooms": "4", "Location": "4"}, "AuthorLocation": "", "Title": "“Good location, decent rooms”", "Author": "Summer188", "ReviewID": "UR128558420", "Content": "Check-in was fast. We were given a room on the 2nd floor. I purchased the hotel with my air ticket so I was not able to get Hilton HHonors points. The location was good, close to freeways, shopping and food. I was told at check-in that there would be window washing that day. After we had settled in, we heard loud noise and a man was at the window looking at us as he begin to wash it. Not a big problem because I would want a clean window, so we shut the curtain. The view, however, was a rooftop. It was a very noisy room, however, because our room was right next to the gym (banging which I think were the weights in the gym). I called the front desk to complain because it was late at night. The following day, we were gone most of the day. We returned at 3:30 to find that the room had not been cleaned yet. At 3:45 we got a knock on the door from housekeeping who was now ready to clean our room. It was good for the price and location.", "Date": "April 24, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "", "Title": "“Awesome place to stay!!”", "Author": "Abcdefgdddjsj", "ReviewID": "UR128542961", "Content": "The Hilton in Mission Valley is one of the best places I've stayed. From the moment you pull up, the staff is very professional, friendly and always willing to help. The rooms are always clean and spacious. Very comfortable beds as well. Good location to freeway access; wether you want to head to the beaches, old town, downtown, east county, etc. I will be returning.", "Date": "April 24, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Los Angeles", "Title": "“Fun in San Diego”", "Author": "kardex2dog", "ReviewID": "UR128444165", "Content": "Stayed at the Hilton San Diego Mission Valley Hotel with my husband for a yearly convention always held in Southern California. The front desk staff and bell staff were very helpful as we arrived early and rooms were not quite ready. They stored luggage, rang me up on my cell phone when the room was ready. Room was large and nice flat screen tv -- overlooking a garden (which was what I had requested). They didn't tell us that it was upstairs on the second floor with no elevator but we managed. We used the tennis courts during our free time and it was really nice watching the sea gulls perched on the tennis court lights as though criticizing my play. The conference facilities were very nice and the room kept at a comfortable temperature. I would stay here with my husband for a pleasure trip.", "Date": "April 23, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Wyckoff, New Jersey", "Title": "“this place aims to please”", "Author": "ezdraft", "ReviewID": "UR127925097", "Content": "i was lucky enough to get this hotel via one of those blind bid travel websites. They were fast at checkin, very helpful and the place is so nice, the bed is firm, plenty of pillows. I asked for towels because my daughter used all the towels and in minutes they brought 2 more sets of towels. Easy checkout too.", "Date": "April 15, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Sleep Quality": "2", "Rooms": "2", "Location": "3"}, "AuthorLocation": "Ankeny, Iowa, United States", "Title": "“Not my typical hilton experience”", "Author": "Jennifer W", "ReviewID": "UR127437904", "Content": "Stayed for business after being at another hilton the night before. Proprty seemed run down and myself and my co workers in different floors all noticed a lot of noise during the night. I agree with another review that other lower cost hotels have been better.", "Date": "April 7, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Location": "4", "Rooms": "3"}, "AuthorLocation": "Bakersfield", "Title": "“I think i would have had a better stay at a lower budget hotel.”", "Author": "Christy W", "ReviewID": "UR127163477", "Content": "The rooms were nice and the pillows and bedding were better than normal, but that is all I can say nicely. When you take the elevator from the parking garage to the lobby it reeks of cigarettes, I got the spare blanket and it had a rice crispy cereal stuck to it, and i can't believe that a hotel like this doesn't have a continental breakfast.", "Date": "April 2, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "3.0", "Value": "2", "Sleep Quality": "2", "Rooms": "3", "Location": "4"}, "AuthorLocation": "saint paul MN", "Title": "“this is a Hilton?”", "Author": "twincitiesvac", "ReviewID": "UR126999639", "Content": "First off the staff were super from check in to trying to connect to the wifi. the room on the other hand needs some help the walls are PAPER thin it was hard to hear the noise from the \"city view\" freeway noise because of the conversation between a mother and daughter and it was at normal speaking level next door or the couple on the other side. the room had no mini bar or mini refrigerator. the room did have a nice amount of space and was clean and well maintained but not very many amenities in it either.the king size bed was nice and the pillows comfy. The parking lot is not well lighted small spaces and bad layout and at 16 dollars a day in this part of town really? it does have a great location to access the freeways of San Diego over all underwhelmed.", "Date": "March 31, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Sleep Quality": "4", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Lafayette, Indiana", "Title": "“Travel to and from airport expensive”", "Author": "123barrister", "ReviewID": "UR126760260", "Content": "Travel by cab for 7 miles and 10 minutes was $30. The Blue shuttle was $12 if you could get it. Parking at the Hotel was $16 per day. There is an Enterprise rental car office about a quarter mile from the Hotel. Parking plus airport rental rates makes renting after you get to the Hotel a much better option if you don't need the car every day. The Hotel was a good place for a big meeting with lots of space to get together outside the meeting rooms. there are food options in the Hotel and all around the area.", "Date": "March 27, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Santa Monica, California", "Title": "“Business friendly!!”", "Author": "Wendy B", "ReviewID": "UR126568080", "Content": "I had a group of 20 people staying at the Hilton for a 3 month period. The sales staff really worked with us to accommodate our special needs! Always friendly, professional. The rooms are updated and comfortable. It is a great central location. Every store you could imagine is close. I would recommend any group check this hotel out!!", "Date": "March 23, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Las Vegas, Nevada, United States", "Title": "“great stay”", "Author": "Dan G", "ReviewID": "UR126369504", "Content": "From the moment i walk in the stay was great. I walk in at about 3pm and the staff welcomed me with a warm smile, right to the counter. Check in was very fast. When i get in the room the lay out was nice . STD King . I had a view looking over the city. The bed was nice but the best part was the pillows, six of them on the bed and one more in the closet. Not that you would need more then one . Usa today at the door every morning. All in all great stay great staff.", "Date": "March 20, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Albury, Australia", "Title": "“Good value for money-Good location”", "Author": "JB072", "ReviewID": "UR126368165", "Content": "We stayed at this hotel on our trip to the USA last year - pregnancy, study and a baby have delayed my review until now! We booked the room just a few days out of arriving in San Diego and whilst this place is out of the main SD area - we had a hire car and wanted to see the city anyway - so it made no difference. Checkin was great and the car was taken care of stright away. NOt all of the valet parking is undercover, but we had no issues. The room was a good size, blockout blinds and the bathroon was functional and clean. We had room servie the first night as we'd driven from LA late in the day and the only downside to this was the lack of larger table in the roon on which to eat. The food was fast and good qualiity. The location of the hotel seems a bit out of the way until you realise there is a large mall over the freeway (easily accessed via walking the path out of the hotel and up tot he right) as well as several other restuarants such a Hooters and other pub-style food. There were a few people living roough in the area, which we came to get used to after a few weeks in the USA, but they were no problem and we walked to and fron the htoel and shopping. eating area daily and at night without incident.", "Date": "March 19, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "2", "Sleep Quality": "2", "Rooms": "2", "Location": "3"}, "AuthorLocation": "Tucson, Arizona", "Title": "“Won't return”", "Author": "Jacalix", "ReviewID": "UR126071731", "Content": "My husband stays here probably 8-10 times a year on business. I decided to tag along n this trip and I am disappointed. He is a Hilton diamond member and this hotel is not up to the standard of a lot of Hiltons...maybe a Hilton Garden Inn or the like. Rooms are run down to sat the least. Doors are peeling, cabinets are peeling, floors are stained, elevators shake, decor is old and dated in rooms. I took time to read reviews and a new T.V does not make up for any of this for me. Beds are not comfortable either which does matter. Cleaning people stood outside our room for 20-30 mins this am and talked to point where I could hear them over traffic. Unfortunately I have another 3 nights here while my husband has business. If it wasn't a work contracted hotel I would be gone :( He also now realizes that he will be asking for other approval elsewhere.", "Date": "March 13, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "3", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Ellicott City, Maryland", "Title": "“Great helpful staff”", "Author": "Sally D", "ReviewID": "UR125796282", "Content": "I've stayed here for business 3 times and each time everyone was amazing.The restaurant could use a little variety for dinner but it's really easy to get here from the airport if you're traveling for business. The hallways near the elevators need to cleaned a little but overall very clean.", "Date": "March 8, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "San Diego", "Title": "“Wonderful stay at the Hilton Mission Valley”", "Author": "pbpetlover", "ReviewID": "UR125716066", "Content": "My husband and I stayed here for a little getaway - we live in San Diego. Check in was very quick and we were even able to check in early. The room and pool/jacuzzi area were both very nice. We really had a great time and the staff was very pleasant. Plenty within walking distance for eating options. All in all it turned out to be a great place to just kick back and relax!!", "Date": "March 6, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Huntington Beach, California", "Title": "“AMAZING Hospitality!”", "Author": "Bunners55", "ReviewID": "UR125475543", "Content": "We stayed here for a supercross event, even the maid was extremely friendly! When we checked in they were really friendly and helpful to change our rooms around to accommodate last minute reservations. I really recommend staying here whenever your in the mission valley area! Hector the general manager ROCKS!!!", "Date": "March 1, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Anchorage, Alaska", "Title": "“Great location”", "Author": "Josh W", "ReviewID": "UR125295305", "Content": "Great location in mission valley. Must pay for parking. very nice comfortable bed. Staff is friendly and helpful.", "Date": "February 27, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "3.0", "Value": "3", "Sleep Quality": "4", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Saint Louis, Missouri", "Title": "“Weekend in San Diego”", "Author": "familyvacation3", "ReviewID": "UR124970855", "Content": "After reading some of the other reviews I was a little nervous about what to expect. We checked in after 8 pm so our room was ready, the front desk staff was more than helpful, all were very nice. The first night a king room was not available, so we had a double bed room on the back side of the hotel facing the hill. Very quiet, room was nice. The next day we moved to a king bed room on the front side facing the highway, which really wasn't a big deal. You could hear the highway noise, but unless an emergency vehicle with sirens blarring went by (which only happened once), we really didn't notice the noise. Yes the location is congested, be easy enough to maneuver. We walked to the trolley station located on the far side of the mall and didn't have any problem - all intersections have crosswalks, area seemed safe enough. The room was clean, maid service was great, (and seemed shocked when we told her she didn't need to clean our room one day), coffee maker in the room and fridge in the king room. I only gave this hotel an average rating because the most annoying thing to us was that they charged you daily to use internet service in your room, or you could sit in the lobby and use the wi-fi for free! Sitting in the lobby didn't bother us, so we did. They also have an office set up with computers and a printer that you can use free of charge, which was helpful the few times we needed to print a document. Overall our stay was nice. The hotel staff, whether the front desk, maids, concierge, whomever, were all very pleasant and helpful.", "Date": "February 21, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "", "Title": "“Great getaway”", "Author": "Sportsinfo101", "ReviewID": "UR124963870", "Content": "Had a very nice experience at this property. Have stayed here once before a few years ago and came back for a short weekend visit. Room was nice, staff pleasant and would come back again.", "Date": "February 21, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "5"}, "AuthorLocation": "North Brunswick, New Jersey", "Title": "“Decent Hotel”", "Author": "mholi", "ReviewID": "UR124477408", "Content": "I recently visited this hotel on a business trip. I arrived at the hotel at 3:30 and my room was not available. Check in at this hotel is 4pm. The front desk staff was helpful and gave me another room within 10 minutes. I would suggest requesting a high floor since the lower floors are a little noisier due to the highway. My room was on the 10th floor so I did not hear any noise. The room was decent. The bed was ok but not as comfortable as most hiltons and the room tempature was hard to regulate. It would not get cold. There is no executive lounge so the hotel offers you breakfast ( nothing to write home about) and a non alcoholic beverage and an appetizer ( limited menu). I wasn't wowed by the food but the staff was nice. The location is great since it is right across the street from the Westfield Mall and 1 minute away from the highway which was great. I usually stay at the Westin Downtown but decided to try a different hotel. Overall it was a decent hotel in a good location if you need highway access. I would stay again if the rate was lower. Otherwise, I would rather pay for a hotel more reminiscent of the Hilton brand.", "Date": "February 12, 2012"}, {"Ratings": {"Service": "2", "Cleanliness": "2", "Overall": "2.0", "Value": "3", "Sleep Quality": "3", "Rooms": "2", "Location": "2"}, "AuthorLocation": "Upland, ca", "Title": "“Lower Version of Hilton”", "Author": "coosbaygal", "ReviewID": "UR124433475", "Content": "This Hilton is far less than the regular Hilton named hotels. It was located in a very congested area, hard to get to and lacked the fine appeal that Hilton's normally give you. The wrose thing was that the breakfast trays from room service where outside of the rooms all day into the six o'clock hour of the evening, this is disgusting and not very hygenic.The price is lower than the other Hiltons in San Diego. The quality of the hotel is lower budget. I stayed here for a workshop and the hotel was cold, small and the service was slow. The parking sucks, it has small and tight spaces and they charge you 16 dollars a day for the parking. There is street parking for free, and some better hotels nearby. Whatever you do don't stay on the 2nd floor, because they hold workshops on this floor and it will be very crowded and noisey. The restaurant can not accomodate large crowds, it will take over 30 minutes to get your food, when they are busy. the restaurant was very cold so bring your jacket. The signal on the TV was lost and I had to have someone come to the room to fix it, it did appear that this has happened before since he knew exactly what to do to fix it.", "Date": "February 11, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Marina del Rey, California", "Title": "“Very Convenient, well priced”", "Author": "Kardenham", "ReviewID": "UR124299618", "Content": "My husband and I stayed here Christmas Eve. We got a great deal with name your own price from Priceline.com. Rooms were very clean, comfortable bed, good pillows. It was convenient to other areas of San Diego. Perfect for a business traveler. Wanted to use the pool, but it was not heated. Lobby rather cold, I think mainly designed to have you check in and go immediately to your room. Great, if you just want to relax in your room or want to get some work done.", "Date": "February 8, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Santa Barbara, California", "Title": "“Very nice Hilton as always”", "Author": "Nitroxprt", "ReviewID": "UR124132116", "Content": "I stay at this Hilton Property several time a year, and find it is always up to standards of the Hilton Family. The staff is friendly, accommodating, and customer service oriented. The food service in the bar/restaurant has always been excellent as has the food. (Note to buffet breakfast food service mgr. I know it is difficult to keep food hot for an extended period of time, but the eggs, potatoes, and sometimes the breakfast meats are lukewarm, not hot.) The breakfast buffet has a variety of hot and cold breakfast items. The rooms (s) have always been clean, neat, well organized and have upgraded flat screen televisions. There are plenty of outlets for computer, phone, iPad etc, and the reading light on the nightstand is bright enough to actually read a book by!!! The hotel is located near a major shopping center/retail area with numerous choices for dining/entertainment/and shopping. The hotel is also close to downtown and Old Town San Diego. This is an excellent Hilton that I will stay at again, and recommend to anyone.", "Date": "February 4, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "3.0", "Value": "3", "Sleep Quality": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Houston, Texas", "Title": "“Convenient location with quiet rooms”", "Author": "Grnwayrob", "ReviewID": "UR123935332", "Content": "Stayed here for 3 nights in a room facing the freeway, bonus was a sidelong view of the Pacific a few miles away. Despite the traffic wizzing by, never heard anything in the room. Mission Valley is within a 15 minute drive of downtown, the airport, Balboa Park, La Jolla, and Sea World. Was lucky enough to have booked a rate that included parking, I think $16 is a bit steep for what is basically a suburban location.The room is nicely furnished, and the bathroom towels were very large and fluffy. Water pressure in the shower is weak due to water saving showerheads. The entire hotel was very clean, and we never waited long for an elevator. My only issue was that at check-in there were no rooms available even at 3:45 in the afternoon. Was made to wait in the lobby for appx. 30 minutes despite having HHoners elite status. The front desk even tried to say check in time was not until 4pm, though on my confirmation e-mail from Hilton it is listed as 3.", "Date": "January 31, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "3.0", "Value": "2", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Dalat, Vietnam", "Title": "“Why paid parking?”", "Author": "David293922", "ReviewID": "UR123865767", "Content": "The room and the lobby were quite adequate. As many noted before, the elevators were very slow and non-responsive. The best feature was the pool and jacuzzi in the back of the property with a view of an overlooking hillside. Everything kept up great there by the staff (towels and cleanliness) and it added a nice tranquility. The item that put a bee under my bonnet, metaphorically and in old-timey phrasalogy), was the additional cost of parking there. $16. Besides Crowne Plaza down the road, I'm not aware of any other hotels in that area that tack on such an additional charge. There were quite a number of Asian guests there, which it probably didn't bother as much as me, since that is the norm in their countries, and is to be expected. Thank goodness for other tripadvisor reviewers that shared the secret to park on the street in front of the AM/PM gas station. But that is half a block away, and has only three spaces in front of it, and two of them are usually taken up by gypsy cab companies. And yes, I'd proudly cheap enough for this to rankle me. It's not as if the Hilton family is hurting, and Heaven knows I'd hate to deny any of the Hiltons their multi-million dollar bonuses at the end of the year.", "Date": "January 30, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Lexington, Kentucky", "Title": "“Nice hotel, great service.”", "Author": "JackAndJohn", "ReviewID": "UR123564166", "Content": "Very nice hotel, super clean, and we could walk to the trolley station and easily get to Old Town/Downtown. Very good service, would recommend.", "Date": "January 24, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Meridian, I", "Title": "“Hilton - Mission Valley, San Diego, California”", "Author": "Thayne C", "ReviewID": "UR123419792", "Content": "Great place and very convenient access to multiple places. Valet service (Hunter) was outstanding! Very quiet considering the location is next to a major interstate. Only, ding; housekeeping service failed to provide washcloths for our last night. Room was very clean and king bed was comfortable. Priceline got us a great room at a great price. Thanks", "Date": "January 21, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Southlake, Texas, United States", "Title": "“Outstanding customer service!!”", "Author": "Tom M", "ReviewID": "UR123239277", "Content": "Hilton honors member on a long trip, late arrival at this property. Alex and William at the front desk were waiting on my arrival having been notified by Hilton reservations. Bottle water, excellent room, pickup reservations for arriving family the next day. Over and above! Thanks guys, super job.", "Date": "January 18, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "4", "Sleep Quality": "3", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Mount Vernon, Washington", "Title": "“Good Place to stay if you are always running around.”", "Author": "Daren C", "ReviewID": "UR123137524", "Content": "The family and I stayed in this Hilton over the Holidays. It was close to the Zoo, and Sea World and the beaches. The Room Service was excellent and the server was very pleasant and helpful. The price was a good deal and so we did not get a room with a view because we were always running around seeing relatives, shopping, and going to tourist attractions. The issue I have is the consistency with the internet and parking at each site. They also wanted me to put a deposit down when I have not had to do this at any other Hilton site before. We did have a good time seeing friends and family", "Date": "January 15, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Porto Alegre, RS", "Title": "“Good hotel, but a little bit far from downtown”", "Author": "Claudio-1967", "ReviewID": "UR122681486", "Content": "I stayed in this Hotel during a meeting. They had a shopping center and some restaurants around, but to go to downtown you pay at least U$ 25.00 in a cab. But if you have your own car, the hotel is OK and also the location. Its clean, nice, and the employees very helpful.", "Date": "January 6, 2012"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Sleep Quality": "2", "Rooms": "2", "Location": "3"}, "AuthorLocation": "Las Vegas, Nevada", "Title": "“The worst Hilton Hotel EVER”", "Author": "Cami B", "ReviewID": "UR122269348", "Content": "I stayed at this hotel over the Christmas holiday and I want to point out that I always stay at a Hilton property and never have I been so disappointed. If customer service is important, I would not recommend anyone stay here. On Christmas day and also my birthday (4:30am) my toilet was stopped up, I called the front desk and a security guard showed up with a plunger. I was told that maintenance would not be in until later that morning. I tried to unstop the toilet and it end up overflowing. I then called back down to the front desk and told them that it was overflowing and again security showed up with towels, dawn and some spic and span. I called down again and ask for the manager and express my disappointment with the way this were being handled and the fact that he (the manager) had not spoken to me or come up to address the situation. The manager did come up after that and told me he would refund my stay. On Christmas morning I spent the day cleaning up a mess that should have been done by the hotel. I also left my email address for the general manager Hector to contact me but I have yet to hear from him or anyone else. I am not one to post rant reviews however this is one everyone needs to read.", "Date": "December 30, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "3.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Berkeley, California", "Title": "“Good Location, Dated Facility”", "Author": "davdaven", "ReviewID": "UR122241252", "Content": "The Hilton Mission Valley is a mixed bag. Front desk staff were exceptional during my stay, and the hotel was conveniently located near events I attended over the holiday period. However, it is a dated facility in desperate need of room and HVAC upgrades. There is no fresh air in the rooms, and the A/C unit completely dried out my sinuses. The bed is comfy, and the desk gets the job done, but the wicker chair needs to go. Wicker, really?! There is a nice flat-screen TV that rotates for easy viewing, but the on-screen navigation leaves something to be desired. The gym is underwhelming, although clean, and the outdoor pool is too small for proper swimming. The Jacuzzi is nice, if not a bit small. There was so much chlorine in the water that I had to wash my hair twice after swimming to get it out. The lobby area is attractive, and the Christmas tree was tastefully decorated. In terms of value for money, the Hilton does not offer free wi-fi or breakfast, and it charges an outrageous $16 per night for parking despite its suburban location. Do yourself a favor and park on the street for free to keep costs down. Friends that visited during my stay were not impressed with the hotel, specifically citing the lack of niceness they expect from a property with the Hilton name. Overall I would not recommend this hotel to others, but it's an okay place if you get a good deal through a name-your-own-price website.", "Date": "December 29, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Las Vegas, Nevada", "Title": "“Location is always a plus”", "Author": "May C", "ReviewID": "UR122023296", "Content": "Stayed here for a quick 3days Christmas getaways with the kids. Amazing location from San Diego Zoo, Sea World, down town. There's also nearby restaurants to choose from if you dont want to eat in the hotel. The staff from the front desk, the bell man, housekeeping were very courteous. Always had that smile that welcomes you back.", "Date": "December 23, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "4.0", "Value": "4", "Sleep Quality": "3", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Marina del Rey, California", "Title": "“Hotel was full of rowdy rugby players, but still a good time”", "Author": "Fitch7600", "ReviewID": "UR121814643", "Content": "When I stayed there the hotel was packed with rugby teams competing in a tournament. It was highly entertaining. Not especially quiet, but a whole lot of fun. I was part of a work group that wasn't especially quiet either. Let's just say we had a very fun Friday and Saturday in the hotel and surrounding establishments and we were all far more subdued on Sunday. We got a good rate and was a pleasant place to spend the weekend.", "Date": "December 17, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "2", "Overall": "2.0", "Value": "3", "Sleep Quality": "4", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Seattle, Washington", "Title": "“This place is a disappointment -manager does not care”", "Author": "profshanku", "ReviewID": "UR121787941", "Content": "Had to stay in this hotel due to participation in a conference. Reservation was made through my company's travel department. Check-in was quick and was given a room on the Executive floor. This hotel does not have an Executive lounge, so was given breakfast coupons as well as appetizer/drinks coupons. The room was a corner room but small. It was cold when I walked into the room at 6:30 in the evening. By 10:00, the thermostat refused to go above 64F even though I had bumped it to 75F!!! Finally called the front desk to find out if I was doing something wrong. They sent an engineer (after two calls) who came in with all his tools, took down the vent cover and spent the next 10-15 minutes fixing whatever was wrong. Thankfully the heater came on and I did not have to change rooms. Next morning there was no hot water in the shower. Considering that I was in town on business, I did not want to waste time. So after a cold shower in December, went down for breakfast. And then I had the worst experience - hair in my bowl of freshly cut strawberries. Over the last six years I have stayed exclusively at Hilton properties all over the world and this has never happened to me. It was absolutely disgusting. I went to the front desk in order to notify someone of all the issues that I was having. The gentleman showed no interest in listening to what I had to say - instead he handed me one of the standard Hilton Compliment cards/form. When I expressed my surprise, he said - \"Compliments or complaints - all in the same form\". Filled it out and dropped it off at the front desk. No one contacted me during the day. Next morning, received another \"we aim to be the best and want to get a 10 on the survey\" form from manager. It specifically said that if I had problems, I should contact him PRIOR to check-out. I wrote my email address on the form along with a brief note stating that I had submitted a complaint form and dropped it off at the desk. Checked out several hours after that and still did not hear back from the manager. The strange thing is that I did not receive any \"survey\" from the property either. Which makes me think that the staff reads the comments but they don't care. Anyways, there are several other Hilton properties in San Diego with better locations and better service. Please read the other reviews on Tripadvisor before making a reservation at this hotel and use this hotel only as a last resort. All I can say is that some properties don't deserve to carry the Hilton name.", "Date": "December 16, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "", "Title": "“Well run and dependable Hilton property.”", "Author": "theWimp", "ReviewID": "UR121465478", "Content": "We stayed here due to low rate over Thanksgiving, but the location across from the Mission Valley shopping was a nice plus. This is not a luxuriuous Hilton, and doesn't try to come across as such. I can see why business people stretched for time would stay here as the staff knows what it is doing and there are no surprises. The room was well kept and comfortable, furnished nicely. The lighting was good for reading, the bed was comfortable and the HVAC was quiet and worked well. Bathroom was not huge but it was clean with plenty of hot water. The business center was excellent which is unusual. The web access was speedy and the printers worked. We didnt use any of the recreational facilities. The breakfast buffet was very good and free for Honors members. The parking fee is aggravating but all the hotels in this area charge for it. There is a fancy, full service Doubletree nearby that may be more luxurious, and a Doubletree Club about a mile that is often cheaper. This is the better alternative if you can get the same or lower rate. There is no Honors floor at this hotel.", "Date": "December 6, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Irvine, California", "Title": "“It is a treat to be able to use the meeting room for fellowship”", "Author": "OLIVER3388", "ReviewID": "UR121266884", "Content": "We are grateful that the arrangement by the hotel manager. The stay is superb, The rooms are clean and quiet with our double bed rooms facing the hill. Convieniently located close to many of our destinations (La Jolla, Torrey pine, Cabrillo and Balboa park), this hotel is really our best choice. The staffs are friendly and helpful. If there is anything I would ask for more, I would like to have more selections in the breakfast buffet. Overall, I would recommend without hesitation for future San Diego visitors. We will probably visit again soon.", "Date": "November 30, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "3", "Overall": "2.0", "Value": "2", "Sleep Quality": "2", "Rooms": "1", "Location": "3"}, "AuthorLocation": "San Diego, California", "Title": "“NO FRESH AIR! Totally awful! Food nasty also!”", "Author": "dolldetails", "ReviewID": "UR121237376", "Content": "$65 a night, assigned to the property from the negotiator-name-your-price website. The staff is prompt and helpful. We were moved to the 14th floor after our heater was broken, which is suppose to be the top, best floor. The place looks shiny and classy. What makes this place rough to deal with is NO WINDOWS open, the door is air-tight probably for noise reasons, and their \"heater/AC\" pumps in the whiff of burnt kitchen, cigarettes, and whatever other smells. Your skin wakes up dry, and your throat chapped. You will find yourself heaving for air. I have experienced this slightly at other properties, but this has been the worst air-tight-smothering-heaving-for-air experience ever. Such a shame because San Diego is so wonderful and breezy. I know hotels have liability for kids dangling out the windows, but many properties will at least let a guest open the window 2 or 3 inches. I could only imagine a couple getting busy in the sheets what it would be like without air. What a bad idea whoever designed this! Several times we would have to open up the door and try to get fresh oxygen from the hallway. We are in our late 20's and early 30's mind you, not elderly! Such a shame! SOGGY BOUNCY beds! If you like a firm comfy bed, this is not the place! Then the lunch is nasty. Dripping wet lettuce salads. The only soup is cream of Jalapeno. The nachos taste like they came from a sleazy dive bar, smothered in green peppers. The cheese wont melt. Parking is $16 a night Ohhhh and the worse is the grainy television that looks like the 1970s If you are in the front of the property you will face a freeway and mall, the back property faces a cliff. Its pretty and green this time of year, so possibly request that. Hopefully they wont assign us here again.", "Date": "November 30, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Sleep Quality": "4", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Sacramento, CA", "Title": "“Middle of the road....”", "Author": "Ariktravel", "ReviewID": "UR121220468", "Content": "I have stayed at this hotel a few times recently. The front desk staff is great. The hotel is older and shows it in places. I stayed on the top \"executive\" floor and the room was comfortable. The bathroom large. Yes, the fixtures/plumbing/water pressure are always hit and miss. Good location with easy access to 8, shopping and dining.", "Date": "November 29, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "3"}, "AuthorLocation": "", "Title": "“Travelodge with a Hilton Sign - Shamefull”", "Author": "Williz", "ReviewID": "UR121048242", "Content": "What a disapointment! My wife's employer paid for us to go to San Diego and put us up in this hotel. The room is in need of not only renovation but repair. The cold water tap is falling off. After having a shower there was enough water in the tub to have a bath. There was plastic corner beed hanging off the corners. Impossible to get a proper temperature. We were either freezing or sweating. We had to call for faceclothes because there weren't any after the first day. The Friday night I was awakend numerous times by rowdies in the hall. The saturday night I was awakened by a frenzy of people going down the hall; when I looked out there was a large group of people with what looked like \"half the contents of a liquor store\" going past our room. This group, a few doors down proceeded to party for the next couple of hours with loud music, slamming doors and yelling. I called the front desk to check into this and after an hour or so it seemed to quiet down. I don't think there was a redeemable quality of this place. I not only will never stay here again I will never stay at a Hilton again. I think that when you stay at certain hotels you go there with a certain set of expectations of quality. This place was a total disapointment. I will say that I have never had a bad experience at the Hampton Inn - an unobvious superior chain to this poorly run establishment.", "Date": "November 26, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Denver, CO", "Title": "“Great Location”", "Author": "KOinDenver", "ReviewID": "UR121024515", "Content": "Easy to get to and close to lots of shopping and restaurants. Rooms and beds were clean and comfortable.", "Date": "November 25, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "2", "Location": "5"}, "AuthorLocation": "Jackson, Wyoming", "Title": "“Great location, but still disappoints”", "Author": "darshan s", "ReviewID": "UR120376797", "Content": "We stayed here last month as it was the closest proximity to Zoo,safari and sea world. We booked a room with 2 beds. We were surprised to see the size of the rooms comapared to other Hiltons. Front desk told us that they being a business hotel they just have rooms with either a bed or 2 beds and no bigger suites. So there was no chance we could have got a larger room, even if you are ready to pay a fee. Otherwise the desk and restaurant staff were really helpful. The valet guys were always ready with answers to any questions about the area.Its good for a business hotel.", "Date": "November 9, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Rancho Mirage, California", "Title": "“Convenient Location to all Attractions”", "Author": "Jay A", "ReviewID": "UR119997011", "Content": "This hotel is a 14 floor property located in Mission Valley adjacent to the freeway. It appeals to business travelers but can also be a convenient hotel for all tourist attractions. The rooms are comfortable and quiet.", "Date": "October 31, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "3", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Arvada, Colorado", "Title": "“Good for business trip”", "Author": "RBfromCO", "ReviewID": "UR119948797", "Content": "I recently had the chance to stay here while attending a convention near by and my experience was great. When I travel I typically stay at Hilton brands but I do expect a few things so that I want to return in the future. Good service, comfortable and clean rooms, good work space, good excercise room and easy access to my work appointments. This Hilton did a good job in all areas especially service.", "Date": "October 31, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Oakland, California", "Title": "“Must Stay”", "Author": "Michael F", "ReviewID": "UR119829646", "Content": "So far the Hilton provided a great stay during my return trip to SD in years. The rooms are comfortable and very clean. The rooms are well kept and the staff were very helpful. It was also great having a view of the closeby shopping and restaurant area making it easy to walk rather than to drive just to eat and shop. A recommended must stay. Will stay on my next visit to SD, Recruit Depot and Camp Pendleton. MFMCE53051", "Date": "October 28, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Las Vegas, Nevada", "Title": "“Great to be welcomed back”", "Author": "starbean111", "ReviewID": "UR119806373", "Content": "I stayed here last July and came back for a conference and so impressed as the employees at the parking and front desk recognized me and welcomed me back with a big smile so even I am tired from my flight but with the warm welcome I received from the hotel made my day!!! You guys have been great as always~~~", "Date": "October 27, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Chicago, Illinois", "Title": "“Great stay!”", "Author": "GBrown442", "ReviewID": "UR119804098", "Content": "I stayed at this Hilton back in May and had a great experience. The Hotel is located around great restaurants and bars. The room service was great as well. The room was also extremely comfortable, was able to get a great night sleep each time. Was a great place to stay on my vacation! Would book it again.", "Date": "October 27, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Champaign, Illinois", "Title": "“Wonderful stay!”", "Author": "Illinifan89", "ReviewID": "UR119803392", "Content": "I stayed at this Hilton recently, and have nothing but good things to say. From the comfortable rooms, to the private pool, I loved everything about this hotel. The staff was friendly and helpful, especially when it came to finding good restaurants and places to sightsee. Everything I tried at the restaurant in the hotel was delicious as well! I had a great stay at this Hilton and would absolutely stay there again.", "Date": "October 27, 2011"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Overall": "2.0", "Value": "2", "Sleep Quality": "3", "Rooms": "2", "Location": "3"}, "AuthorLocation": "sacramento, ca", "Title": "“Quickly going down hill”", "Author": "pinkins", "ReviewID": "UR119763178", "Content": "I am a HH Diamond member and I travel to San Diego many times a year to attend my son's football games. I have done this for several years and the Mission Valley Hilton used to be my choice hotel due to its convenient location to Qualcomm Stadium. I must say though, that the hotel has declined significantly over the last year or so. The little amenities they used to offer such as the refreshing fruit-filled water, free parking, kiosks to print boarding passes, and the free seafood appetizers were what made the hotel stand out from the others for me. However, since they have discontinued all of those amenities I find that there is nothing drawing me back to this hotel. The \"superior\" rooms consist of nothing more than a bathroom scale and sometimes a refrigerator (which I find annoying because of the constant humming they emanate). The front desk service is passable at best and I always have to remind the staff of what amenities need to be included for HH Diamond members. I have begun staying at the Doubletree in Mission Valley, which is just as convenient to Qualcomm Stadium, and their staff are amazing. The renovated rooms at the Doubletree are beautiful, and although they also charge for parking you can find ample free street parking surrounding the hotel. Given the choice, I would highly recommend staying at the Doubletree over the Mission Valley Hilton. The service, location, rooms, and amenities far exceed the MVH. I find nothing about the MVH that makes it stand out any longer. If you're looking for an average hotel at an above-average price then you will be fine at this hotel. However, if you like a little something extra for your money then I wouldn't bother staying here. Personally, I have canceled all of my future stays here and moved to the Doubletree in Mission Valey.", "Date": "October 26, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "2", "Overall": "2.0", "Value": "2", "Sleep Quality": "2", "Rooms": "2", "Location": "3"}, "AuthorLocation": "San Antonio, Texas", "Title": "“Overpriced, run down, Ok Location”", "Author": "halleybopp", "ReviewID": "UR119535613", "Content": "I stayed here for about $140 a night during the summer, and parking was an extra $16 a day. The rooms were old and dirty. For a fashionable town like San Diego, this place is especially run down. The location is OK, close to downtown and the airport, but far from the beaches and tourist attractions. I would probably not stay here again unless the price dropped. I think you can find much better hotels for your money in SD.", "Date": "October 20, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "3.0", "Value": "3", "Sleep Quality": "5", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Boston, Massachusetts", "Title": "“Average hotel”", "Author": "Atamel", "ReviewID": "UR119406077", "Content": "This is just an average hotel. Its located just outside downtown San Diego without much public transportation around, so you definitely need a car. It's close to Gas Lamp district (10-15 min drive) if you like going out and a mall nearby for shoppers. Parking is $16 per night which is a little pricey for a place outside downtown. Rooms are nice and clean. No free internet. I think there's a pool but I didn't try so I can't comment. There was a bar as well but it seemed dead so I didn't try it either.", "Date": "October 17, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "2", "Location": "4", "Rooms": "2"}, "AuthorLocation": "", "Title": "“If you have small children, be prepared to pay for a refigerator to keep their formula/ milk cold.”", "Author": "Monix007", "ReviewID": "UR119282511", "Content": "First off, I have stayed at several Hilton Hotels, and this one is the worst. This hotel charges for every single thing! They have ample self parking and it's $16 per day or $20 for valet. If you want a fridge (shouldn't it be standard at \"Hilton\" hotel?) it is $10 per day. If you have small children, be prepared to pay for a refigerator to keep their formula/ milk cold. There is free wifi in the lobby, but if you want to use the Internet at the convenience in your own room, there is also a charge for that. The night staff was appropriate, but they weren't accommodating enough to provide customer satisfaction. So after spending three nights here, my total alone for the extra amenities without tax was $78(not including wifi and tax). One would assume that if you're paying $129 plus tax a night for a three in a half or four star hotel, parking, refrigerator, and wifi in the room would be included. I guess not for this Hilton. Next time I'll be sure to read the fine print of amenities included, but for sure, I will not be returning to this hotel.", "Date": "October 14, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "San Martin, CA", "Title": "“Green Option”", "Author": "btaira", "ReviewID": "UR119259358", "Content": "I applaude the Hilton San Diego Mission Valley's program that allows you to choose a \"Green opt-out option\" of room service in exchange for a $5 credit (donation to Susan G. Komen, restaurant credit or gift card). It is a great program that I would like to see propagated throughout the Hilton line and other hotel chains!", "Date": "October 13, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Sleep Quality": "4", "Rooms": "2", "Location": "4"}, "AuthorLocation": "Joliet, IL", "Title": "“Can't Put This Hotel in the\"Very Good\" Category”", "Author": "richardbett", "ReviewID": "UR119208584", "Content": "If the entire hotel was like the lobby and the hotel staff, this would be a \"very good\" hotel. The lobby looks like a four star hotel & I will admit the customer service here is superb, but the rest of the hotel is very plain for the Hilton chain. Like all other comments on here, the parking is a negative...seems like the norm in the San Diego area to pay a premium for parking. It's kind of a joke, but a way for the hotel to recoup money. The pool area seems to be an afterthought. It is stuck on the side of the hotel and basically away from the entire hotel. The rooms were plain. The key readers and doors were very dated, not too far removed from the old key entry doors. Overall, if you get a deal on this hotel on Priceline, great, otherwise I wouldn't pay the Hilton advertised price.", "Date": "October 12, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Mandeville, Louisiana, United States", "Title": "“Hilton San Diego Mission Valley”", "Author": "cmsteib", "ReviewID": "UR118999664", "Content": "Nice stay, bed was very comfortable. Friendly staff. Good variety of food at breakfast buffet. Avoided the $16/day parking screw over by parking free on street. Just a short walk, so well worth it.", "Date": "October 6, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Eden Prairie", "Title": "“Great Hotel!”", "Author": "suethestew", "ReviewID": "UR118890444", "Content": "The Hilton Mission Valley is a great hotel, from the accomodating staff to the cleanliness of the hotel and rooms. We were in town for the Vikings/Chargers game and found the location to be perfect! There are so many restaurants and shopping and attractions in the area. Felt like a very safe location. I would highly recommend the hotel and look forward to returning.", "Date": "October 3, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "3"}, "AuthorLocation": "los angelos", "Title": "“Nice hotel”", "Author": "michaelhopper3", "ReviewID": "UR118798321", "Content": "The positives: it's location isn't bad, the rooms were nice, big tv. The negatives: parking is $16 a day, the location is only accesable using a secondary road and it's a little hard to figure out how to get there. The bathroom could use an upgrade and the rooms are a little small. the pocket door in the bathroom is a little weird and has atiny handle.Internet is $10 a day. I had a room with an adjoining room door in it. Too much noise (voices and TV)came through the door and light came under the door from a large gap. Water noises from other rooms was annoying(Shower running, Toilet flushing).", "Date": "September 30, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Las Vegas, Nevada", "Title": "“Amazing Expierence”", "Author": "morenoconsulting", "ReviewID": "UR118631858", "Content": "Great staff expierence from arrival to departure. Staff anticiapted my needs throughout my stay. Very close to all great San Diego attractions.", "Date": "September 26, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "", "Title": "“great hotel”", "Author": "ausspunky", "ReviewID": "UR118622298", "Content": "i've stayed at this hotel twice. each time the hotel staff, including the bar staff were wonderful. room was always clean. i do agree the cost for parking is high but majority hotels charge the same rate or higher. i will definitely be back.", "Date": "September 26, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "orlando", "Title": "“Love the weather”", "Author": "efandb1", "ReviewID": "UR118510781", "Content": "Conveinient to Old Town,Gaslamp,Zoo. Friendly staff. Decent rooms.Close to airport.Fortunately had a Priceline deal on room..$16.00 a day to park for a hotel guest is a little over the top.Would I stay here again yes,no,maybe.Also $9.00 for a drink (call brand) in the bar is really expensive,but,if u have to look at the prices you should not be there.Oh,yes Petco for baseball fans is BEAUTIFUL! as is all the above listed attractions.San Diego Zoo..the best BUT $40.00 to get in and worth it.Oh yes,hotel staff very friendly and helpful.", "Date": "September 23, 2011"}, {"Ratings": {"Location": "2", "Overall": "3.0", "Value": "2", "Service": "2", "Rooms": "3"}, "AuthorLocation": "Saint Paul, Minnesota", "Title": "“Mixed Feelings About This One”", "Author": "FlyGuy47", "ReviewID": "UR118256361", "Content": "I have mixed feelings about this place. I was here on business and held two events at the hotel. The sales manager was difficult to deal with and didn't pay attention to the details of our event. When confronted with the neglected arrangements, she was reluctant to correct them. Parking can be a problem, too... and they charge more than they should. Although they offered a discount, it was still too much to charge for an event at their hotel. And overnight guests get charged something like $14 for in/out privileges... also too much. Guest rooms are pretty standard. Views on the back side of the hotel are a hill and trash dumpsters. Public spaces are pretty ordinary, as is the restaurant/bar. As far as Hilton properties in the Mission Valley area go, I actually prefer the Doubletree (the one on Hazard Center Drive, NOT the one on Hotel Circle South) -- it's not quite as easy to get to, but there are restaurants/shops within walking distance and it just seems cleaner and nicer.", "Date": "September 18, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "rowlett", "Title": "“Girls trip”", "Author": "pearl56", "ReviewID": "UR118123857", "Content": "Very nice place to stay. I would rent a car taxi to high! Would stay again.", "Date": "September 14, 2011"}, {"Ratings": {"Location": "4", "Overall": "4.0", "Value": "3", "Service": "4", "Rooms": "4"}, "AuthorLocation": "springfield", "Title": "“Great Stay”", "Author": "brnxslices", "ReviewID": "UR118079336", "Content": "Hilton at Mission Valley was in a good location and good clean rooms. The food at restaurant inside was not the best and a little pricey. Also $16 a day to park.", "Date": "September 13, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "4", "Service": "5"}, "AuthorLocation": "Chicago", "Title": "“Trifecta! Great Staff, Rooms and Location”", "Author": "Jesse B", "ReviewID": "UR117748858", "Content": "My wife and I took a vacation to San Diego and found the Hilton Mission Valley to be a great hotel in terms of service, comfortableness and location. From the time we pulled up until checkout the entire staff we came across from the Bellmen (great restaurant recs) to the Front Desk were very friendly and accommodating. The rooms were very comfortable, clean (even for my wife;) and quiet (a must for me). The location is great if you want a centralized location to access many of the great activities San Diego offers and of course there is tons of nearby shopping. Great job to the staff once again, we really had a great experience!", "Date": "September 6, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "2.0", "Value": "3", "Service": "2"}, "AuthorLocation": "Pasadena, California", "Title": "“IF YOU BRING A CAR TO THIS HOTEL -- USE SELF PARKING”", "Author": "Paul P", "ReviewID": "UR117623272", "Content": "I spent a week at the Hilton Mission Valley in July on business. I drove from LA and the Hotel's location was very convenient to the freeways. My room was clean and comfortable. The maid service was excellent. The restaurant food was average and service was a bit slow (room service was actually faster) but that didn't bother me because there are lots of great restaurants nearby. The Hilton gift shop was a pleasant surprise. It carried a lot of things I didn't expect and has a friendly staff. The business center was adequate. I was able to print documents, make copies and send a fax. There is also a Kinko's about three miles away (for color copies). There is a daily charge for internet. I did not try the pool or fitness center, so I cannot comment on those amenities. The front desk recommended valet parking. I used my car twice during my stay. The first time, I was in and out without a hitch. The second time they couldn't find my car keys. It took them more than 30 minutes to finally locate my keys, but I did not complain. I didn't use my car again until I checked out. I was due to check out Wednesday morning, but decided to leave late Tuesday night instead. I packed my car and was happy to be returning home. As I began to drive away, I noticed that my seat and steering wheel had been moved - not a big deal. Then I saw that my radio was tuned to Sirius (which I had cancelled). It was dark and I was having trouble seeing. Then I realized my automatic lights had been shut off. There I was driving on Route 15 at night in traffic without lights. Why would someone do that? The valet service ruined an otherwise enjoyable stay at the Hilton Mission Valley. I will not be staying there again. If you stay there and bring a car, my advice is to use self-parking.", "Date": "September 3, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "4", "Overall": "4.0", "Value": "4", "Service": "3"}, "AuthorLocation": "Dunfermline, Scotland", "Title": "“Would come back.”", "Author": "Seedling17", "ReviewID": "UR117193855", "Content": "We picked this hotel primarily for the location and the Sea World & Zoo ticket deal was also attractive. Having just stayed in a very large suite in Las Vegas, I have to say the room felt very small. There were 2 beds, I would say doubles rather than Queens. There was very little drawer space to put our clothes and overall it felt very pokey. On the plus side the room was clean and the location was ideal, just minutes from Seaworld and the zoo. dont agree with the fairly high parking charge though. Would come back.", "Date": "August 24, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "2", "Overall": "3.0", "Value": "3", "Service": "5"}, "AuthorLocation": "Southern California", "Title": "“There are better choices in San Diego”", "Author": "JTVohana", "ReviewID": "UR117183159", "Content": "Stayed one night on business. Room size adequete but seemed smaller than other Hilton properties. Steady drone of trafffic noise from Interstate 8 which the hotel overlooks. Furnishings/bath OK but nothing particularly posh. Bed not bad but less comfortable than some of the signature beds at Hilton Garden or Doubletree. No concierge lounge for Honors Diamonds, you get a coupon for the breakfast buffet (pretty good) and an apetizer for dinner. Overall an OK choice if you must stay at Hotel Circle..but there are many better Hilton brand choices in San Diego", "Date": "August 24, 2011"}, {"Ratings": {"Cleanliness": "3", "Sleep Quality": "3", "Overall": "3.0", "Value": "2", "Service": "3"}, "AuthorLocation": "Rapid City, South Dakota", "Title": "“Not the best of San Diego”", "Author": "Brian_RapidCity", "ReviewID": "UR117106314", "Content": "Our family traveled to San Diego and stayed at the Hilton Mission Valley after a successful bid on Priceline. The room was average for a hotel of similar quality, but we were disappointed with the $14 per day parking and $10 per day internet. For a $80 successful bid on Priceline, an extra $25 per night was ridiculous. In addition, the restaurant (Stish) is overpriced when compared to the restaurants surrounding the hotel.", "Date": "August 22, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "3", "Overall": "1.0", "Value": "1", "Location": "3", "Rooms": "1"}, "AuthorLocation": "", "Title": "“Bad management! Shame to Hilton Hotel”", "Author": "RNoncall", "ReviewID": "UR117013948", "Content": "NO AIRCONDiTION on my room! And supposedly it is not. Enough reason for them to transfer me! So what, if you dont have available room? You have to compensate better for your flaw! The rate i paid is for a room with A/C not with a fan. Since you are not meeting the expectation, you should do something abt it! I was sweating!!!in a Hilton Hotel! My car is even cooler than the room! Very bad management! I didnt come here for the food so no need to offer the breakfast! I paid for a nice room not a room with MAlFUnCtIon aircondition and a NOISY electric fan! So demeaning!!!", "Date": "August 21, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Location": "2", "Rooms": "3"}, "AuthorLocation": "Houston", "Title": "“Okay..but poor location if you don't have a car”", "Author": "fr3houston", "ReviewID": "UR116731799", "Content": "Rooms felt a bit outdated and coffeepot was dirty and not usable, you can't really walk to anything from the hotel so unless you have a car, not a great location. Service was friendly though!", "Date": "August 15, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "4.0", "Value": "4", "Service": "5"}, "AuthorLocation": "Rancho Cucamonga, California", "Title": "“Great Service, but What's with the Internet?”", "Author": "Mrs_Kenobi", "ReviewID": "UR115877435", "Content": "I just returned from a stay at the Hilton San Diego Mission Valley. I stayed with some friends and attended Comic Con. This hotel was terrific. The service was friendly and prompt. They don't have refrigerators in the room, but for $10 per day, you can rent one. No problem. The only issue I had with the hotel was their internet service. I have 3G, and I turned my WiFi off, so why couldn't I use my internet in the hotel? I was paying for the internet through my server, not the Hilton, so I should have been able to use it no problem. It was a problem. The first few nights I was able to log onto my phone and surf the net, check Facebook, etc. but after that, I kept getting the Hilton homepage where I would have to pay for internet. Why? I turned off my WiFi. I pay for my own internet. It was like they were interfering with my internet so I would have to pay for their WiFi. Other than that, the hotel was great. We booked through the Comic Con hotel reservations, and so we didn't get so lucky with the location. If you are going to Sea World, this is the hotel to get. And the location is perfect for airport transfer. Although we got lost on the way to the airport....shoddy GPS kept leading us to the Area 51 looking section of the airport. Hmmm. But if you are looking for a hotel for next year's Comic Con, or anything else near the convention center or Gaslamp district, this is not your hotel. It was 1/2 hour to 45 minutes to get to the Convention each day. All in all, the hotel was very good. I recommend staying here if you are going to Sea World, or other San Diego attractions.", "Date": "July 28, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Anaheim, California", "Title": "“Excellent!”", "Author": "teambart", "ReviewID": "UR115848693", "Content": "Hilton in Mission Valley is my second home away from home. Very accessible to freeways and shopping malls and restaurants. The hotel is clean and staff are always friendly and helpful.", "Date": "July 27, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "5", "Overall": "5.0", "Value": "4", "Service": "4"}, "AuthorLocation": "Las Vegas, Nevada", "Title": "“Definitely we'll come back”", "Author": "starbean111", "ReviewID": "UR115848356", "Content": "Came here to San Diego to meet my high school friends.. this Hilton has the perfect location for family very close to Seaworld and San Diego Zoo and tons of restaurants to choose from.... we'll sure come back again!!!", "Date": "July 27, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "4.0", "Value": "4", "Service": "4"}, "AuthorLocation": "Houston, Texas", "Title": "“Enjoyed my stay”", "Author": "denisi11", "ReviewID": "UR115658590", "Content": "I stayed at this hotel for business purposes, there is a mall accross the street with a number of eateries, right off the freeway which makes getting around quite easy, I was working in Chula Vista and it was only a fifteen minute drive, not bad. Several attractions are a small drive away. The hotel is very clean; I felt welcome and safe, very important as I was traveling alone. The hotel is not on a particularly beautiful area of town, but the location and convenience makes up for it.", "Date": "July 22, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "4.0", "Value": "5", "Service": "4"}, "AuthorLocation": "San Diego, California", "Title": "“Nice & Humble”", "Author": "mistermark8", "ReviewID": "UR115558628", "Content": "One of the older Hiltons in San Diego, it has a great central location in the valley and much lower rates than the new Hilton by the bay. I booked this hotel for some friends out of town and it is a quiet beautiful hotel. The rooms are standard size and the decor makes it seem more spacious than it really is. I suggest this hotel if people want a good quality brand at a lower price and a good central location in the middle of San Diego.", "Date": "July 20, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Chandler, Arizona", "Title": "“Very Comfortable and Quiet. Great Location. I Would Stay Again.”", "Author": "Drum4JC", "ReviewID": "UR115509262", "Content": "I was a little nervous having a room overlooking the freeway, but the room was very quiet. The staff was friendly and courteous. The central location is a big plus. It took only a few minutes to get to Seaworld.", "Date": "July 18, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "3", "Overall": "2.0", "Value": "1", "Location": "2", "Rooms": "1"}, "AuthorLocation": "são paulo", "Title": "“do not deserve the Hilton name”", "Author": "botticini", "ReviewID": "UR115465338", "Content": "we stayed there from june22tojune30, 2011 the Front Desk's people are unpolite and rude, the room was small, noisy,and a non smoking room smelled cigarrette, the bathroom with the shower that did not have a regular hot water. The Hilton had to change a lot of things", "Date": "July 17, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "4.0", "Value": "4", "Service": "4"}, "AuthorLocation": "Sun Lakes, Arizona", "Title": "“Wonderful Experience”", "Author": "dnfreelance", "ReviewID": "UR115373602", "Content": "We recently held a family reunion in San Diego and based our activities out of the hotel. Our room was very clean and the staff professional and accommodating. The food and service in the restaurant was very good. A hugh \"Thank You\" to Matthew Baker, Director of Sales and Marketing for making our stay a memorable experience. We will stay there again.", "Date": "July 14, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "4", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "New York City, New York", "Title": "“We loved the hotel and location!”", "Author": "Pella96", "ReviewID": "UR115372970", "Content": "The hotel was great and the staff very nice and accommodating. The rooms were spacious and housekeeping was terrific!", "Date": "July 14, 2011"}, {"Ratings": {"Cleanliness": "3", "Sleep Quality": "2", "Overall": "2.0", "Value": "2", "Service": "2"}, "AuthorLocation": "Arizona", "Title": "“Not a good choice if you want to sleep.”", "Author": "azmom99", "ReviewID": "UR115143573", "Content": "Our family stayed here for 2 nights over the Fourth of July holiday and we paid $80 a night on Priceline. Self-parking at this hotel is $14 a night. The bathroom was clean and big enough but the toilet was tipped to the side which made everyone feel like they were falling off of it. The bathroom also had a pocket door which was very noisy and hard to open and close. The beds are double beds. The sheets and mattress were fine, but with the beds being so small it was hard to get comfortable. The room had a flat screen tv, but everything else was pretty dated. The room appeared clean enough with the exception of several fairly large red stains on the carpet. I didn't bother to look close enough to try and figure out what it was. As mentioned in other reviews, the walls are extremely thin. We could hear even the slightest sounds coming from the other rooms. We stayed on the side away from the freeway so we didn't hear any freeway noise. The a/c didn't work too well, so the room was pretty warm most of the time. Housekeeping did bring us extra towels quickly when we requested them, but when we came back to the room after they had cleaned, they left the toilet paper roll bar on the sink with no toilet paper anywhere to be found. The first night we all wanted to go to sleep early as we were getting up early the next day. We heard very loud music, but figured it would end soon. It didn't. At 11:00 pm my husband finally went down to the lobby to complain. Turns out that the hotel had rented out a ballroom on the first floor to a very large Salsa party group. We were on the 8th floor and couldn't believe how loud it was. The front desk apologized but told him the party would be going until 1:00 am. When he got back to the room and told me what was going on, I called down to the lobby myself to complain and I was told that the party group rented a room just like we did so they could do what they wished. I was also told that I could check out if it bothered me. With 2 kids at 11:30 at night, that is not an option. Since I had used Priceline the only comp I could get was parking so I asked for that, the employee comped the parking and then hung up on me. Needless to say, we didn't get a good night's sleep at all. We have stayed at many Hilton's throughout the country, and this one is definitely not up to the standard.", "Date": "July 8, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Olympia, Washington", "Title": "“Family visit”", "Author": "steelbender", "ReviewID": "UR114725476", "Content": "The hotel was near the freeway for easy access but we couldn't hear it from our room. Walking down a block allowed crossing the overpass and put us in the parking lot of the Mission Valley Mall. We spent several hours a day at the mall since they had meals and movies. It was easy for family to meet us there after they got off work. The hotel was comfortable and clean. The breakfast at the hotel had a good selection and custom omlets were included. The outdoor pool and hot tub area had ample space for lounge chairs. It was a great place to just rest.", "Date": "June 25, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Escondido, California", "Title": "“First Class All the way”", "Author": "Guamstile", "ReviewID": "UR114646389", "Content": "We recently stayed at the Mission Valley Hilton while visiting family in San Diego. When booking my room in \"Hotel Circle\" I kept my expectations moderate as I have stayed in teh area before and it tends to be chaotic and a tourist factory. However, I must say, from the moment we pulled up to the Mission Valley Hilton, we were greeted warmly and once we were inside the hotel it was everythihg but chaotic and impersonal. The decor and ambiance was very nice and we felt like we were in San Diego. The staff was great, the rooms were ultra modern and what food we had there, was quality. From now on, when I come to San Diego, I am staying here. You get all the convinience of Mission Valley, with an escape in the hotel. I highly reccomend.", "Date": "June 22, 2011"}, {"Ratings": {"Cleanliness": "2", "Sleep Quality": "1", "Overall": "1.0", "Value": "1", "Service": "1"}, "AuthorLocation": "Corona, California", "Title": "“Never again!”", "Author": "nlculp31784", "ReviewID": "UR114613429", "Content": "I will never stay here again. The beds were barely bigger than a twin. The guest services dept. were unwelcoming and rude. The fees for self parking were outrageous. FYI If you are using a debit card for incidentals expect a $75 per night/per room charge to your card that takes over a week to refund after check out. The internet fees were high., The restaurant was unsatisfactory, inferior to that of Denny's. The booths were ripped, stained and dirty. Very unhappy with the overall stay. There are many hotels to choose from with competitive rates. I would not recommend this hotel to anyone. The pool was comparable to a motel 6 pool... nothing special and no towel service. The house keeping was less than satisfactory, they made the beds, that’s about it. The walls are paper thin, we heard everything from rolling suitcases/service carts to doors opening and closing at all hours of the night. Don't stay here... it's over priced and extremely disappointing.", "Date": "June 21, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "4.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Goodyear, Arizona", "Title": "“Very nice stay”", "Author": "sarahdsmom", "ReviewID": "UR113686204", "Content": "We booked this hotel with Hotwire for under $100. It's in a very central area of San Diego, you are within about 15 to 20 minutes drive to beaches, bay and Sea World or the Zoo. There is a mall with restaurants and a theater across the freeway, you could walk it but I would drive as it's a very congested area. Brandon at the front desk was very accommodating in finding me a quiet room at the end of a hall. The view was of the hill behind us but wasn't an issue for us. Every staff person we passed during our stay greeted us with a smile. The parking is below the hotel and does cost money but this is true of most hotels in the Valley. I never felt unsafe in the underground parking at all as there are cameras. If you have someone visiting you, to avoid the $3 and hour parking fee (up to $12) have them park on the street in front of the jeep dealer or farther down. The bar and restaurant here area excellent, great service and good food and drinks...not a weak one was poured during our stay! If you put out the \"being green\" door hanger to say you don't need towels & sheets laundered that day, they give you a $5 off certificate to use at the restaurant or gift shop, great deal! The pool & spa area were clean and plenty of towels were on hand.The only thing I would wish for is a fridge and microwave in the room, there was room for it so I'm not sure if you asked for one if they couldn't accommodate you. There is free wifi but only in the lobby. I would recommend this hotel to everyone.", "Date": "June 15, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "4", "Overall": "4.0", "Value": "5", "Service": "5"}, "AuthorLocation": "", "Title": "“Will stay here again!”", "Author": "luvatl", "ReviewID": "UR113246627", "Content": "We stayed in a family suite here several months back and we definitely enjoyed it! My son and niece enjoyed having their own little separate room with bunk beds and a table and chairs. The room was very clean when we arrived. That is one of the main things I look for in a hotel. The wifi connection was also good. The location was great. Close to everything on our to do list. Lots of restaurants and shopping nearby too. The cookies of course are delicious! The only downside is the parking charges. Expensive, but a lot of hotels in San Diego charge for this. Some even more. The hotel is up on a hill also so you have to be extremely careful coming in and out in the car. If you have a low car or even a normal sedan, it may scrape the bottom. One more thing, please avoid Adam's Steak and Eggs at all costs. Not only was it extremely expansive, the food and service were horrible. Not sure which was worse.", "Date": "June 13, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Carlsbad, California", "Title": "“Wonderful Experience at the Hilton”", "Author": "BridesMom2AJ", "ReviewID": "UR112628831", "Content": "We just hosted our daughters wedding at the Mission Valley Hilton. All I can say is that it was wonderful and we couldn't have been more pleased with all that was provided. Our out of town guests commented on the perfect location to the airport and San Diego attractions. The employees were amazing and went above and beyond all our expectations. The dinner at the reception and the breakfast the next day were very good. Our rooms were very nice, clean and comfortable. The upstairs ballroom looked beautiful and the outside balcony was a nice place to cool down or chat quietly after the wild dancing. I would highly recommend this hotel and \"Amy\" as your planner for anyone who is planning a wedding. You won't be dissapointed.", "Date": "June 10, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "New York City, New York", "Title": "“Best Wedding Ever (at this hotel)”", "Author": "ichthyophile", "ReviewID": "UR111500765", "Content": "Had a fantastic time at this beautiful venue. The staff was kind and very patient. Loved the Peter Thomas Roth products. Food was fresh, tasty and served quickly. Pool was not stunning, but kept at the perfect temperature. Beds and pillows were super comfy! Thanks for a great time!", "Date": "June 4, 2011"}, {"Ratings": {"Cleanliness": "5", "Overall": "5.0", "Value": "4", "Service": "5"}, "AuthorLocation": "San Diego", "Title": "“I love the customer service!”", "Author": "victormontoya", "ReviewID": "UR111360712", "Content": "I recently visited your hotel and I am very happy with your customer service. Everyone was great but I would like to highlight Tania Alvarez who was an excellent bar tender. She was very fun to talk to and an asset to your business. I want to thank everyone at the hotel and keep it up! Victor M.", "Date": "June 3, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "San Diego, California", "Title": "“Amazing Service, Friendly Staff, Great Accommodations”", "Author": "firefly2580", "ReviewID": "UR108997490", "Content": "My company held our national meeting here and was met with great service levels, organized and accommodating staff and well appointed rooms and meeting areas. What a great experience. We will definitely return. Whatever we needed they made it happen. It is nice to know that a hotel wants your business and provides what you need as a customer with no stuffiness.", "Date": "May 19, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "3", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "London", "Title": "“Good, clean and close to the zoo”", "Author": "paleomatt", "ReviewID": "UR107114643", "Content": "If you are looking for a reasonable place to stay that offers spacious and clean rooms near the San Diego Zoo, this Hilton is probably a good choice. The staff were perfectly friendly and the facilities are nice. They were offering free iced lemonade in the lobby when we arrived and that was a lovely touch. Also, as a Hilton Silver member I was treated to a free appetizer in the restaurant - we ordered the nachos and this turned out to be large enough to a single meal for two to share! (of course, we were visiting from Europe where meals are universally smaller, so perhaps the nachos would function as just an appetiser to a large American). Parking fees are stiff and the Hilton should be ashamed of itself for charging so much but that is the only major negative. We tried to use the jacuzzi one evening but it was so crammed full of people we gave this a miss. I don't think this was because the jacuzzi was small but rather because there just happened to be a lot of people visiting it at the time.", "Date": "May 6, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "5", "Overall": "2.0", "Value": "1", "Sleep Quality": "3", "Rooms": "1", "Location": "5"}, "AuthorLocation": "San Francisco, California", "Title": "“This Hilton is costlier than you would think and not so accomodating.”", "Author": "ReadgSpellgTutor", "ReviewID": "UR105070958", "Content": "Staying at the Hilton Mission Valley SanDiego was such a bad priceline experience. Glad I didn't pay full price. Altho' they say it is a 3.5 star, in order to get everything you need, you might as well go to a 4star and pay rack rate. Everything extra cost money including microwave, fridge, internet, parking, etc. Between $14-15 EACH. I pd $70 plus taxes without a fridge/microwave/internet/parking/breakfast. They did give a free newspaper in the a.m. I asked twice to have tub drain taken care of, first backed up to 3 in., then after next complaint, backed up to 2 inches. After next complaint, it still didn't work so decided not to shower. They comp’ed me 3 days of parking about $40...would have rather showered. We had to request hand towels and coffee after the first day, because the maid didn’t replace them. What a horrible experience, especially because I was down there to make arrangements for my brother, who had passed away. I am petrified of dogs and they were having a dog convention at the hotel, so there were dogs and their owners allll over, in the elevators, lobby, halls. It was horrorendous. We left a day early due to another brother’s illness, and gave Priceline the Drs. Contact and info, Priceline contacted the hotel to see if they would refund the money for checking out one day early, and the hotel declined. We checked out about 9a.m. so they probably rerented the room. Considering the trouble with the tub and missing items in the room, plus it was due to illness, I would think they would have made an exception and given a refund for the night we didn’t stay. A little low on the marketing side. Hiltons have really gone to the dogs! Literally! By the way, I sent this info to corporate Hilton after I received an email asking for my opinion but nobody has contacted in over a week , so so decided I’d better let others know. The desk staff were really nice and the lobby is gorgeous. The location next to a mall, freeway, and eateries is good. Another plus, they haven’t been reported in the bedbugregistry.com", "Date": "April 22, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Seattle", "Title": "“Loved it!”", "Author": "lajb", "ReviewID": "UR104658975", "Content": "Was a little hesitant about this hotel after reading some reviews but I was totally impressed. The hotel was clean, the staff was very friendly, the rooms were clean and updated, the beds were comfortable. We were not on the side facing the freeway so the room was very quiet. We booked a package that included breakfast for two which was great. It was buffet style but you could have a custom made omelet or waffle, and staff served your beverages at your table. The hotel was less than 10 minutes from Sea World and also had a shopping center and restaurants right across the freeway. Would definitely stay there again when in San Diego! Only downside was cost for parking and cost of wi-fi.", "Date": "April 19, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "2.0", "Value": "2", "Sleep Quality": "2", "Rooms": "2", "Location": "3"}, "AuthorLocation": "Las Vegas, Nevada", "Title": "“The only thing Hilton about this hotel is their name.”", "Author": "Vinsured", "ReviewID": "UR98801571", "Content": "I stayed here for a week and i've never been more unimpressed by a Hilton then this property. The lobby is nice, but you can't stay in it for more then 5 seconds without the automatic doors opening and a rush of cold windy air running in.. The Restaurant and bar are freezing too. With my Hilton Honors level, I would normally recieve an upgrade the the Executive floor, but guess what they don't have one. So to make up for this you get nada. The room is clean, but dated and old except for the TV. The sheets are very nice, so you sleep well in a room that smells musty and sounds like a freeway right next to you...oh wait, it is right next to you. No Refrigerators, flimsly wicker chair, and poor water pressure. The good news is the parking is easy to get to and it's right next to the hotel, the bad news is they will charge you $14 for the honor of parking there. Also there is nothing around the hotel, except an AM/PM, a car dealership and two closed places to eat.", "Date": "March 3, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "1", "Overall": "2.0", "Value": "2", "Sleep Quality": "2", "Rooms": "2", "Location": "3"}, "AuthorLocation": "Redondo Beach, California", "Title": "“Unimpressed with this one...”", "Author": "sunshine01630163", "ReviewID": "UR87094649", "Content": "I was disappointed immediately after pulling up to the hotel when the doorman informed me that I could park in the self-serve lot for $14 a day or valet for $18. Hmm... pay to park my own car. Not impressed. Checking in was painless and the hostess was really polite. My room \"appeared\" clean when I entered. But after turning on the bathroom light, I noticed A LOT of hair on the floor. EWWWW!!! NOT IMPRESSED. Seriously?! They didn't even sweep the floor (forget about mopping). Made me wonder what else they didn't do when cleaning my room. I will NOT be staying here ever again.", "Date": "November 14, 2010"}, {"Ratings": {"Service": "2", "Cleanliness": "2", "Overall": "1.0", "Value": "2", "Sleep Quality": "1", "Rooms": "2", "Location": "1"}, "AuthorLocation": "Philadelphia, Pennsylvania", "Title": "“Horrible experience for a Diamond Hilton Member”", "Author": "JSMPhilly", "ReviewID": "UR85981670", "Content": "Being loyal to the Hilton brand of hotels has been easy until I stayed at this hotel. I have been a Diamond member with Hilton for the past four years (over 600 nights total). This is by far the worst hotel in the Hilton chain, the hotel is not renovated (the gym is in the laundry room) as someone claimed in their review, and the \"restaurant\" is far from the Hilton standard. It took 3 tries before the front desk could find a room that had actually been prepared for a guest to stay in.", "Date": "November 4, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "2.0", "Value": "3", "Sleep Quality": "2", "Rooms": "2", "Location": "2"}, "AuthorLocation": "Chico, CA", "Title": "“Poor Hotel”", "Author": "discusdoc", "ReviewID": "UR84900212", "Content": "This is advertised as an up-scale business hotel. They charge extra for parking and Internet (high fees), they are located 100 yard from a busy freeway, and their restaurant is terrible. I had to sleep diagonally on their king-size bed (I'm 6-4). Bed size is usually not a problem in other up-scale hotels. I do not recommend the Mission Valley Hilton.", "Date": "October 26, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Chicago", "Title": "“Outstanding Service Everywhere”", "Author": "ROARR", "ReviewID": "UR84753427", "Content": "I'm a seasoned Hilton property traveler and have stayed at many of their proporties across the country. I have yet to receive the service and hospitality like I did at the San Diego Mission Valley Hilton. From the valets, to the front desk, to the servers at the restaurant, and even the bartender. This place has its act together in every sense. I have never felt more welcome or appreciated to be a customer. The food at the restaurant was outstanding. My evening meals were perfectly prepared and tasted wonderful. The breakfast buffet had everything you could want. They would even prepare eggs to your liking if you prefered. If you're ready for a beautifully renovated Hilton and service at every corner, I highly recommend you give this place some consideration. Free WiFi didn't hurt either.", "Date": "October 25, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "boston", "Title": "“Great location, great staff, loved it”", "Author": "bob1111111", "ReviewID": "UR82362980", "Content": "I had heard that Mission Valley wasn't that great but I was plesantly surprised with the Hilton Mission Valley. The rooms were pretty standard for a Hilton but the staff was very helpful, the free appitizers for HH guests were huge and the free breakfasts for HH members were excellent. My wife enjoyed the pool and the fitness facility and was able to do a little laundry while there since the washer/dryers are in the fitness room. Also the location turned out to be right in the middle of lots of restraunts and shopping. All around it's a great pick.", "Date": "October 6, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Belmont, California", "Title": "“Good Location”", "Author": "Mango54", "ReviewID": "UR80216149", "Content": "This hotel is located in a good location. The bath & hand towels are old and shabby. I can't believe this hotel does not offer free Wi-Fi. Overall, good stay.", "Date": "September 19, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Sleep Quality": "4", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Los Angeles/Orange County CA", "Title": "“A couple of oddities but better then expected for the money”", "Author": "pulgadelmundo", "ReviewID": "UR79305837", "Content": "Hi Everyone... My three fave places in the SD were totally booked..BUMMER.. I decided to take a risk on Hotwire...I am not usually a fan of the Mission Valley area but it worked out this time... Room was basic and clean. $70 priceline bid...which saved about 30 bucks a night. I wish they had a little couch/nicer sitting option...You can upgrade to an executive room for $10 which gets you a baby fridge...The room was fine but the doors should be thicker...I could hear the people walking by my room like crazy...luckily I sleep pretty heavily... There underground parking set up is a little odd...Also the visitor daily parking max is $12, but guest daily max is $14...shouldn't i just say I am a guest then? On the plus side I discovered the Gordon Bierch Brewery which is very close and has an excellent meal there! Thanks to my local friend you did the recommend..One of the nights I went out to dinner at the Fashion Valley Cheesecake Factory...", "Date": "September 13, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Taos, NM", "Title": "“Very Friendly and Helpful Staff”", "Author": "jaegis", "ReviewID": "UR78934811", "Content": "Comfortable, clean and convenient, this hotel is located near I8, I5 and RT 163 which gives access from downtown San Diego to Balboa Park to Seaworld to Mission Bay and to La Jolla. The staff was very friendly and helpful. The \"electron concierge\" gave lots of information on local attractions. The beds were comfortable, the rooms and bathrooms were large enough. This hotel is not a spa/destination hotel. Its fitness room is adequate and not busy. The pool is small. A great value.", "Date": "September 9, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "3.0", "Value": "2", "Sleep Quality": "3", "Rooms": "2", "Location": "3"}, "AuthorLocation": "Montreal", "Title": "“An OK hotel, but not up to Hilton Quality”", "Author": "JonnyCanuck99", "ReviewID": "UR76887955", "Content": "I just spent 4 nights at this hotel with my wife and two tweens. Its an \"OK\" hotel but nothing special and I'd go elsewhere if I were to return to that area. The room was average size but the dresser/TV stand was pitifully small looked very \"cheap\". One of the closet doors was broken and couldn't be opened, the drawer cover in the bathroom was crooked and wouldn't shut. The clock in the room had the wrong time and even though we were there for 4 nights and told them we were 4 in the rooms, we had to repeatable ask them for extra towels because the cleaning staff would only leave 3 towels all the time. Its close to a major shopping district and a lot of restaurants which was nice, its also a short drive to get to all the major attractions (less than 15 minutes to get anywhere). The price was reasonable but when you add $14/day parking and $10/day for internet access, it wasn't what I'd consider a \"good deal\", just an average cost. They have a pool which is a decent size but your right along the highway so theres a lot of noise when your outside. On the plus side though, we asked for a quiet room and it absolutely was, we couldn't hear anybodys TV or talking in adjacent rooms. Beware though, they seem to have a lot of celebrations on the 2nd floor and we were warned that the 3rd floor would be noisy, so keep that in mind if you go. They also have a fitness center, but its very small (one elliptical and one treadmill which happened to be broken when we went. I didn't \"hate\" my stay or anything but I expected a nicer room for a Hilton hotel. I'd", "Date": "August 25, 2010"}, {"Ratings": {"Service": "2", "Cleanliness": "4", "Overall": "2.0", "Value": "2", "Sleep Quality": "1", "Rooms": "2", "Location": "4"}, "AuthorLocation": "benzz", "Title": "“A bargain, but you get what you pay for...”", "Author": "benzz", "ReviewID": "UR73648070", "Content": "There are a lot of benefits to staying in Mission Valley....it's equidistant from both downtown and SeaWorld, and it's only a couple of minutes away from the Fashion Valley shopping center...plus, room rates tend to be much lower than staying in the Gaslamp or near Mission Bay. We picked the Hilton for our stay, since the $120/night rate (including breakfast) was the lowest in the area for our last-minute weekend visit. Everything started out nice; they had a room ready for us even though we arrived at the hotel at 10am, and our HHonors status meant that our in-room internet was free. The room looked nice enough at first glance...it had clearly been recently renovated, with the only pre-renovation residue being the aging tile work in the shower. But this Hilton isn't in the same league as its sister hotels downtown and near SeaWorld. For starters, even though our room was on the 12th floor, the roar from the freeway outside was constant and overbearing, even in the middle of the night. Upon closer inspection, the culprit is the windows themselves....I've never seen windows that thin in a hotel or even a private home...they're about half as thick as standard single-pane glass. But noise isn't the only thing that gets in...the drapes do virtually nothing to block light from entering the room (see attached pic), which made falling asleep rather difficult. Light and sound also enters the room thru the thin interior walls (the sounds of showers and sinks upstairs occasionally drowned out the traffic noise) and thru the door to the room itself, which had a gap large enough for a finger. Noise wasn't my only gripe, however...the water pressure in our room was awful, the food at the breakfast buffet was so bad (even for a freebie) we went elsewhere after our first morning, and the 12th floor hallway reeked of cigarette smoke. Plus, $14/day for parking is unacceptable to me in a suburban hotel.", "Date": "August 3, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "1", "Overall": "2.0", "Value": "1", "Sleep Quality": "3", "Rooms": "1", "Location": "3"}, "AuthorLocation": "Los Angeles, California", "Title": "“Disappointing for a Hilton Property”", "Author": "FargoJim", "ReviewID": "UR72187486", "Content": "The location is convenient to the freeway, so it is easy to get out in the morning and get to your next destination. It's not far from the city. However, it is in a funky area next to several car dealerships. There is nothing scenic or touristy within walking distance. That’s okay if you plan to just sleep there and then hit the road. Not great for vacation or family stuff. I try to keep up with my fitness program when I’m on the road, so I was disappointed to see that the fitness facility had outdated, run down equipment. It also shares space with the laundry room. If you love working out with a washer and dryer running next to you this is the place to be. Some of the equipment appears to be early 90s era and the displays are kind of rotted off. Also there is one TV in the fitness center, no individual monitors, so you better like what’s on. My room was okay but the carpet was dirty, musty and stained. The room smelled faintly of cigarette smoke and puke. The bathroom had spots of rust and uummmmmm... God knows what??... I’m not picky so it didn’t bother me much, And I slept well. However, it was more what I’d expect in a $50 flop house. (yes I've stayed in a few of those in my life). The Hilton web site states that this hotel is “recently renovated” and the rooms have been “reinvented”. If this is reinvented, I’d hate to see what it was like before. The restaurant had a nice, reasonably priced breakfast buffet which I enjoyed. The employees were all very nice and helpful. They were the high point of my stay. Overall I give this place a pretty low rating because it is a Hilton, It was $162 per night before taxes, so not super cheap. I expect more from Hilton. This definitely did not meet my expectations for a Hilton. I will not stay there again.", "Date": "July 24, 2010"}, {"Ratings": {"Cleanliness": "5", "Overall": "3.0", "Location": "4", "Value": "3"}, "AuthorLocation": "Midland Park, New Jersey", "Title": "“decent hotel, have to pay for internet, no fridge in rooms”", "Author": "mp_mama", "ReviewID": "UR69407122", "Content": "the hotel is clean and pretty. the pool area is small, but nice. there are no refrigerators in the room, which is the first one I've seen in 7 nights at 6 different hotels. all the others had them. also, they charge 9.95 per day for internet, which in this day and age is ridiculous. you can get free internet these days at most hotels. parking is also a daily charge. not happy about that either.", "Date": "July 2, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "ATL", "Title": "“For a short stay, it's decent...”", "Author": "hthjones", "ReviewID": "UR66627737", "Content": "My wife and I were in San Diego for a three night stay to attend the wedding of one of my wife's co-workers. We had not previously been to San Diego as a couple, so we did not plan to hang around the hotel much anyway. The hotel was dated (e.g. old, worn carpet, drab decor, etc.) and could use an upgrade on the interior design but it was clean. The staff was very helpful with providing directions, entertainment and dinner suggestions. Upon check-in, after a long day of travel - Atlanta to San Diego with a long delay along the way - we were tired. We just wanted to grab a bite to eat and sleep. I typically request a non-adjoining room, away from the elevator corridor. Unfortunately, this request was overlooked and my wife and I could clearly hear the adjoining room's conversation - as if we were sitting next to the folks, looking them in the eye. I called the front desk. The staff was understanding and immediately moved us to an upper level, non-adjoining room. Fantastic response. The hotel restaurant/bar is convenient, but for the money you're better served to take the short drive across the main highway to nearby shops and restaurants. We decided to try the hotel breakfast one morning but after looking at the buffet selection and price, we ended up back at a nearby Mimi's Cafe for enjoyable breakfast. I don't recommend eating at the hotel; especially, with the proximity of a variety of restaurants. If you're looking for high class amenities, this is not the place. If you simply want a clean hotel room, with a helpful staff and a convenient location to entertainment and restaurants, this is a good option.", "Date": "June 6, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Sleep Quality": "2", "Rooms": "3", "Location": "4"}, "AuthorLocation": "riverside", "Title": "“Great Location, Not Quiet”", "Author": "khusted", "ReviewID": "UR63336209", "Content": "Location, Location, Location if you love the ocean this is a great place. It was not quiet it sould like a soccer game was being played in the room above us.", "Date": "May 5, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Sleep Quality": "4", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Houston, Texas", "Title": "“Friendly staff; nice property”", "Author": "txpilgrim", "ReviewID": "UR62597619", "Content": "I recently stayed at the Hilton Mission Valley. The lobby is slightly outdated but in contrast the rooms are nicely outfitted. We had a problem with an air vent in our room and the front desk staff quickly responded and resolved the situation. The restaurant is fairly expensive but has a nice breakfast. The property is close to Fashion Valley Mall, other shopping and restaurants, the beach and the highway. The Hilton Mission Valle is a solid property. While there's nothing spectacular about the hotel i also didn't encounter any drawbacks.", "Date": "April 27, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "San Francisco, California", "Title": "“Great Hotel for a Spring Break Trip with Family”", "Author": "mnasf", "ReviewID": "UR61047614", "Content": "We stayed at the hotel during part of our spring break trip to San Diego. The hotel was nice and had a good location. The rooms were comfortable and clean. The location of the hotel is good. Close to the area attractions as well as dining and shopping. While we were at the hotel, there were several school groups at the hotel as well. It made for a little bit of noise in the evening as the kids were going up and down the halls, but overall the hotel was fairly peaceful. We had two rooms, one with double beds and one with a king bed. The king be room was missing a lamp and an alarm clock when we checked in, but once we told the front desk, the issue was fixed. We did not eat at the hotel, but the restaurant looked nice. We would stay here again in the future.", "Date": "April 11, 2010"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "", "Title": "“Great location!”", "Author": "mrxonia", "ReviewID": "UR60056026", "Content": "Stayed for a week. It is close to the rail system that will take you to any points in and around San Diego. Catch a ball game, visit the ocean front, stop and pursue the Mission. Hotel staff are exceptionally helpful in getting you where you want to be. If you are in San Diego only for business, take a breath:)", "Date": "March 31, 2010"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Overall": "3.0", "Value": "2", "Sleep Quality": "3", "Rooms": "3", "Location": "3"}, "AuthorLocation": "California", "Title": "“Poor customer service”", "Author": "EuroDiva", "ReviewID": "UR59629316", "Content": "I stayed at the Hilton for one night for a business meeting. The staff member at check-in was unfriendly and unwelcoming. You pay extra for self parking and in-room internet. There is a business center but the computers there are slow as molasses. This is a mediocre Hilton and the least desirable of the 3+ stars hotels in the Mission Valley area.", "Date": "March 27, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "3.0", "Value": "4", "Sleep Quality": "4", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Southern California", "Title": "“Good Enough for the Price”", "Author": "UtterDisbelief", "ReviewID": "UR58771516", "Content": "Our room was clean and comfortable, but nothing fancy. After reading other reviews, we requested and received an upper floor room facing the hillside so was able to avoid noise from the freeway. However, walls are not well insulated and we were able to hear everything going on in the next room and hallway. We had also read about rooms being burglarized so were a little paranoid about that too. The security bolt on the inside of our door did not fit properly, so this made us wonder if our room had been one of the victims. Also, there is no safe so we made sure never to leave anything of value in the room. Because we were able to get the room through Priceline at a discounted price of $65, we didn't feel quite as bad paying an additional $14 per day for self parking. They also charge an optional $10/day for internet. in your room, but it is available for free in the business center by the lobby. The staff was friendly and helpful and the location was extremely convenient for everything we needed to do this trip. If we were able to book this hotel again at a discounted price, we would be happy to return.", "Date": "March 16, 2010"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "Clearwater, Florida", "Title": "“SURF”", "Author": "TerriI", "ReviewID": "UR57326452", "Content": "Awesome place to stay,went down to lower trestles to do some boogie boarding and surfing in San Clemente.", "Date": "February 28, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Salt Lake City", "Title": "“About average for the Hilton Chain”", "Author": "PG32", "ReviewID": "UR56544464", "Content": "Various pros and cons but overall this location is about average. The rooms are pretty small and the rates are pretty high. This is typical of San Diego though. Save some money and hit the Denny's next door for breakfast. This hotel is away from downtown and the water but the freeway makes for a short commute if there is no traffic. We saved about $100/night over the gaslamp and seaworld locations. We spent that on a rental car, which was a good trade. Overall this is a nice hotel. Just small and expensive. It works well if you plan on spending your days exploring the city though. Enjoy your stay.", "Date": "February 19, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Sleep Quality": "2", "Rooms": "1", "Location": "2"}, "AuthorLocation": "Sacramento", "Title": "“Hide Your Valuables”", "Author": "AcademyTrainer", "ReviewID": "UR55100116", "Content": "My room was burglarized, the lock being pried open by a tool of some sort. Upon reporting the loss, the hotel hardly even acknowledged it and were very unresponsive. When I called the police to investigate, they said the hotel \"had a problem,\" because it looked liked more than one door had been pried open. The officer stated he could get into the door within a couple of seconds. After calling the police, the hotel was going to \"launch a full investigation\", although I have yet to hear from anyone after a week's time. As a certified meeting planner, I have now heard of a couple of other Hilton's having the same issue of pried doors. I will not be recommending a Hilton for any of my meetings.", "Date": "February 3, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Location": "5", "Rooms": "5"}, "AuthorLocation": "new york", "Title": "“Nice hotel, clean and good service, great location.”", "Author": "abigezunt525", "ReviewID": "UR53632020", "Content": "My wife and I stayed here with our young son. The hotel was nice. Rooms were clean. Location is fantastic, with target and coffee bean right across the street (by car, theres a highway inbetween), amongst other shopping. Parking is 14 dollars but I was able to find parking overnight on the street (during business hours parking on the street is a bit more scarce). Booked on priceline for cheap rate. all in all good hotel. short drive to sea world downtown and many other attractions.", "Date": "January 16, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Location": "3", "Rooms": "3"}, "AuthorLocation": "mdgirl01", "Title": "“Decent but older hotel”", "Author": "mdgirl01", "ReviewID": "UR51121810", "Content": "Far away from the city, cost $20 for a taxi ride from the airport to our hotel or from our hotel to downtown. This Hilton wasn’t spectacular. Looked old and a little run down. I’m glad a got a good deal on priceline.com – $75+tax each night. Otherwise I’m sure it would’ve been 200 a night just for the name. We didn’t hav ea car so we just walked across the street (1/4 mile) to the Target and Corner Bakery Café. The trolley is also a short walk across the street, $5 all day, that pretty much takes you anywhere around the city.", "Date": "December 12, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Location": "3", "Rooms": "3"}, "AuthorLocation": "Las Vegas, NV", "Title": "“Painfully blah hotel”", "Author": "veeRob", "ReviewID": "UR50054146", "Content": "Another Priceline find. For $55/night, it ain't bad, but if I booked full price and thought I was getting a Hilton hotel, I'd be very disappointed. Location is terrible (it's near nothing) and yet they charge $14/night for parking. Internet is not free. And the hotel is just so blah everywhere else... no plasmas in the room. Our room was laid out super weird, with the TV on the side of the bed. Very uncomfortable to watch. If it wasn't so close to my wedding destination, I probably would have stayed elsewhere.", "Date": "November 25, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Location": "4", "Rooms": "4"}, "AuthorLocation": "phoenix", "Title": "“good hotel foe weekend stay”", "Author": "BDFPHOENIX", "ReviewID": "UR48260144", "Content": "My husband and I( who live in phoenix) took my sister who was visiting from N.C. to San Diego for a visit to the San Diego Zoo. I made the reservations through Expedia and got breakfast for two and free parking, great price,great perks. The staff were cordial the room was great. I would stay there again.", "Date": "November 1, 2009"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Location": "4", "Rooms": "2"}, "AuthorLocation": "Southern CA", "Title": "“NO Executive lounge anymore, not noted on Web Site! Huge CC block!\"”", "Author": "killbondnow", "ReviewID": "UR47451736", "Content": "I am a HHonors Diamond x 5 years running, looked forward to staying here for a meeting that was held at another non-Hilton hotel. Was not informed that the executive lounge is *permanently* shut until arrival (there was NO mention of this on the web site, or I would not have selected this hotel). Received upgrade to exec floor, but, really, big whoop. Gave us coupons for a free appetizer at the sports bar (in lieu of the exec lounge perqs), but I frankly don't equate a sports bar appetizer as quite the same thing... Worse, the executive level rooms had recent water damage visible on the ceiling from the recent rains. When I checked in, I was told that they would block a MANDATORY $50 PER DAY for incidentals from my card -- really, there isn't $50 a day worth of ANYTHING at this hotel. Getting more and more frustrated with \"meh\" service/amenities and lack of real Diamond perqs here, so wanted to call and move to the Doubletree right across the freeway. Cell phone dead, didn't want to incur huge phone charges, so I went downstairs. No phone in lobby, business center or even by the meeting rooms. Asked front desk, and they said if I wanted to call I'd have to go to the CONVENIENCE STORE NEXT DOOR, that was the nearest public phone. That was IT! We moved out an hour after check-in, very unhappy with this property. The funny thing was they tried to explain, \"Well, if it was a local call, we could have let you done it from here.\" Well, yeah, um, I really don't think they would have wanted their other guests to hear what I had to say during that call, frankly... anyway the Doubletree welcomed us with open happy arms WITH a wonderful executive lounge, WITH expanded breakfast buffet and lovely exec lounge evening service (food & drink), WITH a nicely upgraded room, WITH warm cookies, and WITH a quiet elegant bar, outdoor firepit and lovely personnel. THAT is Diamond treatment I'm used to! The only good thing I have to say about the Hilton Mission Valley is that the manager \"Amy\" facilitated the quick resolution of the block off my credit (not debit) card, which was STILL on hold 3 days after I arrived, which I think is ridiculous. And that $50 a day, sheesh! There is NOTHING there worth $50 a day! I'll never even this consider this Hilton again, and it takes a LOT to make me scratch off a potential point-maker!", "Date": "October 21, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Location": "4", "Rooms": "3"}, "AuthorLocation": "Huntington Beach, CA", "Title": "“Good value and convenient location”", "Author": "WishIWasInHawaiiNow", "ReviewID": "UR46275780", "Content": "Does not offer extravagant amenities, but the rooms were clean and located close to amusement partks. We asked for a quieter room, which faced the hill behind the hotel (no view), but better than facing the freeway. We got a special package that included parking and breakfast buffet.", "Date": "October 8, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Location": "3", "Rooms": "4"}, "AuthorLocation": "London", "Title": "“Very good hotel, would definitely return.”", "Author": "kammil", "ReviewID": "UR45757657", "Content": "I was very pleased with the hotel, very well appointed rooms, clean and spacious. Check in and check out (\"zip-out\") was very smooth as well. The location was not that great (in terms of amenities), one definitely needs to drive around if you wanna go places, but parking is rather inexpensive ($14 self parking per day). I would definitely return to this hotel.", "Date": "October 3, 2009"}, {"Ratings": {"Cleanliness": "4", "Overall": "3.0", "Rooms": "3", "Value": "3", "Location": "3"}, "AuthorLocation": "Los Angeles", "Title": "“Comfortable Stay”", "Author": "zenjuris", "ReviewID": "UR40491918", "Content": "My wife, toddler son and I stayed at San Diego Mission Valley Hilton for one night in August 2009. There really is not much to say about this hotel. It is an average Hilton in a decent location. The room was a bit small. We received the quality of service and amenities that we expected from a Hilton hotel -- no more but no less. We were looking for a no frills but comfortable place to spend the night during a weekend trip to the San Diego area, and the San Diego Mission Valley Hilton fit our requirements. We were satisfied with our stay.", "Date": "September 9, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "3.0", "Value": "4", "Location": "5", "Rooms": "3"}, "AuthorLocation": "Calgary, Canada", "Title": "“Average Hilton, Good Location”", "Author": "TheWinger", "ReviewID": "UR40132578", "Content": "I just finished a 3 night stay here, and all in all it was ok. The great rate I received through the Visa Infinite deal made it worthwhile. The room I was in was on the 10th floor facing the hill and was pretty average, a bit worn but the bed was very comfortable. The executive lounge is closed down (cost issues) and they are handing out coupons for breakfast and coupons for an appetizer and a non alcoholic drink for each day. Pool was small. Valet parking was $18/day and internet is free for Diamond members. We did enjoy the location which was very close to everything, and a short walk to the mall on the other side of the highway which had plenty of dining options. I would probably stay here again if the rate was decent, but will probably look elsewhere in the future.", "Date": "September 8, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "1", "Overall": "2.0", "Value": "1", "Location": "2", "Rooms": "2"}, "AuthorLocation": "Los Angeles, CA", "Title": "“Disappointed...”", "Author": "lacadude", "ReviewID": "UR39965368", "Content": "I booked this hotel for Labor Day weekend because it was a Hilton. Unfortunately, this is not your typical Hilton, it's more like a Motel 6. For one, the rooms are noisy. The hotel faces I-8 so you hear the freeway traffic. Also, the walls are thin so you hear your neighbors, including their barking dogs because this hotel allows pets. Secondly, the rooms are not clean. The carpet in our room looked dirty and had a nasty stain on it. This dirtiness applies to the entire hotel in general. Finally, the breakfast buffet that they advertise is nothing more than a continental breakfast with eggs, sausage/bacon, and potatoes, and looks nothing like what's pictured on their website. There are plenty of other hotels near this hotel that might be better choices but I cannot vouch for them as I have not stayed at any of them. But based on my stay here, I will not be staying at this hotel ever again.", "Date": "September 6, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Location": "4", "Rooms": "4"}, "AuthorLocation": "Phoenix, Arizona", "Title": "“Upgrade to \"executive\" floor was worth it”", "Author": "AZFamilyOf4", "ReviewID": "UR37036300", "Content": "Our family stayed here for three days and were very pleased. We paid about $10 a night extra to stay on the executive floor in order to get the included breakfast. We were only expecting a typical continental breakfast, but this hotel included extras like bacon, sausage, and scrambled eggs. The hostess even told us with advance notice the chef could prepare special items to accommodate food allergies. Our room was a bit small, but it was very clean and comfortable, with a nice flat panel TV in it. The double beds were comfortable, but would be better if they were queen size. The air conditioning was easily adjustable and kept the temperature just right. Inroom WiFi is available and provided free to HHonors members. Some reviewers have complained about noise, but that was not a problem during our stay. Perhaps that is due to being on the executive floor, or maybe it was just due to staying midweek while the hotel was less crowded. Either way, we never had a problem with this. The inland location worked great for us, though we were thankful for GPS as navigating the area can be a little tricky. San Diego zoo, Balboa Park, Sea World, and beaches are all about 15 minutes away. Overall, we would recommend this hotel for its clean, comfortable rooms, nice included breakfast (on executive floor), and central location.", "Date": "August 8, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Location": "4", "Rooms": "4"}, "AuthorLocation": "NYC", "Title": "“Good experience overall”", "Author": "touristnyc", "ReviewID": "UR36817911", "Content": "Nice clean hotel with large LCD TV and quite. Rooms are good size, service was fast. Front desk are friendly. Parking was a little annoying though, the lift gate don't work too well. Pool are very small, But anything is better than fleas room at Sheraton park at Anaheim.", "Date": "August 5, 2009"}, {"Ratings": {"Cleanliness": "2", "Overall": "1.0", "Rooms": "1", "Location": "3"}, "AuthorLocation": "Novi, Michigan", "Title": "“If you want to sleep, don't stay here!!!”", "Author": "lkepes", "ReviewID": "UR36713159", "Content": "The walls are made from paper and I could hear EVERYTHING that was going on next door. And trust me, I didn't want to!!! The place seemed dirty and was not a great place for kids. The crib they gave us for our baby to sleep in had rust on the sides. It was an awful stay.", "Date": "August 4, 2009"}, {"Ratings": {"Service": "1", "Cleanliness": "3", "Overall": "2.0", "Value": "3", "Location": "4", "Rooms": "3"}, "AuthorLocation": "Vancouver, BC", "Title": "“Not to Hilton standards.”", "Author": "wacaj", "ReviewID": "UR36194318", "Content": "There are positives about this hotel, but more bigger negatives about this Hilton hotel that have left an unpleasant taste about my stay. Pros: central location and easy to get everywhere in the San Diego area; the breakfast buffet was OK, and didn't charge my seven year old son (he looks and eats small). Cons: $14/day for self serve parking was just a \"cash grab\"; the shower and tub took forever to drain; housekeeping knocked on the door at 8:30 am on Sunday wanting to know when I would leave so she could clean the room. HUGE Con: I had to ask for pool towels four times, taking over an hour to finally receive them. When asked, the Guest Services representative at the front desk could not explain the delay, but did agree that I was paying for a \"full service hotel\". The duty manager agreed to \"look into\" the problem, but did little to improve the customer service as they \"fell short of my expectation\". The hotel manager/GM was useless and made no attempt to make change my experience at his hotel (a reflection of leadership?).", "Date": "July 30, 2009"}, {"Ratings": {"Service": "2", "Cleanliness": "4", "Overall": "3.0", "Value": "2", "Location": "4", "Rooms": "4"}, "AuthorLocation": "portland, oregon", "Title": "“Just a regular hotel.”", "Author": "dmc37", "ReviewID": "UR31190264", "Content": "My wife and I stayed for two nights at this hotel using my Hilton Honors points. Pros: 1. Good location to get around. Close to shopping. Places to eat. Activities. 2. Nice, clean room. Large LCD. Fridge. Desk. Free Wifi. 3. Since we stayed on Executive Floor. Free breakfast (bacon, eggs, sausage, etc.) Cons: 1. No free parking. Just didn't feel right about this Hilton hotel charging $14 per day for parking. 2. Probably not their fault because maybe it wasn't available but my room preference was not given to us. We wanted a king bed away from the elevator. I would stay at this hotel again but only if I was using Hilton Honor points.", "Date": "May 31, 2009"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Location": "3", "Rooms": "2"}, "AuthorLocation": "arizona", "Title": "“HILTON: NOT WHAT IT USED TO BE!”", "Author": "pal1612", "ReviewID": "UR30180898", "Content": "The value was good, just east of hotel-circle; but at best, this was a 3-star place. The room had been recently redecorated, but the bed was marginal (in comfort), the in room fridge had been removed, the bathroom light was burnt out. This was definitely not what I would call Hilton quality and we were disappointed! The plumbing was old, the shower was marginal--and this was advertised as a deluxe king suite. Oh yeah, the in-room hair dryer did not work and it took 30 minutes for the hotel staff to supply us w/ a replacement, after we made three calls down to the desk.", "Date": "May 17, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Location": "3", "Rooms": "3"}, "AuthorLocation": "Orange, California", "Title": "“Okay Hilton for the price, but would not stay here again if I had the choice”", "Author": "Angelfan", "ReviewID": "UR30162821", "Content": "Got a room here for $67 a night using priceline. Was trying for the Doubletree Mission Valley, but no luck. This Hilton is located right next to the freeway and is pretty easy to find. But the hotel does not give you the feeling of San Diego. I would recommend staying closer to Old Town, Downtown, or the bay. The Mission Valley area is only worth it if you need to be in the area or you can find a really nice hotel. The Doubletree is much nicer and located next to the trolley station. The first room we received smelt awful in the restroom, which was because someone forgot to flush after using it (Gross). They happily moved us and the room was okay, nothing great. The bed was nice and soft, but I just didn't care fort the Hilton. Parking is another problem of this hotel, $14 a night! OUCH.", "Date": "May 17, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Marengo, IL", "Title": "“Great Hotel, Great Location”", "Author": "lisann", "ReviewID": "UR29876372", "Content": "The Hilton Mission Valley was perfect for our trip. The room was very clean and roomy. The interior spaces were lovely and the location central to our needs. The pool was clean and heated and there were towels on each chair plus plenty more in a chest on the pool deck. Check in was smooth, especialy with our multiple rooms. We were able to check in early and all of our rooms were on the same floor and close together. The front desk person was very helpful with messy credit card problem. Using priceline made the Hilton very affordable, otherwise we would not have stayed there. The only drawback was having to pay for parking.", "Date": "May 12, 2009"}, {"Ratings": {"Cleanliness": "3", "Overall": "3.0", "Rooms": "3", "Value": "2", "Location": "4"}, "AuthorLocation": "California", "Title": "“In Need of Major Updating”", "Author": "CARose", "ReviewID": "UR27609677", "Content": "Recently returned from a business trip March 2009. I go to this area often and usually stay at the Double Tree - Mission Valley. Was not able to get a room. As a Diamond member, I secured and confirmed my room on the executive floor the day prior to my arrival. When I checked in, I presented my e-check in confirmation with the assigned room number on the executive floor. The agent presented my keys and proceeded up to my room. Half way up on the elevator; I looked in my package and noticed I was now on a room on another floor. My original room number had been crossed out (it was the confirmed room number from my e-check in). I went back down to the front desk to ask why my room had been changed, not to mention that the agent never informed me of this change when I checked in and proceeded up to the floor I thought I was on. The agent apologized and stated that the floor of my room number was also considered an executive floor. I stated that I understood, but as a benefit of being a Diamond member is to secure a room prior to check in only to have it changed, what is the purpose of this benefit. He stated that my original room was available and gave me new keys to that room. Room - Very average/basic - especially for a room on the executive floor. Very small, old out dated furniture. Other reviews are accurate about the state of the rooms. Turned on the TV, wouldn't turn on. The batteries were dead in the remote. Turned on the TV manually, the closed caption was on and could not be manually turned off. Called the front desk, they informed me that someone from facilities would be right up with batteries. Approx 40 mins later, the front desk called to see if facilities had been up to my room. I stated no, they said they would call again. 10 minutes later, someone came to the room. Took approx., 50 mins. Not much else to say other than it was a very average room, comfortable bed, nothing special for an executive floor. Executive Lounge - Very nice. Evening service had honor bar, fridge stocked with sodas and water. A couple of hot items and desserts. Lounge was better than most I've stayed at State side. Am service was equally good. No complaints. Parking Charge - Standard at most Hilton properties. Location - Central to downtown, La Jolla. Close to shopping and restaurants. Gym - Very outdated. All Hilton's I've stayed at in the last year, the gyms have all new equipment. This equipment was very old, worn. No water cooler but a sign that states a water fountain is in the hallway. Overall - Very average stay, you can do much better. Would not recommend for a stay of 3 days or greater.", "Date": "April 7, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Location": "3", "Rooms": "3"}, "AuthorLocation": "Dallas, TX", "Title": "“Great weekend package”", "Author": "Love-to-wander-Mom", "ReviewID": "UR26475548", "Content": "We stayed here one night. It is close to all the main attractions in San Diego (La Jolla is 10 minutes west and the zoo is 10 minutes south etc). We had a view of the green hill (better than the highway view). We recommend the \"Your weekend\" package which was $119 in March. It included hot breakfast buffet for 2, internet, parking and one other choice (we picked breakfast for 2 more but you can pick 2 cocktails, movie etc). As a Hilton Honors member you also get to choose from a movie, 1 appetizer etc. Rooms are nice mid-range type room. There is a Wendy's 1/2 block away so that is handy for the kids or when you need a fast food meal.", "Date": "March 19, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "2", "Overall": "2.0", "Value": "2", "Location": "3", "Rooms": "2"}, "AuthorLocation": "Bethesda, MD", "Title": "“Lacks basic necessaties”", "Author": "bethesdaman", "ReviewID": "UR25906976", "Content": "The staff is very, very friendly. However, I wouldn't recommend staying at the Hilton Mission Valley hotel because it lacks basic necessities. For example: the air conditioner does not work properly. I had mine set on 65 my entire stay, but it felt 75. I had several clients who were staying at this property and their room temperature was on the warmer side. The water pressure fluctuates from high pressure to low pressure every couple of minutes. Again, I had clients complain about the water pressure as well. Even though the entire hotel is \"smoke free\", people were smoking in their rooms and in the hallway. The hotel should have attempted to enforce the no-smoking policy. The rooms are outdated. The 19inch tube TV is a thing of the past. No channel guide is provided either. My room had hair all over the bathroom, hair on bathroom towels, and hair on pillows on the beds. The hotel is pet friendly. A colleague had to change rooms because of a loud, barking dog next door. I would assume that the complaints about bed bugs on here relate to the amount of pets staying on property here. I saw three dogs when I was checking in. Self parking is $14 and valet is $18 a night. Internet is $9.95 per night unless you have status (silver and higher) at Hilton. Other nearby hotels provide shuttles to the airport. This Hilton property does not offer any type of shuttle service. Cab rides are around $20 to/from the hotel and airport. Overall, I would not stay here again.", "Date": "March 10, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Louisiana", "Title": "“One of the Nicer Hiltons - Great Service”", "Author": "Amperage", "ReviewID": "UR24282389", "Content": "This is your typical Hilton. Lovely lobby, nice rooms and comfy. The hotel rooms are freshly updated and LARGE. The location is excellent and the price is appropriate. The staff is courteous and housekeeping is prompt and thorough. I have absolutely no complains, only praise for this hotel at this point, sitting as I am, watching the city of San Diego from my hotel room here at the Hilton. Now then, onto another matter. I'm amazed at the other reviewers for this hotel who claim to visit hotels (and even Hilton hotels!) regularly yet are downgrading this hotel for charging for parking and internet access. These are typical charges for Hiltons. In the Hilton hotels, all Hiltons, Embassy Suites and Doubletrees charge for internet access and most of the Hiltons charge for parking, depending upon environment. It is what it is, UCR. The hotel is great for a business traveller in need of a place to relax after a long day at work. If I had any complaints, it would be that in the exercise room, the exercise machines do not have individual TV screens attached to the machines.", "Date": "February 5, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "1", "Business service (e.g., internet access)": "2", "Check in / front desk": "4", "Overall": "1.0", "Value": "1", "Rooms": "1", "Location": "3"}, "AuthorLocation": "maddymoe", "Title": "“BED BUGS BEDS BUGS”", "Author": "maddymoe", "ReviewID": "UR22676997", "Content": "I stayed at this hotel, because it was close to the location of my business trip - I would never stay there again. Rooms were dingy and BED BUGS were in the first room we stayed at. The second room they gave us the sheets were still dirty and had makeup on the pillows. I asked for our clothes to be completely laundered so we don’t take bed bugs home - the clothes were returned in the same dirty garbage bag they gave us to put the clothes in and upon returning half the clothes was damp and it was thrown back in the bag unfolded.....", "Date": "December 12, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Business service (e.g., internet access)": "3", "Check in / front desk": "3", "Overall": "3.0", "Value": "3", "Rooms": "4", "Location": "3"}, "AuthorLocation": "provo", "Title": "“Comfy”", "Author": "hockeylovers", "ReviewID": "UR22414934", "Content": "We were there for a soccer tournament and there was 14 of us and only got 2 rooms!! We did enjoy our stay,I personally wouldnt stay there again unless I got it for cheap, The staff was nice, the beds were very comfy (personally I think thats all you pay for in this hotel) We couldnt use the luggage with out the bell boy helping us and since we didnt have any cash on us to give him a tip we just halled everything up...that wasnt too bad. They have a parking garage, that was nice, parking was $14 a vehicle a night. The hi-speed wireless internet was not free, The pool and spa was nice but there were never any clean fresh towls ready to go (we had to call housekeeping 3 times to bring some (and those are three different days) The room was good size, we have twins so we had two play pins set up and with room to spare. There was a soda and ice machine on every floor, housekeeping was very prompt when we called for more towls for our room (there were 9 of us in one room with only 2 beds) Hilton was nice but you pay more for less, a day earlier we were staying at the holiday inn and there you get more accomidations for half the price.", "Date": "December 3, 2008"}, {"Ratings": {"Cleanliness": "3", "Business service (e.g., internet access)": "1", "Check in / front desk": "5", "Overall": "3.0", "Value": "2", "Rooms": "3", "Location": "2"}, "AuthorLocation": "Fontana, California", "Title": "“Pretty good...Typical Hilton.”", "Author": "Pharmrep79", "ReviewID": "UR22348999", "Content": "This is a typical Hilton hotel. It is pretty good, but not as much as you would expect. I am a Hilton Diamond member, and I am loyal to the Hilton company, but the Hilton brand could use some work to offer more value. One example at this property is that you have to pay for internet use. This seems to be antiquated and shows that Hilton is out of touch with business travelers. This property is no exception. Luckily, on this trip I was traveling for leisure. The parking fee is kind of ridiculous as well. I understand that parking is at a premium, but why not just have a reader at the barrier that reads your room key and raises the barrier if you are a guest? Making guests pay outrageous fees for parking is not the way to show that you are looking out for guests and creating a good relationship. I booked through Priceline, so the parking was ok, but if I had to pay full price I wouldn't book. The rooms are ok. In fact they are pretty nice, with nice beds. Our shower also had pressure that changed many times throughout the course of a shower. The temperature seemed to change in response to the pressure changes. The staff at the front desk was EXCELLENT. This is the biggest and best feature of this hotel. In a way this makes almost any negative forgettable. Hotel managers did you read those last three sentences? Please take note, service is the most important part of any hotel (I should know I spend half a year, each year, in a hotel). This hotel doesn't have the best location, but it is bearable. Unless, you really like Denny's, don't expect to walk to eat out many times. This hotel is a solid choice for the price, if you can get a discount. Even at full price, it is competitive in the region. There are many better hotels on the waterfront, but they are very high priced. This is relatively close to most things, is bearable, has a nice look and a good staff. It is a good choice for those with a car, and who want a basic, but nice hotel.", "Date": "December 1, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "2", "Check in / front desk": "4", "Overall": "4.0", "Value": "4", "Rooms": "2", "Location": "4"}, "AuthorLocation": "San Diego", "Title": "“HIgh hopes followed by frustration, but a happy ending”", "Author": "hobo6", "ReviewID": "UR22105418", "Content": "My wife and I live only about a mile or two from this hotel. My wife chose this hotel to be the place to stay the night before our wedding, the location to prepare herself for the wedding, and hotel to spend our first married night together. The whole experience did not begin or transpire well until the end. We made the mistake of waiting until two weeks before the wedding to actually view our room. We were very disappointed with the size of the room. Not only would it be cramped for two people, but there was no way she could have her bridal party and hairdresser in the room, much less have space to hang her wedding dress. The only larger room would be the presidential suite or joining rooms. The presidential suite was huge, however it had a queen sized murphy bed. We choose the presidential suite. The staff at the front desk were not sure if we could change our room to the presidential suite since we had reserved the room through Travelocity. As a result we had to call back the next day. The manager said it would be no problem. However, it would cost us an addition $50 a day. We took the new room. My bride to be returned to her room the night before the wedding to find the TV remote not working. Someone came up with new batteries. She always reads in bed before she goes to sleep to relax herself. Before getting into bed she realized the light bulbs above the Murphy Bed were out. Again, someone came to replace the bulbs. Prior to getting into bed she knelt down to pray and was disgusted when she found the sheets to be dirty and look like their were a couple of bugs. This is when I received a frantic call at about 12am the morning before we were to be wed. She said she could not sleep in the room with the bed the way it was and that they were going to move all of her stuff to another presidential suite on another floor. I said that was ridiculous. I suggested the management open the attached room to the presidential suite to us at no extra cost. They obliged. When we returned from our wedding reception we were greeted with a bottle of champaign and chocolate covered strawberries as a gesture of regret by the hotel. I thought it was a nice touch. The following morning we ordered room service. We ordered tea, berries and cream, along with a couple of crossaints. We had to call room service back when we discovered they gave us coffee and forgot the cream to go with the berries. Lastly, we received the bill and were charged for an additional night of parking. When we checked we were not charged for the additional room, for no parking, nor our room service breakfast. Although things did not go according to plan, in the end, as a result of the staff, everything worked out. We had a larger room than we could have imagined and a wonderful wedding. I also want to add that guests of our wedding also stayed at the hotel and had an enjoyable stay. I would recommend the hotel, but not the murphy bed.", "Date": "November 23, 2008"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Business service (e.g., internet access)": "3", "Check in / front desk": "3", "Overall": "3.0", "Value": "3", "Rooms": "3", "Location": "3"}, "AuthorLocation": "North Carolina", "Title": "“Adequate but unremarkable”", "Author": "Lee S", "ReviewID": "UR20018678", "Content": "Recently stayed here for five nights. Found the Hilton very adequate, but not spectacular. Skipped the $16.95 breakfast buffet for the $5.99 Grand Slam at Denny's just down the road. Room was average sized but skimpy on drawers for clothes with just three. Room thermostat seemed to be 5-7 degrees off. Water pressure in shower seemed to come and go in cycles and bathroom could use a fan.. Did like the Evelyn & Crabtree toiletries and thick towels. Bell staff/parking valets were very friendly and helpful. Location is good for various San Diego activites. I guess I expect Hiltons to be exceptional properties. This one seems to lack character and would be easily forgotten by most travelers. This was my first Hilton stay in some time and I think in the future I'll stick with a DoubleTree, where you get a bigger bang for your buck.", "Date": "September 12, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Check in / front desk": "4", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Los Angeles, California", "Title": "“Nice hotel”", "Author": "Brian90212", "ReviewID": "UR19272270", "Content": "Nice hotel despite being very close to the freeway. My family's room faced the freeway but we didn't even hear the sound of cars. I think the hotel may have soundproof windows to minimize the noise coming from the freeway. Hotel was a bit on the pricey side for one night; even with a AAA rate. Parking isn't free either. If you need to buy some snacks, there is a AMPM located adjacent to the hotel and is within walking distance. There is also a Denny's that is within walking distance.", "Date": "August 23, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Business service (e.g., internet access)": "1", "Check in / front desk": "4", "Overall": "4.0", "Value": "4", "Rooms": "5", "Location": "4"}, "AuthorLocation": "San Diego, California", "Title": "“Nice hotel.”", "Author": "BearAndPenguin", "ReviewID": "UR18181938", "Content": "Nice hotel. Was very clean and seemed pretty new. The elevator to the parking garage smells a little funky but otherwise is okay. I wish Hilton wouldn't nickel and dime so much. It was $14/night to park and $10/day PER LAPTOP per night for wi-fi. The business center costs were outrageous. I sent a two page fax to an 800 number and it cost $5. The internet access in the business center was equally expensive. We received the government discount so the rate was very good so our value for the money was good. I didn't eat there because the prices were very high. Overall, the room was nice and the front desk staff were helpful but all the additional fees are annoying.", "Date": "July 23, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Business service (e.g., internet access)": "1", "Check in / front desk": "4", "Overall": "4.0", "Value": "3", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Lumberton, Texas", "Title": "“Good Hotel”", "Author": "mom23ingt", "ReviewID": "UR17798587", "Content": "Good hotel stay. Clean rooms and very comfortable beds. Staff was nice. Was a little disappointed when I asked for extra towels to take to the beach and was told they do not allow towels to go off property. This seems a little absurd since San Diego is on the coast with the beach readily available. Being an honest person, I just went to the pool and helped myself to the towels and returned them to the room each evening. Everything else was fine. Was charged for internet access that was done at the pool (told by front desk that poolside was free), but this was quickly taken off.", "Date": "July 11, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Business service (e.g., internet access)": "3", "Check in / front desk": "4", "Overall": "3.0", "Value": "3", "Rooms": "4", "Location": "1"}, "AuthorLocation": "Orange, California", "Title": "“Wouldn't stay here if it weren't for a conference”", "Author": "TravelWithRiley", "ReviewID": "UR17299048", "Content": "Stayed here for 1 night for a conference. Wouldn't choose this location if I were a tourist or looking for a place to relax. Here are the pluses & minuses: Plus - Wonderful complementary breakfast selection for Hilton Honors Gold Members - Clean room - Comfortable bed & pillows - shopping center on the other side of the freeway - In-room fridge - Pets allowed Minus - The location is not that great. There are many other better locations & with better prices. - Paper-thin walls; heard the shower from 1 floor up & doors slamming down the hall - Difficult to view TV as it doesn't pull out from the cabinet - Business center charges for Internet access - Self-parking was $14; valet was $18 per day - Small pool The restaurant, Stish, has terrible food with fancy restaurant prices. No one in the party of 3 liked the food. Seabass was overcooked. Jambalaya had strange cream-base sauce instead of tomato-base sauce.", "Date": "June 28, 2008"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Business service (e.g., internet access)": "4", "Check in / front desk": "3", "Overall": "3.0", "Value": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "toulouse", "Title": "“Recommended”", "Author": "candyToulouse", "ReviewID": "UR17256581", "Content": "Easy access from I8. Spacious room and bathroom, toiletteries replaced each day. Room was very clean & nice. A Japanese restaurant with Teppanyaki & sushi bar, gas station, Denny's, Wendy's next to hotel. Golfmart about 200m away. Across Mission Center Road, there is Westfield Mall, more restaurants. Absolutely convenient. Fashion Valley Mall within close proximity. Buffet breakfast was good, continental buffet breakfast was $11.80 with tax (there is a difference in price between buffet breakfast at $15+ and the continental buffet breakfast though in terms of food, you get waffles and omelette). Staff was not very friendly. Traffic towards the hotel from south is heavy after 4pm. Otherwise it's pretty ok, despite it's close location to the expressway, it's pretty quiet when you're in the room.", "Date": "June 26, 2008"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Business service (e.g., internet access)": "3", "Check in / front desk": "3", "Overall": "3.0", "Value": "3", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Oklahoma City", "Title": "“Not a RESORT”", "Author": "melindajirwin", "ReviewID": "UR16734252", "Content": "Easy access to freeway and lots of chain restaurants on the other side of the freeway. There is also a mall and the trolley stop across the freeway. It is at least a 15 minute walk to the trolley stop ( I walk fast) Took me over an hour to get downtown. Small pool, small fitness center, no spa/salon - not sure why they call it a resort? We were with a large group and we had lots of problems with the elevators. Rooms were nice-hard to see TV from bed as it didn't slide out of armoire. Probably wouldn't recommend this hotel unless you got a cheap price and always planned on driving everywhere. I reallly think Mission Bay or Gaslight District would be preferrable to stay to see the sights of San Diego.", "Date": "June 6, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "4.0", "Value": "4", "Rooms": "5", "Location": "3"}, "AuthorLocation": "", "Title": "“Good choice”", "Author": "califclasy", "ReviewID": "UR15941967", "Content": "This is a nice hotel that has recently been updated. It is slightly hard to get to if you are not used to the freeway system in San Diego, but is close to everything. About 20 minutes or less to Sea World, Old Town, Gaslamp Quarter. Their restaurant is a bit upscale, so we skipped it. Denny's is 1/2 block away and there are other places not far. Parking was $14/day with an in-out pass. The parking is underground with lobby entrance. The staff is very polite and helpful. We asked for extra shampoo and it was delivered while we were out. Rooms are very nice. We did not hear anyone else throughout our stay. Nice and quiet. Although I prefer breakfast on the premises, I would stay here again. Went for 2 nights with my daughter and granddaughter. We had a great time and felt totally safe coming in late at night after sight seeing. Enjoyed the privacy of entering hotel without having to walk through the lobby. Very clean hotel.", "Date": "May 11, 2008"}, {"Ratings": {"Cleanliness": "4", "Overall": "4.0", "Rooms": "3", "Service": "4"}, "AuthorLocation": "London, UK", "Title": "“Worth staying in”", "Author": "EKLHRVS", "ReviewID": "UR14394056", "Content": "We stayed at the Hilton Misson Valley last week. The hotel is OK to find and once you navigate the car park quite easy to find the check in. The receptionists were polite and efficient. The rooms were the type we reserved and we were allocated the 8th Floor. The rooms are average, but needed some TLC as the bathroom sliding door would not shut and the hand towel rail in the bathroom fell off daily! The shower had good pressure though and the bathroom /room in general was clean. The only drawback with the room was that the walls are THIN, you can hear everything in the corridor and the neighbours room besides you and above you! The pool area was nice with a jacuzzi and smallish pool but big enough for the people staying there. The only sad thing is the $14 per night car parking fee - $18 for valet parking. felt this was quite steep. There is a shopping centre opposite within walking distance and if you want a great breakfast then head to Mimi's. We were advised to avoid the buffet breakfast in the hotel - so cannot comment on the quality of the food. Overall the hotel is close to Seaworld and a reasonable hotel for the price paid. Would stay there again if we could get the same deal.", "Date": "March 19, 2008"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Check in / front desk": "4", "Overall": "3.0", "Value": "4", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Scottsdale, Arizona", "Title": "“What One Would Expect From Hilton, Not Bad - Not Terrific”", "Author": "LutefiskHater", "ReviewID": "UR14307241", "Content": "Nice-ishly remodeled hotel. Comfy bed, oddly configured room that was quite small. Valet parking is a total rip off 18$ !!:>0 As was room service. Pricey, as room service always is, but a $2 dine in fee, 18% service charge (NOT an automatic gratuity, service fee!). So your 20$ burger and soda is 20$ + 2$ + 3.96$ (service fee) + 20% tip (5.20$ ). 31 buck for a cold greasy burger with a flat diet coke. But in fairness, it IS in the room service menu fine print. Better to walk over to Denny's or Wendy's ;>) So I would say pass on the room service. Breakfast in the hotel was not bad, but then, not terrific either. Very attentive wait staff, especially the college kid from Ireland. Staff was friendly. Check in and out was quick and pleasant. Valets were very nice. Excellent location. Average chain hotel with very nice college kids working there. Would I stay there again??? Ehhhh mebee....", "Date": "March 15, 2008"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Business service (e.g., internet access)": "2", "Check in / front desk": "2", "Overall": "1.0", "Value": "1", "Rooms": "3", "Location": "2"}, "AuthorLocation": "S. CA", "Title": "“Maybe the worst Hilton yet”", "Author": "USKiwiTraveler", "ReviewID": "UR14273832", "Content": "Hilton Diamond member I stayed at this property in Q'01, 2008 for a meeting which I was holding. The writing was on the wall as to the poor customer service I had received from the Event Coordinator. She was lackadaisical at best and really provided me with the worst experience that I’ve ever had coordinating a meeting at a hotel! The Hotel itself on a scale of 1 – 10 was a 5, at best. The check-in was adequate though they did not have a room prepared even though I had requested an early check-in. The room itself was “okay”, nothing special but clean so can’t complain. The only plus was I had a room facing the mountains as had read previous reviews on the noise from the freeways keeping people awake. I had the same comment said to me from some of my team during their stay. I had access to the Executive lounge in the mornings due to my Hilton Status and again, was very disappointed. The selection of breakfast foods was marginal at best, and the coffee (all the mornings) was the weakest I’ve ever had at a Hilton property in the US. I never ate at the restaurant so can’t comment. Did have pre-dinner cocktails though and found the bar to be modern (but small) with a friendly bartender. As you can guess, for me, this was a rather poor experience. I picked this Hilton as it looked nice on line & thought it may have that “extra bit of service etc.” not being in proper San Diego, sadly I was wrong. My suggestion would be to not stay at this property, and to spend the extra $20- $40 it takes to stay at one of the other Hilton properties in San Diego. It was quite the miserable experience for my team & me.", "Date": "March 14, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Business service (e.g., internet access)": "2", "Check in / front desk": "5", "Overall": "4.0", "Value": "3", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Falls Church, Virginia", "Title": "“Great Place For A Quick Stayover”", "Author": "Bigmonkey13", "ReviewID": "UR14258955", "Content": "I recently returned from business trip in San Diego, where I stayed at the Hilton San Diego Mission Valley. The hotel was in a nice location, within walking distance to several chain restaurants and stores. It is easily accessible to the major highways in the area, allowing one to get around the city fairly quickly. The room I stayed at on the 11th floor was extremely clean and well kept. Everytime I interacted with the staff, be it front desk, room service, etc, I found them to be helpful and courteous. The one complaint that I had is that I found their in-room wireless internet to be unreliable. I spent around an hour on the phone with their technical support and still couldn't get reliable service. All in all, though, I would definitely recommend staying here.", "Date": "March 13, 2008"}, {"Ratings": {"Overall": "3.0"}, "AuthorLocation": "Weybridge, UK", "Title": "“Underwhelmed”", "Author": "ynguy", "ReviewID": "UR12606750", "Content": "I choose this hotel for its central location not for the location it is in ( hotel circle ). As it was very quiet I did not have any problems with parking but I can see when the hotel is busy it can be a tight squeeze. The rooms are tiny which was somewhat disappointing. The decor was ok ish. Something new , something old ( tv's are antiquated). I would certainly recommend taking a room at the back of the house as the rooms facing Mission valley and Interstate 8 are noisy. One can hear the constant din of the traffic. Fitness room seemed out of order and I could not find the sauna. I had breakfast once in hotel and it was so so. Waiting staff seemed nice enough. Front Office staff seemed ok but once the requests are just a touch out of the ordinary much less helpful. I paid a rate of $ 105 so that was not bad at all and for this rate I would stay here again but if rate would be more than $ 139 I would give it a miss.", "Date": "January 14, 2008"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Business service (e.g., internet access)": "1", "Check in / front desk": "2", "Overall": "2.0", "Value": "1", "Rooms": "2", "Location": "3"}, "AuthorLocation": "Seattle", "Title": "“Not worth the money”", "Author": "SendMeSeattle", "ReviewID": "UR11714491", "Content": "We found this hotel to be lacking. The additional charges for internet connection both in the room $10 and in the lobby were something we expected to be included at the Hilton. We also were able to self-park for $13 a day in a lot that was very difficult to find spot available and even then, they were small and hard to fit into. This hotel had free water flavored with strawberries or lemons in the lobby but no breakfast included in the price of the stay. There was a restaurant located in the hotel, very limited options for eating if you did not have a car. The room itself was small, we had a two queen beds and the sink for the bathroom was outside the bathroom across from the closet not the full length of the bathroom as pictured in other reviews on this site. The family found the pool too cold to utilize during the trip but that may have been the cool weather in November. I would recommend many other hotels above this one for a stay in beautiful San Diego.", "Date": "December 20, 2007"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Check in / front desk": "3", "Overall": "4.0", "Value": "4", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Brea, CA", "Title": "“Nice stay, but less than expected”", "Author": "jek134", "ReviewID": "UR10681598", "Content": "I booked a stay at this hotel because a friend gushed about the location. It was nice, but I guess I expected more. We had a standard room with a great view of the fireworks from Sea World (an unexpected surprise). The room itself seemed dusty and my husband and I both commented on how we didn't feel the place was clean. We figured it was because we were so close to the beach (bay). It's not that the place wasn't kept up by housekeeping, we just both had the FEELING that it wasn't as clean as other hotel rooms in which we'd stayed. The decor of the room was okay - they went for a cool modern look with dark furniture and light blue accents. You could tell that the hotel was older and that they had refurbished it. The walls were paper thin. This was the first time I'd slept at a hotel where we could hear EVERYTHING outside our door plus the footsteps of those above us. My husband and I were surprised. We had breakfast at the hotel and that was quite nice. We sat outside on their patio. I had the buffet and my husband ordered off of the menu. The buffet is very similar to one you'd get for free at Embassy Suites, but without the omelette bar. Nice fresh fruit. The pools were nice. I especially loved the little toddler pool as we had our two children ages 2 and 4 with us. It was a foot and a half deep so we didn't really have to worry, but there were leaves and debris everywhere in the pool. It seemed unkempt. Other mothers commented on this as well. The location was nice. Very close to Sea World where we had gone for the day. The bay was right there, though it seemed dirty. We stayed there in July when the weather was great, but the bay looked dark and gray, not bright blue where you'd want to go for a swim. It was still nice to walk along the sand, however. There was also a lot of things to do such as rent bicycles, kayaks, floating devices, volleyball, etc, but as we had the kids with us, we didn't do any of them. Overall, I enjoyed my stay at the hotel, but I guess my expectations were a little too high. I would probably stay there again, but not before I tried a few more hotels in the area.", "Date": "November 8, 2007"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Business service (e.g., internet access)": "4", "Check in / front desk": "4", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Boston, MA", "Title": "“Awesome Stay!”", "Author": "Reekas_Travels77", "ReviewID": "UR10666801", "Content": "My boyfriend and I stayed at this hotel for a few days. It is right off the 5, so the location was excellent for getting to all the San Diego attractions quickly. Service and staff were excellent. We had no issues with the stay. We loved out room - it was spacious, clean, and comfortable. The bed was amazing - super comfy! We also used the business center which was in the lobby area and had no issues there. My only minor complaint would be that parking is not free. It's $14/night to park in their garage. Over all, it was an excellent stay. We would stay here again.", "Date": "November 7, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Business service (e.g., internet access)": "3", "Check in / front desk": "5", "Overall": "4.0", "Value": "3", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Seattle", "Title": "“Clean - Nice Decor - Excellent Staff - Great Location”", "Author": "Stacy12", "ReviewID": "UR10499799", "Content": "Located in Mission Valley right off of Interstate 8. You are close to Qualcomm Stadium, the mall (with many nice eat in restaurants). 10 minutes from downtown & Balboa Park. The room was very nice. Very clean. We had a room overlooking Mission Valley and it was very quiet. No traffic noise at all. The bed was comfortable and comes with extra pillows & down comforter. Parking was $14 a day. A 10% gratituity is automatically added to room service. The staff is excellent. Always a smile and ready to assist with whatever you need. We will be back!", "Date": "November 1, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Check in / front desk": "5", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Kahului, Hawaii", "Title": "“I'm loving it ....”", "Author": "NanaBoogoo", "ReviewID": "UR8358248", "Content": "What a pleasant surprise! My grandson and I were alone for the first few nights (stayed for four) and felt completely safe. The location is very easy to get around. I really enjoyed the convenience of using the hotel driver to get to near by restaurants and shops. The front desk staff were all very friendly and helpful with directions and suggestions. I agree with the previous writer about breakfast .... too expensive for what is being offered. As for the noise mentioned by a previous writer, we slept like a baby! Also, the view to the highway was just fine. From this location we went to the San Diego Zoo, Legoland and Sea World. We tried the steakhouse down the road called \"Bullies\" at the recommendation of the hotel driver. We were so pleased! Food and service were fantastic and the prices were very reasonable. I would surely stay here again!", "Date": "August 5, 2007"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Business service (e.g., internet access)": "4", "Check in / front desk": "5", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Tucson", "Title": "“Nice Hotel...”", "Author": "aznate27", "ReviewID": "UR8348490", "Content": "I stayed at this hotel in July with a friend of mine while in San Diego for Pride, booking a 2 queen on the executive level. The hotel has a contemperary feel to it that extended from the lobby to the restaurant to the room. Our room was nice and very clean. I do wish I would have requested a room at the front of the hotel though. We were 12 stories up in the back of the hotel which had nothing more than the hill that rises above the hotel for a view. The front would have given us a nice city view. As far as location goes, this is a great hotel. We were just a short cab ride from Hillcrest where all the Pride celebrations were, as well as where most of the bars and clubs were located. It's also located fairly close to downtown, the airport, and Sea World. There are several shopping centers located just on the other side of the highway across from the hotel, as well as a number of restaurants located close by to suit everyone's taste. We did eat at Stish, the restaurant located in the hotel. The food was good, but a bit over priced, but what hotel food isn't! The lobster bisk was awesome! Our room did come with a lite breakfast. We opted to spend the extra $5 more ( a day ) each for the full buffet, which was ok as far as breakfast food goes. For the most part the staff was very friendly and attentive. We did have a problem with requesting a cab and getting towncars instead, which on one night turned into a mess! We took this up with Drew, the front desk supervisor, and he was kind enough to take off our parking fee for our stay. Being $14 a day to park, that was more than enough to make up for their mistake. Everything else was fine. Good fitness room, pool, and free internet downstairs in the lobby and restaurant ( $9.95 in room). I'll definetly be back.", "Date": "August 4, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "4.0", "Value": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Detroit, Michigan", "Title": "“Wedding guests loved it!”", "Author": "steviemagid", "ReviewID": "UR8265639", "Content": "We booked this hotel for our daughter's wedding and had over 30 rooms reserved for our guests. Everyone was very pleased with their accommodations, the service, and the location. The staff in the sales department helped with all the plans, gave us good rates for our guests, and generally took care of all of our needs. The rooms are first rate-good beds, sheets, pillows, coffee maker, and nice toiletries. Only drawback was the parking was pricey. Didn't eat at the restaurant, but I heard that it was expensive. Plenty of places to eat in the area. We would definitely return to this property.", "Date": "July 31, 2007"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Business service (e.g., internet access)": "3", "Check in / front desk": "4", "Overall": "4.0", "Value": "3", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Algonquin, Illinois", "Title": "“Hilton Mission Valley”", "Author": "MicSte", "ReviewID": "UR8070284", "Content": "Nice standard Hilton property; rooms were well appointed marble baths, new wallpaper; Highway side wasn't noisy like others state- they must be hyper. Restaurant for breakfast was expensive- $55 for two. Luckily we had coupons from Hilton upgrades for at least one morning- the HHonors lounge wasn't open on weekends - basic buffet..nothing really special. Didn't try dinner why when so much else in town. Small business center but servicable. Really in middle of nowhere although since we had car could get to anywhere within 10-15 minutes ...really. Would have preferred to stay in town at Hilton Gaslight if I had known more about city and could have gotten the same rate.", "Date": "July 6, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "3", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Houston", "Title": "“better than i expected”", "Author": "pickychicky145", "ReviewID": "UR8064633", "Content": "i booked this hotel to attend a conference downtown and i must say i was a little iffy about this hotel after reading some of the comments and looking at the candid travelers photos but i must say it was a wonderful stay. i am VERY picky about the hotels i stay in and trust me this is a nice hotel. the front desk was friendly and did everything they could to keep us informed and happy. the room was very nicely decorated. it looks identical to the hotel photos. the restroom was very clean as was the bed. everyday the room cleaning would clean our room and change our sheets. i have absolutly no negative feedback for this hotel except the expensive parking and internet. the room was very clean. the bed was very comfortable. you couldnt hear your neighbors. the location was great. 5 minutes away from downtown, 2 blocks away from the train transit and 1 block away from a pretty big mall.", "Date": "July 5, 2007"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Business service (e.g., internet access)": "3", "Check in / front desk": "4", "Overall": "4.0", "Value": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "El Centro, CA", "Title": "“Great value”", "Author": "Vis2020", "ReviewID": "UR8035468", "Content": "Got this hotel on a Saturday night via PL for $55. Needless to say at that price it did not take much more to make me happy. However, upon arrival to this hotel, I was impressed with the cleanliness of the hotel. The lobby was cozy and comfortable. Our room was very clean and well appointed. The double bed was very comfortable. We stayed on the third floor right next to the vending/ice machine (probably their standard PL room), but did not encounter much noise all night. Given the price we booked the hotel for on a Weekend, I absolutely have nothing to complain about! Even the $14 parking fee!", "Date": "July 1, 2007"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Check in / front desk": "3", "Overall": "3.0", "Value": "3", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Prescott, Arizona", "Title": "“Not your average Hilton Hotel”", "Author": "Ariz0nian", "ReviewID": "UR7857471", "Content": "I found the hotel extremely clean, very quiet and comfortable, almost new like. The hotel lobby seemed very small. My kitchen is larger than the onsite convenience store. The restaurant was also small, but the breakfast food that I had was very good. However, I think the hotel is suited more for business travel rather than family vacations. I booked a room on the executive floor for a Friday and Saturday night stay. I was informed after my arrival that the hospitality suite is not open or available on Fridays and Saturdays. I was unable to purchase or receive a newspaper within or immediately outside of the hotel. I had to get in my car and drive to a bookstore on the other side of the freeway to purchase a newspaper. I feel the price of the hotel is somewhat high for what you receive, but is probably OK for business men and women on an expense account. I will not be back.", "Date": "June 16, 2007"}, {"Ratings": {"Service": "1", "Cleanliness": "3", "Check in / front desk": "2", "Overall": "2.0", "Value": "3", "Rooms": "3", "Location": "2"}, "AuthorLocation": "Virginia", "Title": "“Incredible disappearing valets!”", "Author": "OldGal&Todd", "ReviewID": "UR7630570", "Content": "We pulled up to the property tired after a long flight, and the valet parkers (2 or 3 of them) asked if we wanted valet parking or self-parking. We picked self-parking, and ALL of the valets actually levitated and disappeared in a flash! We actually laughed, but my husband was not pleased to be lugging two suitcases into the hotel while I parked in the clean but cramped and overpriced self-parking. The indifferent desk clerk did not acknowledge our Hilton Honors membership nor offer any amenities. I don't believe we even got a newspaper! While the room was comfortable, hardly anyone was staying at the hotel yet they apparently crammed us all into one corridor so we heard screaming children all night long. I guess the placement of people is for the convenience of the cleaning staff. Anyhow, bored by the hotel and its lack of charm, we checked out after two days and went to a small, family owned property which we enjoyed much more. Then, to top it all off, the Hilton charged my credit card for the whole proposed stay (7 nights), even though we checked out after 2. I called several times, and the staff kept saying \"they don't know what happened.\" Finally I got a helpful accountant/manager who tried to help. The charges eventually went away. So I guess we were pretty disappointed with the lack of service, glitches in accounting, and all-over hotel experience.", "Date": "May 16, 2007"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Business service (e.g., internet access)": "4", "Check in / front desk": "4", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "2"}, "AuthorLocation": "Melbourne, Australia", "Title": "“More good than bad”", "Author": "Roslyn D", "ReviewID": "UR7594043", "Content": "I stayed here for a conference. The room was clean and comfortable. It was on the freeway side of the building, so there was constantly a bit of white noise, but didn't really notice as I wasn't there much. The bed was really comfortable but I would have liked a choice of pillows instead of 5 soft feather ones (I like a firm pillow). The gym was ok, as was the pool. The internet said it was $9.95 for 24 hours but I was charged that much for the whole 5 days I stayed, so was pretty happy about that. The restaurant was pretty good, and the breakfasts were free via some vouchers that they presented me on arrival, although I don't know if had a special booking. The location was not great, but every hotel chain has one in this area, so I don't know what the attraction is, maybe it's cheaper to stay here for Sea World? It was about $15 to catch a cab to Balboa park and the zoo, about $20 to downtown, and $25 to the airport. The shopping malls on the other side of the freeway (10 minutes walk) were really handy. The staff were all friendly and helpful. Overall, not bad.", "Date": "May 13, 2007"}, {"Ratings": {"Overall": "3.0"}, "AuthorLocation": "California", "Title": "“Great Place for Nomad's Soccer Tournment”", "Author": "Stradavelo", "ReviewID": "UR7553356", "Content": "Stayed here for a soccer tournment. I cannot say enough about the beds at this Hilton.....very comfortable. The staff was very helpful to our group and allowed us to use the common areas one evening for a gathering. Parking was expensive and the hot tub had too much Chlorine in it. Close to Starbucks and food. We had a quite room facing away from the freeway. I would definitely stay here again.", "Date": "May 7, 2007"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Business service (e.g., internet access)": "4", "Check in / front desk": "4", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Edmonton, Canada", "Title": "“Decent San Diego area hotel”", "Author": "miselainis", "ReviewID": "UR7438446", "Content": "I was traveling to San Diego to visit a cousin, and did not want to fight crowds downtown. I wanted to be relatively close to El Cajon, where she and her husband live. The Hilton is right off the I-8 Expressway, so that was great. Also, there is a large shopping area directly across the street, which came in handy for various items. There is a bookstore, Gordon Biersch Brewery, liquor store, West Elm, and a Westfield mall (which is actually more like an outdoor flea market, and PACKED with aimless kids). It did have a Target and lots of other places, but looked rather grubby, what I saw of it. The Hilton had a spacious lobby, check-in was a breeze, and the room was spacious and comfortable. I had a panoramic view of the highway and shopping across it. The bed was very comfortable, and the internet worked. The toiletries were Crabtree and Evelyn La Source, and smelled wonderful. The bathroom itself was a little dark, but they did have a lighted makeup mirror, which was a nice touch. For dinner, I tried room service, but wasn't that impressed with my Cuban sandwich. It seemed a little dry. The dessert special was a blueberry bread puddng that was pretty good. I even got a call from the staff asking if I'd enjoyed it and if it was OK, which was new. I'd never had that type of customer service before, and appreciated it. The parking garage is over to one side of the hotel, and was a little small, which made it hard to maneuver larger cars (I had rented a Dodge Avenger). I also found it a little difficult to get in and out of. The stairway was very far to one side, and the ramp going in was quite steep. I try to walk direct routes so as not to get too tired (because my legs can get weak), so it was a little inconvenient. There was a reception of some kind the one evening I came back to the hotel after shopping, and I thought, \"Oh great. I'm going to hear that all night.\" I wasn't as worried about the event itself as the party-goers who might be staying at the hotel being loud and disturbing everyone else, but it turns out there was no need for worry. I didn't hear a thing. The layout of the restaurant/bar was confusing if you're coming in from the back bar part of the hotel near the elevators instead of the front entrance. The restaurant entrance is all the way to the other side from the elevators. I came down for breakfast one morning and was very droopy from staying up and watching a late night movie. The restaurant staff stood and watched me a for a few moments, and I finally figured out how to get over to where the food was. THEN they said something like \"Over here.\" They might want to put up signage in the morning if you go in the wrong door so you don't feel like a fool. The eggs benedict were good, but nothing special. Good coffee. All in all, a pleasant stay. Comfortable, but I'd go out to eat more next time.", "Date": "April 26, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "SoCal", "Title": "“A great place to stay and convenient to Downtown!”", "Author": "onoman", "ReviewID": "UR6852363", "Content": "Went to a meeting at the San Diego Convention Center, unfortunately had to change arrangements and had to stay outside of the Downtown area. Stayed at the Hilton Hotel in Mission Valley, which turned out to be a great choice for me. It is not that far from the Convention Center and trips from the hotel to the convention only took about 15 minutes via freeway, probably 6 miles. It is very convenient to get to via Interstate 8 and hwy 163. There is a mall area across the freeway with many nearby restaurants--Chevy's, Gordon Birsch, Baja Fresh to name a few and several stores--Borders, Target, Nordstrom Rack. Parking not an issue. Room was spacious, bed comfortable and the staff was very accommodating. It was very quiet, I was on the 10 floor. Did not eat in hotel, did not use exercise room or pool. Self parking is convenient, although $14/nite, unlimited in and out. For the price, I was very pleased with the hotel, the distance from Downtown was insignificant and would definitely recommend staying her again!", "Date": "February 27, 2007"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Northern VA", "Title": "“Great customer service, would stay here again”", "Author": "blondebavarian", "ReviewID": "UR6534309", "Content": "Disclaimer: we stayed here using our HHonors points, but hopefully would be the same experience regardless. Pros: Asked for a room change to be away from interstate side, customer service was very friendly and accommodating with a quiet new room. Gave us detailed directions to local attractions & recommended nearby restaurants. Great central location, convenient to area attractions. Fabulous heated pool & jacuzzi. Bed and linens are superior. Lobby and common areas were updated and tastefully decorated in retro decor. Cons: Room is on the small side. Shuttle service only goes within 2 mile radius of hotel (most attractions are 3-4 miles away). Traffic can be heard on freeway side of hotel. As with all Hilton or Mariott brands, be prepared to be nickeled-and-dimed for internet service & business center access, and breakfast is not free.", "Date": "January 1, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Pasadena, California", "Title": "“Loved It”", "Author": "sugarplumsyum", "ReviewID": "UR6505241", "Content": "The guest services person was great. I was arriving around 2am and the Hilton customer service rep called the hotel for me to ensure that my room is not given away. I got the executive suite for a great price of $119 on a weekday. Room service was kind, room was clean. I loved the shampoo and conditioner from Crabtree and Evelyn. Most hotels only provide a combination shampoo/conditioners so it was a nice treat to have both separately. I chose the Hilton over the Hilton owned doubletree, because I heard that this Hilton had recently undergone rehab...and most importantly, it had a nice down comforter to make my business trip comfortable and relaxing.", "Date": "December 27, 2006"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Business service (e.g., internet access)": "3", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Tampa, Florida", "Title": "“Not bad, a great location outside of downtown”", "Author": "cubanito1", "ReviewID": "UR6179076", "Content": "OK first off I got a great deal 5 night plus a car for 500 bucks on Expedia when booking together. The HIlton Mission is OK, its not great. They charge you 12 bucks a day to park, which is dumb. They do have wireless internet in rooms at 9bucks for 24hours which is somewhat reasonable. Pros: Location is 10 minutes to downtown, or Seaworld, and right across the interstate are all the mall shops and restaurants you could ask for. Cons: Got a room facing the freeway, on the 11th floor, but still noisy. I didnt mind it too much though, only when the cops are flying down the highway with sirens on. 12 bucks to park, although you do get in and out privlages. All in all not the best Hilton Ive stayed at, but it was clean, comfortable and a great value. I would stay here again and not have to pay out the but for a classier downtown hotel.", "Date": "November 27, 2006"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Check in / front desk": "5", "Overall": "4.0", "Value": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Long Beach, CA.", "Title": "“Happy with the Hilton.”", "Author": "grram1", "ReviewID": "UR5790431", "Content": "Overall this is a very nice property and our experience was a good one. First the positives: - Good size rooms, nicely furnished, great beds. - Good location (just a few miles from all of the major attractions and is right across the street from lots of food and shopping). - Rock bottom price through Priceline bidding process (if I was basing the review on the price I got I would easily give it the top 5 of 5 rating, my 4 of 5 rating is purposely leaving price out as a factor in order to give a fair rating). - Great service... the front desk people were fantastic and they were very receptive to all of my requests and needs (some times when you get a room through Priceline or Hotwire you end up not getting quite the same level of service from the hotel that you would otherwise). Neutral: - Pool and spa were small, but serviceable and had long hours. - Styling in the rooms was a little dated, but nicely maintained with lots of quality touches (I imagine the renovated rooms must be extremely nice). Negatives: - Parking was tight and the parking elevators were out of service. In fairness they did offer valet parking at no additional charge though because of the elevator situation. The $12/night seemed unnecessary for the hotel circle area (I would expect it downtown, but not here). On the other hand after having recently paid: $22 in Arlington VA (outside of Washington DC), $29 in Toronto, $39 in Chicago, and $47 in New York City the $12 here didn't seem quite so bad. - Once an hour or so the A/C unit would make a noticeable \"thumping\" sound. Wasn't so bad that we lost any sleep though. Overall would recommend this hotel highly and I would be thrilled if I ever \"won\" this property again through either Priceline or Hotwire.", "Date": "September 11, 2006"}], "HotelInfo": {"Name": "Hilton San Diego Mission Valley", "HotelURL": "/ShowUserReviews-g60750-d76741-Reviews-Hilton_San_Diego_Mission_Valley-San_Diego_California.html", "Price": "$131 - $233*", "Address": "<address> <span rel=\"v:address\"> <span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">901 Camino del Rio South</span>, <span class=\"locality\"><span property=\"v:locality\">San Diego</span>, <span property=\"v:region\">CA</span> <span property=\"v:postal-code\">92108</span></span> </span> </span> </address>", "HotelID": "2515525", "ImgURL": "http://media-cdn.tripadvisor.com/media/ProviderThumbnails/dirs/82/87/828772df8bf67f96a33ffe0b9746addf6large.jpg"}}