{"Reviews": [{"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Charlotte, North Carolina", "Title": "“Napa-chic”", "Author": "Anna0907", "ReviewID": "UR129207887", "Content": "We are currently staying at Hotel Yountville. I use Trip Advisor regularly but this is the first review I have ever penned. We are a couple in our mid- thirties, almost late-thirties, and this is our kind of place. The rooms are beautiful, think restoration hardware catalog, the service is excellent and the hotel is perfectly located, two minute walk to the best restaurants you could imgaine. Being from the east coast the time change is tough. The resturant on property only serves breakfast beginning at 7:30, we are up earlier. I will spill some secrets-they will pack you a picnic lunch, drive you to dinner and have bikes and iPads at your disposal. We booked a regular room and we were either extremely lucky, or every room as a excellent outside space that we have used regularly. If it is your first trio to Napa, pack layers, at least in Spring and Fall. The property is excellently maintained and trust me I am a critic. (Also the bathroom is gorgeous and has a whirlpool). If you don't love this place and feel perfectly comfortable you are a snob. As a side note we got at peak in a room at the high-end competition down the street - it is lovely but a hotel for your mother, not you. Have a blast in Napa, it is a special place.", "Date": "May 1, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Ontario", "Title": "“Sad to leave...”", "Author": "tesoro1981", "ReviewID": "UR129139952", "Content": "4 nights in February was perfection. The rooms are stunning, the service impeccable, the grounds heaven. The room was so beautiful in fact, that we took pictures and want to renovate our existing bedroom to the EXACT specs ! lol. It was sad to leave this place as it is very luxurious and hard to drag yourself back to reality. Gives us more reason to return. Sure the walls are thin and you can sometimes hear the neighbours. But we were lucky enough to only notice it a couple times as the next room was unoccupied for the majority of our stay. I would recommend a second floor room to remove any potential noise from the upstairs neighbours. And the so-called \"trailer park\" people complain about is really a non-issue. Didnt really notice it at all and probably wouldnt have if I had not read some reviews here. A great stay ! I recommend heading down during the off season. Prices are lower, its quieter, romantic and just as enjoyable, if not more so.", "Date": "April 30, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Austin, Texas", "Title": "“My new favorite place!”", "Author": "Jennifer W", "ReviewID": "UR128529621", "Content": "If I could live in the Premium King Suite at Hotel Yountville I would. My huband and I went for a weekend getaway and couldn't have been more impressed. The greeting upon arrival was friendly and because we had read reviews of the noise in the rooms I requested a quite spot on property, they had a vacant upgraded unit that they put us in to ensure we were happy. It was gorgeous, we want to remodel our bathroom to the exact decor. Housekeeping came in to set the mood and give the room a fluff every afternoon so we were welcomed into a fresh setting everytime. The night we got there I had a terrible allergic reaction to the down in the room and they changed all of the linens immediately. Wow! Talk about fantastic service! We will be back and I will be recommending them to everyone I know!", "Date": "April 24, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Dallas, TX", "Title": "“The perfect stay in Napa area!”", "Author": "TXgalDallas_TX", "ReviewID": "UR128394367", "Content": "Hotel Yountville was the perfect choice for our 3 day weekend in Napa. Great location near all the main towns, yet quaint and quiet for relaxtion after long days at the wineries! Best of all, you can walk thru cute Yountville with lots of dining options. Whether as a couple or with friends, they are the perfect botique like hotel!", "Date": "April 23, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "3.0", "Value": "3", "Sleep Quality": "3", "Rooms": "5", "Location": "5"}, "AuthorLocation": "San Francisco, California", "Title": "“Beautiful rooms, but paper-thin walls”", "Author": "Colleen B", "ReviewID": "UR127927261", "Content": "I loved this place as soon as I stepped in. The grounds and rooms are beautifully kept and clean. The service is friendly. We stayed in room 311. I was very disappointed by how thin the walls in our room were. We could hear EVERYTHING that was being said and done in both our neighbors' rooms. Honestly, I've had a more restful sleep in a casino/hotel in Vegas. I would highly recommend the 3-course brunch tasting menu at the hotel's Hopper Creek Restaurant.", "Date": "April 15, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "New York City, New York", "Title": "“If the Hotel Were Wine, It Would be a Parker 94”", "Author": "RTL212", "ReviewID": "UR127703840", "Content": "From our travel perspective, the Napa Valley has a lot of ordinary hotels at luxury prices. The Hotel Yountville is an exception. Located a 5 minute walk (if one walks slowly) from the center of the village, the hotel is so fully renovated as to be brand new. Though pretending to be in the spirit of Tuscany, the lobby is no more than a contemporary decorator's cliche with a not very creative Restoration Hardware theme. It is large, spacious and comfortable, and if we hadn't been confused by the incomprehensible reference to Tuscany, we wouldn't have known for the worse. On the way to the rooms, organized into seven separate buildings, you pass by a very California-style sitting area organized around a rectangular fountain with a large gas fireplace (wood would have been so much nicer). The rooms are very large, well decorated, with gas fireplaces, excellent bathrooms and very large closets. Ours had a peaked ceiling and beams and nice light. One drawback to some rooms -- the parking area is very large as it serves all of the separated buildings, and some rooms can't avoid a parking lot view. The small swimming pool is a perfect comfortable temperature, bordered by a nice jacuzzi and another large gas-driven fire pit and a very large, diffused seating area. The highway is very close by but we rarely heard noise; other hotels in the area haven't done well with that but the Yountville did. We were a bit off season but can imagine a bit less desirable stay in full season if families and noisy kids decide to stay around the pool; but we didn't have that problem and found the hotel to be a restful, spacious and very comfortable place.", "Date": "April 11, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Northern Michigan", "Title": "“Did Not Want To Leave!”", "Author": "NorthBayTraveler62", "ReviewID": "UR126973945", "Content": "I LOVED our stay at this property! So cozy, luxurious and decorated beautifully! The bathroom was like a spa, including great products. The location is great for the Napa/Sonoma area. The only downside is the setting. There is a trailer park and walking path along side the property. :/ I would absolutely stay here again, just would ask for a different spot on the property. We stayed on the lower level (which was pretty quiet), with one floor above us and you park outside your door, very convenient.", "Date": "March 30, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Reno", "Title": "“Hidden Gem”", "Author": "Erik H", "ReviewID": "UR126750344", "Content": "This is a great spot for enjoying wine country. Located in the heart of the valley it's a great location to start off your day of tasting. Within walking distance to Bistro Jeanty, REDD and Bouchon. The suites are beautiful. The breakfasts are amazing, Everything you would expect from a luxury hotel in the Napa Valley. Definitely the most comfortable bed we've ever slept in! I wish i knew what brand mattress they have so I could buy one for us at home.", "Date": "March 27, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "San Francisco", "Title": "“Yountville sparkles”", "Author": "SanFranciscoPeter", "ReviewID": "UR126650487", "Content": "We recently had a splendid time at Hotel Yountville during a recent trip with my family. Interfacing with the hotel was easy and efficient before our visit. When we arrived our room was not ready but we were immediately soothed by the comfortable and cozy lobby, sipping on complementary Harney & Sons Paris Bergamot tea and Equator coffee with good music. The room itself was inviting and stylish - very California, very modern, with a perfect color palate and lighting, Yountville itself was a great place to stay in wine country with the highest per-capita Michelin starred restaurants at a stone's throw from the hotel. When we visited, the Taste of Yountville festival allowed us to sample many of the town's fine restaurants. We left at the end of the weekend renewed and reinvigorated - exactly what we wanted. Top 10 reasons to go to Hotel Yountville (in no particular order): 1. Fantastic staff. Smiles everywhere. Personal service. Thanks especially to the bartender Corey and the staff at the restaurant. 2. Comfortable bed. A great night's sleep with curtain panels that unfold on all sides of the bed for that dreamy feeling. 3. In room fireplace. Settling down with a glowing fireplace in the background was the perfect end to the day. 4. Hopper Creek Kitchen: One of the highlights of each day was our morning trek to the hotel restaurant. One of the best breakfasts we have had. Farm fresh eggs. Brioche toast with home made jam. Blueberry hotcakes with California pistachios. Freshly squeezed orange juice. Mmmmm. 5. Pool and hot tub: Heavenly and never crowded. 6. Setting: Mountains in the background. Creek running through hotel property. Beautifully landscaped. 7. Turndown service. Locally sourced Kollar chocolates left on the pillow (which we also sampled at the festival) was a special touch, as was the artfully lit evening candle in the bathroom. 8. Complementary lobby Harney & Sons tea, Equator coffee and spa water. 9. Ceiling fans. Together with the curtains around the bed led to a dreamy feeling. 10. Hotel bikes. Free to use for guests. Fantastic perk.", "Date": "March 25, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Mystic, Connecticut", "Title": "“Must stay here!”", "Author": "MysticNick", "ReviewID": "UR126637832", "Content": "I cannot say enough good about this Hotel. We were treated very well here by the staff; we were given an upgrade to a Premium Suite and had Champagne and chocolates in our room upon arrival. The suite was gorgeous and very clean and I really enjoyed the Spa bathroom every day. The premises are beautiful and the food, whether room service or at the restaurant are excellent-the breakfast was amazing! They made restaurant and wine tasting reservations for us and most tastings were complimentary. Yountville is the best town to stay in Napa because all of the amazing restaurants are within walking distance; French Laundry, Bouchon, Bottega, and their bakery. We ate at all except French Luandry and they were all excellent; we really enjoyed walking to the bakery when they opened and eating their croissants and pastries...a very enjoyable expererience. Please try the following vineyards: Opus One, Domaine Chandon ( had so much fun doing a reserve tasting), Cakebread, Rombauer...Enjoy!!", "Date": "March 25, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Los Gatos, California", "Title": "“Beautiful room and lovely staff!”", "Author": "jzme", "ReviewID": "UR126495674", "Content": "My guy and I and BFF and her boyfriend stayed in 2 rooms for just one night in February. We got a \"locals\" rate which would have given us a ADA accessible room, however the hotel upgraded us before we even arrived. The rooms are nicely decorated and cozy, love the fireplace and high ceilings! It was raining while we were there but, no fear, there were umbrellas in the closet. This lovely hotel is an easy walk to downtown Yountville and close to the restaurant we ate at, REDD....YUM!!! Two words...butterscotch pudding! The hotel amenities were luxurious, the staff very personal and helpful. The bartenders (sorry can't remember their names...guy in the day and a lady at night, night of the Oscars) were so friendly and helpful with suggestions. We were celebrating my birthday and, upon arrival, there was a knock on our door with a complimentary bottle of Pinot, a delicious plate of bite size chocolate goodies and a hand written birthday card!!! How lovely is that? We had so much fun sitting by the fire sharing the wine and chocolates, very nice touch! Thanks Hotel Yountville!!! The only minor downsides were that the patio was not very private, could have use more ivy or bamboo as a privacy cover. The insulation between the rooms was not great...could hear our neighbors talking. Minor glitch with payment, my BFF had reserved the rooms on her CC and when we got there my guy put his card down as payment for our room. She ended up getting charged for both and he got charged zero. Check in the mail to her though, so I'm over it. I highly recommend this hotel and Yountville in general as a romantic, fun, relaxing getaway!!!", "Date": "March 22, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Santa Fe, New Mexico", "Title": "“Fabulous”", "Author": "peggy2357", "ReviewID": "UR125427375", "Content": "This is everything a hotel should be. We stayed for our anniversary and were upgraded to a beautiful room. The staff were exceptional, helpful, and friendly. The room itself was large and comfortable, and the bathroom was a dream. We took lots of photos and hope to do something similar when we remodel our own bathroom. They thought of every need from umbrellas and robes, to a Keurig coffeemaker in the room. Others have mentioned noise from the next room, but we did not experience this. You can bike over to Domaine Chandon ! We cannot wait to come back. Loved it.", "Date": "February 29, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Austin", "Title": "“Great Value in Wine Country”", "Author": "lac555", "ReviewID": "UR124985424", "Content": "We have stayed at this property several times in the past when it was the Yountville Inn. The last time we stayed there the hotel was worn and in need of updating. We are happy to say the hotel underwent an extensive renovation and reopened last year as Hotel Yountville. Service - For starters, when we arrived at the hotel on a busy holiday weekend, we found out that our reservation had been cancelled in error. After a little bit of research, they found the issue and were able to for our reservation. Thank you Melody!!! This could have been, and I am sure at many hotels would have been, a very bad situation. Also on the service side, Melody asked us about our plans. We have been to the valley several times and always seek out new wineries. While not wine geeks, we are serious about or wine and consider these visits shopping trips to locate wines and wineries we we cannot get at home. While we had a few wine tastings planned, Melody made some recommendations based on what we told her we were looking for. She made some calls and was able to schedule us in to some great wineries on short notice. Rooms - We had a king room on the lower floor. The room had a gas fire place, separate seating area, and large bathroom with jacuzzi tub and separate shower. The room was very clean with service twice per day. The bed and pillows were very comfortable, and the seating area with love seat and chair was nice for relaxing after a day of tasting. The balcony had two chairs overlooking a creek. Some reviewers have complained about the trailer park behind the hotel. If you re on the upper floor with a balcony, I could understand that as you would be overlooking the park. Of course if you look over that you see the mountains. Yountville is growing and some day the park will be replaced by large homes or a hotel, in that case the trailer park may not be bad as you still get the mountain views. The downside of the lower floor is that there is a walking trail that goes by the patios. There are shrubs between and I did not think that was a big deal. My only complaints would be 1) I wish there was a double vanity in the bathroom instead of the single. the bathroom is large enough and the renovation is recent, not sure why only a single, 2) The A/C unit is a single unit blowing right on the bed. I hate these units as it always seems to be too hot or cold, and the unit blowed on you in bed. Again, as a new renovation, these should have central air, or, at a minimum, not have the a/c near the bed, 3) the walls and ceilings are not very soundproof. Common in many places, but again, should have been addressed in the renovation. Facilities - There is a very nice pool area with a hot tub. We did not use it but it looked very nice and comfortable. There is also a spa which we did not use so cannot comment on. There is a small resent that is only open for breakfast. The food and service was great. I only wish it was open later in the day for sandwiches, salads, pizza, etc. After a day of tasting, that would have been nice. Overall, I use the term great value because it is when compared to other places in Yountville. It may not have a famous restaurant, spa, or tennis courts, but that is fine with me. I prefer it like this. The location is excellent as you can walk to some of the best restaurants in the valley. additionally, several tasting rooms have opened in Yountville so you can walk to tastings if you want. While there are a few things I would like different, I still rate as excellent and will definitely stay here again. I highly recommend.", "Date": "February 21, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Chicago, Illinois", "Title": "“Very Romantic”", "Author": "dheronimus", "ReviewID": "UR124871368", "Content": "Simply loved the room with fireplace, four poster bed, and great bathroom (huge shower and jacuzzi tub). The staff were all very helpful and nice. The terrace is a great place to relax and have a drink. The only reason I didn't give this hotel an Excellent rating was because the walls are very thin and we could hear everything that was being said in the room next to ours.", "Date": "February 20, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Los Angeles, California", "Title": "“What a great stay”", "Author": "solofilm", "ReviewID": "UR124573399", "Content": "My husband and I went to celebrate with 10 of our friends to Napa our birthdays. I you are looking for a romantic getaway combined with celebrating with a bigger group of friends and event, hotel Yountville has it all. We rented one bedroom, very beautiful, with our own private deck. Besides an amazing, classy space with high quality service, we we also able to invite our friends for a glass of wine before heading out for dinner. Great pool, great spa, great breakfast dining, and the hotel lobby is very comfortable to meet everyone as well. We are definitely coming back. Thank you, staff!", "Date": "February 14, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Fox Point, WI", "Title": "“Pampered”", "Author": "SSViaje", "ReviewID": "UR124488913", "Content": "Hubbie and I were delighted from the start with Hotel Yountville. We were greeted with an upgrade to a lovely room with fireplace, jacuzzi, balcony... Everything was pristine and clean. Our only mistake: Next time we will start our vacation in San Fran & end in Yountville because it was hard to go from spacious Hotel Yountville to a city hotel room that was smaller than our bathroom in Yountville. (Truly!)", "Date": "February 12, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "", "Title": "“A perfect escape”", "Author": "The_Chevalier", "ReviewID": "UR124256107", "Content": "At the center of Yountville, the heart of Napa Vally. Beautiful rooms (go for the Superior - it's worth it), quiet and relaxing atmosphere. A great place for a romantic vacation or touring the wine country.", "Date": "February 7, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Waterloo, Iowa", "Title": "“Classy, Romantic, Elite”", "Author": "Kent M", "ReviewID": "UR124250227", "Content": "Expensive...BUT WORTH IT ! This place is fabulous. 5 star Room, Great beds and bedding. The bathroom is one of the best I have been. The grounds are immaculate. The staff is responsive. Yountville is a great place to stay in Napa Valley. Our patio overlooked a creek.", "Date": "February 7, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Adelaide, Australia", "Title": "“Perfect balance of personal, small and gorgeous!”", "Author": "Salon", "ReviewID": "UR124220587", "Content": "We loved this hotel. We loved the fire pits, the pool, the bar, the room - the bathroom! The bed was super comfortable, the bathroom with the luggage storage area and makeup table was well thought out and appreciated. We loved walking to all the restaurants (Redd was our favourite). I understand that some people might think there needs to be a dinner restaurant (and I think they should consider holding special wine dinners in their gorgeous breakfast dining room) and the view over the houses behind isn't the greatest - but look beyond that to the hills, the lovely service and the stunning facilities they do have. Greatly enjoyed. Cheers!", "Date": "February 6, 2012"}, {"Ratings": {"Service": "1", "Cleanliness": "5", "Overall": "2.0", "Value": "3", "Location": "5", "Rooms": "5"}, "AuthorLocation": "", "Title": "“Unhappy with level of service”", "Author": "Debbiepez", "ReviewID": "UR124206089", "Content": "My husband I stayed here two nights. The rooms are gorgeous and we were even more excited about our romantic weekend upon seeing the room. Well, first night we were awakened multiple times by a crying, SCREAMING infant. At 6am, after the 4th time, I called the front desk. Her response was, I wish you would have called during the night. Understanding, this wasn't the hotel's fault I made one request. I asked if the people in the room could either be moved or us. They told us the people on either side were checking out and that it wouldn't happen again. That night, we realized The clerk had lied because we discovered another party we knew was in the room next to us and they do t have a baby. We were concerned but had a party to attend and did notarized back until 11pm. Once again, crying baby. We complained upon checkout. Keep in mind, nt only were they foolish enough to put a family with an infant next to a couple on a romantic getaway, they LIED by telling us they were checking out. They gave us a $150 credit which is quite frankly insulting for the loss of two nights sleep. I don't believe the entire stay should have been refunded but probably one full night. Although the facility was beautiful, some additional thought needs to be put into guest placement. Also,don't lie to your guests. Will not stay here again.", "Date": "February 6, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Washington, DC", "Title": "“Great hotel but could use some more amenities.”", "Author": "Nathani", "ReviewID": "UR123846775", "Content": "Overall, the hotel is beautiful. The rooms are modern and very comfortable with spacious bathrooms and fireplaces. The location is also awesome. The only complaint that I have is the lack of a true concierge. The front desk staff can be helpful, but it was a little difficult to get assistance booking wine tastings or restaurant reservations. In addition, there are generally not very many front desk staff and bellman to assist.", "Date": "January 30, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Greensboro, North Carolina", "Title": "“Heaven!”", "Author": "FoxyFoodFan", "ReviewID": "UR123622695", "Content": "My husband and I stayed at Hotel Yountville a few days before Christmas and we absolutely loved it! First of all, the hotel gave us a room upgrade which was a real treat, an early Christmas present! The room was beautiful, tasteful, upscale yet comfortable, modern but not cold. In fact, I took several pictures of the room so I could use some of the ideas to incorporate into my home. Our room was located on the ground floor but we couldn't hear any noise from upstairs or the room next to us. Parking, which is complimentary, is not a parking deck or a spacious parking lot. Patrons park right outside their room door. A very nice touch. The location is stellar. We would walk to Bouchon Bakery for coffee in the morning, then in the evening, we walked a couple blocks for dinner. For the amenities, location, ambience and decor, Hotel Yountville is a great deal. There are many other pricier hotels that are far inferior. The only complaint is there is no gym on the premises. I realize a trip to Napa Valley should be leisurely and relaxing, but a girl's gotta burn off some calories consumed during wine tasting and indulgent dinners, right?!?", "Date": "January 25, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Livermore, California", "Title": "“fantastic birthday”", "Author": "Christopher K", "ReviewID": "UR123552068", "Content": "My wife and I spent a night at this hotel for a birthday getaway, leaving the kids with grandma. We had one of the best getaways ever in our 20 year relationship. The hotel staff gave us the VIP treatment all the way (upgrade, champagne, chocolate, etc.). The room was beautifully rennovated with all the amenities. The pool and hottub were really, really nice after a day and night of wining and dining. The bikes they provided were fun and convenient for getting around and exploring this quaint little town. Finally, the breakfast was superb (not included, but reasonably priced). We can't wait to go back again!", "Date": "January 24, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Chicago", "Title": "“Truly Great Service”", "Author": "bteitel", "ReviewID": "UR123464985", "Content": "My girlfriend and I recently stayed at Hotel Yountville. We stayed in a King Deluxe, and the room was beautiful. The decor was elegant, the type of stuff I would put in my own home. The weather was a bit chilly during the weekend, so we even got some nice use out of the fireplace. The staff was really great. Each member of the staff went above and beyond when called upon. Peter, one of the front desk staff, took it upon himself to call several wineries for us, and craft an afternoon of tastings for us. These guys really knew their stuff when it came to all things Napa Valley. The property is very large, and there are fireplaces and sitting areas everywhere. The pool was awesome - heated pool, jacuzzi, fire pit. truly a beautiful property, and the location can't be beat.", "Date": "January 22, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "3.0", "Value": "4", "Sleep Quality": "2", "Rooms": "5", "Location": "4"}, "AuthorLocation": "canada", "Title": "“Great renovation but still a few kinks to work out”", "Author": "kevincanada", "ReviewID": "UR123330464", "Content": "We stayed here before the renovation and recently after it was done. Everything is beautiful. However there are a few minor kinks which were aggravating. The walls are thin and if you have a loud neighbor you can hear everything. If you cant fall asleep that easily like me than it will drive you crazy. I talked to the hotel about this and they said they had heard this complaint before and are working on fixing it. The beds were a little firm and the pillows large and not correct for the bed. These are the only problems I had othewise everything was great. The pool is georgeous and the Restaurant was very good though somewhat limited. All of the staff were great.", "Date": "January 19, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "", "Title": "“Fabulous renovation!! Fabulous Service!”", "Author": "Msk6261", "ReviewID": "UR123213556", "Content": "I cannot say enough good things about the new Hotel Yountville. Having stayed at the Yountville Inn many years ago, I would never have expected the caliber of hotel that they have now created! Service was outstanding! Friendly, warm, helpful and approachable! They spared no expense in the remodel and the rooms/bathrooms are exquisitely appointed. Top quality linens and towels. Extremely comfortable bed. Extra quiet, solidly constructed rooms. They offer bikes and accessibility to many wonderful wineries which, even though we visit Napa often, we had never tried. Walking distance to so many wonderful restaurants! The breakfast was fabulous too! And free wifi to boot!! I hate to gush but we have stayed in SO many, not worthy accommodations in the area. We live about an hour away and go to Napa often for a quick get away. We only stayed one night this trip but I think we have found our new go-to place in the Valley.", "Date": "January 17, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Location": "4", "Rooms": "5"}, "AuthorLocation": "Laguna Beach, California", "Title": "“very nice rooms and pool area”", "Author": "LagunaBeachTraveler", "ReviewID": "UR122661171", "Content": "we stayed for 2 nights in a larger, nicely appointed 2nd floor room which was an upgrade. the hotel is in proximity to the highway and traffic can be heard. the view from the balcony is of the mobil home park with mountains in the background. while this is a negative the room itself was very comfortable and made us extend our stay to a second night. the pool area is nicely appointed and clean. Overall a good experience.", "Date": "January 6, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Reston, Virginia", "Title": "“Super hotel!!”", "Author": "VABlue", "ReviewID": "UR122630239", "Content": "Excellent rooms, great service (especially the bartender who made us feel at home), great location. Will make this the hotel of choice in Napa.", "Date": "January 5, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "High Wycombe", "Title": "“Wow”", "Author": "HighWycombeMIch", "ReviewID": "UR121832919", "Content": "What a fantastic place. We stayed in a one bedroom suite, which was certainly luxurious and spacious, with a fabulous bathroom. The pool and spa area were equally beautiful. It's extremely difficult to say anything else apart from WOW! A truly marvellous place.", "Date": "December 17, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "3", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Bonn", "Title": "“Rustic charm meets modern comfort”", "Author": "kjwardakee", "ReviewID": "UR121440147", "Content": "We checked out this morning, and my only regret is that we didn't stay longer. The grounds of Hotel Yountville are wonderful, and the rooms are beautifully decorated and perfectly appointed -- vaulted ceilings with exposed beams, stone-front fireplace, balcony, whirlpool tub, etc. The service, however, is this hotel's best asset. From the bellhop to the front desk to the servers at Hopper Creek Kitchen, we were assisted by friendly, helpful staff, offering turn-down service and the complimentary use of iPads. I only wish that we'd had time to take advantage of their bicycles, the spa, and inviting hot tub. We'll be back.", "Date": "December 5, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Irvine, California", "Title": "“Napa and Sonoma in November”", "Author": "einnoC", "ReviewID": "UR121145322", "Content": "We booked two rooms at this hotel: one was a bit larger since my daughter and her husband have a infant. Even though our room was slightly smaller it had a fireplace also with a separate walk- in closet area and lovely bathroom. I definitely would book our room again. The beds were extremely comfortable. There is an on site restaurant which served gourmet breakfasts. My only suggestion was to offer high chairs in the restaurant since cribs are offered in the rooms. This hotel is very convenient. We walked to Ad Hoc (Thomas Keller) and easily could have walked all through town. The weather was in the 50's and 60's during the day so we did not use the gas fireplace for very long. It puts out a lot of heat. There is also a ceiling fan and air conditioner if necessary. The pool area was gorgeous. We did not use the spa/massage facilities because they were very expensive. We had flown into SFO, visited several wineries and had lunch in Napa. Staying in Yountville was a convenient location for also seeing some wineries in Sonoma county. We only had four days in the area and wished for maybe two more. There was not enough time to check out the shops. I do not have photos to show the hotel but we were fortunate to see the changing of the leaves last week. They were brilliant reds and oranges.", "Date": "November 28, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "cherry hill", "Title": "“Really Great Renovations”", "Author": "kod", "ReviewID": "UR120832042", "Content": "This was our 2nd stay and the hotel was good 4 years ago but now is great in most ways. The outdoor pool and hot tub is new and in such a beautiful setting with wonderful landscaping and chairs. I pool was heated to at least 82 degrees and I swam laps every morning. Guests congregated in the hot tub with a surrounding fire pit every evening sipping their purchases and socializing. We had their basic room which was completely redone with a fireplace, walk in closet, and wonderful bathroom with a large jacuzzi tub and shower. The 4 poster king beds were so very comfortable with soft linens. The housekeepers, maintenance staff all had nice smiles and a friendly attitude, I found the front desk personnel to be friendly but you had to engage them first. My only suggestion is that it would have been helpful to have a dedicated concierge who was knowledgeable about the wineries and wines, as well as dinner suggestions.", "Date": "November 20, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "New York City, New York", "Title": "“Wish we booked more than one night”", "Author": "AmandaPK", "ReviewID": "UR120646616", "Content": "Had a wonderful overnight at Hotel Yountville. Can't complain at all. The rooms are very comfortable and well appointed. Staff is friendly and helpful, especially for Napa newcomers. The location was convenient. We also had a very memorable breakfast at the hotel restaurant. Highly recommended. All in all, it felt like a good deal for the area considering the range of accommodations and prices. If only we'd stayed longer...", "Date": "November 15, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "2.0", "Value": "1", "Sleep Quality": "2", "Rooms": "1", "Location": "3"}, "AuthorLocation": "Boston, Massachusetts, United States", "Title": "“Big Expensive Let Down....”", "Author": "Didi513", "ReviewID": "UR120598755", "Content": "Upon making our reservation over 4 months prior to our stay, i had done research and also spoke to hotel personnel. The room placement is KEY at this place. I requested an upstairs suite away with a balcony - even thought they did not guarantee it - they said it was so far in advance they would likely accomodate our request, and it was a 10 year anniversary trip. We arrived, after a long flight, and upon arrival, the hotel was lovely looking, lobby, etc. We were escorted to our room - which was a lower level room. The room itself was nice, however the outdoor space patio was about 20 feet from a trailer park with rusted tin roofs, and a dog walking trail that did not belong to the hotel in which people walked by each morning and allowed their dogs to relieve themselves practically on our patio. It was gross. No privacy was the least of our worries. We had to keep the blinds completely drawn the entire time because of the view and all the people and dogs walking by at all times of day - so it was like being in a dungeon. We told them on day one we wanted to move, and the folks at the front desk were nothing short of rude - they had nothing available, and said they may be able to move us the next day (we were there 4 nights) - after the 3rd day, when they had not even contacted us - we called them and they said, oh yes - we can move you upstairs, it was our last night at this point, and it was a much nicer point of view, but unfortunately too little too late. They never mentioned our anniversary which somewhat burned me - when you go to a Ritz or Four Seasons for a special occasion, they greet you with a message and usually have at least a little handwritten card in your room upon check in. These people were cold. AS for the price - nearly $550 a night - they have a nerve - with a view of the trailer park!!! Not one mention of a discount, nothing....see ya was what we got at the check out....I will say that the pool was beautiful, the food (we only had bfast) at the restaraunt was fabulous, but between the trailer park, noise from the freeway, and all the construction going on, NOT WORTH THE $$$$ - or the attitude!", "Date": "November 14, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Albany, NY", "Title": "“Excellent place to stay when visiting Napa”", "Author": "CaliCab", "ReviewID": "UR120377037", "Content": "You really can't go wrong with the location. You are right where you want to be when visiting Napa. The only thing I could knock about Hotel Yountville is that the rooms on the north side of the property back up to an unsightly neighborhood. So staying on the second floor gives you a view of trailers, and they get a view of you. But the rooms are large and nicely done, and you aren't spending a lot of time on your back porch anyway. I would recommend this place to anybody that can afford it. Bartender was great when having a nightcap after coming back from dinner each evening.", "Date": "November 9, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Toronto, Canada", "Title": "“\"Wow factor here for sure.....\"”", "Author": "tripsbeus", "ReviewID": "UR120353606", "Content": "We stayed at Hotel Yountville in October 2011 in a Premium Room. It was well worth the relatively high price. The rooms are very large, well decorated and well appointed. The grounds are pristine. Pool area, bar and outdoor fireplace are awesome. Bartender was friendly and knowledgeable. The restaurant for breakfast was very good. The location in Yountville is excellent. Walking distance to shopping and great restaurants. A good central location for the Napa experience. We will stay there again and will recommend to friends.", "Date": "November 8, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Sherwood, OR", "Title": "“Beyond Beautiful”", "Author": "RobinSherwood", "ReviewID": "UR120251680", "Content": "This is our 4th consecutive annual trip to Napa. The first stay at this hotel for us. It's remodeled and beautiful. Love the rooms, lobby, restaurant, pool and grounds. It's so close to all the wonderful restaurants and such in Yountville. Walk to everywhere - like Redd, Ad Hoc and so on. The staff here is professional, gracious and friendly, and super helpful. Our room was on the top floor. We had an end unit with a deck. The room was so nice. Breathtaking. Wonderful amenties and layout. A beautiful stone fireplace. Great bed and other furniture. A nice coffeemaker and refrigerator too. We had no neighbors the first few nights, so super quiet, except for some odd piped in music that was playing outside. It was a little bothersome on one evening/morning. We didn't notice the music the last night of our stay. However, by then we had neighbors next door including a crying baby. The walls must be thin. Regardless, I would stay here again. Love it.", "Date": "November 6, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "3", "Rooms": "5", "Location": "5"}, "AuthorLocation": "los angeles, ca", "Title": "“Charming and Chic”", "Author": "julias", "ReviewID": "UR119849695", "Content": "My husband and I stayed at Hotel Yountville in mid-October. It is a boutique hotel that suits the Yountville area. The rooms and bathrooms are very nicely appointed with good attention to detail. Our room had vaulted ceilings and a fireplace with a cozy sitting area. Pretty much, everything is well represented by the hotel website photo gallery. The breakfast restaurant is amazingly good and only available to hotel guests. The pancakes were delicious, and the mushroom omelet was also very good. The bar in the lobby and outdoor sitting area with the fire pit are very inviting. (Though the bartender could use a little more training.) The hotel location is ideal, as you can walk to great restaurants like Bottega and Bouchon. The only criticism is that the thermostat didn't regulate the room temperature that well, and the air conditioner was a little loud. Didn't try the pool and hot tub, but they also looked nice.", "Date": "October 29, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "3", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Scottsdale, AZ", "Title": "“Great Hotel”", "Author": "lnd85266", "ReviewID": "UR119795005", "Content": "This was a great hotel, the location is perfect. We thought the front desk and the service in general was wonderful, everyone was very nice.The rooms are nicely appointed and the bed was very comfortable. We had a room in building 9, which faces the trailer park, which just felt odd facing that but for how often we were in the room, it's fine. My two problems were that the air conditioning unit is loud, we also had a room on the bottom floor and could hear everything upstairs which is so irritating after a while, so we didn't get the best night sleep, and after 5 nights I was ready to leave. Overall I would go back but get a room upstairs.", "Date": "October 27, 2011"}, {"Ratings": {"Service": "2", "Cleanliness": "5", "Overall": "4.0", "Value": "3", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Glasgow", "Title": "“Beautiful rooms”", "Author": "Persephone20", "ReviewID": "UR119758885", "Content": "The accommodation and surroundings of the hotel are excellent. The room - even the most basic which is not a t all basic - is very luxurious, large and comfortable. The bathroom was also one of the best we have seen. There was a lovely patio with table and chairs - just right for enjoying some of that napa Valley wine. The pool area is also super and both the pool and jacuzzi are a really good size. The Hopper Creek restaurant is beautifully furnished and the breakfasts we had were excellent. The location of the hotel is great for experiencing all the restaurants in Yountville - they are all with in very easy walking distance. My big complaint about the hotel and the reason I haven't marked it excellent is the attitude of the staff especially at reception and in the restaurant. We found them arrogant. There were of course exceptions but on the whole they treated you with a coolness which was not pleasant.", "Date": "October 26, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Sleep Quality": "4", "Rooms": "2", "Location": "4"}, "AuthorLocation": "Beverly Hills, California", "Title": "“Lots of noises in a beautiful setting.”", "Author": "MakeMyBed", "ReviewID": "UR119336053", "Content": "We traveled with our friends through Napa and stayed at the Hotel Yountville for two nights . The town, the surroundings and the setting of the hotel are absolutely gorgeous. Our room was on the ground floor facing the back and facing a trailer park.We were awoken at 6.30 by the garbage truck coming by. Our friend's room was also on the ground floor , they had a bigger room with a cathedral ceiling and their room faced the front street, their room was noisy because of the road being so close by, our friends heard trucks all night. The walls of the rooms are VERY THIN, we could hear the TV from the room next to us and people walking above us. We could also hear the showers and the flushing toilets from all the neighbors. It seems that all the remodeled hotels nowadays have the louvre doors above the bath tub facing the bedroom, this hotel is no exception, there was no door for the bathroom plus they had mirrors everywhere so their is absolutely no privacy, good thing we have been married for a long time as I can not imagine being there on my first romantic date. The toilet door is more or less non existing, it is a sliding louvre door on rollers that doesn't close and let's out all the noise, not very romantic. The hotel does offer bikes for the guests and that was GREAT, we had a nice bike ride through town. The beds were comfortable, the prices are too high for this kind of a room. This is not a hotel I would go back to but I did love the town and will come back to Yountville.", "Date": "October 15, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "London", "Title": "“Pure luxury”", "Author": "andymanc10", "ReviewID": "UR119255965", "Content": "We stayed here for one night earlier this month and loved it. The room was huge, the spa was excellent and the staff were great. It is worth taking advantage of the free bikes and going for a cycle.", "Date": "October 13, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Los Angeles, California", "Title": "“Fantastic!”", "Author": "Debblues", "ReviewID": "UR119212916", "Content": "Loved the room, the service, the breakfast in the restaurant was delish. Try the \"Duck n Donuts\" it's a must have. The room was spacious with a very relaxing jet tub. icamt say anything wrong about my stay expect for...I didn't want to leave.", "Date": "October 12, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "London, United Kingdom", "Title": "“Beautiful hotel with great service”", "Author": "global_traveler28", "ReviewID": "UR119161354", "Content": "I recently stayed at the Hotel Yountville for 5 nights. The rooms were amazing and the staff is very helpful and accommodating. Only two drawbacks: 1) They don't have room service, however, the staff was willing to pick up food for us from a few places in town which was going above and beyond. 2) the bathroom was open and only had a sliding door for the toilet - you could hear everything. I had contacted the concierge before we got there and she booked all our restaurants, events, and wineries before we got there. She was extremely helpful and everything was perfect! I would recommend this hotel to everyone.", "Date": "October 10, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "California", "Title": "“Wonderful hotel”", "Author": "cherabeara", "ReviewID": "UR118488929", "Content": "Clean, spacious room with charming amenities i.e. fireplace, vaulted ceiling, large bathroom with oversize tub. The balcony is shaded by mature trees and although you're in the middle of town, you feel 100 miles away. The bed was so comfy, I never wanted to leave. Staff was friendly and welcoming. Looking forward to going back soon!", "Date": "September 23, 2011"}, {"Ratings": {"Service": "2", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Sleep Quality": "4", "Rooms": "2", "Location": "4"}, "AuthorLocation": "Wayne, NJ", "Title": "“THEIR WEBSITE IS BETTER”", "Author": "cjimci", "ReviewID": "UR118431040", "Content": "The problem with reading reviews is that they are subjective; based on the writer's personal experience and perceptions. With that in mind, I submit that the Hotel Yountville is not at all what it appears to be. I'm not sure what the other reviewers saw, but the hotel is located between a 55+ housing development and a trailer park. It faces the highway, which can be easily heard while at the pool. The hotel was recently renovated and I'm sure a great deal of money was invested. The furniture and finishes are very upscale. But, the room design is absolutely the most dysfunctional we have ever seen. Our closet was small and the clothes bar placed so low that we hung most of our clothes on the four poster bed and the thermostat. Handles were never installed on the two drawers of the only dresser in the room. To use it, we had to kneel on the floor and squeeze our hands under the bottom drawer and push it open from the back. I don't think that's how its done at the Ritz Carlton. It was easier to leave our clothes folded on the sofa and chairs. The bathroom door is on rollers and lacks a latch or lock, and it rolls open as soon as its closed. The staff, while friendly, seem detached and forgetful. We asked for hangers twice but received none. We asked about having handles installed on the dresser, but none were. At the end of our stay, I showed the desk manager how we had been living; dresses and suits hanging from the bed rails, shirts and shorts folded on the sofa; bedroom slippers holding doors closed and drawers open. I think he might have been concerned, but I can't be sure. I would think twice about staying here again - even though they had one of the nicest and most professional bartenders we have ever seen.", "Date": "September 21, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "4", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Mesa, Arizona", "Title": "“What a great hotel.”", "Author": "BRWCEW", "ReviewID": "UR117765772", "Content": "What a great experience. The room was fantastic and the service was great. The restaurant is only open for breakfast, but that was fantastic also. We are definitely going back.", "Date": "September 6, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "4.0", "Value": "5", "Service": "4"}, "AuthorLocation": "Washington, DC", "Title": "“Beautiful!”", "Author": "Jrankin", "ReviewID": "UR117474683", "Content": "This recently redone property gets it right in so many ways, with a great mix of aesthetics and comfort. The lobby is very soothing, and the outdoor fireplace lounge and pool areas are almost movie set-perfect. The restaurant was charming, and the breakfast we had there was great. The most pleasing surprise was our room. While not inexpensive, it was not one of the most pricey either, and it was really lovely. Our two double bed-room was on the ground floor with a patio facing the (dry in August) Hopper Creek with seating for 6 - a beautiful spot for AM coffee or a nightcap. Inside, we had high beamed ceilings, a rock fireplace and pleanty of space to spread out. I agree with the other reviewers, though, the service does not seem to be quite as sophisticated as the ambiance. Maybe they just need a few more people - the front desk seemed slightly understaffed, the pool service a bit slow, and the bar not open at times when you might think it should be. All in all, however, a great stay and I would definitely reccommend to even the most discerning traveller!", "Date": "August 30, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "London", "Title": "“An oasis in Napa, don't stay anywhere else”", "Author": "1ABCReviewer", "ReviewID": "UR117008525", "Content": "We were worried that being in the heart of yountville and close to the highway, this hotel would seem noisy or feel like being in the middle of a town - there was no need to worry! By the pool you could be anywhere, it's very relaxing, very stylish, and good food/drink service The rooms are great, go for one by the creek as they will be very quiet. Very clean, stylish, couldnt ask for more. No need to stay anywhere else in napa", "Date": "August 20, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "New York", "Title": "“Excellent Hotel”", "Author": "Newyorkenthusiastic", "ReviewID": "UR116818069", "Content": "Hotel Yountville is a top notch hotel. The rooms are exactly as they appear on the website; impeccably clean, decorated with high-end taste and the pool area is spectacular. We will definitely return. The staff is extremely professional and there to please. Upon arrival, you will receive a list of wineries that offer complimentary tastings to the guests of the hotel. The reception will make the appointment for you and in many instances the tasting is private. We enjoyed are stay tremendously and extended it an extra night. There are no cons except that breakfast is not included but coffee is served in the lobby every morning and each room comes equipped with a Krueger coffee maker.", "Date": "August 16, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "4", "Overall": "3.0", "Value": "1", "Service": "2"}, "AuthorLocation": "New Orleans, Louisiana", "Title": "“Fantastic resort but second class service”", "Author": "HRP06", "ReviewID": "UR116446504", "Content": "At the outset let me just say that the hotel itself is located in a wonderful location to explore Napa, and the renovations performed to the hotel were wonderful. The rooms were opulent, and the pool area was fantastic. It may just be my experience, but the level of service provided by the hotel staff is not up to scratch when you compare it to the quality of the hotel and the prices being charged. When you pay top dollar, you expect top dollar service - and unfortunately this is not what was received. The first hour spent at the hotel included - an exceptionally loud employee on the phone at reception which made it difficult to check-in, no bar staff at the pool for the first 30 minutes after we arrived such that we could not order a drink, when the drink was finally obtained it came in a scratched glass covered in water (it must have just been taken from the dishwasher).... and the list goes on. A whole host of little things just seemed to be missing or went wrong that just added up. Don't get me wrong, this hotel had amazing potential - but my experience was not anything above average.", "Date": "August 8, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "4.0", "Value": "4", "Service": "3"}, "AuthorLocation": "Connecticut", "Title": "“What a hidden oasis after days with beauty and fine wine”", "Author": "gowilton", "ReviewID": "UR116392959", "Content": "We arrived late in the afternoon and where quickly checked in and given room keys - upon opening the door what a lovely treat - room 806 on the second floor high ceilings and a nicely appointed room - a beautiful bed, gas fireplace and a bathroom that makes you want to stay in it for hours. The balcony was good - although not a great view on the creek side as the creek is dry this time of year. Fantastic shower and tub - enjoyed the room tremendously - have breakfast in the restaurant - perfect eggs and the breakfast risotto - yum! The pool is great as well. We were impressed. The only drawback - the blinds don't keep out the early morning sun - so if you are an early riser keep your eyes closed! Front desk service is fine - not over the top but loved the property so much didn't mind.", "Date": "August 7, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "4.0", "Value": "4", "Service": "4"}, "AuthorLocation": "Austin, Texas", "Title": "“Romantic and beautiful”", "Author": "Domenique8", "ReviewID": "UR115998609", "Content": "My husband and I just celebrated our anniversary at the Hotel Yountville and we had a wonderful experience. The room was spacious, beautifully decorated and clean. We especially loved the fireplace, spa tub and the romantic four poster bed. The property is so quiet and sophisticated, perfect for couples. I would not bring our child here. In fact, we only noticed couples during our four night stay. Great place for a romantic getaway. The pool and outdoor lounging area were quite lovely and we received excellent service from the hotel restaurant server while we were enjoying the double sized lounges arond the pool. The crushed glass fire element by the whirlpool was very inviting at dusk or right after dinner. The hotel's Hopper Creek restaurant was delicious for breakfast. The brioche French toast and strawberries with Saba were incredible. We had such a lovely time, that we are recommending the hotel to all of our friends who love the Napa Valley. And it is definitely the only place we will stay. We are already planning to come back in a few months for the crush! The couples experience spa treatment at the on site spa was wonderful and the spa staff were very welcoming, friendly and informative.", "Date": "July 29, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "4.0", "Value": "4", "Service": "3"}, "AuthorLocation": "Belfast", "Title": "“Beautiful property - nearly there”", "Author": "Welshjon", "ReviewID": "UR115958311", "Content": "Stayed at the hotel twice in a week - initial stay was for 3 nights then after 3 cold and foggy days in San Francisco headed back to Yountville for the last night of our holiday. We stayed in a Deluxe room (the hotel's standard room) and as per other reviews these are some of the best decorated rooms we have ever stayed in. However, on our first visit we were in the upstairs middle room of block 3 (room 306 or 307?) and you could hear every word, cough, sneeze etc from the rooms on either side. Unacceptable in a hotel like this - and very surprising - it was almost to the point where you felt sound was being amplified into the room - very strange. We didn't have neighbours for the 2nd and 3rd nights so the problem went away. Surprised this is not mentioned more on this site. We stayed mid week and the hotel was quite quiet, and staff were not particularly welcoming. Pool service was also poor and generally it made for quite a strange experience as the property itself is outstanding and unlike most lives up to the images on the website. They also don't have a licence for the bar in the lobby (although that wasn't mentioned to us) but are serving drinks at the pool. Not sure of timescales but the licence is applied for so it is only a matter of time. On the second visit we were in a different room - upstairs corner room in block 9 - fantastic room - including a balcony - oversized bathroom - without doubt the best room of our trip (which included the Wynn, Beverly Wilshire etc). We arrived at midday on Sunday, were checked in immediately, the hotel was busy, reception staff more on their game and there was an excellent and very hard working guy at the pool - 'Tom' - who provided outstanding service. If this had been our only experience of the hotel we would have had no criticisms and were very glad we returned for one more night. Pool area is beautiful - excellent, very comfortable double loungers (with individually adjustable mattresses) and when Tom is working, great service. Also good at night when the fire pit is on for a dip in the jacuzzi. Overall a great property, superbly remodelled with excellent attention to detail and top quality fixtures and fittings - just a few tweeks mainly to the staff (and sound proofing) would make it perfect. Yountville itself is a great little town - we ate in Mustards (ok but on the night we were there very hard to understand the hype - food very average), Bouchon (terrible service, staff couldn't cope, poor food - much better options available all around) and the Farmstead Restaurant at Long Meadow Ranch which was excellent.", "Date": "July 29, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "3", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "San Francisco", "Title": "“Astonishing Transformation of an Old Favorite”", "Author": "Pelhamgirl", "ReviewID": "UR115912707", "Content": "Yountville is a little treasure of a town near Napa which contains some of the best restaurants and hotels in America. Hotel Yountville, though a rustic, low-key favorite over the years, has been remodeled into a truly sophistocated, Tuscan-influenced resort. The greeting at the lobby, the efficient and personal transporation to your room, the restful rooms with every corner designed to please your eye, the stunning pool and helpful staff will make your visit worth every dollar! This is a place not for children or loud, badly-mannered families. This is a place for romance, relaxation, quiet, and the planning of your gastronomic adventures at Ad Hoc, Redd, The French Laundry, and the best of all of them, Bistro Jeanty. Do not miss this astonishing place.", "Date": "July 28, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Montreal, Canada", "Title": "“Just Marvelous”", "Author": "Nella50", "ReviewID": "UR115901854", "Content": "We went for my husbands 50 th birthday, and we had a great time. When we got to the hotel we were greeted by Martha the front desk clerk....she was great, very helpful and a fabulous personality. All I could say is, that it is a dream place.", "Date": "July 28, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "4.0", "Value": "4", "Service": "5"}, "AuthorLocation": "California", "Title": "“Wonderful Property, Staff Needs Some Warmth”", "Author": "Carmela W", "ReviewID": "UR115432651", "Content": "My husband and I just stayed at this Yountville property for 4 nights and had a really relaxing, wonderful experience. The property itself is very cozy and thanks to a renovation in 12/2010, the amenities are new and top of the line. We've stayed at properties in Yountville before and toured the newest Bardessono but felt Hotel Yountville was the the most cozy, spacious property with a beautiful pool and wonderful spa. Don't miss the unbelievable breakfast at Hopper Restaurant, the onsite dining facility. Each of our breakfasts had us coming back the next day for more...their croissants beat out Bouchon bakery! Our server Cesar was the highlight of the staff...he was warm, friendly, always accommodating, and looking for ways to make our stay comfortable! Our expectations were all met here but we do have one complaint and we're sorry that we didn't see a difference day to day as we spent 5 days on property. The front desk staff (with the exception of one gentleman) was absolutely cold, not receptive to our inquiries, and almost seemed bothered to welcome us. It was such a strange experience that we felt compelled to write about, hoping there will be changes in the future as it is a nice property.", "Date": "July 16, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Dallas, Texas", "Title": "“FABULOUS Hotel - Fabulous experience!”", "Author": "CHBTX", "ReviewID": "UR115136589", "Content": "We stayed at Hotel Yountville for 3 nights and we loved it! This will be our new Napa Valley (specifically Yountville) hotel of choice! Where do I begin. The hotel is beautiful, very clean and so charming. We were delighted to learn when we checked in that they upgraded our room. The service was great throughout the hotel - the staff was professional and very helpful. The room was beautiful and spotless. The bed was SO comfortable! The room included a very cool bathtub and fireplace - both added to the overall charm of the room. The pool area was so relaxing. The staff in the dining room was so nice and and provided great service. There are very cool relaxing places on the property where you can sit and enjoy a glass of wine or a cup of coffee - a very cool area near the lobby with an outdoor fireplace - so charming - and another great area near the pool. The hotel is conveniently located near all the GREAT restaurants in Yountville. If you are looking for a nice, quiet, relaxing getaway - look no further than Hotel Yountville.", "Date": "July 7, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "4", "Service": "5"}, "AuthorLocation": "Denver, Colorado", "Title": "“Great Hotel, great staff....”", "Author": "kwermuth", "ReviewID": "UR115054688", "Content": "I was planning a special trip for my boyfriend and connected with Melody Tandy at the Hotel Yountville who did a fabulous job in providing me assistance with a driver, wineries and some unique experiences to try while in Napa. She was informative, responsive and just a delight to work with. Once at the resort everyone we encountered was awesome and especially enjoyed Caesar in the restaurant who was awesome. The facilities are fantastic but the staff is what makes it so special. Truly a find in the Napa valley area.....", "Date": "July 5, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "", "Title": "“Perfect Anniversary Getaway!!!”", "Author": "Sanders1700", "ReviewID": "UR114839753", "Content": "Let me first start by stating that my husband and I travel quite a bit with our careers and when we travel for personal trips our expectations are extremely high. This was our first stay at Hotel Yountville and we will be back. The hotel and staff exceeded any and all expectations. The rooms are trendy, but charming with a warm, comfortable feeling. The amenities are 5 star and the restaurant, although small is fantastic. Our trip was a short weekend trip and I was able to coordinate and book all of our requested events with guest services. All of their recommendations were excellent and really made our trip memorable.", "Date": "June 28, 2011"}, {"Ratings": {"Cleanliness": "3", "Sleep Quality": "2", "Overall": "4.0", "Value": "3", "Service": "3"}, "AuthorLocation": "", "Title": "“Stylish & swanky”", "Author": "linlees", "ReviewID": "UR114695354", "Content": "New hotel, great location in yountville. Some road noise as close to freeway, also blinds in room let sun through for an early morning call! Other than that nice hotel, great breakfast!", "Date": "June 24, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "4", "Overall": "5.0", "Value": "4", "Service": "5"}, "AuthorLocation": "Newport Beach, California", "Title": "“Loved the rooms, will be back.”", "Author": "DeluxeTraveler", "ReviewID": "UR114432369", "Content": "We had a lovely double queen room. It was very large, comfortable for our family of three, and beautifully decorated. The room was newly redone and very clean. I think next time we may try and request a room that overlooks Hopper Creek. We did not have a chance to eat at the restaurant. We loved the location, with it being close to everything in the small town of Yountville. Very close to a small market to buy waters and snacks. Melody at the front desk was very helpful and welcoming. Our new favorite place to stay while visiting Napa Valley. Will definitely stay again.", "Date": "June 19, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Fort Wayne, Indiana", "Title": "“After much research...great choice!”", "Author": "10SmomOf3", "ReviewID": "UR113945915", "Content": "My husband and I stayed at Hotel Yountville in May. We loved our stay! The rooms are large and very chic. There is an outdoor sitting area to enjoy your days purchase of wine. I was able to utilize the spa. I had a 90 minute massage that was heavenly. You have to eat at Hopper Creek Kitchen! Being a foodie, it was beyond my expectations. The one and only negative would be that I am a VERY fussy sleeper and was able to hear people talking next door. Other than that, it was very quiet. We were in the back along the river. I would come back and stay here next time in a heartbeat!", "Date": "June 16, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "4", "Service": "5"}, "AuthorLocation": "Chicago, Illinois", "Title": "“Highly recommend this hotel!”", "Author": "SusanH98", "ReviewID": "UR113206518", "Content": "My husband and I stayed at the Hotel Yountville for three nights. I cannot say enough good things about it! The location is excellent--close walking distance to all the great restaurants and shops in downtown Yountville. We were booked in a regular king room, which was beautiful, but were quickly upgraded to a premium suite due to a dog barking in the next room non-stop. (They do not allow pets now, but our hotel neighbors had made their reservation with pet before the change.) Needless to say, we were thrilled with the new premium suite as well as the prompt service in getting us to a new (quieter!) room. We ate at the Hopper Creek Kitchen one morning for breakfast, and it was great. During our visit it was too cool to sit at the pool, but it is super nice! I am already dreaming of going back to Napa....mainly for the hotel, not the wine! :)", "Date": "June 13, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "NYC", "Title": "“excellent yountville resort”", "Author": "RexKite", "ReviewID": "UR112707267", "Content": "We went from calistoga to yountville, great change of environment, hotel yountville was PERFECT. Great large rooms, awesome chic look/feel, quick walk to all downtown restaurants! Bikes were high quality - ride north past town - into vineyards and delightful views. thanks!", "Date": "June 11, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Yountville, California", "Title": "“All around fabulous hotel, posh but laid back”", "Author": "Ovansomeren", "ReviewID": "UR112031927", "Content": "We found the hotel online, the pictures were accurate. Underwent a recent renovation. We stayed in a king suite, private balcony on second floor. Spacious, decorated to the nines. Nothing to complain about. Great location in downtown Yountville just steps away from adhoc restaurant. pool and hot tub are open late, great romantic ambiance a fire next to hot tub. Stayed on a Monday night, the place was very quiet, and we were given a complimentary upgrade. A+ for friendly service, great lounge area great location and great accommodations. We didn't use the spa or eat at their restaurant, but the spa , menu had a great selection of services. Great place for a couples get away, etc. We will definitely stay here again!!", "Date": "June 7, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "4.0", "Value": "4", "Service": "4"}, "AuthorLocation": "San Clemente, California", "Title": "“Good hotel and spa.”", "Author": "N6812T", "ReviewID": "UR110827481", "Content": "This is the old Yountville Inn, but totally redone. The website photos are actually accurate in depicting what to expect. The spa was great, they did a good job. Hotel is very nice, particularly at the Tablet rate of 375. It'll go higher very soon, I'm sure. Location is super. Parking is very convenient, which is good given the boxes and boxes of wine one tends to carry to the room at the end of each day. Very nice property, rooms, design, the whole deal. The only downer was that they don't have their liquor license yet. Not that I care, being in wine country it's easy enough to bring your own. But I would have liked to have known that sooner. We got to the pool before our spa appointments, and thought \"cocktail?\" Nope. No dice. But that's not much of a condemnation.", "Date": "May 31, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Kissimmee, Florida", "Title": "“Amazing Hotel, Amazing Staff, Amazing Location!!!”", "Author": "CineBrent", "ReviewID": "UR109893505", "Content": "My wife and I recently visited the Hotel Yountville for our honeymoon. It was our first trip to wine country so we went with no idea of where things were in Napa. We had booked at a different hotel but I switched to Hotel Yountville having seen that most of the restaurants we wanted to have dinner at were within walking distance. This hotel was the highlight of our trip! We hope the rates stay reasonable, unlike the nearby hotels, so we can visit again soon! We had a premium room with a king bed and a nice size tub in the middle of the room (might seem odd at first, but it will grow on you quickly!). We found ourselves spending most nights inside with the fireplace on, watching a movie and drinking a bottle of wine. We also spent one night out at the fire pit near the pool. We did breakfast two times at the Hooper Creek Kitchen. It was the best breakfast we have ever had! We did the seasonal tasting menu and it was all tasty! The duck and doughnuts were very good as was the poached egg and french toast soufflé. The second time we asked them to bring the food to our room, they did not have room service at the time of our trip, but they were happy to accommodate us and brought our breakfast over in a nice basket. They went out of their way to make sure we had a great breakfast experience. The entire hotel staff is very friendly and eager to help! One staff member, Ephram, helped us on a few occasions and represented the hotel very well. The hotel is also partnered with a few local wineries. We took advantage of their partnership with Mondavi. The front desk was happy to book the tour and tasting for us and provided us with suggestions for other wineries in the area. A great tip for a quick, cheap lunch, go to the Yountville Deli, shares a parking lot with Bistro Jeanty (also amazing!). The sandwiches are better than Oakville Grocery and half the price!", "Date": "May 26, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Los Angeles, California", "Title": "“Beautiful and thoughtful”", "Author": "judicioustravels", "ReviewID": "UR106422901", "Content": "This was a special trip for my family and I wanted to find an equally special place to stay while in Napa. The search was exhausting and we finally settled on this hotel. THE BEST DECISION WE MADE! It's true that one person can make all the difference and for us, it was the hotel's \"Melodie\" from the front desk staff. It was like being greeted by family on our arrival and knowing it was a big trip for my parents, she went out of her way for them. It made our stay so warm and special. I wish every hotel had someone like her! In addition, the rooms are beautiful and scream \"vacation!\" You'll also want to enjoy the relaxing and stylish ambiance in the lobby, outside patio and pool. Breakfast room is lovely and the food is delicious. The hotel has thought of everything. While there is some light final touches being done on the hotel and it may be reflected in the price (since we thought we had a steal comparably to what we were seeing for similar prices in the area), it's hardly noticeable. Hotel management has thought of everything. This is a gem and I am already planning our next trip!", "Date": "May 1, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Aventura, flo", "Title": "“Great place to stay while in napa”", "Author": "SophieandGregg", "ReviewID": "UR103639544", "Content": "The Hotel was very charming and the staff super friendly and helpful. Our room was big and everything was 5 star quality. We loved the decor bedding and design of our room. The restaurant was amazing, best breakfast. So many details and amazing service. You can walk to anywhere in town from this hotel. We highly recommend it.", "Date": "April 11, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Arlington, VA", "Title": "“Good stay...”", "Author": "Zeebs3", "ReviewID": "UR102470659", "Content": "Recently stayed at this Hotel for a long weekend in March. Booked back in January and received a great rate compared to the other Hotels in Yountville. Check in was easy, our room was very nice, and the grounds are well manicured. The Hotel is going through a massive remodeling effort (was not aware of this until our arrival) and it's apparent some kinks are still being worked out. For example, the Hotel does not yet sell wine/alcohol, we attempted to purchase room service at 9:30pm and that was not available, most hotels offer a free breakfast - this is not the case here. Again, most of these minor concerns will probably be worked out over the next few weeks/months but it would have been nice to know prior to our stay. Overall, good experience - great location, can only get better!", "Date": "April 1, 2011"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "San Diego, California", "Title": "“Beautiful Hotel”", "Author": "TravelKell", "ReviewID": "UR96995521", "Content": "We stayed here for 2 nights in February while in town wine tasting. We researched SO many hotels throughout Napa and finally decided on Hotel Yountville. The Hotel was Beautiful. They are in still remodeling some of it but I never heard any noise from any of the work being done. We were in a brand new room that had only been open for a month. The room was huge with a beautiful fireplace and patio. The bathroom was also huge! I loved the shower!!! It was a very clean hotel in a great location Overall a great stay and we are already planning our trip back!", "Date": "February 17, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "3", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Staffordshire", "Title": "“Newly refurbished and looking good”", "Author": "eccysteve", "ReviewID": "UR94871512", "Content": "The builders were still in when we stayed, transforming this former \"inn\" into a luxury spa hotel. The new rooms are excellent - smartly kitted out and very comfortable and the new restaurant is good if pricey (we paid almost USD 50 for breakfast for 2). Beware if given a second floor room and you have a heavy suitcase, as there are no lifts, due to the motel like layout. Staff are slightly unhelpful and distant and the full room rate is expensive - however, if you can book at a good discount, as we did, it's a great place to stay. Well located for some of the best wineries in Napa and Yountville itself is a bustling upmarket, somewhat touristy town with some great places to eat and drink.", "Date": "January 29, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Wyckoff, New Jersey", "Title": "“Beautiful relaxing place”", "Author": "rrapport", "ReviewID": "UR93460691", "Content": "The hotel seems to be in the final stages of renovation and has tremendous potential. It was a very quiet early January weekend and there were very few guests. Our room was large, but cozy, with a vaulted ceiling, fireplace and jacuzzi tub in the bedroom. The decor was beautiful. The bathroom was also large. We got the feeling that we were the first guests to use the room after renovations. Everything was impeccable. The spa was peaceful and relaxing. The hotel was operating in a soft opening so the rates were a little more reasonable than the advertised standard rates. I'd have to say we saw the place in what was likely its worst possible light - overcast damp, cool and foggy weather, few guests and landscaping an d outdoor atrium still a work in process yet we still enjoyed it and will return. We didn't eat at the hotel restaurant - there are too many good restaurants in the area - but the complimentary coffee and fresh chocolate croissants available in the lovely lobby at 6:00 am were a treat.", "Date": "January 17, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "South Hamilton, Massachusetts", "Title": "“Really beautiful hotel with fantastic food”", "Author": "Sportsgirl59", "ReviewID": "UR91627736", "Content": "Still under construction, but the staff was very accomodating", "Date": "January 3, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Irvine", "Title": "“This is the place to stay for all Napa visits”", "Author": "mjadse", "ReviewID": "UR89199028", "Content": "Although the Hotel Yountville (they changed the name from Yountville Inn on December 1) was still finishing up some of the details from a renovation project, I do not hesitate to give this hotel top ratings. If anyone complains about this hotel, especially the service, they are just not paying attention. From the moment we arrived, we were treated like highly respected family. Peter took care of us and all of our requests. He and other staff members went out of their way to make our stay memorable and fantastic. We stayed in one of the renovated rooms which was just beautiful. It has modern fixtures set in an old world environment including a beautiful stone fireplace. The appliances were chrome and contemporary and the furniture held the room together with a traditional charm. I loved the plush towels and soft plush rug when stepping out of the shower. They provide the high quality Gilchrist & Soames hair, skin, and body products in the bathrooms. I was pleasantly surprised at how quiet and peaceful it was and I slept well in the luxurious four-poster bed. I don't know what kind of thermostat system they use, but I never heard a fan or heater yet it remained a perfect temperature in our room. The new lobby furniture was just installed the day before we arrived and you can tell the interior designer is paying a lot of attention to detail. The furniture and decor looks very classy but also very comfortable-looking and inviting. It lives up to the phrase casual elegance. We will definitely stay at the Yountville Inn again. The location is perfect for walking to great restaurants (we went to French Laundry and Bottega Ristorante this trip), cute shops, and even wine tasting nearby. I look forward to seeing the completion of the spa and pool.", "Date": "December 6, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "3", "Overall": "2.0", "Value": "1", "Sleep Quality": "3", "Rooms": "2", "Location": "5"}, "AuthorLocation": "Lafayette, Louisiana", "Title": "“Not worth the price”", "Author": "MEDCO7", "ReviewID": "UR87361518", "Content": "We stayed at the Yountville Inn in October, 2010 and were very disappointed. The property is going through a big renovation but we were not compensated at all for the inconvenience this caused. Upon returning from the trip, several in our group discovered that we were double charged on our credit cards! It has been difficult to get the problem rectified since they do not call us back.", "Date": "November 17, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Knoxville, Tennessee", "Title": "“Relaxing”", "Author": "persiantabib", "ReviewID": "UR83229068", "Content": "This is one of the best relaxing Inn around the Napa valley. great place to stay , comfortable room. great service. great back yard with relaxing sitting outside area. walking distance to Major Yountville , downtwon restaurants and quite. This is a place to rest.", "Date": "October 12, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "San Francisco, California", "Title": "“Loved it! Great location and great accomodations!”", "Author": "FairReviewerOnTheGo", "ReviewID": "UR78137210", "Content": "We stayed here in November 2009 and wanted to be back again now, in August or September 2010, but it looks like they are going through renovations and the property is closed temporarily.... unfortunately for us. We like to stay in Yountville. We consider this town to be the best location in Napa Valley. The restaurant selection is amazing and includes some of the top restaurants in California and the Country (French Laundry, Bouchon, Bottega, etc). The town is also very cute, colorful and green. Just what we want when in wine country. The Yountville Inn is right in the middle of it all, a few steps from everything in town and some of the best wineries in the valley. We stayed in an upgraded room (I believe the Deluxe) and comparing it to the pictures posted on this site, I believe we got one of the best rooms. The upgrade was definitely worth the extra money: corner unit on the second floor, extremely spacious, with king size bed, high wood-beam vaulted ceilings, very nice wide gas fireplace, and very nice spacious bathroom. I don't think we had a patio, but it was a chilly time in November and I might have ignored it. The King bed was huge and very comfortable. The fireplace was very nice and cozy. I moved the bench in front of it so I could lay by the fire and warm up on a cold and wet day. The bathroom was also very nice, super clean, and roomy. Continental breakfast was also pretty good, in the main communal room with some tables, lots of couches, and a big fireplace. Overall, very private, quiet, romantic, and a very good value for the cost: around $200 per night in the fall. We loved the Yountville Inn and hope that the renovations will only make it better. We will definitely be back.", "Date": "September 3, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Washington", "Title": "“One of our Favorite Hotels”", "Author": "Diane38953", "ReviewID": "UR64220010", "Content": "This hotel is our favorite hotel not only in the Napa Valley, but just about anywhere else. The rooms are very spacious, quiet, and comfortable. The continental breakfast is excellent, too. We prefer staying in Yountville because you can walk to the best restaurants in the area and it is a convenient location to visit most wineries.", "Date": "May 15, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Southeast USA", "Title": "“Comfortable, convenient”", "Author": "RichardSoutheast", "ReviewID": "UR57880538", "Content": "Stayed three days in a king superior room. Room was large and clean with fireplace, sofa, and patio overlooking a stream. There was patio furnature and a table with wine glasses - all came in handy. Two sinks in the bath - just like home. Nice towels. Breakfast was simple but nicely done. My only complaint was that the walls seem thin - we could hear conversations in adjacent rooms - if you get loud neighbors, this would be a deal breaker. The location is downtown next to great restaurants (we particulalry liked Redd for dinner and the Bouchon Bakery for lunch), so we could walk - convenient after a few wine tastings. We tend to visit the smaller premium family wineries and the Inn supplied us a comp tasting card which was well received wherever we went and an upfront cost savings. While this Inn was not our first choice in Yountville, we were very happy with it and will return. No fitness center, but brisk walks through downtown and vineyards make up for it. Internet was free (yeah!) but a bit slow.", "Date": "March 6, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Colleyville, Texas", "Title": "“Very nice hotel with a great location”", "Author": "Colleyville_traveler", "ReviewID": "UR56103366", "Content": "We stayed here with a group for Valentine's Day weekend. We really enjoyed the hotel. The breakfast in the morning was not fancy but good. We enjoyed a wine tasting on Friday night in the lobby. We thought the hotel was very nice. My only complaint was that we could hear the people above us walking around. However, we will go back, as we enjoyed the hotel and the location. Also, they have discounts for tastings at various wineries, which can provide a pretty good savings.", "Date": "February 16, 2010"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "", "Title": "“Napa area retreat”", "Author": "AnneS3", "ReviewID": "UR55979888", "Content": "Amazing rooms with cathedral ceilings and fireplace. Private patio with lounge chairs and wine tasting right in the lobby! Felt like coming home.", "Date": "February 14, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Location": "4", "Rooms": "4"}, "AuthorLocation": "San Francisco, California", "Title": "“A great stay ruined by paper-thin walls and loud neighbors”", "Author": "lisaq42", "ReviewID": "UR54878161", "Content": "Our first impression of Yountville Inn was very good. The location was great- walking distance to great restaurants like Ad Hoc and Hurley's. The reception was nice, the grounds were pretty and we were able to check in early. The room (101) itself was large and comfortable- it had a patio overlooking a creek. The amenities were excellent- there were robes in the closet and very nice soaps and shampoos. The room came had a set of wine glasses and bottle opener, and Starbucks for the coffeemaker. The king sized bed was comfortable and there was a small sitting area with a couch. We were very impressed on the quality of the accomodations for the price ($179) and even discussed returning in the summer. We loved that there were no neighbors above us, just one room to the side. Great! Peace and quiet right? Wrong! We were awoken at 7:30am on Sunday morning by the people in the next room. At first, I thought they were right outside our door, maybe packing the car to leave, but soon I realized that the voices we heard were from the next room over. We could make out every word they said- every word! There seemed to be 3 adults staying in the room, up early, chatting away with the TV on. And then the baby started crying. And wouldn't stop. Who brings an infant to the wine country?? The noise didn't stop until 10am when they checked out. They sounded like they were in the room with us. They even responded to me when they heard me complaining about how loud they were- they said they \"didn't care\"! I was too exhausted and frustrated to bother calling the front desk to complain- not that there was much to be done. I've travelled extensively from hostels to Hiltons and everything in between and these were the thinnest walls I've ever experienced. That's why I rated the hotel highly (it looked great) but also said I wouldn't recommend it (the noise). The early wake up ruined our trip completely which is a shame because the hotel is lovely. We were so tired from the early wake up that we simply left, too exhausted to even go to reception. And we won't be back.", "Date": "January 31, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Colorado", "Title": "“Comfy and Predictable”", "Author": "davidandrose1", "ReviewID": "UR48180841", "Content": "We have stayed here 3 or 4 times previously, as we like walking to the many great restaurants in town. Their rates - if avoiding Friday or Saturday - are no different than staying in the Marriott or one of the other branded-chains closer to downtown Napa, and the hotel has some local charm, though construction for a large expansion take away from it a bit. Free breakfast, with pastries, fruit, bagels, hardboiled eggs, juice, cereals, yoghurt, are more than adequate, but we always end up walking to Bouchon bakery for some of the finest baked goods anywhere. Wifi is also free throughout the property. The rooms are comfortable, spacious and quiet, though the tvs are older and hard to see from the beds in some rooms, and the shower/tub setup is a little dark given how the surround is designed. We were told that the existing rooms will all be renovated once the expansion is complete in 2010. We'll continue to visit here during our trips to the Valley 1-2x a year, though we'll also continue exploring some of the other new hotels popping up around the region.", "Date": "October 31, 2009"}, {"Ratings": {"Service": "1", "Cleanliness": "3", "Overall": "3.0", "Value": "2", "Location": "5", "Rooms": "2"}, "AuthorLocation": "Madison,WI", "Title": "“Stuffy”", "Author": "KKHWINE", "ReviewID": "UR47049925", "Content": "My Husband and I have stayed at the Yountville Inn 3 times in 8 years and this time will be our last. Our stay and the service this time was very different than before. We arrived on a Thursday and departed on a Sunday. We have always stayed in a king superior prior but they were booked this time for Thursday/Friday. So we stayed in their Queen Superior for Thur/Fri and had reservations for a King Superior on Saturday. The QS was ok BUT the room was stuffed way off to the side next to construction with no windows and no screen on the patio so there was no air flow. Our friends stayed next to us in room 503 and had the same problem – couldn’t breathe. After a day of traveling and wine tours, I hopped into a bed that sank in the middle. When I returned to the front desk on Saturday to find out where our new room was moved to, I was told next to the one we were in. I said this wasn’t a king superior and had a reservation confirmation number to prove it. The lady at the front desk was nasty and unfriendly and most of all challenging and was insinuating I was a liar. I must say, I wasn’t any more pleasant since I had a confirmation letter in hand showing my reservation. They attempted to move us to a Queen Deluxe which is a huge down grade. All I have to say is this – Their inner rooms are nice – stay away from room numbers in the 500’s. They have King Superiors on the upper level which are nice and some of their rooms do have windows which is nice in the fall for sleeping. The provide 1 bottle of sparkling water and there isn’t any other water for purchase or a soda machine. They have really scaled down on their morning breakfast as well. They had bagels, yogurt, cereal and some not so good looking fruit. Needless to say, we walked across the street to the Villagio Inn (where we have stayed before and should have this time again) and was greeted with a free bottle of cold water and full breakfast buffet they serve to their guests. Would only recommend this hotel if they stayed in a King Superior OR Queen Superior not in room level 500", "Date": "October 16, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "4", "Location": "4", "Rooms": "3"}, "AuthorLocation": "san francisco", "Title": "“Reasonably priced in an expensive Town”", "Author": "julie5", "ReviewID": "UR46399035", "Content": "Lets face it, Napa is an expensive destination these days. Yes, you can go for the day from the bay area but to really enjoy the wine country you need to stay over a night or two (or three). We choose the Yountville hotel for its location and price. It has an acceptable breakfast but the real bonus was the complimentary tasting card for numerous popular wineries (most for 2 people) that will save you a bundle. Staff was curtious but limited in knowledge. We knew more than they did which was dissapointing.", "Date": "October 9, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "3", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Eugene, Oregon", "Title": "“Pleasant spot”", "Author": "fuzzybennuti", "ReviewID": "UR45351654", "Content": "We stayed for 3 nights in September at the Yountville Inn to celebrate a birthday. This was our first time staying here but would return. the Inn is charming and our room was spacious with high ceilings which keeps you from getting that caged feeling after a few days at an Inn or hotel. We had a private little patio with 2 chairs and a small table which we used every evening as it was quite warm during the day but very pleasant in the evening to sit out. The room was very clean, the towels were large and fluffy and the bathroom area was very large with a lot of place to stow your belongings. The water was nice and hot and the shower had adequate pressure, which isn't always the case at some hotels now. In the morning they provide a light breakfast of pastry, yogurt, etc. and the breakfast room is very large with the tables nicely spaced apart. The people on duty were all helpful and friendly. They are planning an expansion with more rooms and more services which will be very nice. Our only complaint is that the bed was not very comfortable, which will probably be remedied in the update they are planning.", "Date": "September 28, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Location": "4", "Rooms": "3"}, "AuthorLocation": "San Jose, California", "Title": "“Very good at current rate”", "Author": "lipsticktraces", "ReviewID": "UR39408311", "Content": "Stayed here with friends in what was listed as the \"Run of House\" rate/room. For one night at the current rate this was a good deal. We had a room with two queen beds, gas fire place, couch, small patio (off a dry creek), free parking, *slow*/easy to access wi-fi, and a nice breakfast (gourmet cheese/breads, instant oatmeal, tea/coffee, etc.). Construction noise started at 8am sharp -- which was not advertised until after we arrived. I would re-evaluate this stay in the following weeks as determined by the construction and current economy/local pricing. If you are only evaluating by convenience to local wineries/restaurants, this is a very good spot.", "Date": "September 1, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "West Palm Beach", "Title": "“Our Favorite Place to Stay in Napa”", "Author": "msa1164", "ReviewID": "UR39089308", "Content": "This was our 5th stay at Yountville Inn. It has an amazing charm and character. We always book a deluxe room - love the room size and bedding. It is pricy, but you get what you pay for. The morning buffet is simply the best we have encountered - breads, bagels, cheeses, fruit, etc. Being a Floridian, my wife loves the fireplace... in the winter... Each and every time, this place exceeds our expectations. It is highly recommended.", "Date": "August 28, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Location": "5", "Rooms": "4"}, "AuthorLocation": "calgary", "Title": "“Great Place”", "Author": "sharknes", "ReviewID": "UR36948536", "Content": "This is a great cozy place, just a couple minutes away from the great restaurants in Yountville. The staff is not overly outgoing or friendly but everything else was wonderful.", "Date": "August 7, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Location": "4", "Rooms": "4"}, "AuthorLocation": "California", "Title": "“One of my favorites”", "Author": "nikkiey", "ReviewID": "UR34580365", "Content": "I love the Yountville Inn--would happily stay here anytime in Napa. Especially wonderful if you book within their last minute rate specials--usually half price (around $150)...but would be great full price too. Huge rooms, the pool is perfect, small but intimate and quiet. Everything is nice without feeling fussy or pretentious. We stay here whenever in Napa and after staying at a few other spots, find this is the best. Plus the included breakfast is superb--delicious delicacies and pastries...yum!", "Date": "July 12, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Location": "4", "Rooms": "4"}, "AuthorLocation": "New York", "Title": "“Nice and great location”", "Author": "Maria35", "ReviewID": "UR33898182", "Content": "This was a great find for Napa Valley. We got a great price. The room was huge, comfortable, wireless worked. Complimentary breakfast really good. Wine tasting one night. Quiet and pleasant.", "Date": "July 4, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Boston, MA", "Title": "“Awesome and close to everything”", "Author": "visitor111Boston_MA", "ReviewID": "UR31903987", "Content": "The room we stayed in had our own private balcony and was fabulous. I normally am pretty picky with resort town inns, however, this place met all of my expectations and more. The location to all the best Yountville restaurants as well as the nearby wineries made our stay a very good one. I would highly recommend staying here.", "Date": "June 8, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "3.0", "Value": "2", "Location": "5", "Rooms": "3"}, "AuthorLocation": "Belgium", "Title": "“Very relaxing, couple of small niggles”", "Author": "Adambe", "ReviewID": "UR30663188", "Content": "We recently spent 3 nights at the Yountville Inn, like many others I found it to be rather expensive for what was on offer and the room we had was very dark, despite blue skies and sunshine for the duration of our stay. We had a patio room that looked on to a small stream heavily shaded by trees and foliage. Our patio was not particularly private as a pathway ran longside it, but this was no big deal. The morning breakfast and complimentary tea, coffee and biscuits throughout the day were perfect for starting off the day or as refreshments whilst bathing by the pool. The rooms are very spacious and clean and well equipped with wine glasses and complimentary bottled water. A couple of minor points that I think could be rectified considering the cost of the Inn. 1) Water in the rooms is still heated by small electric tanks, these take a while to reheat after a shower/bath so make sure you allow time to allow the tank to refill if there is more than one of you getting ready for a day/night out. 2) The hotel offers wireless internet access throughout, but there is no pc with internet access for guests to use, this proved a bit of a pain as we wanted to check in for our onward flight online but were unable to do so. It doesn't cost much to buy a laptop for guest use and with the prices they charge, I think it they should make the provision. Overall, a great stay, the staff were pleasant, yet low key, on one occassion when we were locked out of our bathroom at 11:30pm they were very quick at resolving the problem.", "Date": "May 24, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "3", "Location": "5", "Rooms": "4"}, "AuthorLocation": "VA", "Title": "“Great, except for one thing...”", "Author": "LttlRed", "ReviewID": "UR30116660", "Content": "Lovely rooms, great service, located centrally in a great little town. Only one compliant - the walls are paper thin and you could hear everything. Perfect stay except for that. One way to remedy - ensure you do not have a room above you.", "Date": "May 16, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Philadelphia, Pennsylvania", "Title": "“Wine Tour”", "Author": "g0ne-walkab0ut", "ReviewID": "UR27764694", "Content": "I was in Napa Valley for a tour of smaller vineyards, & didn't want to stay in Napa(town). The true benefit of Yountville is the abundancy of excellent restaurants. The closest restaurant is about 1/2 a block away (Ad Hoc - by Thomas Keller). The room was much larger then I expected. It did take me some time to find/figure out the HVAC, for such a large room I didn't expect it to be a wall unit. The only odd thing, was the room cleaning - in other hotels I've stayed in, if a sock or such is not in a pile/put away the staff puts it away; here though it was left where I had left it. I got the cheapest rate directly at the hotel website. The hotel is about 1 1/4 hours north of Marin County.", "Date": "April 10, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "southern california", "Title": "“Really nice, cosy hotel room”", "Author": "cathjhdunn", "ReviewID": "UR26479818", "Content": "We were very happy with this hotel. Nice rooms, great heated swimming pool. Good continental breakfast. Wine tasting discounts for Napa wineries. Loved our experience at Jessup one mile up the road. Some of the best restaurants in the countyr on your back doorstep.", "Date": "March 20, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Boston, MA", "Title": "“Great hotel in a fantastic location”", "Author": "Kennedy87", "ReviewID": "UR26086218", "Content": "This was our first trip to the Napa Valley and we loved it. The Yountville Inn was the perfect starting point for each day. The town is adorable and the hotel was great. We had a room with a king bed and vaulted ceilings. The rooms were clean, spacious and comfortable. The fireplace was fantastic at night, as it was chilly outside. They had a great continental breakfast with a good selection of pastries, breads, fruit, yogurt, juices and coffee. If you want a full, hot breakfast you'll have to go elsewhere, but if you just need something to get you going for the day this is perfect. We visited other towns in the Napa Valley (Napa, St. Helena etc.) and both agreed that we were so happy to be staying in Yountville. We walked to dinner each night and felt very safe. Who needs room service when you're within walking distance of such great restaurants? When we vacation in the Napa Valley again we will definitely stay at the Yountville Inn.", "Date": "March 12, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "3.0", "Value": "3", "Location": "4", "Rooms": "4"}, "AuthorLocation": "london", "Title": "“nice place but no wow factor”", "Author": "Mark S", "ReviewID": "UR25724175", "Content": "Stayed for one night here. Good, spacious, clean rooms. Limited on-site facilities and no information in room as to what facilities were available. Breakfast was disappointing with a limited selection of not so fresh pastries, cereal and orange juice. No room service so you need to go to one of the local, pricey restaurants to eat. Seems to be frequented by an older clientele.", "Date": "March 6, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Florida", "Title": "“Loved the ambiance”", "Author": "FloridaVic", "ReviewID": "UR24474707", "Content": "We cannot say enough good things about this place. Not only are the rooms beautiful, but all of the personnel there make you feel so special. They are there to help you in any way they can. We will CERTAINLY be back!", "Date": "February 11, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Key Largo, Florida", "Title": "“Best Lodging in Napa”", "Author": "LCHRH", "ReviewID": "UR24357856", "Content": "After 4 delightful stays, you won't be sorry for a stay at the Yountville Inn. They are in the MOST prime location in the Valley, the accommodations are beautiful (wine country toiletries, beautiful bedding, well-appointed bathrooms, a lovely pool) and adequate. The location is as good as it gets in wine country. I really hate to point more people in their direction!!! To be walking distance from Bouchon (my favorite restaurant in the country be it Vegas or Wine County for frites and oysters!!) or the French Laundry or our new love, Redd, you are in for a treat! We love ending a day of wine tasting on the patio at Chandon and then unwinding by the pool at the Yountville Inn. We've seen many a celebrity at the contintental breakfast (which also can't be beaten) at the Inn. Join many a wine club in the area and get a discount on your lodging. It's a home away from home!", "Date": "February 8, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Check in / front desk": "4", "Overall": "4.0", "Value": "4", "Rooms": "5", "Location": "3"}, "AuthorLocation": "Oregon", "Title": "“Picky traveler very pleased!”", "Author": "TwoMsOregon", "ReviewID": "UR23507554", "Content": "We booked a 40th b-day getaway and our stay at the Yountville Inn was really excellent. I'm a hotel \"snob\" and really appreciate a nice place to stay. Our room was vaulted and very quiet, it had a nice private patio, and the breakfast pastries were top notch from a fabulous local bakery (not your typical greasy type of pastries). The room off the front desk was delightful in the evening offering wine tastings and in the morning served as a great spot to have coffee/tea, cereals or pastries and read the paper. The only complaint was that this room is a bit small and it was tough trying to find a place to sit at times. I think they need more seating out on the patio or by their pool just outside. The front desk staff was always pleasant, rooms very clean and parking was easy. We are booking a return for this May.", "Date": "January 13, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Business service (e.g., internet access)": "3", "Check in / front desk": "4", "Overall": "4.0", "Value": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Redwood City, CA", "Title": "“Another enjoyable stay!”", "Author": "kht2006", "ReviewID": "UR23228544", "Content": "We go to Napa wine country each Fall to pick-up our standing order of wine an do some wine-tasting. This is our second stay at the Yountville Inn. We went in Sept 2008 and stayed one Saturday night. I like it because it's in Yountville (small town, excellent restaurants, easy access to Silverado Trail and Highway 29). Also, rooms at the Yountville Inn are spacious as are the bathrooms. The breakfasts are tasty with plenty of variety - think continental \"plus\"... baked goods from the Bouchon Bakery, yogurt, cereals (hot and cold), and fresh fruit. We took a quick dip in the pool before dinner. There were plenty of chairs to lounge by the pool. It was very relaxing. Reservations were easy at the Yountville Inn's website. We requested two rooms next to each other, which we got with no problem. This time we traveled with my parents and my two children (4 y.o. and 10 months). I found the Inn to be child-friendly. Service was friendly. I will definitely return for future visits!", "Date": "January 3, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Leawood, Kansas", "Title": "“Great service, very comfortable”", "Author": "SJRinKS", "ReviewID": "UR20879961", "Content": "Wow! What a great place to stay when visiting wine country!! Rooms were very comfortable - lots of accessible outlets for curling irons, hair dryers, & re-charging phones, ipods, etc. Beds and pillows were also very comfortable (extra pillows in the closet even). Iron & ironing board in room. Small fridge & coffee maker in room. Gas fireplace that turned on with a flick of a switch. Bathroom was GREAT!!! Toilet was in its own little separate room. Shower had a light fixture AND fan inside the shower so the steam stayed inside the shower -- so the mirror stayed fog-free and the bathroom wasn't humid after showering. Front desk was efficient, friendly, & helpful. Upon check-in, we were given an envelope full of complimentary tastings and/or discounts at several wineries. A continental breakfast was provided each morning -- Starbucks coffee, hot tea, fresh OJ & grapefruit juice, cereal, muffins/bagels/pastries, fresh fruit, yogurt, & hard boiled eggs. Every night the lobby also had a complimentary wine tasting from a different vinyard. Pool was heated & had a separate jacuzzi. Comfy lounges. Towels provided at the pool. I would definitely stay here again.", "Date": "October 14, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Colorado", "Title": "“Yountville Inn Hit the Spot”", "Author": "sagemum", "ReviewID": "UR20357983", "Content": "We stayed at the Yountville Inn as part of a 10-year anniversary trip to Napa. I chose the hotel based on TripAdvisor reviews and the hotel's site, as well as price relative to other properties in Yountville. We couldn't have been happier with our stay. The front desk clerk who greeted us was very friendly and respected my request for a quiet room, which we got. The room was very large and comfortable, well furnished with a huge bathroom, very nice bath products, feather pillows and comfy sheets and blankets. We stayed in a superior room, which I recommend if you can swing it for both the vaulted ceiling and the patio. We didn't need the fireplace, but it's a great touch in colder times. Thoughtful touches include plastic glasses to use by the pool, lovely robes and free wireless Internet access. We were amazed that even though the Inn was full while we were there, it was extremely quiet and peaceful; I slept in late despite the fact that the rooms next to ours were being cleaned--I simply didn't hear the cleaning people at all, which is so great. The staff was always courteous and friendly but never intrusive. As others have said, the breakfast from Bouchon bakery is delicious, and coffee and tea are available all day, along with cookies (also from Bouchon) in the afternoon. There was a free wine tasting during our stay, too. We spent the hour or so before dinner on the pool lounges, which are comfy and well shaded, and the pool itself is the perfect temperature. Best of all: Although we had booked the room in advance, I saw a Web special 2 days before our arrival, and the hotel honored that lower rate! We will definitely stay here again!", "Date": "September 25, 2008"}, {"Ratings": {"Service": "2", "Cleanliness": "4", "Business service (e.g., internet access)": "2", "Check in / front desk": "3", "Overall": "3.0", "Value": "2", "Rooms": "3", "Location": "3"}, "AuthorLocation": "virginia", "Title": "“Expensive and average at best”", "Author": "em5555", "ReviewID": "UR19438894", "Content": "We stayed here for a wedding and while the hotel was more than adequate, it was nothing special for what we were paying. First, we were also put in the 'fishbowl\" room described by another reviewer ie a room on the corner of the parking lot and a walkway with beautiful big windows where we could watch people go to breakfast and drive around the parking lot. Not quite what we had in mind. The room itself was very large but the furnishings were basic and there was no artwork on the wall at all - fine if we had been paying less money but nothing great. Before leaving the room for the wedding, we searched for a safe to put our valuables in - finding none, we called the front desk to ask where is was located. We were informed that not only was there no safe in the room, there was no safe in the entire hotel. This was huge disadvantage for us as we had flown in from overseas and had passports which we could not risk leaving in a room overlooking the parking lot. The inn also advertised a \"lovely buffet breakfast.\" The first morning, we went over to the main building with visions of omelets in our mind only to find bagels, coffee, juice and yogurt - nothing hot. While the food was adequate (the baked goods were very good), this was not a buffet - it could accurately be called a \"lovely continental breakfast.\" That morning as we were leaving our room we saw housekeeping and said our room would be available for the next few hours for cleaning but after that we would all be in the room getting ready for the wedding - they said they would take care of it. When we returned to our room at almost 3 pm, the room had not been touched. When we called the front desk, they were unapologetic and said that housekeeping had until 4 pm to clean - when we explained that we would be showering until 4 pm and had asked housekeeping to please clean earlier, they were unapologetic and borderline rude - it was almost as if they felt they had nothing to do with housekeeping. While the town and wedding were lovely, I would not stay at the Yountville Inn again.", "Date": "August 27, 2008"}, {"Ratings": {"Cleanliness": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "3", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Missouri", "Title": "“Wonderful stay at the Yountville Inn”", "Author": "Sherry022", "ReviewID": "UR18933169", "Content": "My stay at the Yountville Inn was delightful. The room was huge and very attractively decorated. The bed and sofa were comfortable, and the room was bright with two large windows. I thought it was a lovely place to stay. The room and bathroom were spotlessly clean and overall, I could not have asked for a nicer stay. The breakfast buffet was very attractively presented with breads and cheeses and delicious pastries from Bouchon. It was a real treat. The lounge area tables or poolside tables were also a pleasant area to linger over breakfast. The grounds were beautiful, and the front desk staff were gracious and helpful. Yountville is a great place to stay with wonderful restaurants and shops within easy walking distance. I'm sure that I will return to the Yountville Inn.", "Date": "August 13, 2008"}, {"Ratings": {"Service": "2", "Cleanliness": "5", "Check in / front desk": "2", "Overall": "4.0", "Value": "3", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Philadelphia, Pennsylvania", "Title": "“Great place to stay but poor service”", "Author": "Christine15", "ReviewID": "UR16292082", "Content": "We visited Yountville for a friend's wedding. The town itself is great!! So many wonderful restaurants- we ate very well while there. I would recommend this as a perfect place to see when in wine country. Let's start with the good things- the Inn is well kept, the rooms are large with spacious bathrooms, great pool, walking distance to many restaurants, clean, awesome continental breakfast with Bouchon pastries, coffee and tea available all day, and Gilchrist and Soames bath products that smell great. The bad- I requested a specific room in January and also called to confirm the week before. I was told that the room was available, but upon check in we were given a different room (and got some attitude too- \"I don't know who told you you could have that room\" and so on.) For the price of the rooms, I expect to be treated very well, this place should bend over backwards to please their customers, but it was poor service. (In reading past posts it seems to be a theme!) There are MANY great hotels in Yountville. If I go back I will likely try a different one. They also overcharged us when we checked out, luckily we caught it and they did refund the difference quickly- just check your receipts! All in all a great time, I would only stay there again if there were no other rooms available in Yountville because of the service. The hotel itself is great.", "Date": "May 21, 2008"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Business service (e.g., internet access)": "3", "Check in / front desk": "3", "Overall": "2.0", "Value": "2", "Rooms": "2", "Location": "5"}, "AuthorLocation": "Chicago, IL", "Title": "“Ok experience but avoid room #201”", "Author": "ArwenUndomiel", "ReviewID": "UR15974101", "Content": "The property is reasonably nice, but I had the unfortunate experience of being placed in room #201, which has a huge picture window opening up to the drive in area off the lobby, plus another window on a main walkway. It was like being in a fishbowl. If I wanted any privacy, I had to keep the heavy drapes closed. Plus I heard the garbage truck drive past my window at 5:00 am Saturday morning. The room itself was ok, but the lighting in the bathroom shower was very dark. When you're paying over $400 for a room, these issues are irksome. If you stay at the Yountville Inn, I recommend asking for a porch room vs. a high ceiling room (#201 had a high ceiling) - or ask for a room in the back of the hotel. The hotel's location is good since it is within walking distance to all the restaurants in downtown Yountville.", "Date": "May 12, 2008"}, {"Ratings": {"Cleanliness": "3", "Check in / front desk": "1", "Overall": "2.0", "Value": "1", "Rooms": "2", "Location": "5"}, "AuthorLocation": "San Francisco, CA", "Title": "“Average”", "Author": "Sandy94108", "ReviewID": "UR15092630", "Content": "My boyfriend and I live in San Francisco. We spend a lot of time in Napa, and Russian River. This was our first stay at the Yountville Inn. Normally we wouldn't have booked a room there, but we had won a 1-night stay from a silent auction event at City Hall. First the good news, it's walking distance to all the great restaurants in Yountville: Ad Hoc, Redd, French Laundry, etc. The bad news...the rooms are generally okay. For the price you pay you could actually stay elsewhere that is much nicer. I really believe they over charge for the rooms. Because of the comp'd room charge, it took them two days to figure out how to handle it on their end. At our arrival we asked them to switch the credit cards on the account, and to use my boyfriends card and not mine. Well, I just opened my Amex card, and of course there is a charge for the full two days on there. And there is a $56 credit on my boyfriend card. What the?! Can they not do simple math? I didn't think it would be that difficult to handle. But I guess for the Manager that I had been dealing with for two days isn't too keen on her math and/or computer skills. On an ending good note...make sure you have a chance to eat at Ad Hoc or Redd...they do a beautiful job!", "Date": "April 16, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "4", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Whippany, New Jersey", "Title": "“Would Definitely stay here again”", "Author": "jeffsstuff", "ReviewID": "UR14636770", "Content": "We originally planned to stay at a different hotel but, after seeing a review here on Tripadvisor.com we decided to change our plans. We certainly are glad that we did. While the Yountville Inn is somewhat further from the restaurants than some of the other hotels, it seems much nicer than many of them. It also compares very favorably in terms of price. the room was large with a large king-size bed, fireplace (gas), tall ceilings and a very large bathroom. The only thing that would have been better in the bathroom would've been to have had two sinks. As an added perk, the hotel provides pastries from the Bouchon Bakery at breakfast as well as midday. While we knew about the pastries in advance, we were surprised at the variety that was provided. Breakfast included fruit, pastries, breads, cheeses as well as orange and grapefruit juice, coffee and tea. The pastries were outstanding. They tasted even better not having to pay three dollars apiece as would be the case had we gone Bouchon Bakery. Breakfast was served in a large lobby area complete with comfortable chairs/sofas and a large fireplace. All in all, an excellent choice. When we visit the Napa Valley again, we will be sure to make the Yountville Inn part of our plans.", "Date": "March 29, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "4.0", "Value": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Virginia", "Title": "“Spacious Room and Great Location”", "Author": "Explore_CFE", "ReviewID": "UR14308628", "Content": "I stayed at the Yountville Inn for three nights while exploring Napa. I think the location was the best part of it. You could walk to several great restaurants and nearby shops. The room had high celings and a lot of space. The beds were a little uncomfortable, but not bad enough to keep you from falling asleep, just a little bit of a sore back in the morning. We spent some time enjoying the hot tub and pool, although I would make sure you don't get a room too close to the pool because you would probably hear people out there or the gate opening/closing since people walk through that area to get to the lobby for breakfast. I was in building number 5 which was extremely quiet and the terrace over looked a small creek. The breakfast consisted of delightful pastries that I heard were brought in from the near by bakery Bouchon. There was also some cheese, fruit and hard boiled eggs. They also had starbucks coffees and teas available all day which was nice. check out was a breeze and the staff was friendly.", "Date": "March 15, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "4", "Check in / front desk": "5", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Nevada", "Title": "“Lovely Hotel”", "Author": "moviegal226", "ReviewID": "UR14220553", "Content": "This was our first stay at the Yountville Inn, and it is a very nice property. We were booked in an accessible room by the swimming pool. Our room was literally next door to the pool! Out of our side window was the actual pool deck. This made privacy nonexistent, but our view was great. Plus, our room was close to the front desk and the lovely Bouchon pastry continental breakfast served each morning. Our accessible room was very large and extremely spacious. We had plenty of room for everything. The room features a nice king bed (be sure to request extra pillows; we thought the pillows were woefully inadequate and way too soft) flanked with nightstands and lamps, a separate seating chair and sofa, a small bistro table with 2 chairs, and a large chest with a huge plasma t.v. Our room had a lovely corner gas fireplace decorated with rustic lava rock. The accessible bathroom was well laid out, yet only had one sink. The accessible shower had no tub, but it was still very nice (with lovely slate surrounds). The in-room amenities (soap, shampoo, etc.) was adequate but far from luxurious. We had an in-room coffee maker with Starbucks coffee and hot chocolate, an ice bucket, two wine glasses and a corkscrew. A small in-room refrigerator stocks sodas for $3 each. The room has lots of windows, yet only one window has blackout curtains. The other windows have pretty white shutters. These shutters look great, but they do a terrible job keeping the room dark. Light sleepers might have trouble with this as the sun really does come through the slats and brightens the room very early in the morning. The grounds are lovely, very lush and green. Meandering sidewalks and modern sculptures abound. The rooms are set up to look like cottages, though they are all attached. It was easy and free to park. The room was spotlessly clean. The only major complaint I have is that when the water came out of our shower and bathroom faucet, it was SCALDING hot. You had to barely turn on the water or it would seriously burn you. Be careful if you stay here! The water was just way too hot! Also, I found the towels to be a bit thin, and the furnishings / bedding could use some updating. The heated saltwater pool is open 'til midnight and was really refreshing. The location can't be beat; you are within walking distance to many gourmet restaurants (including Bistro Jeanty and Thomas Keller's Bouchon and Ad-Hoc) and a 5 minute drive to a long list of terrific wineries. A convenience market and a Wells Fargo bank are also within one block's walking distance. This was a nice hotel and could really be a premier, upscale property with a bit of renovation. The staff was friendly, accommodating, and eager to please. I wouldn't hesitate to stay here again.", "Date": "March 11, 2008"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Business service (e.g., internet access)": "3", "Check in / front desk": "4", "Overall": "5.0", "Value": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "New York", "Title": "“A wonderful stay in Yountville”", "Author": "KBey", "ReviewID": "UR13863234", "Content": "I booked theYounville Inn for 3 nights based on the recommendations I read on this web site. We requested and received a room in the back by the creek with a vaulted ceiling and patio. It was spacious and clean. The fireplace was great since it was a chilly weekend. We were unable to take advantage of the patio because of the weather. Nevertheless, we had minimal complaints. There was a wine tasting the evening we arrived. The breakfast was delicious. The only negative things I can think of is the walls are very thin. We could hear a conversation in the middle of the night in the next room. We were also unable to receive a wireless internet connection in our rooms even though they insisted we can. We dined at Ad Hoc, Redd and Brix. All were wonderful, especially Redd. I highly recommend it. Chandon Domaine Sparking Wine tasting room is right across the street. It was one of our favorites. We also loved, Miners, Plumpjack, Peju and GooseCellars.", "Date": "February 26, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Los Angeles", "Title": "“Fantastic way to spend Thanksgiving”", "Author": "CruisinWorld", "ReviewID": "UR12277099", "Content": "Everything was really great at this hotel! We stayed here over Thanksgiving and we were given a room on the top floor that had high ceilings and a little sitting area. The free breakfast is wonderful. Great pasteries and good atmosphere. We had dinner at Bistro Jeanty (MUST HAVE THE TOMATO SOUP!!) great steak tartare. Thanksgiving day we ate at The Napa Valley Grille. Very basic and very good. Another great recommendation - the restaurant Cook in St. Helena - gnocci to die for. Also LOVED Whitehall Lane winery", "Date": "January 2, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "3", "Check in / front desk": "4", "Overall": "5.0", "Value": "3", "Rooms": "5", "Location": "5"}, "AuthorLocation": "cherry hill", "Title": "“Very nice and friendly”", "Author": "kod", "ReviewID": "UR10404988", "Content": "The rooms are large with a sitting area, round table, gas fireplace, king bed, and spacious bathroom. The continental breakfast was fabulous because of the multiple pastries from Bouchon. The front desk was very willing to help me with making and cancelling a variety of reservations. The pool was nice and warm and the jacuzzi hot. My only criticisms are the lack of a computer in the lobby and no exercise room (even though you can use one for free nearby). I would still consider this property as many in the area, as a fancier motel.", "Date": "October 28, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "3", "Check in / front desk": "5", "Overall": "4.0", "Value": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Vancouver, WA", "Title": "“A great stay at the Yountville Inn”", "Author": "Ridgewatraveler", "ReviewID": "UR10235988", "Content": "I just came back from a three night stay at the Yountville Inn. My sister in law and I booked a room as part of a \"girl's weekend\" to celebrate my 50th birthday. We requested and received a lovely Superior room with two queen beds at the back of the property near the creek, room 309. The room was large, exceptionally clean and well-appointed, with high vaulted ceilings, robes, nice towels, and twin vanities in the bathroom. Perfect to share. I'm pretty particular about beds, but found these to be fine - not too soft, not too firm. Like other reviewers, we noticed that we could hear neighbors through the walls. We couldn't make out voices, but a loud TV kept us awake one night. And yes, the toilet was loud but it was the new high-efficiency, low water variety that you find throughout much of the valley. The room had a window-type air conditioner and a ceiling fan which we found that we needed to run even on cooler days to keep the room comfortable. We had great service from the front desk - no rude staff on our visit. Breakfast pastries from Bouchon were great. Despite our high-season visit we were able to enjoy the pool and jacuzzi by ourselves most nights. The Inn's Yountville location is great for touring most of the valley. The property fronts a quiet street that is one block off the main highway, and features mature landscaping and some great garden art. And, it is two doors down from Redd, a great restaurant. Our only real complaint? Would have been nice to have a computer to use for e-mail and reservations. The Inn has wireless internet but you must bring your own pc. You will pay a premium to stay here during high season, but this Inn is less expensive than many other Yountville options. I recommend it.", "Date": "October 22, 2007"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "1", "Overall": "4.0", "Value": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "", "Title": "“Will Return Despite Rude Front Desk Clerks”", "Author": "Barbara45", "ReviewID": "UR10067228", "Content": "First, this hotel is located in Yountville (not Napa as Tripadvisor as it designated). It makes it difficult when searching for hotels in Yountville and this one does not show up when we were looking for hotels in Tripadvisor. We almost missed it! And that would have been a shame as the hotel is very nice. Our room faced a creek with a nice patio that we could relax and have coffee and dine on the fabulous pastries/fruit/bagels/juices they provide as part of the complimentary breakfast. We enjoyed a soak in the hot tub after a day of hiking at Robert Lous Stevenson park up in Calistoga. Also, hiking at closer Bothe - Napa Valley State Park was excellent. We were hoping to be able to walk to the French Laundry for dinner but it is about 7/10ths of a mile away and in nice clothes, wasn't feasible. The French Laundry, btw, was an amazing event. Six hours of dining. The only negative of our entire trip was the extremely rude clerks at the front desk. When we checked in, no one was there and when she finally came out, actually rolled her eyes and sighed. Despite being told our room would be ready upon arrival, she said no it wasn't. We walked downtown and shopped for an hour and half and came back and two different clerks were now at the desk. They also couldn't be bothered and quickly said the room was not ready. Their tone of voice was belittling and despite having traveled for many years, I have never encountered that many rude front desk clerks. It wasn't until a delightful, intelligent woman named Melanie arrived at work and suddenly the whole atmosphere changed. She must have been a manger or supervisor cause our room was ready within seconds of her arrival and the other rude clerks suddenly became quiet. We do plan on returning (we would like to try Ad Hoc next door and we can easily walk there from this hotel) but we cringe thinking about having to deal with those rude front desk clerks.", "Date": "October 11, 2007"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Check in / front desk": "4", "Overall": "4.0", "Value": "3", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Chicago, Illinois", "Title": "“Perfect For Napa”", "Author": "srp_2000", "ReviewID": "UR10064259", "Content": "We got a last minute deal thru the Inn's website and we got upgrade to a Jr Suite at no charge. The room was perfect, by far the nicest place we've stayed in Napa. The breakfast was great too, they get baked goods from World Famous Bouchon - You can't beat that. Great pool too!. My only issue, one front staff worker was very rude, but the rest of the staff was great. We lost a pair of $300 sunglasses while staying there and this one person acted like we asked her to crawl around in the mud at night to find them. Just down right rude and then was also rude when we checked out by making some nasty comments.", "Date": "October 10, 2007"}, {"Ratings": {"Service": "1", "Cleanliness": "4", "Check in / front desk": "2", "Overall": "3.0", "Value": "3", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Tokyo, Japan", "Title": "“Big Room, Small Service”", "Author": "KyleinJapan", "ReviewID": "UR10005214", "Content": "The hotel has a great location and has the potential to be a favorite for visitors to the Napa Valley. For the cost of their accommodations, I expected a much more engaging experience than what is actually offered. As many have written in other reviews, there is no shortage of space in the guestrooms. However, we found the room to be dark during daylight hours since there is only one window (in our case a sliding glass patio door). Perhaps it would be more cozy in winter months with the fireplace but we couldn't feel comfortable in this cavernous room. The breakfast was consistently good, thanks to the hotel's selection of pastries from Thomas Keller's Bouchon Bakery. But what really dampened the stay was the indifferent service from the staff and management. During our stay there was a power outage in the town that affected the hotel. We walked to the lobby to inquire and the staff were standing in the dark behind the front desk. No one said anything about the issue until we inquired. Later that day when we return to the room, the clocks had not been reset. What a great service opportunity if the management had organized some teams to reset the clocks. It's only 51 rooms. In the mornings when we arrived for breakfast, no greetings from the staff in the lobby. Also, I would have expected the hotel management would use either breakfast or afternoon wine tastings as a chance to mingle with the guests. I couldn't help feel the Yountville Inn could only be described as an \"upscale motel\". It certainly has potential but will take some efffort. I wouldn't recommend to others at the cost prices.", "Date": "September 26, 2007"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Check in / front desk": "4", "Overall": "5.0", "Value": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Midlands England", "Title": "“Very comfortable”", "Author": "NeilMacUK", "ReviewID": "UR8738332", "Content": "Stayed here for 2 days. Very nice large room with patio, which was a little on the small side, however that is my only criticism. Friendly staff, excellent location, some super restaurants in walking distance. Would definitely stay here again.", "Date": "September 17, 2007"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Check in / front desk": "4", "Overall": "3.0", "Value": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Vancouver, British Columbia", "Title": "“Yountville Inn - the good and the bad”", "Author": "baileyman", "ReviewID": "UR8525895", "Content": "We just returned from a 2 night stay at this Inn. On the plus side, the room was huge, wth nice decor, the bathrooms luxurious and the construction looked fairly new. The staff were very pleasant, the continental breakfast was deluxe - best ever, and the pool was fantastic. On the down side, we were shocked that we could hear our neighbors having a regular conversation and normal voice level coming thru the wall so clearly that it sounded like they were right in our room. I am not sure if this is unique to the buidling that we were in (we had room 202) as it seemed a more recent construction than the other buildings which are part of this inn. I also now noticed a very similar finding by some other review on this site dated about a year ago. If I return, I will definitely ask about the soundproofing in the other buildings.", "Date": "August 28, 2007"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "usa", "Title": "“Casually elegant luxury in the Wine Country”", "Author": "lagniappe34", "ReviewID": "UR8229971", "Content": "This place rocked. It was exactly what I was looking for. I booked it sort of as a last minute getaway and a lot places were full but through a little research, I found out about the place. I was there on a Wed & Thursday night. Wed was $200 (which was bargain, I thought) and Thursday was $375 (a little pricier than I would have liked), but I was happy with the average (kind of). Its so nice. The room was really large. There was a full seating area with a sofa, chairs, table and fireplace. My room had a nice size patio, as well, with a somewhat obstructed view of the mountains in the background. I loved the bathroom layout. Ample space for my stuff, clean, nice towels. All very nice. The decor was just so pleasant, that's really the only way to describe it. It wasn't necessarily my style, but it was really comfortable and pleasant, sort of wine-country casual. There is not fitness center, which irks me at every hotel. They have a $15 dollar per day deal with a gym in Yountville, which I didn't utilize. The lobby area is really nice. All day long, they offer tea, coffee, hot chocolate and, the best part, cookies from Bouchon Bakery. ADDICTVE! They do a really nice complimentary breakfast - gorgeous pastries and muffins from Bouchon Bakery, fruit, hard-boiled eggs, bagels, cereals. For me, that is MORE than plenty for breakfast. I still walked to Bouchon for coffee, though. The pool and hot tub were clean and very relaxing after a long day of tastings. I really like the location of this. I could walk to any of the great restaurants in Yountville, which is a big thing for me. Overall - just really, really liked it. DEFINITELY recommend it.", "Date": "July 24, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Westchester New York", "Title": "“A Great Inn and fabulous location ...Westchester County NY”", "Author": "andrea065", "ReviewID": "UR7839354", "Content": "My husband and I along with three family members went to this hotel June 6th through the 9th to celebrate his 40th birthday. What a great hotel and they couldn't have treated us better. The rooms are beautiful, large and very clean. The breakfast in the morning was terrific. The pool area was a perfect way to end the day. And don't get me started on the complimentary peanut butter cookies from Bouchon. They were too die for!! The Inn is in a terrific location. All of the wineries were just a short drive away. My favorite wineries were Schaffer and Pride. My husband had emailed them that it was his birthday and they couldn't have been nicer in setting up the wine tastings and touring the property. Each of these wineries went out of their way to make my husband's birthday special. We even got to taste some special bottles that are no longer available! As far as the restaurants in the area go, all the locals told us that Bouchon's was overrated. We should have listen. It was good, but nothing great. Same with Mustard's Grill. I did love Brix Restaurant-food was fabulous. .Next time I would do Redds. Heard really good things about it. Make sure you stop at the Oakville Grocery and take a picnic lunch with you. Pride has a beautiful picnic area as does Joseph Phelps (for Phelps you need to make a reservation for one of their outside tables-they were very snobby, my least favorite winery, although it is my husband's favorite wine). don't hesitate to stay at the Yountville Inn. It really is a great hotel with the nicest staff. You will not be disappointed", "Date": "June 12, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "2", "Check in / front desk": "5", "Overall": "5.0", "Value": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "PA", "Title": "“Wonderful location!”", "Author": "hmi24", "ReviewID": "UR7780031", "Content": "Excellent hotel in the quaint town of Yountville. The rooms were clean and quiet, the breakfast was more than enough to fill us up and the pool was very relaxing. I would definitely recommend this hotel. If possible, ask for a room towards the back of the property. Rooms 411 and 304 are usually requested. Excellent restaurants in walking distance ( Redd was YUMMY), many vineyards within 5 minute drive and the hotel also sponsors tastings in the lobby on certain evenings. The service was also extremely helpful. The only downfall is that they do not have a business center, but if you have a laptop they allow you access to their wireless internet. My husband and I found the public library in St. Helena (next town up the road) and were able to use the internet there for free. No big deal, I was on vacation so I think it may have been a good thing to not have immediate computer access. As far as Vineyards - recommend Buehler Family, Cakebread's wine and food pairing as well as Frog's Leap. All were excellent and extremely informative and did not feel too commercialized if you know what I mean!", "Date": "June 5, 2007"}, {"Ratings": {"Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "3", "Overall": "4.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "West Sussex", "Title": "“Wonderful spot”", "Author": "luxuryhound", "ReviewID": "UR7338734", "Content": "The Yountville Inn is great! The rooms are spotlessly clean, spacious and well appointed. There is a small outdoor pool that is just right for a quick cool off. Breakfast is simple and can be collected from the foyer and taken to your room or eaten in the very tasteful 'parlour' area to gentle sounds of classical music. There is absolutely no need to pay the extra money for a hotel with full restaurant and bar and there is a plethora of fantastic restaurants to choose from within very easy walking distance of the hotel. Yountville is very well situated right in the middle of the main Napa wine growing area with Callistoga, St Helena and Napa itself all within 20 minutes drive. The area and the hotel are well worth a visit.", "Date": "April 12, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "4", "Check in / front desk": "5", "Overall": "5.0", "Value": "4", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Scranton, PA", "Title": "“Great Spot”", "Author": "2103", "ReviewID": "UR6597774", "Content": "This place is fantastic! The rooms were spacious, beautifully decorated and the bathrooms were magnificent. The Inn has a standard outdoor pool, a lobby area that has complimentary wine tastings on Friday nights, The famous Bouchon Bakery caters the continental breakfast every morning in the lobby. The staff could not have been more accomodating. The rooms had gas fireplaces and were very romantic. It is located right offf Rt 29. Highly recommended for couples.", "Date": "January 15, 2007"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Business service (e.g., internet access)": "3", "Check in / front desk": "4", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "San Francisco", "Title": "“Get what you pay for”", "Author": "SanFran35", "ReviewID": "UR5912289", "Content": "I have stayed in this property several times since the time of inception. Over the years the property has become a little stale but I just stayed there in August and had a very nice time. Hotel staff are pleasant and accommodating, rooms are nice (if a little tired) and the pool area ia nice (but tends to be overrun with kiddies at the weekend in high season so not great for a 'romantic getaway' if that's what you are after). I just booked another stay there with a bunch of my girlfriends for a Saturday in December and was told that new sofa beds have been installed in the room so sounds like they are making improvements. I always really enjoy Yountville and this place is very well located and walking distance to all the restaurants in the village. They even provide a bike rental service which is fun to cycle around the vineyards. Overall thumbs up for this place for the value compared to other properties in the area.", "Date": "October 5, 2006"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Check in / front desk": "5", "Overall": "4.0", "Value": "3", "Rooms": "3", "Location": "5"}, "AuthorLocation": "St. Louis, MO", "Title": "“Well located, comfortable accommodations”", "Author": "Billiken", "ReviewID": "UR5828380", "Content": "NOTE ON RATING: This was our first trip to Napa. Our friends and, effectively speaking, our guides, had been here many, many times. They like the Yountville Inn for its comfortable accommodations and convenient location. I agree. While it is not the Four Seasons, it is a very comfortable property, clean, easy to utilize, with a nice, if not modest, breakfast presentation. I am a runner and this property makes walks and or runs extremely convenient based on its location. Great streets to run on inclunding the road that wraps around the Yountville Hills, about a 6.5 mile run to Highway 29 and back. I was told that they are adding a wine Bar to the lobby which would be great. This is probably 12 months out from what I was told. I have not tried other accommodations in Yountville, but I would go back. If it helps, we typically seek out Four Seasons type accommodations and we were satisfied with this property despite its simplicity. Cannot help but make one comment on the restaurants. We ate at four different restaurants: Mustards, Bistro Jeanty, Tra Vigne, and the Culinary Institute in St. Helena. My favorite, by far, was Bistro Jeanty. Excellent food, great service. And, it is about two blocks from from the Yountville Inn. Finally, if you want to have a great tour of a winery, try to get a tour of Pride. Extremely informative. Also, Kuleto is wonderful, but not easy to get to. One drawback on the Yountville Inn was that in the pool area, you could hear the cars going by both on Washington Street and on 29.", "Date": "September 22, 2006"}, {"Ratings": {"Overall": "2.0"}, "AuthorLocation": "California", "Title": "“Soundproofing and decorating need work”", "Author": "PoppyQuince", "ReviewID": "UR5816586", "Content": "We checked in to this property hoping for a relaxing stay in the wine country and were upgraded at check-in. Our room was quite dark, with one full-size window and another small one high up in the wall. The ceiling was chalet-style and sloped up to about 15 feet. The furnishings were dark wood with dark green and burgundy colors in the carpet and upholstery, and the gas fireplace was set in a wall of stones next to the hulking armoire. This might have felt good on a ski slope in the dead of winter, but was only depressing in the Napa Valley in early September. The problem that was really annoying however became evident later, when we heard clearly the conversation of our immediate neighbors. They were speaking at normal conversational level and we heard it all. I'm glad they weren't having a fight! And they did go to sleep at a reasonable hour. This room cost $308 including tax. While I know that hotels in the area can charge pretty much whatever they want during the season, we definitely felt it wasn't worth anything like that amount.", "Date": "September 19, 2006"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Chicago", "Title": "“Pleasing hotel in Yountville”", "Author": "Naha", "ReviewID": "UR5813781", "Content": "We were at Yountville Inn over Labor day weekend. The inn is very quaint and small - but perfect for its purpose. It is at the \"end\" of the Yountville \"strip\" I'd call it. Literally right off the exit..... The Front Desk is fine. The girls working there could be a bit more cordial, but their services suffice. The inn does not have turn down service, if you need extra towels for the morning and etc. make sure to call in advance. They do not have maids/cleaning staff during the evening so if you do need more towels make sure to ask the morning cleaning lady or else you have to go to the Front desk to ask for more towels in the evening. The rooms are good in size, plenty big and we got teh best priced rooms. Fireplace, double sinks, good water pressure in shower and etc. However the rooms are a bit dark, b/c limited windows but its great for what it is. The breakfast is good for what it is. Mostly pastries, hard boiled eggs, fruit and more pastries :) Also a variety of cereals/juices/milk. Everything is in walking distance in the area, its a very nice area. We have been to Napa before, but stayed in the other surrounding areas and think that Yountville was the best place to stay. French Laundry, Bouchon are both in walking distance from the hotel. French Laundry is totally worth it, what an experience - we loved it. Bouchon is also by chef Thomas Keller and a GREAT restaurant as well. We will most likely stay at the Yountville Inn when we go again, the only other one we liked in the area was The Vintage Inn - check it out!", "Date": "September 18, 2006"}, {"Ratings": {"Overall": "3.0"}, "AuthorLocation": "Utah", "Title": "“Nice rooms, convenient location but poor service at the front desk.”", "Author": "Max_P", "ReviewID": "UR5722749", "Content": "My wife and I stayed at the Yountville Inn in late July. We love to visit Napa for 2-3 night getaways and have stayed on other properties. This was our first stay at Yountville Inn. We were referred by our wine club and received a slight discount on room rates. Overall we were pleased with the property and it's convenient location in the Napa valley. The rooms are nicely furnished and comfortable. The pool was pleasant and the grounds well kept. However, we were disappointed in the lack of professionalism exhibited by the front desk staff. Spending $300/night (after discount), one would expect some type of concierge service, or at least a front desk staff capable of assistance in making local dinner and spa reservations. When we asked for dinner recommendations the staff was unable to make any with confidence. When we asked about spa services, we were handed some phone #'s and told to \"try these\".", "Date": "August 29, 2006"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Business service (e.g., internet access)": "4", "Check in / front desk": "5", "Overall": "5.0", "Value": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Tulsa, Oklahoma", "Title": "“Great stay”", "Author": "raskinco", "ReviewID": "UR5563444", "Content": "We had perfect stay. The property is immaculately maintained and there was an obvious attention to every detail. We had an upstairs room with vaulted ceiling. It is a nice size room and the vaulted ceiling make feel even bigger. As with the rest of the property is was very clean and well maintained. I had read reviews complaining about the beds, but we found no problems. The matress was firm, but not the least bit uncomfortable. The shower pressure was the best I have in hotel since the 70's. The cleaning crews were even quiet. You never heard them cleaning rooms around you at the crack of dawn. Again they really pay attention detail and know that people are there on vacation. Since it is an Inn there are not the ammentaties you might find at othr full service hotels. No spa, no room service. The pool is not huge, but there are quite a few chairs and tables, and again it is really clean. The staff was very nice and accomadating. They have a simple complimentary breakfast with Bouchon pastry. The pastry sets this breakfast apart. They also make sure they don't run out of things even if you are a late riser. Yountville is great place to use as home base on your trip Napa Valley. It is close to the middle of all the Napa towns and about 20 minutes from Sonoma. Can't wait to go back.", "Date": "August 7, 2006"}, {"Ratings": {"Cleanliness": "5", "Overall": "4.0", "Value": "5", "Service": "5", "Rooms": "5"}, "AuthorLocation": "Newport Beach, California", "Title": "“Second stay as nice as the first”", "Author": "Tar Heel Bill 92", "ReviewID": "UR5421992", "Content": "I just visited Napa with 2 friends and I booked us for 2 rooms at the Yountville Inn. I had stayed there last year in July with my partner and another friend and had very much enjoyed our stay. This year's stay was as enjoyable. We stayed for 2 nights from Wednesday through Friday, so we got a good rate (by Napa standards) of $225 per night for each room. (In comparison, the Vintage Inn was offering smaller rooms for $400 per night.) My room was very spacious, with a king bed, a living area, and a sizeable bathroom. I also had a sizeable balcony area, but since my room overlooked the parking lot it was a bit of a waste. Still, my friends had the same room overlooking a nice garden area, so we would often sit out there on their balcony in the evenings before and after dinner with a nice bottle of wine and just hang out. It was quite hot again during our stay, and I am one of those people who always likes it very cold, and again my room temperature was pretty good with the unit's air conditioning. I've had better, but then again I've also had MUCH worse, so I was pretty pleased. I asked if they could bring a fan to help me keep cool and they quickly brough a HUGE fan for that purpose. I was comfortable for my entire stay despite the fact that temperatures ran well over 100 degrees during the day and even at night it was around 75-80 degrees. The complimentary continental breakfast wasn't my favorite, since they ran out of bagels and muffins that I most liked, but it was more than adequate. There was fresh juice and very good coffee (or so my friends tell me as I don't drink coffee), and the hard boiled eggs are a favorite of mine, so I had plenty to tide me over. Of course, the Inn is very well situated with great restaurants like Bistro Jeanty and Bouchon (and the French Laundry, of course, which I still think is fabulous but way overpriced) just a 10-15 miniute walk from the hotel. Very convenient. I very much enjoyed my stay for my second visit and expect that I will make the Yountville Inn my staple place to stay in Napa Valley when I visit with frends. I have stayed at Auberge du Soleil when I am there with only my partner, but then our budget is bigger than most of our friends'. Still, I very much enjoy my Yountville Inn stays and am surprised that it is not more highly ranked here. For the record, the Vintage Inn rooms seem totally dated and the Vintage Inn itself seems more of a factory than a charming Inn, and the Yountville Inn is far superior in my estimation.", "Date": "July 3, 2006"}, {"Ratings": {"Cleanliness": "5", "Overall": "4.0", "Value": "5", "Service": "4", "Rooms": "5"}, "AuthorLocation": "Bronx, NY", "Title": "“Couldn't have been nicer!”", "Author": "Yanks1", "ReviewID": "UR5317803", "Content": "My husband and I have been to Wine Country a few times and this is the first time we stayed at the Yountville Inn. We received a daily discount because of a wine club we belong to - I learned about this from another TripAdvisor reviewer - worth checking into! We had a really large room with a vaulted ceiling, on the corner of building 6 overlooking the pool which was a heated salt water pool - very relaxing. The room had a fireplace (though it certainly wasn't needed in June!), a small couch for TV viewing, a refrigerator, and best of all, a really tremendous bathroom with double sinks, separate toilet and beautifully designed tub area. (Don't know how important this is to anyone, but it had the best water pressure of anyplace I've ever stayed in - great for invigorating showers!) The breakfast had exceptional pastries and even had hard boiled eggs for those carb watchers! Coffee and fruit was very good too. Room was very clean. Front desk staff was not overly friendly but nice enough. Location of the Inn is excellent. Take a trip to Sonoma if you want to experience some free wine tastings - they are not as snobby about wine as Napa can be. Good eating at Mustard's, Napa Valley Grill, Bistro Don Giovanni's. All in all, a great trip and we will definitely stay here again.", "Date": "June 7, 2006"}, {"Ratings": {"Cleanliness": "5", "Overall": "4.0", "Value": "3", "Service": "3", "Rooms": "5"}, "AuthorLocation": "California", "Title": "“Great Stay”", "Author": "SOG-Joker", "ReviewID": "UR4971375", "Content": "We Stayed at the Yountville Inn Weekend of April 1ST.Very Quiet Location, Beautiful Creek next to our room. The Inn is Beautiful, The Rooms are Huge and gorgeous, bathroom was very nice. Bed Good , not Great. Good continental breakfast. Great Location right in the middle of Napa Valley. Less Than 30 mins From most Wineries. Small Pool and Jacuzzi, but it was Rainy, so never went in.A very good Motor Inn, with 3 Diamond Level amenties.OverPriced, as are all Napa Hotels.I recommend it.", "Date": "April 13, 2006"}, {"Ratings": {"Cleanliness": "5", "Overall": "4.0", "Value": "5", "Service": "5", "Rooms": "5"}, "AuthorLocation": "Santa Fe", "Title": "“Comfortable, quiet”", "Author": "centralcoastlove", "ReviewID": "UR4476897", "Content": "We switched over to the Yountville Inn after a bad experience at the Vineyard Country Inn in St. Helena. Our room was wonderfully clean and comfortable; the beds were fine and all appointments were above average. We had a downstairs room with a fireplace and small patio that faced out onto a creek. Very quiet and peaceful. The front desk staff was most helpful and friendly; they gave us coupons for free tastings at several wineries, which was appreciated, and St. Supery did a tasting at the hotel on Friday night. Breakfast was leisurely by the fireplace, reading the WSJ or NY Times. We thought this was a great deal at $125 per night. On the weekend, the rate doubled to $250. Yountville was very nice, much more enjoyable than the bustle and traffic of St. Helena. The best meal we had was at Martini House; Cindy's Backstreet Kitchen and Greystone at the CIA were also excellent. Mustard's was fun. Reservations are a must everywhere.", "Date": "February 21, 2006"}, {"Ratings": {"Cleanliness": "5", "Overall": "4.0", "Value": "2", "Service": "4", "Rooms": "4"}, "AuthorLocation": "Birmingham, AL", "Title": "“Great weekend in wine country”", "Author": "A TripAdvisor Member", "ReviewID": "UR4367753", "Content": "My husband and I stayed here last week and thoroughly enjoyed our time here. The rooms were roomy yet cozy at the same time. The breakfast was outstanding for a continental breakfast. It might be a little expensive but we got a price break for this time of the year.", "Date": "January 21, 2006"}, {"Ratings": {"Cleanliness": "5", "Overall": "4.0", "Value": "3", "Service": "5", "Rooms": "5"}, "AuthorLocation": "San Jose", "Title": "“Great Service!”", "Author": "A TripAdvisor Member", "ReviewID": "UR4360772", "Content": "The service was great, my Superior room was outstanding. The bad part was no restaurant on site so no roomservice BUT you are within walking distance of great restaurants, why would you order in? I would return but never at $375 a night, I will wait for specials/off season.", "Date": "January 18, 2006"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "lisbon portugal", "Title": "“fantastic”", "Author": "A TripAdvisor Member", "ReviewID": "UR3983382", "Content": "small hotel but extremelly confortable, not cheap but very cosy. good breakfast included in the room price.", "Date": "October 2, 2005"}, {"Ratings": {"Cleanliness": "4", "Overall": "4.0", "Value": "3", "Service": "4", "Rooms": "4"}, "AuthorLocation": "London, United Kingdom", "Title": "“Good base in Napa”", "Author": "NickandEd", "ReviewID": "UR3975825", "Content": "We stayed in September 2005. The room (701) was large with a vaulted ceiling and a fireplace. Our room overlooked the pool area. It was very comfortable and well appointed. The layout of the inn is a little motel-ish, with the rooms accessed from outside and a spiderweb of paths to reach them. Breakfast is help-yourself and was very pleasant; a range of pastries, bagels, muffins and yoghurt. Tea and coffee are always available in the reception area, the reception team were very helpful. The pool and hot tub looked lovely - although we didn't have time to try them. Yountville itself is full of lovely places to eat and they are all close to hand. Would recommend the inn as a place to stay if you are visiting the Napa area and are looking for a central base to return to.", "Date": "September 29, 2005"}, {"Ratings": {"Cleanliness": "4", "Overall": "3.0", "Value": "1", "Service": "4", "Rooms": "4"}, "AuthorLocation": "Fremont, CA", "Title": "“Not bad, but very expensive”", "Author": "A TripAdvisor Member", "ReviewID": "UR3896797", "Content": "My wife and I take a trip to the wine country every year and try to stay in a different place each time to try new spas/towns. This year we chose the Yountville Inn. I can't complain much about the hotel. It was very clean, and when I made my reservations the desk manager was as helpful and pleasant as anybody I've every dealt with. He even sent me an email with suggested spas, wineries, restaurants and the like. Very nice touch. Moreover, he offered to make my dinner and spa/tasting appointments for me. Very nice touch. The room was immacculate with country theme. Very high vaulted ceilings and stone/gas fireplace. Nice pool area, nice grounds and the continental breakfast served in the lobby (complementary) was decent. The food was nothing special but the ambience was very nice and comfortable. I enjoyed eating breakfast in the morning sun lit room reading a complementary copy of the San Francisco Chronicle. The hotel is nestled right in Downtown Yountville so spas, restaurants, shops, etc. are just a short walk. Very cozy. That being said, our bed was very uncomfortable, it was as if we were sleeping on a sheet of plywood. Very hard. I did not sleep well at all. My main issue with this hotel, however, was the price. At $375 a night, I felt it was too expensive. There is no room service, and no restaurant on site. Moreover, there is no spa or even a gym attached, (so we walked one block to Villagio for spa treatments). Given that this is 'just a hotel' I think $375 ($420 after room tax) was far too expensive for what we got. We stayed at the Lodge at Sonoma last year, in their highest end \"Cottage\" which was like a small condo with exquisite decorations, large room, comfy bed (even equipped with a memory foam topper - WOW!) and private veranda. The Lodge, with nicer rooms, attached spa (fantastic by the way!), restaurant on site (Carneros), and bar service out to the pool (Excellent!!) was a better value and actually cost less than $375/night (but you sacrifice the downtown locale). While the Yountville Inn was a decent experience we will not return at that price. I would expect to pay about 189-200/night but no more, and the bed has to be more comfortable. Also, while the room was a fine size (not small by any means), it looked far more spacious on the web site - caveat emptor.", "Date": "September 12, 2005"}, {"Ratings": {"Cleanliness": "5", "Overall": "5.0", "Value": "4", "Service": "5", "Rooms": "5"}, "AuthorLocation": "Florida Keys", "Title": "“Thumbs Up!”", "Author": "Keysmickey", "ReviewID": "UR3640476", "Content": "Great room! The fireplace and vaulted ceiling were wonderful and the bathrooms were nicely oversized and luxuriously furnished. Very romantic (but we had our kids with us). Not to worry we're going back in a couple of months, just the two of us. We had a great weekday rate and when we weren't able to take our hot air balloon ride either day of our initial stay due to weather we wanted to come back later in the week (on our way back towards SF) to try again and the staff not only found us a room, despite being busy, but surprised us with the extension of our weekday rate despite being a Friday night!!! Oh, and the balloon ride was magnificent! Great hotel, friendly staff fantastic location.", "Date": "July 6, 2005"}], "HotelInfo": {"Name": "Hotel Yountville", "HotelURL": "/ShowUserReviews-g33300-d248141-Reviews-Hotel_Yountville-Yountville_Napa_Valley_California.html", "Price": "$367 - $672*", "Address": "<address><span rel=\"v:address\"><span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">6462 Washington Street</span>, <span class=\"locality\"><span property=\"v:locality\">Yountville</span>, <span property=\"v:region\">CA</span> <span property=\"v:postal-code\">94599</span></span> </span></span></address>", "HotelID": "2516176", "ImgURL": "http://media-cdn.tripadvisor.com/media/photo-s/02/2a/12/d9/hotel-yountville-pool.jpg"}}