{"Reviews": [{"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Tucson, Arizona", "Title": "“Great hotel and awesome customer service!!”", "Author": "taraleerose", "ReviewID": "UR129136363", "Content": "I am an employee at a Hilton in Tucson, AZ and stayed at this property for a night so I could go to a Diamondbacks game. I have to say that the service I received here was some of the best I've received anywhere - and staying as an employee, you don't usually expect that. The grounds are beautiful, well-kept, and inviting. I'm sad I couldn't stay for more than the one night so I could enjoy the pool. The restaurant had just opened when I arrived, but I did have a drink (which was great!) and spent a few minutes talking with the bartender (Mitch, I think) and the guest service agent (Travis). Travis is one of the best front office employees I've ever met at a hotel and believe he deserves lots of recognition. Every time I saw him, he was going out of his way to help a guest and always had a smile on his face. I'd also like to thank the van driver (Angel, I believe his name was) for his hospitality and conversation with me when he took me to the Lightrail station before the baseball game. You have really great employees here. The room was beautiful. I was upgraded to a suite (sooo appreciated!). The towels were huge and fluffy. The room was clean and smelled great. They use Bath & Body Works amenities in the bathrooms. The bed, as usual for Hilton Garden Inns, was fantastic. I had a stove top in my room, too, which I didn't use, but was nice to see. I'll be back many more times this year, hopefully, when I come to Phoenix. I had such a great time! Thank you.", "Date": "April 30, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Russell", "Title": "“Enjoyable Stay!”", "Author": "Anna D", "ReviewID": "UR128878699", "Content": "Friendly Staff and very helpful. Comfortable, Clean accommodations. Easy Highway access and several places to shop and eat within short drive from hotel.", "Date": "April 27, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "San Diego, California", "Title": "“Great Value”", "Author": "Irving J", "ReviewID": "UR127460952", "Content": "The staff was very friendly and helpful. The accommodations were a great value!", "Date": "April 8, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "3", "Overall": "3.0", "Value": "4", "Sleep Quality": "2", "Rooms": "4", "Location": "4"}, "AuthorLocation": "sedona", "Title": "“Could Have Been Better. . . .”", "Author": "LoisSedona", "ReviewID": "UR127150705", "Content": "My boyfriend and I stayed at this property, without knowing the \"Mortocycle Convention\" was in town. The hotel is located next to a Waffle House, and the motorcycle attendees were driving in and out of the Waffle House lot, literally blaring their stereos through all hours of the night (2am and 3am!). I sleep with ear-plugs and I was woken up twice. Again, not the hotels fault. And the woman at the front desk could not have been nicer (gave us free breakfast coupons which we SLEPT through!) and she actually called the police twice. This aside, the location is great. Very close to the I-17, which was perfect for us as we live in Sedona. The rooms are spacious. There were some stains on the wall and carpet in the room. And the pillows were not that comfortable. Also, the mini-fridge was \"off\" when we arrived in the room (to save energy consumption?). I would prefer the setting be kept low, so we could put our perishables in the fridge immediately. Instead we kept them in our freezer bags. I would be willing to give the hotel another try, but I would strong recommend ASKING if there is a motorcycle convention in town before booking at this hotel.", "Date": "April 2, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Fairfield, California, United States", "Title": "“A great time had by all”", "Author": "John L", "ReviewID": "UR126708656", "Content": "We traveled all the way from Northern California by car to enjoy Spring Training. We needed those Sleep Number beds they have here at HGI-Phoenix Airport. They were the best remedy to a long drive. The room was so spacious and with my family of four we had plenty of room to stretch out. We brought an Xbox for the kids to plug into the hotel tvs which kept them entertained when they weren't swimming in the great outdoor pool. My wife and I relaxed in the hot tub as well, easily in close contact with the kids. After trips to the Grand Canyon, baseball games & long shopping days we always came back to a clean room with the temperature set just right. I look forward to next years trip and hope they'll have room for us again!", "Date": "March 26, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Sun City West, Arizona", "Title": "“Best place to Start and Finish a trip”", "Author": "Donald H", "ReviewID": "UR124645123", "Content": "Very friendly staff and very clean rooms.Ms. Candy at the front desk is very nice to deal with.With the airport shuttle evey half hour makes it very easy to get to your flight.I book this hotel everytime I fly.Great cooked breakfast and even better dinner.Rooms are good size and quiet.Highly recommended!", "Date": "February 15, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "", "Title": "“Perfect for our return home!!!”", "Author": "Mbrayo", "ReviewID": "UR123378510", "Content": "On our way home from our honeymoon we decided to stay here due to close proximity to airport... What a delight! When we first arrived the concierge; an older woman working solo, was so kind to us even with a line. Great first impression! The room was smaller then other Hilton Garden Inns but the swimming pool, lobby, and restaurant more then made up for it. The building itself felt warm and accommodating! Kudos for such a wonderful stay! Breakfast was awesome and timely airport shuttle made the stay!!!", "Date": "January 20, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Tampa, Florida", "Title": "“Close to most places.”", "Author": "Damian C", "ReviewID": "UR122928592", "Content": "If you are loking for a very nice and clean hotel in the Phoenix area. Check out this Hilton Garden Inn. Rooms were great, nice, very clean, quiet, and very spaceous. Check in was very quick and Candy was very pleasant to speak with. She remember you by name every time she see you. Breakfast was a pleasure to get any and everything you needed, The entire staff at this Hilton was extremely nice. The hotel is Very close to the airport and they have a shuttle service to most anywhere you want to go within reasonable distance.", "Date": "January 11, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Portland, Oregon", "Title": "“Great Place to be near the Airport”", "Author": "Andrea D", "ReviewID": "UR121769282", "Content": "We were mis-connected in PHX arriving late at night. We called from the bank of phones in baggage claim looking for a very short overnight. The front desk staff was exceptionally nice and helpful. The rate was terrific. The complimentary shuttle arrived in minutes. A wedding reception was in progress at the hotel that night, so Ree at the front desk went out of her way to put us somewhere quiet and away from the hubbub. Our room was spacious, clean, and well appointed. The bed was very comfortable. There is no doubt we will return.", "Date": "December 15, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "San Francisco, CA", "Title": "“Efficient and Comfortable Place”", "Author": "Vegaztony", "ReviewID": "UR121212324", "Content": "The Hilton Garden Inn is located in a very safe place close to the Sky Harbor Airport. The staff is very friendly and accommodating. The room was very clean, and the bed is very comfortable. The breakfast staff knows how to wow the guests. My friends picked me up at the hotel and while they were waiting, the very nice lady who was the breakfast hostess offered my friends a cup of coffee. It was a quick stay. I will return.", "Date": "November 29, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "5", "Overall": "1.0", "Value": "3", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "santa barbara ca", "Title": "“Beware”", "Author": "peternoone", "ReviewID": "UR120808593", "Content": "This one just doesn't feel like a Hilton Garden Inn. The other one at the other sode of the airport is the real thing. At this one I could not get anyone to answer the phone to get a wake up call. It was 3am and I called form my room and my cellphoneI stay in HGI about 50 or 60 nights a year and really think they are perfect for a road warrior like me, but this one feels wrong. I had to go down to the desk after calling for 20+ minutes to get a wake up call(sort of important for someone who flies 300k miles a year).I was 3am until about 325 am and I almost called the police thinking all the staff must have a serious problem. I advise any Hilton users to give this one a miss and go to the REAL HGI at the other side of the airport on East Van Buren. That one looks and feels like a Hilton property. This one needs a lot of work and doesn't even look like a Hilton Garden Inn.", "Date": "November 20, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Calgary, Alberta", "Title": "“Quick stay over”", "Author": "Free_Skier", "ReviewID": "UR120704441", "Content": "We stayed here one night after arriving late fron NYC. The hotel is a ways from the airport if you are arriving, but close if you are leaving. After finding our hotel, chekc in was efficient, the rooms were clean. Nice touch was the front desk clerk asking if we wanted a bottle of water before we retired..and then not charging us for it. Too bad they have to charge for WiFi, that is a bit frustrating, but you can get free WiFi in the lobby or restaurant. Breakfast in the restaurant was good. If you are looking for a nice stop over hotel, this is a good choice.", "Date": "November 17, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Arlington, Virginia", "Title": "“Good choice for early morning flights”", "Author": "Steve W", "ReviewID": "UR119997786", "Content": "We wanted a place that was close to the car rental return, which is some distance from the airport. This hotel fit the bill. The staff, knowing proximity is a consideration, hands out printed directions. Furthermore, there's a not-overpriced gas station on the way. The hotel is up to HIlton standards: clean and comfortable, good but not luxurious. One complaint: Their Internet connections aren't wireless.", "Date": "October 31, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Wheaton, IL", "Title": "“Great place to stay”", "Author": "Phoenix_dream", "ReviewID": "UR119367773", "Content": "We stayed here at the end of a week-long tour around Arizona, on the night before our flight departure. Wish we had spent a few more days here! All the rooms are suites. We had a full kitchen and a separate living room with a tv in each room. The suites were not huge, but they were well-equiped and it is always nice to have two rooms to move around in. The breakfast was very good, and we enjoyed the pool and whirlpool. But the main reason I gave it so many stars was the great customer service we received, especially from the front desk (way to go, Travis!). We had some issues with one of our tv's and to make a long story short Travis worked hard to get it fixed for us, and when there was an inadvertent delay in getting it fixed due to the late hour, he went out of his way to work with his manager to surprise us. When we got back from swimming, we found a chilled bottle of champagne and a plate full of chocolate covered strawberries -yum! My husband is a Hilton Diamond member which may have encouraged even better customer service, but I would still consider this above and beyond - more than we have gotten at other Hilton family hotels.", "Date": "October 16, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Lancaster, Pennsylvania", "Title": "“Very pleasant surprise”", "Author": "MVTeacher", "ReviewID": "UR119082817", "Content": "I am a loyal member of Hilton Honors and frequently book travel in a Garden Inn since these properties are consistently reliable. This property clearly didn’t start life as a Garden Inn. It is an all suites property and the rooms have the feel of a Homewood Suites (or similar). The extra space was a pleasant surprise! Check-in was effortless. Early check-in was requested and accommodated. Justin, the front desk clerk, is still in school studying hospitality management and, based on what I saw, he should go far. A true professional! Property is well maintained. Rooms were spacious with a separate living/dining area. Room was extremely comfortable. Even though the hotel is a short distance from the airport, it is situated in such a way that it is very quiet. Had two breakfasts with good quality food and professional service. Overall, I recommend this property to anyone needing accommodations at the Sky Harbor International Airport.", "Date": "October 8, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "4"}, "AuthorLocation": "unique14u2c", "Title": "“Great hotel for a stopover”", "Author": "unique14u2c", "ReviewID": "UR119049786", "Content": "Stayed here for 1 night after a 20 hour trip from Australia. Nice hotel good clean rooms very well priced and great room service. Perfect for a stopover. Will stay again on my next trip to Mexico!!", "Date": "October 7, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Big Lake, Minnesota", "Title": "“Very Good Stay”", "Author": "Triplewin", "ReviewID": "UR118734455", "Content": "This properties layout reminds me of a college dorm. This is a large property by HGI standards and it doesn't fit the standard layout. It seems they try to utilze each square foot of space. The hallways are long and seem narrow. The rooms were very nice. I was in a king room with a sofa, oversized chair and large flat screen TV. There was a little area with a table/work station. Fridge and microwave in each room. The rooms were very clean, beds were comfortable, A/C was efficient and quiet. Internet service worked fine. Bathrooms were equipped with standard HGI amenities, shower had plenty of hot water and pressure. My collegue stayed down the street at the Courtyard and he said it was a dump. I would recommend staying at his location near the airport which is like 5-8 minutes away. Shuttle service is provided also.", "Date": "September 29, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "5", "Overall": "4.0", "Value": "4", "Service": "4"}, "AuthorLocation": "Bellingham, Washington", "Title": "“Great choice for business - can't go wrong for the price”", "Author": "IvanCU", "ReviewID": "UR117887718", "Content": "Very clean Hilton Garden Inn about five miles from the airport. Safe quiet area with a nearby Waffle House (or Awful House, as some people like to call them). Staff helpful and friendly. Nothing not to like about this one except perhaps not being walking distance to much in the way of food or shopping. At least not walking distance in the Arizona summer. I got an amazingly great rate at this hotel which made it a no-brainer to stay here. Recommended!", "Date": "September 10, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "3", "Overall": "3.0", "Value": "2", "Service": "3"}, "AuthorLocation": "Tucson", "Title": "“Beware of Park and Fly”", "Author": "TucsonTim", "ReviewID": "UR116997912", "Content": "Thought that it would be a good idea to arrive the night before a 6AM departure. The park and fly seemed convienent and a good deal. I arrived late and was surprised when the front desk person told me that the park and fly parking was behind the Holiday Inn Express right next door. You have to sign a waiver that if anything happens to you car while you are gone, too bad, it's your responsibility. There is very little lighting, of course it is uncovered, it's close to the dumpsters and there isn't any security. I should have just gotten up early and gone to the real airport parking. Of course someone hit my car and damaged the left rear pannel and scratched the rear passenger door. Didn't save much on this parking deal. As far as the room, it was clean and comfortable. Transportation between the hotel and the airport was prompt and the driver was very curteous.", "Date": "August 20, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Almont", "Title": "“It was like being home!”", "Author": "sassekp", "ReviewID": "UR116496462", "Content": "From the free shuttle ride from the airport.. to the bartender, everyone was so friendly and down to earth! Some hotels feel stuffy when you arrive. Not here. The front desk attendants were genuinely happy and nice. My stay was short, but so enjoyable thanks to the staff at the Hilton Garden! Thank you! Kim Almont, MI", "Date": "August 9, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "4", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Tucson AZ", "Title": "“Great Night Stay Before a Long Flight”", "Author": "TucsonAZMcBee", "ReviewID": "UR115866445", "Content": "We stayed here for one night before we flew out to Maui. What a wonderful smaller hotel. Event though it is not your average 300 room monster this hotel was just what we needed. Clean rooms, large flat screen, dinner and cocktails and breakfast inthe morning. Not to mention the easy park and fly with a 24 hour airport shuttle! The staff was friendly and curtious and our can driver went above and beyond when we got a little turned around leaving Sky Harbor. Would stay again and reccomend to family and friends.", "Date": "July 27, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Cosmopolis", "Title": "“Had a great time and would love to go back!”", "Author": "jodiecinert", "ReviewID": "UR115066137", "Content": "We stayed only one night due to other obligations. We had a peaceful stay. The pool was fun and the food, fantastic. The employees were very friendly and helpful. We would like to come back again when we have more time to just sit around and relax!!!", "Date": "July 5, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "4.0", "Value": "4", "Service": "5"}, "AuthorLocation": "Boston", "Title": "“Nice Hotel. Super Close to Airport”", "Author": "Beccaniece", "ReviewID": "UR114515810", "Content": "I stayed here because of it's location to the airport (Less than a 10 minute drive) and it exceeded my expectations. I was hoping for merely a clean, comfortable bed to rest my head before my flight and got that and much more. I was greeted at the front desk by a friendly staff and cookies! The rooms was very spacious nice sitting area and comfortable bed and free wifi in the rooms. The restaurant was fine, what you would expect out of a hotel decent predictable menu, but satisfied my hunger. Easy check out and front desk clerk gave me a print out with direction to the airport. When I returned home I realized I left my charger in the room I called they found it and shipped it back within days. Would definitely stay at this location again, great for a business traveler.", "Date": "June 20, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Location": "4", "Rooms": "4"}, "AuthorLocation": "", "Title": "“Great place to vacation with the family”", "Author": "Big_Jon_AZ", "ReviewID": "UR112341161", "Content": "Very nice king suite hotel with kitchenette and jetted tubs. Great breakfast (charge) and good restaurant. Friendly staff and nice but shallow pool. We love this hotel. While not the fanciest its a good, solid stay every time.", "Date": "June 9, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Santa Fe, New Mexico", "Title": "“Excellent service, spotless, relaxing”", "Author": "hwhitte", "ReviewID": "UR108486358", "Content": "The front desk employees are exceptional. Food is good and hotel is spotless. I can stay anywhere each week when I travel for business, and I always choose this hotel.", "Date": "May 16, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "3", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "3"}, "AuthorLocation": "New York, NY", "Title": "“never stay here”", "Author": "physician", "ReviewID": "UR106148389", "Content": "I have never stayed at a Garden Inn before but never will again based on my experience here. Just the one night prior to our early flight out the next morning was too much. The bed is not that comfortable. Also, this Garden Inn standard room had an air conditioner that was so loud that every time it turned on it would wake everyone up. Finally we ended up having to turn it off in the middle of the night. Lastly, every time one flushed the toilet there was a loud creaking noise through the floor of the room that also woke everyone up. It was the least restful night at a hotel that I have had in a long time. There are so many choices near the airport, and we choose this one due to the extra fold out sofa bed, but don't make the same mistake.", "Date": "April 29, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Grimsby, Canada", "Title": "“Very Pleasurable”", "Author": "liz2011024", "ReviewID": "UR105071964", "Content": "The location is close to the airport , the shuttle bus was clean and the drivers were most courteous. When arriving at the hotel we had a fast check in at 7AM. There were no rooms available at that time of morning so we were told to go to the dining room and have a coffee. We just finished our coffee and we were told that they had a room ready for us. The room was very clean. We had a very accomodating waitress at lunchtime. The dining room was about to close, but the waitress said it was no problem for her. The food was good. The front desk gave us suggestions how to spend the day. We had dinner in the dining room and it was very good. Our wake up call was excactly on time with two more reminders (just in case we had fallen back to sleep.). Check out was automatic. All the staff that we encountered could't have been better.", "Date": "April 22, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Longwood, Florida", "Title": "“Great hotel, courteous staff, comfortable, and close to Airport.”", "Author": "nauticalmania", "ReviewID": "UR104911495", "Content": "Hotel is located five minutes from the airport and offers a shuttle service to and from the airport. As a doctoral student at University of Phoenix, I have stayed here for both my Year One and Year Two residencies. The stay was first class, shuttle was timely and clean, fully equipped business center, and great exercise facility and restaurant. I'll continue to stay here.", "Date": "April 21, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Spokane, Washington", "Title": "“Comfortable, clean and close to airport”", "Author": "John58759", "ReviewID": "UR100907074", "Content": "Impressive suite hotel close to airport with very comfortable bedroom, living room area, and kitchen. The desk was big enough for 2 of us to work at. Would definitely stay there again.", "Date": "March 20, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "3", "Overall": "1.0", "Value": "2", "Sleep Quality": "2", "Rooms": "3", "Location": "2"}, "AuthorLocation": "San Diego", "Title": "“Horrible customer service”", "Author": "calicupcake", "ReviewID": "UR97897094", "Content": "Got locked out of my room because they said my cc declined. Um no, gave them the front desk a different cc & they still used the first one I had originally given them. Then when I did get in, they called me when I was in bed & said your cc declined, you need to bring us another one. They used the original again! What is wrong with them??? Told them I was in bed & that I had given them one already for incidentals & to use it but would also be paying cash in the morning. No you need to come down to the front desk, told them & who I had spoken to that morning with regards to paying cash...needless to say, they had to come get another cc, wouldn't lower my rate for the trouble, just offered breakfast. HORRIBLE customer service! Never staying at this Hilton again & their Management skills need some serious improvement!", "Date": "February 24, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Philadelphia, PA", "Title": "“A very good airport hotel”", "Author": "Dave's_reviews", "ReviewID": "UR93673802", "Content": "If you're a gold member in the Hilton loyalty program, you get free breakfast when you stay at a Hilton Garden Inn. This generally makes these properties a good value choice, and this Phoenix Airport location is no exception. The hotel is conveniently located to the airport, and particularly convenient to the off-site car rental center. Rooms are a little unusual for the chain, in that they all have kitchenettes and a separate 1-bed bedroom -- kind of like an extended stay hotel. This makes the property a little better for solo travellers and couples instead of families, as the only other bed is a fold out couch in the living room. Furnishings in the hotel are attractive, the rooms each have 2 flat screen TVs, and the pool area is above-average for an airport hotel. I wasn't crazy about the beds (there's a knob to adjust their firmness), but I didn't find them terrible, either. Breakfast was very good, with cooked-to-order omelettes, eggs, pancakes, etc., and also a buffet bar with bacon, fruit, potatoes, etc. A restaurant-quality meal.", "Date": "January 18, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Southern California", "Title": "“Really, Really Nice Rooms & Stay -- Very Comfortable, Clean, Affordable and Convenient”", "Author": "MomTraveler_11", "ReviewID": "UR92489644", "Content": "My children, husband, dad and myself stayed here after staying several days at a resort in Phoenix because we needed to be close to the airport for departure. I was very pleased and actually liked the stay here far better than the resort because the rooms here are spacious with beautiful wide-screen television, mini bars and sinks in the commons areas and a spa/jacuzzi tub. The ice maker was right down the hall and they had a nice convenience/snack area in the front lobby so the kids could get goodies. All those things really make a difference when you're traveling. The staff was very nice...brought our luggage in immediately. There was ample parking. The breakfast was very nice and made-to-order omelettes. We heard no noise from the airport at all. This hotel is a hop, skip and jump from Awatukee and only 10-15 minutes from Sun Lakes where other family lives. Plus, easy access to downtown/historic area and museums. It's a treat when you can find an affordable find like this with such quality. We are sure to stay here again because each and every one of us really enjoyed the stay.", "Date": "January 10, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "2.0", "Value": "3", "Sleep Quality": "3", "Rooms": "2", "Location": "1"}, "AuthorLocation": "Tustin", "Title": "“Unlike everybody else we had a terrible experience”", "Author": "DebbieKTustin", "ReviewID": "UR89174846", "Content": "If you park your car in this hotel, BE CAREFUL! You will have to park near the front lobby to be safe. We had a terrible experience. A thief siphoned our gasoline COMPLETELY (a full tank) out of our car gas tank. He cut the filler hose to the tank so we could not refill it. The manager was nice to lend us a DUCT tape so my husband can tape the filler hose together so we can go home to California. My husband made it work but the experience dampened our stay there for 3 nights. On top of that , we had a terrible experience during our 1st night. We were assigned to a room near the elevator. All night long, we could hear the elevator going up and down and we slept poorly. The bed was good but the sound was bothering us. I don't know why anyone was assigned to that room at all. We should have asked for them to move us in the middle of the night but we didn't want to repack our stuff in the middle of the night. They moved us to a room in the corner (end of the hotel). The room was just ok but the bed was terrible. In the beginning of the night it was firm but by morning, my side sank down like it had a leak or something. We parked our car at this end and I think it was a mistake. I wanted to give 1 star but the service from front desk was great in helping us to recover our bad experience. Also, the room was clean and nice (despite the bed). It is not the hotel's fault that a thief stole our gasoline so I gave a 2 stars. But overall experience was so bad that I can't give more stars. The hotel should provide more security and install a security camera in the premises. The gasoline that was stolen costs us $60 but to fix the hose, it costs us $160. It was the worst driving vacation for us.", "Date": "December 6, 2010"}, {"Ratings": {"Service": "2", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Wyoming", "Title": "“Park & Fly is a great option for travelers”", "Author": "GirlOutWest", "ReviewID": "UR87549164", "Content": "If you're parking for up to 2 weeks while flying out of PHX, it's free with a single night's stay, well worth the money. Free shuttle to airport was good, the pickup was sloooooow, 30-45 minutes. They advertise a taxi for around 10 bucks, next time I'd rather pay a little and not have to spend so long in a smoggy area buzzing with vehicles. The room was okay, not up to par with expectations. No special Hilton Honors welcome or anything. Room service was nice, food was okay. Waffle House restaurant adjacent to this hotel was just awful. But the value is good if parking is needed. Staff was pleasant, room and grounds were clean and well maintained.", "Date": "November 18, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "3", "Overall": "3.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "3"}, "AuthorLocation": "San Francisco, California", "Title": "“More than adequate”", "Author": "Not-the-talc", "ReviewID": "UR87087005", "Content": "First impressions, it looked rather dowdy and shabby; the carpets have seen better days; the color scheme of all browns and low lighting contributed to this. Redeeming features were very helpful and friendly staff, excellent towels and toiletries, and a good restaurant (there was nowhere else to go in walking distance). The pool area for a hotel of its size was large, private and well supplied with chairs and towels. We prefer the housekeeping and maintenance to be \"behind the scenes\", but the doors to all these areas were left open to view. The 24 hours business center was well-equipped and we could send output to the printer from our room with a secure code to print out when we went down. Overall, OK as a place to stay near Sky Harbor Airport.", "Date": "November 14, 2010"}, {"Ratings": {"Service": "2", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Mississauga, Canada", "Title": "“Perhaps we were unlucky.”", "Author": "Oatlander", "ReviewID": "UR83884020", "Content": "Called hotel from airport to request shuttle. After waiting 20 minutes and no shuttle,,, called again. Told that the battery in the shuttle had failed and asked to order taxi, which hotel paid for. Hotel room spacious and comfortable. Went to arrange early morning call and shuttle to airport but desk clerk kept picking up phone calls when I was talking to him until I got angry. Had meal in restaurant. Steak was OK but served with about a half pound of boiled carrots! My wife's Cobb Salad was good apart from the canned olives! Conrad, I think you would have been disappointed.", "Date": "October 18, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "3.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Montreal", "Title": "“Your Typical HGI”", "Author": "kabecker", "ReviewID": "UR83477226", "Content": "I stayed here for one night due to easy access to the airport. The hotel is located about a 10 minute drive from PHX. The rooms at the property were actually quite spacious and were clean. The hallway on the 3rd floor going to my room was a bit banged up. The air conditioning was quite noisy coming on and off all night and noises from the hallways were audible but didnt necessarily disturb me. The TV's are still the 10-15 year old tube-sets so it would be nice to see flat screens here. The service at the hotel was very good. I needed to return my rental car at 9PM and they came very fast to pick me up and return me to the airport. In the morning, the shuttle to the airport ran right on time and the gentleman driving us was very friendly and prompt. The coffee at the hotel was disgusting. But the hotel served its purpose as providing a comfortable accomondation to sleep at the night before a flight.", "Date": "October 14, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Toledo, Iowa", "Title": "“Nice, Comfortable Hotel”", "Author": "scottkevin2007", "ReviewID": "UR83385014", "Content": "Hotel has the warmth that alot of guests desire when traveling. Wonderful breakfast. Pleasant staff. Beds adjust to your comfort zone. And back of hotel has an amazing view of the mountains. Overall very nice place to stay.", "Date": "October 13, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Redwood City, California", "Title": "“Everything I needed to be fresh and prepared for my interview!”", "Author": "LaTchatch", "ReviewID": "UR81400588", "Content": "Great soft and plush bed - big room. Very quiet! I didn't get a rental car so I ate at their restaurant and the Blackened Salmon was very good! Took advantage of their shuttle service which helped me to get there from the hotel - that saves $$$. Check-in staff were very helpful and pleasant.", "Date": "September 28, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "5", "Location": "4"}, "AuthorLocation": "", "Title": "“Awesome hotel room for the $ paid.”", "Author": "WandaS_10", "ReviewID": "UR80459947", "Content": "Room was awesome. Very comfortable and clean. Had a refrigerator and microwave in room which I was not expecting. Stayed here at end of week long vacation. It was one of the best rooms we stayed in and the lowest price we paid for a room. I would definitely stay here again if in the area.", "Date": "September 21, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "arlington", "Title": "“Great Value - nice hotel and helpful staff”", "Author": "mjc_travels", "ReviewID": "UR78467747", "Content": "We stayed at the this hotel twice in August. Both times we had the same experience, which was great. The rooms were nice, the breakfast is great. and the staff was helpful. On both stays, I needed to get to the airport to deal with my rental car. They were great about helping me with the shuttle. I highly recommend this hotel.", "Date": "September 6, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "5.0", "Value": "5", "Sleep Quality": "3", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Boise, Idaho", "Title": "“Nice big room, awesome staff”", "Author": "IdahoCoug", "ReviewID": "UR78443042", "Content": "Overnighted here on our way home from Flagstaff. When Dairon picked us up from the airport we inquired about making a trip to In-N-Out in Tempe. He told us it was a little outside the distance he was supposed to go and he still had some pickups to do, but when I told him we didn't have one at home he said he'd talk to Victor at the front desk and when he had a gap between pickups he'd call us and run us over there. About 30 minutes after we checked in they called and took us over for the food we can't get at home! Thanks guys. Breakfast was good and we loved the large room. The only problem was the adjustable bed was not functioning properly and would not change to a firmer setting, but otherwise it was a clean quiet comfortable stay. This is where we'll stay from now on if we're passing through PHX.", "Date": "September 6, 2010"}, {"Ratings": {"Cleanliness": "5", "Overall": "5.0", "Rooms": "5", "Service": "1", "Location": "5"}, "AuthorLocation": "Blagoevgrad, Bulgaria", "Title": "“Just right”", "Author": "ExpertComptable", "ReviewID": "UR78070415", "Content": "NIce welcome, easy parking, restaurant and facilities, everything just right. Room has everything you need and cheerful staff making for an excellent stay - highly recommend", "Date": "September 3, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Chicago, Illinois", "Title": "“Would go out of my way to stay at Hilton Garden Inns in the future”", "Author": "Flat_Earther", "ReviewID": "UR77877340", "Content": "This hotel was an exceptional value. We got a suite with a kitchenette for a very reasonable price. It was so nice to be able to relax on the couch instead of having to sit on beds while watching tv. The room was very clean and well decorated. The man at the front desk was super personable. They had fresh baked cookies available when we arrived. There is a nice snack shop/mini mart closet in the front lobby that is handy for little things you need but don't want to run out and get. We ate at the restaurant. The servers were nice and the food was good. We sat down to eat at 8pm and it really took a long time to get served, and a while to get our food after that. I ordered the scallops, and they were perfectly done.", "Date": "September 1, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Colorado", "Title": "“Excellent Hotel and Felt Safe as Woman Traveling alone at Night”", "Author": "coloradogirl89", "ReviewID": "UR73913412", "Content": "I was a little concerned as a woman traveling alone arriving at night via the airport shuttle but there was absolutely no need to worry. The shuttle driver arrived promtly and was very friendly. The room was very spacious and clean and room service was quick and tasty. I would definately recommend this hotel as a perfect overnight when traveling in and out of Phoenix airport.", "Date": "August 5, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "3.0", "Value": "4", "Sleep Quality": "3", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Holte, Denmark", "Title": "“Cheap (compared to Denmark) but not THAT good service...”", "Author": "supertraveller_dk", "ReviewID": "UR73706359", "Content": "I choose the hotel because of the location near the airport - but mainly because it got pretty high scores on service. Unfortunately, the most important employee - a woman in the reception - was really lazy. She could smile - and that was about it. My business partner and I asked for help with car rental, buying a present for a client and a few other things - and her only help was: \"Try Google...\" If I were her boss, she'd be OUT of the hotel right now. This is not Hilton standard, I think. Apart form the lazy woman the hotel was nice - keep in mind that the price was less than half of an equivalent Danish hotel. The air condition was NOISY, as other guest reviews states - not enough to keep me awake - but enough to keep mw from booking this hotel again. All other staff members - especially the gentlemen who prepared breakfast on demand was very nice, and attentive. Also the waiters in the restaurant at evenings were just SUPERB. Good joob, guys. The location is in a commercial district - but very nice with palm trees and green grass all around. Very close to PHX and freeways - and quiet (not including the aircon) Rooms were fine - small suites with sofa, small kitchen, office space, free wifi, tv's etc. The beds were a bit on the soft side - very American I guess - but comfortable. Cleaning was a \"10\" - as were the housekeeping - smiling and polite. Pool area: Uninspiring - and very small pool - but it was there! All in all: A good hotel if the got rid of the lazy woman and invested in new and modern air condition systems...", "Date": "August 4, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Washington DC, District of Columbia", "Title": "“Exceptional staff that took care of all my needs”", "Author": "sfink007", "ReviewID": "UR72642896", "Content": "The restaraunt staff did a wonderfull job as well as the front desk staff. I was very impressed by the entire team and would recommend staying here for anyone traveling for business or personal reasons.", "Date": "July 27, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Denver, Colorado", "Title": "“The most comfortable hotel in my western large territory.”", "Author": "lauraandtaylor", "ReviewID": "UR72477192", "Content": "I have been staying at this location monthly for 3 years. The staff is friendly, competent and there has been no turnover during this timeframe. Comfortable to me means: smiling face, greeting my name, good food, convenient location and parking, attention to details.", "Date": "July 26, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "mountain view, ca", "Title": "“Excellent hotel property, excellent rooms and excellent service!!!”", "Author": "traveler10111", "ReviewID": "UR70042783", "Content": "I stayed at the Hilton Garden Inn at the Phoenix Airport for a last minute trip to phoenix on business and was very pleasantly surprised. It is nearby the airport, they offer shuttle service to and from the airport. I stayed in a suite and the suite has the best beds ever!!! Comparable to the Westin Heavenly Beds. The beds in the suite had a tempurpedic mattress feel and it even has levers so that you can control the firmness/softness of the bed. The hotel itself has a good restaurant/bar and pool outside was very nice! The front desk staff was very friendly and accomodating. They even remember your name and always refer to you as Mr. or Mrs., that was a great touch, almost felt like staying at a Ritz Calrton!! Overall it is a great property to stay at whether you are there for business or pleasure. I will definately want to go back and stay there again!!!!", "Date": "July 7, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Virginia", "Title": "“Very good, though what's with the A/C?”", "Author": "Adam20191", "ReviewID": "UR69694049", "Content": "I liked the king suite layout; small rooms, but better than the usual rectangular box. In-house restaurant provided good late night snack service, though the Waffle House next door does a better breakfast. My only real complaint was the air conditioning. Admittedly, the high temperature during my stay was about 110 degrees, but my room's A/C unit couldn't get the only cooled to about 75, while the hallways and stairways didn't seems to have any air flow at all.", "Date": "July 4, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Cape Breton Island, Canada", "Title": "“much more than expected”", "Author": "1100Aero", "ReviewID": "UR68468904", "Content": "My only mistake was not staying longer at this hotel. We traveled and stayed at several motels and hotels and the Airport Garden Inn was the best.", "Date": "June 23, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Tucson, Arizona", "Title": "“HGI Phoenix Airport is great hotel with a great location”", "Author": "AZDennis2", "ReviewID": "UR68136995", "Content": "The staff are always friendly and the hotel is always clean, I have stayed at this hotel many times and it has always been great. I travel to Phoenix often and this is always my first choice.", "Date": "June 21, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Palatka, Florida", "Title": "“Excellent facilities. Comfortable bed. Friendly staff!”", "Author": "Alford_DT", "ReviewID": "UR66551157", "Content": "I recently traveled from California to Florida with my daughter who is being relocated in the Navy. Obviously, we stayed several nights on the road. The Hilton Garden Inn-Phoenix Airport was my favorite along the way. The price was reasonable. The facility was outstanding and the bed was inordinately comfortable!", "Date": "June 5, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "2", "Rooms": "4", "Location": "4"}, "AuthorLocation": "hawaii", "Title": "“Kitchen is a Great Amenity - Air Conditioner is LOUD!”", "Author": "erune", "ReviewID": "UR66109649", "Content": "Stayed here for two nights in May with my young children, ages 2 and 4. The suite is equipped with a mini kitchen, which made it easy to store food and reheat food whenever the kiddies were hungry. Location is close to the airport and there is a Waffle House open 24 hours just steps from the front of the hotel. Staff at the restaurant was outstanding and friendly...something that can make a world of difference! Only thing that could be a downfall was the air conditioning unit. It doesn't run constantly at a slight hum....it turns off then turns out for about 10 minutes with a pretty loud sound. I would wake up on occasion when the ac unit would go back on. And if you're in the path of the ac unit, it'll be warm...cold...warm...cold. Otherwise, it's a decent choice for a clean hotel with a free shuttle.", "Date": "June 2, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Boston, Massachusetts", "Title": "“HAPPY HILTON”", "Author": "BOSTONTRAVELLER55", "ReviewID": "UR63329416", "Content": "Pleasant surprise after a long week of travel. Located near Sky Harbor Airport and a short distance off !-10. Staff was cheerful and attentive. We enjoyed the small restaurant/lounge on our arrival and the omelet bar for breakfast. Room was pleasantly appointed, clean, comfortable and quiet! Great hotel!", "Date": "May 5, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Kennewick, wa", "Title": "“Nice Hotel - do not let the poor reviews discourage you”", "Author": "willshawna", "ReviewID": "UR62015186", "Content": "My husband and I were traveling though the Phoenix airport to Mexico, we stayed at the HGI when we arrived and when we left. When we arrived at the hotel it was via the freeway and I could not understand the reviews of the \"poor / dicey neighborhood\", it looked nice to us, it looked like a business park and another hotel was across the street. The next day we left the hotel and drove away from the freeway on the city streets and we said \"ah ha\" a few miles away, past the business park, there were a few \"Men's Clubs\" but it was not scary and I did not feel it effected the hotel neighborhood at all. The hotel is very close to the airport (10 minutes) but you can not hear it at all. The rooms were nice, we like having the kitchenette and sitting area. The rooms were clean, great beds and nice linens. Both rooms showed a little wear here and there, yes the A/C was a little loud, but we would stay there again in a minute. The business center was very nice I was able to print out our boarding passed for our flight out. The hotel airport shuttle service was every half hour, we had to leave at 4:30 AM and it was right on time.", "Date": "April 20, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Durango", "Title": "“A winner”", "Author": "shellbee22", "ReviewID": "UR60908068", "Content": "With its suite like rooms and beautiful pool, it doesn't seem like an airport hotel. Kind of makes you want to stay. Great staff, breakfast and rooms. We got a great rate and the hotel provided taxi service (at their expense) for those who have flights at ungodly hours of the night. Would definitely stay again", "Date": "April 10, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Floyd, VA", "Title": "“Great for the business traveller, and others....”", "Author": "jolisart", "ReviewID": "UR60858281", "Content": "I booked this hotel based on the reviews from this website. Everything was true. Very professional, courteous, helpful staff. Attentive. The room (I booked a king suite) was very comfortable. The bed, bath, etc, was great. The towels were big and fluffy.....an uncommon thing for a hotel in this price range. The food was hot and tasty, the pool a very nice respite, and the staff throughout was great. The housekeeping of the room during the day was also great. They paid attention to cleanliness and making things straight. The ONLY complaint I could mention would be the somewhat noisy air conditioning system in the room. It WAS pretty loud. But, given the time I visited, it wasn't on that much. As for location, central location to many places, but not a place for families, necessarily. But a GREAT location for the business traveler.", "Date": "April 9, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "San Francisco", "Title": "“Favorite Business Hotel -- And Best Breakfast”", "Author": "visitmae", "ReviewID": "UR60109134", "Content": "My new favorite hotel to stay in when travelling to Phoenix for work. The business breakfast comes with a chef who makes you whatever you want. So much more awesome than the traditional continental breakfast stale muffins found elsewhere. Beds are great. Rooms are big. Highly recommended.", "Date": "April 1, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Massachusetts", "Title": "“Hilton Garden Inn Phoenix Airport-I felt like I was at a spa!”", "Author": "sailjomassachusetts", "ReviewID": "UR59948194", "Content": "I recently spent two nights at the Hilton Garden Inn and would highly recommend it. The staff was professional, helpful and very friendly. The food was excellent. The room had a very comfortable bed, small kitchen area, was extremely clean. I couldn't have asked for more. The pool area was a plus. Quiet, relaxing and once again, very clean. Free internet was appreciated, as was the business center (great for printing up boarding passes). The fitness center had up to date equipment. The free airport shuttle was quick, our driver extremely friendly.", "Date": "March 30, 2010"}, {"Ratings": {"Service": "2", "Cleanliness": "5", "Overall": "3.0", "Value": "5", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Eureka, California", "Title": "“Disappointed in HGI”", "Author": "Eureka24", "ReviewID": "UR59021319", "Content": "We stay at HGI's whenever possible and have found them to be of excellent quality. We arrived in Phoenix two days earlier than expected, having to pick up our daughters at the airport we decided to stay at the airport HGI. The room was up to our expectations and we decided to go to the Happy Hour for appetizers. The food was very good. The service was very poor. We waited for a server to take our order. We asked what were the appetizers available for Happy Hour and she showed us the appetizers on the full menu rather than the bar menu which had a wider variety. We had ordered an entree to take to the room. When we finished an appetizer we waited for 20 minutes for her to return. We asked for a box and our bill. She did not come around for another 20 minutes. We asked the other servers to assist us and all they said was they would tell our server we need assistance. When she brought the bill she did not have our entree and had not turned in the ticket to the kitchen. We cancelled the entree and found we were charged full price for the half price appetizer we did have. It took another 15 minutes to get a correct bill. Tonight, we thought we would give it a second try as anyone can have an off day. Tonight we were served in a reasonable time and the server checked on us once. We had to ask for a box and for a bill. The bill again did not reflect the half off prices. Tonight it took more than 10 minutes to correct the error. If we were in a hurry we would have been very upset not just aggravated. The only difficulty we had with the room was the refrigerator made a humming noise, finally we had to move it to get it balanced. The noise stopped but the unit was off balance and \"walking\" its way out of its area. The rest of our stay was what we expect from HGI's. This is a fairly new hotel and hopefully they are working out the kinks. No WiFi a draw back of HGI's", "Date": "March 19, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "5.0", "Value": "5", "Sleep Quality": "3", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Irvine, California", "Title": "“Wow - unexpected find”", "Author": "seekwa", "ReviewID": "UR58458914", "Content": "I stay in a lot of Hilton Garden Inn's and this location is a surprising treasure. Who would think an airport hotel could be so nice? Warm and welcoming staff, comfortable lobby and small, kind of intimate dining area, are two things I can point out. But the rest is a bit intangible and elusive in terms of what makes this hotel so nice. Anyway, keep in mind it is an airport hotel with respect to your daytime plans, but also keep in mind that you will barely even know an airport is nearby. 5 stars in my book.", "Date": "March 13, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Salt Lake City", "Title": "“A real gem”", "Author": "PG32", "ReviewID": "UR56544202", "Content": "Huge fan of this property. It is perfectly located for business travelers. The rooms are comfortable. The staff are attentive. The gym is decent. Highly recommended for road warriors. Enjoy your stay.", "Date": "February 19, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "3.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Honolulu", "Title": "“Good, but not great”", "Author": "Bueller555", "ReviewID": "UR56204795", "Content": "Pros: - Shuttle to and from the airport leaving every half hour - Very nice front desk staff - Free parking - Free wifi and business center - Clean room and very comfortable bed - Waffle House a 1 minute walk away. 24 hours with good, inexpensive breakfasts. Cons: - Ventilation system was amazingly loud. Had to turn off the system to get some sleep. - Room overlooking the pool was also loud. Pumps at the pool run constantly. - Water pressure in the shower was awful. While it's a good business-oriented hotel, I don't know if it deserves such a high Trip Advisor rating. If it was the summer, the loud a/c system would cause me to avoid the hotel.", "Date": "February 17, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "VT", "Title": "“Service Couldn't Have Been Better”", "Author": "VTLongTimeTraveler", "ReviewID": "UR54578307", "Content": "From the hustle of the van driver to the helpfulness of the front desk staff, the service on this stay was outstanding. The room was a suite that was very nicely laid out. The only negative was the noisy venitlation system.", "Date": "January 28, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "3", "Rooms": "5"}, "AuthorLocation": "London", "Title": "“Friendly, Clean and Incredible Value.”", "Author": "Wokoki", "ReviewID": "UR52134936", "Content": "I was simply looking for a hotel near the airport, and found a little gem of a hotel where I thoroughly enjoyed my time spent there. The front desk staff were always courteous, incredibly friendly and helpful, which was really appreciated as a solo-traveller. The room suite was fantatsic value for money when reserved online and very presentable, packed with facilities such as WIFI connection, and if in a suite there's also a fully equiped kitchen area so when you don't feel up to a restaurant meal downstairs, as well as the room service menu available, you can always buy a microwavable meal from their pantry pavillion instead. Tempe is nearby for shopping, and is home to Arizona State University. There was quite a distance to Tempe from the hotel, but as an added bonus they do offer a free shuttle service to the airport which made the last day's plans a lot easier. I would stay there again.", "Date": "December 29, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Mississippi", "Title": "“Exceptional Hotel - All Around”", "Author": "dragon41", "ReviewID": "UR50807841", "Content": "The Hilton Garden Inn Phoenix Airport is a truely exceptional hotel. The entire staff is dedicated to taking care of the traveler. The food at the restaurant is tasty and the portions nice sized. Rooms are clean, neat, well kept! Nice selection of TV stations. Good variety in the pantry store. Excellent Wi-Fi in both quality of signal as well as speed of internet traffic. Parking was a little thin, but ok. The hotel was close to the airport and within a few minutes of some great dining. Overall, an exceptional hotel that was a joy to visit even for the most traveled business traveler.", "Date": "December 7, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Alaska", "Title": "“Very Nice”", "Author": "aktundraqueen", "ReviewID": "UR50528907", "Content": "I had booked a suite but it wasn't ready when we checked in (we were early) but the room we did get was very nice. I liked the size, the lay out and the bed was very comfortable. We missed the sun at the pool, however the hot tub was very nice. We ate dinner at the on sight resturaunt and it was good food and very enjoyable and relazing.", "Date": "December 2, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Rothesay, NB", "Title": "“Highly recommended!”", "Author": "RothesayGirl", "ReviewID": "UR50130696", "Content": "My husband and I travelled to Phoenix from Atlantic Canada and arrived after a long travel dayl. We can't say enough about the service we received here, from the front desk manager, Bill, to the shuttle driver, Matt, the housekeeping staff, and the lounge/dining staff. We were travelling with friends, who arrived much later than us, and Bill ensured the shuttle arrived promptly for our friends at the airport, as they had a 20 hour travel day, and they were taken care of quckly when they arrived at the hotel. The fitness room had excellent equipment, and we really enjoyed the wonderful suites. My only regret is that we didn't stay longer. We headed to Sedona for the remainder of our trip. But we did drop by again a few days later to collect a coat that had been left behind, and were greeted warmly by staff again. Defintely will stay there again.", "Date": "November 26, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Dallas, Texas", "Title": "“Does Not Disappoint”", "Author": "Highpocketsagain", "ReviewID": "UR49808346", "Content": "Lovely grounds, cute, cozy breakfast room! Everything was what you'd expect for a HGI. We had a taste for bar-be-que. The front desk recommended Honey Bear. Coming from Texas I'd have to say it was \"decent\" bar-be-que...will do in a pinch.", "Date": "November 22, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Connecticut", "Title": "“Great Hotel!!”", "Author": "ConnecticutMrsE", "ReviewID": "UR49509337", "Content": "We were in AZ for a reunion in Tucson. After flying into Phoenix, we spent our first night in AZ at this hotel before picking up our rental car and continuing down to Tucson. The hotel was an excellent choice - although it is the Hilton Garden Inn at the Phoenix Airport, noise is NOT an issue. The rront desk personnel, the shuttle drivers and the breakfast crew (cook and servers) were terrific. I would encourage anyone to stay here ... it was clean, roomy and quiet,", "Date": "November 18, 2009"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "Lima, Ohio", "Title": "“Convenient and pleasant”", "Author": "MommaKitty9", "ReviewID": "UR48431381", "Content": "We stayed here in Phoenix just one night in order to catch an early morning flight out after being farther north in Sedona for a week. Nothing to complain about here! All very nice and very friendly. Shuttles run every half hour to and from the airport.", "Date": "November 3, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "San Jose, California", "Title": "“Clean and convenient”", "Author": "jpacclarent", "ReviewID": "UR43855150", "Content": "Large room, quiet. Able to relax and focus on business at the same time.", "Date": "September 23, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "England", "Title": "“Very good value.”", "Author": "angelaki", "ReviewID": "UR39142976", "Content": "We stayed here for one night in advance of a 9am flight out of Phoenix. Even though we arrived at about 9pm, the reception staff were friendly and welcoming. We were given a room on the ground floor which made it easy to maneuver suitcases. The room was a pleasant surprise - kitchen, desk, sofa, armchair, two tvs, it was a shame we were only there for a brief stay! It was clean and there were plenty of towels and lovely toiletries. We used the business centre to check on for our flight and print off boarding cards and this saved us lots of time at the airport the following morning. The bed was amazingly comfortable and my partner would have taken the pillows he used with him had he been less honest! We ate at the Waffle House that is just across the car park, and whilst it had an interesting clientele, it was definitely handy. Checkout was easy and the front desk were able to direct us to a petrol (gas) station so we could fill up our rental car.", "Date": "August 29, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Location": "3", "Rooms": "4"}, "AuthorLocation": "New York", "Title": "“One of my nicest stays in Phoenix”", "Author": "agostjo", "ReviewID": "UR31792554", "Content": "The Hilton Garden is close to the airport, has a shuttle to/from airport that makes the stay convenient. The front desk staff was \"top notch\", as were the shuttle drivers who were pleasant and friendly. The hotel is clean, beautiful pool and restaurant. There is a waffle house on the property. My only \"complaint\" is that the hotel property is isolated from any stores, so it is necessary to have a car, or the shuttle is more than happy to drive you within in a certain distance. All and all it was one of the nicest stays in the Phoenix area, and a property that I will frequent again.", "Date": "June 7, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Portland, Oregon", "Title": "“Great Place”", "Author": "Greentree32", "ReviewID": "UR31778084", "Content": "Excellent service staff. Great buffet breakfast. Clean room. Nicely decorated.", "Date": "June 7, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Business service (e.g., internet access)": "2", "Check in / front desk": "4", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Colorado Springs", "Title": "“Very pleasant staff”", "Author": "COLadyRoadWarrior", "ReviewID": "UR19875958", "Content": "My first impression of this hotel was one of friendly, competent staff. I called upon arriving at Phoenix Sky Harbor Airport to inquire about the shuttle schedule and the availability of my room for early check in. The staff member on the phone answered my inquiries in a friendly, efficient and professional manner. Even the shuttle van drivers are friendly and seem to be looking out for the well-being of their guests. Upon arrival to the hotel, I was greeted promptly by smiling desk clerks greeting me by title & name. My room was ready as requested, despite the fact that I arrived late-morning. My mini-suite was well-appointed and clean and it was located, as requested, away from elevators, stairwells and other high-traffic areas. The only downsides to my stay were: a) Painfully slow Wi-Fi b) Small (standard 12-passenger) shuttle vans that are difficult for some adults to get in to and out of and c) the seedy part of town the shuttle vans must traverse to get visitors from the airport to the hotel and back.", "Date": "September 8, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Southern California", "Title": "“Great Location and Great Value”", "Author": "heumanntouch", "ReviewID": "UR18581863", "Content": "I recently stayed here and it is probably the best hotel I have encountered in the Phoenix Area. Now if you are doing business on the West end of town this maybe a little challenging but if you have business either downtown, Chandler, or Tempe; this hotel offers a great value and great location. The rooms are a little cramped but you wind up with a separate bedroom and kitchen/Front room. I don't know what the individual was talking about being loud on the highway side as you would have to have superman's hearing to hear the highway. The insulation must be great because I did not hear a thing, including activity in the hall, the only time I heard someone was when they slammed the door. The breakfast was great and was cooked to order it is not free but you can get a deal that includes it in the price. I was so impressed with this location that I will be staying here again.", "Date": "August 3, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Check in / front desk": "4", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Jacksonville, Florida", "Title": "“Nice, Clean Hotel”", "Author": "Mikwitt", "ReviewID": "UR17025507", "Content": "This was a very clean, nice hotel. My room on the third floor was renovated with a flat screen TV and a new bed. This hotel looked brand new. The outdoor area wasn't resort like, however the large pool was much nicer than your standard pool. The airport was also very close by. Overall, nicer than I expected.", "Date": "June 18, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Business service (e.g., internet access)": "4", "Check in / front desk": "4", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Malvern, Pennsylvania", "Title": "“Great location, rooms redone, loud on highway side....”", "Author": "EduardTravels", "ReviewID": "UR15882842", "Content": "This HGI is very close to the airport. My room was recently updated with nice work area, flat screen TV, kitchenette, new bedding.... very nice. Room service was great - I asked for something a little different than was on the menu (shrimp instead of chicken with my pasta) and it was no problem. Water pressure was a tad low in the morning. I had an even numbered room and heard quite a bit of traffic noise through the night. Even with that, wouldn't hesitate to stay here again.", "Date": "May 10, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Check in / front desk": "4", "Overall": "3.0", "Value": "3", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Vienna, Virginia", "Title": "“Nice room, good service, not a particularly great bargain”", "Author": "GaryKarr", "ReviewID": "UR14200076", "Content": "The rooms here are quite nice and large and the location near the airport is obviously the main attraction. But I am not sure it's worth $160 a night, which is what I paid for a Sunday night in March. The whirlpool when I was there was out, though a sign said I could use the one next door at the Holiday Inn Express. They have an airport shuttle that runs every 30 minutes starting at 4 a.m. There is a full-service restaurant in the hotel, including a bar. The rooms have very nice erg chairs and desk, a microwave and a refrigerator. My room also had a flat screen television, but it did not appear to have high-def channels accessible. A definite step up from a Hampton Inn, my usual choice of hotel in this general service-and-price range.", "Date": "March 10, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Business service (e.g., internet access)": "3", "Check in / front desk": "3", "Overall": "3.0", "Value": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Charlottesville, Virginia", "Title": "“Good Stay, Despite Bumps in the Road”", "Author": "caneshockey31", "ReviewID": "UR8374142", "Content": "OKay, now yes granted the hotel is nicely located only a mile from the airport. There is another hotel right next to the Hilton Garden Inn and a Waffle House right out the front door to the Hotel. The Pool Area is Nice, Despite some cracking along the pool water area. A good size fitness center and a nice restaurant staff. However, here are the bumps in the road. I came in on 6th of August and tried to check-in however no rooms were available so i asked the Front Desk since i'm a Gold VIP that i would like an upgradeable room if available. I was told they were sold out for the night. So, i decided to check the hotel website to see if they really were. To my dismay, the hotel had a number of different rooms available for the night. So i had to cancel my original reservation and rebook at a higher rate for a better room than what i would of had. I stayed in Room 226 a One-Bedroom Suite a nice room, however turning on lights in the bedroom can be quite tricky and they had to come exchange one of my lights since it wasn't working right. Check-Out was a breeze and directions given were great. Though, i probably wouldn't stay at this hotel again.", "Date": "August 8, 2007"}, {"Ratings": {"Cleanliness": "4", "Check in / front desk": "5", "Overall": "1.0", "Value": "1", "Rooms": "4", "Location": "2"}, "AuthorLocation": "Yardley PA", "Title": "“sleepless in Phoenix”", "Author": "travelalotPA", "ReviewID": "UR7368331", "Content": "I have been a fan of Hilton Garden Inns so booked a night here before flying out the next morning. Even though I am a Hilton Honors Silver I seem to have been given the worst possible room in terms of location. The room itself was nicely designed and decorated. The staff was very friendly. However we were on the first floor within 25 feet of a Waffle House restaurant. All night long there were motorcyles revving their engines. Also we could hear extremely loud hip hop and rap music from the cars that were pulling into the Waffle House all night. We travel often and this was without question the most sleepless night we have ever spent in any hotel the world over! Also there was water leaking through the recessed light fixture over the tub at 3am when the person in the room above took a shower. This was in room 104. I think this room never should have been assigned as this is a definite hazard. Overall a nicely decorated and friendly hotel, but not a place to get a good night's sleep!!!", "Date": "April 16, 2007"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "LA", "Title": "“Great Hotel and Close To The Airport”", "Author": "LA_Paul", "ReviewID": "UR7272195", "Content": "Traveling to Phoenix on business I always try to stay near the airport and I-10...the Hilton Garden Inn is close to both. Great rooms, very spacious with a small kitchen (small refrigerator, sink and toaster), living room area and separate bathroom (there is a door). There are a couple hotels near this property, but this one always seems to have a good price for the room. There is a Waffle House in front of the hotel, which is, well, a Waffle House. If you go over the interstate heading south, there is a McDonald's on the right. If you are looking for a few more dining options, head over the interstate then left on Broadway and head to Tempe/ASU.", "Date": "April 3, 2007"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Business service (e.g., internet access)": "4", "Check in / front desk": "2", "Overall": "1.0", "Value": "1", "Rooms": "1", "Location": "3"}, "AuthorLocation": "wiscasset", "Title": "“Hilton Garden Inn Dirty Dingy”", "Author": "A55", "ReviewID": "UR6003458", "Content": "I booked a king size room from a AAA review, staying at this property for one night prior to a fllight. Upon arrival we were given a room on the second floor, the hallway,carpeting and elevator was showing signs of age. Upon entering the room we noticed the air-conditioning was not working, the front desk was prompt in reassigning us to another room. This room was showing wear and tear. The carpeting was dirty as were the drapes and windows. Upon retiring for the night, when we turned down the sheets both the bottom and top sheet were DIRTY. The front desk sent up another sheet (which was rumpled and dingy). When we cheked out the front desk just shrugged and said \"sorry 'bout that\" When we asked to speak to the Manager I was told he was not available. Please beware if you book a room here, It is not up to Hilton standards. AAA should reevaluate it's rating.", "Date": "October 23, 2006"}, {"Ratings": {"Cleanliness": "4", "Overall": "4.0", "Value": "3", "Service": "4", "Rooms": "4"}, "AuthorLocation": "New Hampshire", "Title": "“Easy to find and enjoyable to stay”", "Author": "A TripAdvisor Member", "ReviewID": "UR3998319", "Content": "I spent nearly a week at the Garden Inn traveling for business. The hotel was extremely easy to find, only one exit down on I-10 from Sky Harbor Airport and close to ASU and the mall & movie theatre in Tempe. The staff was extremely courteous and personable, as I would expect from a smaller hotel. The restaurant was adequate, I found breakfast to be the best part of dining there at the hotel. The room was clean, well appointed and spacious. They offered both wired and wireless internet access to suit anyone traveling with their laptop. The cost was a bit pricey but I think it's definitely a matter of getting what you pay for.", "Date": "October 6, 2005"}, {"Ratings": {"Overall": "2.0"}, "AuthorLocation": "Cincinnati, OH", "Title": "“Nice, minus the theives”", "Author": "lovelybird46", "ReviewID": "UR3995036", "Content": "Not a bad hotel, nice high speed internet in room, and good shuttle service that will take you to restaurants, ect. Unfortunately I had a watch stolen from my room (with the do not disturb sign on- I did not even get maid service). The management was not at all responsive to this (I guess they hear it all the time.) That is why I cannot rate this hotel higher. I don't like having stuff stolen.", "Date": "October 5, 2005"}, {"Ratings": {"Cleanliness": "4", "Overall": "5.0", "Value": "5", "Service": "4", "Rooms": "4"}, "AuthorLocation": "Portland, Maine", "Title": "“Excellent for the price”", "Author": "IronChefNeva", "ReviewID": "UR3234428", "Content": "Excellent for the price. My room had a sitting and kitchen area!! Great for a low-cost weekend stay. The pool, hot tub, and exercise room were clean and well kept. Staff were friendly. I plan to stay here again when I return to the area. The only negative is that the bed was not as comfortable as some of the (much) more expensive hotels I have stayed in, such as the sheraton.", "Date": "February 28, 2005"}], "HotelInfo": {"Name": "Hilton Garden Inn Phoenix Airport", "HotelURL": "/ShowUserReviews-g31310-d223035-Reviews-Hilton_Garden_Inn_Phoenix_Airport-Phoenix_Arizona.html", "Price": "$80 - $191*", "Address": "<address class=\"addressReset\"><span rel=\"v:address\"><span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">3422 East Elwood</span>, <span class=\"extended-address\">University &amp; I-10</span>, <span class=\"locality\"><span property=\"v:locality\">Phoenix</span>, <span property=\"v:region\">AZ</span> <span property=\"v:postal-code\">85040</span></span> </span></span></address>", "HotelID": "2516162", "ImgURL": "http://media-cdn.tripadvisor.com/media/photo-s/02/42/2f/c5/hotel-exterior.jpg"}}