{"Reviews": [{"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "North Little Rock, Arkansas", "Title": "“Very Nice”", "Author": "slrnlr", "ReviewID": "UR129238758", "Content": "This was my first stay at this property. The room was very clean and comfortable The staff was very pleasant and extremely helpful The location is great - close to everything. This will be my choice for lodging when in Phoenix", "Date": "May 2, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Location": "4", "Rooms": "5"}, "AuthorLocation": "", "Title": "“Nice”", "Author": "mtnairchef", "ReviewID": "UR128142861", "Content": "I stayed here compliments of a priceline deal and was very surprised and pleased with the service, room and location. My girlfriend felt special that it was her first time in a suite. Room was very clean and staff very helpful.", "Date": "April 18, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Santa Barbara", "Title": "“Front Desk First Rate, Very clean/quiet”", "Author": "Dawn B", "ReviewID": "UR127954400", "Content": "This is my second stay at this facility. I love the convenience, staff, and cleanliness of the Candlewood Suites. The rates are phenomenal. I frequent the Phoenix area 3-4 times a year and, on occaison, travel w/my dog. This will be my stay of choice for all future visits to the Phoenix area. The on-site facilities are incredible.", "Date": "April 15, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "3", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Kanab, Utah", "Title": "“Great choice for a long-term stay”", "Author": "Mark F", "ReviewID": "UR127487462", "Content": "I stayed at Candlewood Suites Phoenix for a total of 67 nights in early 2012 in a comfortable and spacious 1-bedroom suite. The property has lots of extras to make your stay great, from the no-cost laundry and business center, to the swimming pool and spa and BBQ area, to the small gym and on-site shopette. The rooms are spotless, well-designed, and comfy, and the staff genuinely does everything they can to assist their guests. Candlewood felt like home my entire stay.", "Date": "April 8, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Claremont, California", "Title": "“A Good Choice”", "Author": "1NascarFan", "ReviewID": "UR126039552", "Content": "Whenever I travel I always look for a Candlewood Suites first. I have never had a bad experience.", "Date": "March 13, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "5.0", "Value": "3", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Sarasota, Florida", "Title": "“Every basic need for decent price.”", "Author": "Corvette87", "ReviewID": "UR125509484", "Content": "We paid top $ 150 night for four nights but it was high season. Able to enjoy smoking suite with really nice space. Full kitchen with all the basics. Seperate bedroom so I can sleep In!! Small living room that enabled us to have two friends to visit. Modern size bath with my favorite- shelves to put all our bath stuff. Checked in on Sunday and clerk was one of the best I have ever dealt with. Helped us to find several places we wanted to go. There is adequate gym and decent pool .I even enjoyed seeing others dogs as I was missing mine. My only complaint we had to leave and go other place our last night in town as they were booked!", "Date": "March 2, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Chino Valley, Arizona, United States", "Title": "“One night Stay”", "Author": "Carol S", "ReviewID": "UR123274297", "Content": "My husband and I only needed to stay in Phx for one night, but the room and hotel were so nice I wish we could have stayed longer! They are just completing a huge remodel, and we were the first to stay in our room. We were very impressed with the kitchen area and bathroom, and the bed was very comfy. Loved the \"hotel cupboard\" which had meals as well as snacks that you purchased on the honor system, and we notied that the new large laundry was free. Everyone was very friendly and helpful! Would definitely recommend to anyone for any stay length/need.", "Date": "January 18, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "3.0", "Value": "4", "Sleep Quality": "4", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Arizona", "Title": "“O.K. Business suites”", "Author": "Jster", "ReviewID": "UR120759712", "Content": "Recently stayed for two days at Candlewood Suites for a business trip. The room was about what you expect. The only real complaints were that the AC unit exuded a cigarette smell (easily cured with a Lysol spray) and some of the television channels were pretty fuzzy. My partner said his TV only received a few channels clearly, but he didn't really watch much. The bathroom floor could use a cleaning with bleach. The hotel as a whole is clean, has an honor-system \"Cupboard\" with snacks, frozen dinners, and drinks that is combined with a free laundry (accesible with the room card), a pool and hot tub, and an exercise room. The location is a bit of a problem as it is on the I17 frontage road. This means that north is the only direction you can go when leaving. To go south, you have to go north and back to the southbound side. The \"Enter\" sign is small and is obscured by landscaping shrubs until you are just at it. However, the hotel has access to the biking trail of a city park, which means that taking a walk for exercise or fresh air is just a matter of walking through the pool area and out a gate. Aside from traffic noise from the Interstate, it was pretty quiet. There are signs up all over announcing a renovation project scheduled to start in December 2011. The kitchenette was clean and had just about everything you might need in this sort of room. Comparing Candlewood to the business suites just south of it, Candlewood is the much better choice.", "Date": "November 18, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "4.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Anytown, USA", "Title": "“Good value and location”", "Author": "M B", "ReviewID": "UR117244707", "Content": "I have stayed at this property a few times during my trips to Phoenix. Location (next to I 17) is a big plus. The front desk staff is helpful. It is moderately priced, especially for extended stay though the property is a bit older. I would recommend this for a no-frills extended business stay, especially for those looking for a kitchen in suite.", "Date": "August 25, 2011"}, {"Ratings": {"Cleanliness": "3", "Sleep Quality": "4", "Overall": "3.0", "Value": "3", "Service": "3"}, "AuthorLocation": "Brampton, Canada", "Title": "“Not perfect”", "Author": "KentuckyColonel", "ReviewID": "UR116311795", "Content": "Handy to I17 and good check-in. Fully equipped kitchen and lots of channels on the TV. However . . . I found the bathtub tiny (could have easily been a little wider and longer . . . lots of space). Also, the bath towels were like burlap!!", "Date": "August 5, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "4.0", "Value": "4"}, "AuthorLocation": "New Berlin, Wisconsin", "Title": "“Surprisingly nice!”", "Author": "oldsville", "ReviewID": "UR113095770", "Content": "Very comfortable clean rooms at a very reasonable price. Have had some not so nice stays near downtown Phoenix but this was quite the opposite. Self contained and convenient to everything.", "Date": "June 13, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "4", "Sleep Quality": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "London, United Kingdom", "Title": "“Excellent customer service”", "Author": "Treborwf", "ReviewID": "UR97357793", "Content": "Stayed here on Superbowl Sunday but due to jet lag fell asleep sometime during the second half (this would have been the first time I've ever watched the Superbowl live). They have an honour system to purchase goods from their little convenience shop which my wife thought was great. Was trying to have a shower in the morning but unfortunately the little pin you pull up to switch from bath to shower came away in my hand. Flight to Vegas looming so no time to have the problem fixed, but I can tell you that having a shower in a few inches of bath water is no mean feat. Obviously mentioned the shower problem on check out & was genuinely not expecting anything in return (probably due to the fact that I was excited about going to Vegas) but was pleasantly surprised when I was offered another room to shower in and a refund of my priority points used to purchase the room – that what I call good customer service.", "Date": "February 20, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "NJ", "Title": "“A decent night's sleep for a decent price”", "Author": "imsavvy1", "ReviewID": "UR73522131", "Content": "Stayed here one night after traveling (by air) all day. Front desk was super helpful in recommending places to eat (for dinner that night and breakfast the next day). Room itself was large with kitchenette (kitchen cabinets were a little dated). Hotel is located on the access road which runs parallel to I-17. Although our room was closer to the highway than the center of the building, we didn't have a problem with road noise. This hotel isn't the Ritz but for the price point and value, it worked for us for a good night's sleep. Plenty of dining choices within 1/2 mile of the hotel as well as a well stocked \"grocery\" type room to purchase items from and eat back in your room. PS: Headed northbound (e.g., from the airport) when getting off at the hotel's exit, you'll cross over an intersection then you'll want to be in the far right lane or otherwise you'll end up back on I-17 North!", "Date": "August 3, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Arizona", "Title": "“A Pleasant Surprise”", "Author": "BuddAZ", "ReviewID": "UR61358905", "Content": "My husband and I, and dog stayed here 4/12/10 ... we had never stayed here before and had a wonderful time - we had booked a non-smoking queen bed, with a sofabed, 2 rm suite, which includes a FULL kitchen. All was perfect, especially the friendly staff, who knew our dogs name our entire stay ! Didn't have the opportunity to use the pool area, but it was large and clean looking - one bonus for us was the property is located right next to a park area which was great for dog walking. Altho it is located right on I-17, we were never bothered by any traffic noises. Give it a try !", "Date": "April 14, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Edmonton, Alberta", "Title": "“Phoenix as stopping point between Grand Canyon and LA”", "Author": "Craxiter", "ReviewID": "UR60221523", "Content": "Booked mainly on the basis of a very good Entertainment Card rate and my general loyalty to IC Hotels. I think this is the first time I have stayed in a Candlewood, their \"business travel medium stay\" category. Seems well set up for the business traveler. Lots of services. Nice pool and hot tub in this one. We seem to be getting a bit of I-17 noise and not sure how that will affect sleep. But being near I-17 is part of the advantage of this hotel so all part of the mix.", "Date": "April 3, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Phoenix, AZ", "Title": "“Great Place - Friendly service”", "Author": "JoeTrainer", "ReviewID": "UR32380386", "Content": "The kids had fun, the front desk clerk was great and went out of her way to make our stay the best it could be!", "Date": "June 15, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "3", "Business service (e.g., internet access)": "4", "Check in / front desk": "5", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Birmingham", "Title": "“Great Value - Great Service”", "Author": "EbenezerS", "ReviewID": "UR20091517", "Content": "This was my first experience of Candlewood Suites and I pleased to have stayed here. It was recommended to me by the company which I was contracting for so I wasn't expecting it to be too great. However, the room was clean and comfortable, there was free high speed internet and the small kitchen area was more than sufficient for my needs. Service from the front desk was excellent and nothing was too much trouble - any problems being sorted immediately. I will most definitely stay here again when I'm in Phoenix - unless the company pays for a five star resort!!", "Date": "September 15, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "VA", "Title": "“Very Good Experience”", "Author": "HonestReviewForU", "ReviewID": "UR17100537", "Content": "This was my first time at a Candlewood Suites and it is pretty much Holiday Inn's answer to Marriott's Towne Place. If you like one, you'll probably like the other. As noted, there's no daily maid service (gee, just like home), but there were more than enough towels for three nights. And you can swap them out at the desk if you need replacements. I was upgraded (Priority Club) to a suite with a bedroom which was nice. The suite is large enough, with TVs in both rooms and a DVD/VCR combo in the living room. I borrowed a free movie from the front desk. Bed was comfy. The room also has a full-size refrigerator/freezer, very handy. Unlike Marriott, they don't offer free breakfast here, but you have a coffee maker, microwave and range top, along with a full set of dishes/silverware and a dishwasher. Check-in and out was easy. Everyone was friendly, and they graciously let me stay a bit later so that my computer wouldn't melt in the car (the Internet, by the way, is wired and very good). The location is on the side of I-17, but it was quiet. Didn't use the pool, but it looked clean. Free washing machines were handy, with mini detergent boxes available for purchase. I left before the Wed. night pizza party, but it sounded nice. One thing -- they have one of those sensors that knows when you leave and hikes the room temperature to 77. Yes, it's the wave of the future, and yes, they have to save electricity. But when it's 112 outside, it takes longer than the promised 15 minutes to returned to the desired 70. Still, overall, this is a very good choice and I'd go back.", "Date": "June 21, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "4.0", "Value": "4", "Rooms": "5", "Location": "3"}, "AuthorLocation": "Shepherdstown, West Virginia", "Title": "“Good business stay”", "Author": "Zaphod", "ReviewID": "UR7848802", "Content": "This was a great hotel for a four night business stay. The staff were friendly and helpful. I was upgraded to a one-bedroom suite without asking. Housekeeping is not offered on a daily basis, but for a short stay, who really needs it? The room was stocked with plenty of towels, and more were available at the front desk, if needed. The kitchen was handy, especially the full size refrigerator. The selection in \"The Cupboard\" was suprisingly good. The bed and all of the other furniture were comfortable and in great condition. There is a movie lending library at the front desk. Pappadeaux Seafood Restaurant, two doors down, is fantastic, but is the only restaurant within easy walking distance. There are many dining options at the Metro Center Mall. The complimentary Wednesday night barbeque at the hotel was a nice touch.", "Date": "June 14, 2007"}, {"Ratings": {"Overall": "3.0"}, "AuthorLocation": "New Jersey", "Title": "“Candlewood Phoenix”", "Author": "A TripAdvisor Member", "ReviewID": "UR5042689", "Content": "We stayed at this hotel after we landed in Phoenix from New Jersey. Quick check in after a late flight was a pleasant surprise. Quick access out of phoenix the next morning to begin our roadtrip to grand canyon. Would recommend as a hotel at a good price as a stop over to other areas of Arizona.", "Date": "May 8, 2006"}, {"Ratings": {"Cleanliness": "2", "Overall": "1.0", "Value": "2", "Service": "1", "Rooms": "2"}, "AuthorLocation": "las vegas, nv", "Title": "“Not the best experience”", "Author": "doc222", "ReviewID": "UR2842066", "Content": "I was very disappointed with my experience at Candlewood Suites. I paid for a nonsmoking room in advance, but I was placed in a smoking room. When I approached the front desk about the problem, I was informed that it was the hotel's policy and there was nothing that could be done. I asked for a refund and stayed in another hotel in the area. This was fine with me because the rooms at Candlewood were noisy (right next to Black Canyon Hwy), there was no restaurant in the hotel, there were no pay per view movies, and the room wasn't in the best condition. Overall, I was very unimpressed with the hotel and the service I received while I was there.", "Date": "November 23, 2004"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Omaha, NE", "Title": "“The pool was nice”", "Author": "A TripAdvisor Member", "ReviewID": "UR830061", "Content": "My family stayed at this Candlewood for a week and we had a really good experience here. Our kids loved being able to go swimming in the heated pool(when it worked). The staff was extremely helpful when you asked for something and they were very kind. LOVED THE FREE LAUNDRY! And videos you could check-out to your room. We also liked the little convient store that they had. The whole place seemed clean and had a clean smell too.", "Date": "December 31, 2002"}], "HotelInfo": {"Name": "Candlewood Suites Phoenix", "HotelURL": "/ShowUserReviews-g31310-d224733-Reviews-Candlewood_Suites_Phoenix-Phoenix_Arizona.html", "Price": "$66 - $108*", "Address": "<address class=\"addressReset\"><span rel=\"v:address\"><span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">11411 N Black Canyon Highway</span>, <span class=\"locality\"><span property=\"v:locality\">Phoenix</span>, <span property=\"v:region\">AZ</span> <span property=\"v:postal-code\">85029</span></span> </span></span></address>", "HotelID": "2516215", "ImgURL": "http://media-cdn.tripadvisor.com/media/ProviderThumbnails/dirs/a1/88/a188033d6aabc57d1dd08d301e2b99766large.jpg"}}