{"Reviews": [{"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "California", "Title": "“Nice for the price”", "Author": "dramz3", "ReviewID": "UR129174075", "Content": "I stayed three nights at the Royal Palace in Westwood about 3 weeks ago for a weekend course I took through UCLA. I did quite a bit of research before deciding on this property and for the price I was quite pleased. It was a five minute walk to the UCLA extention, which is where my class was located and the location couldn't have been better. There are many dining options in the neighborhood- from swanky to cheep, you have your pick. At first I was disappointed that I was put into the room right next to the front desk; arguably the loudest room in the building, but it turned out to be quite because of an extra pocket door that was installed to create a sound barrier. The room was clean, modern and had all the necessities. This is not the Ritz people- this really is an nice economy choice for people who need the basics at the right price. Parking was free and easy. Maid service was good and efficient. The breakfast was just right- nothing hot, but plenty of cereals, fruit (apples and bannanas) and toast/muffin/pastries to choose from. The internet was spotty, which was probably the most annoying part about the stay. I am headed back in two weeks for the second part of my class and I have already made my reservation to return.", "Date": "May 1, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Bordeaux France", "Title": "“Good value, good position for UCLA”", "Author": "marc57", "ReviewID": "UR129074888", "Content": "We stayed here over the Christmas holidays while visiting our daughter at UCLA. First impressions aren't good, and our room was a bit small, but the bed was comfortable, and it was clean. Great advantage of having FREE parking and FREE wifi. Breakfast wasn't a pleasant experience, with polystyrene plates and cups. Overall however, I'd recommend it as a cheap(ish) hotel for visitors to UCLA.", "Date": "April 30, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Northern Virginia", "Title": "“Really good bargain - clean room, perfect location”", "Author": "Penguin58", "ReviewID": "UR129065811", "Content": "We spent four nights in mid-April in this hotel, while visiting our child at UCLA. The hotel has a perfect location: it is in a very nice area of Westwood - in walking distance to UCLA, to downtown Westwood, nearby restaurants and stores. We stayed in a double queen room (209), which had a little seating area and a kitchenette. It faced a quiet side street/alley. The room was updated and absolutely clean and spotless. The beds were perfect. The hotel serves continental breakfast, which was good, in a small, but adequate dining area. There is free wireless Internet and free parking. (Parking spots are very tight, though, so parking might be a challenge with big cars.) The front desk staff was effective and responsive. The lobby area of the hotel is very small, but there is a little seating patio at the front of the hotel, which is very nice. I think for the price we paid this was a perfect choice to stay. This is not a luxury hotel, but its rooms are comparable with such ones. We will stay here again when we will be back to LA.", "Date": "April 29, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Albany, California", "Title": "“Very nice and good location”", "Author": "BeaMM", "ReviewID": "UR127777079", "Content": "While visiting UCLA campus we stayed at the hotel and loved it. We would have liked to stay another night but it was too expensive for us. The hotel lobby is old-fashioned but our room was wonderful : recently remodeled, spacious, very clean. The bed was very comfortable. Our room was overlooking Tiverton avenue but wasn't noisy at all. Other guests made noise going into their bedroom but otherwise it was quiet. Breakfast is simple but decent : bagels, English muffins, fruit, cereal..The breakfast room is not very pleasant but you could take your breakfast in your room. The location is great: the Hammer museum is across the street,so is Trader Joe's, Rite Aid, CVS pharmacy... The parking spaces in the back alley are definitely tight but there are a few larger spots by the entrance of the hotel.", "Date": "April 12, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Sacramento, California", "Title": "“Comfort and convenience in Westwood, CA”", "Author": "veronicaindonesia", "ReviewID": "UR127345624", "Content": "We always stay in Royal Palace when we're in LA. It's clean and convenient if you want to stay near UCLA. Good rests nearby and free parking for guests. The breakfast is good and if you want more then go to Denny's.", "Date": "April 6, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Denham springs", "Title": "“Wonderful place to stay.”", "Author": "Posted by an Easytobook.com traveler", "ReviewID": "UR125530585", "Content": "I was traveling with my husband for a doctors visit at ucla. Royal palace is clean, personal us friendly and helpful. Breakfast doesn't offer much. Returning in May for surgery Royal Palace is defiantly on my top two to stay at.", "Date": "March 2, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Sleep Quality": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Denver, CO", "Title": "“Far from 5 star, but clean and cost effective”", "Author": "layla317", "ReviewID": "UR124203825", "Content": "Nice to find a clean, cost effective lodging option in the Westwood neighborhood. Rooms were nicer than the lobby and exterior would suggest. Rooms were clean and comfortable. Parking is available. As other reviewers have noted, spaces are very narrow and smaller vehicles are recommended. Did not participate in the breakfast offerings; coffee, tea, toast, cereal and fruit were available. Location is excellent for shops, restaurants, museums, and UCLA.", "Date": "February 6, 2012"}, {"Ratings": {"Cleanliness": "3", "Sleep Quality": "4", "Overall": "3.0", "Rooms": "4", "Location": "4"}, "AuthorLocation": "East Bay, California", "Title": "“Ok once in room”", "Author": "theheatonfamily", "ReviewID": "UR123746785", "Content": "This property must be in a state of renovation. The rooms were upgraded and very comfortable, although our room, 212, was a nonsmoking room that was smoked in - avoid if you want a nonsmoking room! The rest of the property is in need of upgrading. The big plus it that it is very close to UCLA. They offer a continental breakfast and there are restaurants close enough to walk to. If you like museums, the UCLA Hammer Museum is very close also.", "Date": "January 28, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "alexandria, Virginia", "Title": "“Good location and modest room but very cramped parking”", "Author": "erntravels", "ReviewID": "UR120767774", "Content": "This is a modest hotel with a very outdated and off-putting lobby. The parking is extremely cramped and difficult to negotiate on the side and front of the hotel. If you park in the front in the double spaces, you need to leave your keys. The parking spaces on the side are challenging, even for a small car (maybe the Smart car is an exception, but we did not see one.) The room on the third floor in the back was fine, quiet, included a microwave and small fridge, and safe as well as Internet access (Ask for the Internet access UN/PW when you check in.) It would appear that some rooms in the front are larger and have balconies. However, balconies facing the street would seem to have little value to us. Breakfast is some coffee, roll or bagel or English Muffin, banana, and some cereals. The breakfast room is too small. Take the tray from the coffee machine in the room and use it to bring your breakfast back to your room. There is a Denny's right next door if you prefer a better breakfast. There are many restaurants in the area. The hotel is within easy walking distance to UCLA campus, the Hammer Museum, Westwood shops and restaurants, Trader Joes, Ralphs, etc. It is also within 15 minutes (non rush hour) to the Getty Museum and, in the other direction, to the LACMA. Really, the small lobby, breakfast room, and tiny parking spots are the worst parts of this hotel. Otherwise, the location and overall rooms are fine.", "Date": "November 18, 2011"}, {"Ratings": {"Overall": "1.0", "Service": "1"}, "AuthorLocation": "Aiea, Hawaii", "Title": "“horrible service”", "Author": "ajberth", "ReviewID": "UR120179725", "Content": "I made reservations over the phone for a 2 night stay, 11/3/11-11/5/11 for my daughter who had business at UCLA. When she checked in she also stated she would be checking out on Saturday, 11/5/11. I just got a call from her, its now Friday, 11/4/211, at 6:15pm, and the hotel packed up her things and said that room was taken and there was no other room for her! I didn't think it was necessary to get a written confirmation for her 2 night stay. I trusted the person with whom I made the reservation...what a mistake! What kind of hotel leaves a single young woman with no where to stay?", "Date": "November 4, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Pezenas, France", "Title": "“Don't judge a book by its cover”", "Author": "Ortelius", "ReviewID": "UR118368812", "Content": "When we drove up to the Royal Palace we worrried that we had made a mistake booking this place, but decided to reserrve judgment until we went inside....We trust the TripAdvisor reviewers to steer us in the right direction. Check-in was easy & efficient, especially because we had pre-paid via Hotels.com. We took our luggage up to the room & found that we had been upgraded to a suite (I have no idea why, but who cares why?). The suite was recently redone & everything was tastefully decorated. The bed was the most comfortable one I think I've ever slept in. The location is great -- easy access from the freeway & within easy walking distance to tons of restaurants & shops, Only a couple of gripes: at 8:30 on the morning we were going to check out, someone tried to open the door (I think it was Housekeeping); a couple of minutes later the front desk called & asked if we were ready to check out. Huh?! Check out time is noon. Then, at checkout we asked the guy at the front desk where we could finnd a post office & he directed us to a location that does not have a post office, but it is within 1 block of a Mailboxes Etc. Other than those 2 strange things, I would definitely stay at the Royal Palace again.", "Date": "September 20, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "4.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Falls Church, VA", "Title": "“Convenient and surprisingly comfortable”", "Author": "Noni1126", "ReviewID": "UR117906166", "Content": "Despite the extremely unprepossessing closet-size lobby and the hallway carpet that could use renewing, the rooms were spacious, nicely appointed, clean, and very comfortable. The location is very convenient to Westwood and UCLA. The complimentary breakfast is adequate. The staff could not have been more helpful and friendly. Parking and internet access are free. Very near the Flyaway transport to LAX.", "Date": "September 10, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "", "Title": "“Very Nice Accomadation”", "Author": "Dacoo", "ReviewID": "UR115147394", "Content": "This hotel was very nice. The complimentary breakfast 7-11am was an added bonus. There is also a 24 hour Denny's next door if you like that chain. The only negative is if you do not park by 8pm you may get a little headache.", "Date": "July 8, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "4.0", "Value": "4", "Service": "4"}, "AuthorLocation": "San Francisco, California", "Title": "“A big room with a comfortable bed”", "Author": "Brian5900", "ReviewID": "UR115135119", "Content": "I stayed here because of its close proximity to UCLA. Traffic in LA is really bad (especially the 405 freeway) so proximity to where you'd want to go is a must. We reserved a standard room with a king size bed but what we got was like a suite. The living room was big. The room has two TVs plus kitchen and a refrigerator and a microwave. A walk-in closet was equipped with a safe. The bed was extremely comfortable. These positive have more than made up its slow internet connection and so so breakfast (Starbucks and Peets are only one block away).", "Date": "July 7, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "3", "Overall": "2.0", "Value": "1", "Location": "2", "Rooms": "2"}, "AuthorLocation": "", "Title": "“Double the price it should be.”", "Author": "Paulrholmes", "ReviewID": "UR115050958", "Content": "Unless you need to stay at this exact location keep looking - you'll better and cheaper. Key cards repeatedly failing, stale breakfast offerings, car parking so tight I pulled a muscle squeezing out of my car, indifferent weary staff. Overall the actual value was nearer $68 not the $168 I was charged. Buyer beware!", "Date": "July 5, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "4.0", "Value": "5", "Service": "3"}, "AuthorLocation": "Edmonton", "Title": "“Comfortable Stay and Excellent Beds!”", "Author": "Rendar", "ReviewID": "UR114949958", "Content": "I recently stayed at the Royal Palace Westwood and was delightfully surprised by the quality of room they provided. At first glance the exterior, entrance, and hallways suggest that the rooms would be some kind of typical two or three star accommodation. You know what I mean - that dated 90s cabinetry, funky geometric coloured bedding, and mattresses that you could pretend to surf on. Boy was I surprised. I ended up booking here for a few nights while I sorted out housing for a summer course at UCLA. Previously I had been put up at the neighbouring Claremont hotel, which rings in at about half the price as the Royal Palace. The Claremont was full so I went in search of something nearby that wasn't outrageously priced and here I stayed. For $150 a night I received a room that I would put easily on par with something like a Westin or Sheraton. The room was wonderfully appointed (and I assume recently renovated) with fantastic beds. Wow, wow, wow is all I can say. The bed had a fantastic pillow top mattress, crisp white linens, lots of pillows, and a properly firm boudoir pillow that aided a great deal in bedtime studying. The shower head was a tad low but whatever. That's a minor point next to the importance of a good sleep. The only downside of the stay was the service at the front desk. The staff here ranged from indifferent to downright surly. Perhaps they've had to deal with one too many annoying guests over the year but I certainly didn't do anything to ask for attitude (I hope). Despite this they were accommodating in allowing a late checkout while I sorted things out in LA. The 'highspeed' internet was also rather spotty so be ready for access dropping in and out during you stay.", "Date": "July 2, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "4.0", "Value": "5", "Service": "4"}, "AuthorLocation": "Richmond Hill", "Title": "“Excellent hotel and location”", "Author": "RHSCRaider", "ReviewID": "UR112123980", "Content": "The Royal Palace is clean with friendly staff. It has been refurbished with new furniture and TVs They serve all day coffee , juice and fruit. It is in an excellent location, just a short walk from UCLA and it's botanical garden.Within a short walking distance are high quality grocery stores, cafes and restaurants. It is also just minutes by car from Beverly Hills and Hollywood We really like it", "Date": "June 8, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "3", "Overall": "4.0", "Value": "4", "Service": "3"}, "AuthorLocation": "San Diego, California", "Title": "“Good for the price and location”", "Author": "SDTraveler12", "ReviewID": "UR111919712", "Content": "My husband and I are from San Diego (two hours south of L.A.) and wanted a comfortable, affordable base from which to explore Santa Monica/the Getty Center/Westwood/Hollywood, etc. This was it. The upside: The hotel is in a great location in a very walkable little section of Westwood- lots of restaurants are nearby as is the famous Diddy Riese cookie store (go buy yourself an ice cream cookie sandwich for only $1.50!). There was a Trader Joe's grocery store two blocks away. Parking is free (a rarity in L.A.), the rooms are very clean and comfortable, and there is a continental breakfast (though uninspired). Mini-fridge and microwave in the room. Five minutes to easy freeway access (the 405 freeway), five minutes to Beverly Hills by using Wilshire Blvd.) Ten minutes (at most) from the Getty Center. The not-so-upside: This is not a trendy, gorgeous hotel. This is a weird-looking motel with weird parking. VERY limited parking. Cars sometimes have to park two-deep, so car keys get handed over to the front desk. We only got blocked in once, but the car behind us was moved immediately by the staff, so absolutely no problem. The interior corridors look weird, too, but the rooms are more modern. We were \"upgraded\" to a mini-king suite.... with a view of the back end of a Denny's (ugly alleyway) and two not-plugged in refrigerators on our large balcony (weird????). Back to the upside: Great location, clean accommodations, great price. We can overlook a little weird. We'll be back!", "Date": "June 7, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Tennessee", "Title": "“This place is a real gem.”", "Author": "purpleones", "ReviewID": "UR110148758", "Content": "I booked this hotel after reading other reviews and was very pleasantly surprised. The hotel itself looks very average from the outside, even checking in and seeing the lobby and going down the hallway to our room was also quite average, but once we got to the room it was a WOW. We arrived early and our king room wasn't ready so we got upgraded to a king suite and I have to say this hotel is very similar to many of the Marriott's and Doubletree's I have stayed in with regard to room furnishings, TV's, and room amenities. The kitchenette and bathroom had granite countertops and the bathroom was the roomiest I have ever had in a hotel. The bed was comfortable to the point that I looked under the sheets to see what brand it was in anticipation of my next mattress purchase for my home. We had an incredibly spacious balcony that was at the rear of the building so not much view, but surrounded by trees and very quiet and private. Our trip was divided up into two different stays at the Royal Palace and on our second stay there the following week, our room was equally as nice just not as large as the king suite was. I have to say that the hotel front desk staff seemed mostly indifferent, but the housekeeping staff was very pleasant and did a fabulous job keeping the hotel clean. I usually wear socks in hotel rooms rather than go barefooted, but in this place I was confident enough in the cleanliness to go totally without socks and shoes in the room. This place even smells clean, and that's no small feat for a hotel. The area around Royal Palace is very nice, felt safe, and had plenty of options to shop and eat within walking distance. It is also very close to UCLA. The only real drawback is parking is very tight here, but at least it is free and that's more than many LA hotels have to offer. I was impressed with this very small, unimpressive looking hotel and will definitely stay there on my next trip to LA. For purely selfish reasons, I hope word doesn't get out about what a great place this is to stay, because if more people knew about it, they would have a very long wait for a reservation.", "Date": "May 27, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "3", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Coralville, Iowa", "Title": "“Nice hotel just a little expensive.”", "Author": "djdrake12", "ReviewID": "UR88222264", "Content": "This hotel is nice and well kept up. The rooms are all spacious and come with microwaves and refigerators. The bathrooms are great and the showers are some of the best I've used at a hotel. The only draw back is that is very close to Wilshire Blvd, so it is very loud on the front side of the hotel.", "Date": "November 25, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "", "Title": "“Very pleasant surprise, great accomodations, great value”", "Author": "jackbaby", "ReviewID": "UR86799834", "Content": "We didn't know what to expect, with the two star rating. The outside isn't glamorous and the lobby is mediocre, but the rooms were very nice. We were pleasantly surprised to have been upgraded to a suite, when we only booked a regular King room. The suite was beautiful with a completely seperate living room with new LCD TV along with an LCD TV in the bedroom. The bed and linens were very nice and comfortable. The murals which cover all the walls are very nice.This hotel is very close to UCLA Medical and is walkable with many restaurants and shops close by. There is a nice restaurant right across the street. The hotel serves a continental breakfast with pastries, bagels, coffee and orange juice. Very adequate. Would definitely stay there again and have already recommended to friends.", "Date": "November 11, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "2", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Sacramento", "Title": "“Great value, but could be quieter”", "Author": "Valleyblue", "ReviewID": "UR76879138", "Content": "Like other reviews have stated, the exterior and lobby are outdated but the rooms are modern, spotless, and very comfortable. The next time we stay (and there will be a next time) we will be sure to get a different room. We were on the ground floor right across from the breakfast room. The staff at the front desk were loud (we had to ask them to keep their voices down). The doors could use weatherstripping as you could see a lot of light from all around it. In the morning, the noise from the breakfast room had us up earlier than we wanted. The doors also need indoor chains or latches for extra security when you are in the room. Otherwise, very good value and a nice place. But don't bring a full sized car, it will never fit in the minuscule parking spaces. We had a small rental car and if we were even slightly overweight, we probably couldn't have gotten out of the car. Being within very short walking distance to restaurants and the Westwood/UCLA area was a nice treat.", "Date": "August 25, 2010"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Hempstead, Texas", "Title": "“best value in west LA”", "Author": "thkosan", "ReviewID": "UR71127453", "Content": "I admit, when I drove up to the Royal Palace I wondered what I had gotten into. It does not look like much from the outside. And the reception area is not much better. Our room, however, was incredible for the price. We had a suite with two flat screen TVs, a small terrace, a microwave, fridge and lots of room for my preschooler to spread out her toys. The kitchenette and bathroom had been updated with granite and it was much cleaner than I would have expected from the outside. For us it was a great deal -- we could walk to our cousin's house and aroudn westwood. The only time we drove our rental car was to get there on the first day of our stay and then to leave to head down to Anaheim to visit Disney World. If you want luxury, this is definitely not the hotel for you. If you want a large clean room for a great value, you'll love this hotel.", "Date": "July 16, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "San Diego, CA", "Title": "“Don't Judge a Book by its Cover”", "Author": "lizardsong", "ReviewID": "UR63135482", "Content": "My parents recommended that my family (wife and two young boys) stay in the same hotel as them during a family event over the weekend. When we showed up, the outside of the hotel looks like old apartments. The inside lobby and hallways are way outdated as far as wallpaper and carpet. However, we were pleasantly surprised by the actual room. Very roomy, fridge and microwave included on granite countertops, and a very large LCD high-def TV. Each room has wi-fi internet, however, you must go down to the desk for them to print up a slip showing username and password, for each computer to connect. The downside was the parking, where the spaces were VERY tight. Overall, the service was nice, and we'd stay there again.", "Date": "May 3, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "france", "Title": "“Reasonable hotel in a super lively and student neighborhood”", "Author": "louisJFrance", "ReviewID": "UR61605825", "Content": "The room was very good (we had a room with two queen beds because no other room was available), a little dark, but comfortable, maybe a little ageing in terms of style. The hall is getting old. The welcome was professional. The breakfast is not very good, so is the room where the breakfast is served. The breakfast is included in the room fee. The best part of this hotel is the location, in the middle of Westwood, this neightborhood is full of student and very nice to live in. Place of parking included, which is very useful because there is no free parking around. There is a Dennys Diner just at 1 minute walk from the hotel, which is a very (very) good place too eat american food.", "Date": "April 15, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Los Angeles, California", "Title": "“Unexpected Comfort”", "Author": "RN4tykes", "ReviewID": "UR59781400", "Content": "Upgraded to a suite when they learned of our granddaughter's hospitalization at UCLA. Quiet, clean room, even though on a busy street. Bed was hevenly, and we slept soundly. An oasis in a busy area of L.A.", "Date": "March 28, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Victoria, B.C.", "Title": "“Recently updated, tastefully furnished, excellent location and value.”", "Author": "BarbaraVictoria_B_C_", "ReviewID": "UR58169348", "Content": "We feel this hotel is an excellent value for the money and now that the hotel has been updated it is even more of a value. High speed Internet and continental breakfast are included in the price. Close to UCLA and many good restaurants and shops. Well served by public transit.", "Date": "March 9, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Selma", "Title": "“What a treat.”", "Author": "misscecily", "ReviewID": "UR55177858", "Content": "I neglected to write a review for this hotel back in November. I absolutely loved what they did to it. I had stayed the previously year and where it was nice last year, this year was absolutely fantastic. The room was a double bed with small sitting area and balcony. Bathroom was perfect size, closets were huge, mirrors abundant and the granite sinks and coffee maker & fridge was a nice treat. I would definately stay here again. Great hotel.", "Date": "February 4, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Cambridge, United Kingdom", "Title": "“Perfect location for easy access to lots of LA”", "Author": "ardief", "ReviewID": "UR48600306", "Content": "I am so glad we stayed here. The building might look a little blah from the outside, but the rooms have been redone recently I think, and were great - big beds, nice furnishings, giant tv, lots of space. The wired internet is very useful too. The breakfast is minimal (continental) but it's nice to have it included. Staff are helpful and have maps etc to help get oriented in the area. The location is the best thing - Westwood village is a great place for cafes, cheap places to eat, drink, plus useful things like Trader Joe's, CVS, and the like. It's also excellent for getting around - so many buses stop by, both the Santa Monica buses and the Metro ones, the Getty is 15 minutes away by bus, Hollywood about 30, for example. The LAX Flyaway bus also stops nearby and is incredibly convenient. I would definitely stay here again!", "Date": "November 5, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Location": "5", "Rooms": "4"}, "AuthorLocation": "California", "Title": "“Great Value, conveniently located to UCLA”", "Author": "Kilohana", "ReviewID": "UR47457895", "Content": "Very reasonably priced compared with other hotels in the area. Our 1 bedroom suite was perfect for our family of four with our 2 teens sharing the sofa sleeper in the living room. Great location near the UCLA campus/hospital & convenient to everything in Westwood with short walk to many restaurants & stores (2 drug stores, Best Buy, Trader Joes, Raley's grocery & the famous, favorite dessert stop - Diddy Riese Cookies where you build your own ice cream cookie sandwich!). Easy check-in/out, free parking, free continental breakfast, free internet, microwave & small refrigerator. Front desk people very helpful with giving directions - they have a great local map noting all the restaurants, stores, banks, etc. in the area. They were in the process of renovating & redecorating... our room had the fresh paint/carpet smell & the sink was not yet installed in the kitchenette. Would definetly return.", "Date": "October 22, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Location": "4", "Rooms": "4"}, "AuthorLocation": "Merseyside, England", "Title": "“Perfect for short L.A. stay”", "Author": "weberfamily", "ReviewID": "UR34930952", "Content": "Stayed here for two nights while visiting son at UCLA, before starting a California road trip. It was an excellent choice, perfect location within walking distance of UCLA. It is also a couple of minutes walk from the shops and restaurants in Westwood, which are very good. We had a huge room, with kitchenette and balcony, very good value. Only criticism would be that it is a bit noisy, especially early in the morning when the garbage trucks come round! The breakfast provided was basic, but reasonable given the price", "Date": "July 16, 2009"}, {"Ratings": {"Service": "2", "Cleanliness": "4", "Overall": "3.0", "Value": "4", "Location": "5", "Rooms": "3"}, "AuthorLocation": "cental coast, calif", "Title": "“good overall value, clean rooms, excellent location close to UCLA”", "Author": "rustyrobins", "ReviewID": "UR33215147", "Content": "The hotel was in a great area for walking to our UCLA extension class. Didn't move my car all week. Safe area for 2 women walking throughout the village. Hotel is old with terrible faux painitng in the hall. Other than that the rooms were clean and quiet. We never seemed to get our morning coffee and had to go to the desk and ask daily. The folks at the front desk weren't very friendly, but they weren't rude either. The parking is difficult and limited. the spaces are so small that you can't open the door once you are parked. The overall value was good. I would return for another buiness trip.", "Date": "June 26, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Auckland", "Title": "“This is our favorite hotel in LA. We will stay here every time.”", "Author": "jhainey", "ReviewID": "UR30122575", "Content": "What a little gem! The location is outstanding for all attractions and freeways, the staff is amazing and you feel like one big family. Plenty of parking, fast internet and clean comfortable rooms make it our favorite hotel in Los Angeles by far. We even met the owner who takes a persnal interest. Great value!", "Date": "May 17, 2009"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Canberra, Australia", "Title": "“A great deal in LA”", "Author": "tradescant1", "ReviewID": "UR21991379", "Content": "A very pleasant couple of days at the Royal Palace. We had a spacious, double queen room with kitchenette. The spa bath was a surprise extra - as was the flat-screen TV. We had wheels (parking was free), but even if you don't have a vehicle, the hotel is conveniently placed in terms of public transport. There is a very good choice of eateries within easy walking distance, including breakfast options if the basic continental provided doesn't quite do it for you. The Wi-Fi worked well. Desk staff were always happy to assist with directions, etc. There can be a bit of street noise emanating from the side alley - but we had the window open to get the breeze and hey - this is Los Angeles! Overall, and considering the price, we were more than satisfied.", "Date": "November 19, 2008"}, {"Ratings": {"Service": "1", "Cleanliness": "2", "Business service (e.g., internet access)": "1", "Check in / front desk": "1", "Overall": "1.0", "Value": "1", "Rooms": "2", "Location": "4"}, "AuthorLocation": "Las Vegas", "Title": "“BUYER BEWARE YOU'LL SLEEP ON THE STREET”", "Author": "NiceBedPls", "ReviewID": "UR21959912", "Content": "There is not enough words in the English vocabulary to describe the horrible way we were treated--and we're a return guests. This place has really gone in the dump since we last stayed in 2006! Yes parking is a nightmare, but what part of Westwood isn't, my complaints are with the horrible front desk staff. I was told after booking and paying for the hotel, \"We don't have any more rooms for you\" and was handed a map and she further said, \"this is our sister property the Best Western on Pico and Sepulveda...go stay there for the same price.\" When you drive from out of state to have a medical appointment early in the morning this is the last thing you want to hear. When I asked for a refund she said NO because they won't get paid for it if I don't check in (by hotels.com). She then told me to call hotels.com and cancel---I said why should I cancel when you are the ones who gave away my room---mind you I was checking in around 6 pm!! She snickered and rolled her eyes and then gave me a room...she had a room the whole time! She lied and treated me rude and I could not believe it. The room stuck of Clorox, it was two full beds instead of one king--the bathroom was nice, but not worth the headache. Next time it's worth it to fight traffic than stay here. TRUST ME YOU MIGHT NOT HAVE A ROOM WHEN YOU PAY FOR IT!", "Date": "November 18, 2008"}, {"Ratings": {"Cleanliness": "4", "Business service (e.g., internet access)": "4", "Check in / front desk": "3", "Overall": "4.0", "Value": "3", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Christchurch, New Zealand", "Title": "“Satisfactory little hotel, close to many amenities”", "Author": "toni.lister", "ReviewID": "UR21087974", "Content": "I recently stayed in Westwood for 2 nights with my partner, on our extended trip around Europe & the USA. It was the end of the summer season & quietening down a little, but we were still able to visit a lot of the surrounding areas, & enjoyed ourselves a great deal. We booked our accommodation via the hotel website directly, & confirmed a place to stay for the duration of our holiday. On our arrival (via rental car), we discovered that the hotel was a fairly smallish complex, close to UCLA, Westwood Medical complex, & many restaurants, cafes, & a few shops. Our room was really nice (great value for money) – we had a suite (room 220) with a living room that included a kitchen, coffee maker, fridge, microwave, desk, table, couch & TV (no Sky), as well as a separate bedroom with a king-sized bed & bathroom (with a shower over the bath, which had good pressure & plenty of hot water), which was quite nice. There was free internet (not wireless), which was also helpful, & the room had air conditioning. There is parking outside the hotel, although the parks are fairly small – only an intermediate-sized car or smaller would fit into these parks – we had a PT Cruiser rental car & did not have any trouble. There is a small lift, so this hotel would suit older people who may have trouble with stairs, & it would also suit large-ish groups. Basic beakfast is also provided – muffins, coffee, juice, toast, etc – fairly standard but fresh & reasonable. The hotel is located fairly near the freeway, & access to many of the Greater Los Angeles sights is very easy. The only problem was that we had a suite facing the alleyway, & early each morning a big truck arrived to empty the multiple rubbish skips that were stored out there, which was incredibly noisy, so if you are after a long sleep then this may not be suitable. Overall, we thought this hotel was pretty good! All in all, if you are after a great hotel with a bit of space, which is close to the hospital, UCLA, & transport links, then this is the hotel for you. It’s close to a lot of amenities & is not expensive. If we are ever in the Los Angeles area again we would definitely stay here. Thanks for an excellent stay!", "Date": "October 22, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Business service (e.g., internet access)": "3", "Check in / front desk": "5", "Overall": "4.0", "Value": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Tucson, Arizona", "Title": "“Great location, excellent price, stay here to save money and see the Getty”", "Author": "hurstlacey", "ReviewID": "UR20607094", "Content": "We stayed 2 nights in this hotel, and were very satisfied with the hotel. The rooms were the cheapest in the area, yet this place was NO thin-walled flea bag hotel. The walls were quite thick, thank you very much, I never heard any noise at night. The air conditioner pretty much drowned out anything. Our rooms did face a courtyard, so that must have helped. We got a queen/queen room, and it had more square feet than the Paris in Las Vegas. In addition to the beds, there was a desk, a table with chairs and a kitchen. I got the impression this might have once been an apartment building. The place isn't sparkling new, so if you are looking for perfection, don't stay here. However, the beds were some of the most comfortable beds I have ever slept in. The bathroom was ok. The night manager, Chris, was very helpful and friendly. He gave excellent advice concerning how to get to the Getty: the bus! The bus stoped 2 blocks away and took a lovely route past Bel Air. He also gave us excellent advice about how to drive to several places in the area. The breakfast was danish, English muffins, toast, 4 kinds of dry cereal, coffee, tea and 2 kinds of juice. The parking wasn't a problem, you just had to leave them your keys if you blocked another car. Very safe, walkable neighborhood. There's lots of public transportation within blocks, including a bus to LAX. I loved the $18.50 burger at \"The Garden.\" Also nearby is the Hammer museum, free on Thursdays. I can't wait for another excuse to visit LA again and stay at the Royal Palace.", "Date": "October 4, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Mexico", "Title": "“Excellent !”", "Author": "Newyorkerhapy", "ReviewID": "UR17464187", "Content": "This is an excellent option to stay in Westwood area of Los Angeles, great location, nice and clean rooms, very comfortable, gentle staff, fair prices (the best!), internet free. I was 9 days there and felt like home :) Highly recommended !", "Date": "July 2, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Business service (e.g., internet access)": "3", "Check in / front desk": "4", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Santa Monica, California", "Title": "“Okay, but still better than others”", "Author": "alwaysbetraveling", "ReviewID": "UR16174272", "Content": "I booked this hotel for the night before my interview at UCLA. It's convenient to the UCLA Medical Center (just up the hill). I did not have a car, but from seeing the parking situation, only bring a compact car if you want to park. I was \"upgraded\" to a suite. The kitchenette had a fridge but no dishes or utensils. The living area had a TV and couch. The internet access is not wireless, but they provided a cord if you did not bring one. The bed was comfortable and clean (please see my other reviews for much worse places than this). The bathroom was clean. There was also a TV in the bedroom. The front desk staff was helpful, especially when looking for local areas to eat within a walking distance. Check-in and check-out was quick. The included continental breakfast was basic, but decent. I would stay here again for business or the budget minded traveler.", "Date": "May 18, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "4.0", "Value": "5", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Austin, Texas", "Title": "“Royal palace-- For basic royalty only”", "Author": "lizicat", "ReviewID": "UR10973383", "Content": "Warning upfront: My rental car was broken into (window smashed) in the middle of the day while parked at the Royal Palace. Don't leave any valuables in the car while in LA-- they stole my GPS system. Police told me that that has been the #1 item stolen from cars. I think of Westwood as a safe city, but I was disappointed this time. This is a basic hotel within walking distance of UCLA. Ralphs grocery store and Best Buy electronics are a block away. Peet's Coffee is down the street. In addition, the room rate for this caliber of hotel can't be beat. Don't walk too fast through the hotel's front door. It is a sliding glass door and will not open all the way if you go too fast. The front desk staff are friendly, although a few odd personalities do exist. Everyone, however, was very professional. I stayed in a suite, which was very nice as I had to stay for 10 days. The suite included a small balcony, which was surprisingly peaceful for LA. The hotel provides weak in-room coffee and basic hotel soaps and shampoos. The kitchen had a microwave and large fridge, but don't expect any other amenities. Bring your own silverware and plates if needed. The maids also sometimes forgot cups for coffee, but you can pick some up from the breakfast room. The bed/pillows are not the most comfortable, but are very clean and shets are changed everyday. Despite being what I consider an extended stay hotel, the room smelled very clean. Breakfast is very basic: bagels, danishes, weak coffee, get there early for the muffins. The hotel leaves LA Times on the tables in the breakfast room. Overall-- this is a basic hotel—but a great value and location. If you will be out and about for most of the day, and don’t have a car in LA, this is the place to stay.", "Date": "November 21, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "4.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Prospect, Kentucky", "Title": "“Shhh don't tell this secret”", "Author": "VanessaL", "ReviewID": "UR10041501", "Content": "This location is GREAT!! Westwood is VERY safe and the area reminds me of the Village in NYC! Many, many restaurants and little eclectic shops abound. In addition, it is a 2 block walk to the UCLA campus. I would HIGHLY recommend this location, for the price it ain't the Beverly Hilton, but I feel the value far exceeds the price. Our room was very clean and modern, with a mini fridge, microwave and coffeemaker. The front desk staff are very friendly and accomodating and after a 4 days stay, felt like \"family\". I am writing this review because the hotel deserves it, but hestiated because I don't want this small, friendly property to always be full when I come back. I didn't give it 5 stars because it isn't the Ritz Carlton, but in bang for the buck, it deserves 10 stars.", "Date": "October 5, 2007"}, {"Ratings": {"Overall": "1.0"}, "AuthorLocation": "LAS VEGAS", "Title": "“Not Royal And not a Palace, just a Royal Mistake”", "Author": "WORLWIDETRAVELER", "ReviewID": "UR5527543", "Content": "THERE WAS NOTHING ROYAL ABOUT THE Royal Palace was a distgusting place with filth carpets.People were able to be heard through the walls.I had a pluged toilet at 7:00 pm and was given a plunger to fix myself becouse the maitence man was not working at that hour. I can not be paid to stay there again. DO NOT LET THE NAME FULL YOU THERE IS NOTHING ROYAL OR PALACE LIKE IN THAT PLACE EXCEPT FOR THE NAME Buisness travler and vacationers beware! Jackie", "Date": "July 30, 2006"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Business service (e.g., internet access)": "4", "Check in / front desk": "3", "Overall": "5.0", "Value": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Waverly", "Title": "“great bargain”", "Author": "WaverlySharon", "ReviewID": "UR5511689", "Content": "This is a bargain hotel, but it's a great bargain. Most of the rooms are light, airy and spacious. Many have balonies. All (or almost all) have mini fridge, microwave and coffee makers). The cleaning staff was friendly and first rate. The internet connection and parking are also free. After a few hellish nights in the Claremont hotel next door, this place was heaven. I'd happily stay here anytime I have to work at UCLA or the Getty Center. Great location in the heart of Westwood.", "Date": "July 25, 2006"}, {"Ratings": {"Cleanliness": "3", "Overall": "4.0", "Value": "5", "Service": "3", "Rooms": "4"}, "AuthorLocation": "Chicago, IL", "Title": "“A funky neighborhood hotel at Days Inn prices”", "Author": "janie99", "ReviewID": "UR5300366", "Content": "I checked in around 12:30 on a Saturday with no problem. My room (for $104 on hotels.com) was spacious, not quite a suite, but bigger than a typical standard room. It had a mini-refrigerator, microwave, & coffeemaker. Small dining table w/ 4 chairs, and also a small writing desk. For $10 deposit you can check out a cat 5 cable to connect to the cable modem in the room. Mine didn't work, so I took my laptop downstairs and sat on the front patio to connect to their wireless. (You need a username & password, which you can get at the front desk.) The location is perfect. A quick walk to UCLA, and there's a Peet's a block away on Westwood Blvd. It was a hot, sticky weekend and I greatly appreciated the quiet A/C unit. I slept quite well with the A/C on and the drapes closed. There were a couple of glitches: maid forgot to leave coffee in the room when she made up the room Sunday night (but I easily got a couple of coffee filter packets from the front desk). The in-room high speed internet didn't work for me; but wireless was no problem. Front desk staff was friendly and helpful. In sum: this is a very good value for the available amenities & location. If you are a picky person, you should find someplace for $200 a night where they can cater to you. For tolerant, independent people, the Royal Palace is a comfortable and affordable place to stay in West LA.", "Date": "June 5, 2006"}, {"Ratings": {"Cleanliness": "3", "Overall": "3.0", "Value": "3", "Service": "2", "Rooms": "2"}, "AuthorLocation": "Sydney, Australia", "Title": "“Good neighbourhood”", "Author": "maugrim", "ReviewID": "UR4691109", "Content": "The rooms have been described in detail by other correspondants, though the room I had was huge, fit for a family and of good value. The breakfasts I would have to say were disappointing and the staff almost morose and without much of any personality. One of the nightstaff was actually a little strange. Apart from that, the hotel was good value, the neighbourhood is fantastic with lots of movie theatres and a whole range of eating options. I would stay in that part of town again, and this hotel again if i had to.", "Date": "March 18, 2006"}, {"Ratings": {"Cleanliness": "3", "Overall": "4.0", "Value": "4", "Service": "3", "Rooms": "3"}, "AuthorLocation": "", "Title": "“Basic but suitable”", "Author": "ozchick", "ReviewID": "UR4367521", "Content": "We wanted reasonably priced accommodation near UCLA and that's what we got. The hotel is fairly basic. We had the \"deluxe\" suite at the far end of the corridor on the ground floor. It was a large room with queen sofa bed (it looked uncomfortable but our 7 and 8 year old slept well on it). There was a kitchenette - ie. fridge, coffee maker, microwave - no utensils. There was also a TV in the room plus a chair and table set, with a rather large walled terrace outside. There was also a separate bedroom with king bed and its own TV. The bathroom had a hair dryer and a bath. It was a clean suite, a little dark but very basic. But we weren't in the room except to sleep, so it suited us just fine. It was a 5 minute walk to the hub of Westwood village - movie theatres, cafes, drugstores etc and a 10 minute easy walk to UCLA. There was a continental breakfast included in the price of the room (breads, bagels, coffee, juice, cheerios, cornflakes and pastries), so that makes it easy rather than finding somewhere for breakfast. It was $129 a night, so it was great value for what it offered. It is not luxurious at all but you get what you pay for. Also, if you don't want to go into downtown LA (we were coming from San Jose), it is in the northern part of LA - easy to get to.", "Date": "January 21, 2006"}, {"Ratings": {"Cleanliness": "3", "Overall": "4.0", "Value": "3", "Service": "4", "Rooms": "3"}, "AuthorLocation": "California", "Title": "“Perfect for UCLA parents”", "Author": "Salconn", "ReviewID": "UR3938792", "Content": "Westwood is a surprisingly small village, so if you want to reserve this hotel through Expedia or one of the other services, you have to do it early. Fine continental breakfast, okay but not spectacular rooms, great location. We will make this a regular stop. If we can get in...", "Date": "September 25, 2005"}, {"Ratings": {"Overall": "2.0"}, "AuthorLocation": "Jacksonville, FL", "Title": "“Comfortable, but Infested”", "Author": "A TripAdvisor Member", "ReviewID": "UR1757158", "Content": "The hotel was comfortable, but my carpet and bathroom were infested with small ants.", "Date": "March 31, 2004"}], "HotelInfo": {"Name": "Royal Palace Westwood", "HotelURL": "/ShowUserReviews-g32655-d82636-Reviews-Royal_Palace_Westwood-Los_Angeles_California.html", "Price": "$139 - $274*", "Address": "<address class=\"addressReset\"><span rel=\"v:address\"><span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">1052 Tiverton Ave.</span>, <span class=\"locality\"><span property=\"v:locality\">Los Angeles</span>, <span property=\"v:region\">CA</span> <span property=\"v:postal-code\">90024</span></span> </span></span></address>", "HotelID": "2516038", "ImgURL": "http://media-cdn.tripadvisor.com/media/ProviderThumbnails/dirs/f0/ea/f0ea2b6b13516acdf38337f1688fab2a3large.jpg"}}