{"Reviews": [{"Ratings": {"Service": "5", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Pueblo Colorado", "Title": "“Arizona getaway”", "Author": "Zoe67", "ReviewID": "UR129303485", "Content": "Over the last 8 months, we have stayed at several Holiday Inn Express hotels from the East Coast to Arizona and this was by far the only one that was a let down. Although it seems fairly newer, just seemed dark and dreary throughout the building. The room was average and nothing spectacular compared to all the others. Breakfast buffet was alright but it is located in such a narrow area and when you have more than 4 people in the area, it is utter chaos. The only GREAT plus to this place was the front desk clerk. He was extremely friendly to us and recommended a great place to eat dinner just up the road with great steaks. Overall, it's not a bad hotel, but I expected more compared to the others in the chain that we had stayed in.", "Date": "May 3, 2012"}, {"Ratings": {"Sleep Quality": "5", "Overall": "4.0"}, "AuthorLocation": "Philadelphia, Pennsylvania", "Title": "“Corner rooms full of natural light”", "Author": "Don A", "ReviewID": "UR129110384", "Content": "Background info: platinum status; didn't use shuttle, pool; parking lot generally full; breakfast standard HI Express fare; only one elevator in the building so always slow The suite room contained a ton of natural light from big windows especially in the morning which was great for waking up and getting work done in the morning. Suite is open layout with no separating doors from living to bedroom area. Kitchenette sits right at entry doorway and has very little working room (between the coffee pot and other stuff sitting on the counter, there's almost no room for your own stuff). Small fridge sufficient for keeping items cold. Microwave on the older side but does its job. HVAC is a spit system set into the windows. Found it best to run them when not in room and turn off once you're back in room - that way the room is cool but there's no loud fan blowing at you. Air coming out of units are a bit musty. Have stayed at the other airport location as well. Would stay at this one over the other one because enjoyed the light in the room better and appreciated the complimentary breakfast.", "Date": "April 30, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "4.0", "Value": "3", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Anchorage, Alaska", "Title": "“Just what we needed”", "Author": "Migratory_Margie", "ReviewID": "UR127133855", "Content": "We wanted a hotel near the airport and chose this based on tripadvisor reviews. It was clean, comfortable and reasonably priced. We booked a park and fly option and left our car in their parking lot, which worked out very well for us. The hotel is easy to find. The rooms are nice, it was quiet, and the beds were comfortable. The staff was friendly and helpful. My only complaint was the \"hotel bar\", which is actually in the Hilton Garden Inn next door and owned by the same company (IHG). The pleasant and apologetic bartender did not have the ingredients for our first two cocktail requests and we finally settled for a gin and tonic with lemon because he did not have limes -- so wake up, management!", "Date": "April 2, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Wheaton, Illinois, United States", "Title": "“Great spot for overnight stay before flying out!”", "Author": "DiannaD421", "ReviewID": "UR127046071", "Content": "This hotel is close to the airport and easy to get to. We needed to return a rental car...front desk had printed directions for us. It was very easy to get to...only a few mins. drive. There was a computer in the lobby we used to print boarding passes. Our room was clean and comfortable. Bathroom was nice. Quick check-in and out. Nice, friendly staff. Free wi-fi in room. Breakfast options were good. We did order room service and it took over an hour to get. Overall, nice option for being close to the airport.", "Date": "March 31, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Easton, Maryland", "Title": "“Clean, friendly, central”", "Author": "jck123123", "ReviewID": "UR126133599", "Content": "Stayed here for 3 nights while we went to Brewers Spring Training. Very friendly staff. OK breakfast. Close to Tempe, and university restaurants/scene. Easy access to Rt. 10 to / from the game. Less than 30 minutes from Old Towne Scottsdale. Best part, they have an airport shuttle.", "Date": "March 15, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "5", "Sleep Quality": "5", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Pittsburgh, Pennsylvania", "Title": "“Not impressed”", "Author": "GreekJill", "ReviewID": "UR124677342", "Content": "I've had to go to this hotel 3 times for business. It's fair, but I have a few complaints. The room service is sloppy, the restaurant is mediocre, the shuttle is not always on time (made me late for work), and they missed my wakeup calls on this last trip 3 days out of 7.", "Date": "February 16, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Cheyenne", "Title": "“Can't beat it for an overnight stay”", "Author": "WYbirdwatcher", "ReviewID": "UR124212184", "Content": "My wife and I stayed here to be close to the airport for a next-day departure. The proximity of the hotel to I-10 and the Phoenix Airport car rental facility was most helpful. The friendly and courteous desk attendant provided us with printed directions to the nearest gas station (so we could fill the tank before returning our rental), as well as the route to the rental facility, which was actually at the very next exit off I-10 to the west. The whole facility was clean and inviting. No evidence of wear and tear anywhere. The standard king bed room was spacious enough, equipped with refrigerator and microwave, and very clean and attractive. We had no problem sleeping -- the firmness of the mattress was just right. I did get annoyed a bit by some constant noise from the refrigerator (during regular operation, not just the cooling cycle) but that kind of thing is easily remedied (so long as one does not need to keep anything cool) by pulling the plug on it. Another option is to run the room fan constantly. For those who don't need a fancy meal, there is a Waffle House just a couple hundred feet away. And, of course, the Hot Start breakfast buffet in the hotel lobby, with a wide variety of offerings. We found scrambled eggs, biscuits and gravy, Cinnamon Rolls, and cereal, among other choices. This HIE ranks right near the top of Holiday Inn Express properties at which we have stayed over the years, and there have been a few -- I am a Priority Club member and tend to look first for this chain when seeking lodging.", "Date": "February 6, 2012"}, {"Ratings": {"Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "bucerias nayarit mexico", "Title": "“excellent stay”", "Author": "359traveller_", "ReviewID": "UR123881406", "Content": "we stayed here for 6 nights,it was wonderful. well appointed rooms, super clean and new, great pool. decent restaurant food for a hotel above average and great location to get to all areas of the city...will return again next year....oh and they have a shuttle to arizona mills mall!!!", "Date": "January 30, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Nebraska", "Title": "“Great place to stay!!!!!”", "Author": "trea4luck", "ReviewID": "UR122522157", "Content": "I stayed here during a business trip for several days and enjoyed this place. The room was nice and clean, comfortable bed, and wonderful free continental breakfast....no complaints at all!!! It was nice being so close to the airport as well!", "Date": "January 4, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "3", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Airdrie, Canada", "Title": "“Good hotel, close to airport, good price”", "Author": "bretonsimon", "ReviewID": "UR122008752", "Content": "I like the hotel feel. Friendly staff. Good continental breakfast. The location is convenient for the airport but it is in a poor neighborhood. Not much to do in walking distance and people looks weird. 10 minutes drive to west brings you to Tempe where you can find good restaurant. My mattress was beat up so I had to sleep far from the TV and it was acceptable there. Most people sit and sleep in front of the TV and this is where it sinks the most.", "Date": "December 22, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "USA", "Title": "“Fine to be Near Airport”", "Author": "yostwl", "ReviewID": "UR121126720", "Content": "We spent one night to be near the airport for our morning flight. Staff members were helpful and knowledgeable. Room was typical for HI Express--roomy and pretty clean. Breakfast was again typical--enough variety to have something for everyone.", "Date": "November 28, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "2", "Overall": "2.0", "Value": "2", "Location": "2", "Rooms": "2"}, "AuthorLocation": "", "Title": "“Not up to par.”", "Author": "Roadhemi", "ReviewID": "UR121101965", "Content": "The rooms are worn out. Jeez, the door knobs barely work... staff is young and attractive but utterly clueless. Not a clean or welcoming hotel.", "Date": "November 27, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Appleton, Wisconsin", "Title": "“Close to the airport!”", "Author": "33duke", "ReviewID": "UR120158896", "Content": "We arrived earlier than expected and they gave us our room right away anyway. The room was clean and similar to other HIE. The breakfast was good, as expected. I loved that they had a computer hooked up to a printer, so we could print our boarding passes before going to the airport. We stayed the night we arrived in Arizona and the night before we got our flight home. It was very convenient for us. We will stay here again.", "Date": "November 4, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Greenwood, Indiana", "Title": "“Nice, New and close to the airport”", "Author": "Indy", "ReviewID": "UR119952723", "Content": "The location and the facilities were great. The food was good. The staff was helpful and attentive especially Brian, one of the wait staff.", "Date": "October 31, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Location": "3", "Rooms": "4"}, "AuthorLocation": "London", "Title": "“Clean rooms, good breakfast, safe location”", "Author": "Stormcab2", "ReviewID": "UR119829398", "Content": "Although the stay started with a bump - no wi-fi & their internet went down - so there was a bit of a trouble finding a decent place to eat & things to do, it's a good place overall. They have a decent room service, the place is very clean, & the outdoor jacuzzi that stays open until 11pm is VERY nice. There is also a great place outside the entrance called \"The Waffle House\" - we got a great cup of tea & pumpkin pie there.", "Date": "October 28, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Phoenix, Arizona", "Title": "“Awesome hotel....”", "Author": "TERESLILLIAN", "ReviewID": "UR119355211", "Content": "Convenient location. Very friendly staff. Spotless rooms. We left our car for a nominal fee - saved alot on airport parking. Gym, free breakfast was great. Shuttle driver was awesome...he showed up at the airport within 15 minutes with a smile on his face. Highly recommend hotel for next day travel. A totally positive experience. Will stay every time I travel from Phoenix.", "Date": "October 16, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Paris, France", "Title": "“Great value near airport”", "Author": "nobody415", "ReviewID": "UR118990167", "Content": "we arrived late at phoenix, called the hotel from free telephones in the airport, the shuttle was there less than 10min after. Check in was easy, can enjoy the pool at evening, room with king size was comfortable and clean, bathroom too. Good night of sleep, the hotel was not full, and so very quiet. Good breakfast with eggs, sausages, toasts, muffins, pancakes, cereals, fruits, yoghurt... Check out was easy, one shuttle every 30min to go to the airport. The hotel shuttle dropped us to the airport, and we took another shuttle to go to the car rental area. Very good experience in this hotel, for 66$ (reservation one week in advance). Warning : The hotel is far from downtown, there seemed to be anything near so if you want to eat or go out, it can be a problem.", "Date": "October 6, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Boston, Massachusetts", "Title": "“This place rocked! Not your averge Holiday Inn Express!!”", "Author": "SandraBoston", "ReviewID": "UR118831103", "Content": "I was in awe. This place was not your average Holiday Inn. Very nice staff. Clean, modern. A good example of service/staff would be I mentioned to the front desk I was going to return my rental car to the airport early so I wouldn't need to deal with it in the morning. She immediately pulled out directions from the hotel to the airport rental return, a number to call the shuttle, and instructions exactly where to wait for the shuttle depending on which terminal you were in. Impressive. Stress free! The shuttle is free the airport. The room had a fridge, huge TV, internet...great and safe place to stay.", "Date": "October 1, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "4.0", "Value": "4", "Service": "5"}, "AuthorLocation": "Buffalo, New York", "Title": "“Amazing service at a good price”", "Author": "ncarbrey", "ReviewID": "UR117972881", "Content": "My family and I stayed here when flying into Phoenix for a trip to the Grand Canyon. Their shuttle service to the airport was excellent, and prompt, with no delays & nice driver. The breakfast was ok, since I'm not a fan of most hotel breakfasts since the food quality isn't the greatest, but they did have a very cool pancake making machine, that you press a button and in less than a minute, a pancake comes out the right side. I've never seen that before, and that was cool!", "Date": "September 12, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "4.0", "Value": "4", "Service": "5"}, "AuthorLocation": "Charente Maritime", "Title": "“Clean, convenient stopover”", "Author": "fraire", "ReviewID": "UR117534640", "Content": "We stayed one night at either end of our trip to Arizona and beyond. The hotel is clean, quiet and comfortable. Breakfast was fine, and all the staff we encountered were pleasant and helpful. We didn't get a chance to use the swimming pool, but it looked nice. On our return leg we ate a very decent meal at the HIE's sister property ( Holiday Garden Inn) restaurant despite arriving only 5 minutes before their closing time. This was much appreciated after a long drive from LA. The hotel has a very convenient shuttle to and from the airport. We had just the loveliest chatty driver when we first arrived and were thrilled to see him again when we left Arizona. I'm afraid I failed to note his name,sorry, but if he's reading this, thank you once again for your welcome and good humour from the French family with the two girls!", "Date": "September 1, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "5", "Overall": "4.0", "Value": "5", "Service": "4"}, "AuthorLocation": "London, United Kingdom", "Title": "“Nice hotel and close to the airport”", "Author": "Jazzy1995", "ReviewID": "UR117366315", "Content": "The hotel is located close to the airport and they have a complimentary shuttle. The check-in was super quick and the hotel is on the same property as the Hilton next door. The room had good size queen beds and the breakfast was really good.", "Date": "August 28, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "4", "Service": "5"}, "AuthorLocation": "AZ", "Title": "“We use this hotel every month.”", "Author": "BayStaterAz", "ReviewID": "UR117036885", "Content": "We use this hotel each month whether for a business trip or vacation. This hotel is very convenient to the airport (five min. drive) and their shuttle is ontime. We stay one night and park for up to two weeks for free. The hotel is fairly new, clean and quiet except for the ignorant people who let their doors slam. (You know who you are!) The hotel offers a varied dinner menu and also a breakfast in the morning which we don't usually have due to very early flights. I would highly recommend this hotel.", "Date": "August 21, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Colwyn Bay, Sunny Wales", "Title": "“Such a nice and enjoyable stay”", "Author": "stooreyruaridh", "ReviewID": "UR116682811", "Content": "We had flown in from Burbank and were due to fly out on an early flight to Dallas, then on to Frankfurt. We easily caught a Shuttle Bus to the Hotel and the lady at check in was extremely nice and helpful. We told her we would like a wake up call and an early shuttle bus and she did it so easily. Our room was nice, warm but when the air con came on it was lovely. As we were tired we decided to have room service, I had the Curry Salad and it was DELICIOUS!! The room service was quick and the food was tasty. I had an enjoyable nights stay, and if I am ever in Phoenix again I will defo stay at this hotel. :-)", "Date": "August 13, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "4", "Service": "5"}, "AuthorLocation": "Louisiana", "Title": "“Wonderful Stay”", "Author": "CinderellaLouisiana", "ReviewID": "UR116300763", "Content": "We spent the night at Holiday Inn Express in order to be able to leave on an early flight the next morning. Rooms were very clean and well-equipped, and we enjoyed the hot breakfast. I also enjoyed the free shuttle to the airport. All of this for a reasonable rate!", "Date": "August 5, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "4.0", "Value": "4", "Service": "2"}, "AuthorLocation": "delaware", "Title": "“Good Place to stay if need to be near airport”", "Author": "kat123de", "ReviewID": "UR115985429", "Content": "Our trip lead us to need a one night stay in Phoenix, after flying in late at night. I choose this hotel based on the location to the airport and the other feedback. I was happy with this choice. The location was very easy to get to from the airport, as well as being very close. The room was very clean and simple. My family really enjoyed the breakfast. Basic food (muffins, cereal, bagels, fruit, pancakes,etc) and coffee, milk and juice. The hit of the food were the cinnamon rolls and the pancake maker (made individual servings); both of which were delicious. The breakfast and cleaning staff were polite and professional. The only down side was the front desk personnel. The person working in the evening (and was there in the early am on 7/14) does not appear to like his job. He was abrupt and not friendly at all. He went through his \"script\" and practically tossed us the room key card. In the morning there was no one at the desk for checkout (at ~8am) and myself and two other customers waited approximately 10 mins for someone to return to the desk. Overall, I would definitely come back to this location if needed a hotel close to this airport. Great location for travelers, good included breakfast and decent price.", "Date": "July 29, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "3.0", "Value": "5", "Service": "3"}, "AuthorLocation": "Pahoa, Hawaii", "Title": "“Pleasant stay but communication snafus abound!”", "Author": "RGaitherHI", "ReviewID": "UR115946591", "Content": "My husband and I stayed here twice in the last two weeks for one-night layovers on our way to and from Honolulu to a midwest destination. The rooms are bright and comfortable and the location is in a professionally maintained business area. However, on the 3 occasions (we came in on different flights the first time) we called to ask for airport transportation, there were miscommunications among the front desk, the van driver and one or both of us. The latest resulted in our standing out in the Arizona heat waiting for a van whose driver quit for the day unbeknownst to the desk. It wasn't until we called again that we found out that the current driver didn't know about our being there. This is just one of several times when the right hand didn't know what the left was doing. So keep on the front desk if your van isn't there quickly! One other drawback is that there is only a Waffle House and the small restaurant/bar with intrusive television in an adjacent hotel for meals. Nothing else within miles.", "Date": "July 29, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "4", "Location": "4", "Rooms": "4"}, "AuthorLocation": "Rochdale, United Kingdom", "Title": "“Useful stopover”", "Author": "SPEL1990", "ReviewID": "UR115923095", "Content": "We stayed for one night after landing in Phoenix. It was convenient for the airport. The taxi from the airport was $16 which a minimum fee. If you can find the airport shuttle as it's essentially free. The room was comfortable but we had to sort out the sofa bed for the kids. It was made up but just needed pulling out. A meal at the restaurant next door was good. It is inside the Hilton Hotel which fooled us for a while! Breakfast at the hotel was also good with plenty of choice. Overall it was a good stopover on our trip around Arizona.", "Date": "July 28, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "4.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Germany", "Title": "“Good Hotel for the Money!”", "Author": "1Papa_Smurf", "ReviewID": "UR115906065", "Content": "Stayed one night while awaiting flight the next day out of Sky Harbor. Staff were friendly. Room was clean. Overall appearance of hotel was acceptable. Beds were comfortable. Water pressure for shower was super! Plenty of places to eat nearby either walking or driving. Would/Will definitely stay here again without hesitation. Can't comment on the food as we left too early in the morning to eat.....lol.", "Date": "July 28, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "4", "Service": "5"}, "AuthorLocation": "shrewsbury", "Title": "“Real friendly hotel & great breakfast”", "Author": "tonyf-ChrisF", "ReviewID": "UR115441701", "Content": "Eat & drink @ allied Hilton Garden Hotel next door & put it on your hotel bill ! - lots of bar company", "Date": "July 17, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "4.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Dana Point, California", "Title": "“Excellent airport hotel for you and your vehicle”", "Author": "travelingbarb2-2", "ReviewID": "UR115099237", "Content": "I stayed one night at this hotel prior to an early morning flight out of Sky Harbor Airport. I chose this hotel because of the reasonable price ($89) and the ability to leave my vehicle there for up to two weeks while traveling. The room was nicely furnished, the blackout drapes did their job, the bed was comfortable and it was exactly what I expected from a Holiday Inn Express. Next door is a Hilton Garden Inn that, according to the desk clerk, is owned by the same person who owns the Holiday Inn Express. The Hilton has a full-service restaurant open for lunch and dinner and Holiday Inn guests can charge their meals to their room. This was a great convenience since the only restaurant close by is a Waffle House directly in front of the hotel. I had a salmon dinner that was excellent. My flight the next morning left too early for me to have breafast at the Holiday Inn Express, so I can't comment on the breakfast. I utilized the Holiday Inn Express shuttle service, which begins at 4:00 a.m.", "Date": "July 6, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Yorba Linda, California", "Title": "“Excelent Hotel”", "Author": "NewBreed2011", "ReviewID": "UR114759018", "Content": "I had a last minute lay over in AZ. and need a room quick and close to the airport. I opened my laptop and searched Holetls near the Phoenix airport and found the Holiday in to have a reasonable price and asfree shutttle to and from the hote. I booked it last minute and was supprise to see what a great hotel it was. The breakfast in the morning was a great start for my flight into Los Angeles. Thanks A Million.", "Date": "June 26, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Belleville, Canada", "Title": "“Perfect place to stay when you're flying out in the morning.”", "Author": "amychap", "ReviewID": "UR114756339", "Content": "We needed a room in Phoenix because we were flying out in the morning. The room was spotless and inviting. And quiet- a plus when you're staying near an airport! We weren't travelling with a laptop so the courtesy computer in the lobby allowed us to check-in with our airline the night before. A free breakfast in the morning is always a bonus when you're not sure when you'll next grab a bite to eat. Being celiac, I always have questions that need answering before I can eat what's offered and the woman responsible for the food prep was genuinely helpful and unperturbed by my questions. This will be our go-to hotel whenever we fly out of Phoenix.", "Date": "June 26, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Round Rock, Texas", "Title": "“Best HIE I've stayed in!”", "Author": "SharoninOK", "ReviewID": "UR111127200", "Content": "I stayed here on 5/31/2011 in room 428; paying $100.81 total. Booked the hotel based on TA reviews and the need for a shuttle to Phoenix SkyHarbor the next morning. I travel about once a month for pleasure; this was my last night after a three week trip. Having read the other TA reviews I was aware that the only restaurant close by was a Waffle House so I had dinner down off University prior to checking in, (numerous restaurants can be found around ASU). I was traveling alone and felt very safe in this location and in this hotel. Very pleased with the room, the hotel, and the staff I came in contact with during my stay. I was flying out the next afternoon and, as a Priority Club Member, was offered a late checkout. It wasn't needed but was appreciated. Checked in around 8 p.m. - checkin was quick and my request for a room on the highest floor away from the elevator was met. Room was very clean (including curtains, window, behind doors, etc.), everything was in very good order, didn't use the fridge or microwave but they were available, large flat screen TV, appreciated the toiletries and better than average towels in the room, above average hotel breakfast with a very courteous staff member keeping the area neat/clean/stocked, comfortable bed, and quiet room. Did not use the pool but, upon inspection, saw it was very clean and all seemed to be in good repair. Towels were set out for the guests to use on each chair; found myself wishing I had brought my bathing suit. :-) I had been traveling three weeks at this time, had stayed in seven different hotels (3 being HIE), and had one of the best nights sleep I had in over three weeks. I often post pictures of the rooms I stay in but my room honestly looked like the pictures on the website. I always wipe down any handles, switches, remote, phone, etc.of any hotels I stay in - all were clean. Checked the bed - all the linens/mattress were in good shape and were clean. Took the free shuttle to the airport; very courteous driver and very prompt service. My only *wish* was the opportunity to purchase a secured wifi network (i.e. AirLock, etc.). I would highly recommend this hotel. If in the area again, I will be staying at this Holiday Inn Express.", "Date": "June 2, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "1julieg", "Title": "“Good place to stay and free parking while traveling”", "Author": "1julieg", "ReviewID": "UR109412257", "Content": "This was a nice, comfortable hotel. Room was clean and free morning breakfast was suitable. Pool was small but clean. We especially enjoyed the bargain of having our car parked there for free up to two weeks while we went on vacation. Shuttle service to Phoenix International Airport was a short 10 minutes from hotel and drivers were impeccablely on time. Great experience and we'll use this hotel again.", "Date": "May 23, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Summerside, Canada", "Title": "“Quite, near airport and excellent value for the money.”", "Author": "bematoke", "ReviewID": "UR109143228", "Content": "Check-in was quick and efficient; staff was helpful and friendly; property clean and modern. Free breakfast was worth taking the time to enjoy. Free shuttle service to the airport was timely and courteous. The flat-screen TV got the better of us though, as the remote wouldn't turn it on and there weren't any buttons visible to operate it manually. New batteries for the remote didn't work either. The man who checked us in came with extra remotes (none of which worked), but together we found the touch buttons to turn the TV on manually. Problem was resolved the next morning when a maintenance person came, unhooked and reattached a cable on the back of the TV. We asked for and got a reduction for the inconvenience.", "Date": "May 20, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "", "Title": "“It has everything!”", "Author": "Traveler41008", "ReviewID": "UR105340950", "Content": "Great standard hotel with everything needed! Spent two nights here and found a most of the staff kind and knowledgeable. Only one staff member seemed distracted when talking to us. It is located near Mill Ave. which has tons of places to eat. But be warned; it is a college town! Overall, however, it was just what our family needed.", "Date": "April 25, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "San Diego, California", "Title": "“Loved the bed!”", "Author": "jameskim927", "ReviewID": "UR104202228", "Content": "I recently stayed at this hotel for 3 nights while I was in Phoenix for my dad's birthday and it was one of the best hotels I've been too. I arrived at the Phoenix airport and called the hotel for their shuttle service. The front desk agent asked for my name and directed me to the pickup location. The driver came within 5 minutes and took us straight to the hotel. The drive to the hotel was very short. Upon arrival the front desk agent had our paperwork and room keys ready so check-in was brief. When we got into our rooms, the lights and A/C were turned on for us ahead of time. It was about 80 degrees at 11pm! But our room was very comfortable. It wasn't freezing or too warm. The rooms were beautiful and everything brand new. The bed was amazing! I wish I could have one at home. I had the best sleep of my life! The rooms were large and it had a 32\" LCD TV. The breakfast in the mornings were also great. Lots of items hot and cold items. They also rotate the hot meats daily which was nice. They have a really cool pancake machine. You just enter the number of pancakes you want and they come out in a couple minutes. The breakfast attendant was also very friendly and helpful. One of my family member arrived late for breakfast but the attendant asked what they wanted and she heated up some eggs and sausage for them. They also offer room services and the prices were incredibly reasonable for hotel room service. It was the same as eating out at a restaurant. Which was very surprising. The late night snacks we ordered were very delicious. I highly recommend this hotel if you plan on staying in the Phoenix area. The staff was very friendly and hepful.", "Date": "April 15, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "San Diego, California", "Title": "“Great Holiday Inn”", "Author": "Jimmy_Tree", "ReviewID": "UR103897109", "Content": "I had an excellent vacation at this Holiday Inn. Everything was perfect, the morning breakfast and the entertainment facilities. I would highly recommend staying here, probably one of the best experiences I had. www.uopaxiasolutions.com", "Date": "April 13, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "3", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Toms River, New Jersey", "Title": "“Great Experience”", "Author": "justPenguin", "ReviewID": "UR102803661", "Content": "We stayed here for two weeks, March 5-18 2011. The check-in was quick, rooms incredibly clean, wonderful hotel staff. Hotel was very quiet even though it was usually at/near capacity. Pool was usually clean, sometimes towels weren't picked up until the end of the day. Hot tub clean & HOT! The one improvement I would hope for is the beds. I love firm beds, but these are rock hard, and left me with a back ache for the duration of the trip. (I am a sucker for the Sheraton beds, myself.) Front desk staff was very accommodating due to unexpected need to fax things a few times, and pleasant, too. Overnight \"scooter girl\" (drove scooter to work) was awesome, as was the over night guy, I can't believe I forgot his name already. Hubby and I usually chatted in the evenings with him on our way in from smoking (hotel is entirely non-smoking, fine with me.) Breakfast is over PROMPTLY at 9:30, so if that's what you want, be there on time. One night the battery went dead on our door lock, we couldn't get in. They gave us a room across the hall for the time being, it took about an hour and a half to get it working again. It was late at night, and the manager even came in to make sure we could get back in. I would absolutely stay here again the very next time I am in phoenix. The only thing is the cost - not extravagant, but still up there. It was peak season, granted, although I thought it was about $20-30 higher than it should have been, with the W hotel charging the same price.", "Date": "April 4, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Reading, United Kingdom", "Title": "“Great hotel for a stop over after flying into Phoenix”", "Author": "lawrence_97", "ReviewID": "UR101010239", "Content": "Very comfortable hotel, good sized room, and good breakfast including hot food which is quite unusual in the US. Location is handy for a stop over after flying into the airport as it's only a 10 minute drive.", "Date": "March 21, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Milton Keynes", "Title": "“Great Place and Value for Money”", "Author": "danzimbo", "ReviewID": "UR98396186", "Content": "We stayed here in a King Suite for 1 night. The shuttle bus arrived very quickly at PHX. Check in was seamless, the young lady was very pleasant. The room was spacious and quiet and catered for what we needed after a long transatlantic flight. We mistakenly thought the sofa bed had not been made up, and the lady at the desk arranged new linen etc to rectify this. We found the bed had in fact been done when we unfolded it, but the extra blankets came in handy nonetheless. (we were too embarrassed and tired to go apologise...sorry!) Convenient breakfast as well. We did not use any other other facilities here.", "Date": "February 28, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "oregon", "Title": "“Front desk”", "Author": "jwh2008", "ReviewID": "UR97146701", "Content": "The young lady at the front desk, named Dulce, was above average with her helpfulness and was so very pleasant to deal with. She alone made the stay very pleasant. Rooms were quiet and the entire staff was very pleasant. Highly recommend this hotel.", "Date": "February 18, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "5", "Location": "4"}, "AuthorLocation": "New York City, New York", "Title": "“It does the job!”", "Author": "JFKTom", "ReviewID": "UR88554347", "Content": "I stayed in this hotel during early November 2010. It was a base for a Arizona trip I took with my dad. It was a pretty good base! We did not spend much time in the hotel during the day as we drove throughout the state. It is not the type of hotel you would want to stay in without a rental car. It has no shops near by it. The airport van is free so you could always take that back and forth! The staff was pretty good. They helped us with directions and gave us some information about Arizona Mills Mall. A few of the front desk ladies were not as friendly as I would hope and took some phone calls over our questions. The room was great! It had a fridge and a microwave and we booked one of the smaller rooms! The beds are great...I love Holiday Inn beds! I just hate the pillows. The pillows were not good and I found it hard to get comfortable with them. The rooms were very clean and that is so important! The bathroom was nice and had a great shower. The rooms were cleaned daily and were usually spotless. I would stay here again.", "Date": "November 29, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "PA", "Title": "“Great Stay”", "Author": "wendyman", "ReviewID": "UR84569309", "Content": "We decided to stay here due to an early flight the next morning. It is a new hotel and very clean. The beds were comfortable, although not pillow top. It is less than five minutes from the airport, yet noise was not an issue. We would choose to stay here again when flying out of Phoenix.", "Date": "October 23, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Los Angeles, California", "Title": "“Perfect airport hotel”", "Author": "DuncanTraveler", "ReviewID": "UR81916974", "Content": "Excellent, new hotel with friendly service. I never thought I would be saying this about a Holiday Inn (I hadn't stayed in one for 20 years).", "Date": "October 3, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Location": "4", "Rooms": "4"}, "AuthorLocation": "", "Title": "“Fantastic value for money. That is if you...”", "Author": "MamR68598", "ReviewID": "UR81322116", "Content": "Fantastic value for money. That is if you consider it a airport hotel. Staff is friendly, rooms are big enough and clean. Although the view is not the most attractve. The pool is a bit small but does the job in the Phoenix temperatures. Dining in the hotel was not possible, but a 2min walk to the Hilton next door gives you a nice restaurant and/or a Waffle House. Breakfast in the hotel is fair. The complementory shuttle takes you to and from the airport approx. every 30min. and as they work together with the Hilton next door there are 2 available. In conclusion: If you need a 1 night layover at Phoenix airport this is the perfect value for money. Maybe not for a 2-week vacation.", "Date": "September 28, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Vancouver, Canada", "Title": "“Incredible service and great value”", "Author": "Sandy_0111", "ReviewID": "UR80592316", "Content": "This is the second time we've come here for business and we would highly recommend this hotel. It is clean, updated, the staff is helpful and friendly, the breakfast is excellent and the service is consistently outstanding. The shuttle service includes free rides to area restaurants: they even had the manager pick us up from dinner last night so we wouldn't have to wait for the shuttle. Sandy, Vancouver BC", "Date": "September 22, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "3", "Location": "5"}, "AuthorLocation": "New York City, New York", "Title": "“GREAT HOTEL CLOSE TO THE AIRPORT”", "Author": "Astutefox", "ReviewID": "UR80098183", "Content": "The Holiday Inn Express was very close to the airport, super clean, and cost effective. While we \"sacrificed\" modern decor and a flat screen, we had a great stay. Staff were super friendly. The room was cozy, clean and comfortable-- no complaints. Free breakfast is also included-- it was pretty decent. Bottom line: You can't go wrong with Holiday Inn Express.", "Date": "September 18, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "London, United Kingdom", "Title": "“Convenient, clean and cheap”", "Author": "KIC", "ReviewID": "UR74206102", "Content": "We chose this hotel for its location, only 10 mins drive from Phoenix Sky Harbor airport and because it was very cheap! Our room was nice & clean room (fairly small but perfectly OK for a night). Check-in & check-out were both efficient and friendly. Breakfast was fine - fruit, patisserie, breads, cooked items - but coffee was awful & the juice very sickly & sweet. We left very early the next morning so didn’t try the pool but it looked fine. Recommended if you need somewhere to crash before / after a flight.", "Date": "August 7, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Morongo Valley, CA", "Title": "“Excellent value”", "Author": "lr0che", "ReviewID": "UR73645831", "Content": "This hotel was great for the money. Great service, attentive. Left our car for 10 days, shuttle to airport. Snacks and any drink you wanted on Wed. evenings. Everything about this hotel, especially their staff, was great. uncovered parking, but safe, with restaurant next door and right off freeway. I would stay here again. Breakfast was nice, ample.", "Date": "August 3, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Nashua, NH", "Title": "“Great find”", "Author": "nashuanh5", "ReviewID": "UR63531965", "Content": "6 Minutes from airport. Super clean. Paid $79. Great breakfast", "Date": "May 7, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "5", "Location": "3"}, "AuthorLocation": "Northamptonshire, UK", "Title": "“Friendly Staff and Good Shuttle to Airport”", "Author": "Intrepidity060", "ReviewID": "UR62691951", "Content": "We stayed at this Holiday Inn twice during April, 2010, largely as a result of the Icelandic Volcano which would not allow us to fly home to the UK. We booked at very short notice (Priority Club) and the reception staff could not have been more helpful or sympathetic to our predicament. Rooms were quickly arranged for us, and we ate twice at the nearby and related Hilton Garden Suite. The shuttle service into Phoenix was very efficient, and we had only to dial a special number (45) from the airport in order to get picked up. The service was free, although we did choose to tip the drivers. The breakfast service was good, although the range of cooked food was limited. There was a happy hour each evening, with drinks. We did this twice, although on the first occasion we were served by a very surly youth who was actually only interested in watching the TV and sending text messages on his phone. A good stay, and very good staff.", "Date": "April 28, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "wisconsin", "Title": "“what a great trip”", "Author": "jan58tim60", "ReviewID": "UR60776731", "Content": "we were in phoenix for a week and decided not to book into a hotel for all 7 nights cause you never know what you get . well after 3 nights in another hotel we decided to move into this holiday inn. what a difference the staff is very friendly and helpful. the housekeepers do a wonderful job keeping the room clean and fresh. the pool and hot tub is so clean and towels outside all the time. their breakfast is fresh and delicious. we cant say enough about this hotels. the price is great. we do alot of traveling with hotels and we will stay with this one the next time we go to phoenix. so thank you so much for such an enjoyable stay.", "Date": "April 8, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "southampton", "Title": "“great location for airport”", "Author": "annbobSouthampton", "ReviewID": "UR59865490", "Content": "Arrived late evening and telephoned the hotel shuttle and it was very quick. Check in was quick and the desk clerks very very curtious and greeted you with a smile. The room was very roomy and house keeping was excellent. The breakfast next morning was excellent and you had a very good variety to choose from. Unfortuneately we were only stayed for one night as we were touring around Arizona. Would definately return.", "Date": "March 29, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Manhattan Beach", "Title": "“GREAT Location & GREAT Service!!!”", "Author": "KP1ManhattanBeach", "ReviewID": "UR57371246", "Content": "Stayed there for 4 days Complimentary shuttle to and from the airport Complimentary shuttle to and from the local restaurants and clubs 5 Minutes from Tempe 10 Minutes from Scottsdale 10 Minutes from Phoenix EXcellent Hospitality!!!!!!!!!!!", "Date": "February 28, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "4", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Wisconsin", "Title": "“Fun in the SUN!”", "Author": "LeeesaWisconsin", "ReviewID": "UR56372751", "Content": "We wanted to get out of the snow of Flagstaff & just came down for the weekend. The Staff was soooo nice & friendly to my children & very informative. They played by the pool & had fun in the hot tub!! We will definitely be back for another get away.", "Date": "February 18, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "5"}, "AuthorLocation": "Nevada", "Title": "“They have BED BUGS!!!”", "Author": "traveler201038", "ReviewID": "UR56171419", "Content": "I thought it was a great place until.....I woke up with bites on my legs and arms, pulled the sheets back and found BED BUGS! I talked to the front desk, they weren't surprised...GM didn't even talk to me. Clerk said, \"Sorry about that\"", "Date": "February 16, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "2.0", "Value": "1", "Location": "4", "Rooms": "1"}, "AuthorLocation": "Salinas, California", "Title": "“Overpriced and very dated. Low grades for value.”", "Author": "Annandale2", "ReviewID": "UR55205928", "Content": "For $139 per night, I expected something better than 20-year-old WalMart particle board furniture. I also expected a flat screen TV and maybe even a DVD player. Nope... a smallish old TV. The room is the equivalent of a motel room costing half as much.", "Date": "February 4, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Location": "4", "Rooms": "4"}, "AuthorLocation": "Shanghai, China", "Title": "“Easy decision”", "Author": "Redjazz68", "ReviewID": "UR52989146", "Content": "Typical Holiday Inn Express experience. Booked online. Check-in VERY quick. Room was good size, fairly basic, but clean and tidy. Location is great if you are flying in and out quickly. Great stay.", "Date": "January 8, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Location": "3", "Rooms": "4"}, "AuthorLocation": "Falkirk, Scotland", "Title": "“IDEAL HOTEL FOR THE AIRPORT OR CAR PICK UP”", "Author": "DoraDementia", "ReviewID": "UR52554683", "Content": "Stayed here after getting off a late night flight into Phoenix. Phoned the free hotel shuttle bus, it picked us and another couple up really quickly. Hotel is very nice and has everthing you need. Best bit for me was the bed it was huge and really comfy, slept like a baby. Breakfast in the morning was good and included sausage and eggs as well as all the normal stuff. The shuttle bus took us to the car hire place next morning whcih was ideal, shuttle driver was very friendly and helpful. Would use this hotel again for easy access to/from the airport.", "Date": "January 4, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "4", "Overall": "2.0", "Value": "4", "Location": "2", "Rooms": "1"}, "AuthorLocation": "San Diego", "Title": "“Do not come here for leisure-they say they are for \"business\" travelers”", "Author": "MichaelNesmith", "ReviewID": "UR50925164", "Content": "I looked for a hotel in Phoenix for a Thanksgiving weekend stay. We live in San Diego and my girlfriend wanted to visit her friend and we wanted to see Sedona and maybe the Grand Canyon. I chose this one from the great reviews in trip advisor. When I arrived in the afternoon, we checked in with a somewhat \"frowning\" young lady behind the counter. I asked about a recommendation for a Grand Canyon tour and she said they cater to \"business\" and no one ever asked her that question and didn't know. I then asked to borrow a pair of scissors since we had a new laptop case and needed to cut off the tag. She said she doesn't have any scissors because the guests keep stealing their scissors. I said \"OK, no problem\". I then decided to ask a gentleman the same question about the Grand Canyon in the morning and basically got the same answer. He was friendlier and did point in a direction to some brochures which I ended up using for a Grand Canyon trip on Saturday. On Friday, we spent the whole day in Sedona. When we got back we found the room was not cleaned and bed was not made. When I called the front desk, I was asked if we left do not disturb sign out. I said no and then got we are sorry apology and two orange juices. I think this hotel may be good for a quick business trip, but as they told me twice, they don't cater to leisure.", "Date": "December 9, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Texas", "Title": "“Wonderful stay! Friendly staff!”", "Author": "TexasAngel63", "ReviewID": "UR48209504", "Content": "We only stayed here for one night but I wish it had been for more. The staff was very friendly and helpful. The pool was clean (but cold) and the hot tub was warm and inviting. We didn't have time to eat breakfast but it looked like a nice area to eat. The bed was very comfortable and the room was spacious! It was very quiet, too! This hotel was very convenient to the airport and the car rental area and they even had a shuttle! I would stay here again if I need a hotel near Sky Harbor Airport! There is not a restaraunt here but there is a Hilton Garden Inn next door with a pretty good restaraunt. There is also a Waffle House (which was pretty good) across the parking lot from the hotel. Very convenient on both counts!", "Date": "October 31, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Alabama", "Title": "“Great Airport Hotel”", "Author": "curbdog", "ReviewID": "UR47669084", "Content": "I've stayed here a couple of times the night before flying home from Phoenix. For that purpose, it is a great hotel. Quiet, comfortable, clean, and friendly staff. Good location for flying out the next morning. No negatives to report.", "Date": "October 24, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Cincinnati, Ohio", "Title": "“Great service/Great location”", "Author": "Sgoes", "ReviewID": "UR47667456", "Content": "We stayed two nights here - on arriving in Phoenix and then again the night before flying home. The rooms were large and well-equipped. On the last night, our room had a tv with a green tinge. Since it was a Saturday, there wasn't a maintenance person available so they moved us to another room right down the hall. When my husband went down to get the keys, Nicole had already written an apology note and included coupons for goodies from the Pantry. Nice touch! We found this hotel easily accessible from the airport and convenient to the museums that we visited while in Phoenix.", "Date": "October 24, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Location": "4", "Rooms": "4"}, "AuthorLocation": "MA", "Title": "“Pleasantly Surprised and Highly Recommended”", "Author": "Calypso19", "ReviewID": "UR36194755", "Content": "Stayed there for 2 weeks while on business. This hotel was remodeled in 2007 but you'd think it was newer. The rooms are good size, kept very clean, beds comfortable. Bathrooms are great, water pressure better than home. Microwave/fridge is very helpful when staying longer than a night or two. Restaurant next door at the Hilton or you can get delivery from local spots. Free breakfast is fresh and quite good (eggs, bacon and/or sausage, \"famous\" cinnamon buns, toast,bagels, etc). It was a real pleasure! Staff is very accomodating ande helpful. Fitness center was a nice surprise.", "Date": "July 30, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Location": "4", "Rooms": "4"}, "AuthorLocation": "Romsey", "Title": "“Great for stop over and free shuttle service”", "Author": "Crampmoor", "ReviewID": "UR35653838", "Content": "Used as a first night stop over. Prompt collection following a call made using the courtesy airport phone. The shuttle took us back to the airport the next day to collect the hire car. Friendly helpful staff and clean rooms. Good choice for breakfast which was included.", "Date": "July 24, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Lebanon, New Jersey", "Title": "“great hotel close to the airport”", "Author": "VanDo", "ReviewID": "UR35622179", "Content": "Stayed here one night last week the night before I was flying out of town. Great location. They have a computer available for you to check in and print your boarding passes. Just what I needed.", "Date": "July 23, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "3.0", "Value": "5", "Location": "5", "Rooms": "3"}, "AuthorLocation": "Aberdeen, United Kingdom", "Title": "“Good value”", "Author": "ALISTER54", "ReviewID": "UR35406153", "Content": "As an airport hotel, good value,helpful staff and an adequate room. Arrived late and left early but ideal for a one night stay.", "Date": "July 21, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Minneapolis", "Title": "“Great spot, nice clean rooms, Life is good!”", "Author": "mudhonie", "ReviewID": "UR33002384", "Content": "We were just staying overnight to catch a flight the next morning. The rooms were clean and spacious and the hotel seems quite new. We had dinner and drinks next door at the Hilton, which was good. We then swam. The pool was sufficient, maybe a tad over chlorinated, but all in all, in good shape. The free shuttle to the airport was a very nice feature, but the driver was a tad crazy, especially when you have two toddlers sitting in your lap. As with most of the Holiday Inn Expresses I have stayed at, it was a agreat place.", "Date": "June 23, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Orange County California", "Title": "“Felt like home. Comfortable, Clean & Friendly”", "Author": "Stires", "ReviewID": "UR31664964", "Content": "We stayed at the Holiday Inn Express for a family reunion. I worked, from California, with Jim Penberthy. There was nothing we asked for that was not accomodated; requests were filled very quickly. The service was over and above expectations. The staff was friendly and concerned with our comfort. Not one of the 50 people in our group had a complaint regarding the facilities. They raved about the value of meals and rooms. We were there for two days, we felt very at home and comfortable. The facility was very clean, the complimentary breakfast was fresh, hot, and tasty. The meeting facility was perfect for our initial meeting. Jim did an excellent job of making sure everything was well coordinated by the time I arrived. Our early guests were well accomodated with their pre-printed agenda's. We had two catered meals at the adjoining conference center. The service and meals there would compare and surpass other hotels were I have attended business events. I would recommend this hotel to anyone, for any function.", "Date": "June 5, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "5.0", "Value": "4", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Seattle", "Title": "“Second stay at this hotel”", "Author": "yo007", "ReviewID": "UR30066390", "Content": "We stayed here last year on our trip to Arizona. It is very convenient to the airport and car rental return. They have a good breakfast with those yummy cinnamon rolls! We enjoyed the Happy Hour, but the snacks were lackluster. Minimal chips with a jar of salsa and self made tuna fish sandwiches, blech! Close enough to Papago park for one last walk in the desert before leaving for the cold harsh world of the Pacific NW!", "Date": "May 15, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Canada", "Title": "“Excellent Service!”", "Author": "E65Canada", "ReviewID": "UR28563648", "Content": "This is a great hotel for travelers flying in and out of Phoenix as well as excellent access to the rental car area. My brother, sister and I stay 2 nights at this hotel (arrival and departure from Phoenix.) The staff are very accommodating, courteous and very helpful. The rooms are spacious and very clean and the hotel has many amenities available including a complimentary breakfast. I would definitely stay at this hotel again and would highly recommend this to anyone traveling in and out of Phoenix. Thanks again for making our stay so pleasant.", "Date": "April 22, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Check in / front desk": "4", "Overall": "4.0", "Value": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Phoenix, Arizona", "Title": "“Great hotel and location”", "Author": "Thrilled_2_Travel", "ReviewID": "UR24483181", "Content": "This hotel was close to the airport but don't let that discourage you as I never heard a single plane buzzing overhead. The staff was great and actually let us check in early without difficulty. Only one elevator to serve all floors though. The room was quite spacious for a family. We enjoyed having the mini fridge and microwave in the room, great for leftovers from restaurants. Oh and don't forget the full breakfast in the morning. The pool area was clean and stocked with clean towels. I plan on staying there again.", "Date": "February 11, 2009"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Business service (e.g., internet access)": "1", "Check in / front desk": "1", "Overall": "1.0", "Value": "1", "Rooms": "1", "Location": "1"}, "AuthorLocation": "nyc", "Title": "“Extremely unforgiving”", "Author": "frazzled69", "ReviewID": "UR22453555", "Content": "After staying at this hotel, I will never use Orbitz again, and will try to always avoid Holiday Inn Express. Simply, I screwed up, but neither the hotel nor Orbitz would work with me to resolve my problem. When booking the hotel, I mistakenly picked the Airport location instead of the Downtown Holiday Inn Express, which was the one I wanted. I think part of the problem was that during booking, the prices of the rooms kept changing, so somehow I accidentally changed hotels. When I showed up at the wrong hotel and figured out my mistake, I tried to transfer the booking. The hotel told me I had to go through Orbitz. Orbitz told me I had to go through the hotel. No one would take responsibility, and no one would help me. I am convinced I would have had better luck if I booked directly with the hotel. Don't stay at this hotel and don't use Orbitz!", "Date": "December 4, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Charlottesville, Virginia", "Title": "“Perfect Airport Hotel”", "Author": "Travelamerica08", "ReviewID": "UR21513728", "Content": "This is a great hotel for travelers flying out of Phoenix. The rooms were spacious, clean, and had every ammenity possible. The staff was knowledgeable and helpful. This hotel is very close to the airport and rental car return area. Highly recommend!", "Date": "November 3, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "3"}, "AuthorLocation": "Toms River NJ", "Title": "“very very good service”", "Author": "sheltercove", "ReviewID": "UR21179304", "Content": "My wife and I stayed here after the completion of our western trip. We drove down from Sedona and arrived well before the check in time. We were cheerfully given an early check-in. There was an issue with the tv. A person was at our door almost immediately to fix the problem. Although the hotel does not have a restaurant we were directed to the Hilton Garden Inn next door which does. We had a nice lunch. We were told that the same owner owns both hotels. They had Fat Tire Amber Ale on draught. Boy, that really hit the spot. The Garden Inn looks like a winner also. Back to the Holiday Inn Express. The bed was comfortable and the bathroom large. Shower had one of those great shower heads that you can now find at most Holiday Inn Expresses. Towels were very large and plush. If you are returning a rental car make sure you get the directions from the front desk, or you may find yourself driving in circles. The breakfast was good as was the outdoor pool and hot tub. Service was done with a smile. I have no complaints whatsoever. Holiday Inn Express is quickly becoming my hotel of choice.", "Date": "October 24, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Chicopee,Ma.", "Title": "“Great Stay!”", "Author": "paulabc2", "ReviewID": "UR19942825", "Content": "My husband and I stayed at the Holiday Inn Express the last day of our trip home to Massachusetts, I wish we had stayed longer. The staff at the front desk was very accomodating getting us our room earlier than check in time. Also, front desk was helpful to us with info about bringing our car back to airport, (which by the way was the worst part of our vacation.) The evening gathering in the lobby had 2 free drinks per guest which was a nice touch.I also took advantage of the laundry area to do vacation laundry. The rooms were large and very clean. The free shuttle to the airport the next morning was right on time and accomodating. I think the staff at this hotel gets a high 5 for service.", "Date": "September 9, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Waterloo, Iowa", "Title": "“100% satisfied!!”", "Author": "helpingothers", "ReviewID": "UR19938525", "Content": "My son and I needed a clean, comfortable hotel near Sky Harbor. I got lucky by choosing this Hoilday Express. Iwas told it was recently remodeled. It looked and felt that way. Cost was about $120.00 total. Beds were very comfortable. Clean. Quiet. My son made the comment on how the room seemed to maintain a constant temperature. It was 115 degrees outside. The breakfast was unbelievable. Eggs, bacon, fruit, rolls, yogurt etc. It was better than a purchased breakfast. I can't say enough good about this property. I think it was like 3 to 5 minutes from the airport too.", "Date": "September 9, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Business service (e.g., internet access)": "4", "Check in / front desk": "5", "Overall": "5.0", "Value": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Cardiff, Wales", "Title": "“Great hotel”", "Author": "billyfiske", "ReviewID": "UR19018315", "Content": "A great hotel and well located to investigate Phoenix. Even though it was full of young people the hotel was quiet. The staff were friendly and helpful and when we checked in the poor check in girl had phones ringing and a long queue to deal with but she kept calm and friendly throughout. The room had two beds and was clean with a great air conditioning given the outside heat. Breakfast was a buffet and it was included in the price. There was internet access, with a printer, freely available in the foyer area.", "Date": "August 16, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "4", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Brussels", "Title": "“very nice hotel”", "Author": "A_D_Bru", "ReviewID": "UR16622876", "Content": "We were very nicely surprised with this hotel. It was supposed just to be a decent hotel near the airport before taking the 7 am flight. Turned out to be very accomodating, with friendly stuff, good and inexpensive restaurant at the Hilton next door, with spacious rooms with kettle, coffee and tea. Unfortunately we did not stay long enough to try the breakfast or use the pool. Free wi-fi and free use of a computer with internet in the lobby. The shuttle service to the airport was very helpful (the first one left at 4am). Overall, we would definitely recommend this hotel for a convenient stay nearby Phoenix airport.", "Date": "June 2, 2008"}, {"Ratings": {"Service": "1", "Cleanliness": "5", "Business service (e.g., internet access)": "4", "Check in / front desk": "2", "Overall": "2.0", "Value": "2", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Santa Fe, New Mexico", "Title": "“OK rooms, below average service”", "Author": "foodlover505", "ReviewID": "UR16001021", "Content": "Being in the hospitality business, you see a lot. There are some things that are not within a hotel's control, such as a city's temporary shut-off of water, etc. Service, however is paramount, and as a supervisor of mine always puts it, \"A room is a room, is a room. Guests want great service.\" At check in for a weekend we weren't really greeted but checked into our room. We made it to the happy hour and requested a gin and tonic, but they were out of tonic water. A vodka and orange juice? No orange juice. My friend joked,\"OK what can we have?\" The response was,\"Well you're a little late for cocktail hour, so you're lucky you're getting anything.\" I looked at his face for some sign of jest, but he was serious. The next night after requesting a ride on their complementary shuttle for a night out on the town, we were turned down because it was considered outside of their service zone. The clerk at the desk scoffed while letting us know, but called a cab for us. Rooms here are comfortable, and reflect an updated Holiday Inn look. Beds are very comfy. Being so close to the airport, this establishment is probably very used to accomodating business travelers and older patrons. Maybe the service we received was due to our age (late 20s). Nonetheless, I was not impressed, but I am glad that others have had positive experiences here. I won't be going back.", "Date": "May 13, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Business service (e.g., internet access)": "4", "Check in / front desk": "4", "Overall": "4.0", "Value": "5", "Rooms": "3", "Location": "3"}, "AuthorLocation": "UK", "Title": "“very pleasantly surprised”", "Author": "michelescully", "ReviewID": "UR15064378", "Content": "we stayed here at the beginning and end of our easter holiday we arrived late on saturday night (15th) and the hotel was pretty full we were given a king room but we needed more room as we had our teenage son with us - they changed the room for one with a bed settee this made the room small but it was adequate the breakfast was fine - apples, oranges and bananas for fresh fruit.... coffee and drinks available in reception all day we had a one night stay before flying to phillie and this time secured a room with two beds the rooms are clean and comfortable with toiletries supplied a nice touch is the option to acquire complimentary toothbrushes etc if you have forgotten yours we did not use the pool but it looked quite a small area we did use the computer in the reception are to print boarding passes and to find directions the staff were pleasant - especially the reception staff we paid $49 per night and considered this to be an absolute bargain (3 travellers) we would be happy to stay here again the shuttle drivers were friendly and helpful no complaints", "Date": "April 15, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Business service (e.g., internet access)": "4", "Check in / front desk": "3", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Delaware", "Title": "“Good Hotel after flight”", "Author": "JennyDelaware", "ReviewID": "UR14659253", "Content": "We stayed in this hotel after a long flight from Philadelphia - it was just what we needed. The price was reasonable. We arrived late at night and found the hotel easily from the airport. The hotel was clean. The room was comfortable and large enough for our family of 5. The hotel was quiet and the staff were helpful and friendly. The breakfast was fine. No complaints.", "Date": "March 30, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Upstate, NY", "Title": "“Great Hotel!”", "Author": "TaylorUpstate_NY", "ReviewID": "UR14609551", "Content": "We have recently returned from a trip to Arizona which started and ended at the Holiday Inn Express at Phoenix Airport. During the week we stayed at two other higher priced hotels in Scottsdale and in Sedona but we found the value and attention to detail at the Phoenix Holiday Inn Express. Every staff member that we met were wonderful--from the front desk to the person picking us up and dropping us off at the airport. The breakfast was more than adequate and an especially nice touch was a happy hour at the end of the day. The rooms were very large with comfortable beds--very clean! We were travelling with our teenage son and found the space to be larger than most. Each room is equipped with a refrigerator. In this day and age when airline travel can be frustrating, these folks made our stay near the airport stress free. They actually shuttled us to the airport the night before to return our rental car and then again the next day. Everyone was very accommodating. I would highly recommend this hotel for value, comfort, location and service.", "Date": "March 28, 2008"}], "HotelInfo": {"Name": "Holiday Inn Express Phoenix Airport (University Drive)", "HotelURL": "/ShowUserReviews-g31310-d75662-Reviews-Holiday_Inn_Express_Phoenix_Airport_University_Drive-Phoenix_Arizona.html", "Price": "$86 - $157*", "Address": "<address class=\"addressReset\"><span rel=\"v:address\"><span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">3401 E University Drive &amp; I-10</span>, <span class=\"locality\"><span property=\"v:locality\">Phoenix</span>, <span property=\"v:region\">AZ</span> <span property=\"v:postal-code\">85034</span></span> </span></span></address>", "HotelID": "2516173", "ImgURL": "http://media-cdn.tripadvisor.com/media/ProviderThumbnails/dirs/05/8b/058b68f0fa1b88a2b56b8b160632fa3c7large.jpg"}}