{"Reviews": [{"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Irvine, California, United States", "Title": "“Great Hilton Property”", "Author": "Jennifer P", "ReviewID": "UR128958039", "Content": "I recently stayed a week at this property while my boyfriend was in AZ for business. I am a loyal fan of Hilton, and this property was great. The hotel is very nice, well kept, and quite. The lobby is nice and spacious with a dinning and sitting area. The gym is rather small but has a decent selection of weights and a few treadmills and an elliptical. The hotel also has a nice basketball court and pool. This property is also conveniently located by a large shopping center (within walking distance behind the hotel) The center has a Walmart, gym, and several restaurants. Being on a rather strict diet I was very happy with the rooms. They offer a full kitchen with a large fridge/freezer, dishwasher, stove, and microwave. I was able to purchase all my food at the store and cook my meals in the room. It's often hard to stick to a diet when traveling but Homewood made it simple. If you are not as picky as me, the hotel offers a nice full breakfast in the am until 1030. My boyfriend loved this. They offer everything from fresh fruit to homemade waffles and omelets. They also had a calender in the room for nightly dinners, however we never tried these. Aside from the kitchen, the rooms are very nice, clean, and updated. They offer a small living room area and separate bedroom area. The rooms also offer free internet which was a huge plus. I travel a lot and I am used to paying at least 10 dollars a day for internet. Lastly, I would like to comment on the staff. They were absolutely amazing at this property. They were always friendly and eager to accommodate. When my boyfriend finally had a break, the lady working the front desk spent almost an hour with us going over restaurants and activities we could enjoy locally. They always greeted us warmly and actually remembered us and greeted us by our names(this is always a nice touch at hotels) Overall I was impressed with this hotel and would definitely stay here if I ever find myself in Phoenix again.", "Date": "April 28, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "3.0", "Value": "4", "Sleep Quality": "3", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Birmingham, Michigan", "Title": "“One night of horror and three nights of bliss -hotel puts non-smokers in smoking rooms when at capacity”", "Author": "MichiganTravelhawk", "ReviewID": "UR128026519", "Content": "While on a business trip in Phoenix, I stayed 4 nights at the Homewood Suites Phoenix North -Happy Valley. I booked a non-smoking one bedroom suite at the Homewood Suites Phoenix North Happy Valley hotel. Although my confirmation indicated a non-smoking room, they gave me a smoking room on a smoking floor. And my one night of horror began. I was informed that when the hotel is at capacity they convert smoking rooms into non-smoking rooms. Smoke permeates drapes, carpet, bedding and furniture so there's no way a smoking room can become smoke free overnight. Non-smoking rooms were not available and my business meeting started at 8:00 am the next morning. While in the room, my eyes began to burn, I had difficulty breathing and my nostrils were irritated and sore...it was a miserable sleepless night for this non-smoker. Through the ordeal the staff & managers were sympathetic and promised to find a non-smoking room the next day. The next day, while I was in the business meeting, the hotel staff moved my personal items to a non-smoking room on the non-smoking floor. Ok, so this is when the bliss started. When I returned from the business meeting I entered my wonderful non-smoking room. The one bedroom suite was spacious, clean, everything looked new and the bed was very comfortable. The kitchen had a 2 burner stove (no oven), microwave and a full sized refrigerator. Other perks included free wireless access and breakfast with some hot items such as eggs and sausage. As if that wasn't enough, Mon-Thurs evenings there's a complimentary light meal with beverages. The staff was very friendly and made guests feel very welcome. Two outdoor shopping areas (Happy Valley Towne Center and Norterra Shops) with lots of restaurants are located behind the hotel. Since the hotel is next to Interstate 17, there's just a short drive to reach the Anthem Outlet Mall and the Cave Creek area. My overall rating for the hotel would be higher if it weren't for the one night of horror and what might be a practice of putting non-smokers in smoking rooms.", "Date": "April 16, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Seattle", "Title": "“Clean, Convenient, and Nice Rooms.”", "Author": "GNAK62", "ReviewID": "UR126808099", "Content": "We are Hilton Diamond Members and we enjoy staying at the Homewood Suites. This is our second stay at this location. We stayed here for 10 days. The good: The rooms are spacious, clean, and quite. There are many restaurants nearby and Walmart is behind this hotel. The front desk staff are courteous and pleasant. Good internet connection and TV selection. They have DVD's available for free. The breakfast was fair, not a lot of selection compared to other H.S. and the evening meal was ok. The bad: Housekeeping was inconsistent...they would forget dishwasher soap or kitchen towels etc..Overall we enjoyed our stay and would come back to this location.", "Date": "March 27, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "tulsa", "Title": "“A great place to stay”", "Author": "wifey2mikey", "ReviewID": "UR126657103", "Content": "We stayed at this Homewood Suites while our son was in Phoenix to play in a baseball tournament. The team stayed in a separate hotel while several parents stayed here. We had booked the room ahead, paying in advance for a bit of a discounted rate. We booked a one bedroom suite (which has a bedroom separate from the living/dining/kitchen area.) We arrived on a Saturday (late check in) and stayed through Thursday morning. We were not disappointed. The room was spotlessly clean - the furniture and beds were comfortable. The sofa was a pull out - and both televisions were flat screens. The kitchen and bathroom counters were granite. Tile floors in the bathroom area. The closet was large. Everything was spacious. The kitchenette was clean, new, and well stocked with utensils and dishes. The refrigerator was full sized with an ice maker. The hotel staff and management were very attentive, and the only time we had to call the front desk (needed more toilet tissue) they were very prompt, apologetic, and courteous. The hotel is conveniently located next to a very nice shopping district, and upon check in, the front desk gave us a guide will all local shopping and restaurants near by - several within walking distance. Nearby shops included everything from Walmart to Bath and Body and Dicks Sporting Goods. Restaurants included Logan's Roadhouse, Olive Garden, Smash Burger, Red Robin, and several others including some fast food options as well. Despite being located right off Highway 17, the room was quiet and we noticed no traffic noise. Anthem Outlet Mall was also located just a few miles north of this hotel. The hotel has a complimentary Happy Hour each week night - though the beverages were limited in selection. The food offered at that time however, was more like a meal than Happy Hour snacks and were decent. Breakfast was good (although most things were covered in jalepenos which I personally don't like.) There was an outdoor heated pool. And the second floor of the hotel had a billiard table. I noticed a nice business center on the first floor as well. We did take advantage of the guest laundry on the 2nd floor for baseball uniforms. There were three washers and dryers and seating. In conclusion, we found this hotel to be more than what we expected and we would highly recommend it to everyone. Should we be in Phoenix again, we would definitely stay here again.", "Date": "March 25, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Bangalore", "Title": "“Clean, Bright and Spacious Rooms, Staff extremely courteous”", "Author": "Ckiran", "ReviewID": "UR126066291", "Content": "I stayed in this place for 8 nights in March and, I am were very happy and pleased with the hotel and their staff. Check in was fast and easy. The staff was so pleasant and accomodating. The location is a short walk to the happy valley town centre with various shopping and restaurant option in a stone throw away distance. The breakfast is plentiful and acceptable with a set menu all days and limited changes. Vegetarians like me might find limited options certain days. I Personally prefered to have a one bedroom suite with comfortable beds to unwind at the end of the day. This place defintely is worth coming back to on the next trip to PHX.", "Date": "March 13, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Washington", "Title": "“Great Place”", "Author": "Mixalti", "ReviewID": "UR119996290", "Content": "We recently stayed at the Homewood Happy Valley and were very pleased with the staff from the moment we checked in. The grounds were kept up, the room was like new, the breakfast and evening food was just perfect for our stay. This is a little north of Phoenix, but in a new area right off the freeway but not so close you hear the freeway noise. Very new mall next to it but back to back so you can get there easy by going around the block but no mall traffic. Theaters (new) with in a few blocks. For business or pleasure this is a 5 star location.", "Date": "October 31, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Whitewater, Colorado", "Title": "“Truly enjoyed our 4 night stay”", "Author": "Colorado_Rick", "ReviewID": "UR119511948", "Content": "We stayed here to be close to a convention I was attending. The wife loved the pool and being next door to a large shopping center. Should we ever have a reason for staying in this area of Phoenix again, we will surely try to stay here as we really enjoyed it. Hotel employees were friendly & helpful. The room was large, comfortable & clean and even the view was ok. To be crystal clear, this isn't a resort, but is a superb hotel with a great staff.", "Date": "October 20, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Washington DC", "Title": "“Great Place for a longer stay”", "Author": "Bookeworm", "ReviewID": "UR119013772", "Content": "I had a great experience visiting my mom and sister in this Homewood Suites. The staff was friendly and kind. They made you feel like you were a family. The cleanliness was superb. Great place to stay!", "Date": "October 6, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "USA", "Title": "“Home away from home!”", "Author": "JasonUsa", "ReviewID": "UR115873246", "Content": "I spent two weeks at the Homewood Suites Happy Valley while traveling for business. This hotel by far has the friendliest, most professional hotel staff I have encountered. They consistently went above and beyond to exceed my expectations. I wouldn't stay anywhere else in Phoenix!", "Date": "July 27, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Germany", "Title": "“Friendly, Clean, Quiet and perfectly managed”", "Author": "hanshart", "ReviewID": "UR114802345", "Content": "This is one of the best Hotels I stayed in the past year. As a Hilton Diamond member I travel a lot and so have seen many Hotels frm the inside. The rooms, the bathroom, the Pool area and lobby are clean and have NO strange smell as it appers in many other hotels. Flat TVs and offered TV stations are perfect. The food offered for breakfast and evening is of higher quality .. not just average and was verty delicious. Beer and wine was available. People at the front desk are friendly and made me feel like home. Although the Hotel is located close to hwy 17 I could not hear noticable noise from it nor from other guests. Finaly I have to say that my stay was perfect and I wish that all Hilton hotels would be managed like the Homewood Suites North in Phoenix where the customer matters, where clean rooms are important and where the food quality is selected properly. Hans Hartmann Germany", "Date": "June 27, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Sacramento", "Title": "“Great Deal”", "Author": "RamboSacto", "ReviewID": "UR105880723", "Content": "PROS Stayed for 6 nights. Daily Breakfasts and dinners on Monday – Thursday. Breakfast was scrambles eggs served with a rotating two of the following: bacon, sausages, corn beef hash, and potatoes. There was also the normal cereal, instant oatmeal, bread/toast, yogurt and fruit salad. Made it for 2 dinners, one with raviolis, with choice of red or white sauce. The other dinner was chicken and potatoes. There’s also green salad, and some deserts came out later. Wine and Bud Lite from tap is also served. Shopping and restaurants within walking distance behind the hotel. Business office had 3 PC’s each with a black and white laser printer (one was not working). I found this great! Lots of places usually have only one PC and no printer. Great size room, full kitchen, full size refrigerator, dishwasher, sink, plates, and utensils. There’s a large flat screen that was on the dresser along the wall in the middle. Situated so that you can swivel it to watch from the couch or turn it so you can watch from the bed. Also in the room was a work desk, a small table you can eat at, and ottoman used as a coffee table. There’s WiFi and cable for a direct internet hook up. Room looks just like the pictures in Homewood Suites’ advertisement. . Except for the WWF bout going on above, the room was quiet with the adjacent rooms. CONS 22 miles from Phoenix if you wanted to do stuff downtown. Exercise room had 2 treadmills and a stair stepper. The only weights were free weights with one bench. Look out, the location was not on my GPS. Just exit North 17 at W Pinnacle Peak Road, the hotel is just a quarter mile on the right.", "Date": "April 28, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "White Rock, Canada", "Title": "“A wonderful stay!”", "Author": "Nancy_and_Keith", "ReviewID": "UR103977932", "Content": "My husband and I stayed at this hotel for 30 days while enjoying Spring Training baseball. It was a wonderful stay on all accounts! Throughout our visit, the entire staff made us feel so welcome. We truly felt at home because of their warmth and genuine care. Our room was very spacious and modern. We slept well each night of our stay because of the comfortable bed and quiet nature of the hotel. We also ate very well - from the daily breakfast with many extra touches, to the weekday evening reception which was a full dinner. The dining area and lobby were bright, with high ceilings and a calm, comfortable feel. We thoroughly enjoyed our stay, and would strongly recommend this terrific hotel. In fact, we have already made another long-stay reservation for this autumn!", "Date": "April 14, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Rocky River, Ohio", "Title": "“Great stay in north Phoenix.”", "Author": "Sugarbear1", "ReviewID": "UR85750003", "Content": "My wife and I stayed here for 3 nights in October. The hotel is located behind a large shopping complex that had a variety of restaurants and your typical mall-type stores. The hotel was about 20-30 minutes north of Sun Harbor airport. The staff that greeted us had a smile with their friendly hello. We were even offered a snack from the front desk. The hotel is newer and very clean. Our suite was perfect for our needs. The bed was extremely comfortable with more pillows that we knew what to do with. The kitchenette had a large refrigerator where we stored our bottle water. To us folks from Ohio, Phoenix water had a funky taste to it. So we bottle bottle water from Walmart We used this hotel as a base camp to explore cities north of Phoenix without paying the outragous costs of Sedona and Oak Creek. These 2 cities were about 80 minutes away, but that was O.K.. We found outlet malls on the way up and a couple of tourist sites to break the drive. Bottom line, I have no complaints about this hotel. Actually, we will be using this hotel next October for a block of rooms when a friend of ours from north Phoenix gets married.", "Date": "November 2, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Sleep Quality": "4", "Rooms": "5", "Location": "4"}, "AuthorLocation": "North Alabama", "Title": "“Excellent Hotel--if you can get there!”", "Author": "Storm27", "ReviewID": "UR83550227", "Content": "I stayed here for one night in October, choosing the Homewood over the Hampton because I felt it was a better deal. I was pleasantly surprised by how nice and new everything was. The studio suite was large and nicely-furnished (even featuring extra outlets for things like laptops and cell phones). Breakfast was above average. Road noise was a bit of a problem, since my room faced south towards the open field next to the interstate. It's also kind of tough to find the property--it's readily visible from the interstate, but due to the large expansive shopping plaza nearby, it's not easy to get there once you take the Happy Valley exit. Despite this problem, the hotel's proximity to many shopping and dining options is a big selling point. It's definitely worth a look if you are staying in the northern Phoenix area.", "Date": "October 15, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Michigan", "Title": "“Nice place north of Phoenix”", "Author": "MItravelerforbus", "ReviewID": "UR82333490", "Content": "This hotel was just north of Phoenix in a nice location. It's close to highways and plenty of restaurants and stores. The staff was friendly and the hotel is in good condition. It was a nice place to stay.", "Date": "October 6, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Maineville, Ohio", "Title": "“Excellent 1 night stay”", "Author": "Neilbond007", "ReviewID": "UR79770982", "Content": "Stopped here for 1 night as part of a Phoenix / Palm Springs trip. Changed reservation from another hotel to this one to be closer to Sedona. Looking on google earth before stopping here expected to be in the middle of nowhere. Arrived here at about 2.30 after driving from Palm Springs. First the Garmin took us to the wrong area! Had to use alternative GPS on iphone to get there. Very surprised to see lots of shops / restaurants in this area! The hotel looked very new. Rooms were very clean and bright. Furnishings were excellent. Walked around the surrounding area and ate at the BW3's. Returned to the hotel at about 6pm and had a few of the free beers / wines from the managers reception. The beers were all bottled. Meaning numerous people turned up. Took 4 and went back to their rooms. Had a good nights sleep and left early the next morning for the 90 mile drive to sedona. Overall a very positive experience!", "Date": "September 16, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Andrews, TX", "Title": "“Exceptional service”", "Author": "TXsandals", "ReviewID": "UR61785714", "Content": "My friends and I stayed here for a week (3 suites), and we were all extremely pleased with the hotel. We got a great deal on it through Priceline, so that made it even better. It had wonderfully comfortable beds, very clean rooms that were large enough for all 6 of us to sit together in the living room, and a nice pool/hot tub area with a basketball court. Probably what we appreciated most was the weekday evening meals (beer and wine included) in addition to hot breakfasts. The meals saved us a lot of money, and it was nice to not have to leave the hotel and search for a place to eat every night. I won't say the meals were fantastic, but they were good enough. They did tend to run out of the beer while they were still serving food, so you should get there pretty early if you want a beer. I saw some people asking for beer after they ran out, and some was brought to them. The thing that really impressed me was the service. One of the people who worked in the dining area (his name was Angel, I believe), provided customer service you rarely see. He worked hard and fast to keep up with all the people, and he did so with courtesy and a smile. I think we each commented on him at various points because he was so attentive. Everyone was very friendly and helpful. I had one minimal maintenance issue which was handled immediately by a pleasant man who assured me he would come right back if I had any further issues. This hotel was a big part of why I left thinking that Happy Valley was appropriately named. It seemed like a very happy place, and I was glad to have spent my week here. Also, it's in a great area for shopping, and there's a movie theater nearby. But be forewarned - neither my TomTom nor Google Maps on my Blackberry could find this place and I had to call them to get directions.", "Date": "April 17, 2010"}, {"Ratings": {"Overall": "1.0", "Service": "1"}, "AuthorLocation": "Denver, CO", "Title": "“Bait-and-switch tactics!”", "Author": "wrast", "ReviewID": "UR60033574", "Content": "Our baseball team made reservations 2 months prior to our arrival. When we arrived, we were told that \"our group got moved\" next door to their Hampton Inn, who were described to us as \"their partner\". So, for the exact same room rate, here's what we got instead: - room without a kitchen - a stinky mattress to sleep on (we changed rooms and it still stunk) - more road noise from the highway - hot breakfast not as good - a $20 gift card to local theater that was useless to us (and that only after a lot of complaining) We filed a complaint with Hilton and haven't heard anything back yet. I will be writing the BBB about this. When you have a reservation you're supposed to HAVE A RESERVATION! Management was totally useless and offered us nothing for all the trouble. We drove all the way from Denver expecting a kitchen in the room. They didn't tell us we were going to be moved until we arrived at check-in! If we'd known we could have at least brought a cooler with us since our new room had no kitchen. There is absolutely NO WAY I will ever book with these people again. How can you when they won't actually guarantee your room? AVOID their bait-and-switch tactics and go somewhere else!", "Date": "March 31, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Location": "4", "Rooms": "5"}, "AuthorLocation": "Phoenix, Arizona", "Title": "“Great experience at beautiful hotel.”", "Author": "btworld", "ReviewID": "UR52976540", "Content": "We live in Phoenix but decided to stay here on New Years Eve. The hotel is new and beautiful. The lobby has a fireplace and they offer a lite evening meal along with a hot breakfast. Our room had a kitchen, 2 televisions and the most comfortable bed. This would be a great place for a family or an extended stay in the Phoenix area. The price was reasonable and the location is convenient to major freeways.", "Date": "January 8, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Oro Valley, AZ", "Title": "“Excellent”", "Author": "golfnsail", "ReviewID": "UR28834365", "Content": "We stayed at the Homewood Suites Happy Valley during a baseball tournament. The hotel is brand new. The rooms are suites with a kitchen with a large fridge, a living area with a pull out sofa and a large desk, a bedroom with a king bed and a large modern bathroom. It was very clean, very modern. They had free internet (wired and wireless) a full free breakfast, and the friendliest hotel staff I have encountered in my many travels. Right after we checked in they called the room to make sure everything was OK. It's located right off I-17 and was very convenient to Victory Lanes where our tournament was. Right up the frontage road there are a ton of restaurants and shopping centers. Will definitely stay there when we are on the north end of Phoenix.", "Date": "April 26, 2009"}], "HotelInfo": {"Name": "Homewood Suites Phoenix North - Happy Valley", "HotelURL": "/ShowUserReviews-g31310-d1201061-Reviews-Homewood_Suites_Phoenix_North_Happy_Valley-Phoenix_Arizona.html", "Price": "$90 - $158*", "Address": "<address class=\"addressReset\"><span rel=\"v:address\"><span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">2470 West Charlotte Drive</span>, <span class=\"locality\"><span property=\"v:locality\">Phoenix</span>, <span property=\"v:region\">AZ</span> <span property=\"v:postal-code\">85085</span></span> </span></span></address>", "HotelID": "2516156", "ImgURL": "http://media-cdn.tripadvisor.com/media/photo-s/01/84/e0/2b/welcome.jpg"}}