{"Reviews": [{"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "5", "Location": "4"}, "AuthorLocation": "buena park", "Title": "“beautiful place to stay”", "Author": "lovehonu", "ReviewID": "UR129204339", "Content": "My husband and I spend our weekend @ Vino Bello Resort to celebrate my birthday. This is our first time here and we loved it already! Everyone is so friendly and helpful. Love the staffs. Our room is studio, small but cozy for 2 of us. We definetly will come back.:)", "Date": "May 1, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Chicago", "Title": "“Enjoyed the stay - It was lovely”", "Author": "qa2152", "ReviewID": "UR129000544", "Content": "Had an enjoyable 4 days at Vino Bello. They are still renovating but we were far enough away that it didn't bother us. They offer a shuttle into the city of Napa which is really great. It departs every 45 minutes starting at 4pm and picks up on request, you just have to call. We also enjoyed going to the tasting room at the back of the property. The rooms were nice and all have a balcony or patio to sit out on to enjoy a nice bottle of wine. It is a timeshare but we declined to listen to their pitch and weren't asked about it again which was good. We would consider staying here again on our next trip to Napa.", "Date": "April 28, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "atlanta", "Title": "“Have already personally recommended this hotel”", "Author": "tuscantraveller09", "ReviewID": "UR128538600", "Content": "Just spent a week at the Vino Bello. We were told that they were full up, but the resort never felt at all crowded. Even parking wasn't an enormous issue. At no time did we feel like we were in an industrial park. Our one bedroom suite had a big balcony with a view of the pool and the vineyard. Unfortunately the weather wasn't the greatest, but it would have been a great place to sit with tea in the morning or wine in the evening. We did have some questions about the clothes dryer. It turns out that the instructions on it are incorrect, but housekeeping immediately answered our questions in a professional, courteous way. The staff at reception were extremely helpful and couldn't have been nicer. We only had breakfast one day at the hotel's restaurant (there are so many great restaurants in the area) but it was wonderful.", "Date": "April 24, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Stamford CT", "Title": "“Wonderful Stay!!”", "Author": "GBoots", "ReviewID": "UR128301523", "Content": "We booked this hotel for part of a girls weekend to Napa. The hotel is brand new and everything is fresh and clean. The room was fully equipped and even had complimentary detergent for the washer. The staff was extremely helpful with suggestions and answering questions. The shuttle is fantastic and the driver even stopped at Target for us on the way home from Downtown Napa! We loved getting the complimentary coffee from the lobby and drinking it in the vineyard. We loved this resort!", "Date": "April 21, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Sleep Quality": "4", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Ann Arbor, MI", "Title": "“Great Hotel, Strange Location”", "Author": "IMForever28", "ReviewID": "UR127305275", "Content": "We booked a king suite at the Vino Bello Resort through a Travel Zoo special. The room itself was wonderful! There was a nice sitting area, kitchen, balcony, and even a washer and dryer (although difficult to use). The design of the hallway entrances to the rooms is odd. There is one door in the hallway which leads to a foyer area shared by two rooms. I think this helps to cut down on hallway noise, however when there is a shared area like that and the people in the other room are loud, it is amplified within that space. There is a huge parking problem at this resort and with the new expansion it will become even more troublesome. The parking lot is small and when it's full, people park along the street. It is a major inconvenience to park in the street and have a long walk back to your room, especially if you have luggage. At least they do not charge for parking. The resort is located in an industrial park. It's definitely not the location I expected based on the resort website. However once you are there, the beauty of the place takes over and you forget about the strange location. This is a time share resort and they will try to entice you to listen to their talk. I received a phone call before leaving on our trip to try and get me to sign up for their talk and was approached again at the concierge desk. I politely answered that I wasn't interested and they respected that each time. I did not feel pressured. We did not utilize the pool/hot tub area due to outdoor temperatures in the 50's. We ate at the lobby bar one night as well as the Siena restaurant on location. Please see separate review for this. Overall, we would probably stay here again.", "Date": "April 5, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Boston", "Title": "“Great stay with a beautiful view!”", "Author": "jwilson1897", "ReviewID": "UR127298693", "Content": "What a beautiful spot. It was a real treat to have a full kitchen and a fantastic king sized bed. We walked around the property including the vineyard out behind the hotel. The only downer of the whole trip was the extra pull out couch my sister slept on was NOT comfortable.", "Date": "April 5, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Corning, CA", "Title": "“Absolutely Wonderful!”", "Author": "LNYE", "ReviewID": "UR127266145", "Content": "This property absolutely exceeded our expectations. Wish we could have stayed longer! We had a one-bedroom condo type room. It was equipted with everything. If you are in the area for a Napa Valley or Sonoma Valley Wine tour, make sure to stay at the Vino Bello Resort. I can't think of any negative at all from the people to the room - everything was fabulous. We will be back soon & will leave more time to enjoy this property! It is a time-share property, and we booked we were asked if we wanted to attend a presentation. We did not and were never asked again or bothered about it at all. If you are coming to the Napa Valley, you must stay here! Awesome!", "Date": "April 4, 2012"}, {"Ratings": {"Service": "2", "Cleanliness": "4", "Overall": "2.0", "Value": "1", "Sleep Quality": "3", "Rooms": "5", "Location": "3"}, "AuthorLocation": "California", "Title": "“It seems strange when I'm supposed to be an owner...”", "Author": "MrLauren", "ReviewID": "UR126811022", "Content": "We arrived to see lot's of renovations being done (new automatic doors for the main hotel) I talked to the desk clerk at check in, she mentioned that there was a complementary bottle of wine, I'm not a drinker so I asked if maybe they had something non-alcholic instead, she said she would have some one get that to our room and exchange it. I had read about the aminities on the Shell Vacations web site and asked about the \"heated pools\" she said all the pools are heated to 80 degrees. I had told our children that we could go swim after we got settled in our room. They also have a complimentry movies you can pick up at the front desk. We checked in to a lovely room. At first glance the suite looked like it was in great shape. THE BAD...After further review it had some issues... 1) The phone system wasn't working at all. 2) Little things broken here and there. 3) The drier was very difficult to figure out and work with. It only had delecate cycle working so it took 3 hours for our clothes to dry. 4) THE POOL Heated to a BRISK 55 degrees...needless to say we did not swim in the pool. 5) Only one dvd player... At least the kids could watch a movie before bed time. 6) Little or nothing to do for the kids. THE GOOD 1) They let us have 2 movies instead of just the one we were supposed to have. 2) The hot tube was acutally hot and not 55 degrees also. 3) The rooms are visually beautiful we loved that they had a full kitchen and the decore was great. After all was said and done we had had enough and came home a night early.", "Date": "March 28, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Las Vegas, Nevada", "Title": "“Napa tour base - Vino Bella”", "Author": "canver5", "ReviewID": "UR126280077", "Content": "While some construction on the far end of the property prevented easy lobby access this was no problem to getting in to register. While access is supposed to be 4pm,we did not get our room until after 5. The reason, though, was we requested a second floor vineyard view which is worth the wait. We were in the Chardonnay building in an end unit which was very desirable for view, quiet and brightness (room 2322). We used our Shell Vacation points and must say this is one of the most attractive Shell properties as far as room layout and decorating. There were several maintenance issues that were annoying (dishwasher did not work properly and it took 3-4 visits from staff), light bulbs burned out, hairdryer kicked out. In all cases response was quick. These things come up and I think many people just don't bother to call and have them corrected, so we seem to have issues wherever we go. One of the best features is the readily available shuttle for pick up and delivery to town, so eating out was a breeze. When we had friends visit, we had to go down to the main door to meet them as they could not even enter the building to knock on our door. Minor inconvenience for something that is probably a great safety feature. You are super secure!", "Date": "March 18, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "2.0", "Value": "4", "Sleep Quality": "1", "Rooms": "4", "Location": "2"}, "AuthorLocation": "San Francisco, California", "Title": "“great value, but didn't have our room...”", "Author": "Tory L", "ReviewID": "UR125668709", "Content": "The Mertiage is a great deal and a beautiful property, and I would love to give it a 4 star review. However, I booked and pre-paid for a room with two beds to sleep four guests (bachelorette party), but when we checked in they were unable to give us the room, and instead gave us a one bedroom suite with one bed. The man at the front desk explained that they had no rooms with two beds left (even though it was only 5:30 pm at check-in) and that he was not sure what happened to our room but that this was considered an upgrade. We asked for a rollaway and they were also not able to give us that because of fire safety regulations. Our room was very nice, the pool area was great, and everyone we spoke with was friendly and attentive, but the couch bed was terribly terribly uncomfortable, springy and lumpy. A bad night's sleep and an aching back is not the ideal way to start a day of wine tasting. I won't be back because I can't trust that this wont happen again.", "Date": "March 5, 2012"}, {"Ratings": {"Service": "1", "Cleanliness": "4", "Overall": "2.0", "Value": "1", "Sleep Quality": "2", "Rooms": "4", "Location": "1"}, "AuthorLocation": "Wadsworth, Illinois", "Title": "“Nice place run poorly”", "Author": "Mike D", "ReviewID": "UR125245373", "Content": "I travel a lot so my expectations are realistic. I normally don’t have problems. I was very disappointed with the management of this place. Our rate varied from $200 on Sunday night to $300 on Friday and Saturday night. Not bad in season in Napa. Unfortunately you are in industrial park a ways from Napa. The A/C is extremely loud. This I could live with. My true problem is the management philosophy. The first morning we had no hot water. I called the front desk to let them know. They told me I was not the only one and they could not insure me it would be fixed. Second morning no hot water, called the desk they told me I was not only one and may not be fixed by the next morning. They said they would get some information and me call right back. I waited around, never received a call back. On the way out I bumped into a guy in the elevator who told me he had changed rooms because he had no hot water. That evening when we returned to the hotel I called and spoke to manager and explained everything. He tried to convince me this was the first they new of the problem, and that I was the only one with an issue and he would get it fixed. All hotels log complaints, he new much better then I did they have a problem with their hot water system. They sent a guy up, who was very nice and realized this was just game. They finally admitted they could not fix it. The manager never admitted they have problems with their hot water system that appears to be ongoing. They finally moved us to a room with hot water. When I say my problem is with the management, when you travel you will have a problem from time to time that is unavoidable. Your problem may be something other then hot water but how the management responds to the problem will be consistent. The fact that they feel its fine to charge me $300 a night for a room with no (not a little not warm) hot water is criminal. There are industry standards for items like this. They failed to make any effort to mitigate our inconvenience. I guess I could have went there and begged for some money off, but if that what it takes they can keep it. I should have had the credit card company stop payment but we booked through Orbits so that would be a pain. So I ask if you go there and have problems with your hot water please write a review.", "Date": "February 26, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Buenos Aires", "Title": "“Amazing Romantic Weekend”", "Author": "EdRaw", "ReviewID": "UR125149531", "Content": "We have booked vacations at Vino Bello Resort a total of 4 times now using Travel to Go San Diego, beginning a couple of years ago. We absolutely love the location, facilities and staff. You could not ask for a friendlier or more knowledgable and helpful group of people. The rooms are large and the room service amazing! We love wine and wine tastings and with it location only about 10 minutes from Napa, it is the ideal location...... not too close and not too far from all the wineries we love the most. Best of all, it is such a wonderfully romantic place..... Whenever we go there we always get a one room suite, complete with a hot tub and fireplace. Amazing. We have and will continue to recommend Vino Bello Resort to all our friends and family.", "Date": "February 24, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Anchorage, Alaska", "Title": "“Wonderful property!”", "Author": "Andrea K", "ReviewID": "UR125040797", "Content": "Lovely facility! Very peaceful setting and an excellent location. Our room was very spacious and felt as if we were in a nicely sized 1 bedroom condo with a full kitchen with granite counters. Housekeeping was very prompt and thorough. The spa was fabulous! I could have stayed there all day. It was my first visit to the Napa Valley and I hope to return someday. I would definitely stay there again.", "Date": "February 22, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Anchorage, Alaska", "Title": "“Shannon J.”", "Author": "Shannon J", "ReviewID": "UR125004023", "Content": "Beautiful facility - clean, nicely maintained. The spa facilities were some of the best I've experienced. Excellent location - wine country / restaurants, everything one could want is close by.", "Date": "February 21, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Seattle, Washington, United States", "Title": "“Excellent property!”", "Author": "Sarah K", "ReviewID": "UR124999788", "Content": "This property was fantastic, very quiet and relaxing. We stayed in a king room which was essentially a deluxe one bedroom apartment with granite counter tops and stainless appliances. They have a great restaurant, FABULOUS spa and tasting room on site. I have stayed there twice already and will absolutely stay there again.", "Date": "February 21, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "3", "Rooms": "5", "Location": "5"}, "AuthorLocation": "", "Title": "“Very Happy!”", "Author": "Perry M", "ReviewID": "UR124438395", "Content": "Pros - Value for you buck, very friendly staff, beautifully designed rooms, washer and dryer in the room, deep bathtub, kitchenette, fridge, microwave, complimentary bottle of wine, complimentary shuttle service to and from downtown Napa (they will drop you off wherever you like and pick you up as well. You just call when your ready to return and they're there in 15 minutes). Cons - Don't waist $14 on the breakfast buffet. It's not worth it. Order from the menu instead. Beverages are pricey. Over all we loved this place and will definitely return in the future.", "Date": "February 11, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Chico CA", "Title": "“Wonderful weekend getaway”", "Author": "allenpooh", "ReviewID": "UR124303418", "Content": "We booked this place blind for the first day of our weekend getaway to Napa. We paid about $100 for a studio, but upon arival were offered a 1 bedroom for an additional $30. The room was beautiful with a full kitchen and spa tub in the seperate bedroom. The staff was extremely attentive and the resort offers a shuttle to downtown if you want to eat or explore off property. I cooked dinner in the room and we ordered room service for breakfast, which was terific. The property is located on the south end of Napa Valley, and not in the mmost beautiful place, but the property itself is landscaped very nicely. It's about 8 minutes to our favorite winery (VanDerHyden...go there!) and the Stags Leap side of the valley. Tip, the quality of the wine is inversly proportional the size of the tasting room. Fancy building = crappy wine. Try to find the old experienced wineries, not the 400 or so that have opened in the last 15 years.", "Date": "February 8, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Azusa, California, United States", "Title": "“Romantic and Delicious”", "Author": "Graceramirez", "ReviewID": "UR124218006", "Content": "My husband and I are owers of Shell Vacations Club, this is one of thier beautiful locations. We alway enjoy our time there even if the weather is overcast, we just get a Limosine to drive us to private vineyards and enjoy several bottles of wine with our family and our friends who we invite to share this experience with us. The Resort has a beautiful rooms overlooking a wine cave and our rooms have plenty of room to entertain with a fireplace to keep us warm. This is were we would love to live when we retire.", "Date": "February 6, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Napa, California", "Title": "“Marvelous Resort”", "Author": "NapaDiamond", "ReviewID": "UR123922423", "Content": "As an owner of Shell Vacation Club, this is one of their properties. This was a \"staycation\" for us and we absolutely loved it. All the units have kitchens, which we really like as an amenity regardless of where we vacation. Raley's is just a few minutes drive North on Soscol, so you can pick up groceries there. The resort is not located in the heart of town, so if you are an urbanite, stay elsewhere. We like the location for the peace and quiet. The resort has a pathway through a vineyard to the Grape Press structure that you can see from highway 29. Cole's Chophouse is our favorite restaurant in Napa, try their Chocoloate Martini for dessert, yummy!", "Date": "January 31, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Granite Bay", "Title": "“Vino Bello - Outstanding Napa Resort”", "Author": "Steven R", "ReviewID": "UR123553284", "Content": "Available are two types of rooms either taken together or separately but connected by a small vestibule: One BR lock off (with kitchen, LR, BR and huge bathroom) and Studio King. VB is situated about ten minutes from downtown Napa and the beginning of the Silverado Trail. There are now three separate buildings comprising the VB Resort along with adjacent Meritage Hotel. Suggest looking at <www.shellvacationsclub.com> to review photos. My wife and I book the two connecting rooms for a week every November and invite friends to enjoy the Napa Valley and points north.", "Date": "January 24, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Pittsfield, MA", "Title": "“relaxing, excellent location, highly recommended”", "Author": "travelerista", "ReviewID": "UR122737213", "Content": "I stayed at Vino Bello for a business trip in early January 2012 and it couldn't have been better. The service was excellent, the location was very easy from the San Francisco airport, the main Napa highway with all the wine tastings, the Silverado Trail, and downtown Napa and Sonoma. The rooms were beautifully appointed and comfortable, the wine tasting in the cave was very cool, breakfast at the on-site restaurant was fabulous, and service was wonderful. The walking trail/vineyard up the hill was a happy surprise, and the jazzy guitar music piped out at the two pool areas and firepit made it very welcoming. Wish I had time to visit the spa. I would seriously consider purchasing a timeshare here.", "Date": "January 7, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "5", "Location": "3"}, "AuthorLocation": "The OC, California", "Title": "“Gorgeous resort, terrible construction!”", "Author": "missysmovin", "ReviewID": "UR122604425", "Content": "Stayed in a one bedroom unit and were very impressed. Room was gorgeous with jacuzzi tub, fireplace, spacious bathroom, well stocked kitchen and nice bed linens (except too large pillows but fortunately I had brought my own). Loved taking walks in the vineyard, playing bocce ball and the wine tasting evening was very nice. We had room service and ate at the onsite restaurant and it was excellent. The staff was wonderful as well. Unfortunately I can't give it 5 stars for the following reasons: Wi-fi was very slow at times and didn't work in certain areas. They should suspend the mandatory $15/day fee until they get this worked out. But our big complaint was the noise!! It was a little riduculous. We could hear EVERYTHING our neighbors did - closing doors, closing drawers, every step they took, we could even hear what they were watching on TV. For 2 or 3 nights in a row we were kept awake from the night owls above us walking around etc. The worst was on the 4th night when they checked in a new family above us at 3:00am!! (not kidding). So again we were kept awake by the really loud noise of them settling in. We called the front desk and they apologized but nothing seemed to change as the noise continued till almost 5:00am. We were not happy!! The hotel is aware of their major noise issue so they should either not allow check-ins at that hour or be considerate to their presently booked guest and put the late check-ins on the ground floor or at least in a room that doesn't have guests right underneath who they know are TRYING TO SLEEP! As unhappy as we were wth that situation we will likely return if we can be guaranteed a third floor unit as we loved everything else about our stay. Or now we'll at least know to bring earplugs :)", "Date": "January 5, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Palm Harbor, Florida", "Title": "“An Upscale Apartment”", "Author": "DnA4Ever", "ReviewID": "UR122494452", "Content": "The Vino Bello Resort was an exceptional experience. There are seperate buildings, much like a small, upscale apartment complex. Our one-bedroom suite was esconced in the Chardonnay building. It was luxuriously appointed in most everyway. The suites were clean, with obvious attention to detail. The suite design was warm and charming, yet with a new feel. We did, however, experience an unfortunate glitch our first night. We were visiting during a chilly night in October, so we turned on the heat. By the wee hours of the morning it was very clear the heat was not working. It proved to be a rather uncomfortable night of \"half-sleep\" as we opted not to have a repairman in our suite in the middle of the night. We contacted the front desk in the morning and the issue was addressed by the time we returned from some lovely local vineyards. I was a little surprised that we weren't offered some small perk or recompense for our trouble, however. All in all, I would give the Vino Bello a 4.5 out of 5 stars, if it were an option.", "Date": "January 3, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "", "Title": "“Wonderful and memorable experience!”", "Author": "marnique", "ReviewID": "UR122279464", "Content": "Perfect place to stay especially with kids.....very clean, spacious, comfortable and staff is very friendly and helpful. My family and I enjoyed our stay and will surely stay again every time we come to Napa.", "Date": "December 30, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Blaine, Washington", "Title": "“A Taste of Napa”", "Author": "mjlulu", "ReviewID": "UR122088606", "Content": "We recently stayed at the Vino Bello Resort while visiting the many wineries of Napa, and cannot say enough about how much we enjoyed our stay. We reserved a one bedroom unit, and the accomodations where outstanding. To say it was luxurious, would be an understatement. The staff were extremely courteous, knowledgable, and ready to give us advice on what do to while we were in Napa/Sonoma. We will definitely return to the resort on our next visit. Traveler tip: visit Napa in the off season, tasting rooms are not crowded, rates are lower, and selecting a restaurant is easy. Don't miss the Hess Art Gallery, Artesa Vineyard, or dinner at the Greystone Culinary Institute.", "Date": "December 25, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "3", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Sacramento, CA", "Title": "“Excellent Option in Napa”", "Author": "CMFM", "ReviewID": "UR121721899", "Content": "We had business in the Napa area and came a day early for a little R & R. Got a great rate on Priceline for this property but I didn't know what to expect. The reviews sounded very positive though and they were right. This is a great spot; romantic and relaxing. The hotel is part of a time share and there appears to be a variety of room sizes - ours had small kitchen, couch, washer and dryer, large bathroom with soaking tub and comfortable bed. The pillows were NOT comfortable however - two were too large and two others were small and soft. That messed up sleep a bit. Room was quiet but that is probably because there were not many people staying in that section. I heard housekeeping staff in the room next door when we arrived and they were a bit loud. No problems though, quiet all night. We enjoyed a couples massage at the Terra Spa. Spa was spacious, well appointed, and so relaxing, we were the last clients of the day and it was perfect way to unwind. Had dinner in the restaurant - we shared lamb chops, short ribs and a lot more food than we should have - and it was all excellent. Cocktails and wine suggestions were also spot on. Better pillows, a nicer view and some attention to detail in the rooms (some dings in the paint in spots) would have moved this stay into the Excellent category. However, we will likely stay here again when we have the chance, because even though it is not IN the town of Napa ( it is actually located amongst groups of office complexes, the Vino Bello provides comfortable room options, a great spa, a wine tasting cave (closed by the time we got done with massages) and a terrific restaurant. All within very close drive to Napa, and Yountville.", "Date": "December 14, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "2"}, "AuthorLocation": "Portsmouth,nh", "Title": "“Memorable Experience”", "Author": "sam k", "ReviewID": "UR121179419", "Content": "This place is so romantic and maintained exellently. They have a good sized jacuzzi tub next to master bed and a walk in shower. I had a great time in here with my wife.", "Date": "November 28, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Peoria, Illinois", "Title": "“Fantastic accomodations, helpful staff”", "Author": "familytime000", "ReviewID": "UR120701330", "Content": "This is a very nice resort. We had a 1 bedroom, 1 bath with a full kitchen, living room and balcony. We also had a fireplace and a jacuzzi tub. Our room was nicely furnished and beautifully decorated. Everything was clean and newer. The staff was courteous and helpful. The location of Vino Bello is at the south of the Napa Valley area. It's easy to drive to both the Napa valley and Sonoma valley wineries. (The resort is located near a business park and there is some industrial business close by, but they don't cause any problem.) I would definitely stay here again.", "Date": "November 17, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Los Angeles, CA", "Title": "“Clean and new”", "Author": "EuroShiro", "ReviewID": "UR119951026", "Content": "This place was very clean and new. We were first placed in a building which was just being finished but were switched to a different room the next day, no hassle, no fuss. The gym isn't well equipped but the pool area is nice.", "Date": "October 31, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Ventura County, CA", "Title": "“Nice stay”", "Author": "AARC", "ReviewID": "UR119798454", "Content": "Vino Bello is a timeshare resort owned by Shell Vacations. We are an owner, but that could be weird for someone who isn't familiar with timeshare places. We enjoyed our stay. They gave us a free bottle of wine from the winery located on the property, which is technically called the Meritage. The best things about the Vino Bello is an on-site bar, on-site tastings, a jacuzzi, BBQs, a kiddie pool and water play area, vineyards on the property, a restaurant on the property, AND a spa. We like to go into towns and explore, but I could see how you literally could have everything you need there, especially if you've had enough tastings for the day and just need to chill out without driving. Also, if you're there with family/kids, it would make it really easy to sneak away and do the spa or a wine tasting without cutting out the kids for long. Just really convenient and a nice place. Also, even the studios have a kitchenette with microwave, sink, and whatever you need. No stove in the studios, but there is a toaster oven that you can use to cook some things in. Also, the bathtub was large and could actually fit those that don't usually fit! Not too far from downtown Napa. Not right in the heart of the wineries, but not a terrible location either. Hopefully you have a smartphone so you can find it at night, though. You'll go through a corporate park before finding it, and it would be easy to not find it or think you're in the wrong place.", "Date": "October 27, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Dallas, Texas", "Title": "“A classy place!”", "Author": "Babysis727", "ReviewID": "UR119157978", "Content": "The condo was beautiful with quality furnishings! The property was beautiful with a nice view of the vineyards. The staff was very accomodating. The restaurant was delicious with good service (only ate there one time). There are just a few things which would make it better: 1.. closer in town for Napa, but it only takes a few minutes to get to downtown Napa or other towns in the Napa Valley. 2. better insulation between the rooms. noisy at times. 3. better quality mattress on sleeper sofa. I wish all condos (timeshares) were this nice!!!", "Date": "October 10, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "3", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Dunedin, Florida", "Title": "“We are so glad we chose this property!”", "Author": "AndiS77", "ReviewID": "UR118907167", "Content": "Having read reviews about Vino Bello on all sites including TA we were torn about staying here at first. Not because we though we'd have a bad experience but didn't want to miss out on being \"in\" Napa and missing all the action. We couldn't have been happier with the location of this property or with the property itself! The property is near an office park (clean and quiet) but we really wouldn't have even known unless we were coming or going as you couldn't see it from most rooms. The check in was smooth and the staff was delightful. The doorman never failed to say hello when he opened the doors for those coming and going and the receptionist was cheerful and helpful. Our room was a 1 bedroom condo (room 2315) and the layout and amenities were worth the upgrade. A large spa tub was in the bedroom and a huge walk in multi jetted shower was in the bathroom. The entire condo had granite counter tops and mostly tile floors except the living room with fireplace. We used the kitchen every morning to make breakfast and it was equipped with everything we needed. We especially enjoyed sipping wine on the huge porch overlooking the pool and on-site vineyard Trinitas. Some reviewers complained about noise but we never had an issue-we were on the top floor in the Chardonnay building and it was peaceful except a night with some pool revelers that stayed up late. The property as a whole is beautifully maintained. Gorgeous roses and lavender growing everywhere leaving the air fragrant. There was ambient music playing softly from speakers throughout the property. There were fire pits to warm your hands and sit next to in a few places as well. We visited the wine tasting room in the cave cellar Trinitas and enjoyed their wines and even joined their wine club as it was very reasonable and had surprisingly good wines for the price. We only had two nitpicks during our stay. When we checked in there were ants we had to have someone come and treat the room. I will say we mentioned it to housekeeping on the way out the door for the day and we forgot the camera and literally as we came off the elevator to run back in and grab it they were already in the room spraying! The other nitpick was the jetted tub in our room. There was a residue that built up in the foam (not every time we used it strangely) that was unappealing and left us unsure about using it. Because of this I cannot give VB a perfect rating but wish there was a 4.5 option..lol. All and all we very much enjoyed staying here and look forward to a return trip!", "Date": "October 3, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Acton, MA", "Title": "“A great place to launch your wine tours”", "Author": "Challah", "ReviewID": "UR118585133", "Content": "We found Vino Bello through our Shell Timeshare. The accommodations were roomy, clean and comfortable. We've been there in the fall and in the spring, separated by about a year and a half. The staff was gracious and helpful on both trips, but have to say we loved it a little more in the fall. What could beat having a message from the front desk telling you the merlot grapes were being harvested that day if we wanted to watch? And so we opened our curtains and there it was. Vino Bello also provides a shuttle bus into Napa to keep wine tasters safe. A nice feature. The location was off the highway and seemed to pop up from nowhere, but since our suite faced the vineyard and the giant sculpture of \"The Crusher,\" we had no complaints with that. The kitchen was well appointed and everything worked. Outdoor grills were available to those who wanted to cook. The bathroom was luxurious, with a separate spa tub between the bedroom and the shower and toilet part of the bathroom. It was a nice extravagance. The outdoor pool provided a place to rest between wine tours and wonderful meals. The small balcony off the large living room was where we had our breakfasts and came back for the sunsets with a glass of wine. I have no idea what the cost is as a hotel rental, but as a timeshare, it was a steal.I have no doubt that we will return.", "Date": "September 25, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Sleep Quality": "4", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Hong Kong", "Title": "“Nice stay option in Napa Valley”", "Author": "BradJill", "ReviewID": "UR118390972", "Content": "We booked the one bedroom suite (w/ pullout sofa bed) at the Vino Bello Resort through booking.com for $349 and $299 (for Sat and Sun night). The resort charged additional fees of $15 per night (resort fee), $48 per night occupancy tourism tax. This made the price of our stay a bit high for a two-day stay but we were generally happy with our stay at the Vino Bello. We stayed in the Chardonnay building, which overlooked the pool and a hillside vineyard just beyond the pool. Our suite offered efficient central heating/air conditioning, a washer and dryer, full-equipped kitchen with complimentary coffee, bottled water and bottle of Muscato from the Trinitas winery. There was one spacious bathroom with an excellent shower with five separate heads (nice!). The living room furniture was very comfortable and the TV channel selection was standard and sufficient. The sofa pullout bed was not terribly comfortable, probably best for younger children, less suitable for older adults and not advisable for the elderly. The master bedroom included a very comfortable bed, and medium soft pillows that felt to be feathered. There was a television, plenty of space and a safe large enough to hold my laptop, large camera, extra digital camera and paperwork. There was also a patio that overlooked the pool and hillside that included four iron cushioned chairs as well as a two seat bench of similar make. This was nice for a morning coffee and afternoon wine after a day of wine touring in Napa. The Hotel restaurant called Siena Restaurant was also very good. We had two very nice breakfasts there twice and evening room service – ordering two hamburgers and a cheese ($14.00), pepperoni and Italian sausage pizza ($13.50) and two chocolate deserts – can’t recall the price. Everything that came from Siena was very good to excellent, easily recommendable, making it a decent idea just to eat at the Vino Bello instead of going into Napa centre to find good food. Lastly, the service of the hotel was superb. We had a quick check-in and check-out experience and the concierge helped highlight the Napa region, suggest wineries based on our wine preferences and called in our afternoon tasting reservation to Del Dotto as well. Room service staff was very punctual and friendly. Overall, other than the less than comfortable sofa bed, I find few areas of improvement for the Vino Bello and offer high recommendation for choosing this resort as your base for exploring the Napa region.", "Date": "September 20, 2011"}, {"Ratings": {"Cleanliness": "3", "Overall": "2.0", "Value": "1", "Sleep Quality": "1", "Rooms": "2", "Location": "1"}, "AuthorLocation": "NJ", "Title": "“AVOID: Dated Overpriced Rooms + Additional $15/Day Resort Fee”", "Author": "PD2K", "ReviewID": "UR118373208", "Content": "Stayed here over the weekend. I never heard of this hotel, but since all the major hotels in Napa were booked I decided to take a chance on it. I now regret my decision. I cannot fathom anyone who has stayed in a decent hotel giving Vino Bello a positive review. First of all, the hotel is way overpriced - charging $230/night. You'd get a better deal at the Marriott, Embassy Suites, or Hilton at a lower price. The $15/day resort fee is a TOTAL SCAM. This is in ADDITIONAL to the daily rate. The location is in a corporate park located far from the vineyards. The rooms are dated and damaged - dents in walls and doors. Breakfast is NOT included, unlike most other Napa hotels. The only reason I see staying here is if you are a time-share member. Otherwise avoid like the plague. There are far better and cheaper options available.", "Date": "September 20, 2011"}, {"Ratings": {"Location": "4", "Overall": "5.0", "Value": "4", "Service": "5", "Rooms": "5"}, "AuthorLocation": "Aurora, Illinois", "Title": "“Beautiful rooms!”", "Author": "rsmcg", "ReviewID": "UR118288204", "Content": "My friends and I stayed in a one-bedroom condo. It was very beautifully furnished, with full kitchen, fireplace & large bathroom. With the stainless steel appliances, granite countertops, large shower & soaker tub, it is one of the nicest places I have ever stayed. Everything was very clean. I would definitedly recommend this hotel.", "Date": "September 18, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "4.0", "Value": "4", "Service": "4"}, "AuthorLocation": "Ft. Mill, Sc", "Title": "“great value for time share owners”", "Author": "nb29707", "ReviewID": "UR116969338", "Content": "I had business at the Meritage next door, then used my time share for a 1 bedroom king unit. It was very spacious. The service was good, they cleaned the room ,made the bed ,changed the towels ,and supplied water and coffee etc. everyday, It is full kitchen with pots and pans and glasses etc. The grill by the pool is available to use and is cleaned everyday. The bed was comfortable and the bath was fantastic. The shower with 4 shower heads and the top one are great. You need a car to stay here. They have a shuttle but only for dinner in Napa. You can use the Meritage work out room and the spa is very nice. Free wifi and free local calls are nice for arranging wine tours etc. People complain about the location in a business park but the views out the back are of the vineyards and the pool. It is great. The restaurant is so-so. The breakfast buffet is ok but the best is the Meritage breakfast for $10, 2 eggs , bacon or sausage, potatoes, and sour dough bread.. Tea is $2.99 I think which I think should come with the breakfast. It's free in the lobby. If you have a time share check it out. I think the points required are very little compared with others I have used. I would go back for sure.", "Date": "August 19, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "4", "Overall": "4.0", "Value": "3", "Service": "5"}, "AuthorLocation": "California", "Title": "“location not too great but a beautiful place to stay at..”", "Author": "WithLove71", "ReviewID": "UR116833758", "Content": "we loved our stay here , enjoyed the pool and spa , the rooms were very beautiful, a little pricey for the location of the resort ...", "Date": "August 17, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Mesa, AZ", "Title": "“LOVE, LOVE!”", "Author": "Schmitts", "ReviewID": "UR116591658", "Content": "What a beautiful resort! We had a one bedroom (king sized bed) with connecting bedroom. (This makes their 2 bedroom) The decor is gorgeous. We walked in and my husband said it was the nicest hotel room he's ever stayed in. Granite counters AND dining room table, spacious kitchen, gorgeous travertine and glass shower, XL bathroom and jacuzzi tub. I can't say enough about how nice the rooms were. And we received a free bottle of wine as a 'Welcome Gift\". Bed and pillows were comfortable. Even better we had first floor that walked out to the pool. We did not dine here or use the spa, but we did spend time in the pool area and we would go back just for that. Our 4 year old had a blast playing in the sprinkler area (water shooting up from the ground) and the kids pool. We used the grills in the pool area both days. The grocery store is only a couple miles away, as is Target in the event you forget something. The views from the hotel are non-exsistent but this place outshines its boring surroundings! We will be back just to stay at the hotel and enjoy it's amenities (in summer-time). I have no idea how much the rooms cost, we are Shell Vacation owners and it was worth all the points we used. I will say though that the resort is very classy.", "Date": "August 11, 2011"}, {"Ratings": {"Cleanliness": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Harbeson, Delaware", "Title": "“Hated to Leave”", "Author": "rugirldc73", "ReviewID": "UR116575521", "Content": "This resort thought of everything. Unlike other timeshare locations, the towels and ammenities were changed daily. Even bottled water was provided daily. The location had its own vinyard and tasting room so no travel was necessary. However, a shuttle was provided for those who wanted to go into town. A bottle of wine was chilling in our refrigerator. Although we did not try the restaurant, the facility looked lovely including outdoor dining. The public rooms were beautiful. CDs could be borrowed and popcorn was provided. The robes made it special. We are planning to return for a longer stay.", "Date": "August 11, 2011"}, {"Ratings": {"Cleanliness": "3", "Sleep Quality": "2", "Overall": "2.0", "Value": "1", "Service": "1"}, "AuthorLocation": "Pensacola, Florida", "Title": "“Definitely NOT a resort, NOT a good location, TERRIBLE value, DO NOT STAY HERE!”", "Author": "seasand55", "ReviewID": "UR116026546", "Content": "It's ridiculous that this place is called a resort. It's located in a business park, it's still under construction, it's not near any of the wineries, it has no view, it's terribly expensive for what's given, once there you can totally tell you're in a time share. The room itself was nice, big and comfortable with a kitchenette, but after visiting the wineries you don't want to have to drive far away to reach your room. We were there for our honeymoon and they gave us a complimentary bottle of wine, which was nice, but this is not what you expect from a so-called resort. They say they have a shuttle to downtown Napa (not any of the wineries) but it only seats 8 people, arrives every 20-30 minutes and only until midnight. It's a 7 minute drive to downtown Napa, makes no sense...We also had to complain twice about the concierge. Upon checking in he forgot to give us his packet so he decided to call at 8am the next morning! They knew we were here in our honeymoon and obviously on vacation...who calls that early in the morning?!? Then, he just shows up at our door and walks into our room?!? We scream, he leaves the \"packet\" and runs off. This important packet consisted of brochures and a wine bottle opener...ridiculous! We had already decided what wineries to visit and were not in need of this crappy brochure packet. Overall this place sucked and would not recommend it to anyone. We should have stayed at a b&b...since we had booked The Donatello in San Francisco and they are owned by the same parent company we thought it was a good choice...obviously not! We couldn't believe the Donatello was so great and this place totally not! We hope to go back to Napa Valley because it's beautiful & we love great food and wine, but will NOT stay here again.", "Date": "July 30, 2011"}, {"Ratings": {"Cleanliness": "3", "Sleep Quality": "3", "Overall": "4.0", "Value": "4", "Service": "4"}, "AuthorLocation": "Fresno, California", "Title": "“Decent hotel with kitchen and washer/dryer”", "Author": "Calitraveler559", "ReviewID": "UR115306387", "Content": "We booked through priceline and ended up here in a studio room. Vino Bella is located right next door to The Meritage. It is not in Napa proper, but that was not critical for us as we arranged a car to take us to dinner in Yountville through the concierge at The Meritage. The wine cave there was very casual and laid back, which we appreciated since Napa tends to be busier than Paso Robles or Sonoma. Our room was okay. The air was loud, but air conditioners at hotels tend to be that way. Maid service was not the best...our tub was dirty and there was no way I would have taken a bath in there. I complained to the front desk and they were apologetic. The nice thing about the rooms is that since they are essentially time share, you have a mini kitchenette and washer/dryer. Oh, wireless is included in resort fee, but my iPad would not pick it up in our third floor room.", "Date": "July 13, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "4.0", "Value": "4", "Service": "4"}, "AuthorLocation": "North Chicago, Illinois", "Title": "“A lovely resort”", "Author": "Beenaroundtheworld2", "ReviewID": "UR115100642", "Content": "We stumbled on this through a websited but found it to be a lovely hotel/condo resort. Our room was spacious with a fridge sink etc. We were able to chill wines we bought and there were glasses provided. The resort had a beautiful pool and winery attached. They offered free tastings in their cave at 5 each afternoon. They Staff was friendly although the concierge never followed through on sending me the ways to reserve a driver for touring when I requested it 3 times in advance by phone and email. We did however secure a WONDERFUL driver Donald at Beau Wine Tours and he was spectacular. The hotel was a good price considering it was prime time and we ate breakfast there which was excellent. They offered shuttles to downtown Napa for free which was nice. We really enjoyed it here and would stay again. The lighting was a little dark particularly for 4 women trying to do makeup but that was our only complaint : )", "Date": "July 6, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "4", "Overall": "5.0", "Service": "5"}, "AuthorLocation": "doylestown, pa", "Title": "“Wonderful hotel, perfect for staying in Napa”", "Author": "lpaoli23", "ReviewID": "UR114681754", "Content": "Such a full amenity resort! We had a room with a kitchen and family room and two bedrooms for our family of five. It was absolutely the best way to go because we took full advantage of the swimming pools, fitness room, bocce court, and spa. We were able to save some money too by buying groceries and eating in the room versus having to eat every meal out. Only negative things to say is that it is at the bottom of Napa Valley so it is not in the middle of all the wineries and it is located in a section of corporate office buildings. Neither of these outwayed our positive opinions of the resort though because the rooms were gorgeous and the amentities were perfect.", "Date": "June 23, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Edmonton, Alberta", "Title": "“The Best of the Best!!!!”", "Author": "Windy236", "ReviewID": "UR114581523", "Content": "We absolutely had a lovely stay at the Vino Bello Resort. The staff were excellent in every way. The room as requested on the third floor on the cornor to avoid alot of noise was perfect in every way. There was not anything that we could have improved on in this stay. When we called about the airconditioning the staff responded within 5 minutes and had it repaired. The resort goes to a great deal of effort to make your stay perfect as ours was. Would go there again in a heartbeat.", "Date": "June 20, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "4.0", "Value": "4", "Service": "5"}, "AuthorLocation": "Tennessee", "Title": "“Nice place”", "Author": "Girltime", "ReviewID": "UR113127246", "Content": "Really nicely appointed rooms with all amenities. Washer and dryer were a big plus! Friendly staff, very helpful. Decent location, as it is close to Napa city, and access to Highway 29 and Silverado Trail to get up into the valley or to Sonoma too. Room service breakfasts were great! Everything was cooked perfectly. Parking was crowded, but that just means that they are doing a great business!", "Date": "June 13, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "1", "Overall": "2.0", "Value": "2", "Service": "2"}, "AuthorLocation": "Sherbrooke, Canada", "Title": "“Horrible stay! Highly disappointing....Noisy, Noisy, noisy, noisy. Left 1 day early on a 3 night stay.”", "Author": "chevalresque", "ReviewID": "UR112973573", "Content": "Wow.... I was not expecting to be THIS diasppointed by this one. This was supposed to be my leisure time after my buisness in sacramento. I wanted to pamper myself in what appeared to be a very nice 4 star hotel. I had nowhere to go, I just wanted to relax and enjoy the sights and spa. The pool and spa are quite beautiful. The spa is actually in the cellar, which is a nice touch. The landscaping is very pretty and it is quite enjoyable to walk in the vineyard. But wow, the room was horrible. It is pretty yes... but that is it. Ist was sooo incredibly noisy. I was woken up at 6h00 by the kids in the other room and the cabinet doors in their kitchenne that just echoed in my room. And at night, untill 11h00 it was the TV. The disposition of the rooms make it so that the kitchennettes are on the other rooms wall. And the TV is on the counter, also on the other person's room wall. Usually in high priced hotels (like the hilton where I had a relly really nice stay), the kitchen is on the corridor wall and the TV on an inner wall or an ouside wall to minimise the noise. I had a terrible time and even cut my trip short because of the paper thin walls. It was HORRIBLE. I just couldn't get my basic sleep, and I am on VACATION, in a luxurious hotel... Unacceptable. I had a room on the third floor on my second night after I complained about the noise in my first room the first night (and a free breakfast---which would have been fine if my noise problem had been solved, but it was not. The same thing happened). It seems all rooms are built the same and all poorly insulated. They were kind enough to change my room to one on the top floor, but it was the EXACT same thing. I could hear everything in the other room: their TV, I could even tell which games they were playing with their kids (Simon says, 50 questions)... and they were not screaming, and I was watching TV or in my bed. I could hear them walk---even on the top floor, and the doors of the kitchenettes every time they closed, as they are directly on the other rooms wall, which makes little sence. Even the comfort inn where I stayed many times as a student has better insulation, and it is a budget hotel. The noise kept going till 11h30 and started again in both rooms around 6h00. I just wanted to sleep till 8h00am and I couldn't even do that. I tried to sleep with my earplugs, but I could still hear the loud bangs of the doors and the kitchen cabinets. This is unacceptable for a hotel of this class. UNACCEPTABLE. I stayed 2 nights and left for the third. I could not stand staying one more night. Also there were a lot of minor mishaps with the room itself: We didn't have a clock-radio, and there was no fan over the mini-oven so the hole room smelled. The little fridge in the first room wasn't even bolted to the counter and kept tipping forward. There were no doors in the lower cabinet where the trash cans were. and no pressure in the shower. AND no vanity to put our things because of the pedestal sink, so we had to put them on the side of the tub. Real fancy. This was the first room. The second was fine except the lack of a fan. There should NOT be so much difference amongst rooms of the same category. First room unacceptable for a luxuary hotel, the other was fine. Customer satisfaction should be important to any hotel. Because I complained the very first night and left after the second because of the same situation, any self respecting hotel would reimburse my hole stay. But as I checked-out and complained again, the hotel says it's in the hands of expedia and expedia in the hands of the hotel... and I am in hell. And now after 4 attempts to reach the unreachable manager during the rest of my vacation ---which took about 2h30 of my time---, expedia tells me the Vino BEllo will only reimburse for the night I didn't use, which was a given... but they really don't seem to care about the quality of my stay, after all I did get a free breakfast and a change of rooms. What am I complaining about. So what if I was constantly hearing my neighbours, so what if I couldn't sleep... This would not have been even a question at most hotels and they would have reimbursed me. Afterall, I paid for a luxury hotel and got only 2 star quality (in my room of couse). Usually, hotels have a satisfaction guarantee, but apparently here they do not. So, even with the horrible stay I had, I could not be reimbursed and I stayed 2 nights in 2 different rooms and left the other night I had reserved. That doesn't sound like a happy customer. It is pretty clear. So, if you're a family with small children and get up at 6h00, this hotel might be ok for you. Just pray all goes as planned... but my advise is: stay away from this horrible hotel....", "Date": "June 12, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Quebec, Canada", "Title": "“Great place!”", "Author": "LufTravel", "ReviewID": "UR112652797", "Content": "Stayed for 2 nights, very much enjoyed it. The rooms are HUGE with a fully equipped kitchen, laundry, lovely bathroom, jacuzzi tub. The bed was so comfy we are going to call the hotel to ask what type of mattresses they have! Ordered a pizza room service which was speedy and yummy. Enjoyed a few quiet moments by the pool (until a loud guest decided to ruin it but that's not the Vino's fault). Also indulged at the Spa Terra, loved the massages and facials. Very impressive facilities and the staff were great. Yes it is in an industrial area but so what - the room are great! Target and a supermarket are less than a 5 minutes drive away with everything else not not too far either. Could have lived without the concierge trying to convince us to go to the time share presentation though.... We stayed on the third floor overlooking the pool and vineyard no complaints - thanks Vino!", "Date": "June 10, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "3"}, "AuthorLocation": "California", "Title": "“Excellent Amenities, Great Value”", "Author": "orion_8", "ReviewID": "UR107432538", "Content": "I recently stayed in a studio room with three other friends at Vino Bello and we were all pleasantly surprised with the hotel. Although the room was MUCH smaller than we anticipated, it was very clean and it looked great. The hotel staff was very nice, and the pools were well maintained. Guests at Vino Bello are allowed to use all of the resort amenities at the Meritage next door, so we spent most of our time in the Meritage pool and spa. Overall, my friends and I had a great experience at this hotel. The only downside is that it is a bit far from most of the wineries and touristy things in Napa, so it might not be the best option for people looking for a close-in resort.", "Date": "May 8, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Norman, Oklahoma", "Title": "“The room are exquisite”", "Author": "JajaLalaMimiEE", "ReviewID": "UR107132191", "Content": "The 2 room setup are just the way to go with family and friends. The bigger room-The Suite is setup with full kitchen, Laundry closet, Dinning area, Living room with sofa bed, Private plush bedroom with Jacuzzi and the biggest luxury bathroom. Plus you also get your functional balcony with full set of patio furniture great for the awesome Napa outdoor dining both accessible from the main living area and the master bedroom. The smaller suite is enough for 4 with a small kitchenette, minus the jacuzzi. We are planning on coming back as often as we can to this relaxing property. Complimentary wine, Heated Pool with hot tub, Patio area for family grilling, Super kid friendly. If you can sit thru a timeshare presentation and not succumbed to buying then take then up for a 45min talk and get your free stay at some more awesome freebie.", "Date": "May 6, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Monterey, California", "Title": "“Lovely resort, versatile location, would recommend for Napa”", "Author": "samthefish06", "ReviewID": "UR106932258", "Content": "I chose Vino Bello resort for my stay, I was debating b/w this, Embassy Suites, and Hotel Avia. I was staying for 5 nights, to enjoy a leisurely tour of wine country. While some reviewers wrote the location is a con, I found it to be a plus. The resort is 10 minutes drive from downtown Napa, but I enjoyed being away from town. Another plus for me was versatility, having easy access to either Silverado Hwy or Hwy 29. The wineries I wanted to visit are located along both of these, and I would have felt limited if i had to drive a long way to get to the other hwy. The rooms are tastefully decorated, very homey, and full of amenities. We did not have any noise issues as some other reviewers noted, even though the resort did look fully-booked and thus I was concerned. I did call ahead and request a 3rd floor room just in case. I would recommend this resort to other visitors to Napa!", "Date": "May 5, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Toronto, Canada", "Title": "“Wish I stayed longer...”", "Author": "hgreen11", "ReviewID": "UR103207421", "Content": "Was only here for 1 night in December. Wine toured during the day and went out in the city for dinner (Morimoto - wasn't good). Booked the hotel on PL and couldn't be happier. Didn't know I was going to be hit with a resort fee upon checkout but it wasn't a big deal. Had a bottle of wine in our room waiting for us, and the rooms were amazing. Even though we weren't staying long-term, would be great if we were with the in-room laundry, and kitchenette. The room made us feel at ease. Wish it was a little warmer and not raining so we could have used the outdoor pool/spa. Would definitely come back for more than a night.", "Date": "April 7, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Fountain Valley, CA", "Title": "“Beautiful, well-appointed, great customer service”", "Author": "Boester", "ReviewID": "UR97046877", "Content": "Using a travel-booking website, I bid on a room without knowing the hotel name and was pleasantly surprised when it was revealed as Vino Bello Resort. I called ahead, requested and received a room with a king bed on the top floor. Very new property, I'm guessing the Vino Bello was originally meant to be marketed as a condo or time-share resort, as the room was fully furnished with washer/ dryer and a kitchen with utensils. Fluffy towels and robes, I was in heaven, until: Though clearly not sold-out, I realized they booked me right next door to another couple/ party. Thin walls or just loud neighbors, I called the front desk looking to be relocated, mystified as to why they would put people in rooms right next to each other when the parking lot was near empty. I was moved to a complimentary upgraded suite, complete with fireplace, jacuzzi tub, full kitchen/ bar. I could have stayed forever ... $15 Resort fee included a nice bottle or wine and wireless internet.", "Date": "February 17, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "elizabeth, colorado", "Title": "“Came back for a second time.”", "Author": "asmile2day", "ReviewID": "UR97029645", "Content": "My husband, brother and sister in law and myself stayed in Vino Bello during their grape harvest in October. We had stayed there when it first opened and loved it and were excited about sharing our experience. It was just as wonderful as the first time. Great rooms! Everything you could want. This time we had 2 studios as we had plans for eating out at some of the great restaurant. Very comfortable. We also have had a suite which was also outstanding. Suites are great for families that like having a full kitchen.", "Date": "February 17, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Hawaii", "Title": "“Amazing Resort!”", "Author": "poiboiz", "ReviewID": "UR95933444", "Content": "We stayed in a 1 BR Condo and the unit was very beautiful and well appointed. Full kitchen, fireplace, spacious living room, large balcony, beautiful master bedroom, large bath tub with jets, large shower/bathroom area. Perfect for families! You are a few miles from downtown Main Street Napa, but the resort offers free shuttles to town. The Spa is over the top!!! Great resort amenities. Definitely recommended for singles, families, honeymooners, etc. The only downside to my stay was having to check out...wish we stayed longer!", "Date": "February 8, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "3"}, "AuthorLocation": "Noosaville, Australia", "Title": "“Wonderful retreat for Xmas”", "Author": "noosamode", "ReviewID": "UR95737396", "Content": "We spent three nights at the Vino Bello as our Xmas on the way to San Francisco which proved to be an excellent choice. We had a two bedroom condo (one huge room with full kitchen and everything you could possibly need and a connecting room with a two double beds and kitchenette) and we spent a lovely (although very rainy) Xmas day there. The beds were soooo comfortable, bathrooms were large, fireplace, balconies and a nice view over the vineyards. We had Xmas dinner in the restaurant which was nice but not wonderful however the resort was well presented and staff very friendly. The hotel is located on the end of Napa so is a 10 minute drive to the city and more to the vineyards but it was a quiet location and excellent accommodation which I would highly recommend.", "Date": "February 7, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "1", "Rooms": "3", "Location": "2"}, "AuthorLocation": "Fresno, California", "Title": "“Nice stay except for the thin walls and celing!”", "Author": "headmofo1", "ReviewID": "UR94749828", "Content": "A previous review of the Vino Bello Resort was very accurate. For a fairly new facility the walls and ceiling should be better insulated. We booked their standard room on priceline. When we got to the resort we upgraded to the condo. The condo itself is great, but we had a rough time sleeping because we were on the second of three floors and the person (s) above us was up at 4:00 a.m. stomping around. I would stay at the resort again BUT only on the top floor!", "Date": "January 28, 2011"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Overall": "2.0", "Value": "2", "Location": "2", "Rooms": "3"}, "AuthorLocation": "Chino Hills, California", "Title": "“It has 2 things I hate: thin walls & timeshare!”", "Author": "oreoiii", "ReviewID": "UR93133407", "Content": "My wife and I stayed here for 3 days/2 nights.   We got the room through Hotwire which meant we did not know the hotel just the rating which was 4 stars.  We got the standard room. I give the hotel 2 stars not 4.  By appearance alone, the hotel was nice.  But there were too many negatives for me that dropped it down to 2 stars.  1.  The walls and ceiling are too thin.  We could hear the people talking and the tv from the rooms on both sides of the wall.  We could here the people walking above us.  We could also hear the dryer from another room.  If this place was 50 years old I'd understand the thin walls, but this building is less than 5 years old, that's inexcusable.  This is the main reason why I rate this hotel low. 2.  There were ants in the bathroom.  We called front desk and someone did come to spray the sink with bug spray within 20 minutes.  But the ants came back. 3.  This place is a timeshare.  I hate the sales pitch for timeshares.  The concierge asked us to see her after we checked in.  We did thinking we could get some good suggestions as to where to go.  We were hit with the sales pitch, she tried to get us to go to the timeshare presentation then gave us some suggestions.  How times do I have to say I'm not interested before you stop asking? 4.  There was a $20 resort fee per night which they only charged $15.  We were charged $30 total.  This includes a bottle of wine and 2 waters & 2 Pepsis for 2 days.  My complaint is that this should be included in our purchase through  Hotwire (yes, I know that Hotwire provides a warning about this before making the purchase, but this artificially gives a lower price for this hotel!). 5.  There isn't enough parking as a previous person mentioned.  The staff appear to park in the street.  We came back around 8:00pm and got the last spot near our room.  There was a party at the hotel and the guests of the party were taking up the guest parking. 6.  The place is still under construction, but we didn't see or hear any of it.  Some of rooms in the hotel were not complete and they were clearing out dirt to build another building.  I can imagine it getting noisy! 7.  There was this extra hallway/entry to get to the room.  As we got off the elevator, we walked down the hallway to the door of our room and opened it with our card key.  When we opened the door we found a small entry with two doors for two different rooms and used our card key again to get to our room. The problem with this is that you can't hear people knocking on the first door if you are in the room. I find no good reason for this.  Instead of spending money on this wasted space, why not soundproof your walls! 8.  Distance.  Other reviewers complained about how far the hotel was.  The hotel is south of wineries in Napa.  If you hate driving then this place isn't for you.  The hotel is about 10-15 minutes from the city of Napa, about 15-20 minutes to Yountville with no traffic and 45 minutes to the CIA with no traffic. I would not recommend staying here.", "Date": "January 16, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "West Palm Beach", "Title": "“The Pinnacle of Service, Accommodation, Friendliness & Cleanliness”", "Author": "hyyield63", "ReviewID": "UR90678354", "Content": "Our stay was \"kick-started\" by Elisse W's amazing service to get our accommodations tailored to our need. She booked us one night at Meritage Hotel and the balance of our stay (the remaining 7 nights) at the one-bedroom condo in Vino Bello. She even arranged for the arrival of our luggage in advance through UPS so that it was there waiting for us at the front desk! We were greeted by Tony, our bellman, who was fantastic and friendly. When we got to the front desk, our names were proudly displayed in a frame, congratulating us on our recent marriage..and to our surprise, Tony handed us a freshly printed copy as a keepsake before we thought to request it! WOW! Next, we coordinated the majority of our trips through Rosemary, who was as sweet as she was efficient! She actually got us a couples massage at Spa Terra even though we understood them to be booked out the day we wanted to visit! She saved us a great deal in expenses, ensuring we got the best rates on everything from drivers, cabs, and even car rental. She was truly a connected gal with lots of great insight on the area. She was a blessing for us to work with. Jessica at Spa Terra was also accommodating, as it was her help that landed us at Spa Terra for our special spa day. We can't say enough about the staff, the condo at the Vino Bello, the people here, and Michael the GM, whom we bumped into in the Tasting Room at the resort. From Tony to Michael, from Chloe to Elisse, everyone was so wonderful and really bent over backwards to take care of our every wish.", "Date": "December 25, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Pacifica, California", "Title": "“One of the best places to stay in Napa. Wonder accomodation & wonderful places to eat in Napa,”", "Author": "KatinLum", "ReviewID": "UR90432124", "Content": "Book ahead of time for this place, great Spa, and ate to my heart's content. Allergis, Unbunti(soup the best), Cindy's Backstreet, (Hurley's for lunch) Bistro Jeanty's, Bouchard's, Bakery (out of this world, macroons. and a reasonable place in Calistga, small cafe on main street. Also stay Country Wine Inn, pass the Calif Caluinary Cooking school. Best with a Hot tub and private room with fireplace, and the best cook breakfast. I felt like I was in France countryside, but only 2 hours away. TiLum@aol.com", "Date": "December 21, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "4", "Rooms": "5", "Location": "3"}, "AuthorLocation": "San Jose, California", "Title": "“Great resort with AMAZING spa in the cave”", "Author": "a786374534", "ReviewID": "UR89385412", "Content": "A truly amazing resort in Napa Valley. We were there mid-week and it felt it belonged to us - attentive service, empty spa area and restaurant (great food also!). Pool and hottub open until late - and also empty. However, spa (inside an underground wine cave) is truly amazing. BTW, on top of all the above, it has its own winery tasting room. Will definitely come back!", "Date": "December 9, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "4", "Overall": "2.0", "Value": "1", "Sleep Quality": "3", "Rooms": "3", "Location": "1"}, "AuthorLocation": "Los Angeles, California", "Title": "“Horrible Parking and Customer Service Won't stay again”", "Author": "zmaranello", "ReviewID": "UR89037427", "Content": "We booked this accommodation on a site where you have to commit and pay before you can see the name of the 'hotel' The location is south of downtown Napa and is not convenient to what we wanted to see. Parking is insufficient for the number of units that the property has, and another building is under construction but there is no additional parking. We had to park on a dark, un-lit street. We called to notify the front desk that parking was a problem and had a very bad experience. We called and tried to speak to them in a polite manner, but they were unapologetic, interrupted my wife and I and had no interest in hearing about the problem. They acknowledged parking was a problem and seconds later denied that it was a problem. When we stated we had to park on the street far away from our building they said it was not their problem and that they would need to call the city. Eventually they offered to come get our keys and valet the car. In order to get it the next day we would have to walk another 200 yards up to the main office, so it seemed pointless to take their offer, plus we did not want to have to deal with them any further. Customer Service does not appear to be a priority for this property. We will not be staying here again and would not recommend it to others.", "Date": "December 5, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "San Francisco", "Title": "“Really luxurious resort style hotel”", "Author": "whchuang", "ReviewID": "UR88896047", "Content": "We stayed here with a 2 bedroom condo for one night, with me, my wife, my daughter (5 years old), and my mother-in-law (80 years old). I think all of us had a great time. The room is REALLY luxurious, the building materials are all top notch - very nice kitchen cabinets, appliances, bath tubs, stand-up shower, etc. Very detail-oriented and very nice interior design. However, We did notice some ants coming out from the jacuzzi hot tub, but given that lots of people came here for wine tasting tours (sweet wines?), I guess that's somewhat acceptable...The location of the hotel is not ideal as another reviewer mentioned, but it's not that bad as it's only 10 minutes drive to Napa downtown and 40 minutes to Calistoga. The heated swimming pool is wonderful, and if you come during summer time with young children, your children will LOVE the small water playground right next to the swimming pool.. it's a nice surprise to us. They also provide BOTH \"free\" wired ethernet connection Internet AND wireless Internet, which is a big plus for us (well technically it's not really \"free\" as they charge your with resort fee, and the Internet is probably included in the resort fee). Overall, we love our stay here and probably will come back here again next summer (if the price is right)...", "Date": "December 3, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Toronto, ON", "Title": "“Good place in Napa”", "Author": "DomCanada", "ReviewID": "UR84008588", "Content": "We spent 2 nights at Vino Bello in a room with 2 beds. It's a good base for exploring Napa region. Pros: - resort like place with a pool and a hot tub that came in handy since the weather was amazing when we were there - they have a frequent free shuttle that's very helpful for taking to downtown Napa restaurants - excellent staff Cons: - overpriced and not so good breakfast buffet - the room comes with a washer/dryer but the washer was very loud and the dryer didn't actually work and I ended with wet laundry - very loud A/C unit; not great for sleeping While in Napa we recommend: - eating at Ubuntu (excellent vegetarian cuisine but fun for meat lovers too) - winery day-tour with Platypus tours - visiting Artesa winery", "Date": "October 18, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "5", "Location": "4"}, "AuthorLocation": "San Francisco, California", "Title": "“Five Star Service!”", "Author": "jojolina", "ReviewID": "UR81124565", "Content": "The service I received her was second to none. All staff that I came in contact with, from the front desk, doorman, housekeeping, room service, restaurant, spa was absolutely excellent! We've stayed here before and love the rooms and surroundings. The vineyards growing above the hotel are beautiful. The pools are lovely. The spa is incredible!!! As always the air conditioner is loud. The only thing I would change is that I wish their restaurant menu was bigger and the room service choices definitely need to be expanded. From what I hear they are hiring a new chef and this will happen in the near future. I am so happy to have a Shell Property of this caliber available to me. Thanks Vino Bello and Meritage Staff!", "Date": "September 26, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "New Orleans, Louisiana", "Title": "“Spacious Room”", "Author": "glinco", "ReviewID": "UR79588887", "Content": "Had a large, one bedroom suite. Need ADA access and the roll in shower was great. Some turns were a bit tight getting into the room but we managed. Bed was a bit high for transfers. Resort is located convenient to the wineries and restaurants in Napa. Also relatively easy to cut over to Sonoma. Staff was very friendly and helpful. All requests handled very quickly and efficiently. As we were there for the wineries and restaurants, we didn't spend a lot of time at the resort. However, room was great and served us well. We will stay there again.", "Date": "September 15, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "2"}, "AuthorLocation": "Los Angeles, California", "Title": "“Luxurious Rooms!”", "Author": "KiwiMochi", "ReviewID": "UR76501986", "Content": "I traveled with my husband and his family and we booked 3 one bedroom suites. Pros: The resort was quite and peaceful. The rooms were IMMACULATE; clean, super spacious, and filled with everything you would possibly need including a washer and dryer, detergent, a blender, stove, etc. The bathroom was gorgeous and about the same size as the bedroom. There was 9 of us on this trip and we thought we needed 3 rooms but we realized that each suite was definitely more than enough space for 4 person per room. Swimming pool was nice and had a little bbq area for you if you wanted to cook. Parking is free and huge so you don't have to worry about your car being too far from your room; there is always a spot near your room. Cons: It's very far from most of the wineries. The wine at the resort was horrible! The resort provides each room with a complimentary wine bottle plus a two for the price of 1 wine tasting deal. The tasting room was very disappointing; it was small and empty (we later found out why) and the wine bartender is incompetent. She simply read the wine labels to us and recited a descriptions which she memorized but was unable to explain. She was not able to answer any questions about any of the wines served. I didn't like any of the wines served but I'm wondering if it's even fair to say that since the bartender's lack of experience serving definitely tainted the taste of the wines. I didn't like my first wine but almost finished it and asked for the next tasting, she simply poured the next bottle into the same cup without rinsing. I let it go thinking it was an accident and that she was in a hurry to serve others. However, the second tasting was horrible and I asked for the next one without finishing the second tasting and the bartender mixed the wines! She simply poured the third tasting into the same glass. When I complained, she dumped the wine mix but did not rinse the glass. The bartenders in the actually bar area was more skilled but had an attitude when I requested that she adjusted my drink a little to my taste. The food was mediocre; the location was too far to go out and eat so we decided to buy grocery and cook for the rest of our stay which was fun!", "Date": "August 23, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "3", "Sleep Quality": "4", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Toronto", "Title": "“Luxury in Napa - reviews are accurate”", "Author": "yvrgirlToronto", "ReviewID": "UR76355437", "Content": "I got this hotel from Priceline name Your Own Price for about $180, although i wasn't bidding very well and could have gotten it for lower. The reviews and photos are all accurate but depends on what room you get. The basic is a studio from what i hear. We were offered an upgrade to a King Resort Suite (about 800 sq ft) with jetted tub and kitchen for $30/night extra as the Priceline offer only secured us double beds. (Although we have ALWAYS been accommodated at other hotels for bed choice despite Pricelining. So this was a little annoyoing considering I had called ahead!). CONS: when we got to this room, there was already a couple that had just checked in 30 minutes ago!! This was absolutely ridiculous and a major security issue. They moved us right away and gave us a $30 breakfast credit. This was the only major issue we had and I'll guess it was a one-off. But the manager herself made this mistake. And yes, the A/C is loud. Otherwise, you would be happy with the spaciousness, the amenities, the humongous and luxurious bathroom, the fireplace (turn it on with a switch!), the vineyard on the premises (saw a rabbit!), pool/hot tubs, the cave spa, free wifi (call the front desk for the code), and complimentary DVD rental with popcorn. You don't feel like you're in an \"industrial park\" when you're there. It's like living in a comfortable condo resort - like your house if you could afford it and not too pretentious! From my understanding, there doesn't really seem to be a super resort in Napa. It's very spread out and this was 10 minutes from downtown Napa (try Morimoto's, Allegria, but not Celadon) and downtown Sonoma (try Boonfly Cafe for breakfast on your way to Sonoma) so it was a great base for us. We joined a wine tour so did not have to drive ourselves for wine tastings and they (Platypus) picked us up at 10am sharp. Free parking on premises and also throughout Napa and Sonoma. It was about 1-1.5 hour from San Fran. Nobody bothered us about a timeshare presentation. We had little interaction with personnel working there. I agree that downtown Sonoma is much prettier and doesn't have all these empty/for lease retail spots in the rundown downtown Napa. I think Healdberg and Yountville are much nicer places to stay in \"Napa.\"", "Date": "August 22, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "North Aurora", "Title": "“Beautiful hotel in a fabulous setting”", "Author": "mb65", "ReviewID": "UR76117794", "Content": "This hotel has it all. The rooms are lovely with a great bath, kitchenette or full kitchen, and patio in each. The staff and concierge were helpful. The hotel is surrounded by vineyards and even has an onsite tasting room. In addition the restaurant on site is very good.", "Date": "August 20, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Robbinsdale, Minnesota", "Title": "“A+”", "Author": "Wine_n_Dine22", "ReviewID": "UR72184830", "Content": "This is a wonderful place. Beautiful, well equiped rooms. Quiet, simple pool and hot tub with complementary ice cold lemonade provided. The restraunt mixes a stiff mimosa -- which is the way I prefer ; ) I don't understand the complaints on location (e.g. \"business park\"). It borders a vineyard, and is maybe 5 minutes from downtown Napa. If you have a rental car, I'd say this is a prime location.", "Date": "July 24, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "North Hollywood, CA", "Title": "“VINO BELLO - A*M*A*Z*I*N*G”", "Author": "rkellitrip", "ReviewID": "UR71553822", "Content": "I would not normally take the time to review a hotel but I had such a great experience I felt the need to write about it! The grounds were well groomed and taken care of. There were a lot of people staying there and we didn't hear a lot of noise and there were so many people willing to take care of our every need. This was our first trip to Napa for wine tasting and the concierge really knew what she was talking about and gave some great advise on where to go all while taking in the amount of time we were there for. I would stay here again in a heartbeat!", "Date": "July 19, 2010"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Sydney, Australia", "Title": "“Hidden gem”", "Author": "shepherdieu", "ReviewID": "UR71209121", "Content": "The location threw me at first ... in the middle of a business park just outside of downtown Napa. But the facilities were great and the rooms are fantastic. Spacious ... comfortable and perfect for enjoying a relaxed few days in Napa. The service on check in was great, amazing personalised recommendations from the conceirge really helped us craft our days and visit the wineries we needed to see. Bed was comfortable and our room had a lovely spa that was a nice touch. Check out was fuss free and since we've visited we've recommended the hotel to our friends in Australia.", "Date": "July 17, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Sleep Quality": "4", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Swindon", "Title": "“Nice resort”", "Author": "Brenda29", "ReviewID": "UR66427697", "Content": "Very nice resort with very helpful staff, free internet and shuttle bus to downtown napa. The only downside is you need a car or use the shuttle bus to get to local shops", "Date": "June 4, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Phoenix,AZ", "Title": "“Beautiful Wine”", "Author": "Phoenixreviewer", "ReviewID": "UR66372030", "Content": "We reserved a Resort King Suite, but got upgraded to a very spacious 836sq ft. 1 bedroom unit. There were 4 of us. We were in the Chardonnay wing overlooking the pool area. The Meritage Resort & Spa houses the front desk/lobby,meeting space,Siena Restaurant, Meritage bar, & Trinitas tasting room/cave. There is a $15./night resort fee which includes local phone calls,800 calls,resort business center use,high speed internet wired and wireless via ATT, M-F USA Today newspaper,fitness center,pool & jacuzzi use(outdoor), 1 bottle of wine, and canned soda and bottled water replaced daily. The 1 bedroom condo has a King bed in the bedroom with a jetted tub seperated by a half wall. 1 flat sceen TV & a large closet. The bathroom is accessible from the bedroom or the hallway. There are double sinks,toilet, and a very large shower with body sprays. There is a balcony patio accessible from the living room and bedroom with a table and chairs as well as a bench sofa type chair. The full kitchen has Whirlpool appliances. There is a coffee maker in the room with coffee. There are 2 bar stools. The sofa makes into a queen size bed,not too bad with reguard to the comfort level. There is also 2 club chairs a few end tables and a flat screen tv. The fireplace in the living room was a nice feature. Just flip the switch on the wall. There is a washing machine & a dryer right when you enter,with complimentary laundry soap. The staff just could not do enough to please us and were very prompt in doing so. It is at the South end of Napa( to get to Vino off Hwy 121/29 which is also Soscol Avenue)take Napa Valley Corporate way),but only about a 10min. ride to town. There are a few restaurants on Hwy 121/29.( to get to Vino off Hwy 29/12 take Soscol Ferry Rd to Napa Valley Corp.) Hwy 121/29 and 29/12 run parallel to each other. The onsite restaurant for breakfast was just what we needed to start our day before heading out to the vineyards for tastings. The Resort King Suite and the Resort double suites are about 493 sq. ft. Probably good for 2 people. They tried to tell us upon check in that the double beds were actually queen beds,not so. We actually went to the room.This was really our only negative. I highly recommend this resort. Parking is complimentary.", "Date": "June 3, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Belton", "Title": "“Fantastic Honeymoon!”", "Author": "bmartens1913", "ReviewID": "UR65193311", "Content": "We spent our honeymoon from March 14th-March 18th. It was 70 and sunny the entire week. The 1 bedroom condo we stayed in was amazing. Tile floors, full kitchen, Jacuzzi in the bedroom, huge shower, and great scenery from the balcony. We thought the service was perfect and the amenities were incredible. I give the place an A, but not an A+ only because of the restaurant. One night the service was very poor and both nights the food wasn’t the best. However, the manager gave us free breakfast because of the poor service. We definitely recommend this hotel.", "Date": "May 24, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "marietta ga", "Title": "“We would stay here again in a heartbeat”", "Author": "ssfarms", "ReviewID": "UR65101713", "Content": "We really enjoyed our stay at the Vino Bello. They are located in an office park, yes. We had a GPS which was very helpful in finding the hotel. However, it is about 5-7 minutes from DT Napa or 5-7 minutes to the Carneros Wine area. (Artesa, beautiful beautiful!) On Sunday morning, 10 AM and it took about 10 minutes to Jessup Cellars in Yountville. That place was amazing. The grounds at the Meritage it's sister resort are very nice. The Vino Bello grounds are nice, but not as nice. The roses were beautiful there however, and it is a quick walk over to the Meritage, which we did one night to have a night cap in the bar. Our room was nicely furnished, microwave, frig, coffee pot. dishes, various wine stems, etc. Great large tub and shower area. We did use the washer and dryer, and they supplied laundry detergent 2 days in a row. The dryer was a bit tricky to use but it worked fine. We got this hotel through priceline at $139 a night. They do charge a $15 resort fee on top of that once you check in. Each day the supply bottled waters and pepsis (we live in atlanta... I have not drank a pepsi in years.. oh well) We also got a welcome bottle of wine. The wine was actually better than I thought it would be. My husband had called ahead, and they were more than nice to his requests for my birthday celebration. We had a wine tasting in the cave at the resort, which was a laid back, nice experience. Walked into the spa area, but did not do anything there as far as extra services. The concierge , Pam, totally hooked us up with wine tour ideas and discounts. She also gave us some restaurant suggestions. She wanted us to do the time share 90 minute deal, but we did not do that. There could have been more nice perks if we had sat there for 90 minutes, but our time was more precious. The only negative comment is that they need to focus on some of the little things, as an example, in the area by the restaurant, on a table out in the hallway, someone had written (only a kid would have gotten on the floor to do this) their name in the dust on the bottom area of the table. The top of the table had beautiful flowers on it.. but the bottom had some kids name. In our building there was duct tape in our elevator going up to the room. Yes, it matched the metal, and it did not really stand out, but whats with duct tape. We picked this hotel for the price, and location, as we wanted to focus our time and money on the wineries we visited. Pretty sure our UPS delivery man will think we made the right choice.", "Date": "May 23, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "3.0", "Value": "2", "Sleep Quality": "3", "Rooms": "3", "Location": "2"}, "AuthorLocation": "Canada", "Title": "“Nice, but...”", "Author": "gghope", "ReviewID": "UR63801247", "Content": "I have mixed feelings about this one. It really is a nice place, I just expected more. Perhaps I would feel differently if we had booked and received an amazing deal, but we didn't. I think we paid around $200 a night, so by time taxes and the \"resort\" fee are added on it works out closer to $230, which for the Napa area, really is'nt bad, but when you hear about people getting $99/night, it's not great either. The hotel is oddly located in a small industrial park, about 10 min. outside of Napa, which is fine, because there is a shuttle that goes into town each night, 5pm to 1030 pm on a first come first serve basis. Just don't expect to be walking around town, and then to the hotel, also, it is close to a highway, not a noise issue, just odd, for a resort. The rooms are nice, ours did have a few issues, one of the decorations must have fallen off the wall, so there was just two larger holes on the wall where it should have been, the duvet cover was patched, poorly with an orange piece of material (the cover was a burgandy floral print...no orange) and the air conditioner ran the whole first night we were there and it was very loud. We did cal the repair man, and he \"fixed\" it by turning up the head so it would turn off. I know I'm sounding negative, but all in all it was nice. I had expected alot of Vino, and I was really looking forward to our stay there, maybe I had just built it up too much, but I would not stay there again. There is a small fitness room, nothing too fancy, but definately suffiecient, the pool and hot tub are both nice and the staff were all very friendly, and I'm happy to say that I we were not harassed by the time share staff.", "Date": "May 11, 2010"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "2"}, "AuthorLocation": "Sunnyvale, California", "Title": "“Avoid it”", "Author": "anon-12345678", "ReviewID": "UR63079374", "Content": "This was my second stay at Vino Bello Resort and this one was huge disappointment. We booked a room with a king bed but on arrival were given two-bed one (they claimed some issues with booking system). Beds are tiny and very short (I'm 6'1\"). Despite being a newly built property, buildings are extremely noisy - you can hear people walking on a floor above you and there was even some kind of metal clunking. In the morning (around 7am) cleaning stuff (they were cleaning another room) have woken us up - they were slamming doors, etc. I had to turn off the fridge at 5am as it started vibrating violently (something was loose inside). It's impossible to find parking around hotel if you arrived kinda late (~11pm). Wasn't able to make internet to work - wired was disconnected completely, wireless was hitting captive ATT portal that needed some password never mentioned anywhere.", "Date": "May 3, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "2.0", "Value": "3", "Sleep Quality": "1", "Rooms": "2", "Location": "3"}, "AuthorLocation": "Cambridge, MA", "Title": "“We were disappointed.”", "Author": "hellomistersteve", "ReviewID": "UR62235162", "Content": "We enjoy visiting California wine country once a year and normally stay in Yountville (a little further \"up valley\" as the locals say). Unfortunately, the hotels there were booked, so went online the night before and found vacancy at the Vino Bello Resort. Hotwire was running a deal. When we arrived, we were a little disappointed about the location. The resort is not close to any winery that you'd want to visit (in our opinion, of course). Further, because Vino Bello is a resort, they try to keep their guest on premises and charge a nominal ($15) resort fee -- which was not mentioned in the Hotwire promotion. Our biggest disappointment was the quality of the rooms. The rooms themselves are unusually shaped. They are fairly long rooms, but very narrow -- giving me a claustrophobic feeling. Further, the walls are paper thin. You can practically hear the conversations in the adjacent rooms. We stayed for two months, and one night, our neighbor was watching TV into the early morning. It was hard for us to fall asleep. I don't think we'd stay here again unless the other hotels were booked solid.", "Date": "April 23, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Vancouver, WA", "Title": "“All I can say is \"WOW\"”", "Author": "ilovemylittlepumkins", "ReviewID": "UR60698876", "Content": "This was a beautiful finish to our CA trip and what a perfect place to stay....Beautiful surroundings, 2 large hot tubs and a big heated pool kept our kids busy... The room was superb, clean, spacious, inviting.....(love the fireplace in the living area).. the bed was very comfortable...we slept like babies!!!! I can go on and on....We would definitely be back...Thank you", "Date": "April 7, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Vancouver, Washington", "Title": "“Comfortable and spacious”", "Author": "comerdinger", "ReviewID": "UR60331980", "Content": "Hotel is in a private location. Scenic suroundings. Used the clean and nice Pool to soak up some sun. Rooms were spacious, clean and comfy. Service was excellent.", "Date": "April 4, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "3"}, "AuthorLocation": "Canada", "Title": "“Beautiful, clean and modern!!! We will be back.”", "Author": "CoupleofHoteliers", "ReviewID": "UR59736369", "Content": "My husband and I are in the hotel industry. We loved everything about the Vino Bello Resort and would stay there again and recommend it to everyone. The service at the front desk was excellent! Our room was very large and modern. We had a comfortable king bed, large bathroom with oval tub/shower, washer and dryer and a kitchen/bar area. The room was extremely clean! We loved the pool, fire pits, and wine tasting areas too. We were disappointed with Siena (restaurant). The service and food wasn't good. Go somewhere else to eat. The rooms at the Vino Bello are larger and more modern than the adjoining Meritage hotel. Hotel is a little bit out of the way from the tourist spots, but worth it.", "Date": "March 28, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Minnesota", "Title": "“Awesome place”", "Author": "GetTheBestForLess", "ReviewID": "UR59577580", "Content": "We saw a great rate through Travelzoo, and spent a few extra bucks for the 1 bedroom. Wow, is this a great place. We had an end unit on garden level, so our patio was quite private. The bathroom and shower are huge, kitchen has everything you need, complimentary wine and sodas/water are already in the fridge, there's a comfy bed and the place was QUIET... it was easy to make ourselves at home right away and get good sleep. We love Napa and Sonoma valley, but it was hard to leave the room to explore it! Only drawbacks we experienced: We were a bit dismayed by the kindof pushy sales pitch (for timeshare presentation) by the Concierge desk person when we asked an unrelated question, but after several 'no thank yous' from us, he relented and allowed us to be on our way back to this GREAT room. The only other thing we discovered was that there was a wine tasting/appetizer event going on right in the lobby at the time we checked in, but the front desk person never even mentioned it to us - - would have been an even nicer way to begin our stay, if we had known about it. We ended up reading about it in our room long after the fact. Aside from these fairly minor things, it is an awesome place to stay if you can get a good rate.", "Date": "March 26, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Milwaukee, Wisconsin", "Title": "“Nice stay, conveniently located.”", "Author": "lynnlynnTravel", "ReviewID": "UR59353403", "Content": "Stayed there in late October last year on a girl's (long) weekend. Room was very nice and well-maintained. Everything was very clean. It had a big bathroom with plenty of room. We had the room w/ a full kitchen, dining area, living room. There is a restaurant there, but we didn't use it. We did eat at the bar one evening, and the food was good if a bit overpriced (but that's to be expected when dining at a hotel, so it wasn't really a surprise). The building we stayed in had a fitness center, but it was rather bare bones (we did notice the fitness center in another building looked a lot nicer than the one in our building...don't recall the name of the building we were in). It is conveniently located to a Target and grocery store, which was great since we had the full kitchen. We also found it a convenient location to visit both Napa and Sonoma wineries (~20 - 30 minute drive, depending on where we were headed)....granted, not as convenient as staying right in Yountville or Sonoma maybe, but also generally not as expensive. Reasons I gave it 4 instead of 5: the room had a hairdryer that was literally spitting sparks and we had to call 2 or 3 times before they finally replaced it. Also, we did not consistently get our towels replaced (for example, 1 day we were only given 4 clean towels, no washcloths or hand towels...the next day we got hand towels, still not washcloths even though we'd called and asked for some). Also, the room does come w/ a mini clothes washer and dryer, which is nice, but the despite following the instructions on how to run them, they took quite a bit of fiddling with to get them to run, and they were very loud (sounded like a jet engine taking off). And, as I mentioned before, the fitness center in our building was only barely adequate (not sure if we could've used the nicer one in the other building or not) All in all though, it was a very nice, quite place to stay while in the area and I would recommend it overall.", "Date": "March 23, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "3"}, "AuthorLocation": "atlanta", "Title": "“Lovely Place”", "Author": "pgrast", "ReviewID": "UR55394784", "Content": "We stayed here because of a special promotion the resort was offering. We really enjoyed the complimentary bottle of wine left in the lovely room. Staff was exceptionally nice and informative, and dinner at the restaurant was one of the best we had in Napa Valley. I would definately go back.", "Date": "February 7, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "San Diego", "Title": "“Great New Resort in Napa”", "Author": "pacpal13", "ReviewID": "UR55348256", "Content": "Not on the main drag in Napa, but conveniently located to visit Napa or Sonoma. The outside appearance is that of a nice aparment or condo complex. But this inside of the units are appointed very nicely. The feel is luxurious and 4-star. Service was great, the resort is clean and maintained, and for the prices we paid, a great bang for the buck. Not sure if this will become a time-share resort or remain a regular hotel. Once the public becomes aware of this place, not sure I would return when the rates go up to $300/night plus. But at $200/night and under, can't wait to return! Napa is growing, and conveniently located near new shopping center with grocery store, fast food, etc. Grade = A.", "Date": "February 6, 2010"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "Arlington, Tennessee", "Title": "“Pleasantly surprised”", "Author": "leonoids", "ReviewID": "UR55023184", "Content": "The Vino Bello was truly an awesome place to stay. The suite included a spacious kitchen, living room bedroom and incredible bathroom/shower! I definitely recommend going to the Wine Cave for a wine tasting. Also, be sure to get a massage in the spa which is also located in the Cave.", "Date": "February 2, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Stockton, California", "Title": "“Can't wait to go back!”", "Author": "TheDeltaDuo", "ReviewID": "UR54675570", "Content": "We found Vino Bello through an internet search looking for somewhere to stay for a spur of the moment weekend getaway. The rate for the one room condo was so good that we were concerned what we might find when we arrived. We knew as soon as we pulled up we had made the right decision. What an awesome place. The grounds are beautiful. The staff is very friendly and helpful. The condo was the best surprise of all. The fireplace and jacuzzi were just what we needed since it was cold and raining most of the weekend. Loved having the bottle of wine, sodas, water and a bag of popcorn with the DVD we checked out at the front desk. We have already made reservations to return next month.", "Date": "January 29, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "4", "Rooms": "5"}, "AuthorLocation": "LA", "Title": "“Great getaway”", "Author": "Faulekatze", "ReviewID": "UR54542849", "Content": "Our friends had previously stayed at this resort and highly recommended this place, so we decided to book our rooms here. We were very happy with our one bedroom condo. Everything is clean and even the top of the refrigerator was dustless! They pretty much got everything we needed for our stay there, from kitchen ware to laundry. We would definitely come back for our next Napa trip.", "Date": "January 27, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Location": "4", "Rooms": "5"}, "AuthorLocation": "san francisco", "Title": "“Great weekend”", "Author": "gwj56", "ReviewID": "UR53492539", "Content": "We stayed at the Vino Bello but was able to use the amenities at the Meritage, so we got a very good deal on our room. I just loved the fact that a bottle of wine/water/soda came with the room. Just had a great weekend even though it was to cold to use their outdoor pool and jacuzzi. The studio room was nicely decorated, clean, and the kitchenette was very well set up. Will definitely go back again. The only drawback is that it is outside of Napa, but only 10-15 minutes away.", "Date": "January 14, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "3", "Rooms": "5"}, "AuthorLocation": "Kansas City,Mo", "Title": "“our best trip ever”", "Author": "Leland23", "ReviewID": "UR53448176", "Content": "we travel alot and have seen some \"black holes\" but we hit a grand slam with Priceline when we chose a 4 star hotel and arrived at Vino Bella. hidden under a hill of grape vines and behind a commercial park is a wonderful resort with all the \"plush\" things that make the stay memorable. the staff was always eager to please and so friendly and at every turn there to help or guide you somewhere. the signage needs some improvement but we would come back again and again.", "Date": "January 14, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Location": "4", "Rooms": "5"}, "AuthorLocation": "washington state", "Title": "“Great room...and went home with clean laundry!”", "Author": "relocator678", "ReviewID": "UR53424686", "Content": "We came to the valley to house hunt and were very excited to run across the Vino Bello on line. It was amazingly refreshing after a long day of running around to be able to not only cook dinner in our room and watch free movies, eat popcorn in a living room that felt like home but we could even throw in a load of laundry, which anyone traveling with kids knows this is a godsend! It was quiet from other rooms and even road noise and our room backed the pool so the kids could play in the pool while we watch in sweatshirts. The staff were very helpful and even were able to accommodate everyone different taste by let the kids each pick out their own DVD (a slight break in the rule from one per room) which made everyone happy. I would recommend the 1-2 bedroom suites the couple extra bucks were worth everyone getting some privacy. My only compliant was the fireplace didn't work...that would have been nice.", "Date": "January 14, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "4", "Overall": "2.0", "Value": "4", "Location": "3", "Rooms": "4"}, "AuthorLocation": "Eugene, OR", "Title": "“Don't leave anything behind - you won't get it back”", "Author": "SerafinaEugene", "ReviewID": "UR52489803", "Content": "I stayed here with a friend booking though hotels.com for $99/night. The hotel was a bit difficult to find, and it was confusing to have to check in at a separate building with a different name, especially at night when signs were not well lit. The room was very clean and well equipped. We only needed a place to sleep so the washer/dryer and kitchenette were extra perks. We had a lot of trouble getting the internet to work, and hotel staff didn't seem to know that their service provider had changed. (When accessing the wifi to which they directed us a screen appeared saying it had been taken over by AT&T). After having someone sent to our room to help we had to settle for a dial-up speed ethernet connection. We made use of the heated pool and jacuzzi outside, which was great, but we were glad we brought towels from the room because there were none out there despite signage stating that there would be. We left quickly in the morning to head to a vineyard in Sonoma before driving back to the SFO airport, and I left a $150 freshly dry-cleaned wool coat in the closet. I realized this at the airport at 5 pm and called the hotel. I was directed to the lost and found where I could only leave a message. I didn't get a call back so I tried again later that evening. After finally contacting a live person I explained my problem and was told I would get a call back. When they called back I was told that there was nothing found in the room. The man I spoke to acted like I was accusing him personally of stealing it and was very defensive. He seemed eager to get rid of me and tried to make me feel stupid for expecting to talk to anyone about this on a Saturday evening. Aren't weekends the busiest time for hotels? I tried calling again the following Monday when I could speak to the Executive Housekeeper. He said he would try to check the room again and get back to me. He never called. I think somebody there has a new coat.", "Date": "January 3, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "4", "Rooms": "5"}, "AuthorLocation": "Santa Clara, CA", "Title": "“The Best Hotel Ever!”", "Author": "fcah0218", "ReviewID": "UR52318047", "Content": "My boyfriend and I loved Vino Bello! We stayed here for our sight-seeing tour of Napa and Sonoma, and it was ideally located for both. The hotel cost us $99/night off of Expedia, and it was a steal. Our room was gorgeous. It had a view overlooking the Meritage, a complimentary bottle of wine (it was a really great bottle of rose), complimentary water and soft drinks, a huge bed, and a huge soaking tub. Room service was reasonably priced, and because it always came quickly or at the time requested, we ordered quite frequently. They always did things that were considerate - For example, if you ordered one orange juice, they would bring two just in case. If the room had cost us $250/night, we still would have felt like we had a great deal. The concierge was very friendly and so were the folks at the front desk, wine tasting room, and spa. Definitely recommended!", "Date": "January 1, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Location": "3", "Rooms": "5"}, "AuthorLocation": "Napa", "Title": "“Great Wedding Stay”", "Author": "jbecerra", "ReviewID": "UR52204612", "Content": "I had a great time at Vino Bello/Meritage. I recently got married on the 19th of December and I decided to book a room there the day before the wedding (stay with my bridesmaids) and the night of the wedding. It was beautiful. We had a nice pool side and vineyard view. The room was clean and had everything we needed. The condo that we stayed in was huge for the price that you pay for and it has a double sink bathroom with five showerheads...yup five! It had a nice jacuzzi in the room and a fireplace in the living room. With the fireplace alone there was no need to turn on the heater. The kitchen was such a nice accomadation and it was supplied with everything that we needed for that weekend. Additionally, the staff was very nice and met our every need. When we called to ask for extra blankets they were there within 10 min. We also asked for the room to be cleaned at a specific hour and they came at that time to clean the room. I must add that we walked into the room and to our delight there was a nice bottle of wine wating for us. :) It was a relaxing stay, and even through I'm from Napa, I would stay there again just for the heck of it.", "Date": "December 30, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "4", "Rooms": "5"}, "AuthorLocation": "SC680", "Title": "“Excellent Service and Beautiful Hotel”", "Author": "SC680", "ReviewID": "UR52023084", "Content": "I recently stayed at Vino Bello and was very impressed by the quality of the hotel for the great rate we received. I would definitely visit again and recommend it to others.", "Date": "December 28, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Location": "4", "Rooms": "5"}, "AuthorLocation": "Louisville, KY", "Title": "“Great Getaway”", "Author": "DMinDeacon", "ReviewID": "UR50371286", "Content": "The room was just right for a visit spent all day at wineries in the Napa and Sonoma area. It was great to be able to fix a snack or warm up a meal and drink a bottle just purchased on a day's outing. The staff was incredibly welcoming and warm. The breakfast in the restaurant was very reasonable, and the portions were significant. We will not blink twice about staying again when we come back to Wine Country in August 2010.", "Date": "November 30, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "4", "Rooms": "5"}, "AuthorLocation": "San Diego", "Title": "“Great room, great service, great price”", "Author": "Luv4wine50", "ReviewID": "UR50304064", "Content": "Large spacious room loaded with aminities. The service was outstanding throughout the resort. The restaurant provided excellent food at a fair price. We stayed Sunday through Wednesday before thanksgiving and got a rate of 99 a night. I have paid over 300 a night for resorts not as nice as this one. Stay in the timeshare section for more room.", "Date": "November 29, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "4", "Rooms": "5"}, "AuthorLocation": "Dallas", "Title": "“Relaxing, pleasurable stay”", "Author": "Deez526", "ReviewID": "UR50137786", "Content": "Vino Bello is a great resort and a great value for the money. Other resorts are significantly more expensive and don't give you all of the luxuries you will find at the Vino Bello. The staff and the rooms are nice and very comfortable. The only problem we did have was that our room was located right next door to the maid's storage closet so we did hear the door quite often in the early morning.", "Date": "November 27, 2009"}, {"Ratings": {"Service": "2", "Cleanliness": "5", "Overall": "3.0", "Value": "3", "Location": "4", "Rooms": "4"}, "AuthorLocation": "Florida", "Title": "“Great room, not so great noise”", "Author": "Artsyamanda", "ReviewID": "UR48771224", "Content": "My fiance and I arrived at Vino Bello Resort for our honeymoon. Upon arriving, they gave us our room, which was beautiful, and we settled in. That night, we could barely sleep because we realized that they had put us on the first floor right next to the loading dock for their delivery trucks. So, all through the night all we heard were trucks driving up to our window and stopping and making SOO much noise. It was really hard to sleep. The next day we went to the front desk to ask them about some extra charges we noticed on our card and the man asked if we were on our honeymoon. We said yes and he asked if the front desk had told us the night before about the honeymoon amenities that we get. We said no and he said he would take care of it. Well, we stayed there for 2 more days and didn't hear anything from anyone. I will say the rooms are just beautiful and very clean. It was just unfortunate that they selected such a location for us knowing we were on our honeymoon, and then told us they would take care of us in regards to amenities and didn't do anything.", "Date": "November 8, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Location": "3", "Rooms": "4"}, "AuthorLocation": "Saratoga, California", "Title": "“Good but Noisy Room”", "Author": "barbs4545", "ReviewID": "UR48511112", "Content": "I have stayed at Vino Bello once before and also at the Meritage Hotel which is connected. When I checked in a specically asked for a very quiet room. I had requested it also when I made the reservation. But just to be on the safe side I asked again when I checked in that it be very quiet. The girl at the desk said yes it was a very quiet room. Well when I returned from dinner around 8 p.m. to my room........the next room to me had the T.V. on so loud it was unbelieveable. So I thought well it is early and they will turn it down soon. It went on like that until 1 a.m. in the morning. The hotel was not booked at all. It was a Wed. night. So why they put me in a room next to a family with kids...........I can't understand it. Finally at 2 a.m. I went to sleep. The next night the T.V. was also on but went off around midnight. I was disappointed....because I specially asked for a quiet room. Both when I made the reservation and when I got to the hotel. The look that the girl gave her friend at the desk when I checked in made me think that she knew I would be next to a noisy family. The times I have spent at the hotel before this was very quiet. I didn't complain.....because the second night the hotel was getting full and I knew they most likely would not move me to another location. I don't know if it is because this is a timeshare or what. But they should be conscious of treating their guests with more respect. I may stay there again..........but this time I would talk to a manager and not one of the young girls who check you in at the desk. They need to have a talk with their employees at the desk about treating customers with more respect. Other than that the bellhop, the cleaning people were wonderful. Also I know from before that the manager is great. Because I left my camera and he sent it to me........even though I paid the charges to be sent. I still appreciated getting my camera back. I will give this hotel another try........it is beautiful, clean and modern. Just make sure you are not next to a noisy family.", "Date": "November 4, 2009"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Overall": "2.0", "Value": "2", "Location": "2", "Rooms": "2"}, "AuthorLocation": "anchorage, ak", "Title": "“Not as Advertised”", "Author": "aktrav3", "ReviewID": "UR48286396", "Content": "In the interest of full disclosure, I will say that we booked this room through Priceline (won't do that again), and we were visiting Napa to celebrate our 15th anniversary. First - this is a timeshare - not a traditional hotel. \"Full kitchen\" in the one-room \"suite\" consists of a counter running half the length of the wall, with a small microwave, toaster oven, and dorm-room sized refrigerator. Not what we had expected. But, really, that's all they can fit into this very small room. They had messed up our reservation by not noting that we requested a room with a king-size bed. So, we ended up with two full-size beds - and the staff were absolutely unhelpful and made promises to move us the next day, but never followed through on their promises. The room is so cramped with two beds that there was no place to sit. How would a timeshare owner possibly stay there for a week? I have no idea where they would sit to read the newspaper or eat a meal. The washing machine in our room dripped very loudly and woke us - and kept us up - for several hours in the middle of the night. The location is quite a drive from most of the wineries - it takes about 10-15 minutes to get to the concentrated winery area. That was an additional drawback. Finally, the rate we paid through Priceline was not a deal - anyone could've gotten the same rate by booking at the Vino Bello site and pre-paying. And then they would've been treated a lot better by the staff. They pretty much dismissed us - having booked through Priceline. We would not stay here again.", "Date": "November 1, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "4", "Rooms": "5"}, "AuthorLocation": "San Diego", "Title": "“Beautiful property at great value”", "Author": "tripsterSanDiego", "ReviewID": "UR48003454", "Content": "I stayed at Vino Bello on a recent overnight trip to Napa. I chose this hotel because I had friends staying at its sister hotel, Meritage, located on the same property as Vino Bello. Vino Bello was significantly less expensive. I paid $99/night for a room with a kitchenette and washer/dryer (in room!). The rooms were furnished in the luxury meets comfort style de jour (i.e. granite counters tops, big garden tub, big wood furniture, nice appliances etc). We received a complimentary bottle of wine plus two complimentary bottles of water in the room, the latter of which is necessary after consuming the former. There was no parking fee and ample parking. There is a $15. resort fee, which gives you access to the Meritage pool etc. I only stayed one night, but am guessing the $15 fee is a nightly one. Include this in your budget. In my limited stay, I made it to the Hess winery and the in-house wine tasting room. This hotel is not in the heart of the Napa town square. So if that is the experience you want, this is not your hotel. If you are going to do a day of wine tastings from Vino Bello, you might want to hire a tour company that drives you from winery to winery. I am sure the concierge could provide assistance. Overall, I was very pleased with my stay here and will stay again on my next trip to Napa. At $100/night, I can afford to buy more wine from my tastings!", "Date": "October 28, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Sao Paulo", "Title": "“Excelent!”", "Author": "MRSC_9", "ReviewID": "UR46642625", "Content": "This the 2nd time I stay at Vino Bello and it seems this won't be the last!! We had a great time again. The staff, the restaurant, the pool... Everything was perfect. I booked online and had almost no problems... One day there was no hot shower but they solve it in a couple of hours. Thanks for another excelent holliday!!", "Date": "October 12, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "4", "Rooms": "5"}, "AuthorLocation": "Arkansas", "Title": "“Relaxing”", "Author": "Pharmacy11", "ReviewID": "UR45574100", "Content": "We had never been to California and decided to go here on our honeymoon. We traveled from LA to Yosemite to Napa. The room here was SOOOO relaxing. It is dead set in the middle of town (which we were expecting it to be more of a off set location) but it wasn't noisy from being in town. Our room had a washer/ dryer so I was able to get all of our laundry done up before flying back home, which was a huge plus. The room had a conventional oven, refrigerator, fully stocked with dishes- Therefore we were able to make ourselves a late breakfast (bagel with cream cheese and a banana which held us over till dinner) and save lots on eating out! The hotel provided us with a complimentary bottle of wine and 2 sodas in the room, already chilled waiting on us... Not to be mean, but the wine was terrible BUT everyone has different taste buds and we aren't a HUGE red wine fan anyway! They supplied us with one load of laundry detergent for each day so that was very nice as well. We were on the go so much, we didn't get to enjoy the pool but it looked very nice. Each room has a balcony with table and chairs on it so that was VERY NICE to use since I smoke (instead of having to walk through the hotel, go down the elevators, and stand outside around others in my PJ's first thing in the morning! haha)! The beds were amazingly comfortable.... We got free high speed internet in our room which was very nice! Overall if we ever go back to Napa, This is defiitely where we will be staying again. I can't say much about the staff because the main office isn't located where the rooms are. So the only time we dealt with anyone was during check in and out... We got there at 2am to check in and my husband checked us out... The gentleman there during check in was pleasant. Our experience was excellent at this resort!", "Date": "October 1, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "3", "Location": "3", "Rooms": "3"}, "AuthorLocation": "Mooresville, North Carolina", "Title": "“Lousy \"shell\" but lovely accomodations.”", "Author": "JLatzMD", "ReviewID": "UR43641479", "Content": "The Vino Bello hotel is a condo/timeshare facility, next to The Meritage Resort (where you check in). Everything is new and the staff are friendly. We were in the \"Chardonnay\" building, second of the three floors. The security, building grounds, pool area and common areas within the buildings were beautifully done and very clean. Our room was eloquently furnished - tile floors, granite countertops, beautiful woodwork, a mini-kitchen, nice flat screen t.v - furnished with a toaster oven, microwave, coffee maker and dishes, etc.. The bath towels were luxurious and absorbent. The only negatives were the \"shell\" or structure of the building - the walls were very thin, we could hear the insomniac on the third floor pacing all night, as well as his/her t.v., and the balcony seemed to \"give\" when I walked out on it (admittedly 6' tall and 280 lbs). Location is at the bottom of the \"V\" that heads, NW, to Sonoma and, NE to Napa - good launching base though, if you're really wanting to explore both, you might look at something midway, halfway up the valleys, e.g. Yountville. Overall a nice accomodation, eloquently appointed. Would stay there again.", "Date": "September 22, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "4", "Rooms": "5"}, "AuthorLocation": "SF Bay", "Title": "“We loved this place”", "Author": "callieSF", "ReviewID": "UR42074050", "Content": "My husband and I took our adult daughter to Napa for wine tasting- after a lot of searching we found the Vino Bello. It turned out that the hotel website had the best price, and didn't charge for an extra person so we booked it. It was a fabulous 1 bedroom suite with an in room jacuzzi, full kitchen, king bed plus queen pullout, fireplace, and large balcony. The bathroom was huge with a great shower. It was very comfortable and quiet. There were a couple of swimming pools and hot tubs - we chose the one by our room. There were large towels available right next to the hot tub. All the hotel personnel were very accommodating. We would definitely stay here again.", "Date": "September 16, 2009"}, {"Ratings": {"Service": "1", "Cleanliness": "4", "Overall": "2.0", "Value": "2", "Location": "3", "Rooms": "3"}, "AuthorLocation": "San Francisco", "Title": "“So disappointed- For a second time.”", "Author": "dklSFlove", "ReviewID": "UR42011096", "Content": "First, I have to say the property is beautiful. The rooms are well appointed, but the service lacks. We arrived late on a busy friday night to a not so pleasant front desk agent who was not shy in showing it. We were assigned the WORST studio suite possible. Our view was over the timeshare office. I had called ahead to let them know we were arriving late, so that, if possible they would assign us into a better room, as this was the second time we had stayed in that room. Such a dissapointment. As for the service between day and night - was exactly that - polar opposites. Since we had arrived late we had not eaten so went to call in to order room service (from the room service 'all night' menu) to find they no longer serve over night. Hmmm...Then take that out of the room maybe??? Just a thought... Then, we went to use the fridge and once we opened it, the freezer door fell off. We called it in, but was not offered to fix it. We also only had one robe in the room, and things missing in the mini bar... Just strange. I understand it is tough economic times, but when it is most important to leave a good impression, I would think it would be now, especially when people have paid thousands and thousands of dollars for this timesare - SUCH A WASTE. I do sound like I am venting a little much, but I myself work in the hotel industry, so I appreciate quality. Even decent quality.)", "Date": "September 15, 2009"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Overall": "3.0", "Value": "2", "Location": "2", "Rooms": "2"}, "AuthorLocation": "Tennessee", "Title": "“Would Not Stay At Vino Bello Next Time”", "Author": "rnc99", "ReviewID": "UR39383882", "Content": "Booked through Priceline, that was my first mistake. Pd $175/night & found a promotion online for the same room for $129/night, Priceline refused to match & of course, I could not change the reservation...so a little unhappy to begin with, but we thought, ok, no problem. The room was well appointed & located, in the Chardonnay bldg, 2nd floor overlooking the pool area, 2 double beds & front desk would not change us to a king without an upcharge which was disappointing. Nice fridge, MW, robes & bathroom, but water dripped continuously from the a/c & the foyer entrance into the rooms made opening & closing the doors very LOUD for all the neighbors. We ate dinner at Sienna on the property, which was fine, except our food required about a 1 hr. wait & there were only about 3 tables occupied at the time. Our waitress adjusted our bill & explained the mistake when she finally served the food, so while it was addressed, it made for a less than stellar dining experience. The wine cave was closed when we attempted to go for the \"free\" tasting. We didn't really appreciate the $15 resort fee/night tagged onto our bill at the end either. We would not choose this place in the future as there are too many quaint & better located places to stay next time.", "Date": "August 31, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Location": "4", "Rooms": "5"}, "AuthorLocation": "Charlotte, North Carolina", "Title": "“Luxury Hotel with great Spa”", "Author": "sdbyrd", "ReviewID": "UR38387155", "Content": "My wife took me on a trip to San Francisco/Napa for my 30th birthday and we stayed at Vino Bello in Napa. We were both happy with the entire resort during our 2 night stay. The room was spacious and had a large bathroom. I'm not sure if all of the rooms are much different from each other, but ours had a mini-fridge, microwave and a flat-panel TV. We received a free bottle of wine in our fridge upon our arrival. There was also a large pool, small kiddie pool and an average size hot tub. Two gas grills were also setup at the pool area to use freely. We bought some steaks and had our own cookout one night and it was a lot of fun! Although it's a 5 minute drive into downtown Napa, the resort offered a free shuttle service that ran every half hour. This was very convenient since we didn't want to drink & drive. We also had massages in the Spa's 22,000 sq/ft Cave! I really don't have any negative things to say about Vino Bello and would highly recommend to other travelers.", "Date": "August 21, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "3", "Rooms": "5"}, "AuthorLocation": "Berkeley, CA", "Title": "“Comfortable, well-appointed resort”", "Author": "MFoucs", "ReviewID": "UR38111075", "Content": "Took wife on a two-day visit to Napa and stayed at Vino Bello. Overall, had wonderful experience. Easy check-in and excellent service. We enjoyed the suite, appreciated the complimentary wine bottle, and loved the pool area. We found it to be more of a family-oriented than couples place, but that didn't bother us. The Meritage (part of Vino Bello--you actually check in at the Meritage) seemed to have more conference-type events going on. We went for a short walk in the vineyard, lounged by the pool, and checked out a DVD from their complimentary movie library, along with a bag of popcorn. Only complaint was the location: a bit out of the way and in more of a business area south of the town of Napa.", "Date": "August 19, 2009"}, {"Ratings": {"Service": "1", "Cleanliness": "5", "Overall": "2.0", "Value": "3", "Location": "3", "Rooms": "3"}, "AuthorLocation": "bubbly57", "Title": "“Good Place (4 Stars) but Reservation Snafu (Poor)”", "Author": "bubbly57", "ReviewID": "UR37258046", "Content": "I have stayed here numerous times with friends but this was the first time I booked the reservation. I enjoyed my stay but the service this time was far from perfect and a five star resort. I booked online and immediately called the hotel to ensure that I received a room a high floor and the two bedroom condo unit I reservered had the two beds in the second bedroom. I was told to call the 866 number listed on the website which I did, have the gentleman my information and said it would be noted in the reservation. When we got there at 9:30 and the room was not ready (not an issue we were early) but we could \"early check in\", told the young woman my room info and said not a probem, you are here early! We went out for the day and got back at approx 4:30 and went to our room \"assuming\" we had the room I called in advance for and double-checked at check in. Well it was not, we had one bed and a pull out and no other rooms unavailable to until the next evening. After much going back and forth and being told by the manager that the 866 I called, she had no idea what it was or who I called (posted on the website), she finally agreed to adjust the room rate (she took off one of the rooms fee, thank you, we were pleased). She agreed to move us to next day to the room I had requested. Day two arrives, I call the front desk and speak with a gentleman, I explain what had happened, he said they will move while we are out for the day. Trying to be nice and accomodating to the staff at the site, we moved all of our luggage into one room and let the front desk know. I explained that we will need to have a room as we had spa treatments for that afternoon and needed to be in our new rooms by 3:00 at the latest. Said it should not be problem. We got to the site at 3:00, waited in line for about 15 minutes because others were having issues with their reservations. Long story short, two rooms that we paid for were now given away, we had no rooms. The room with a luggage had the door open when we arrived, it was already cleaned and people were already checked in! Our rooms that we were being mvoed to were still not ready. So we paid, thank goodness for only one room thanks for the comp\"d room the night before but paid for a room a full day that we were checked out of. We were moved to a room with the two beds but it was over, I guess the trash and fixit station. I guess we got paid back for our \"free\" one room. To top it off, they were paving the parking lot and they stagged their equipment on our little parking area at 7:00 in the morning. No notice of construction when you checked in, found out about it with a note tapped to the entry door to building. Had to park on street as there was not enough parking to accomodate their guests. Although the place is nice, the managment team needs to help assist their customers in the problems that the site encounters and brings on themselves.", "Date": "August 10, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Location": "4", "Rooms": "5"}, "AuthorLocation": "Portland, OR", "Title": "“I would come back”", "Author": "gobeav494", "ReviewID": "UR36989119", "Content": "While some of the other comments bear some merit, we had a noise problem as well, but the staff took care of the problem immediately. Part of the property is a time share, but I could not have cared less. I really liked the fact that there was an adults only pool as well as a family pool. We have a large family, but we were getting away! I really don't want to worry whether or not the swim diaper works while I am in the sauna while on vacation. The staff were excellent, the food in the bar was rather tasty. I would go back, however, I must admit that I got a screaming deal on Expedia. I might shop for future trips if I did not get such a deal later.", "Date": "August 7, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Location": "4", "Rooms": "4"}, "AuthorLocation": "california", "Title": "“Great Place to stay”", "Author": "curlyqlinks", "ReviewID": "UR36365514", "Content": "My husband and I spent two nights with our nephew and his wife in a one bedroom condo on the ground floor. We wine tasted the first day with the help of the concierge and returned to cook dinner in our kitchen. The next day we attended the races in Sonoma and returned to our \"home\" to cook another meal. We loved the feeling of our condo. Everything was first class. The only issue was upstairs neighbors noise all night and a shower of objects being hurled from the top floor while we were lounging on our patio. One call to the front desk took care of it. We plan to return next year.", "Date": "July 31, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "3.0", "Value": "3", "Location": "5", "Rooms": "3"}, "AuthorLocation": "Happy Valley, OR", "Title": "“Who was the contractor on this project?”", "Author": "bigedHappyValley_OR", "ReviewID": "UR35884192", "Content": "Certainly a beautiful place but: --Long line at check-in with only one clerk --Room temperature was 51 degrees --Not sure who built the timeshare units but the first night I felt that I was in a room with a toddler banging pans until midnight. Very poor construction. Staff was helpful and did change my room.", "Date": "July 26, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "4", "Location": "3", "Rooms": "4"}, "AuthorLocation": "Southern California", "Title": "“Get a third floor room!! Ceilings not insulated at all -- or maybe there were monkeys upstairs!”", "Author": "europeadvise", "ReviewID": "UR35320898", "Content": "This is the first timeshare that I have ever checked into where no resort activities sheet was given out. Normally, resorts will have activities for adults and kids. No information received. On the positive, no sales pitch either. We entered our room to find a cart loaded with paint supplies, etc. I called the front desk and they said they would retrieve the cart. When the maintenance guy came, he advised us that the air was not working properly and would not cool off under 75 degrees. Well, that is cool enough for us, but he neglected to tell us that the air would defrost and water would drip in the entry and the shower unless the air ran continuously. So, we had a cold waterfall coming out of the ceiling on us in the shower. The pull-out was stained with who knows what -- it took some convincing for my daughters to sleep on it -- ugh! Then at about midnight, monkeys moved in upstairs. So, by the morning we requested a new room, unfortunately it took the better part of the day to get the move done. Once we relocated the stay was better, but it took up half of our two-day stay. Ironically, they were concerned about getting the maids in to clean our old room -- why would the have any new guest move in without fixing the air??? The rooms are really beautiful and I would bet a stay on the top floor would be absolutely a pleasure, but the lower floors are not the best. So, beware!", "Date": "July 21, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Location": "4", "Rooms": "4"}, "AuthorLocation": "Abita Springs, LA", "Title": "“Vino Bella...Molto Buono!”", "Author": "AbitaGuy", "ReviewID": "UR34581754", "Content": "We spent three nights at Vino Bella and we really enjoyed our exprience. Rosemary, the concierge was wonderful. Cynthia at the restaurant was so very kind and helpful. In fact, from our waitress to the bar tender, all of the staff were friendly and most helpful. Should our travels take us back to Napa, we most certainly will stay at Vino Bella!", "Date": "July 12, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Location": "4", "Rooms": "4"}, "AuthorLocation": "New Jersey", "Title": "“Beautiful Stay in Beautiful Napa!”", "Author": "njstraveler", "ReviewID": "UR34081125", "Content": "This resort was wonderful from the time we arrived until we checked out. The staff and concierge were great and the room was perfect for us! When we turned into the industrial park area, we weren't sure what we would find. But the grounds and interior of the resort were beautiful! Upon check in the gentleman at the front desk made us reservations at a great restaurant downtown. The shuttle service was great too. The concierge booked us on a Wine Tasting tour with Platypus...which I highly recommend! Overall the resort was wonderful! I would recommend it to others and definitely stay again.", "Date": "July 6, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Location": "4", "Rooms": "5"}, "AuthorLocation": "Houston", "Title": "“No Mistake it is a time share but a darn good one”", "Author": "SpenceHouston", "ReviewID": "UR34076375", "Content": "Down falls >> Its in a buisness park. so the front of the site is not so great. but please don't get me wrong you can live with the front not so nice for the price of the stay. Ups>> 1. Room was nice....no very nice. We had our own kitchen, laundry, dineing room, livingroom, even a JACUZZI in the bedroom. Bathroom was huge. 2. The backside of the grounds are great nice pool area as well. You can also go next door and use the pool and Spa. 3. The staff was great. 4. NO sales pitch. They asked us once, yes only once, if we would like to see what they offer. We said no and that was it. NO sales pitch!!!!! 5. Great food in the dining area a little pricey but very good wait staff.", "Date": "July 6, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "3.0", "Value": "2", "Location": "2", "Rooms": "3"}, "AuthorLocation": "Los Angeles", "Title": "“Not a 4 star resort. More of a timeshare.”", "Author": "laurjohn", "ReviewID": "UR32884833", "Content": "I booked this resort through Priceline (only saved $10!) and it was listed as a 4 star resort. Not true! It is really a timeshare resort. It is located in an office park and is adjacent to another resort which seems much nicer. The rooms are nice and clean and have a small kitchen counter with a sink, fridge, microwave and toaster oven. We stayed in a studio. I thought it was very expensive for what we got. Over $200 a night for a hotel that was not as nice as many I have stayed in. We were on the second floor of a 3 story building and could hear people upstairs walking around until all hours of the night. Also, the air conditioning was not working well the second night of our stay. At one point I tried to call both the concierge and front desk and the phone just rang and rang with no answer. Finally got an operator. Parking was a problem at night. Had to park very far away from our building. Also, there is construction underway that we were not aware of beforehand. It was not going on over the weekend. There is a nice pool area for families with a kiddie pool and water feature area for them. Our toddler enjoyed that a lot. We arrived around 3:00 the first day and was told by the concierge that there was a restaurant in the hotel, but we found it to be closed until 5:30. Had to eat in the bar with our toddler. Food was good though. The concierge for the Vino Bello was there on Saturday when we checked in but informed us she was leaving for the rest of the weekend and we could use the one in the adjoining resort. Seemed strange as it was a busy weekend there. Overall, it was not what I expected and I was disappointed for the amount of money we paid to stay there.", "Date": "June 22, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "2", "Location": "3", "Rooms": "4"}, "AuthorLocation": "California", "Title": "“Overall, a nice place....”", "Author": "linds_g", "ReviewID": "UR31598309", "Content": "I stayed here with my mom just for the night for a Napa girls trip. Like the other reviews said, the Vino is located in a weird place, but the grounds are very beautiful. The free shuttle to downtown Napa is a huge plus, so you don't have to worry about driving after enjoying some local wine! The driver, Tony, was awesome, and gave us great restaurant tips (Allegria, most def check it out). The room was really nice, with a little patio, and check in/out was easy. Even though it's a time share property, the staff did not push us to sit through a boring presentation AT ALL, which was nice. The \"complimentary wine\" is a rose, so keep that in mind if that's not your deal. We brought a bottle of chardonnay and some cheese and crackers, and enjoyed our lovely patio. My only big complaint was the RIDICULOUSLY loud air conditioner. It kicked on every fifteen minutes or so, and seriously sounded like a plane was taking off or something. Like, my mom and I had to literally raise our voices to hear each other! But, overall, this was a beautiful place. We got a deal on expedia....I would DEFINITELY not pay three hundred bucks to stay here, but then again I probably wouldn't pay that much to stay anywhere. If yiou can get a decent deal, check it out.", "Date": "June 4, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "4", "Rooms": "5"}, "AuthorLocation": "Alpine, CA", "Title": "“Resort Extraordinaire”", "Author": "AlpineCowgirl", "ReviewID": "UR30854706", "Content": "We just stayed 5/18-22 at Vino Bello Resort! LOVED IT! Beautiful place, HUGE 1 bedroom suite, lovely decorated, quite location, a bit out of the way, but we were so tucked in and comfortable we hardly noticed, except to drive in and out to wineries and dinner. Easy to get in and out of. Lots of ammenities. Housekeeping was spotless and we appreciated the extras. Had room service, it was fine too. Lots of paths to wander up the hill. Beatiful landscaping. We had hoped to trade our week through RCI, but that did not come through, so we paid a pretty high rate, because we thought from the website it was worth it. IT WAS GREAT!", "Date": "May 26, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Long Beach, California", "Title": "“Napa Hidden Gem!!”", "Author": "sabi", "ReviewID": "UR30675274", "Content": "Just returned from 5 day 20th Anniversary Get-Away. This resort located in a industrial area sits on the same grounds as the Mertiage Hotel. We had a one bedroom studio which was just perfect for the price ( didn't have the points to book through RCI) and the two of us. The location of the resort is perfect, just off the highway and 4 to 5 miles from downtown Napa. You have to visit the downtown area - Allegria - Restaurant was the best. I mean the very best. The food and service was top notch - went there on our first day of arrival - 20th and then we had to celebration our departure with a great meal. Some of the other gotta try restaurants (sorry can't think of the names of them but you have to go and eat there) are right in that little square near the vistors information center, another one that stands out is Piccolini ( good - decent). Also go by the um... riverfront right off of First street near the courthouse and Napa Inn B&B a few other good eats and a delicious sweet shop. Don't go to Buttercreme Bakery! It was a waste of our time and money. Not one of our personal favs - have and MUCH MUCH better and the staff wasn't very friendly. Back to the resort for a minute: The staff at the Mertiage is great - people friendly and the bar area is perfect with great evening entertainment. I am not a wine drinker but my husband drinks socially. We visited some very nice wineries - the most memorable being in St. Helena just about a 30 minute ride from the resort. Our two favorites were The White Hall and Prager ( actually met the owners). They are just off the main highway down the road from each other. Prager was very interesting because the tasting and wineries are in the backyard or basment of the owners summer home? Busy they are but very accommodating. Heading back to the resort is a restaurant called The Mustard. Fine to California Casual dining. nice prices and the food looked very good but the wait was 25 minutes and we had, had too much to sip so we needed food ASAP (LOL). I mean a day full of sipping can take its toll. Anyway, back at the resort there is a sufficient fitness center to meet your cardo needs and the pool and jaguzzi was great. This resort doesn't have a restaurant on site so you share with the Mertiage which is maybe 20 steps away. The food was always excellent. I hope this write up helps and if you have any further questions please ask. Oh.... evenings require a lite sweater or jacket. PS: the only minus is in the AM when housekeeping and I guess other visitors are moving around you can hear them. But for some reason today - Sunday- it wasn't so bad.", "Date": "May 24, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Location": "4", "Rooms": "5"}, "AuthorLocation": "Clovis, California", "Title": "“Enjoyed our stay very much!”", "Author": "mpbros22", "ReviewID": "UR30539254", "Content": "The rooms were very clean and comfortable...all the comforts of home. The grounds were beautiful and well kept. Our room had a nice balcony which I would recommend, however...be careful....we got locked out on our patio due to a finicky door lock and had to holler to other guests to call staff to let us in!!! We took it in good humor, but just a word of caution if you go on the patio late at night! The staff was very friendly and helpful. In particular, the concierge gave great advice on recommending where to dine ( and they will be happy to make reservations for you) and which places to visit. The hotel offers a complimentary shuttle which takes you to downtown Napa in the evening between 5:30 and 10:30 ( about a 7 min drive)....a great ammenity if you feel like enjoying some wine over dinner instead of being the designated driver!!!! The location isn't directly in the heart of the valley , but it is only a short drive (about 8 minutes) to the beginning of the valley where all the wineries along highway 29 begin. Also, this is a hotel, but it also a time share type property. However, not once did we feel any pressure to buy them! We were only informed one time in an off-hand and casual manner that we were welcome to attend a session to learn more about those opportunities. We graciously declined and that was the end of it!", "Date": "May 22, 2009"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Orlando, Florida", "Title": "“Great for the price”", "Author": "jandres12", "ReviewID": "UR29338947", "Content": "This place was great for the price we paid ($95/night on priceline + a resort fee). It's a newer place, and had a nice walking trail througha vineyard where you can reach the \"grape crusher\" you can see from the highway. It is in a great location to visit both Napa and Sonoma. They were very friendly in the wine tasting cave, although it's not the greatest wine. Did not use the spa, but the concierge was very helpful when you could fine him.", "Date": "May 4, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Location": "4", "Rooms": "5"}, "AuthorLocation": "CA", "Title": "“Excellent Choice in Napa”", "Author": "framtid", "ReviewID": "UR29109576", "Content": "Overall a great place to start your Napa visit. Although they initially fumbled the reservation, they quickly fixed the situation and upgraded me. The place was immaculate and I'm planning to send my parents to this hotel when they visit this Summer. My few issues were: 1) the wine they give you as part of the \"hotel fee\" was swill; 2) very little sound proofing (get a place a high floor); 3) stay away from the entrance doors (you will here everyone come in); 4) This option didn't come up on my initial search of Hotels.com...I found it some other round about way (yet it was still sold out during my stay). Just some thoughts from a very frequent traveller.", "Date": "April 30, 2009"}, {"Ratings": {"Service": "1", "Cleanliness": "2", "Overall": "1.0", "Value": "2", "Location": "1", "Rooms": "3"}, "AuthorLocation": "Washington", "Title": "“You've Got to Be Kidding!”", "Author": "PQBrown", "ReviewID": "UR27567003", "Content": "The \"resort\" is in a corporate park. No kidding! From the balcony we could watch people going to work at the numerous plants and offices situated there. And after a day in the area, we met some of these folks as they left work. Weird. The resort itself is a bit like an apartment building underserved by a single elevator. The cleaning staff blocked the narrow hallways throughout the day. The balcony was tiny. We were just happy that we insisted on a room WITH a balcony rather than the main floor room (and the tiny, very public concrete \"pad\") they wanted to put us in. The one positive aspect: we chose NOT to sit through the presentation enticing visitors to buy into the vacation club.", "Date": "April 7, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Location": "3", "Rooms": "5"}, "AuthorLocation": "San Francisco", "Title": "“High maintenance customer couldn't have been happier”", "Author": "Tellmehowtosayit", "ReviewID": "UR27451806", "Content": "I threw a wedding shower in a room at this hotel two years ago. The location was right for the bride- she lives nearby in Napa. So, when it came time to throw her baby shower, it seemed right to pick the same place. Honestly, the first time around, I was sort of disappointed with the customer service I received on the phone-they couldn't find the reservation, they were argumentative. When I got there, it was beautiful and people were nice, but the experience was a little soured because of the phone service. The hotel was still very new at that point and they were working out kinks. This time around, there was not one shortcoming. The rooms are BEAUTIFUL! The kitchen has everything you could hope for. The bathrooms are amazing. The living rooms are cozy. The dining table is homey and inviting and the bed is beyond comfortable. The little things- plenty of storage space, good lighting, an easy outlet in which to plug in the iron near an easy place to set the iron up- add up to be a big coup for this establishment. I could go on and on about the amenities, but, as wonderful as they are, the hotel's true strength is in their service. Everyone was accommodating. When the shower invitation list exploded the week before the shower, they helped me find the space for everyone, at no additional cost to me. The honored my request for a first floor room with outside access, via the inviting patio. When I called at 10 a.m. and asked, \"Is it possible for you to clean our room before 11?\" The reply was, \"I'd love to, but I personally can't. I will send housekeeping there right away.\" Everyone was happy and helpful and positive. They made eye contact and thought of small details. I am a picky customer. It takes the planets to align for me not to find one thing wrong. They worked hard to make me happy, and I was beyond happy at this hotel. If you want to be surrounded by wineries, this is not one of those hotels. The location is a bit funky, on the outskirts of a corporate park, but it is not far from highway 29, one of the gateways to the wineries, and it is a good jumping off point for several area attractions. I would stay there again in a heartbeat. I think the experience is best summed up by the mom-to-be at my shower. She said, no less than 10 times at the shower, \"I want to live here.\" It feels as comfortable as home, but with daily housekeeping service.", "Date": "April 5, 2009"}, {"Ratings": {"Service": "1", "Cleanliness": "3", "Overall": "2.0", "Value": "1", "Location": "4", "Rooms": "4"}, "AuthorLocation": "Iowa", "Title": "“The service did not match the venue”", "Author": "prettyshoesiowa", "ReviewID": "UR27017474", "Content": "Although the hotel and our room was beautiful, there were many issues with this resort. I booked the room (a 2 bedroom suite) online and there was no indication that the second bedroom was actually a separate hotel room. I had intended on using the second bedroom for our infant daughter but could not since the room was separated by a hallway and two doors. Tracking down housekeeping was a daily chore. Everyday (except for the last day of our stay) I had to call the front desk multiple times to request housekeeping. The housekeeping staff did not answer the front desk calls and seemed to not be interested in cleaning upon request. Our suite had a washer/dryer which was wonderful but the dryer was malfunctioning, causing stinky air to blow into our suite and the clothes never did dry fully. Again, a call to the front desk was met with apathy and a vague promise of \"We'll send someone to look at it.\" Not suprisingly, no one ever came. We ordered room service for dinner and the food was truly appalling. My $36 palm sized chunk of \"filet mingon\" was not edible and my husbands turkey sandwich was just about the same quality. Our room and the grounds were beautiful but the service did not match the price we paid or the surroundings. I did enjoy the Spa Terra- a beautiful space with excellent services- no complaints there. If we had been staying at an $89 a night hotel, the service would have been acceptable but for the $300 plus a night, the service was appalling. Skip this resort and stick with something more established like the Silverado.", "Date": "March 29, 2009"}, {"Ratings": {"Service": "2", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Location": "2", "Rooms": "3"}, "AuthorLocation": "New York, NY", "Title": "“A Little Far From the Wineries...”", "Author": "bongo1480", "ReviewID": "UR26883794", "Content": "I booked my hotel stay at the Vino Bello thinking that it was in the heart of Napa and the Napa Valley. The hotel was about a ten minute drive from downtown Napa and about a half hour drive from the heart of Napa Valley and its wineries. The hotel is part of the Meritage group and I was a little confused as to how it fit in with Vino Bello. I stayed in the 2nd building on the first floor. It was great having a washer and dryer, but the room I had didn't look like what I had seen on the website. It was a little smaller and lacked a full kitchen, which was fine, since we didn't use it at all, save the kitchen sink. I didn't take advantage of any of the spa services, the pool or the winery that is housed on-site. It was a little strange to think there is a vineyard there, because it's in the middle of a corporate drive setting. I did use the exercise room, which could use a more modern set of treadmills, but it was empty, so I can't complain too much. Overall it's a good option for its amenities, but I didn't pursue those options. There was some construction going on, but it didn't bother me.", "Date": "March 26, 2009"}, {"Ratings": {"Service": "2", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Location": "3", "Rooms": "5"}, "AuthorLocation": "Tampa, FL", "Title": "“Beautiful Rooms, not so great location”", "Author": "Florida_Sunshine80", "ReviewID": "UR26805261", "Content": "This Hotel is beautiful. We upgraded to the King Suite and although the person at the front desk had trouble doing his job and gave us the wrong directions to the building, the room made up to it. Upgrade is only 50 dollars more, but def worth it. It comes with jetted tub and fireplace. If booking here, make sure to keep in mind that this hotel is located outside of Napa. It’s a bit of a drive to downtown Napa and then about 30 miles to vineyards, which is not a big deal, but something to keep in mind after doing a full day of wine tasting. We headed back to San Francisco the following day, but other people that were staying here weren’t too happy about having to do the drive back to the vineyards the following day. Also if visiting Napa, make sure to visit Sterling Vineyards. It is $25 per person but you get to taste 3 different wines and most importanly ride in their cable car to the vinyard, which offers the most spectacular view of the region.", "Date": "March 25, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "California", "Title": "“Our first trip to Napa and Vino Bello made it memorable.”", "Author": "RoadTripper69", "ReviewID": "UR26790064", "Content": "We thoroughly enjoyed the beauty and comfort of the resort. We have commented several times regarding your provision of a shuttle into town. We did not need to worry about too much wine tasting or getting lost in an unfamiliar area! The friendliness of the staff caused me to comment that this must be a great place to work. Thank you so much for a memorable experience.", "Date": "March 25, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Honolulu, Hawaii", "Title": "“Wow...everything I wanted in a room”", "Author": "LadyElle", "ReviewID": "UR26081406", "Content": "I didn't want to leave! My dream room had a full kitchen, fireplace, lanai, supercomfy bed, soaking jetted tub and a good sized shower... WOW, the room at Vino Bello had it all. I was impressed since the room was squeaky clean and the complimentary bottle of wine, water and pepsi in the fridge was a very nice touch. The front desk staff was friendly and very helpful. Early check-in wasn't a problem so sitting around waiting for a room wasn't necessary. The spa is located in caves. It was an interesting experience. I had the tension tamer and terra firma foot treatment. with David. Great way to refresh before hitting the wineries in the area. Although we didn't use it ~ room service it was available from early breakfast to late night snacks ~ pool was heated I thoroughly enjoyed my stay at the Vino Bello and plan to stay there next time I'm in the area. p.s. They also had a washer and dryer in the unit so I took advantage and washed everything before we headed out", "Date": "March 12, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "2.0", "Value": "3", "Location": "4", "Rooms": "2"}, "AuthorLocation": "Minneapolis", "Title": "“Just an average stay...”", "Author": "MidwestGuest23", "ReviewID": "UR25814363", "Content": "My wife and I visit Napa each year for her birthday and spend 4 or 5 days hiking, relaxing, dining out at the many great restaurants and visiting a winery or two. We always stay a couple of nights at our favorite resort in the world, The Carneros Inn and save it for the last two nights of our trip. If you've never stayed at The Carneros Inn, and want the ultimate relaxation and top-rated guest experience and can afford the over $350 per night price tag, then please skip past the Vino Bello Resort and head over on Hwy. 121 to The Carneros Inn. You won't be disappointed. My wife can usually only afford two nights at The Carneros Inn and always spend a couple of nights testing out other resorts. For us, the experience at Vino Bello was just ok. Vino Bello gave us a room in their Chardonnay building which happens to be their Shell vacation ownership rooms. The toaster over was broken, their was a large stain on the carpet, most likely wine, and the toilet paper holder was broken. The couple next door to us on the 3rd floor had their TV on and we could hear every word of what they were watching. I had to turn our TV on to drown out the noise. Another worry is that the ice machine is located on the first floor outside of the secure entrance. It is in a back service corridor which is a bit odd place to put it for your guests to find. Also, we don't have kids, however I would feel uneasy sending my child to get ice when you have to go outside of the hotel building and the door lock behind you. Also there was cigarette butts at the base of the ice machine which tells possibly the employees are using this area as a smoking lounge. Be careful when asking the concierge in the main check-in building for a list of nearby restaurants, they don't have one, which is very odd, however they will start to recommend many in the Napa valley which they partner and use the list to sell you into joining them for a 90 minute presentation for selling their Shell Vacation Resort ownership to you. All in all, we will continue to search for other resorts and always get that wonderful feeling when we head down the road to The Carneros Inn for a couple of incredible days and nights of bliss. Please check out their website if you don't believe me. www.thecarnerosinn.com. By the way, this year they added two Audi A8 cars to their cottage resort and they use them to shuttle their guests around the property. The only reason I used their Audi A8 service was due to the extreme rain that was falling throughout our stay. Trust me, if you can afford the extra money then head down the road. You won't be disappointed.", "Date": "March 8, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Location": "4", "Rooms": "4"}, "AuthorLocation": "Sacramento", "Title": "“Very impressive”", "Author": "RCMom", "ReviewID": "UR24688204", "Content": "My husband and I stayed 2 nights celebrating our anniversary. The room was gorgeous and the most spacious we have stayed in. We got a great deal, buy one night get the 2nd half off and so we booked the 1 bedroom suite. The staff was friendly and helpful. Never once were we approached about a time share. Although served 24 hours, the room service menu wasn't very appealing. We would definitely stay here again.", "Date": "February 17, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "3", "Rooms": "5", "Location": "5"}, "AuthorLocation": "san francisco", "Title": "“Great Relaxing Getaway!”", "Author": "swat23", "ReviewID": "UR24354073", "Content": "I stayed in the one bedroom condo with my g/f for two night during the weekend of the Super Bowl. They have friendly staffs. The condo is super clean and the bathroom is huge. We enjoyed using the jetted tub inside the bdrm. Very cozy and relaxing. Not too far from the wineries. I would recommend this to friends and family.", "Date": "February 7, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "3"}, "AuthorLocation": "Redding, California", "Title": "“Terrific rooms, great stay”", "Author": "Redding75", "ReviewID": "UR23962166", "Content": "Once you have made it through a somewhat unique approach to the resort (through an industrial park), you arrive at a very nice hotel with fantastic rooms. The one bedroom condo we stayed at was so roomy and comfortable, we had friends over one day for lunch that we cooked in the fully equipped kitchen and served at the huge dining room table seating 6 very comfortably. The living room has very comfortable couches where you can enjoy the fire place or the big flat-screen TV. The bedroom has a huge king size bed, with another good size flat-screen TV and a big tub directly adjacent to the bedroom between it and the bathroom. Everything is still in like new condition and very tastefully decorated. In terms of amenities, we didn't use too much, but there are two pools on the property, a business center with internet access, another great fire place in the lobby that is fun to hang out at, and on and on..... Overall, a great romantic getaway and yet can feel like home! We have been there twice and will go back again.", "Date": "January 27, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "aiken", "Title": "“slept in luxury”", "Author": "mccannacraig", "ReviewID": "UR23950384", "Content": "We visited family and the wineries in December and stayed at this location. It is not far from the wineries and the hotel can provide a wine tour map and some recommendations. I preferred staying here and away from the winery traffic so it was a very quiet setting. The service was excellent and the room was fully furnished with wine glasses and a complimentary bottle for tasting. It was nice to come back after a nice dinner and sit by the fireplace in the room to reflect on the day. The beds were very comfortable and other furniture went well with the decor. I would definetly stay here again. The staff was there to take care of any needs you may have.", "Date": "January 27, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Houston, TX", "Title": "“Liked it”", "Author": "yordi", "ReviewID": "UR23732670", "Content": "My family and I went to Napa to spend some time together and got a pretty good deal at the Vino Bello. We liked the room, the view, and service overall was pretty nice. Upon arrival, they called to see if we found the room okay or if we needed anything else, I thought that was a nice touch. They had their own wine tasting in the afternoon and we liked the atmosphere and wine. We really liked our stay and would probably be back. True it isn't that close to the wineries but it made it easier for us when it was time to continue our journey. The only little problem that we had was the drain of the shower not working properly, but I guess it was partly my fault because I could've told them, I'm sure they'd have fixed it right away. Not that much of a problem since we only stayed for a couple of days.", "Date": "January 20, 2009"}, {"Ratings": {"Service": "1", "Cleanliness": "3", "Check in / front desk": "3", "Overall": "2.0", "Value": "2", "Rooms": "1", "Location": "1"}, "AuthorLocation": "Reno, Nevada", "Title": "“Heartbreaking”", "Author": "reno_gypsy", "ReviewID": "UR23570545", "Content": "I convinced my husband and Mother-in-law to have a Christmas vacation out of town. I had to really fight to get my husband to agree on a stay at a \"resort\". The price was good for three people to stay, it was afterall a two bedroom \"suite\". When we arrived the location was kinda yucky, not really in Napa. We were checked in and went to our room and it was fabulous, everything they said it would be...except it was only one bedroom. So we had to get another room. They said all the two bedroom suites were taken and convinced us that two adjoining rooms would be just as luxurious. (First of all we made that reservation like six weeks in advance AND called two weeks before to check on it. ) The room was ugly,(so ugly, fire that decorator) the furniture was terrible and uncomforable, and we got no compensation for the mess up. We were charged $15/day as a resort fee to replenish the sodas, coffee and water in our fridge, that never did happen. We had to call to get towels replaced, they took the dirty ones, but didn't think we needed more I guess. The food in the Siena was expensive and uninterresting. I guess my biggest complaint is that I went for luxury, at $274 + $15 wasteful resort fee for my room and feel like I stayed at a Holiday Inn.", "Date": "January 15, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Granite Bay CA", "Title": "“Great place for a weekend with family.”", "Author": "michaeljsz", "ReviewID": "UR23433872", "Content": "We have stayed at the Vino Bello 3 times now and have not had a single complaint. The staff is very pleasant and the room service is actually great tasting and fast compared to most resorts. We always get a 1 bedroom condo and it's perfect for small familys with children. We have twin 2 yr old boys and they get so excited everytime we go, they love running around the large rooms. We have stayed in many of the nicer resorts in Napa and found this resort to have the nicest rooms, nicest staff, and best room service. The resort itself is at the souther most tip of Napa so if your going to wine taste for the weekend and want to stay in the middle of all the vineyards and close to downtown its not that close(10 min to downtown) , but in my opinion its nice to stay in a quiet out of the way place after going up valley all day taking in the sights. If you wanna nice place, great rooms, great food, great staff,great pool area for kids all for a great price this is the place.", "Date": "January 10, 2009"}, {"Ratings": {"Overall": "3.0"}, "AuthorLocation": "Northern California", "Title": "“Watch out for the sneaky resort Fee”", "Author": "Vineys", "ReviewID": "UR23409105", "Content": "I booked thru Hotwire. I compared rates and star ratings in Napa and committed with my credit card, and was appointed the Vino Bello. It is away from town a bit - but that is fine. I think it is NOT a 4 star as advertised. It is new, so naturally it is clean and has some nice amenities. But a 4 star is a 4 star - and newness should not be a reason for an increase in the rating system. I am a little hard of hearing, but boy can you hear every footstep of the people avove you! Get a top floor room!. The thing that made me the maddest, since I booked on Hotwire & was given a price before I committed, was the sneaky $30. \"resort Fee\" they charged me for my 2 night stay. They came up with a fancy name for it, but they might as well call it a \"We- want -an -extra -$15 -per -night- fee\" ... that was a bit sneaky...It's not that the place wasn't worth it & it's not about the money, rather the way they whip that on you as you check in...Say whaaa? Huh?....I did'nt make a fuss but I was certainly thinking that was a low blow. I sent a complaint in to Hotwire - they need to insist their offerings do not tack on extra costs \"after the fact\"...otherwise it defeats the purpose of shopping and comparing rates. ....In all fairness, the rooms though small, were well appointed, but it is still just another nice motel room....I think the main building (Meritage) with the fancy lobby and restaurant could be considered 4 star, but if you end up in one of the so-called condos Like the Cabernet building which is seperate - it is basically just another nice hotel room. 3 star to be sure, but 4 star would be a stretch....", "Date": "January 9, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "3"}, "AuthorLocation": "California", "Title": "“Great Deal for Beautiful Room”", "Author": "krafter00", "ReviewID": "UR23262287", "Content": "We loved our time at Vino Bello Resort. We were a little worried since it was a new resort and the prices were so reasonable, but were blown away by the accomodations. We stayed in a one room suite with a jacuzzi tub and fireplace. We used both of those every night, and slept very well in the comfortable bed. We were also concerned about the construction, but had no problem sleeping in until 9 each day. The only drawback is that it is on the south end of Napa, but the drive to the wineries was so pretty that we didn't mind. Be careful with the directions on the website, the turn on to \"Corporate Way\" is a mistake. The street is called something different from the direction we travelled from (Oakland Airport). We would recommend the hotel to anyone (and in fact, already have).", "Date": "January 4, 2009"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Business service (e.g., internet access)": "4", "Check in / front desk": "2", "Overall": "1.0", "Value": "1", "Rooms": "4", "Location": "3"}, "AuthorLocation": "clovis,ca", "Title": "“NO RUNNING WATER”", "Author": "Travelingfool20", "ReviewID": "UR22852268", "Content": "We booked through plriceline and got a pretty good deal of $85/night considering it is low season in Napa. Upon arrival, i notcied the hotel is in the bottom of Napa, not the best location for wine tasting. While checking in, they failed to mention that there was NO WATER. The room was nice, kitchenette, W/D, I dont know if i Would rate it 4 star. But it was nice. As soon as we realized there was no water, we called the front desk, who said it was due to construction, would be turned on in 20 minutes. This happpened about 4 times. I asked to speak with a manager, they assured me one would call, they never did. 6 hours and a case of food posioning (not from there) later, Still no flushing toliet. It took quite a fit and us mentioning the fact this is completely unsanitary and unsafe( no water for sprinklers in case of a fire), to get us moved into another area of the hotel, which was not nearly as nice. The management and staff did absolutely nothing to compensate or even offer to refund the cost of the room. I called priceline, who I have been arguing with for 4 days, to get some sort of refund. The place isn't bad, but no concept of customer service when things get bad. Very disappointingl", "Date": "December 19, 2008"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "2", "Overall": "4.0", "Value": "3", "Rooms": "5", "Location": "3"}, "AuthorLocation": "Glendale, Arizona", "Title": "“Lovely hotel, but.....”", "Author": "jillyaz", "ReviewID": "UR22447183", "Content": "We arrived at the Vino Bello following Mapquest Directions with no problems. We were staying at Vino Bello as part of an offer from Shell Vacation Club. Check in was a breeze and we made our way to the room. It was a one bedroom with two (double or queen) beds, we preferred a king. We called the front desk and they said they had one King room available and would send someone over to give us a new key. That took over a half hour of us sitting in the room / standing in the hallway not wanting to mess up a room that we were not going to be staying in. The King room was wonderful - I guess you'd call it a mini-suite. It had beautiful decor and a kitchenette. My only complaint about the room was that the kitchenette took the whole wall in front of the bed and the TV was off to the right. There was no dresser for clothes only some small drawers in the kitchen area. Our kitchen sink was broken, the faucet was just laying there. We didn't need to use it or we would have called. We were only staying 2 nights. Every day we had 2 complimentary bottles of water and two sodas plus a bottle of wine on the first day. That was a very nice touch. The grounds at the resort were manicured and well taken care of. The hotel lobby and dining areas were very pretty. We did not eat at the hotel. For those interested and who happen to be on the same plan with Shell Vacation Club, the presentation was smooth. It was scheduled to be 90 minutes and it was not one minute over that. We received our free gift and were on our way. Check out was also no problem. My only issue with this resort is not a complaint about the resort. My husband and I were just not in love with Napa itself. My husband and I are both near 40 and we just were bored with the Napa scene after a few winery tours. We would just stay in Frisco next time and visit Napa for our couple winery tours.", "Date": "December 4, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Business service (e.g., internet access)": "4", "Check in / front desk": "4", "Overall": "4.0", "Value": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "so. cal", "Title": "“Beautiful and Relaxing.....did not want to leave.”", "Author": "pmr3150", "ReviewID": "UR22414357", "Content": "Besides not getting the floor i had requested(I had read a few TripAdvisor reviews and had learned to request a top floor ,due to noise heard from guests above), everything was great. There were a couple times where the guests above were noisy(when moving around) . The rooms were great, they had all the things we needed from robes(not as nice as the Meritage robes) to glasses, dinnerware and even a washer and dryer. The room had a mini fridge that included a bottle of Trinitas Rose(a bit too sweet for my taste),water and soda.The decor of the room was nice and not to busy. The bed was ever so cozy, it was hard to get out of it. Overall It was a beautiful and relaxing resort and i did not want to leave. P.S. the jacuzzi Rocked!", "Date": "December 3, 2008"}, {"Ratings": {"Cleanliness": "5", "Business service (e.g., internet access)": "3", "Check in / front desk": "1", "Overall": "2.0", "Value": "1", "Rooms": "5", "Location": "2"}, "AuthorLocation": "Philadelphia", "Title": "“Not what I expected - avoid the restaurant”", "Author": "large_red", "ReviewID": "UR21996266", "Content": "From the description, I pictured a small to med. sized hotel tucked away in Napa. The Vino Bello is a building which is part of a complex in a corporate campus setting. It took ~30 minutes to check in. The service in the restaurant was awful and the food was forgettable. The rooms were very nice but you are not in a hotel building. You must walk two buildings over to get to the hotel. Not well explained.", "Date": "November 19, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "4", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Ottawa", "Title": "“Fabulous views”", "Author": "OttawaDebbie", "ReviewID": "UR21832882", "Content": "We really enjoyed the suite style of living at Vino Bello! The views from the room and patio were fabulous and the decor was luxurious. The kitchen was outstanding with the granite counters and great bathrooms! Being with another couple and sharing time in the living/kitchen area makes for very different holiday - especially in the morning over a cup of coffee and reading the daily paper.The bed was heavenly! The spa was one of the best I had been to and the hotel staff were fabulous and friendly. The wine was surprisingly good too - given it resides on the property! I would highly recommend this resort - and the location is good for exploring both valleys. A few misses - mostly small. No stereo in the rooms or suite. Parking was limited. The two bedroom suite should have doors that open to the common area - using a key all the time is annoying. The kitchen could use a few more items - small snacking plates, a non stick frying pan and foil/plastic wrap for storing food.", "Date": "November 13, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "", "Title": "“We Love the Vino Bella”", "Author": "SweetBeginnings", "ReviewID": "UR21612226", "Content": "This was our second stay at the resort and we were lucky enough to have a condo again. We only live 45 min away so it is a great quick night away from our 4 kids and 2 dogs. We went to the Browns Valley Market and picked up some sandwiches and fruit and cheese for breakfast. We watched 2 movies, soaked in the jacuzzi tub and drank beer in our robes. We can't wait until we do it again.", "Date": "November 6, 2008"}, {"Ratings": {"Service": "2", "Cleanliness": "5", "Business service (e.g., internet access)": "4", "Check in / front desk": "2", "Overall": "3.0", "Value": "3", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Crockett", "Title": "“Very nice rooms, but needs more attention to other things...”", "Author": "asmbandits", "ReviewID": "UR21488491", "Content": "Ok, first off my decision to stay at this resort was based completely on the photos of the rooms and reviews from this site. Let me just say that the rooms are very nice, just as you would hope them to be and more.. I would say that this is where it ended for me, as we pulled up we noticed cars along the road far away from the resort, after we checked in I asked about where to park and was told \"where ever you can\", we had to park about a 3 min walk away from the resort IN THE RAIN because there was NO parking anywhere in the parking lot.. we even left for dinner and came back and tryed again and still no parking.. I didnt understand this because the resort didnt seem to have many people around, just ALOT of cars.. this was VERY disappointing and happened right off the bat.. another major disappointment was that this stay was for our anniversary and I had put in the comments when I made reservations on line that I really wanted a bottle of champagne to be in the room when we arrived, I also put in there to call me if there were any problems with this request and never heard from them.. so i called a day or two before the stay to make sure this was possible and the girl I talked to assured me this was no problem and it was in the notes on the reservations.. we arrived an hour AFTER check in time and when we got to the room there was no champagne.. MAJOR disappointment especially after all the effort on my part for such a simple request.. The fire place in our room didnt work right at all, you turn it on and it stays on for about 5 min, shuts off and re lights with a loud boom ever 5 min for about 20 min then just shuts off.. from there we went to turn on the tv in the main room and found that the batteries in the remote were dead.. room service was fast and reliable but I was a little un happy when you are charged a 18% service fee on the total of the order and are expected to give a tip, so really the items you buy are about 35-40% more that listed, I dont feel that this is fare, but its just my opinion.. and after we ate we left the dishes on the counter for one night and woke to ants all over the kitchen... I really dont mean to bash this place I just thought that for the money you shouldnt have to deal with these things.. the Rooms are VERY NICE! I feel that this is there strong point, mabey thats why other things are over looked.. we were very happy with the room and the setting of the resort, I just feel like the little things were over looked..", "Date": "November 2, 2008"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Business service (e.g., internet access)": "1", "Check in / front desk": "1", "Overall": "1.0", "Value": "1", "Rooms": "1", "Location": "1"}, "AuthorLocation": "Northern California", "Title": "“DONT FALL FOR IT IT WAS HORRIBLE! TERRIBLE! DO NOT STAY HERE.”", "Author": "Justsayingitlikeitis", "ReviewID": "UR21457032", "Content": "My wife and I were unfortunate guests of The Meritage Inn/Vino Bella Resorts in Napa, CA this past weekend. We had a TERRIBLE experience, and I do not recommend this Hotel to anyone - EVER. First, we mentioned it was an anniversary weekend and had our room subsequently placed directly next to the door that is also the entry for the entire floor wing. We listened to that door slam over, and over and over again all while Napa wine tasters stood outside and drunkly reviewed their day in Napa. We called the front desk at 10:30pm and were told that nothing would be done. We called again, and were told nothing would be done, but that the door \"might\" be adjusted. It WASN't and it slammed ALL NIGHT until 2:00am! At 4:am after having JUST fell asleep the Hotel was evacuated when an alarm went off even though there were no signs of a fire. We stood in the parking lot until 5:15am when firetrucks finally arrived and still couldn't get back into our rooms! We ended up leaving, and sleeping in our car {the Hotel will tell you people re-entered their rooms by 5:30 am which is NOT true! We drove by back and forth until 6:30 am and finally just left after 2.5 hours of being stuck outside}. I contacted the hotel management, and was finally told that nothing would be done at all - period because my room had been pre-paid on Hotels.com. I was also told that I had a \"nice\" room and should have appreciated the $12.00 upgrade when I checked in. This is the WORST I have EVER been treated by a Hotel EVER. It is a time share, and takes over 20 minutes to drive to the wineries. It's in the middle of an Industrial Park and DOES NOT have ANY Napa appeal what so ever. I do not recommend this Hotel at all to anyone.", "Date": "November 1, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Check in / front desk": "4", "Overall": "4.0", "Value": "4", "Rooms": "5", "Location": "3"}, "AuthorLocation": "Orange County, CA", "Title": "“Loved It!”", "Author": "vacationjunkie030", "ReviewID": "UR20994254", "Content": "We spent 4 weekdays in early Oct. at the Vino Bella and could not have been more pleased. I was a little concerned after reading some of the posts but I had no need to worry. The check in was fast and easy. We were there for our 6 year anniversary and were estactic to find that we had been upgraded to a one bedroom suite. The kitchen was amazing with stainless steal appliances and granite counter tops. The living area was comfortable and cozy with the fireplace. The bedroom was a good size, the bed was one of the most comfortable I have ever slept in. The soaking tub was fun and romantic and the bathroom was spacious and well appointed. The hotel is in an idustrial area but it doesn't matter once you are inside the room and it is not too far from anywhere in the valley. We had an amazing couples massage at the Spa Terra. I would recommend spending some time there after a long day of wine tasting. We ordered room service and the staff was very accomodating and friendly. They brought the wrong side dish but it was corrected immdiatley. On the day we checked out there was a charge from the lobby bar that we had never gone to, I called the front desk explained and they promptly removed the charge from my account. I would have to say that the air conditioning was rather loud at night but it wasn't needed so we turned it off at night and on during the day and the room stayed nice and comfortable. We were not hounded to attend a time share presentation at all. We were in the Cabernet building and did not have a view of the inside countyard but it didn't bother us at all. The building is very protected you need to swipe your key just to get in and sometimes twice. Not sure if that is really necessary but you certainley feel safe. It was one of the most enjoyable vacations we have had. I loved everything about Napa, the Vino Bello and can't wait to return.", "Date": "October 19, 2008"}, {"Ratings": {"Service": "1", "Cleanliness": "3", "Business service (e.g., internet access)": "4", "Check in / front desk": "1", "Overall": "3.0", "Value": "2", "Rooms": "4", "Location": "2"}, "AuthorLocation": "San Francisco", "Title": "“Nice rooms, that's all”", "Author": "ConstantMotion", "ReviewID": "UR20987772", "Content": "This is a fairly new resort, part of a timeshare operation. As such you can expect newish rooms, nice furnished. This property is done in a faux-Tucscan style. The problems are many but two are the most important to those considering this as a place to stay. First, the service (front desk in particular) is disorganized and the teamwork with housekeeping completely absent. With an earlier than desired check-out time time (11am) and later than desired check-in time (4pm), you'd expect rooms to be ready when you arrive. No way and get ready to wait to see the front desk people about this (you'll need to go twice if this happens to you, too). Second, the location. This property is way out of position to the Napa Valley proper and might only be useful if you plan to spend time in both the Napa Valley and Sonoma Valley areas-a half hour minimum to each. But you can expect a comfortable room with most of what you need and most everything works that way you need it to. With better staffing, training, coordination and execution (too much to ask?) you'll only be a ways away from what you came here for.", "Date": "October 18, 2008"}, {"Ratings": {"Service": "1", "Cleanliness": "4", "Business service (e.g., internet access)": "4", "Check in / front desk": "2", "Overall": "3.0", "Value": "2", "Location": "4"}, "AuthorLocation": "Victorville", "Title": "“nice place with poor management - buyer beware”", "Author": "winesfine", "ReviewID": "UR20625180", "Content": "This was our second stay here in past 2 years. The rooms are nice,but unfortunately they do not stand behind their internet offers. Their web sight offered a $75 discount off your stay while using any of their facilities on property as long as you were staying Sunday through Thursday. We arrived on a Tuesday @ 11:30 a.m. and inquired how the discount would be applied. The counter clerk went in to ask the Manager with our printout of the offer in hand and came back and said the offer would not be applied because we booked our room on line and should have applied for it at that time. When I asked to speak to the Manager (Robert Witcher) the clerk went into his office and said hew was no longer available that he was now at lunch. This entire transaction took place from about 2 minutes from the time we arrived ,and at no time did anyone ever leave the managers office to leave for lunch. Mr. Witcher was simply too big of a whimp to come out and explain the bait and switch on his own and undoubtedly left his clerk to cover for him. A simple explanation would have sufficed but the manger could have cared less.", "Date": "October 4, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "langhorne, pa", "Title": "“Great place to stay in Napa”", "Author": "tammilip", "ReviewID": "UR20566273", "Content": "After reading various reviews of Vino Bello, we, a group of 4 couples, decided to go ahead with our reservation. The biggest drawback in the reviews was the location in an industrial park. However, once you pulled up in front of The Meritage (sister hotel) you would never know where you were. All of the staff were exceptional! The concierge helped us plan our wine tastings weeks before we arrived. The units are roomy and the bathroom was AMAZING! We went on to Pebble Beach from Napa and the bathrooms at The Lodge at Pebble Beach cannot compare to those at Vino Bello. The location is also great if you are planning to visit both Napa and Sonoma. All 8 of us would stay here again without question.", "Date": "October 2, 2008"}, {"Ratings": {"Business service (e.g., internet access)": "3", "Overall": "1.0", "Value": "1", "Service": "1", "Location": "3"}, "AuthorLocation": "California", "Title": "“Poor experience with timeshare recruitment experience”", "Author": "integrity8", "ReviewID": "UR20546225", "Content": "A very friendly salesman was somehow able to get us to sign up for a 90 minute presentation. He told us to come hungry as there would be a wonderful spread of food. We sat in the lobby for 45 minutes as others who arrived after us were escorted into the sales room before us where there was no food. Finally we were offered two $25 vouchers to walk to their restaurant Sienna and return later. I made it clear that I already had put in 45 mintutes and was assured that I would only need to return for the remaining 45 minutes. The restaurant was closed, but when we returned we were told the bar was open. We waited 30 minutes to be served a sandwich, and my order was incorrect, so I had to wait an additional 10 minutes. I highly advise that you do not drink alcohol before someone tries to sell you a timeshare. I own elsewhere and I do not recommend timeshares to anyone who is selective and spontaneous. When we returned to the sales office, we waited 5-10 minutes and then were called in. I expained that we would only remain for the additional 45 minutes to receive the gift we were promised. He said that he had to show us the full 90 minute presentation because he had to put food on the table. He walked away and returned saying: \"Here's the deal. Unless you stay for 90 more minutes or come back another time, we can only refund your deposit, but you won't get a gift...It isn't going to happen.\" It happened. We got up, walked to the front desk and after waiting 10 more minutes, we got our gift. I shall never return to this property again and I shall never be persuaded to go to another timeshare presentation. We went so we could see the property, and although there were keys on the table for potential buyers to see a room, our salesman refused to show us one. The wasted time and poor treatment is simply not worth the gift.", "Date": "October 1, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "4", "Rooms": "5", "Location": "3"}, "AuthorLocation": "carolinecorum@yahoo.com", "Title": "“Spacious and comfortable accommodations”", "Author": "ccorum", "ReviewID": "UR20328042", "Content": "I stayed here with friends for a \"girls weekend\" in Napa. This was a great option for three of us. We had a spacious one bedroom condo. Many other resorts and hotels we contacted limited occupancy to 2 to a room. The accommodations were luxurious. We had a fireplace and a full kitchen. We used the fitness facilities and I wish we had had time to hang out around the pool. We had access to the amenities of the fully staffed Meritage hotel next door. The only disadvantage was that this facility was located a bit out from town. Given all the driving one has to do in Napa, it was a non-issue. I would highly recommend this facility and hope I will have a chance to stay there again.", "Date": "September 24, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Check in / front desk": "4", "Overall": "4.0", "Value": "4", "Rooms": "5", "Location": "3"}, "AuthorLocation": "Colorado Springs, CO", "Title": "“Tuscan Oasis”", "Author": "Stacerator", "ReviewID": "UR20138987", "Content": "I stayed at the Vino Bello approximately one and a half years ago and was hesitant about returning since my experience at that time was horrible. The Resort had a lot of service related problems. However, I decided to take a chance and book a return trip to see if the service had improved. I was delighted to see more service staff on the grounds including people working the front desk, more concierges and more bellman, etc. The rooms at the Vino Bello are incredible. The rooms are one of the reason I decided to take another chance on this resort. The only down side of the resort in my opinion is the workout facilities. The workout facility at the Vino Bello needs weights and aerobic machines with individual TV's built in. When there are numerous people in the fitness room, it gets crowded and people are fighting for the TV remote. The fitness room at the sister hotel, The Meritage is OK, but needs to be larger to accomodate the number of people that work out in the mornings. We used both and we were glad to see the fitness centers busy, but both fitness rooms need improvement.", "Date": "September 17, 2008"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Business service (e.g., internet access)": "3", "Check in / front desk": "4", "Overall": "4.0", "Value": "3", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Philly Suburbs, Pennsylvania", "Title": "“Some people are just NEVER satisfied...”", "Author": "2wedinmexico07", "ReviewID": "UR20127899", "Content": "My husband and I just returned a few days ago from our trip to Healdsburg/Napa; the first \"leg\" of our tour we stayed in Healdsburg, and stayed at the Vino Bello resort for just two days on our second \"leg\". It's funny reading other reviews...there is just no satisfying some people! Our overall experience was great; we thought the room was fabulous (we had a suite)-perfect for anyone planning to stay more than a few days (full refrigerator, full kitchen, living room, laundry, etc.). The decorating was tasteful and \"homey\" and there was plenty of space to unwind. I'd say that the only room which was \"tight\" was the bedroom, but only so because of the dresser (which is VERY nice to have, as I tend to like to unpack, no matter HOW long we're staying!) took up some of the space. We took advantage of booking our stay online directly from the Shell Vacations site and received a $75 \"resort credit\" for doing so. This credit can be applied towards the spa and/or the restaurant, Siena, located in the Meritage. On the second night of our stay we decided to take advantage of the restaurant so we could use our credit. We opted to sit outside next to the really warm propane fire pit! I would agree with what some others have said about the restaurant...the food was very good, however, we waited EXTREMELY long for our meals (close to 40 minutes!). Fortunately we did each have a glass of wine to enjoy while we waited, which the restaurant/server kindly \"treated\" us to for our patience. We probably would have tried dessert, but were concerned about how long it would have taken (at that point it was close to 10:00 p.m.) I would also agree that the wine list was somewhat pricey, and frustrating that Siena was charging MORE for the same wines which they serve in their cave/tasting room! The pool was gorgeous, although we didn't find much time to enjoy it. Another disappointment was the fact that the jacuzzi was out of service during our stay (we could have walked over to the Meritage but the jacuzzi was a popular place there!), and I very much enjoy unwinding in the jacuzzi after a long day of tasting. Oh well. I also took advantage of the fitness center during our stay. Although small, it was probably adequately sized for the size of the resort. When I was there, there were 3 other people working out (they had 2 treadmills, 3 ellipticals, and 2 bicycles) and we were all very comfortable. (It did get HOT in there...not sure if we could have turned up the air or something...) I typically run outside when I'm at home, but, since the resort is located within a corporate park, it wasn't a terribly scenic place for a run. Through talking to some locals at the wineries, we understand that there are plans for many more wineries within the vicinity of Vino Bello, which would be great. We didn't mind the drive into downtown Napa, it was a very quick ride and not an inconvenience at all (we had a rental car). The noise: no complaints. Perhaps the air conditioner was a little loud when it kicked on and you were watching TV, but I'm only remembering that now since reading other reviews (i.e. it didn't bother me while we were there). The only other time we heard people moving about was in the morning as everyone was going up/downstairs and heading to that day's destinations. Again, no problem. We would stay here again, and I think it's fabulous that, upon return home from our stay, we received an email from the resort encouraging us to post our reviews. That shows me that they are reading, and value, what we all have to say. Very nice. :)", "Date": "September 16, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "4", "Overall": "5.0", "Value": "4", "Rooms": "5", "Location": "3"}, "AuthorLocation": "bay area", "Title": "“dont listen to the bad reviews... this hotel is A+”", "Author": "kris_washburn", "ReviewID": "UR19776916", "Content": "I was planning a suprise birthday getaway for my girlfriend and came to this site to check out my hotel options. I had a few other hotels in mind but after looking thru the guest photos Bello Vino really caught my eye. Even though there were a number of bad reviews I decided to book it and just hope for the best. Let me tell you, we got the best! I had planned to go on the wine train in the morning but had nothing planned for the evening and was somewhat worried. We arrived to the hotel before the 4pm check in and were told they would try to get us our room early, but we did end up waiting until the 4pm check in time, and ended up not getting the room location we had reserved. That was the only negative aspect of our stay, and in reality it didnt bother us that much, especially once we got to our room. While in the lobby everyone was very attentive and willing to help with anything. That was quite a suprise to me because compared to the other guests we were rather young (25 and 21). While we waited for our room to be ready we walked the premesis and fell in love. The pool areas at the Meritage and Bello Vino are absolutely beautiful. The hill behind the resort with the day spa and wine tasting room were incredible as well. When we opened the door to our room my girlfriend almost fell on the ground. It was beautifully furnished and had everything you could ever want, the kitchen was fully stocked with plates, bowls, utensils, pots, pans, EVERYTHING! The bed was huge and luxurious, the hot tub was the highlight, and although a little on the small side for 2 people, we still spent a few hours in it. The bathroom was massive and lavish, they didnt skimp on anything. Although I had nothing planned for that night, we realized we werent going to do anything! We sat in the room and took advantage of all the luxuries and ordered pizza! Looking back on all the bad reviews makes me want to slap those people in the face! The room was not loud, that you had to check in at the meritage wasnt a problem in the slightest... unless you are crippled or a total douche bag. No matter where you go in Napa the view really isnt that great anyways, and if you get a view facing the pool and the mini vinyard behind the resort the view is beautiful. Basically, if your looking for a hotel that will take care of you like your in an assisted living facility, this may not be the place for you... if you still have a pulse however, and can actually manage for yourself, you should love it!", "Date": "September 4, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Washington DC", "Title": "“Great place, good price, awesome service - unbelievable rooms.”", "Author": "clark15", "ReviewID": "UR19465742", "Content": "Great place to stay; very clean, great restaurant, more than one pool. Spa was in a cave and really neat. The resort is relatively close to all the wineries. The concierge is very helpful and will help find activities for you and/or the kids. They will also arrange to ship home the many bottles/cases of wine that you decide to pick up while in Napa. Overall, an amazing place. Our family will be staying there every time we travel to Napa.", "Date": "August 28, 2008"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Check in / front desk": "1", "Overall": "2.0", "Value": "1", "Rooms": "3", "Location": "2"}, "AuthorLocation": "San Francisco, CA", "Title": "“What a disappointment”", "Author": "RosieCharlie", "ReviewID": "UR19354738", "Content": "We had called ahead of time to see if we could get an early check-in since we had a concert to attend that evening in Napa. The front desk said they couldn't guarantee an early check-in but that we would be in our room no later than 4pm. We arrived at around 4pm; not only was the room not ready but the woman at the front desk said she didn't know how long it would take, and that there was nothing she could do about it. She repeatedly told us we bought our room on expedia so she had no control over the room (????) She said we could get changed in the public restroom and that she would call us when the room was ready. Needless to say, we never received a call and didn't get into our room until close to 5pm. When I actually did get my key, she asked to see my ID (after I had already given her my credit card and dealt with her for about 20 minutes). On the way to the car to retrieve our bags, we were accosted by the concierge who wanted us to attend a time share presentation. She gave us a hard sell and told us it was an \"invitation only\" presentation and if we didn't respond then, she couldn't guaranty a spot. We told her we weren't interested and she continued to pursue. At this point, we had no room, no indication of when we'd get in the room, and a woman trying to make us go to a time share presentation for a hotel we were treated badly at. This was overall an incredibly disappointing experience and I'd recommend AGAINST going to this hotel. In addition, it is in a commercial office park area and lacks the charm of Napa. This place sucks.", "Date": "August 25, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Business service (e.g., internet access)": "4", "Check in / front desk": "3", "Overall": "5.0", "Value": "3", "Rooms": "5", "Location": "2"}, "AuthorLocation": "pennsylvania", "Title": "“Elegant beautiful and immaculate, nice on site amenities.”", "Author": "serioushomecook", "ReviewID": "UR18977854", "Content": "We chose the resort based on internet photos and info, and were not disappointed. The resort is only 2 years old so everthing was beautifully maintained and sumptious. We stayed in a one bedroom suite w/ a kitchen lvg room and dining area which accomodated a family of four nicely. Our comfortable bedroom had a jacuzzi tub in it which was great for soaking w/ a bottle of wine, and the TV swiveled so we could watch TV in the TUB. I loved that. Also the balcony was nice for dining or morning coffee. The on site restaurant was excellent, although service was a little slow,but great if you wanted to relax. Also the wine I found to be a little on the expensive side. I had a massage at the beautiful and incredibly serene on site spa, even my therapist was gorgeous (wish I could mention his name)! The pool and Jacuszzi was very nice, there is one for each building, so never too crowded, and the pool towels were a nice plus. My only issue is that being new to Napa, I did no know that the vinewyards were a good 25 mins from this location, so the driving got old after a while. Next time I will stay in St. Helena, where most of the action is, and is excrutiatingly charming.", "Date": "August 15, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Dublin, California", "Title": "“Unforgettable Wedding Weekend”", "Author": "STL2SFO", "ReviewID": "UR18828075", "Content": "We booked six suites at Vino Bello Resort to accommodate family for our wedding in June 2008. We made our group reservations through the Regional Sales Manager who was extremely helpful and knowledgeable about the Napa Valley. Our special requests were accommodated, including room views, crib requirement, gift basket delivery and advance notification on our arrival date to permit early check-ins as rooms became ready. The front desk and valet staff were very friendly and efficient. Parking and room access were easy and the grounds were impeccable. The suites were gorgeous, providing a poolside balcony with a view of vineyards, fireplace, large tub, complimentary wine, etc. - everything one could want for a relaxing and memorable stay. We did not get the opportunity to enjoy, but noticed the wonderful spa, poolside grills and restaurant. The resort is also close to Napa attractions. The corporate business park in close proximity does not detract from one's stay. Our family was extremely impressed with their accommodations and threatened not to leave! We're planning to book a return stay this month to celebrate a birthday. I can't recommend Vino Bello more highly!", "Date": "August 10, 2008"}, {"Ratings": {"Service": "1", "Cleanliness": "5", "Business service (e.g., internet access)": "4", "Check in / front desk": "3", "Overall": "2.0", "Value": "1", "Rooms": "4", "Location": "2"}, "AuthorLocation": "Tubaman543", "Title": "“Poor construction and bad service”", "Author": "Tubaman543", "ReviewID": "UR18400665", "Content": "We went to the Vino Bello for a timeshare presentation, which was bad enough by itself. I am trying not to let the memory of the presentation doesn't taint my review of the hotel... First, the good: The bed was excellent. It was extremely comfortable, and quite soft; a good way to relax. The hot tub/pool area was also quite nice. I enjoyed the size of the tub, as well as the fact that there were BBQ grills for guests to use. Now for the not so good: The location of the resort is pretty bad, looking out over a corporate office park instead of vines and valley like many other Napa Resorts that cost the same amount per night. Also, the overall construction of the hotel was pretty low. The walls and ceilings were quite thin, allowing nose from rooms around you to leak in quite easily. We unfortunately happened to get put in a room right next to a family with young children who didn't like to sleep...not good. When we called the front desk to switch, they were not amenable to the request, saying that they were totally full and then hanging up on us. After that, the rest of our customer service experience was pretty poor. When we called to have some missing items brought to our room, it took them 25 minutes and 2 further calls to bring them to us. The concierge was very inattentive, paying more attention to the older guests, as we were one of the youngest couples there. Finally, the same was true of the wait staff at the bar and the restaurant. Both times, our waiter forgot about us more than once. We just felt like we were being overlooked. I am glad that I did not pay the $350+ per night that would be normal without the presentation package. If I had been paying that much, I would have been even more upset, because at those prices, you expect 5 star service.", "Date": "July 29, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Check in / front desk": "4", "Overall": "4.0", "Value": "5", "Rooms": "5", "Location": "3"}, "AuthorLocation": "Phoenix, Arizona", "Title": "“You gotta stay in the One Bedroom Condo!!”", "Author": "kprecious", "ReviewID": "UR18366669", "Content": "I brought my husband here for a few days of relaxation. He didnt even drink wine before coming to Napa but he does now!! We stayed in a One Bedroom and whike I was hesitant to spend the extra money after reading some past reviews, it was well worth it. We spent hours sitting on the balcony drinking our wine and enjoying the time and atmosphere. The room looked just like the pictures on the website. The jacuzzi tub in the room....well lets say that was the best part of the week! Yes, you can hear alittle noise from the neighbors, but I rarely stay in a hotel where you dont. The Spa is magnificent!! Service was also as we would have expected. I am looking forward to a girls weekend here soon!", "Date": "July 29, 2008"}, {"Ratings": {"Service": "2", "Cleanliness": "4", "Business service (e.g., internet access)": "3", "Check in / front desk": "4", "Overall": "3.0", "Value": "3", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Chattanooga", "Title": "“Nice Resort, Service Not So Nice”", "Author": "Meme29", "ReviewID": "UR18052591", "Content": "Bello is beautiful, but room service is not as grand as the resort. When I first arrived, I called room service to have something delivered to me. Room service never came. I actually had to find a maid out in the hall, cleaning rooms, that could assist me. The second day we were there, I ordered room service at 8:15, room service said it would be 25 to 30 min. before it would arrive, we had a wine tour leaving at ten. I thought that we would have plenty of time to eat breakfast. I had to call and cancel our breakfast at 9:45. Room service did not show nor did they call to say the order would be late. However, the conc. did take care of us. I would recomend this resort for a place to sleep while in Napa, but for service, I would advise going somewhere else.", "Date": "July 19, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "2", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "San Francisco, California", "Title": "“Lovely Napa Retreat!”", "Author": "jojolina", "ReviewID": "UR17950203", "Content": "My husband and I spent our 1st anniversary at the Vino Bella this past week. It was lovely. The amenities are top notch. We stayed in the \"studio\" which had a king bed, sofa and small table for two. What is fantastic is that it also has a kitchen sink, cabinets full of all the things you might need like ceramic dishes, wine glasses, cups, silverware, etc. It also has a microwave and toaster oven and fridge. All of this came in SO handy and you don't have to do the dishes! The maid service takes care of all of that. The fridge comes stocked with a bottle of white wine, two bottles of water and a few cans of soda. These are all included in your price of the resort and not extra charges, so enjoy. The bed was soft. It was called a king, but to me it seemed smaller than that. I think someone much over 6' tall might find it a bit short. The pillows could have been softer. The airconditioner woked quite well, but it was rather loud. The second night, we opened the sliding door and closed the screen on the slider. it created a great sleeping temp in the room (with no noise from the AC). The linens on the bed were quality with a light down comforter. The bathroom was very nice with an oversized oval tub. The tub is a bit high though. Anyone with hip problems or guests that are elderly might find it very difficult to get in and out of the tub/shower. There are two pools available, one at the vino bella and another at the sister resort next door, the Meritage. They are both very nice pools, but i liked the one at the meritage better. It was a little more \"resorty\". The one at the Vino Bella has 2 nice BBQs though, so really you can't go wrong with either one. The pools close at 10pm because they are right outside the guest rooms. each night staff had to run off stragglers though. :) My husband and i also had spa treatments at the Terra Spa. What luxury! it was fabulous, however definitely pricey. The couples tub soak was the most romantic experience i have ever had in my life.....gorgeous room with a two person raised jacuzzi tub surrounded with decorative tile....lit only with candlelight. Bubbles in the tub, aromatherapy, cool towels for your face if you get too hot in the water, champagne and chocolate truffles. Just WOW! I will always remember that. We also met some other couples in the spa that were very nice. they were there on their anniversary. the only thing i cant recommend here is the restaurant. they have to do something to improve the food. it's not that it's terrible...it's just not that good. the receipes aren't that good. it doesn't taste awlful...but it doesn't taste fabulous either. If the resort would fix this, it would be so much better. However, there are many restaurants in the area that are wonderful, so don't despair. We went to the Rutherford Grill in Rutherford that is a favorite among many and of course it was GREAT. Terrific food and terrific service! We did have a snafu at check in, but this was corrected. There was a female registration attendant that wasn't very friendly, but thankfully her curtness was lessened when we began to experience the other joys of Vino Bella.", "Date": "July 16, 2008"}, {"Ratings": {"Service": "1", "Cleanliness": "2", "Check in / front desk": "2", "Overall": "1.0", "Value": "1", "Rooms": "1", "Location": "1"}, "AuthorLocation": "Roseville, CA", "Title": "“Don't stay here - Definitely not a Four Star hotel!”", "Author": "traveler222_8", "ReviewID": "UR17698839", "Content": "This is the first time that I have written a review. Beware of this hotel!! We purchased this one night Four Star hotel room on Priceline. It was my first time using Priceline, but I thought that a Four star would be safe. We paid $270 for one night hotel in Napa on Priceline and the room rate is $249 without Priceline and tax. Furthermore, the hotel is located on the Other Side of the Bridge, far away from everything. Upon obtaining the name of the hotel I went to their website and was informed that the hotel is under construction. I am taking this up with Priceline, since they should not refer people to hotels with construction without FIRST informing them. I called three times to the hotel and they could not find my reservation. They finally called me at 6pm on the arrival day and told me that they found it. I was told over the telephone that I could bring my 13 year old daughter to the spa. We went early that morning and I was told that no children are allowed. The air conditioning in the room was like an airplane taking off every 10 minutes. This occurred all night long!!. We were able to hear the loud family upstairs until 1am and again in the morning. They had a child who ran back and forth throwing himself/herself on the floor. Big Booms. The maintenance at this hotel is horrible; the bathroom vent is clogged with dust hanging from it. We even had the room service man listen to the A/c and he jumped back when the a/c made the noise while he was delivering the breakfast. I contacted the Asst. Manager in the morning and asked him to come to witness the situation; however, he told me that he would speak to the Manager during the week about giving me a night stay in the future. I called and left messages for him for 2 weeks and got no response. I spoke to another Manager who told me that he would check into it and get back to me, but never did. I finally called the general manager and was told that these issues do not warrant an offer other than crediting me for $19 room service charge! He said that they can't do anything about the noise from other rooms and they might have had a repair man come to the room to service the air conditioning in the middle of the night. This is a hotel room, can you imagine a repairman working on your air conditioning unit in your room while you are in your PJ's in the middle of the night and having all of the dust from opening the unit on top of your Bed!! I told him that being in the Residential Property Management Business that I am aware that most places do not even have maintenance personnel on duty during the night and only respond to sprinkler and fire emergencies. My husband does this work and I am a property Manager. The Gen Mgr. agreed to this statement, but didn't comment as to why his Assistant Manager didn’t even come to the room in the morning to review the a/c situation and the noise from the other room. I paid almost $300 for a 4 Star Hotel in a horrible location and this is what they offer. After researching this hotel, I see that this hotel is all over San Francisco as a Time Share Offer. Get 2 nights at VINO BELLA for a cheap rate to view their timeshare. I have been to numerous four star hotels across this country and this is the WORST and management does nothing about your complaint. After being persistent the Gen Mgr offered me a $75 discount to come back during a week night. My rate would be $150 plus tax to spend another night at a resort??? offering horrible customer service, horrible accommodations and has severe maintenance issues. You can stay at the FAIRMONT hotel in Napa for another $50 and be at a RESORT with Great Services and Great Management OR any other four star hotel which will be more than worth the money. I will never again stay at Vino Bello (See other bad reviews of this hotel/resort online! OR the Meritage hotel their next door sister hotel (also has some bad reviews- same management) I am a member of the Preferred Hotel Group and will be forwarding the same comments to them, even though the Gen Mgr told me that their Preferred Status is only for Meritage and not Vino Bello. PS Meritage and Vino Bello both cost about the same price, so Vino Bello is just a time share Lure. BE WARNED!!!", "Date": "July 9, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "2"}, "AuthorLocation": "UESGG", "Title": "“LOVED Vino Bello”", "Author": "UESGG", "ReviewID": "UR17492468", "Content": "BEST stay, ever! We had a whirlwind trip to Napa but it was great... Given our accommodations at Vino Bello, I wish we knew more people in the area because we had so much space - we could have had a dinner party if we had wanted! While I did not get to explore the grounds or the spa, the absolute best part of the trip was the amazing concierge service leading up to - and during - our trip. I had no idea where to start, in terms of planning tours, etc. but the staff was so friendly and helpful and definitely helped make our trip amazing!", "Date": "July 3, 2008"}, {"Ratings": {"Service": "1", "Cleanliness": "5", "Business service (e.g., internet access)": "4", "Check in / front desk": "1", "Overall": "1.0", "Value": "1", "Rooms": "1", "Location": "2"}, "AuthorLocation": "San Francisco, CA", "Title": "“Do you love getting rest and relaxation?”", "Author": "howardhsu", "ReviewID": "UR17351187", "Content": "Then this place isn't for you. On the other hand, if you're a fan of high pressured timeshare sales and noise-passive walls then boy are you in for a treat! The Vino Bello rooms were designed poorly with large empty foyers between rooms. Each time your neighbor comes or goes, you hear the echoing boom of two doors shutting. The walls are so paper-thin that you hear the footsteps above and the bedroom olympics from the room adjacent to yours (and vice-versa). Even though the property lists within the city limits of Napa, it's actually 3 miles south of Downtown Napa in a business park. There is nothing romantic or Napa-esque about the location. In fact, you're actually between American Canyon and Napa Proper. Their concierge is actually their first point of attack for their timeshare sales. The 90 minute presentation quickly became 180... one no-pressure sales person became three high-pressure sales people. In hindsight, I'd forego the $100 wine dollars and keep my 3 hours of time. They also tell you that you'll get free wine tastings from a list of wineries. Many of them didn't even recognize the voucher. My last complaint is an unauthorized \"resort fee\" charge on my credit card. I booked with Priceline and it was supposed to be all inclusive. The resort manager, Robert, later admitted it was an issue that was supposed to be worked out between Vino Bello and Priceline (but had failed to do so when I was a guest). He made no attempt to credit the charge. In fact, upon check-in and check-out there was no mention of this charge. Talk about being sneaky... and this coming from a supposed 4 star resort?! The $30 charge wouldn't be as big of a deal if they were up front about it, but they weren't. It was their fault in not clarifying who would be responsible for the charges with Priceline. They shouldn't hold their guests accountable for their contract negotiation shortcomings. On the plus side, it is a new resort. It is very clean and the common area for The Meritage Resort (their sister property) is very inviting. The rooms are large and the kitchenettes are well-stocked with many dining amenities. The furniture in the rooms are sturdy and quite comfortable. There's also a washer and dryer in each room which is a nice bonus. If you're able to get the room for ~$150 to $200 on Priceline and are a heavy sleeper, then I say go for it. Otherwise, I'd pay a little more and stay at another property. As for the timeshare presentation, I personally wouldn't recommend it. The food served was lousy and worse, they just would not relent.", "Date": "June 29, 2008"}, {"Ratings": {"Service": "2", "Cleanliness": "2", "Business service (e.g., internet access)": "2", "Check in / front desk": "2", "Overall": "2.0", "Value": "2", "Rooms": "3", "Location": "2"}, "AuthorLocation": "DALLAS", "Title": "“Business resort, not romantic at all.”", "Author": "MK4601", "ReviewID": "UR17091711", "Content": "This hotel is on the southern edge of Napa. The hotel is pretty but right in the middle of a business district. If you are looking for a romantic setting this is not it. We booked our reservation through the Hotels website and they had no record of our reservation. Once we printed off the receipt they booked us in a room and told us it had a poolside view. We went to the room and it was a view of the parking lot. I called and they said they could put us in a poolside room but it wouldn't be ready for 2 hours. We opted to do this and ended up in a room that was on the same side of the hotel as the pool but only had a view of the other side of the parking lot. Our building smelt really fishy. The hotel did weird things like run their sprinkler system at 10:00pm. We would walk over to the bar to have a drink and would have to dodge the sprinkler systems on the way back. If you want to go for a late night swim or jacuzzi forget it, they close at 10:00pm. The hotel bartenders need to brush up on their mixing skills as well. This hotel is right next to and affilated with the Meritage Resort. They pressure you to attend one of their time share sales presentations.", "Date": "June 20, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "4", "Overall": "4.0", "Value": "4", "Rooms": "5", "Location": "3"}, "AuthorLocation": "sincity", "Title": "“great resort”", "Author": "mike9152", "ReviewID": "UR16977060", "Content": "vino bello is a beautiful new resort located in a business park. I was a little concerned when i realised this was a time share i have had a bad experience at another time share but not here! the room was super clean & comfortable down comforters & pillow top beds. The room was a little narrow but overall very nice. we had a third floor room that looked over the pool. the staff was very friendly & helpful. I was a little concerned after reading some of the other reviews but was very satisfied overall.", "Date": "June 16, 2008"}, {"Ratings": {"Service": "2", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "1", "Overall": "4.0", "Value": "3", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Orange County, CA", "Title": "“Nice resort, service needs help”", "Author": "OCtravelers7", "ReviewID": "UR16974599", "Content": "Check in & check out was very easy, we got a great room, 3rd floor view of the pool. Room looked exactly as it does on-line. Location is the very south end of Napa, a bit of a drive, but that is OK. We were very happy with the accomodations, except for the lack of hot water. It took a long time for the running water to heat up, Ok for the shower (such a waste of water though, esp considering the drought in California), but made it very challenging to wash dishes (we had the condo with the full kitchen). Housekeeping was great, room was very clean every day and they ran the dishwasher for us when we were gone. The place was very well stocked. We were very satisfied with the accomodations. We were very disappointed in the service on 2 occassions. 1st, we were expecting an overnight UPS package, we notified the Front Desk twice to let them know to expect it. Per their own policy, it should be delivered to our room w/in 1/2 hr of their receipt. At the time of our 2nd call, the resort had already signed for the package (we didn't know at the time). At the end of the day, when we returned to our room, no package. We called and told them it had been signed for (looked it up ourselves on the UPS website). They then discovered that the sales office signed for it, didn't notify anyone of its arrival and it is sitting on someone's desk and we have to wait until morning to get it. I thought this was unacceptable and that they didn't even try to remedy the situation. Long story short, I went personally to the front desk, told them about my disappointment, apparently, they did have the key and they were able to access the package and we got it that night. I don't think a guest should have to walk down there to ask this as they obviously didn't even try the first time. Someone paid good money to have a package overnighted to a guest (the package was clearly addressed with our guest room #) and someone just decides to let it sit and not deliver it?? 2nd issue, we called the concierge to find out where the nearest urgent care or emergency room was, we thought we were going to need it for our son. We ended up just leaving our vacation a day early instead to go to our local doctor, but we never heard back from ANYONE regarding our question. If a guest is asking about an emergency room, don't you think someone should return that call? Even if it isn't until the next day just to see if there is anything they could do to help. Their lack of effort was REALLY disappointing to us.", "Date": "June 16, 2008"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Check in / front desk": "3", "Overall": "1.0", "Value": "1", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Chicago, IL", "Title": "“Terrible Service”", "Author": "Tawplr", "ReviewID": "UR14774624", "Content": "Nice rooms and resort. However terrible service! Room service messed up several orders and even had to call three times to an order delived. Not to mention how poorly the room were cleaned.", "Date": "April 3, 2008"}, {"Ratings": {"Check in / front desk": "2", "Overall": "3.0", "Value": "3"}, "AuthorLocation": "San Francisco, California", "Title": "“Nice, but be prepared to be moved to the Meritage”", "Author": "urbancocoa", "ReviewID": "UR14350605", "Content": "My husband and I booked a king suite directly from Vino Bello (VB) online. VB is under the same ownership and in the same area at the Meritage Hotel and check-in is done at the Meritage. When we arrived we found that all the rooms at VB were booked and the only room they had left was at Meritage and had 2 double beds . I was annoyed because this was our anniversary and the room wasn’t what we had reserved online (we didn't just put in a request for a king suite, we made an actual reservation for that specific type of room). After a lot of arguing they gave us a discount on the room as well as free breakfast one morning. See my review of Meritage for more info on our stay there. I would say only book at VB if the room type (layout, number of beds) is not important to you. A large family in town for a family reunion was checking in at the same time as us. They had specifically booked rooms at VB because they wanted kitchenettes for cooking and needed sofa beds for the kids. Like us, Meritage said that all rooms at VB were booked and needed to put them at Meritage, but Meritage was a disaster for their situation and number of guests; fitting everyone into the Meritage space was really problematic for them. They had called several times prior to arrival to make sure that they had suites at VB and still didn’t get what they had reserved. Afterwards I also found out that my cousin had come to VB for a bachelorette party and only one of the two rooms they had reserved was available when they arrived. Meritage is nice, but be forewarned that a reservation at VB doesn’t guarantee you a room there.", "Date": "March 17, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Bay area, CA", "Title": "“New, nice and great spa nearby.”", "Author": "mbuns", "ReviewID": "UR14212750", "Content": "We stayed only one night as a girlfriend get away. The room was new and just what we wanted, two very comfy beds, nice built in with frig, sink, micro, toaster oven and all utensils. Bathroom was very nice, again pretty sink area and oversize tub. Small seating area with cafe table plus a flat screen TV with premium channels. Balcony had nice chairs and overlooked The Meritage Resort. Check in was at Meritage which has very nice decor and pleasant staff. We used the Meritage pool area which was very nice, clean, plenty of towels. The two hotels are on the same property and you can move easily between them. Only reason I would not give a 5 star rating is the food. We had room service breakfast which was okay as was the pool side cobb salads. Nothing to write home about. We had facials and messages at the Spa Terra and it was beautiful!!!!! Very nice facilities,staff and all in a cave setting! Very fun.", "Date": "March 11, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "4", "Overall": "4.0", "Value": "5", "Rooms": "5", "Location": "3"}, "AuthorLocation": "south florida", "Title": "“Very Classy”", "Author": "kost44", "ReviewID": "UR13993401", "Content": "First off, I would never have picked this place under normal circumstances b/c it is so expensive. However, we booked this the night before we got there on priceline. We ended up getting it for $85 before taxes and their \"resort fee\". The resort fee covers the cost of the bottle of wine they put in the room, soda, and water. We were only there 1 night but helped ourselves to all the water, soda, and wine, so it seemed fair for the 20 dollars. The room was very nice. How we got this one for $85 surprised me, but hey - we took it! This wasn't a suite, but it also wasn't a standard room. It had a nice deep tub, mini fridge, microwave, sink, toaster oven, balcony, washer, dryer, and VERY comfortable king bed. They also had a dvd library which we took advantage of. The decor was traditional tuscanny style and was very tasteful. The concierge was very helpful, as was the front desk. The concierge showed us stuff to do and gave us some great info/savings brochures. The grounds were nice. I took advantage of the 24 hour work out room. The pools were heated and there were bbq's outside of each building. Our room had dishes and utensils, so it seems like a great stay for a family in one of the jr. suites or suites. I would recommend using the BBQ if staying for a while just to save some money. The restaurant was expensive but not THAT bad (we were at a resort, afterall). It was our first time trying Kobe Beef - and it was DELICIOUS!! I think we paid $28 for the steak (that was a la carte - no side dishes) The pizza was enough for 2 people and only cost 12 bucks. I'm used to spending 60 bucks at a holiday inn and getting the usual crap bed and cardboard towels. To stay here for $120 after all was said and done was amazing! I probably wouldn't recommend this place if you were to book at full rate, (just cause I'm cheap) but if you get this place discounted, it's totally worth it. It was a nice little splurge for my husband and I. The vineyard around the hotel is nice, and you definitely feel safe. I think we had to use our room key 3 times before actually getting to our room door. The only complaint I have is the bartender at The Cave. It is the little bar where you can go wine tasting. She ignored us from the get go. I'm not sure if she could tell we didn't belong there or what, but she only came by to give us our wine and our check. She was more than happy to converse with the other patrons - about the beach, directions, night life, wine, friends, clothes, etc...but with us, it was like we were lepers. That didn't make us enjoy our wine tasting experience very much. (b/c while she was yapping, our glasses were empty). I'm sure at least the others liked their experience better ;) The location is definitely not as nice as some, it is smack in the middle of a business complex, but the amenities on the property more than made up for the location. If I could get this room for the same price again, I would probably stay here next time. But if I could get a quaint B&B for the same price I would probably do that instead, just because I think it would ft the whole Napa Valley Feel that I was looking for a little better. And I would take their wine tasting tour instead of vising their bartender in the Cave. I think the tour included 4 wineries, with the shuttle from the resort and back again for an all day outing about $75. Maybe next time!", "Date": "March 2, 2008"}, {"Ratings": {"Service": "1", "Cleanliness": "4", "Business service (e.g., internet access)": "2", "Check in / front desk": "2", "Overall": "2.0", "Value": "2", "Rooms": "2", "Location": "2"}, "AuthorLocation": "Washington, DC", "Title": "“Not a Bad Choice, Not a Great Choice”", "Author": "ww_kayaker", "ReviewID": "UR13380859", "Content": "We booked a weekend stay at this Resort as it was labled a \"4-Star Resort\" and we were able to get a very attractive rate (for a 4-Star Resort) through Hotwire. We were aware of the additional approx. $20 resort fee as well. The Vino Bello Resort is a nice place to stay, but I would certainly not call it 4-Star. Our room: On the plus side, it did have a refirgerator; wet bar; and included bottled water, soda, and a bottle of wine. On the negative side, it was pretty narrow and not that big, the heating system was VERY loud (when it turned on it would wake us up). Further, the walls are VERY thin, as we were woken up by a neighbor's TV early one morning, and could hear a late-night conversation of another neighbor. Also, the Vino Bello rooms are an outside walk away from the main Meritage Resort area (which presumably are more expensive). Amenities: We did not find the Concierge or front-desk very helpful (even for some simple direction advice). The attached restaurant has a very good breakfast. The workout facilities were OK and the wine-tasting appetiers are really just cheese and crackers. There was also a billing mix-up that has yet to be resolved -- but I don't know it that is the hotel's fault or hotwire's fault. Location: The resort is located in a corporate/industrial area, not very close to any vinyards. So the views aren't that wonderful; however, you can get to the Silverado Trail and Napa proper pretty easily (much quicker than if your staying in Carneros or Sonoma). Overall, we probably wouldn't stay here again. They claim it's a 4-star. The price we paid was about what you'd pay for a 3-star (or 3.5). And we felt it was actually a 3-star (or 2.5). It was an OK experience, but not up to the quality that they appear to represent.", "Date": "February 8, 2008"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Check in / front desk": "3", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "2"}, "AuthorLocation": "La Conner, Washington", "Title": "“Very comfy for 2 couples”", "Author": "shesails", "ReviewID": "UR13360007", "Content": "We stayed at this Shell Vacations timeshare type property off a discount we saw in the newspaper. We had a one bedroom and an adjoining studio. It was perfect for 2 couples. The $15/day resort fee was ok, but we didn't use most of it. The wine in the rooms was very drinkable and it was nice having 2 bottles of water to take on our travels through the valley each day. We were happy to use the free shuttle to dinner on our second night. A short hop into to town. The concierge was most helpful with the reservations. We had dinner at the resort restaurant the first night. My advice, skip it, you can do much better and cheaper elsewhere. Two of us had the seafood risotto and it wasn't just not tasty, but tasted bad with a gruel-in-a-bowl presentation. One of us thought the scallops was good. Cost: $144 w/one bottle of wine. The only complaint about the lodging was the lack of insulation in the ceiling. We had a 2nd floor unit and the upstairs sounds of walking and the bathtub draining were amazingly loud. We though a pipe must have burst in the wall. Try to get a top floor unit. Otherwise, the place looked pretty much like the pics others have posted.", "Date": "February 7, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Check in / front desk": "4", "Overall": "5.0", "Value": "4", "Rooms": "5", "Location": "3"}, "AuthorLocation": "Chapel Hill, North Carolina", "Title": "“Very Nice Suite”", "Author": "Buno", "ReviewID": "UR11677006", "Content": "My wife and I stayed at the Vino Bello on the advice of a colleague, who was organizing a function in Napa. We got a special rate for a junior suite for about $140, before tax. The rooms were huge, and very nicely furnished. The living room had a nice TV, sofa, gas fireplace, and a good-sized kitchen. The bedroom had very comfortable linens/pillows, and a nice jacuzzi in the bedroom itself. The bathroom was spacious, although we didn't care for the toiletries provided. The location of the hotel is in a corporate park south of town. While the vineyards nearby have only recently been planted, they should grow into a nice scene in 4-5 years or so. The architecture of the hotel itself is nice, with columns, big wood fireplace in the lobby, and nice Christmas decorations. The hotel does have a complimentary shuttle to take you into town. There is a mandatory resort fee which pretty much covers the 'free' bottle of wine and 'free' shuttle.", "Date": "December 18, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "4", "Overall": "4.0", "Value": "4", "Rooms": "5", "Location": "2"}, "AuthorLocation": "california", "Title": "“great place if you don't mind a drive”", "Author": "lea99", "ReviewID": "UR10271381", "Content": "Being from San Francisco, we have been to a lot of hotels and inns in the napa valley area and I definitely have my favorites. Some friends booked the Vino Bello resort online and we were planning on staying with them. I was at first skeptical due to the fact that I had never heard of it but they said it was a 4 star hotel so I thought we were safe. I will say that the location stinks....it is not in a quaint, charming or picturesque part of the valley and is a 15 minute drive to yountville and surrounded by a corporate business park. However, if you do not mind that or the short drive and you want a really nice room complete with full kitchen, dining area, patio, separate bedroom, bathroom with huge shower and jacuzzi tub, this place is great. The facilities are all incredibly clean and almost feel polished. The people were all friendly and any requests were met on time. This is a great place to spend the day at the wineries and maybe have a nice lunch out and then return with your bottles of wine and have a relaxing evening eating and/or even cooking a great meal. The gas fireplace provided a ton of heat and would be wonderful in the winter. Again, this is not; the ideal location in the valley like the Harvest Inn, but for the money, it is a nice alternative for a luxurious stay.", "Date": "October 23, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "4", "Overall": "5.0", "Rooms": "5", "Location": "4"}, "AuthorLocation": "fort lauderdale", "Title": "“If you can't stay at Carneros Inn, this is a great alternative”", "Author": "Julzieluv", "ReviewID": "UR10082729", "Content": "We loved the place. It was as if we lived there. I would purchase one of these as a second home but not a timeshare. The room was perfect and brand new. It had all the accessories from home and I was kind of surprised of the quality. It wasn't cheap. Wine glasses were very nice, the towels were thick and soft, and there was even soap for washing clothes. It was home and at night, we went to the bar at the meritage. I am so hard to please and I normally stay at Carneros Inn but at 800 a night, I felt it was the best deal to stay here for only 239 a night. Great value, clean, fresh, and fun.", "Date": "October 15, 2007"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "3", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "St. John's, Canada", "Title": "“Great value and would stay here again!”", "Author": "mdz", "ReviewID": "UR10037699", "Content": "We were so impressed with this time share property. We stayed there for only a few days, and booked it on a daily rate. It is a newly built property linked to an already existing hotel and spa. The one bedroom suite was huge. The kitchen was larger that what we have at home. There was a lovely outdoor terrace with dining table. Huge dining area and living area inside. The bedroom was very large as was the bathroom. A really quiet hotel. Lots of privacy. The hotel restaurant was decent and room service was super quick. We cooked most of our meals in the superbly outfitted kitchen. Great choice for us travelling with a toddler. And the price was phenomenal for everything it included. The check in was slow...but not a problem. We arrived really early and just went shopping to kill time. The pool areas were inviting although the weather was too chilly for us to use them. Would definitely stay here again. Great base for exploring Napa Valley and surrounding areas.", "Date": "October 4, 2007"}, {"Ratings": {"Service": "2", "Cleanliness": "5", "Check in / front desk": "2", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "3"}, "AuthorLocation": "", "Title": "“Napa/San Fran Anniversary trip included Vino Bello and we're glad it did!”", "Author": "Larry-Pattie", "ReviewID": "UR8719157", "Content": "These gorgeous condos/timeshares are part of the Meritage Hotel & are an exceptional value if you want more than a hotel room. Perfect if you are exploring Napa and surrounding area because after a long day of wine tasting, its nice to relax in a beautifully appointed, fully equiped new 'apartment suite. If youre like us, it was nice to relax in an 'at home' setting - fireplace, balcony, gorgeous kitchen -after a wonderful day @ the wineries. The 24 hr room service was prompt and very good. Spa was gorgeous (and expensive). Some reviewers mention highway proximity as an issue but we found it convenient (this property in a 'corporate park' but still very nice. Therefore, higher level floors and pool view might be best.) Check your room folder for specials that are not apparent. For example, we later discovered we could have added services to our massages for no charge but did not know (nor were told). DVDs & CDs are available @ the front desk but we only learned that from these reviews, not the hotel. The drawback here (altho experienced travelers will navigate these issues) is that the staff is woefully undertrained or seems in some instances, simply untrained in hospitality. Nice and willing, but totally clueless. This was generally the case and most especially at the valet stand where the young man greated us with 'huh?' when we pulled up and asked whether we should park or leave the car w/him. Maybe it was because he was chewing his lunch loudly. He never asked if we were with the hotel or condo and consequently, we removed our own luggage - he took the car. We needed to retrieve the car which could not be located (10 minutes later), redeposit our luggage and drive back over to the condo section. A bit annoying after a long,east coast flight and drive up from San Fran. On the way up, we stopped for lunch @ Horizons in Sausilito (wonderful) and then a little detour thru Muir Woods - nice to see but not much there if youre not awed by nature. (Trees are over 1000 years old!). As for Napa, do stop for breakfast @ Sarafornia on Lincoln Ave in Calistoga for excellent, home made inexpensive fare. We were unimpressed by Rutherford Grille for lunch/dinner tho everyone seems to recommend it - expensive, very limited wine list and smelled like kenny rogers roasters restaurant. St. Helena Olive Oil Company was a treat to break up the wine tastings (altho the pesto we purchased was confiscated @ the airport because we did not pack it in our checked luggage.) You can taste everything in the store thats for sale. There are hundreds of wineries and you should sample several but we found the 'touristy' ones just fine for first time visitors. (check out many wine country internet coupon specials for wine tastings, etc.) We especially liked Sterling (for the tram ride) and Mondavi (for the tour and grounds) and our favorite was Domaine Carneros where on a lovely terrace - my husband sipped pinot noirs while i tasted the sparkling wines. Don Giovanis (napa?) looked very good for dinner but after a second long winery day - we were again just as happy to have room service instead and watch a movie on one of the two flat screens in the condo. We left on the third day back to San Fran. Check out both Franciscan's on the wharf which even tho in the center of touristville- was excellent for crab and had great decor/views...and Vincentos (on Taylor?) in financial district for dinner. We also had a great time on Adventure Cats sunset bay sail. Great crew! Ecclectic, culturally mixed crowd of passengers made a fun/interesting 1.5 hrs. w/beautiful photo ops. Lunch @ Left at Albequerqe on Union in Pacific Heights was a wonderful surprise find - outstanding, inexpensive fresh food w/cafe seating. Note to non-Californians - signage is awful - we got 'lost' several times - especially around Napa, but it was always either a pretty coast road or winding mountain road so not a totally bad thing!", "Date": "September 15, 2007"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "", "Title": "“Absolutely Outstanding.”", "Author": "bdvorachek", "ReviewID": "UR8716532", "Content": "We are just finishing our stay at the Vino Bello resort. It was perfect for our all girl Napa Trip. We took a day trip to San Fransisco which was an easy 1 hour drive in. We spent two days touring wineries. You could easily spend a week doing that alone. We highly recommed the wine at the Van Hey Den winery. The resort was absolutely beautiful with a fully stocked kitchen, flat screen tvs and a view of the pool. The pool was heated and warm for those chilly nights. We were thrilled with our stay and could easily recommed this place again. I plan on traveling back again and will try to book another condo here. Thanks for the memories.", "Date": "September 14, 2007"}, {"Ratings": {"Service": "2", "Cleanliness": "5", "Business service (e.g., internet access)": "4", "Check in / front desk": "2", "Overall": "1.0", "Value": "1", "Rooms": "2", "Location": "1"}, "AuthorLocation": "Topanga, CA", "Title": "“don't do it, unless you're interested in a time-share.”", "Author": "SteevOTopanga_CA", "ReviewID": "UR8702630", "Content": "Well, where to start? I guess with my arrival, to find that this \"resort\" was in an office park was my first surprise. Second, the lobby was under construction, there was plastic hanging from the ceiling, saw buzzing, hammers banging. Third, the front desk staff seemed well dressed, but unskilled. She didn't know where in the complex my room was, (or she was embarrassed of the room she had assigned.) Next, after being shoved off from the front desk to the \"concierge,\" to get a local area map when the \"concierge\" lady finally stopped talking to her friend or co-worker, she immediately when into her routine of trying to bribe me into submitting to a sales pitch to buy into the time-share. After telling her I was only there for a couple of days and didn't care to spend my vacation time listening to a sales pitch, I was treated rudely. I had to get her attention again to ask for a local map, and was told to look in the local magazine. Fifth, upon entering my room it was small but well appointed. I opened the curtains on the patio to see the back of the time-share sales office. Temporary office trailers, with big loud air conditioning units, what a view! Of course I called the front desk to see if they had a better room available, luckily they did, no offers to have a bellman move us, just a come switch out your keys (the office is at least a football field away from the condos.) Our new room had a view of the pool, which was better, but when sitting on our patio we got to hear the sales pitch over and over again, as the sales team herded prospective buyers through the complex. Our next experience with Vino Bello is one of an overall design flaw, noise. The paths and walkways around the complex are concrete, and brick. Since the Vino Bello are not in close proximity with the restaurant, and other utilities used to service there guests, the staff has to push hard wheeled carts around on these paths, \" KA-CLUNCK....KA-CLUNCK....KA-CLUNCK, dat,dat,dat,dat,dat,dat,dat,KA-CLUNCK....KA-CLUNK. You get the picture right. These noises started around 7 am, right when you feel like getting up, after wine tasting the day before. Overall, I would not stay here again. Mainly, because of the time-share deal, and the ignorance of the designer's choices in either the materials used to make the pathways or the choice of having the staff use the same walkways as patrons to service the rooms. These are two factors that will be hard to overcome, and make this establishment a far cry from a 4 star hotel.", "Date": "September 12, 2007"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Check in / front desk": "4", "Overall": "5.0", "Value": "4", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Newcastle, England", "Title": "“Fabulous resort”", "Author": "janetb555", "ReviewID": "UR8668291", "Content": "Had a few reservations about this location based on previous reviews. There was no need to worry as we loved this resort and thought the facilities were excellent. Check in was fine and we were allocated a suite overlooking the pool area. The reception staff were very friendly and we were pleased with the overall check in. We found the one bedroom suite met our every need and was of a very high quality, the minimal amount of noise from other rooms and the air conditioning was not a problem. We would definately stay again and would not hesitate in recommending this property.", "Date": "September 7, 2007"}, {"Ratings": {"Service": "2", "Cleanliness": "5", "Business service (e.g., internet access)": "4", "Check in / front desk": "3", "Overall": "3.0", "Value": "4", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Hilo, Hawaii", "Title": "“Good but room for improvement”", "Author": "kcooper229", "ReviewID": "UR8547753", "Content": "Bottom line - I thought the Vino Bello was a good value and a beautiful property. The amenities were very nice and the location was convenient. The spa was outstanding. The restaurant and food was great. That said, there were some issues I would not have expected from a resort of this apparent caliber. Most of the complaints are minor (noisy A/C, weird design with \"echo-chamber\" - like entry), but I guess I was most disappointed with the front desk staff who did not seem to be at all concerned with customer satisfaction. Our key cards stopped working at one point (as did the couple we were traveling with), and although the desk staff fixed them and explained that they tend to become demagnatized (or something), he was not very courteous about it. Desk staff also seemed unconcerned when I reported that the washing machine was apparently in need of service as it seemed like there were loose parts, resulting in sounding like a jackhammer. Furthermore, the couple traveling with us had reserved a one bedroom and were given a studio. When they addressed this with the desk staff, they were rude and dismissive and said they would need to take it up with Hotels.com. All of these are things that happen, but a simple, \"I'm so sorry for the inconvenience - let me see what I can do...\" goes a long way in my book.", "Date": "August 30, 2007"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Business service (e.g., internet access)": "4", "Check in / front desk": "2", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "3"}, "AuthorLocation": "New York City, New York", "Title": "“Wine, sun, wine and wine in Napa Valley”", "Author": "Carlito106ohYeah", "ReviewID": "UR8375980", "Content": "Whats up. So me and the lovely wife went to the Vino Bello (Meritage) Resort in Napa Valley this June for 5 days for our 2 year anniv. Had a super great time. First off..The Resort: The Good-Rooms are really big (all with balconies, some with bedroom hot tubs...not mine. Also, I recomend requesting a room with a pool view, not parking lot view..like mine), LCD TVs, 2 nice pools with heated jacuzzis, great Cave wine Bar/Spa (built into the ground, under newly planted grape fields), good price, within 5 miles of downtown Napa. The Bad-The doors close loudly, service aint that great, and its in a corporate park 10-15 miles from the main strip of vineyards (in fact, you really should rent a car for this trip). We did the hot air ballon thing with napa valley ballons...was fn terrific! (ran over a rabbit on the way...ugh, it still haunts me...I mean, it wasnt even dawn yet, it was still way dark, I tried to swerve, he had no chance). The napa valley train was not worth it...too expensive, too slow, boring (rent a car, drive to a bunch of vineyards and get private tastings, and you will have a much better time). Go to the tastings during the week if at all possible (to avoid crazy SF weekend crowds) and talk to the wine pourer...they know a lot of sh*t, love to talk about wine and can point out their favorite vineyards...being wine novices, we learned a lot, quickly. If you don't know what tannen is before napa you will after. A few places we especially dug: Mondavi, Fransiscan, Arrowhead, Chandon (champagne). Hope the pics came out ok. Have a great day!! Thanks for reading. Cheers.", "Date": "August 8, 2007"}, {"Ratings": {"Service": "1", "Cleanliness": "5", "Check in / front desk": "1", "Overall": "1.0", "Value": "1", "Rooms": "5", "Location": "2"}, "AuthorLocation": "Aventura, Florida", "Title": "“Awful customer service, rooms ok”", "Author": "sy123", "ReviewID": "UR8362681", "Content": "I don't usually write scathing reviews concerning hotel stays, but when your stay is worse than your overall impression based on price and location, there's reason for complaint. Bad experiences: - unfriendly, unconcerned attitude from front desk people (probably due to a lack of training on the part of the management, but common sense would be to make the customer believe you are actually interested in helping them instead of being indifferent). No professionalism, whatsover. - no offer for compensation after we complained about not being able to sleep the first night with the air conditioning not being able to turn off. The front desk responded that there was no way to help us since the service personnel was not available at the time. The front desk did not make a note of the problem so it could be fixed, instead we had to complain the next day. - a lack of communication between front desk and service personnel. (Having to visit the front desk twice, at 10 am and 5 pm to check on service to a malfunctioning air conditioning system that wasn't even begun until we requested the manager at 5 pm to take care of this, is unacceptable for a hotel). Their response was to shut off the air conditioning unit completely without letting us know what was happening. Is the customer supposed to perform investigations to find out what's going? I don't think so. The hotel should be notifying any guest about updates when something is wrong with their room. The next night the room was stuffy, and we had to sleep with the sliding door cracked open. This place seems to not care about investing in good training for any of the people who work here ( I can not speak for the restaurant or bar since I didn't experience them). They give the impression that they are only concerned in selling their time share condos. It would serve them well to change this impression if they want any repeat stays from anyone. I would never suggest this place to any of my friends or family. it's best to stay somewhere else that has a better location (not near a highway, power lines, and a satellite station, their website photos are misleading), better customer service, and better price/value.", "Date": "August 6, 2007"}, {"Ratings": {"Service": "1", "Cleanliness": "4", "Check in / front desk": "1", "Overall": "1.0", "Value": "1", "Rooms": "3", "Location": "1"}, "AuthorLocation": "Miami, Florida", "Title": "“Not Good”", "Author": "emis", "ReviewID": "UR8361862", "Content": "Positive :new clean rooms, nice pool area. Negative: we had 3 rooms only one had working A/C. The A/C was not fixed during our stay of 3 nights. The one room with the A/C had a plastic cup to collect the condensation placed on the washing machine and the water dripping sound was real chineese tortue. Our complains were addressed by telling us that there is nobody to fix this and later they went to buy the part etc. Also we should contact hotels.com since that where we did our reservation. Front desk had nice but very inexperienced and untrained staff. The hotel is located next to / part of an office/industrial park on one side, highway and satelite dish farm on the other so this is not a very romantic location. Parking space is also an issue and many cars are parked outside of the property. Sound proofing is minimal, you can hear somebody walking above your room, so if you go take the top floor. In conclusion if we had paid $70 a night it would be ok. We spent around $3,000.00 for our stay, you will be the judge if it was worthed and if we should come back.", "Date": "August 6, 2007"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Business service (e.g., internet access)": "4", "Check in / front desk": "3", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "3"}, "AuthorLocation": "New York City, New York", "Title": "“The reviews are dead-on”", "Author": "Trapuh", "ReviewID": "UR8256006", "Content": "I read all of the reviews before booking my stay and although I was concerned about some of the complaints I felt that the rate I found (under $200/night for a \"studio\") was too good to pass up. While I found many of the complaints to be valid I do not feel that they are egregious enough to prevent me from giving this resort a positive review. I will address each of the complaints individually. 1. The resort is in an office park. This is true, however, one would not know you were in an office park while on the premises. While on resort grounds you cannot see any office buildings nor experience any office traffic; you only know you're in an office park by using one of the two street entrances to the resort. I stayed Monday through Friday and did not have any office park experience while there. 2. The resort is close to a highway. This also is true; the resort is nestled in the \"crotch\" of two main roads. However, while you can see the road from the parking lot you are not close enough to hear any traffic from the roads or let the existence of the road detract from the otherwise fine view of the fields. 3. The room keys stop working. Absolutely. On the third day our key cards mysteriously stopped working. Although I was on the lookout for this potential problem I neglected to tell my girlfriend who was greatly inconvenienced. She was carrying packages to our room (while I was stumbling around the wine cave) and she had to go to the main hotel building (The Meritage) in order to get new keys made. A bellhop blamed the inexperience of the front desk staff but I think there is a greater problem here since this is a complaint many of the reviewers had. 4. You can hear doors slamming. Dead on. This is perhaps the biggest complaint I have about this resort. While we did not hear noises from other rooms (voices, tv, sounds of intimacy, etc.) we constantly heard doors closing. This was very irritating - especially at night. 5. Inexperienced staff. I am unsure about this one. Although one staff member said it about other staff members (as I discussed above) I cannot definitively state that the staff is inexperienced. The only example of incompetence (not necessarily inexperience) was that after we ordered room service (one sandwich) they forgot we ever ordered it. When we called to see where the sandwich was they confessed and then delivered the sandwich promptly - and gratis. 6. Dearth of close parking. This is also true. One night we had to park on the other end of the resort as all of the spots immediately adjacent to the resort buildings were taken. As we are relatively young and healthy this did not pose much of a problem for us; just an inconvenience. 7. The resort is far from the city center and wineries. This is true. However, it's not like you walk from one attraction to another in Napa - you have to drive . Since you're driving anyway, an extra 3-5 minutes in the car won't kill you. 8. The concierge will try to sell you a timeshare. True. After speaking with the concierge for 10 minutes she invited us to a Shell Vacations pitch meeting with the enticement of coupons, etc. However, a quick \"no, thank you\" ended her endeavor. Interestingly, while at a SF Giants game a table of gentlemen from Shell Vacations offered us similar enticements - and even added a few free nights at the Vino Bello - if I were to go to their pitch. I'll add a few last complaints before I address the virtues. The housekeeping staff is overly eager. The housekeepers try to access the room starting at 9AM and then keep coming back every 20-30 minutes either knocking first or just trying to enter with their keys. After this happened the first morning we made sure to hang the \"do not disturb\" sign on the door until we left the room in the morning. However, one morning when we decided to sleep in very late (it happens when you do many wine tastings the day before without availing yourself of the spit bucket) the sign did not dissuade the staff who repeatedly knocked on our door from early morning until we left in the early afternoon. The housekeepers lost out on a nice tip because of this. One last complaint is about checkout time. The reservation I made stated that checkout time was noon. The hotel literature in the room stated it was noon. A sign in the room said it was 11AM. On the morning of checkout I was told by the front desk that it was 11AM; although they graciously gave me a \"late\" checkout at 11:45AM. Reminding them that their own literature gave the time at noon did not give me that extra 15 minutes. Since I am a rebel I checked out at 11:50. Now on to the good points. The rooms are very nice - nice bed and pillows, large bathroom, tub/shower easily accommodated my 6'3\" frame, washer/dryer in every room and the rooms are just nicely appointed. Although I was hoping to get a free upgrade to a one bedroom suite (as did another reviewer) an Acura management outing that took up a large part of the resort seemed to put the kibosh on my hopes of getting a bigger room. The studio was fine - not huge but big enough - but it irked me that we were missing out on a jacuzzi tub in the bathroom. Oh well. When you check in there are free bottles of water, cans of soda and a bottle of white wine in the refrigerator. It was not until the last day that I realized that they replace the water and soda on a daily basis - I was stupidly buying my own bottled water and soft drinks when I could have had them for free all along. I am unsure if they replace the bottle of wine because I never drank it; but I doubt they do. The outdoor pool and hot tub are fine. The spa is just as expensive as any other hotel - so I didn't try it. The wine cave was nothing more than a bar - nothing fascinating there. The bartender was nice and told me that they expect the vines on the premises to start being productive in a few years. Meanwhile they serve wine from their house brand whose grapes come from other parts of California. Overall, my experience at the Vino Bello resort was fine. It is not a resort that is a destination in and of itself but it is a perfectly nice place to lay your head and go for a quick dip when on a trip visiting wineries. If you can book this place in the area of $200/night you should not pass it up. I predict that in the future it will command much more per night.", "Date": "July 30, 2007"}, {"Ratings": {"Overall": "3.0"}, "AuthorLocation": "Orleans, France", "Title": "“Great hotel, bad restaurant”", "Author": "ZorglubWaterloo", "ReviewID": "UR8229825", "Content": "The resort is excellent. Very nice buildings, rooms are brand new and with very nice decoration, including bathroom. We have a studio, it was very big. Swimming pool is excellent, especially for kids, they have some nice games there. Location is not that bad as many reviews say. OK it is behind the highway, but not that close, we were not disturbed by any noise or proximity. The black point is the restaurant, we had 3 breakfasts there, you need to wait for 30 minutes to get 2 pieces of toast and milk for our boy. We complained about that, but nothing from the staff excepted some excuse. I even asked if we had to go to the grocery store to buy the milk for my son's cereals after waiting 20 minutes. Overall, I highly recommand to go sleep there, but bring your own breakfast and food!", "Date": "July 24, 2007"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Check in / front desk": "2", "Overall": "3.0", "Value": "4", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Southern California", "Title": "“Beautiful Condo, So-So Food”", "Author": "luckylyn555", "ReviewID": "UR8183993", "Content": "My husband and I just got back from spending 5 nights at Vino Bello in Napa for our 1st annversary. Vino Bello is part of a timeshare plan, but they also rent the condos (studios, one-bedrooms, and two-bedrooms) on a nightly busy (which is what we did). Good Points: The condo itself. We stayed in a one-bedroom condo on the second floor. Very nice, spacious, new place. Full-sized kitchen with granite countertops, stainless appliances, dishes/glasses/pans, etc. Large bath with granite countertop, double sinks, large walk-in shower with tumbled marble/stone tile work on two walls and floor, seamless glass on remaining two walls, 5 showerheads (one large rain head and four pulsating bodysprays). Jacuzzi bath tub in stone surround in bedroom (actually in kind of a dressing alcove in bedroom, between room and bathroom). 37\" flat screen TV in living room and 26\" flatscreen TV in bedroom. Large balcony with table and 4 chairs, plus small settee (we lucked out and got a second floor room overlooking the balcony - recommend 2nd floor over 3rd floor as 3rd floor balconies don't have a roof, and the sun can get pretty hot! Bad Points: As mentioned in other reviews, service is definitely a problem. Checked in at 2:30 pm (check in time is 4:00 pm), told room would be expedited and we would be called on cell phone - finally went back to desk at 5:15 pm as never got a call. Turns out room had been ready since 3 pm but the lone front desk agent was too busy to call. Food at Siena was just OK for lunch but highly disappointing for dinner. Because we travelled on our anniversary, I decided that we would be too tired to leave the resort for dinner. Since the dinner menu at Sienna looked good on the website, I booked a table through Open Table, indicating it was our first wedding anniversary. When we arrived at Siena for dinner, it was practically deserted. There was no acknowledgement of our anniversary (no congratulations, offer of dessert or whatever). We were disappointed to find that, rather than the menu posted on the resort's website, we were given the same menu as we were given earlier that day for lunch (while waiting for the room to be ready). My husband's food was just OK while my rotisserie chicken was terrible - very dry - and the tiramisu was also not good. We didn't go back at all the rest of the stay. On third day, key cards didn't work - had to walk to front desk for new ones. On fourth day, I got locked out of room after going to the vending machine (again, key card didn't work) and there was no way to reach my husband (each set of two rooms has a little foyer with a locked foyer door to the hall - no doorbell from hall and no way for my husband to hear me knocking on the foyer door). I wandered throughout the building looking for a house phone to call my husband, but there aren't any. Just as I was about to give up and walk back to the front desk (in another building across the parking lot, at the Meritage Hotel), I tried knocking at the foyer door and luckily my husband had just stepped into the foyer in preparation for looking for me - I had been gone about 20 minutes on what should have been a 5 minute vending machine visit. All in all, I would definitely stay there again - the condo was lovely (though perhaps they overdid the wine decor slightly) and spacious, and the rates were extremely reasonable for Napa. However, I would not eat in Siena again, and we will be checking our key cards constantly to make sure they are continuing to work!", "Date": "July 18, 2007"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Business service (e.g., internet access)": "3", "Check in / front desk": "3", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "San Leandro", "Title": "“Family Delight with pampering for the wives”", "Author": "tangster", "ReviewID": "UR8139176", "Content": "My family spent two nights, beginning on July 4 with my bother and his family. This is our second stay here; the first being in Dec. 2006. We absolutely love this luxurious hotel and the one bedroom suite. The suite with its full kitchen and high end finishes, ample sized bathroom, luxuriously appointed bedroom, comfortable living room, and porch overlooking the pool area is perfect for our family of five. Having experienced the colder climate of Napa in December and our recent stay during July 4th, our family fully enjoyed the swimming pool, kiddies’ pool, kid’s water play area, and BBQ this time around a lot more. While the kids played at the pool, the wives were able to enjoy a pampered experience at the newly opened Terra Spa (built into the hillside as a cave). We never ate at the restaurant located at the hotel because the wonderful kitchen allowed us to prepare our meals and presented a more comfortable experience for our kids. The best part is the large dining table and cushioned bench to accommodate our family, along with al fresco dining option on the patio. Another great feature about the property is the vestibule off the main hallway door that connected the studio that my brother and his family stayed in. It allowed us to prop our respective doors open for free ingress and egress. For the minus on this stay, since we had to utilize the AC this time around (as opposed to in Dec.) it was definitely on the loud side. It makes it a little hard to sleep when it kicks on at night. Also, not sure if they were short staff due to the holiday or not, but there was trash overflowing at the BBQ area for over a day before I had to take my time to call housekeeping to come pick it up. In addition, the housekeeping service was very late in coming to clean our suite. When they did come around 5 PM, we were already back to our room and with my entire family in there, the housekeeping staff was a little disoriented and not able to clean as normal when the room is unoccupied. Other small things, the washer and dryer are not the most user friendly, even with the abbreviated instructions posted on the units. No express check out from your room. Overall our family really enjoys this place and as a local weekend getaway. Even though it's a relatively quick 50 minute drive from our home and in the middle of a business park, you feel like you’re truly at a resort and on vacation.", "Date": "July 17, 2007"}, {"Ratings": {"Service": "1", "Cleanliness": "3", "Business service (e.g., internet access)": "3", "Check in / front desk": "1", "Overall": "1.0", "Value": "1", "Rooms": "4", "Location": "1"}, "AuthorLocation": "Chicago", "Title": "“Worst Service in Napa”", "Author": "UsuallyHappyChicago", "ReviewID": "UR8108857", "Content": "Rooms are not bad, but forget about having any good service. After checking in at noon with our 2 yr old, we were told the room was not ready and they would expedite the room and call me on my cell. At 4:05 I checked back with the front desk and was told the room was ready. They told me to go to the wrong building and when we finally found the room the keys did not work. The concierge could see me through the glass door but was not willing to get off her chair to let me in the building. We asked to speak with the general manager (Steve Arnold) and was told he was on his was to my room. After an hour I called back to speak with the general manager and was told by the acting manager (Robert Wichter) that he was not on-site and nobody knew when to expect him. I will never stay at this hotel again. Unless you want to be pissed off, don't stay here either.", "Date": "July 12, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "3"}, "AuthorLocation": "Minneapolis", "Title": "“Great Stay!”", "Author": "sourgreengrapes", "ReviewID": "UR8106676", "Content": "I did a ton of research on hotels before booking Vino for my Napa trip 7 months ago. I got an incredible deal on the room. If you don't mind the location, you won't be diappointed. Rooms were very clean, spacious, and well decorated. Love it. If we are in Napa again, we would go back!", "Date": "July 12, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "1", "Overall": "4.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Soouth Pasadena", "Title": "“Great place to stay”", "Author": "beryl_greene", "ReviewID": "UR7830418", "Content": "Very nice condo like hotel. Rooms have every conceivable amenity even washing machines and dryers. Well maintained - and they even give you free wine (not really needed here) and sodas in your room. Very spacious units with a tub in the bedroom. My only complaint was the front staff person - we didn't realize that the resort was on a road too new too be listed on our GPS - so we called for directions. Not only could she not give them but she connected us to a recorded message telling us to leave our room number and the concierge would call us back - then when we finally got there she told us that the restaurant was open until 10:00 or later when in fact it closed before 9:00 - fortunately the place has surprisingly good 24 hour room service!", "Date": "June 10, 2007"}], "HotelInfo": {"Name": "Vino Bello Resort", "HotelURL": "/ShowUserReviews-g32766-d622921-Reviews-Vino_Bello_Resort-Napa_Napa_Valley_California.html", "Price": "$222 - $394*", "Address": "<address><span rel=\"v:address\"><span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">865 Bordeaux Way</span>, <span class=\"locality\"><span property=\"v:locality\">Napa</span>, <span property=\"v:region\">CA</span> <span property=\"v:postal-code\">94558</span></span> </span></span></address>", "HotelID": "2516163", "ImgURL": "http://media-cdn.tripadvisor.com/media/ProviderThumbnails/dirs/0e/9f/0e9f6ed27a360d81ea374ce200469f1b6large.jpg"}}