{"Reviews": [{"Ratings": {"Overall": "5.0"}, "AuthorLocation": "east greenwich, rhode island", "Title": "“Another great timeshare vacation”", "Author": "dermgoddess", "ReviewID": "UR129145841", "Content": "This trip was only for 4 days to celebrate a birthday. The amenities and condo are consistently wonderful. The location is ideal for day trips or a short flight to the grand canyon. My only criticism is the overpriced, mediocre food served at the poolside grille. In fact, the \"fast-food\" chain restaurants in the nearby mall are better quality and more variety. Overall, beautiful new property, with nice pools and golf. The best feature is the ability to use the neighboring JWMarriott property.", "Date": "April 30, 2012"}, {"Ratings": {"Sleep Quality": "4", "Overall": "4.0", "Value": "4", "Service": "5"}, "AuthorLocation": "Columbus", "Title": "“Great place to stay”", "Author": "mego1216", "ReviewID": "UR128935947", "Content": "Canyon Villas is very typical of other Marriott Vacation Clubs locations; great service, atmosphere and amenities. This particular one is better than most because it includes access to the JW Marriott across the street (great pools, lazy river and spa). My two complaints are the shuttle, which was unreliable (anywhere from leaving 3 minutes early to 20 minutes late) and lack of non feather duvets (sleeping with a thin blanket isn't what I expect from the Marriott). If they can fix these issues, will earn my title of best Marriott Vacation Club ever!", "Date": "April 27, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Yarmouth, Maine", "Title": "“excellent property and service”", "Author": "BonVoyage555", "ReviewID": "UR128620506", "Content": "We are owners here and elsewhere...we like this property the best...wonderful ambiance. excellent service. Management is available and on top of things. we go here very year for a month in the spring and again for 10 days in October. Will continue to do so.", "Date": "April 25, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Stuck in MA", "Title": "“Brand spanking new.”", "Author": "BixUS", "ReviewID": "UR128495015", "Content": "Top notch condos - Clean well furnished. Has full kitchen / washer / dryers - it's for time share owners after all. There were multiple pool areas plus a bocce court. Handy shop to purchase small items since stores are a bit far away. Free shuttle to the main Desert Ridge hotel where there are great pools.", "Date": "April 24, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "San Diego, California", "Title": "“Another Quality Marriott Timeshare Resort”", "Author": "sceneisle", "ReviewID": "UR127612246", "Content": "The Marriott Canyon Villas is located about 21 miles from Phoenix Sky Harbor Airport and minutes away from Scottsdale and downtown Phoenix. The resort features studio, one and two bedroom units, plenty of amenities & activities, many nearby restaurants, priviledged access to the amenities of the neighboring J.W. Marriott resort, free parking and complimentary in-room wireless internet. Ours was a three generation family vacation. Our two-bedroom, air-conditioned villa (2901 & 2902) was made up of a one bedroom unit with an adjoining studio unit. We arrived at 1:30 p.m. and were given access to the studio side only, as the one bedroom unit was still being readied. Full access did not come until after 4:30 p.m.. The studio was size of an average hotel room and was furnished with a king size bed and a pull-out sofa and table in the sitting area. The kitchenette included a small refrigerator, microwave oven, small sink, coffee maker, toaster and was furnished with dinnerware for two persons. The one-bedroom unit was nicely furnished and included a washer/dryer, full kitchen with oven, all basic appliances, cookware and dinnerware for six persons. There were two minor maintenance issues (no signal on one of the televisions and an unworkable safe); both of which were resolved within 15 minutes of our phone call. The resort offers two types of maid service: a \"full clean\" and a \"tidy clean.\" There is a charge for both services if you are staying on a timeshare ownership or exchange. One \"tidy clean\" service is included if you are paying a nightly rate. This was the first Marriott timeshare resort we have stayed at that did not include at least one mid-week \"tidy clean\" service for timeshare owners/exchangers. Resort amenities at the M.C.V. include serveral swimming pools, including a lap and chilren's pool, spas, fitness center, steam rooms, pool tables, children's playground, barbeque grills, fire pits, mini-market, restaurant (bar & grill) and activities desk (scheduled activities for all ages occur throughout the day). Amenities at the neighboring J.W. Marriott include golf (two courses) several restaurants & lounge, nature & preserve trails, tennis courts, and four acres of waterways including swimming pools, whirlpools and a \"lazy river\". It should be noted that access to the J.W. Marriott pools may be restricted for M.C.V. guests if the occupancy rate on the \"J.W.\" side is at or near capacity. A free shuttle bus operates between the two resorts on a regular schedule. The M.C.V. is just a short drive away from numerous restaurants, a large grocery store (Albertson's is less than a mile away; Costco is about five miles away), movie theater and cultural landmarks. The Desert Ridge Market Place (less than two miles) is a premier shopping, dining and entertainment destination. We thoroughly enjoyed our stay at the M.C.V. and highly recommend the resort for families and couples alike. Disclaimer: We are multiple week, Marriott timeshare owners (Shadow Ridge - Palm Desert, CA and Maui Ocean Club - Maui, HI) and have stayed at eight different Marriott timeshare properties.", "Date": "April 10, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Orland Park, Illinois", "Title": "“Another Fine Marriott”", "Author": "cmrtraveler", "ReviewID": "UR127410922", "Content": "We are owners in Orlando and decided to try Arizona for the first time. Our friends own at this location and suggested it for us. We were not disappointed at all! As usual, Marriott always shines as a leader in resort property. We did arrive early that day (check in at 4:00 p.m.) but they took our cell phone # and we went across the street to the J.W. Marriott property so our son could enjoy the lazy river. Our room was ready promptly at 4:00 p.m. Check-in was a breeze as usual - very friendly staff and concierge has lots of information on local happenings. We were in a studio which we felt was rather small compared to other studios we've stayed in but nonetheless very impressive: sink, microwave and min-fridge. Enough to store pop, chips, lunch meat, bread etc for breakfast and lunch meals. We went out for dinner each night at the nearby Desert Ridge Shopping area. The resort was beautiful - pool area spectacular and clean. We spent a few relaxing days at the pool and our 11 year old son made some great friends while there! Food at the pool was pretty good and priced right. Drinks were wonderful as well. The location of the resort was close to the highways and best of all was the Desert Ridge shopping area just a few blocks away: Albertsons (grocery), Target, Kohls, Old Navy, AMC Movie Theatre just to name a few. Restaurants galore: Mimi's Cafe, Wolfley's, Rock Bottom, California Pizza Kitchen, In & Out Burger, Dave & Buster's...too many to mention. Nice place to take the family at night to walk around-beautiful outdoor setting with food/ice cream shops. Live entertainment on Friday nights. Be sure to use the coupon book Marriott gives you - discounts at many local restaurants.", "Date": "April 7, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Queen Creek, Arizona", "Title": "“Spacious 1-bedroom suite that accommodates family of 6”", "Author": "Brad H", "ReviewID": "UR127073340", "Content": "This was my second stay in 4 months. In addition to the pools on location, Marriott gives you access to the JW Desert Ridge pools and lazy river as it has a free shuttle every hour. Great value through the selling of inventory time share weeks.", "Date": "April 1, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Michigan", "Title": "“Fabulous Place -- loved it!”", "Author": "Margie R.", "ReviewID": "UR126992432", "Content": "As a Marriott timeshare owner (Monarch on Hilton Head Island, S.C.), I didn't think we'd be disappointed at Canyon Villas. And I was right -- we loved it. The villas are spacious, well laid out and very clean when we arrived. I'm not sure there's a \"bad\" villa location since the complex is well kept all over and not as large as some we have visited. It just depends on what is important to you -- golf course view, right by the pool, quiet area, etc. It's any easy walk from most any villa to any one of the pools. Main pool area with waterfall, by the way, is very nice! Plenty of chairs/towels, with even quite a few chairs in the shade for those that aren't \"sunworshipers\". Plenty to do even around the perimeter of the pool (foosball, table tennis, snack bar, etc.) if you get tired of sunbathing or swimming. Staff was excellent -- very friendly and helpful. Shuttle left every half hour to the main JW Marriott hotel that is adjacent to Canyon Villas. You have full access to the hotel and facilities staying at the Canyon Villas. And what a beautiful place it is. Many pools, lazy river, restaurants, entertainment, etc. Back to the shuttle, it leaves every hour for the shopping center/restaurants, movie theater -- about a 4-minute ride from the Villas. So if you didn't plan on doing a lot of sightseeing in the Phoenix area and just want to relax, you could get by without a car by using the shuttle or sign up for one of the many tours the Villa offers. Also, the golf course is right there with shuttle service to that also. Several mornings complimentary \"get togethers\" are offered in the Main Reception area, e.g., coffee/doughnuts one morning to acquaint you with the area/tours; cereal breakfast another; fruit another; salsa tasting in the p.m., etc. All in all, a delightful place to stay with lots to see and do -- or do nothing but look at the beautiful scenery and enjoy the complex. What a great stay -- no complaints whatsoever. Going back next year!", "Date": "March 30, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "4.0", "Value": "4", "Sleep Quality": "3", "Rooms": "4", "Location": "5"}, "AuthorLocation": "West Bloomfield, Michigan", "Title": "“Golf Paradise and Baseball - send your wife to the mall”", "Author": "D_Bondman", "ReviewID": "UR125863675", "Content": "mother-in-law were more comfortable. Only buildings 2300 and 2400 have non-lockoff 2br units. Two big groups of guests were the baseball fans in town for Spring training and the golfers here to tee it up in advance of the golf season up North. Look at http://www.cactusleague.com/ for more baseball information. Look at golfnow.com for course information and discount tee times. The Vacation Club resort was built in phases from 2004-2008 and units are still pretty new and at the higher Marriott standard of this recent period. The main pool is very nice, as a large fake rock formation which provides some shade seating, privacy, and a waterfall. There is a small shack for drinks and food; expect to pay too steep hotel prices for the convenience. But hey, if you care about your budget, buy some 12 packs of pop (beer?) at CVS and some plastic cups. Behind the rock formation is a small private waterfall and sun-bathing area and a hot-tub. This would definitely be the topless area of a European resort, but this ain't Europe. There are two other water areas. One is a two foot deep wading pool called Lizard Lagoon and the other is a small 4 foot deep almost hot-tub pool for soaking and talking. Temp is kept around 90-95 degrees. This is probably Sweeeet in February when the outside temp is 45-60 degrees. A new lounging courtyard has been installed between buildings 2400-2500-2600 and is my favorite place at the resort. Five seating areas are under large sun-sails which provide a filtered shade. There are also two seating areas around fire pits. The courtyard is home to shuffleboard courts, a herb garden, and a stretch of lawn used for Yoga and exercise every morning. You get full access to the pool, lazy river, restaurants, and spa at the JW Marriott next door. This is a big plus. The Wildfire Golf Club has two courses by Palmer and Faldo. The LPGA has a new tour stop here and the play next week and will play 18 holes using the back nine of both courses. It is a 6-7 minute walk or you could take the shuttle or drive. The Desert Ridge Marketplace has around 15 restaurants, 30 stores, CVS, Albertsons, a Bank os America and Starbucks. We seemed to be at the Paradise Bakery and Einstein Bagel a lot. I walked both ways to get breakfast in the morning. The shuttle will take you and pick up up. Albertson's and CVS is a must see because the Marriott Marketplace is the smallest I ever saw and prices are always better at a real store. Unit selection tips: Consider your favorite activities and the temperature/sun direction. The units by the pool are very convenient to the lobby, fitness center, etc. I like the courtyard and the shade. The East facing villas have a golf course view and morning sun. The South facing villas sound like a bad idea after April when temps are 100+. Building 2900 South facing units watch the traffic on the entrance road and the lobby parking lot. If you have not spent time in Phoenix, pay special attention to temperatures and clothing layers. Mornings are very cool in February and March. We had some days around 60 degrees and some days in the 80's. The air is very dry and we had a lot of allergy problems from dust and spring pollens. (Spring here is the end of February) This review is only for the second week of my stay. The first week had several housekeeping and maintenance issues.", "Date": "March 9, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Corrales, New Mexico", "Title": "“Beautiful and relaxing”", "Author": "2go4world", "ReviewID": "UR125148739", "Content": "We stayed at the Marriott Canyon Villas February 9 through February 13, 2012. This Marriott property is absolutely beautiful. Although it seems to be in the middle of a very busy city, it is an oasis. The grounds are immaculate and appear to be trimmed with nail scissors. The little bunnies on the green lawns in early morning and early evening were so peaceful. Our room/condo was, as usual with Marriott, spotless and welcoming. We couldn't have asked for anything nicer! Just down the street was a large shopping area with lots of great restaurants and shops, many new to us. It was fun investigating them! And north of the villas is Cave Creek which was a delightful afternoon of walking and exploring. The temperature in February was perfect - about 65 degrees with lots of sun. Brian, the concierge, although new was very helpful. Always cheerful, as all the staff was, and looking out for our interests. Great stay!! Will definitely come again and again!", "Date": "February 24, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Grosse Ile, MI", "Title": "“Fabulous”", "Author": "Loves_snorkeling_7", "ReviewID": "UR124269463", "Content": "We checked in yesterday and spent today exploring Canyon Villas and the JW Marriott next door. Staff at both are very friendly and helpful. Ate at the Marriott and were able to charge it to our room at the Villas. Several pools, hot tubs, and restaurants are available with a free shuttle between the two resorts that runs every half hour. My husband and I have a one bedroom suite with kitchen - lots of room and two televisions. Great place for long walks. We don't want to leave!", "Date": "February 7, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Peabody, Massachusetts", "Title": "“Great stay”", "Author": "luv2travel01960", "ReviewID": "UR123962210", "Content": "My extended family and I visited Canyon Villas and we had a great time. There were 12 of us and we had two 2 bedroom units. The units are beautiful. They have everything you need if you want to save money on meals. The pools are gorgeous. The property is well maintained. The staff is great.", "Date": "February 1, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Ciudad de México, México", "Title": "“Shame JW is so close”", "Author": "Darthy", "ReviewID": "UR122833721", "Content": "We are a family of four and Marriott Vacation owners at Grande Vista - Orlando, FL., That is why we interchange very often with other Marriott properties. In this case, I was disappointed because the property does not have tennis courts or even a better pool. (By the way, the week of 12/11/11, when we arrived, the pool was closed). The JW is very close but you need to walk or drive. I rather like to have all these in the same place. It's a shame.", "Date": "January 9, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "3.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Los Angeles, California", "Title": "“Need a better pool”", "Author": "BettyKR", "ReviewID": "UR122286776", "Content": "This Marriott vacation villa has a deal with the JW Marriott on the same property. Guests here can use the amenities over THERE. That's the problem. It's over THERE. The towels have the same color so you don't feel like a lowly cousin. However, we had to carry all our stuff over THERE and cut the stay short to come back and get lunch. THEY have the lazy river and the slide. We have a couple of small pools and according to my son, the largest jacuzzi with a waterfall that he's ever seen. The two properties combined is quite nice. But it is a trek to get to the lazy river.", "Date": "December 30, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Michigan", "Title": "“Excellent overall quality, although some service issues were lacking”", "Author": "TigerAL", "ReviewID": "UR122152564", "Content": "This was my 3rd visit to the Marriott Canyon Villas near Desert Ridge, staying each time as time-share exchangers or on a promotional package. Overall, I like the facility, although some amenities and service issues could be better. Main pool area is nice and has a variety of sitting areas, although depending on where you stay in the resort getting there means either you have to cross multiple parking lots or simply walk along paths, which of course is more preferrable. A nice \"quiet pool\" lies on the far edge of the property; it's a smaller area and is more of an expanded, free-form spa than a pool; no deep end, not enough room to swim but larger than the typical round hot tub. It was much more relaxing there than at the main pool where it can tend to get crowded and noisy. Regarding technology, their WiFi AND guest computer terminals in the lobby were down for 3 days; I deliberately like to travel light and therefore if a reputable hotel and resort has its own business center or computers, I'm going to take a chance and leave my own equipment at home or in the office. I'll use theirs instead of taking my laptop or have to rely on my smart-phone. Lesson learned: even in a good facility such as this tech problems can occur, which they did. Note to self - and others: bring your own so you're not without that medium of communication if you were depending on it. Inside my guestroom, the functionality of the TV remote was a joke. Buttons were sticky, many simply didn't even transmit a signal. I should've asked for a better working one, but by the 3rd I was so frustrated with that and their computers being down I just gave up. Another issue had to do with service. Being a timeshare owner (not in the Marriott family0 I successfully exchanged into the Canyon Villas. My stay was in the middle of October, not exactly peak season like Jan-March, or through Spring Break, which to us Northern Mid-Westerners, goes into the 2nd week of April. I called the Canyon Villas directly a week ahead of my stay and asked about the possibility of obtaining a larger 1-BR instead of the smaller one I had exchanged into. I received a very curt response of \"No, we're absolutely full.\" OK, I can buy that. I can also completely accept the limitations of my exchange. The only problem I had was that once I got there, the place was half-empty. If the hostess answering the phone the day I called would've taken the time to simply explain their policy of limiting exchangers only into smaller units, I could've accepted that as an honest, professional response. I remember thinking once I was there: if this facility is full, it means alot of people must've walked here or taken cabs from the airport, because some buildings on the grounds had NO cars in their dedicated parking lots. But to get there and find that her response was just one of convenience and untrue, it did leave alot to be desired as to Marriott's integrity. In thinking about it, whether or not I was in the large or small unit, it's arguably the same maintenance costs on their end: I'm going to use the same amount of linens, towels and soap regardless of which size unit I'm going to stay in. The units themslves are nice enough, although Marriott could take a page or two from Westin, Hilton or others when it comes to updating room decor. Interesting to note that as a Marriott member (hotels, not the timeshare division) I've stayed in newer Marriott Residence Inns which had nicer interiors than at the Canyon Villas. I still like the Canyon Villas, especially for its north central Phoenix location and the JW Desert Ridge, which is right \"next door\". It's worth it to walk over there for \"happy hour\" and to tour their beautifult property as well.", "Date": "December 27, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Pueblo", "Title": "“Lovely property and respectful of many religions”", "Author": "Pueblochick", "ReviewID": "UR122045655", "Content": "For many years, my husband and two children have vacationed around the US during the holiday season. Canyon Villas is THE FIRST to offer the lighting of Hanukaah candles, for those of us who don't celebrate Christmas. We are so appreciative of this! Thanks, Marriott Canyon Villas, for helping us celebrate our holiday traditions away from home. We also greatly enjoyed the beauty of the grounds, proximity to JW Marriott, lovely units and view, and quiet and peaceful atmosphere. We've had a great week!", "Date": "December 23, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "2.0", "Value": "2", "Sleep Quality": "5", "Rooms": "4", "Location": "1"}, "AuthorLocation": "captiva, fl", "Title": "“Very Disappointing”", "Author": "csheetz", "ReviewID": "UR120968485", "Content": "As a 2 week Timeshare owner at Canyon Villas, I asked for a Golf Course view well in advance. Received a room at the very end, opposite of new construction for an addition. No view. Cable TV is also under construction and we were told it will be until year's end to be repaired. All channels are fuzzy throughout Resort, and many majors not watchable. We were there during World Series week and had to find Sports Bars to view the TV. Yes, the cable service is that bad! The Internet service was also down frequently during our stay, We were instructed to go to JW Hotel to print boarding passes. Our room was quite dark. Several lamps had 3-ways but light bulbs were singles.", "Date": "November 23, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Joppa, Maryland", "Title": "“Typical Marriott--Excellent Property”", "Author": "targated", "ReviewID": "UR120923188", "Content": "Great location for golfers with many courses nearby. Room, pool & hot tub in very nice shape. They even have an adults only pool.", "Date": "November 22, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Florida", "Title": "“Relaxing stay”", "Author": "DiegoFlorida", "ReviewID": "UR120819024", "Content": "We traded for a week with Interval. We had a nicely decorated 2 bedroom, 2 bathroom unit with a full kitchen, living room and dining area, plus a washer and dryer. Our second bedroom had a mini fridge and coffeemaker.We were in the 2900 area and it was very quiet. We had a newspaper by our front door every morning (USA Today). The kitchen had all the appliances we could need. We were given some coffee and laundry detergent to start our stay. If we needed more we had to buy them. Also some little bottles of shampoo and conditioner. There was enough dish soap, garbage bags, paper towels toilet paper and kleenex to get us through the whole week. There is no cleaning service unless you want to pay quite a bit extra but we did not need it. We just did a load of the towels several times a week in our unit and made our own bed. The pool area looked very nice although we did not use it. There was a room with weights which we did not use and a different room with cardio which we did use several times. Plenty of cardio machines and each had their own TV attached. The room was also kept very clean. Check in was very easy and they were very nice at the counter. There was a concierge in the lobby which we did not need. We were very close to Desert Ridge Shopping area where there are so many popular stores and restaurants. We actually walked there from our unit one day and it was a nice walk. We passed the golfing section which is right on the property and it looked really nice. We were given a pass key to the pool at the Marriott Hotel which is just a short drive up the road but we did not use it. The pool at our Villas looked nice enough if we needed one. I saw many free shuttle buses come to the front entrance all day long. They have many fun planned activities every day and gave us a schedule but we were unable to attend any of them. Check out is at 10am but we left a day early. It was a 25 minute drive to the airport. We had only one small complaint and it is that the glass shower door off the main bedroom did not close all the way. Other than that due to the excellent location, cleanliness and quiet room we would come back here again.", "Date": "November 20, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "3", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Chicago, Illinois", "Title": "“Wonderful experience”", "Author": "srp2775", "ReviewID": "UR120347890", "Content": "Everything was great here. We are a family of four and had a two bedroom unit. We requested the top floor, which was quiet. Our room was in the last building 3300, and our balcony faced the quiet pool. It was only noisy in there once, when kids were in the pool. (not sure if they are allowed in there...). So all in all, we didn't have noise problems in or out of our unit. The hotel's location was great, being in close proximity to a highway and maybe about 25-30 min. from the airport. There is a big shopping center, Desert Ridge Marketplace, very close, which has an Albertson's and CVS. There were also a lot of chain stores and restaurants there, too. I brought our two sons, ages 2 and 5, to a play place in the mall. (can't remember name). It was only $5 each on Fridays. It was money well spent, as they were occupied for about an hour. The place is very small, though, having one inflatable slide and a climbing structure. Older children may be bored here. There is also a small play area for the 2 and under group, but we didn't go there. Don't forget socks, as shoes are not allowed on the play sets. The service at the front desk and pool cafe was wonderful. Everyone was pleasant and helpful. We needed towels one night, and they were delivered within 10 min. We only had maid service once, but he/she did a great job. I accidentally left out over $200 cash on the nightstand, and it wasn't touched. The kitchen was stocked, too. You don't need to bring laundry detergent, dishwasher detergent, or dish soap. And the in-unit washer/dryer was nice. There are only two negative things. The shower head in the master bathroom could not be adjusted and just sprayed onto the wall. It wasn't really a big deal to me, though. The bed in the master bedroom was not comfortable for me, but husband thought the mattress was fine.", "Date": "November 8, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "3", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Kansas City, Missouri", "Title": "“Great location”", "Author": "Lucy29KC", "ReviewID": "UR119949919", "Content": "We stayed here October 8 - 15, 2011 using a trade thru II. We had an efficiency unit with all the typical Marriott amenities. The biggest complaint we had, which is why we knocked 1 star off, was our room location. We were in the last unit (building 3300) with our room door facing Tatum Blvd. Tatum is a very busy street all day long. We could hear traffic very clearly early in the morning for rush hour and late in the evening past 11pm. It was almost a constant hum of the cars and horns honking, etc. We did not complain to management so I'm not sure if they would have moved us or not. Other than that, the grounds were extremely nice and well taken care of. We used the pool once and there were plenty of chairs and towels. There is also a separate kids pool with sprinklers located away from the main pool. By staying there you also get access to use the JW Marriott pool. They have a shuttle that will take you there or it is a short walk over. The JW has several pools including a lazy river that was so relaxing. We got there after 9 and it didn't really start getting crowded until closer to noon. The pools open at 7 so if you get there at that time you will probably have it to yourself for awhile. The location is perfect if you are going out for spring training baseball. All the stadiums are within about a 30 minute drive. There's lots of shopping and restaurants close too. Plus the highway is close by. We would stay there again but not in building 3300.", "Date": "October 31, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Seattle, Wa", "Title": "“Enjoyed the facilities thoroughly!”", "Author": "King06", "ReviewID": "UR119809943", "Content": "We are Marriott Vacation Club owners and this was our first visit to Canyon Villas. Overall, we were very pleased with the experience. The rooms have a typical Marriott Vacation Club layout, it's roomy, tasteful and tries to reflect the local SW decor. Everything was in working order and had a nice, peaceful view of the golf course. It's centrally located (at least for the large Phoenix metro area). We didn't spend much time at the Villas itself as we did alot of sightseeing and outdoor activiies in the greater Phoenix/Arizona area.", "Date": "October 27, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Yarmouth, Maine", "Title": "“Great Marriott Resort”", "Author": "BonVoyage555", "ReviewID": "UR119596637", "Content": "We are owners here so, maybe a bit biased although we own elsewhere and wouldn't consider a visit there . This resort is great, well located, clean, picturesque and the service is good. We like Desert Ridge and it's location. Great shopping and restaurants nearby. Convenient to the airport...try Super-Shuttle.", "Date": "October 22, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Hertfordshire", "Title": "“My first visit to America”", "Author": "oop61", "ReviewID": "UR119195410", "Content": "My Husband and I traveled from England where we live in Hertfordshire, just outside London. It was our first stay in America and we loved it. Our stay in Canyon Villas, was very enjoyable, we did not use the Golf Course but our room overlooked the green and it was a lovely view. We only visited the main Hotel in the evening for Dinner, all the Restaurants were very good, we did rather prefer the Restaurant called Tuscany. They all did a Glutton free menu which was helpful to me as I have an Intolerance. The shuttle bus was good to use to go over to the main Hotel, but it was only about a 12 minute walk and we did walk back sometimes. We also had a ride back in one of the larger Golf Buggies which for me a 62year old English lady was great fun. The swimming pool at Canyon Villas was very nice and although on our last day, we ventured over to use the one at the main Marriott Hotel, and that was very nice too. The Desert Ridge Market Place was, great too. We used the nice Shuttle buses to go over and sometimes we walked (25minute walk). We had the phone number of Reception and we were able to phone through from the Market place if we had walked over there, I think we confused the issue though when we walked as the driver did not know we had gone over, hence the phone call. The Shuttle go over to the Market every hour, I do not think many people walk over there. Detours was the tour people that Reception put us in touch with for our visit to Sedona, and also to Tombstone, they were very good. We used another driver, that Reception put us in touch with and I cannot praise this man enough, his first name was \"Richard\" and he was brilliant. Our holiday was very good. We did accept the 90 minute sales talk, this was not forced on us at all, and for listening we were given a $100 voucher to spend in any of the Restaurants at the Hotel. As we live in England and not in America we would not buy into this holiday, (We 2 apartments we have bought into in Malta) Although we have bought a weeks holiday here, which we will enjoy again in 2013. I loved the scenery. When we return, we will know to add another 2 hours to the 6 hours when we put our watches to Phoenix time. when we first arrived in Chicago, we put our watches back 6 hours. Phoenix are 8 hours behind us in England. For the first three days in Phoenix we wondered why none of your shops opened on time and the Pool Bar also. Looking forward to our Return in 2013 this time we will visit the Grand Canyon too.", "Date": "October 11, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Denver, Colorado", "Title": "“Home away from Home”", "Author": "flowerpot_11", "ReviewID": "UR118638163", "Content": "When we arrived at the Marriott, It was so clean and cozy outside, flowers so beautiful and lot's of color. We went to our room and put our bags down to unpack and decided that maybe we should take a drive to the store and maybe pick up dinner and some wine. Anyway we returned back to our room and I decided to take a refreshing shower. We decided to have dinner out on the patio. I could not beleive my eyes it was so warm and cozy .It was as tho we were sitting in our own back yard. Just the peice and quiet and even tho we were by the street you could not really here the traffic. Lets just say this is a trip I will never forget. So If you go to Phoenix and need some where to stay the Marriott's Canyon Villas is the place for you.Oh the first floor is the best for this home away from home stay.", "Date": "September 27, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Sleep Quality": "4", "Rooms": "4", "Location": "3"}, "AuthorLocation": "ottawa", "Title": "“Nice place to stay”", "Author": "snarkee", "ReviewID": "UR118544535", "Content": "PROS Large 2 BR, lots of nice touches, super clean, comfy beds. Stayed on top floor/end unit as advised by previous review here-- so no noise above. Tx for the tip! CONS Lots of walking & driving to get around complex .. not so fun in 115 degree weather! Had to call at 4 pm to get room cleaned...disappointing.", "Date": "September 24, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Santiago", "Title": "“Love the place!!!”", "Author": "Cindy-Rox", "ReviewID": "UR118380847", "Content": "We were invited by some friends members of Interval and gave us the one bedroom, one bathroom unit. We simply loved it. The bed and pillows amazing after a long day out visiting Grand Canyon and surroundings. We were able to use the pool at the Marriott Hotel nearby which is really nice. Food and drinks very good as well. We are fans of Marriott vacation Clubs. We trully enjoyed.", "Date": "September 20, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Sayville, New York", "Title": "“Business Stay”", "Author": "Furaihtnyc", "ReviewID": "UR118362045", "Content": "I just got back from a trip where I stayed at this property for a conference. For me it was a positive experience. The room was extremely clean, attractive and had everything I needed. The balcony had a nice view and let the sun in perfectly. I did get a chance to use the swimming pool and found it very refreshing. I noticed that they were a lot less children than I thought there would be. Maybe it was the time of year but it would make me hesitate to bring my two little ones there.", "Date": "September 20, 2011"}, {"Ratings": {"Location": "4", "Overall": "4.0", "Value": "4", "Service": "4", "Rooms": "5"}, "AuthorLocation": "New Jersey/New York", "Title": "“It may be \"dry\",\" but it's still hot!”", "Author": "nyrxman", "ReviewID": "UR118157651", "Content": "We are Marriott Vacation Club owners and this year we took the family to Canyon Villas in Phoenix the second week of August. We knew it was going to be hot, but we figured we would do all the pool type activities in the morning and travel about to air conditioned venues in the afternoon, and then come back in the evening when it cooled down a bit. Well every day averaged about 104-106 degrees. And while it is dry, my oven is dry and I don't stick my head in the oven. The one good thing about going in the summer I suppose is that the resort is not quite as busy. Unfortunately our stay did not start off on the right foot. After a nearly 6 hour flight and shuttling a ton of bags (there were five of us) from the airport to the hotel, all we wanted to do was go to our room, change and relax. Check in time is 4PM. We arrived shortly after 4 PM and our room was not ready, and they said they could not accommodate our request for a high floor. They finally found a room, but they said it would be about 2 hours before it would be ready. We were told later by one of the staff that during the summer, when it is much slower at the resort, they do not hire on their entire staff and this could have very well been the reason it was taking so long for the rooms to be ready. One good piece of advice is to definitely rent a car. Because we were four adults and one child, we did not rent a car at the airport because we would have needed a large car or SUV to fit all the luggage. So we rented a car at the Hertz rental agency connected to the JW Marriott Desert Ride on the other side of the street ( One of the perks of staying at the Villas is that you have access to all the facilities at the JW Marriott). We actually hired a Super Shuttle van exclusively for our family to take us to the hotel. It was very reasonable and we were all very comfortable with no problem handling the luggage. Because it was an exclusive rental (about $69 one way for all of us), there were not stops or drop offs to the hotel as there would be had we taken one of the \"regular\" Super Shuttles. Then we rented a much smaller and affordable car at the hotel for the rest of the week. This allowed us to try many of the great restaurants in the Scottsdale area and well as visit some great museums. One of the best museums we visited was the MIM (Musical Instrument Museum). If you like music, this is a must visit. It is a beautiful museum and very close to Canyon Villas. The facilities at Canyon Villas were ok, but not as nice as some of Marriott's other vacation club properties. We found ourselves spending more time at the hotel across the street which is magnificent. It has more pools, lazy river, choice of fine restaurants, etc. Our two bedroom villa was clean and roomy and pretty much a copy of other Marriott Vacation Club villas. All in all, we had a great time. My six year old granddaughter had a blast as well. I would not hesitate to recommend this property, but probably not in the heat of the summer.", "Date": "September 15, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Lumberton, NJ", "Title": "“Loved it so much, we want to go back with the kids!”", "Author": "BigEagles", "ReviewID": "UR117999626", "Content": "We arrived at the resort late on Tue. Aug 30 so check-in was a breeze. My wife and I were there to celebrate our 15 year anniversary without the kids. A list of activities for the week was included at check-in, and there is a little bit of something for everybody going on throughout the resort from early morning to late evening every day. We had booked the one bedroom unit which was small but adequate for two people. I travel with a blacklight to examine the room for \"hidden\" stains on beds/floors, etc., and to my surprise, the unit was extremely clean (I almost always find something)! These kind of things always skeeve me out, but I'm happy to report that the sheets and pillowcases were spotless! Only a couple of random stains on the couch is all I could find. The fridge and microwave came in handy, the bed was comfortable, the deck overlooking the pool was nice, and the high-speed internet was fast. Also, the parking lot had covered parking spaces, which proved extremely useful when going out in your car after a day sitting in the hot Arizona sun! The next morning, we discovered our unit didn't have a hair dryer, but after a quick call to the front desk, we had one within minutes. A visit to the concierge was extremely helpful in planning activities for us in the Phoenix/Scottsdale area, and she had advice on everything from dining to hot air balloon rides to Jeep tours in Sedona. Plus, she handed us a Marriott Vacation Card and a sheet of paper with local establishments offering various discounts when you displayed the card. The workout area is amazing -- from free weights to cardio machines -- you'll feel like you're a member at a gym. The pools are nice and stay open until 11PM. We did go over to the JW Marriott side of the resort, and it's even nicer over there! Free valet parking for Canyon Villas guests, and free access to the pools and the lazy river! You don't even have to carry cash or credit - everything gets billed back to your room which is nice. Never had a chance to go golfing, or check out many of the restaurants at the JW Marriott, so I can't comment on that, but we did volunteer to attend their 90 minute Vacation Club presentation at the suggestion of the concierge in order to get a $100 credit to resort. While the presentation was very interesting, and the vacation club seems like a good value, it wasn't within our budget at this time. Although the presentation was not high pressure, it did last nearly an hour longer than advertised so be prepared to sit there for 2.5 hours if you attend. We also chose to get 15,000 Marriott Reward points added to our membership account instead of the $100 Resort credit which basically amounts to a 1-2 nights stay at a Marriott-brand hotel (depending on the brand). Overall, we were extremely impressed with the resort and kept saying to each other how much fun the kids would have had there! We plan on taking them back!", "Date": "September 12, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "2.0", "Value": "2"}, "AuthorLocation": "London, United Kingdom", "Title": "“Not up to MVC standards - certainly doesn't compare with Spanish resorts”", "Author": "electroshock", "ReviewID": "UR117446446", "Content": "We Selected this Marriott resort forthe first week of our two week vacation in the desert, so I can now compare with another Marriott resport where we spent the 2nd week, and also compare to our \"home\" resort in Spain. All I can say is that we won't return to this resort! First impressions are that it resembles a concrete motel. The design is basic and uninviting. The hotel grounds are desert like (OK, yes well we were in the desert, but compared to Palm Desert grounds which are beautifully tendered, well there is no comparison. Our apartment was at the far end (future development/expansion area), near to the \"quiet pool\" which was in fact a spa pool, and overlooked what I would describe as scrubland. As a result I wanted to spend as little time in the resort or on our balcony as possible. Yes the JW Marriott across the road is very nice but it kind of defeats the self catering element of the vacation if you don't feel relaxed and pleased to stay in your room or on your balcony doesn't it? Compare this to our subsequent week in Desert Springs - a massive improvement and an altogether different experience for all of us including my teenage stepson who even had things to do in DS (unlike CV where he was bored out of his brain). TO anyone considering switching your tiomeshare to this resort - if you have stayed in other upscale Marriott resorts such as the Spanish ones or the Californian ones, then you will be unimpressed with this place, and I would recommend you look elsewhere.", "Date": "August 30, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Airdrie, Canada", "Title": "“Amazing Place - We will return!”", "Author": "HollywoodBlonde", "ReviewID": "UR117428015", "Content": "We stayed in a two bedroom condo for a week and it was amazing. The condo was extremely clean and very roomy. The washer and dryer is a definite plus when you have kids travelling with you. Everyone that we dealt with was really friendly and very helpful. The main pool is very large and has lots of seating around it. There is a small cantina there as well that serves food and drink - everything can be charged directly to your room so no need to carry cash", "Date": "August 29, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "4"}, "AuthorLocation": "La Mirada, California", "Title": "“Had a lot of Fun”", "Author": "Brandon F", "ReviewID": "UR117141456", "Content": "Going to the Marriott Canyon Villas was a great experience. My wife and I came here on an exchange for our timeshare. Although not a fan of Arizona all together I was a fun of this resort. Our trip didn't start off too well in that it took a long time to get us checked in. We arrived early and were told that we would get a room on arrival but it took about 2 hours for a room to be ready. The good news was that we got all of our grocery shopping done while we waited and when we came back we were upgraded to a 3rd story 1 bedroom instead of the 1st floor that we were supposed to have; that was great. From here on out we had a blast. The pools on site as well as across the street were worth baring the heat to get to them (the lazy river across the street was great). The pool bars had great service and great drinks. The games were very family oriented but allowed my wife and I to play. There was also a lot of “adult\" activities on site that included alcohol for a minimal fee. The rooms were also very clean and fully stocked. The kitchen was really big and worked great for all our meals. The bed and bathroom were very nice; the couch was a little hard though. 2 nice flat screen tvs in the unit; some channels didn't work or came in very faint. DVD players were very good though. Overall it was great. We did do the time share presentation but decided not to join but were given a chance to try out Marriott’s Steak House for free. Great fish and steak and of course the wine was amazing. Try the chocolate cake it was the best part.", "Date": "August 23, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "3.0", "Value": "2", "Service": "4"}, "AuthorLocation": "London, United Kingdom", "Title": "“Very dissapointed clean, but basic”", "Author": "LarryGS", "ReviewID": "UR117013049", "Content": "Having stayed at Marriott resorts before and owning weeks at two different Marriott places in Spain, we had high expectations for Canyon Villas that were never achieved. When we checked in, it was okay, but we purely functional. our first impressions of the resort were \"looks okay, nothing special\". our rooms were spotlessly clean and well equipped so we thought wait until morning, maybe our first impressions aren't right. The apartment blocks are two storey and very basic and boring, the so called quiet pool area was 5 jacuzzi type pools joined together. The main pool was functional and not bad, but the pool bar/food was very disappointing. There is no bar/social area except a basic 'owners lounge'. The concierge was only interested in trying to get us to attend the sales presentation and ode she realised we were not going to attend, she did not return our requests for info. In tacit, the two concierge staff we spoke to seemed to have little knowledge of what existed outside the resort. The JW Marriott over the road, just 5 mins walks away was great. good pools and lazy river but again the food round the pool was dissapointing. However, ado go to Roys bar for happy hour, $5 for an outstanding cocktail. We are really surprised at some of the reviews of this place, it is probably 3 star as a destination, it's clean and ok, but nothing more that that, not the standard we expected and not a place we'd return to. Nothing so bad we'd complain. But can't think of much to compliment them for.", "Date": "August 21, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Sparks, Nevada", "Title": "“Lots of Room and Lots of Pools”", "Author": "FormerBuckeye", "ReviewID": "UR117012831", "Content": "I like Marriotts. They are consistently roomy and comfortable with updated decor. Canyon Villas are no exception. The beds are great, and there was plenty of room for the four of us. There are several pools on property and several more, including a lazy river, across the way. Being August in Phoenix, we spent a lot of time at the pools. We could always find chairs with shade no matter what time of day we went. A few times I even had the quiet pool to myself! Our stay at Canyon Villas was very comfortable and relaxing.", "Date": "August 21, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "4"}, "AuthorLocation": "", "Title": "“We come here every year (5 years straight) and love it.”", "Author": "Kenneybee", "ReviewID": "UR116580607", "Content": "This trip was great as usual. We stayed in the 3300 block next to lizard lagoon, I was a little concerned since I had read you can hear traffic in Tatum Blvd., but I never heard anything! Although for next year I think we'll stay closer to the main pool, our kids are getting older and are liking the deeper water vs. the kiddie pool. We enjoy the various resort activities they offer, such as Iron Chef competition between guests, popcorn tasting, hula-hoop competition, seems like something for every age. We look forward to next year. A few negatives I'll mentioned that bugged: over at the JW on busy days like Fridays, the lazy river had a lot of drunk adults and who knows how much alcohol they spilled in it (not loving that with my kids around)-that water was murkier than it should have been! They have suspended bus service between the villas and the JW to only once an hour from every 15 minutes last time we were there, but it turned out ok since I discovered I liked driving over more anyways. There also seems to be a lot of Mosquitos in the room (5 or 6, but mire than there should be) I don't know if it's because of the water feature in the room or it was monsoon season as well. Like I said these are nit-picks. We love it here! It's one of our family traditions to come every summer. Traveled with 3 kids, ages: 7, 4, 8 months", "Date": "August 11, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "3", "Overall": "3.0", "Value": "3", "Service": "5"}, "AuthorLocation": "New Jersey", "Title": "“Lovely but noisy”", "Author": "donandmadmom", "ReviewID": "UR116182365", "Content": "Family and I (husband 50, children 21 and 18) stayed in a suite on the second floor of building #2. Positives: Room was lovely, spacious and very clean. Pools were great. The largerst pools and 'lazy river' type pool area (where a waitress will bring you a drink right in the water as you are floating around in your tube!) is accessed via a free shuttle that takes you to the main JW Marriot about 1/4 mile away. The basic Spa massage was great . Spa is lovely with it's own (very quiet) pool area,bistro, sauna, steam room, whirlpool ,showers etc. Negatives: Walls, doors and ceiling were very THIN. Family above us had a child or two and we could hear them running around their room. I could hear a clock alarm buzzing at 6:30 a.m. for about 15 mins. in the room next door. I believe they were out early and forgot to shut of the alarm. The doors slam shut very noisily. Doors open onto open air hallways and echo terribly. Early morning sounded like a $50.00 motel! Was supposed to be a 'golf course view', but all we could see was foliage. Also, there was an overabundance of teens running around due to a soccer tournament in the area. .Tips: Stay on the top floor. Don't know what you could do about the noise of the doors however. Perhaps to be located near vacant rooms???", "Date": "August 2, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "La Paz, Bolivia", "Title": "“First class Vacation Villa”", "Author": "JoseLuisContreras", "ReviewID": "UR115964696", "Content": "This is one of the newer version of Marriott Vacation Villa suites: spacious, very well designed, almost luxurious. Hotel guests can access the JW Marriott facilities which are a block away which complements existing offerings.", "Date": "July 29, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "4"}, "AuthorLocation": "Oakville, Canada", "Title": "“Fantastic!”", "Author": "Sky_Traveler", "ReviewID": "UR115926943", "Content": "I have stayed at the Marriott Canyon Villas on two different occasions, once on a family trip with a big group, and once as a getaway with my wife. On both occasions, we loved the property and found amazing value - we paid far less than the JW Marriott across the road was charging, but were given the ability to use JW's amenities. This isn't to say that the Canyon Villas is lacking on its own. There's a great pool, the grounds are very well kept, and the rooms that we had were fantastic. On both occasions we had suites that came equipped with kitchens, amazing bathrooms, flat screen televisions, and balconies. The staff were always friendly, and they had regular shuttles over to the JW. We really enjoyed both of our stays there, and would happily return in the future.", "Date": "July 28, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Calgary", "Title": "“Excellent Choice!!”", "Author": "2PrincessesandaFrog", "ReviewID": "UR115700817", "Content": "This vacation club rental is outstanding, and even exceeded our expectations. Everything was at hand that one could need....W/D, stove, fridge, and every utensil you could possibly think of!! We didn't go the main pool, but the children's pool was outstanding. Our child loved every minute of it, as it was only 1 1/2 ft deep, and had various spray apparatus around the pool. The only downfall was that it seems that the local residents think that they can come and use the facility as well. On at least three occassions we saw \"mom's\" getting out of big SUV's with 7 children in tow, as well as numerous beach bags ready for a day of play. No family would travel on vacation with all the amenties and toys that these day \"guests\" were bringing to the pool. I phoned the front desk to make them aware of the now overcrowded pool, and those who weren't guests, and they commented that there are issues with that at the facility cinstantly. Not sure if anything was ever done about it, so it is a little frustrating for paying guests. Lots of parking available, so no trouble finding a spot. Great access to the mall across the street (a shuttle bus is available if required). The Villas also hosts a variety of activities for guests from social nights, to hikes to fitness classess. Guests at the Canyon Villas also have access to the JW Marriott facilities, which includes a lazy river. Lots of fun for the kids but it does become extremely busy on weekends. Wristbands are required here, so that helps to keep many of the locals away....although I am told that someone will rent a room and then many families will come for the day and enjoy the facilities. So be aware that it may be extremely crowded here on weekends. I would definitely go back and stay at the Villas...all the amenities of your home are available to you while staying in the suite. If you are paying for a room daily, housekeeeping is included, otherwise it isn't. So be aware if you are expecting housekeeping to keep your room fresh everyday.... Plenty of room for families. Wouldn't hesitate to recommend this stay to friends or family.", "Date": "July 23, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "4", "Service": "5"}, "AuthorLocation": "Redondo Beach, Calif.", "Title": "“Great time at the Villas”", "Author": "LaSerena", "ReviewID": "UR115307776", "Content": "We just got back from a weekend at the Villas and everything was fantastic. Great service, beautiful rooms (we had two two-bedroom condos), beautiful grounds. The beds were extremely comfortable and the kitchen was well-stocked for cooking. We also used the gas grills to BBQ. We were really impressed with the staff both at the Villas and at the rest of the resort (which includes the Marriott Desert Ridge) across the street. The staff were extremely friendly and helpful, even in the 105 summer temperatures. For pool time we preferred the Marriott/hotel side of the resort (the Villas office will provide you with a wristband to get pool access there). The main hotel has two pools and a lazy river. There are two pools at the Villas but the area is smaller and it feels more crowded. The hotel also has a few restaurants, including a Roy's with patio seating and happy hour from 4 to 6pm. Although we spent a lot of time on the hotel side of this resort, I always prefer the condos for kicking back, relaxing and for eating in when we want to. We'll definitely go back.", "Date": "July 13, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "4.0"}, "AuthorLocation": "Flemington, New Jersey", "Title": "“JW Marriott's Lazy River no longer a guarantee”", "Author": "lfmkrmrbm", "ReviewID": "UR115214364", "Content": "Just as an FYI for those folks who are going to the Canyon Villas and are looking forward to using the JW Marriott's pools as well: if the hotel is booked, or at full capacity, they are required to restrict, as per the city's fire dept, the number of guests in the pool area. In order to do that, they deny access to the Canyon Villa guests. Over the 4th of July weekend, Villa guests were not allowed to use the pools on the 1st thru the 4th. They already know that they will do the same for Labor Day weekend. Whether or not they will restrict for other weekends will be decided as the weekend approaches. The hotel now offers rates and packages to area residents that are cheaper for a family to go to than the other water parks nearby.", "Date": "July 10, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "4"}, "AuthorLocation": "Atascadero, California", "Title": "“Love Marriott Canyon Villas -- we recommend the timeshare tour & purchase”", "Author": "MOTHERLOAD", "ReviewID": "UR115067789", "Content": "We have been here 3 summers now, trading our week in Vegas or Palm Desert for a week in Phoenix. Yes, it is hot, but I love the desert & it is a relaxing, elegant vacation. Go for the Marriott tour & we encourage you to buy into the program. It is a great program for families or couples to vacation. Marriott is not high pressure & if you are not interested you will still get a gift, like $100.00 for the JW restuarants across the property. There are 2 golf courses here, Wildfire & another Faldo course i think. I don't play golf, but the courses are pretty. The Marriott landscaping is fantastic. I love the variety of desert landscaping, it is so pretty. There is also a lot of wildlife on the grounds, many birds including quail, rabbits, owls, etc. The villas come as 2 bed, 2 bath unit with washer/dryer, etc. You can also rent just 1 bedroom, or just a studio unit. Four people should have at least a 1 bedroom. Studios are good for 2 people, but don't have washer/dryer & have only mini kitchen with microwave / coffee maker, etc. We travel a lot & we own a Marriott week at Grand Chateau Las Vegas, and a week at Shadow Ridge, Palm Desert, with both being 2 bedroom units. We have stayed at Canyon Villas more than anywhere else because the Villas are roomy, the area beautiful & the choice of pools is awesome. The pools at the Villas are wonderful & there are several, but you can also go & use the pools at the JW Marriott next door. There is an exercise room on site & other amenities. We go to the Albertson's market in the Desert Ridge Center & stock up on food to cook in the villa. The villas have granite counter tops, & the Master bedroom has a room with a shower, toilet & sink, then there is a 2nd master sink counter area, & a large soaking tub. The rooms have balconies or patios with tables and chairs on them. There are BBQ's scattered around the resort you can use. There are activities you can sign up for. Free parking & free WIFI. The beds & bedding are wonderful! Also, the studio & the living room both have sofabeds. Marriott is putting in new sofas in all villas across the globe that have memory foam mattresses. This is because the existing sofabed mattresses are horrible. Marriott Mountainside condos were the test case so those units already have the new sofabeds. They are made by American Leather company. I am excited about this improvement.", "Date": "July 5, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "4", "Service": "5"}, "AuthorLocation": "Shawnee, Oklahoma", "Title": "“GREAT experience!”", "Author": "FisherFamily94", "ReviewID": "UR114616293", "Content": "Our family of 5 stayed in a 2 bedroom villa for 5 nights. We loved having so much space to spread out and relax. The bathrooms were large, full kitchen with laundry was great too. Although we had access to the amenities at JW Marriott across the street, we only visited once for the lazy river. The pools at Canyon Villas were fantastic and our kids preferred them. We ate lunch at the poolside bar and it was very good. My big kids liked the little game area near the pool (foosball, air hockey, pool). The resort is close to the Desert Ridge shopping and restaurants. We walked there one day, my 4 year old struggled some because it was very hot - but the walk is doable and would be nice in cooler weather. The Desert Ridge mall has a water play area for little ones, great place to visit and shop. We would stay at Canyone Villas again without a doubt. Short easy drive to Scottsdale and downtown Phoenix...loved it!", "Date": "June 21, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "5", "Location": "4"}, "AuthorLocation": "USA", "Title": "“Plenty of room for the whole family at Marriott's Canyon Villas!”", "Author": "docbroker", "ReviewID": "UR113184444", "Content": "This is the time share location for Marriott at the JW Marriott Desert Ridge Resort. The great thing about it is that you have full access to the resort (across the street), but you have all of the amenities of home. The pools are incredible as is the spa and golf course. Best of all, the kids have their own space as do the adults! Plus, you have extras that the resort cannot provide like free covered parking, full kitchen, 3 flat screen tv's, and a w/d in the unit. All this for about the same cost as one hotel room!", "Date": "June 13, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Long Island, New York", "Title": "“Everything was Awesome!”", "Author": "bneater", "ReviewID": "UR112982711", "Content": "Looking through the reviews for Marriott's Canyon Villas, it is difficult to find a negative review, which was encouraging. I almost became overwhelmed with thinking that I would be the exception...but, happily...I wasn't. Marriott's Canyon Villas is a GREAT resort with everything you'd want in a vacation. We stayed in a two-bedroom villa during the first week of June in 2011. Our room number was 2705 and we exchanged in via the Marriott Destination Program on a Thursday-Thursday stay. I'll give you the low-down! The resort: Canyon Villas is an exception resort located on a property that is shared by the JW Marriott Desert Ridge. As a guest at Canyon Villas, you have unrestricted access to the JW, which is AMAZING. A Shuttle bus runs every hour on the hour, but the walk isn't bad at between 5-10 minutes. A good, brief walk before you lounge at the pool is ok! Just stay hydrated. The room: The room is well appointed with a nice water fountain as you enter, full kitchen, dining area, living area, master bedroom suite and an efficiency lock-off. The master bathroom has a tub/vanity combo, as well as a seperate toilet/shower area. The kitchen has a breakfast bar that crosses into the dining area, which includes a full dining table. Pools: Everywhere! There are two main pools in the central resort area, but close to that are smaller spas and other pools. There is a quiet pool at the end of the resort which I frequented, but I am not into the kid thing while I am trying to relax, so, it's cool. The quiet pool is warm, but very refreshing when you get out. There is also a kiddie pool area on the northern side of the resort. The Canyon Springs pool bar is cool...nice people, good food...a little overprices for a pool bar, but well, ya know how it is. Fire pits were located around the property in the pool areas for after hours enjoyment. Sometimes you had to deal with the family smores-a-thon as an evening way to entertain the children, but once that cleared out you can sit by the fire and stare at the stars, which is awesome. Resort Grounds: Impeccably maintained. There are grills in the main resort area, and inbetween a set of buildings on both sides of the property. Near the grills on the south side of the property there is a nice herb garden where you can pick some herbs to accent your dishes...a nice and simple touch. Fitness: Two nice fitness rooms on either side of the main lobby, one for cardio and one for weights. The weight machines were good, but somewhat limiting. Dumbbells up to 50lbs. Remember though, you also have access to the JW weight room, which is a short warm-up run away. At the JW, the weight room has older equipment, but a little more variety, including a Smith Machine, which was good to switch it up. I used both and it worked out ok. All the cardio equip was relatively new and state of the art. There are tennis courts on the grounds as well. Location: Literally at the edge of the desert, which was great. You aren't in the downtown Phoenix area, yet you have access to the Desert Ridge Marketplace, Scottsdale, etc. We found it to be extremely convenient. Originally, we had toyed with the idea of staying in Sedona, but am extremely happy it worked out this way. Sedone is less than a two hour drive, and is perfect for a day trip, or a two-day trip. Anything more than that, I think I'd get red-rocked out. There is much more culture, fine dining, and things to do in the greater phoenix/scottsdale/glendale area...so, this resort location gives you access to it all. Room location: If your goal is to relax and enjoy vacation, try to shoot for a room facing the Golf Course on the second or third floor. We loved the location of our room, but it was on the first floor, which was fine for the beginning of our stay. But, on Sunday, new tenants moved in down the hall and they seemed to want to use the back of the villa as their access to the pool, which is weird because that is where you bedroom is, your private patio, etc. The back is the part that looks onto the golf course (if that is your room view) and it has a large dividing area of plants, rocks, and dirt to seperate it. So, it's nice to look out the door and stare, or sit out on the patio in the morning with coffee...which is why it was so ODD for people to use the back of the villa...it was kind of unsettling. We said something to them, but they were a little thick. Odd, given that they can just go out the front door and take the real hallways to the same location and not have to walk through rocks and plants. So, long story, but it helped remind me of the need for a second or third story room. The JW: This resort is amazing and beautiful. What's truly awesome about this is that you get the beauty and spaciouness of the villa...but, the beauty and grandeur of the JW. This answers some of the indulgent needs of the timeshare traveler! The JW has large and expansive pools, including a lazy river. There is TONS of space to lounge in the sun. The lobby area is huge and has tons of couches to sit out at overlooking the pond. There are fire pits everywhere for at night, and tons of space outside and inside to sit around, and that's not including within the pool area. There are multiple restaurants on site at the JW. Blue Sage is typical American fare, including a buffet breakfast, moderately (resort) priced food. We took a chocolate class here with one of the head-chefs which was awesome...look for it on Sat morning. $39 includes breakfast, class, and take homes!. Roys was by far our favorite, most notably for it's daily 4-6 happy hour where martinis, wine, and select appetizers are only $5 per. Outdoor seating, live music on Fri/Sat...this was the place to be!!! Roy's is hawaiian fusion cuisine and everything was amazing. Try the Hawaiian martini! In addition, there is an italian restaurant (didn't go...desert doesn't say italian to me, but it looked nice). There is also a great-looking steakhouse in the clubhouse to the golf course on the same property...didn't go, but looked amazing. There is a pool bar and a poolside taco bar. The pool bar service was nice...there were always employees working the pool side lounges asking for drinks and food. Try the Kokopelli drink...it's awesome. Was a little disappointed that there weren't any drink specials...but, it was the JW, and I had to adjust my brain. The JW includes Revive Spa which has full spa services (for a fee), a private gym (addt'l fee) and a restaurant. We saw Segway tours that toured the grounds leaving from there as well ($$). Overall, the Canyon Villas/JW combo is a one-two punch knockout. It gave you the spaciousness of villa living as well as the opulence of JW life. The location provided amazing vistas as well as accessibility to Scottsdale and other Phoenix area attractions. The grand canyon was a bit too far, but won't be on the next trip...there was just too much to do and didn't want to not be around the pool another day...especially since I know we'll be back in the Valley of the Sun at the Canyon Villas soon.", "Date": "June 12, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Vail, Arizona", "Title": "“Great Stay!”", "Author": "Mozo", "ReviewID": "UR110452325", "Content": "My wife and I spent time here for a quick getaway. I am very glad we are owners at this property. The property is well kept up and showed well. Loved the spool next to the 2300 Building and we will be back in September for another week.", "Date": "May 30, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Washington DC, District of Columbia", "Title": "“Love the Marriott Canyon Villas”", "Author": "PennStateFan", "ReviewID": "UR108681907", "Content": "We spent a week at the Canyon Villas with 4 people in the 1 BR condo. We had mom and dad in the master room and two kids (8 and 5) share the pull out sofa. We had the 1BR lockoff unit, so it had the master bath, full living room, dining table and kitchen. Loved the space, it's great to spread out. We stayed at a building next to the main pool, so it was nice and easy to get to and from the main pool. We loved the pool area, two pools and the kids loved the basketball hoop in the pool and the waterfall. It was a little chaotic with kids jumping off the walkway and try and dunk the basketball. But over a week, no one go hurt, so that is good. Loved the air hockey, ping pool, pool tablel and big outdoor checkers/chess set. The pool grill did a good job with a basic menu at reasonable prices. Like the location and being able to use the JW facilities next door. Would recommend a car for the area though. There is a shuttle to the JW and a big shopping mall with plenty of dining choices, but it was nice to drive a little too to go outside the area. Two golf courses on property and some upscale restaurants at the JW. Loved the staff, cleanliness and space. Highly recommending the Canyon Villas", "Date": "May 17, 2011"}, {"Ratings": {"Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "4", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Blue Bell, PA", "Title": "“Loved the villas!”", "Author": "crjask", "ReviewID": "UR104961569", "Content": "We traded our studio in Orlando for a studio in Phoenix. We were very pleased with everything. Had a great unit on the 3rd floor with a wonderful view of the golf course and the mountains beyond. I was afraid the temperatures would be too hot but 90 degrees in Phoenix and 90 degrees in Philadelphia are very different. The nights were cool and the days always had a nice breeze. The things I liked about the villas were the proximity to the JW Marriott and the CV staff. Everyone was very helpful and pleasant. We signed up for a hike at Pinnacle Peak and even though we were the only 2 to sign up, they still had a van drive us over and pick us up. Great way to start a morning. The JW was great. We had dinner there several times trying all the restaurants and enjoyed the live music there each evening. The lazy river pool was a great way to spend an afternoon. I would definitely recommend the Canyon Villas and we will be back. I actually thought that the even though the JW had the 4 restaurants, golf, spa, pools, and live entertainment, the guests at the Canyon Villas had the best deal with the size of their accommodations, kitchens, yet full use of all the JW amenities. Great job Marriott!", "Date": "April 21, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Boston, MA", "Title": "“Wonderful place, wonderful experienxe”", "Author": "silverush000", "ReviewID": "UR101280570", "Content": "Thoroughly enjoyed our time at this wonderful, scenic and comfortable location. No real criticisms, just a great place. Can't wait to return.", "Date": "March 23, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "4.0", "Value": "4", "Location": "4", "Rooms": "4"}, "AuthorLocation": "", "Title": "“Relaxing and hot”", "Author": "Snoebunny", "ReviewID": "UR97431965", "Content": "Stayed last June for a week as exchange though interval international, big resort and although it was full, it never seemed crowded. Plenty of parking, we had a car and Harley, and location is great for day trips. Shopping mall across road is great (I am Canadian and can't get enough of DSW). We had a 1 bedroom unit and it. was clean and comfortable. Our unit was close to Tatum blvd but did not notice any excessive noise. Shuttle bus to jw Marriott was convenient, beautiful hotel, great restaurants and fun lazy river. We exchange our timeshare frequently in US and Europe and this Was one of our top picks. We would absolutely return.", "Date": "February 21, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "fort myers,fl", "Title": "“Top Notch Location And Staff”", "Author": "hawking", "ReviewID": "UR96193086", "Content": "Stayed in a two bedroom villa that was spacious clean and well apointed. Great views of the golf course and the pool. Great pool bar with very good prices. Two fine golf courses on site as well as access to Marriott Desert Ridge next door. Lots of planed events and excursions to chose from. Free shuttle service to Desert Ridge (shops and restaurants) across the street. City North, a development, also across the street with even more shops, restaurants, and nightlife. An excellent location, so much so that you can do without a rantal car. Take the Super Shuttle from Sky Harbour.", "Date": "February 10, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "5.0", "Value": "3", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Ohio", "Title": "“Great!”", "Author": "StitchesToo", "ReviewID": "UR94015374", "Content": "I really enjoyed staying at the Canyon Villas. We had a 1 bedroom suite with a full kitchen. It was spacious, comfortable and attractive. There were two flat screen tvs, a washer and dryer and a nice patio. Plenty of closet and drawer space. A large dining table as well as a breakfast bar. Free high speed wireless internet. The bathroom had two vanity areas, a separate shower and large soaking tub. The shower was large, but I wish it included a ledge or seat that would make it easier for ladies to shave. The shower head had two settings and I didn't like either of them. Maybe the one in our room was broken. However, the water pressure was fine. The sound-proofing between rooms could be improved. It wasn't a problem for me, but I will mention it for people who might be more sensitive. We had a first floor unit and could hear people walking above us and also could hear the person next door sneeze quite often....must have been allergies :). The grounds are lovely. There are several pools. We used the main pool and loved it. The water temperature was absolutely perfect. The surrounding area includes a nice outdoor mall including lots of shops, restaurants, etc. Also, Marriott's Desert Ridge Resort is next door and privileges at their facilities are included and a shuttle runs between the two places.", "Date": "January 22, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Cumberland, Rhode Island", "Title": "“Great Place to Stay for a While”", "Author": "Cycleboy", "ReviewID": "UR89575167", "Content": "My wife and I stayed for a week at the Canyon Villas and were sad to leave. Everything about the place made it a great place to stay for an extended period of time. The facilities were top notch (pool, fitness center) there were plenty of scheduled activities for guests, the staff was very friendly and accommodating. You do get full use of the facilities at the adjacent J.W. Marriott, but we never felt the need to go there, all our needs were met at the Canyon Villas. It is located in northern Phoenix, about 30 minutes drive from the airport, you definitely need a car if you want to go explore the Phoenix area. There is a great shopping/entertainment center right across the street with multiple restaurants, a movie theater with IMAX and plenty of stores including an Albertsons. We had a one bedroom King suite overlooking the main pool. Very roomy with a complete kitchen so we were able to save some money by eating in a couple of nights and having breakfast every day. There was a nice patio where we would have coffee in the morning and soak up the sun. The bathroom was nice with a big walk-in shower and a separate soaker tub. Bedroom had a comfortable king sized bed and a flat screen TV and DVD player (same in the living room), one plus is that they also had HD channels available... Overall we would strongly recommend this place and we liked it so much that we are thinking of purchasing a membership in the Marriott Vacation Club.", "Date": "December 11, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "surfinginflorida", "Title": "“A wonderful location for a great vacation!”", "Author": "surfinginflorida", "ReviewID": "UR89268800", "Content": "I bought a getaway here for a week from Interval International. It is just my husband and I, but I think this would be a great place for kids. We were given a third floor room near the main pool area. It is really nice because they have several different pool areas so the courtyards between buildings are nice. For little kids there is a pool area and playground, for bigger kids the main pool area has water sports as well as pool, ping-pong, and foosball. The grounds are beautiful and well kept; there are several sidewalks for walking, and a fantastic outdoor shopping mall is only a ten-minute walk. Also, the JW Marriott is a short walk, and it provides access to additional amenities and restaurants. I’ve seen lots of wildlife on my walks – but no rattlesnakes yet! Unfortunately, the lazy river was closed for maintenance during our visit. The Marriott has two great golf courses, several tennis courts, etc. The problem is that there is TOO much to do here! The resort schedules activiities all day long that you can participate in if you have some extra time. I did the hike and the trip to the botanical gardens. The rooms..We booked a lock-off, so it was just an efficiency. The room was comfortable, and having the big balcony was a huge plus because it gave us a place to have breakfast and lunch. With just a microwave and fridge, we went out to dinner at night. The kitchen area was a little cramped compared to other resorts because of a door for an air conditioner or hot water heater. No dishwasher, and we were only provided dish service for two (normally in an efficiency it is for four). No washer and dryer, however, they had full size commercials and dryers in a nearby building (complementary). The bed was very comfortable. Surprisingly, the towels were very worn – ours had rips and snags, not something I would expect from a Marriott. Happy hour at the JW is lots of fun – tiki torches, outdoor heaters and fireplaces, comfortable seating outdoors – and great drinks and appetizers! Try Roy’s from 4-6. Be aware that the \"business center\" costs 35 cents per minute, yikes! The front desk will print boarding passes etc. for you.", "Date": "December 7, 2010"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Boulder, CO", "Title": "“Great Place”", "Author": "bouldertraveller", "ReviewID": "UR87495212", "Content": "We stayed at the Canyon Villas on the resort property. Very welcoming, informative of amenities. Room was nice sized with seating area and great balcony with cafe set for coffee and views. Clean, comfortable bedding. Hope to go again soon.", "Date": "November 18, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Poway, California", "Title": "“Solid and nice place to stay for a few days...”", "Author": "Meerkat92101", "ReviewID": "UR85404668", "Content": "Enjoyed a week here. The rooms were on par with the JW Mariott across the street, plus you have a massive kitchen with an island. The master suite was beautiful and had a large tub. The pools and amenities were standard, but the fact you can stay here and then walk across the street to enjoy what the JW hotel offers - made this a sweetheart deal. Beds were luxurious and if you are into social events at your site - this place has a lot of them. We enjoyed a wine mixer which was fun. The outdoor grills work great and I can only say that I'd stay here again if I had the chance. This hotel is located in Northern Phoenix, but very close to a large outdoor mall that has every kind of food and shopping you 'd need. FYI - the A/C works great here.", "Date": "October 30, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Yarmouth, Maine", "Title": "“Still a wonderful choice!!!”", "Author": "BonVoyage555", "ReviewID": "UR85077137", "Content": "We are owners here and it is still our favorite of the seven Marriott weeks we own. There were some housekeeping issues this time but they were addressed promptly and efficiently. We reccommend this resort to everyone.", "Date": "October 27, 2010"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "Massachusetts", "Title": "“Outstanding Marriott hotel, fabulous location”", "Author": "JCMass", "ReviewID": "UR83026778", "Content": "We just returned from Phoenix this weekend, and throughly enjoyed our stay at the Canyon Villa's. We were there from Wednesday thru Saturday, and stayed in the two room villa. It felt like home quickly and we really appreciated the amenities like a washer and dryer in the unit. We were able to pack less clothing, a real plus. We found the rooms very comfortable, and quite large. The balcony was also quite large. The staff were very helpful, and the place is very welcoming. Parking at the Villa's is included, and so is Wi Fi if you bring your computer. Both of these are an extra charge at the hotel. There is a free shuttle to the hotel twice every hour, and we were given a parking pass and a key to get into the extensive pool area there. You could walk over in about 15 minutes, but the hear made us think twice about it, and we drove ourselves and took the shuttle other times. We ate at the main hotel, and were able to charge the bill to our rooms at the Villa's. The pool area at the Villa's is very large, and this time of year it was quiet and not crowded at all. The have a collection of books you can borrow, or add to, plenty of ice water at the pool, and activites that go on like a movie some nights, and other's music. One night we did star gazing with a gentleman who had a huge telescope, and lots of information about the stars. The location is excellent for visiting the Phoenix area. The large shopping complex across the street has everything including an excellent grocery store. The whole complex is huge, and beautiful, I hope to go back again some time soon.", "Date": "October 11, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "SW USA", "Title": "“Almost Perfect”", "Author": "SWGoodSam", "ReviewID": "UR79557782", "Content": "We visited the last week in August, a low spot in the year. During the week it felt like we were living in a Ghost Town, we heard very little noise from other guests. The 2 Room Condo was extremely spacious, beautifully appointed and furnishings all in good order. It felt a little sparse in the kitchen implements, but we were able to get along with what was available. Our unit faced the Childrens pool with Frog Waterfall. We enjoyed the sound of the waterfall so much we slept with the window open to hear it all night. Again, in the low season we saw very few people even use that pool. Movie night at the Main pool allowed us to watch the movie while sitting IN the pool, which we thought was a unique experience. We specifically choose Canyon Villas for the JW Marriott Lazy River. It is beautiful and we were not disappointed. To get there we had to drive to the Canyon Villas reception area and wait for the shuttle. During our waits, we found the staff to be extremely friendly and helpful. (Thanks you Sharon) The free Ice water available everywhere (Canyon Villas and Marriott) was perfect. The only possible downside was transit time to the JW Marriott. After a couple of days I realized that we were spending at least an hour of our precious vacation, each time we visited the 'other side'. And parking at the JW Marriott was Valet or a 1/4 mile hike from self parking, neither of which was attractive to us. We found shopping for groceries to be super convenient, literally just down the street. We felt very much at home and will hopefully return!", "Date": "September 14, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Edinburgh, Scotland", "Title": "“Excellent accommodation - usual high Marriott standard”", "Author": "FERG12", "ReviewID": "UR72563657", "Content": "We chose this purely because we could do a timeshare exchange for the Phoenix area and we knew what standard we would get with Marriott. It suited us perfectly and we'd go back with no hesitation. Located in the 'Desert Ridge' area in Northeast Phoenix, it's very close to the main routes to downtown Phoenix, Scottsdale and surrounding areas and there's an excellent outdoor Mall with a good choice of restaurants on your doorstep - Desert Ridge Marketplace. The 'resort' consists of the Marriott Canyon villas (the timeshare complex), the JW Marriott hotel (5* I believe the biggest resort hotel in Arizona) and Wildfire Golf Club. In cooler months I guess you can walk between them (15/20 mins) but in July we chose our air conditioned car! There's more development planned for the general vicinity but I believe the recession hit hard in 2008 and halted development in it's tracks. We liked the pool at the villas. The pool bar staff were very friendly and helpful, providing tips for restaurants etc. We also spent a morning using the pools at the JW. The grounds are beautiful, so well maintained with a great choice of pools and a lazy river. Despite being there 4th of July weekend it didn't seem over crowded, despite it's size and sunbeds were plentiful. Staff will bring you large jugs of iced water to your sunbed etc and wait on you poolside. Excellent service. We also used the fitness room. It's not huge but, while I would have loved to have run outdoors, it just wasn't practical in July so it allowed me to try to burn off some of the calories I was packing away at dinner every night! It proved to be a great base for our 4 night stay in the area as part of a longer trip.", "Date": "July 27, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Dallas, Texas", "Title": "“Beautiful \"Villa\" Property”", "Author": "Da11asGlobetrotter", "ReviewID": "UR72067982", "Content": "Spent one night at the Canyon Villas on our way to Sedona and stayed in a 2 bedroom with balcony which looked out to the desert and mountains. Beds were extremely comfortable, marble baths, great kitchen and all the items needed for a longer stay. Felt like you were in the middle of the desert but actually in the middle of North Phoenix within 5 min access to great restaurants and shopping. Grocery and liquor stores as well! Excellent base to venture out and explore all that Phoenix and the surrounding areas have to offer. The grounds around the property were lovely...this is the \"villa\" area of JW Marriott Desert Ridge Resort & Spa and you have access to their amenities. Since we were only there one night we didn't have time to take advantage of. Planning to return in the next few months!", "Date": "July 23, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Northern NJ", "Title": "“If you golf, this is the place for you.”", "Author": "wpmchesternj", "ReviewID": "UR71971228", "Content": "We are Marriott Vacation Club owners and love to stay at the chain when we travel. I was able to purchase a Getaway week through Interval International at the Canyon Villas for a very reasonable rate and we used the Resort as a base to explore the Phoenix area. We have never been to AZ and were able to easily drive to Williams and the Grand Canyon, Sedona and Tucson to the south. The resort is what you would expect from Marriott. And if I was a golfer............ Clean, well maintained and Marriott. You also get to use the amenities at the neighboring JW Marriott including the lazy river pool. The transportation is complimentary. Canyon Villas has a poolside grill restaurant (normal for MVC resorts). JW Marriott hotel has several upscale restaurants with happy hour specials that moderate the cost. We were very close to the Phoenix Zoo and Chase Field where we attended a major league game. To be fair, I reiterate that I am a Marriott Vacation Club owner in Aruba and Hawaii so I am partial to MVC locations.", "Date": "July 22, 2010"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "Colorado", "Title": "“Loved It!”", "Author": "BevRostelle", "ReviewID": "UR71547008", "Content": "The trip in July was hot as hades but the 2 bedroom villas were fantastic for our family with 2 teenagers! We had the newer units and they were very nice! Very roomy, nice kitchen, 2 separate beds (I think queensize) for the 2nd room. Master bedroom as nice as expected with king bed, patio, separate shower tub, closets, etc. The only negative was that we had noisy kids running and jumping above us so I would ask for the 3rd floor if we come back. The villas have nice fitness rooms separated weight and cardio rooms, beautiful pool and snack bar. The JW Marriott hotel is just across the way so we played tennis one morning ( $20 hr nice courts) and tried out the lazy river and pools over there. To be honest, I thought the pool was nicer at the villas (less crowded) but the snack bar by the JW Marriott hotel is much better. Yummy smoothies! My husband and I ate at Roy's Hawaiian Grill Restaurant and it was delicious for dinner with nice ambiance. Grounds at the hotel are beautiful. Didn't try the spa but heard it's great (pricey). Close to shopping, fast food, grocery, etc. Would definitely come back here!!", "Date": "July 19, 2010"}, {"Ratings": {"Service": "2", "Cleanliness": "2", "Overall": "3.0", "Value": "2", "Sleep Quality": "4", "Rooms": "4", "Location": "1"}, "AuthorLocation": "Mount Vernon, WA", "Title": "“3 Star at Best!”", "Author": "sunbaby39", "ReviewID": "UR69628126", "Content": "First the BAD! BUGS!! They must not spray for them here. This place was infested with ants. Crawling up walls all over the floors, YUK! I am a Rewards Member with Marriott and specifically asked for a room in a quiet location and they put us in a room right on Tatum Blvd and overlooking the Kiddee pool, So much for quiet. THEN THE GOOD! The good about this property is there rooms, very nice, (except for ants), The JW Marriott is right next door and has a lazy river pool which is nice on these hot summer days. This resort is great for families with small children. The Canyon Villas are not close to anything, 15 minutes to Scottsdale, 25 Minutes to Tempe or Mesa. The shuttle bus to the JW is every 30 minutes or so, Room service is reasonably priced.", "Date": "July 4, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Boston, Massachusetts", "Title": "“Wonderful resort and home-base for the Arizona Experience”", "Author": "Fijalclarkski", "ReviewID": "UR67834220", "Content": "My parents traded one of their east coast timeshare weeks for a week at the Canyon Villas, and they invited my wife and I to join them in a 2-bedroom villa. We had a fantastic week full of swimming, sunbathing, and eating, peppered with day-trips to the Grand Canyon and Sedona. I'll break my review into sections. THE ROOM: We had a 2-bedroom villa in building 3400, which is the northernmost building, though still not too far from the front desk and the main pool. The villa is nicely decorated and is spacious enough to host guests. Each bedroom is large and features a large (37\"?) flat screen TV. My wife and I were in the second bedroom and had our own balcony/lanai overlooking the kids splash pool. We also had a separate entrance and small kitchenette area. Overall the room was great for us. If you prefer a quieter location, ask to be placed in a room on the southern end of the resort to be away from the road and the kids pool. CANYON VILLA AMENITIES: The resort had plenty to do, in addition to being a beautiful place for a nice walk. We spent a lot of time by the main pools. There were a lot of kids who were generally well-behaved, but there was still enough room to move around and snag a good lounge chair. There are two areas where lounges are placed under misters. Much to my surprise, they don't get you that wet, so you can read a book under them while enjoying what feels like AC! I wasn't impressed by the food at the Canyon Springs bar, but it was decent (and the staff was friendly). We also took advantage of the well-appointed fitness center, which has a good variety of new machines. Confusingly, however, the cardio and weight rooms are adjacent to one another, but you have to go outside (and use your key card) to pass between them. We also attended a yoga class led by a human instructor one day (on other days, yoga is led by a DVD!). We also made use of the grills distributed throughout the property. There are many more amenities but we didn't take advantage of them. JW MARRIOTT AMENITIES: We often walked over to the JW Marriott across the street (we never were able to catch the shuttle - it's a short walk anyway) to use the pools and to dine out. The pool area is very nice - who can resist a lazy river? We liked the nearby serpentine pool because it was quieter and offered natural shade from trees. The pool area restaurant at the JW was much better than at the Canyon Villas. There is chair-side food and beverage service there too. Just be sure to ask for a full menu when they come by - the laminated sheet they distribute has a fraction of what is offered at the restaurant. Roy's Hawaiian Fusion restaurant has \"Aloha Hour\" with drink specials and appetizers for $5 each - quite a deal. In my opinion, you can skip all the other appetizers and order the sliders - they're incredible and the sweet potato fries they come with are really tasty! Great staff there too. We also had dessert only at Meritage, the steakhouse at the JW. The restaurant was mostly empty and service was awkward, but it was nice nonetheless. The decor is nice but I am always weirded out by cowhide (fake or not), which adorns the chairbacks. We attended the stargazing event at the JW one night. There were a lot of kids with parents that were more interested in seeing Saturn than keeping their kids from throwing pebbles at ducks. It basically turned into a kid's program, so we left (after having seen Saturn, of course!). OUTSIDE THE RESORT: The Desert Ridge Marketplace is down the road and offers a bunch of restaurants and shops. Sadly, most of them are found in every other shopping center in America (CPK, Rock Bottom, Macaroni Grill, TGI Friday's, etc.). There is also an In-n-Out Burger which I indulged in (animal style!). Upon check-in, the Canyon Villas provides a coupon book for various stores and restaurants at the marketplace. We used 4-5 of these coupons and saved a bit of money. Sedona is a 2-hour drive and the Grand Canyon is four hours away. We visited Montezuma's Castle and drove through Sedona on our way to the Canyon, where we spent one night at a cheapo hotel in order to get more time seeing the world's largest hole. Sedona was worth a second trip, where we took (and thoroughly enjoyed) a Pink Jeep tour. On our last night we drive through Scottsdale. We wish we had thought of it sooner - we would have spent more time in downtown Scottsdale if we could have. Overall, it was a fantastic vacation made more fantastic by our stay at the Villas. We highly recommend it for anyone, especially families with children. We may be back someday with little ones of our own!", "Date": "June 17, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "4", "Rooms": "5", "Location": "4"}, "AuthorLocation": "midwest", "Title": "“Fantastic vacation from start to finish”", "Author": "MWsogetthis", "ReviewID": "UR67544550", "Content": "This was our second stay at the Canyon Villas Resort. We just love it here! The staff has repeatedly been attentive and willing to accommodate our needs. The concierge is a great resource and hasn't steered us wrong yet. The resort grounds are beautiful and well-maintained. There are several pools in the complex, some for children and some for adults, making it ideal for family vacations or quiet weekend getaways. The larger villa rooms are perfect for traveling with families. The rooms are tastefully decorated and large enough to move around in without feeling cramped. Our first visit was spent exclusively on the property and there was more than enough to do. There are activities scheduled at both the Villas resort and the hotel resort daily, so its easy to keep yourself entertained. The resort is situated next to a large shopping center and is easily accessible from a main thoroughfare but still has a secluded, \"island\" feel. Our second trip was spent exploring the area. We liked the shopping and dining in Scottsdale particularly. The resort is definitely family friendly, but keep in mind there are areas of the complex and activities that might not be. Don't be surprised if you get a few annoyed looks from fellow guests if you stumble into the wrong area with your own brood. Did I mention we love it here?", "Date": "June 15, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "2"}, "AuthorLocation": "Littleton, Colorado", "Title": "“Resort itself is very nice, but location is too far out”", "Author": "EveAndGreg", "ReviewID": "UR67233244", "Content": "We spent four nights here in the fall, when the weather was about mid-80's every day. This property is very new and modern, and the rooms / units are all five-star quality. The pool complexes are very nice too - but, they were quite crowded every day. The better option is to go across the road to the J.W. Marriott, because you get free access there, and they have huge pools and a lazy river and generally much bigger grounds. The pool restaurant is suprisingly good. At least half the people staying here have kids, so it's family friendly. The location is way north in Phoenix though, it's literally out in the desert. While it's scenic, if you want to go to Scottsdale or go tour or golf or whatever somewhere that isn't north, it's going to take a while. There are restaurants and stores in the area, as it appears that the city is creeping out that way, but all the shopping centers are new and bland and feel like some kind of exurban photocopy. Wasn't able to golf so can't comment on the course other than that it looked nice.", "Date": "June 12, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "München", "Title": "“A perfect place”", "Author": "picasso_coco", "ReviewID": "UR66964991", "Content": "We have traveld a lot with out Marriott timeshare and none so far compares to the excellency of the Canyon Villas. We have spent a very leasurely and relaxed week in the abolutely clean (and I am very picky about that) and newly furnished apartment on the ground floor. There is even a water fountain installed in the wall to keep the dryness of the air moderate. Between the building complexes there is a big garden space which makes the villa patio very private. We enjoyed cooking with the fresh herbs growing right outside the patio and they have every imaginable herb. There are BBQs right out to the left, close enough to take our food there easily but far enough off to not be bothered by other BBQers. To the pool areas it was a short nice walk through the garden and were luckily either to the left or the right side of the apartment. There is a quiet spool (huge hot tub but not as hot as a real hot tub). Behind the reception is the main pool area with a big nice temperatured pool with a water fall and 2 hot tubs with one water fall each plus a little lap pool. If this is not enough you can take a shuttle to the adjacent Marriott Hotel and use all the amenities there. We took the car over and some just walked through the golf course. The hotel is very tranquil, especially the outside setting with the Hawaiian restaurant and pretty pond is great for a cocktail in the evening. The pool area doesn't look big at first sight but opens up to different levels and curves around the property. This gives you much more privacy. Behind the pool is another lovely pond which has a great view over the golf corse and to the mountains. The lazy river with the free tubes are great for kids and adults as well. Floating by and watching birds, ducks and bunnies. The jack rabbits are all over and just so cute! The pools have all different temperatures from warm to hot. So no freezing anywhere around your belly line when getting in, which I loved! Right next to the Marriott properties is a mall which offers the big name stores but also has an outside pedestrian type shopping area too. There is a little place there with a water fountain where kids can get in and play. To be crazy enough they turn on a huge outside fire place despite 90°F just for the looks of it. Go there it's great! Who needs the Grand Canyon, if you can stay at Canyon Villas?", "Date": "June 9, 2010"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Baileyville, Maine", "Title": "“Very Nice Resort”", "Author": "JASUAS", "ReviewID": "UR66917272", "Content": "My wife, daughter (20 years old) and a couple of friends travel to Phoenix for the first time in May. We stayed a week at the Marriott Canyon villa's which we picked up for a very good price through Interval Int. We arranged transportation from the airport through the resort. I believe the outfit was called Destinations, driver was Todd. Very clean vehicle and more reasonably priced that a cab or limo service. We own at a Marriott timeshare in Myrtle Beach and this resort although set up slightly different, is very nice. We stayed in the two bedroom unit, while our friends were in a lock off efficiency unit. The two bedroom unit is furnished very well. Beds are exceptional, plenty of living space, dishes, washer/dryer which come in handy, 3 tV's, kitchen with appliances. Set up is similar to our timeshare in MB. The lock off is fairly small, but worked fine for two people with a king bed, couch and small fridge, coffee maker. All units have decks. We were in a 3rd floor unit in bldg 2700 overlooking the pool. A couple of units overlooked the golf course, others didn't have too much of a view. The activities at the resort worked out well for us. We played the two golf courses on site, both were in very good shape, alot of traps but fair off the tee and fairly large greens. We lounged by the pool several afternoons, never had a problem finding a chair. The pool bar is a good place to get a lunch and a cold beverage or two! Beverage manager Matt is top notch. My wife and daughter took advantage of the Spa at the JW Marriott a couple of times while I was golfing, and they said it was heavenly. We took one day trip through Detours to the Grand Canyon. Picked us up a 7Am returned at 7PM. Fairly expensive but definetly worth it. Don't get sold on only going as far as Sedona (beautiful red rocks), but nothing compared to the grand canyon. We ate out most everynight. The desert ridge mall is within a mile and offers several resturants and shopping. The KEG was a good steakhouse, reasonably priced and the Yard house offered about as many different beers as I have ever seen. TGIF, Maraconi Grill were also good. Went into Scottsdale one night to the Capital Grill, very good food and environment but overpriced compared to some we've been to. We went over to the JW a couple of times during the week. Only about a 10 minute walk and a shuttle is offered at times but we never seemed to match up. The JW is outstanding. The grounds, pool, spa are all top notch. Ate at Raye's, which was very good. The one thing we found a little dissappointing at the Canyon villa's was the market place. Only the necessities, very small. Really had to go the JW or mall if you needed anything. Overall we really enjoyed our trip to Phoenix and the Cannon Villa's. I'd recomend it to anyone with small children to retirees that are just looking to relax.", "Date": "June 8, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "pa", "Title": "“Luxury at it's best”", "Author": "ebonywoman", "ReviewID": "UR65974442", "Content": "My husband and I traveled to Phoenix for my nephew's graduation and decided to make it a vacation also. Well, all I can say is that we plan to make this an annual trip. We loved staying at the villas, we had a 1 bedroom. Our villa was clean, comfortable, well equipped kitchen. It was nice to have breakfast on the balcony in the morning. Big comfortable bed, furniture was comfortable also for relaxing. nice soaking bathtub separate shower, 2 sinks (one in the bathroom and one where the bathtub is beside the bathroom). The villas were roomy. The service was great anything we needed we called and it was there in a jiffy. We had a rented car and only moved it twice the whole week. Everything is right there for you. The J.W. Marriott is adjacent to the villas. We had access to all of the amenities over there. They have stores inside the hotel. a Starbucks, many restaurants to choose from, about 1/2 dozen pools to choose from including a lazy river. They even had a Nickelodeon show for the kids. The scenery is unbelievable. The only thing I can tell you is you have to go and experience it for yourself. It's really hard to appreciate it unless you experience it. You won't be disappointed. Oh and the shopping center, stores galore (also an Albertson's for groceries) all kinds of restaurants. something for every budget. I know I'm going on and on but there is so much to tell about this place. I hope this was helpful.", "Date": "May 31, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "3", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Portland, Oregon", "Title": "“Come for the Resort”", "Author": "jonathanhsinger", "ReviewID": "UR63598981", "Content": "I would highly recommend the Canyon Villas as a way to enjoy all the great amenities of the JW Marriott Desert Ridge -- staying at the villas gives one full access to the main hotel, which is just a short walk or shuttle ride away -- without having to pay quite as much for one's stay. The hotel has a plethora of pools and hot tubs, as well as the hotels and lazy river at the main resort. My only complaint was that the positioning of the air conditioning vent, pointing directly at the bed, made it slightly more difficult to sleep comfortably at night. Nevertheless, I would highly recommend the hotel.", "Date": "May 8, 2010"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Pittsburgh", "Title": "“Great Spot in Scottsdale Area”", "Author": "Espresso17", "ReviewID": "UR59816781", "Content": "This Vacation club community is great. We spent a lot of time both at this property, and at the connected JW Marriott resort. It was an easy, and enjoyable walk. We stayed in a 1 bedroom with a Kitchen. There is an outdoor mall about a mile away - again very walkable with a stroller. Everything was in like new condition. We will definitely go back.", "Date": "March 29, 2010"}, {"Ratings": {"Service": "2", "Cleanliness": "4", "Overall": "2.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "4"}, "AuthorLocation": "Chicago", "Title": "“Not for Business”", "Author": "jim9013", "ReviewID": "UR59095914", "Content": "I must confess I do not usually write on Trip Advisor, but feel a sense of obligation given the overwhelming positive reviews on this property. I do not recommend this property for business travelers. This is a Marriott Vacation Club resort and should not be confused with regular Marriott quality. This is not a place for business people. The room I was was put into, at $409 per night, was an absolute disaster. small, cramped, tired carpeting, noisy and no desk. It was a \"lock-off\" of a main unit...nothing better then a small bedroom with functional bath. I was able (with much hassle) to move across the road to a much better room in the adjacent JW Marriott. At a lower rate...no contest. Business Traveller Beware!", "Date": "March 20, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Winnipeg, Canada", "Title": "“Excellent!”", "Author": "looking4sun09", "ReviewID": "UR58397679", "Content": "Beautiful place! Great layout, the rooms were gorgeous, pools amazing!! Loved every part of our stay here.", "Date": "March 12, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "San Diego, California", "Title": "“Great Stay...Been Going for 5 Years”", "Author": "alexsndiego", "ReviewID": "UR57328814", "Content": "We love Canyon Villas! We have been owners for 5 years now and every year we go. We have thought about banking or trading in our weeks but every time we stay here, we love it. The rooms are kept in great condition. They recently upgraded some rooms with flat screens, new carpet, new upholstery and paint. What separates this property from other time shares is the staff. The pool bar staff is outstanding. Matt and Jonalynn provide the best service and always have a smile on their faces. Matt and Jonalynn make our stay in like we are staying with family. The service at the Canyon Villas pool bar exceeds that of the JW. We stopped going to the JW pool bar about 2 years ago. The pool is great. The property also has a mini water park for kids, quiet pool, and steam sauna. The gym was recently upgraded with new cardio equipment. Each cardio equipment now has it own TV and iPod hook up. Front desk staff great. Grounds are kept really clean and integrated with the \"desert\" environment. We always visit the Revive spa at the JW and are always happy with the level of service and professionalism. The spa has great amenities such as wet and dry sauna, indoor jacuzzi, private indoor shower, semi-private outdoor showers, private outdoor sunning area in each gender's locker room. Towels and robes provided. Locker room attendants are quick cleaning up making the locker room immaculate. The spa pool is very relaxing and food at the Spa Bistro is really good also. We had the blackened cod and it was very tasty. We can't imagine a year without vacationing at Canyon Villas!", "Date": "February 28, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Colleyville, Texas", "Title": "“Great value for a 2 bedroom condo”", "Author": "Steveh3Texas", "ReviewID": "UR55648264", "Content": "We are Frog fans and stayed here for the Fiesta Bowl. We got a great deal on the Marriott web site for a 2 bedroom which easily slept the 5 of us. Of course, as renters we did not have a great view out of the window but we didn't expect much. The resort is near the JW Marriott but we didn't use the JW's facilities except my wife used the spa. The pools at the condos are nice and the location is convenient for getting around Scotsdale as well as north Phoenix. My family did a lot of shopping and my wife and I took the trail to the top of Camelback Mountain. All good. We played golf at the TPC Stadium course and at the Marriott's Faldo course. Virtually no one on the Faldo course and very good rates!", "Date": "February 10, 2010"}, {"Ratings": {"Overall": "2.0", "Location": "1"}, "AuthorLocation": "London", "Title": "“Room next to busy highway”", "Author": "Yogibear_10", "ReviewID": "UR55162994", "Content": "We booked this for our last two nights in AZ after a fabulous driving holiday. We had previously had a good experience at the Newport Coast Villas in CA, marred only by the proximity of our room to the highway. We were dismayed to arrive at the Canyon Villas via a very busy road only to find we had been placed in a block overlooking it at the outer reaches of the property - is this company policy for non-timeshare guests? We arrived at dusk and the communal landings/stairways were dark/uninviting and the reception and pool areas were not as well appointed as the Newport Coast property. The receptionist did not seem to understand our concerns although she did, at our request, check availability at the Marriott Desert Ridge - the conference hotel forming part of the same complex -where we spent an enjoyable end to our holiday.", "Date": "February 4, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "PA", "Title": "“Loved this vacation.”", "Author": "DebbieB56", "ReviewID": "UR52413635", "Content": "We have a Marriott timeshare in Orlando, and all the Marriott timeshares we've been to are excellent. Roomy, comfy, well-equipped. What I loved about this one is that you're able to use the JW Marriott resort across the way which is gorgeous! A shuttle runs every 30 minutes to take you over. (It's not a far walk if you can stand the heat.) We loved relaxing in the lazy river and playing in the pools. We went horseback riding through the desert while we were there and spent two days going to the Grand Canyon. (Research this ahead of time--we didn't and stayed at a \"resort\" which was awful. Since it was only for one night, I busted out laughing, it was so bad. If it had been for longer, we would have gone elsewhere.) Having never been to AZ, we loved seeing desert and the Grand Canyon and thought being able to use the resort made this a great value. I would have given it 5 stars for cleanliness, as it appeared spotless, but one night I saw a roach in the bathroom. Eeek! Maybe that's normal for hot climates, but not for a northern city girl. Still, I'd go back. It would be a great Girls Trip with the Spa at the JW.", "Date": "January 2, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "California", "Title": "“Alittle bit of paradise”", "Author": "MGD828", "ReviewID": "UR51820924", "Content": "Stayed for a week and had a great time with the kids. Yes you can swim in December in Phoenix. The Villas were nice, very comfortable, with a great kitchen. If you want more in the way of activities and expenses you can use the J W Marriott across the street. The drinks were twice the price but the lazy river and other pools were great.", "Date": "December 24, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Atlanta, Georgia", "Title": "“THE PLACE TO BE FOR VACATION WITH FAMILY”", "Author": "Chefsaba", "ReviewID": "UR50223072", "Content": "AWSOME AWSOME AWSOME RESORT. The rooms were great, the pool was wonderful and the staff did everything to take care of all of our requests such as rooms in the same building and on the top floor. If you are looking for a great family vacation, Marriott Canyon should be on the top of your list.", "Date": "November 28, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "4", "Location": "3", "Rooms": "3"}, "AuthorLocation": "Oakland, CA", "Title": "“So-so”", "Author": "OaklandJeff", "ReviewID": "UR49240254", "Content": "We stayed at the Marriott Canyon Villas for a week as part of a group of several families with young children. Our experience was mixed. Pros: - Very spacious, attractive, well-appointed suites at reasonable rates. We were able to host a dinner for 8 adults and 6 kids in our suite by using all of the tables and chairs provided. - For kids, there is a small playground, a shallow splash pool, and a large 3.5-foot-deep pool at the resort. - Access to the JW Marriott next door (long walk or short drive) with its \"lazy river\" pool, Roy's restaurant, and very attractive grounds. - Big shopping center across the street has a supermarket, Target, and many other shops and restaurants. - Half an hour drive away from downtown Phoenix and the airport, museums, zoo, Desert Botanical Garden, etc. Cons: - The buildings are very densely packed on the property. The 3300 building, where we stayed, is very close to a busy four-lane road. Most of the time we couldn't hear the noise inside our suite, but when we stepped outside it was very noticeable. As I walked from one building to another or to the pools, I was very aware of the housing development just a few dozen yards away, and of the fairly massive resort buildings packed fairly close together. The net result for me was that it was missing that \"away from it all\" feeling that I typically get in a high-end resort. - I could not get the climate control to work correctly. I like to keep the fan on to keep the air circulating. In both of our rooms, if the fan was on, so was the AC, and the room kept getting colder. In other words, there was no way to run the fan without also cooling the room. Eventually it would get too cold (much colder than the thermostat was set for, and the only solution was to switch the unit off. - There were bright spots (engineering was super prompt and helpful when we had some minor issues with the rooms), but overall service was mediocre. As one example, two days in a row the supply of towels at the main pool ran out. I can see this happening once, but twice in a row indicates someone's not trained or not doing their job. - The playground and splash pool are far from the main pool. So if you have toddlers on the playground or in the splash pool, and other kids or adults in the main pool, the groups are not going to be interacting.", "Date": "November 15, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Regina, Saskatchewan", "Title": "“Very nice, not quite great”", "Author": "Nate-7", "ReviewID": "UR48652036", "Content": "Our family of 4 travelled to the Marriott Canyon Villas for a one week stay in mid-October. We had a 1 bedroom with a full kitchen, dining room and living room. The resort accommodated my request (left a voice mail message a week before our arrival) to have a top floor room. We enjoyed the top floor room as there was no noise from 'loud walkers' up above. However, the balcony for our room overlooked a rather boring courtyard and faced another set of villas so there was no real view and little privacy. The villa itself was very nicely laid out and we had plenty of room for 2 adults and 2 young childre. The villa was well stocked, was clean, and everything was in working order. We only spent 1 day at the villa pools and our kids were bored because there was no waterslide or lazy river. Therefore, we spent the other days at the JW Marriott across the road (it is easy walking distance for adults but the kids complained about the long walk so we generally took the free shuttle bus back and forth between the JW and the Canyon Villas). The shuttle ran on time and the drivers were courteous. The JW resort is beautiful and has a few very nice pools with something for everyone including families as there is a very nice area to lay out in reclining chairs and be able to watch your kids on the waterslide. We did not eat at the villas pool restaurant but we did eat a few times at the JW pools (wait staff comes around frequently to ask if you need anything). The food was average and prices were reasonable for a resort of this caliber. I would sum it up by saying that the villa was beautiful but the Canyon Villas Resort lacks a little bit as far as kids activities go, and their Marriott Marketplace is the size of closet with no supplies so be prepared to go off-site for a lot of things. We stayed at the Westin Kierland villas in May 2009 and would rate the Kierland 1 star higher than the Marriott. The rooms are very similar, but the Westin Kierland Villas pool area, gym, marketplace, etc, all have a more upscale feel to it. If the Kierland Villas are not available the next time we visit Phoenix, then we would still gladly stay at the Marriott Canyon Villas, however, the Kierland Villas would be our first choice if it was available.", "Date": "November 6, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Location": "4", "Rooms": "4"}, "AuthorLocation": "Texas", "Title": "“Nice pool area and comfy beds.”", "Author": "TexasAngel63", "ReviewID": "UR48204972", "Content": "We stayed here for 3 nights. Our balcony looked over the pool area. It had a nice waterfall feature. It was a bit cold to swim for my tastes, but it was nice to lay out on one of the many chairs they had there. The beds were very comfortable. We never ate on the property or at the JW Marriott which is adjoining the Villas because the food was pretty pricey. The room we stayed in had a microwave, fridge, sink, and dishes. It was very nice. I loved sitting out on the balcony every morning watching the sun rise over the mountains.", "Date": "October 31, 2009"}, {"Ratings": {"Service": "2", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Location": "4", "Rooms": "4"}, "AuthorLocation": "Michigan", "Title": "“Great location, nice place, not good enough to buy”", "Author": "sparklesque", "ReviewID": "UR47838149", "Content": "We stayed in a lock-off unit (no full kitchen), and it was fine for two people. I'm glad I didn't trade my Maui unit for this place though, because it wouldn't be worth it. My first big beef with this place was that as soon as I walked in, there was no hotel book in the whole room. By hotel book, I mean the book that gives a map of the hotel, the amenities, the TV channel list, restaurants on-site and in the area, etc. I called the front and asked where it was, and they said they were in process of printing new ones. Not a good excuse. Also, there was no Where magazine in the room, just a permanent hard copy version of the weekly magazine, which is very cheap. I found out at the JW hotel guests though were given a copy of the weekly Where magazine though- the villa guests are not good enough I guess to get this. The vacation club villas were a good 14 minute walk to the main JW Marriott hotel, since our villa was the farthest from the central area. Although I don't mind walking, I found the walkways to be awkward and disjointed, and there were no signs on how to get to the JW. The lighting between the 2 resorts was truly awful- way too dark to be considered safe. There was no \"welcome owners\" reception, and the activities at the JW were not readily shared with the villa guests. I found out at the JW about a nature walk given on Saturdays at the hotel, and I'm glad I went (it was great), but this wasn't advertised at the villas section. The market pantry was poorly stocked and pretty pathetic, with no decent magazines. Our TV turned itself on and off mysteriously (I think it had a broken touch sensor), and after I told the front desk, she said someone would come and look at it. Nobody ever came. No room tidying was ever done, so I can't speak of the housekeeping. The location was very good, but the resort just isn't good enough to be a true destination. The JW however was very nice, but I felt so separated from it with the lack of signs and lighting. The villa guests seem second rate to the hotel, and I would never buy one of the villas. The shuttle that ran between the two resorts was never useful for us, since I didn't want to stand and wait when I could just walk and get there faster. The spa was excellent and the on-site hotel restaurants were very good. I loved how they had cold water available all around the hotel, villas, and pools. The resort was very nice, with comfy beds, good towels, etc...everything you expect from Marriott. The flair was all at the JW however, but the main pool section at the villas was a good size and had a fun waterfall in the center of the pool. We saw tons of rabbits on the grounds, which was cute, and some interesting birds. We hiked up Camelback Mountain, which was awesome, and I would highly recommend it. It is was strenous though, and you need to be adventurous to do it. We ate the the breakfast restaurant at the JW and at Roys also, they were very good. The villas has no restaurant, but there is a shack at the pool area that serves typical fried food wonders. I though the Phoenix area was wonderful, with a great climate, and beautiful scenery. There are lots of day hikes to do, so it was hard to choose just one due to our time contraints. The airport was only about 20 minutes aways and we didn't encounter any big traffic tie ups. Of the JW wasn't there, this place would be sooo boring.", "Date": "October 26, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Texas", "Title": "“Marriott Canyon Villas - great experience!”", "Author": "chris44Texas", "ReviewID": "UR46380846", "Content": "We recently stayed at the Marriott Canyon Villas for 3 nights so we could go see the Grand Canyon from there. My mom, 11-year-old daughter, and I stayed in a two bedroom unit, and it was fabulous! The units are furnished very nicely, large flat screen TV's in the living room and both bedrooms, beautiful landscaping throughout the resort, etc. We did go over to the JW Marriott next door to visit the pool and lazy river. The JW is lavish both inside and out, landscaping is fantastic, and there are several ducks wandering around outside - very cute. However, we didn't feel the need to go back again to its pool & lazy river. ( We don't care for lazy rivers where water squirts on your head a few times as you go around.) We actually found it to be more enjoyable at the pool at the Villas. The only drawback to the pool at the Villas is that there is no shade where you have to stand in line to get food and drinks at the pool bar - also no mat to stand on, so if you're in bare feet on the hot concrete, watch out! Another great thing about the JW next door is that we ate at Roy's Hawaiian. I'm a big fan of this restaurant (have eaten previously at the one in Philadelphia), so I made reservations. It happened to be Restaurant Week in Phoenix, so we got a 3-course meal for $29! And most of the seating is outside with wonderful landscaping and tiki torches, so the atmosphere is just wonderful. OK, back to the Villas - not only did we enjoy the condo itself, we also enjoyed going out in the morning just beyond our patio to a large paved area with a waterfall, foliage, gas grills, tables & chairs, and a playground with a slide, which is formed as the tail of a gigantic lizard (or gecko??). There are even pails and shovels in case the kids want to play in the \"sand\" (it doesn't look like beach sand, but it's sandy-ish). We didn't have a lot of interaction with staff, but they were very responsive if I had a question or needed anything. We had a lightbulb out, and they replaced it within minutes. As previous posters have said, the Desert Ridge Marketplace is very close and has tons of restaurants, shops, movie theater, gas station, etc. - also an Alberton's grocery store so you can stock your fridge. (You can look at website for Desert Ridge Marketplace to see what shops it has.) We don't cook on vacation, but we always get soft drinks, snacks, and breakfast items - we use just the fridge and microwave. Oh and we also used the coffee maker, but we didn't particularly care for the complimentary Yuban coffee - but it was nice that they provided it. Also, daily maid service was provided at no extra charge like at some timeshares. I know there's also a little market shop in the lobby of Villas, but we weren't there long enough to use it, so I can't speak to what it carries. We really enjoyed the covered parking at the villas - keeps your car much cooler. No charge for parking, and there seemed to be plenty of it. The villas were actually pretty full when we were there, even though it was after all kids had gone back to school. They said it was because JW was full and Villas were taking overflow. But it didn't seem crowded at the pool, parking, etc. We enjoyed the misters at the pool, water basketball, and the games around the pool area - air hockey, ping pong, billiards, and the big checkers/chess board on the deck. On this visit, we took the 1-day tour to Grand Canyon with Detours. They picked us up at Villas at 7:30 a.m. and we returned about 9:15 p.m. (a litte behind schedule, not due to anyone's fault). It was a very informative tour, and we even decided to do the optional helicopter tour with Maverick Helicopters at the Grand Canyon. You can get more info at Detours website. We also visited the Heard Museum, which is very nice (AAA has a small discount for this museum). We had lunch at their outdoor cafe - wonderful food and very nice little courtyard area. You can view the menu at the website for Heard Museum. One last bit of info - there's not really a convenient place to get gas close to the airport, but you can gas up your rental car at the Shell station at Desert Ridge Marketplace, and your tank will still show \"full\" when you return it at airport. Try renting from National - that's where I found the best deals because you can stack contract ID's and coupons. I always get my travel info at Tripadvisor, and I hope this info I've posted will be helpful to you!", "Date": "October 9, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Location": "4", "Rooms": "5"}, "AuthorLocation": "Gloucester, VA", "Title": "“Very Nice Stay”", "Author": "granstra", "ReviewID": "UR46207086", "Content": "We stayed at the Canyon Villas timeshares in Sep 2009. The room that we occupied was a 1 bedroom unit. It was very spacious and very clean. It served our needs perfectly! One of the benefits that you get is being able to use the facilities at the neighboring J.W. Marriott Resort. The pools there were some of the best that I have had the pleasure of using. The fitness center is superb. Overall this was a great stay!", "Date": "October 8, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "NJ", "Title": "“RELAXING AND SERENE - Sept. 19 - 26, 2009”", "Author": "Tranquillo", "ReviewID": "UR44997913", "Content": "The Marriott Canyon Villas was a lovely resort in a serene setting and in an ideal location close to Interstate 101 and Tatum Road. There is a small shopping center across the way called Desert Ridge which also has an AMC Movie Theater and a few restaurants as well as Albertson's grocery store, a Ross Department Store, Marshall's and a Homegoods. There is an abundance of restaurants in Arizona. One of our favorites was Pita Jungle (for healthy meals) and RA Sushi located in Kierland as well as downtown Scottsdale which runs a box special lunch for $9. and a happy hour from 3 - 7 with 1/2 price drinks and appetizers. We went to Sassi Restaurant (upscale) which was very good but expensive. The pool areas are lovely, not too crowded and some areas also have misters to keep you cool. There is a complimentary shuttle every 20 minutes to take you to the JW Marriott Desert Ridge where you can enjoy the busy 2 story lobby, spa, pools and Lazy RIver. Although the Lazy RIver was not crowded when we were there, the lobby was extremely busy with people coming and going as well as many conventions and meetings going on so it seemed noisy. We really enjoyed the spaciousness of the Canyon Villas with a fully equipped kitchen that also had a hidden washer and dryer (so we were able to pack lightly), a nice size dining area, a large living room with a LG flat screen TV, a small and private balcony and a large master bedroom with comfortable King Marriott bed as well as another flat screen TV, a sink and tub off the bedroom and a bath with a large shower and another sink. We were in the 2800 building on the 3rd floor which was extremely convenient to the front lobby, exercise/weight room and pool area. Another nice feature they had was covered parking which is nice in the Arizona heat. It was 105 degrees during the day with no humidity but the inside of the car does get hot. We saved $200 by renting a car from Hertz and picking it up directly at the hotel vs. the airport. There is a Hertz right at the JW Desert..", "Date": "September 27, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Iowa", "Title": "“Great”", "Author": "hays5216", "ReviewID": "UR43883807", "Content": "We spent four days here and loved every day of it. Our only issue was not enough hot water but that was quickly fixed by the staff. We enjoyed this so much we ended up purchasing a time share at the Villas. Hope to get back soon.", "Date": "September 23, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "NYC", "Title": "“Another Marriott's Best”", "Author": "Mai-ImIt", "ReviewID": "UR42865234", "Content": "Located near shopping mall and 101 Interstate Hwy, this resort is a great place to cool off from the heavy heat of AZ. When it's one of the best, I have few words because I just want to take advantage of what they offer - and that's dependability. I know my stay will be simply what I expected - wonderful.", "Date": "September 19, 2009"}, {"Ratings": {"Service": "1", "Cleanliness": "2", "Overall": "2.0", "Value": "4", "Location": "4", "Rooms": "3"}, "AuthorLocation": "md", "Title": "“Not A Restful Stay”", "Author": "iamloved", "ReviewID": "UR40103449", "Content": "I travel quite a bit and this was one of the worst hotel stays that I've had in recent memory. I could not get any rest and I was tired throughout much of my stay. Much of it had to do with the fact that the people in the room above me were incredibly loud. I couldn't tell if the floors/walls were thin or if the other people were that loud. They made loud bumping and thumping noises throughout the day and into the night. It was as if they were playing football or basketball in the room. I made repeated calls to the front desk, but they were not helpful. The maid service was terrible. It got a little worse each day. I called the front desk on the day when she came in & didn't dump the trash, leave clean facial cloths, wash the tub, leave toiletries, etc. I didn't have a room with a full kitchen. I was in a standard room with a microwave, small fridge, and dishes. The room was small and the quarters were fairly cramped. I had been here for a few days and the sheets clearly needed to be changed. When I complained to the front desk they told me that since it was a timeshare they didn't change sheets, but that they would do it. I didn't pay to stay at a timeshare, I paid for a hotel. They have a shuttle to the mall but it only runs for 3 hours in the morning. After that you have to take the shuttle from Canyon Villas to the main hotel & wait from the city shuttle. Waiting for so many shuttles to and from the main hotel in such oppressive heat was unpleasant. Sometimes the Canyon Villas shuttle would just be sitting outside of the JW, but the driver said that he was not allowed to take a few passengers. He had to wait until every 30 minutes even though the ride would have only taken a couple minutes. I would never stay at this hotel if the main event was at the JW because of how much time you spend shuttling and waiting in the heat. Even beyond that, I wouldn't stay because my room was so noisy & asking for assistance from the staff was a waste of time.", "Date": "September 8, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Location": "5", "Rooms": "5"}, "AuthorLocation": "LOS ANGELES, CA", "Title": "“Nice Relaxing Vacation at Marriott's Canyon Villas”", "Author": "ASK2005", "ReviewID": "UR39870675", "Content": "We are on our final day of our week-long stay at Marriott's Canyon Villas. We really enjoyed the resort which has nice size units and great pools. Guests can also take advantage of the facilities at the JW Marriott at Desert Ridge (right next door) which has a really fun and relaxing lazy river pool which we all just loved. The other pools are just a nice and the restaurants are really good too. There is great shopping in the area and a complimentary shuttle bus that goes to the local shopping center. Overall a nice vacation.", "Date": "September 5, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Beckley, WV", "Title": "“Wonderful accommodations!”", "Author": "Doone8253", "ReviewID": "UR37862342", "Content": "I was in Phoenix for a conference at the JW Marriott Desert Ridge Resort where I stayed 4 nights. I then left and went to the Grand Canyon and stayed in Sedona before returning to Phoenix to fly back home. I stayed one night at the Canyon Villas. I wish I had stayed EVERY night at Canyon Villas. I had a one bedroom villa and it was beautiful. Granite countertops in the full kitchen, washer & dryer were full size as well. The bedroom was a nice size with a nice, large television. Beside the bedroom was a soaking tub and separate vanity/sink that connected to the bathroom that had a large shower, another vanity, etc. The villa was clean, comfortable and very roomy. If people don't mind sharing a bed, 4 people could comfortably sleep in the one bedroom that has a king bed and queen sofabed. We used the pool as well and loved it. In that intense Phoenix heat, I was comfortable lying in a lounge chair in the sun with the misters just above me to keep me cool. There were quite a few families at the pool but it was still very nice and relaxing. For those who want \"more\" to do, guests of the Canyon Villas have access to the JW Marriott Desert Ridge spa and pools, as well. There is a shuttle that will take you back and forth, but you can also park on your own there. But, self-parking is a long way from the main hotel. Additionally, the parking was covered which kept the car from feeling like an oven when we got in. If I ever go back to Phoenix, I will definitely stay at the Canyon Villas. It was wonderful.", "Date": "August 16, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "5.0", "Value": "4", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Gibsonia, PA", "Title": "“Very relaxing and not crowded”", "Author": "PAHoosiers", "ReviewID": "UR35622857", "Content": "Having vacationed 3 times at the Marriot Aruba Surf Club, we were expecting a packed pool and lobby. Nothing can be further from the truth. Every day, we could get poolside chairs no matter what time we arrived. In addition, the pool volleyball and basketball, and the poolside ping pong and pool was awesome for our kids. Only downside is that its HOT here this time of year. :-)", "Date": "July 23, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Location": "4", "Rooms": "4"}, "AuthorLocation": "Taipei, Taiwan", "Title": "“Resort nice, restaurants leave something to be desired”", "Author": "abenti", "ReviewID": "UR35573565", "Content": "We stayed at Canyon Villas in July 2009 for our 10th anniversary in a king studio. The resort was nice. Pools are great. People were helpful. Love that you also have access to all the JW Marriott amenities. The restaurants at the JW were not as good as the rest of the resort. We went off property to local places after the first day. Great pools for kids and adults. We would return!", "Date": "July 23, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Chicago", "Title": "“Great resort for families, with access to the JW Marriott for couples”", "Author": "Melroseman2003", "ReviewID": "UR35428386", "Content": "This property is first-class, not Four Seasons over-the-top luxury, but comfortable and very well done purpose-built timeshare property. Free internet is a nice touch. We stayed in a studio lock-off with limited kitchen facilities, but the small fridge, microwave, toaster and blender, along with plates, silverware, an array of glasses is plenty for most travelers. Pools and hot-tubs are scattered around the property, and several new stainless-steel grills are available for guests to use. There is a \"market \" on the property that stocks some essentials and DVDs for $1.00. If you'd rather not eat in the unit or cook on the grills there are almost unlimited dining opportunities within minutes. And shopping is plentiful in Phoenix and Scottsdale. For golfers, the area is nirvana. But the real plus is the access to the JW Marriott across the road and golf course. there is a shuttle to the JW every half-hour, and the pools, spa, and restaurants at the JW are great, including a Roy's and an excellent Italian restaurant, Tuscany. It's like staying at the JW. Canyon Villas is great for families, an the access to the JW makes it a great place for single and couples as well.", "Date": "July 21, 2009"}, {"Ratings": {"Cleanliness": "5", "Overall": "4.0", "Value": "4", "Service": "5", "Location": "5"}, "AuthorLocation": "Albuquerque, New Mexico", "Title": "“The best of both worlds”", "Author": "travelrusNewMexico", "ReviewID": "UR31910099", "Content": "This was a great place to come. I and my 2 year old had to go it alone...but met a friend and had the friend stay in a two bedroom resort. It was beautifully decorated and the beds...oh how wonderful to stay in a Marriott Bed. Anyways, the people were very helpful, the kiddie pool was perfect so I could sun bathe while my two year old played in the water. There were wonderful shopping areas within a mile, great restaurants, another fun pool and to top it off we were able to shuttle over to the JW Marriott and use their lazy river and other amenities. It was perfect. I did not have high hopes just us two going, but it turned out to be perfect. I will be returning for sure! Only difficult thing is other than swimming, there is really not a lot to offer young children in Phoenix.", "Date": "June 9, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Location": "4", "Rooms": "3"}, "AuthorLocation": "MizzRita", "Title": "“One bedroom suite ok, grounds not very appealing”", "Author": "MizzRita", "ReviewID": "UR31900970", "Content": "The one bedroom suite was roomy and typical of a Marriott vacation club suite. However, the grounds were not very appealing. There is a shuttle bus to the JW Marriott and Desert Ridge Shopping Center. The location is great but a car is needed for other than the shuttle bus service. Would probably not go back.", "Date": "June 8, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Charlotte, North Carolina", "Title": "“Perfect Vacation”", "Author": "cksmith1997", "ReviewID": "UR30488000", "Content": "We just returned from a week at the Resort, we loved everything about it. The location is wonderful, close to everything. The staff at the resort are first class all the way, friendly, helpful and fun. The Villa we had (3003) could not have been better. Could not say one bad thing about the Resort. We can not wait to go back and we have told everyone we know how great our trip was especially Canyon Villas.", "Date": "May 21, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Munster, IN", "Title": "“sunny and happiness”", "Author": "anyaMunster", "ReviewID": "UR29673467", "Content": "Yes, we titled it sunny, as it was everyday and happiness, because you just feel happy while you are in that area of the US. My husband and I (just shy of our 40's) traveled, as guests with my parents to the villas. They had the main room with the kitchen and living area and we had the \"lockout\" second bedroom. Everyone has commented on the cleanliness of the villas and we concur! Loved having our own balcony, fridge and microwave in our unit., as well as the separate entrance. Pool area at the villas are nice, however, don't sit by the gated entrances, as the gates slam quite loudly all day long with people running in and out of the area. They really need to change this in the very near future! Also, would be nice to have drink service while you lounge...they don't. But is not a hike at all over to the outdoor bar. See Kelsey, she is awesome!! Must go to the JW Marriott pools!! Property is gorgeous with impeccably groomed landscape, huge palm trees and little streams running everywhere. Pools are quite nice and most lounge chairs have a red flag that you can raise for service~~ excellent. Their sandwiches by the pool are fantastic and only around $12. Domestic beer $4.50 and imports $5.50. Mixed fun drinks are around $9. Order the Waterslide Splash~~ smirnoff raspberry vodka and Citron vodka, Chambord, cranberry juice and lemonade. Lazy river is free and quite nice. As others have written, we did have a problem with our key for the pool, but the front desk at the JW was more than helpful to rectify the situation. Did do the 90 minute presentation for the timeshare and was given $100 in Marriott money. 2 tips: One, the presentation went to 3 hours!!! So, be prepared to say no to both the initial person and then the 2nd person they say they are sending in to do the survey. Noooo, she is there is push another type of deal. Anyway, just be firm if you are not interested, although, in all fairness, it IS interesting!! Two, use the $$$ certificates during your stay at the restaurants or spa. We tried to use them at checkout because we had $400 in food bills and they would not accept them! Thank you to George, at the front desk who tried for us! My Father had to hammer it all out with the sales staff the next day, but we should have just used them during our stay. Did not use the spa, although I did walk in to check it out. Very nice. Numerous restaurants at the JW Marriott. We ate at Roy's, Meritage Steakhouse. Both very good. Prime rib is smoked at Meritage, so if you don't like it smoked (like myself), then order with caution. All others enjoyed their selections. Oh yes, choose the prime rib sliders( three of them) which is a $15 appetizer! So worth it and you won't need an entree! After dinner sit on the outside patio, with the guy playing the guitar, tiki torches lightly burning over at Roy's, palm trees lit with white/lavendar lights and the grassy area with flowers encircling it. See--happiness!! We also went over the the MacDonald Ranch and went horseback riding for an hour ~~ I believe it was only $40 per person. Our young authentic cowboy, Colt, was very nice and grew up w/ horses. They also recommend the moonlight trail ride which we were going to do, but I chickened out thinking bugs would get me. He said it is one of the best rides. My horse, Azul, was so gentle, a 5 year old could have ridden him!! Please tip the wrangler, as he was SO grateful! And as numerous others have written, the Canyon Villa bus is excellent to transport you to various locations. Abundant choices of restaurants close by as well.", "Date": "May 9, 2009"}, {"Ratings": {"Service": "1", "Cleanliness": "4", "Overall": "2.0", "Value": "1", "Location": "3", "Rooms": "1"}, "AuthorLocation": "Indianapolis,IN", "Title": "“Don't stay in room 3331”", "Author": "Caitie02", "ReviewID": "UR27931221", "Content": "We just returned from our trip to the Canyon Villas. We were put in room 3331 which is feet away from a six lane highway intersection. The highway noise was so loud we could hardly hear each other talk. I felt like I was staying at a motor lodge, not at a vacation resort. At night you could hear trucks and motorcycles rolling by. We asked to switch rooms, and were given a bit of a run around at the front desk, and eventually told they did not have any rooms to move us to. The block of buildings we stayed in had a small wading pool nearby which was about 1 1/2 feet deep, but my kids got bored easily with that. That meant having to drive to the pool at the canyon villas or drive over to the JW Marriott. If you go to the JW Marriott pool, be prepared, you will have to park far from the front entrance and it is quite a hike back to the pool. There are shuttle busses, but because of our building location we had to drive to the bus stop anyway. I think that if you stayed in several of the other buildings you might be able to walk to the canyon villa pool, but if you are in the outer building near the highway you will need to drive. We also experienced some disatisfaction with the desk clerks. I called 7 or 8 times down to the lobby, and the phone had to ring 10-12 times before someone answered, or there was no answer at all. I am sure it was a busy weekend, so perhaps that is the reason for the slow responses. But they were unable to help us with even the simplest questions, and then told us they would call us back with an answer and never did. We also had problems when we checked out with the kids club charges not hitting up, and an issue surrounding the use of our Marriott gift card. We have checked out of the hotel and I have made six or seven calls and am still working to get this resolved. My kids loved the kids club at the JW Marriott. There is also a mall right across the street. We had pouring rain during one of the days during our vacation, and it was nice to have it as an option to go across the street to the movies.", "Date": "April 13, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "slc ut", "Title": "“Great relaxing stay for everyone”", "Author": "vacationsamany", "ReviewID": "UR26261648", "Content": "This is a great resort for all ages! Great pool area, they even have a kid pool for ages 2-10 that is fantastic. Rooms are large, clean and supplied with anything you need for a great stay. J.W. Marriott is right there, you can use the pool or any of the services while you stay. J.W. has a 5 acre pool area that is alot of fun, lazy river and 4 other pools to hang out by. The food at the pool was good and not over priced. This property has a open feel that you just don't see these days with the price of construction. Shuttle takes you to and from JW as well as the mall across the street. The mall area is a good place to have dinner, shop it even has a grocery store (Albertsons). The Keg restraunt was the best meal for us at the mall. All ages will enjoy this property!", "Date": "March 16, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Location": "4", "Rooms": "5"}, "AuthorLocation": "Solon, IA", "Title": "“Loved it!”", "Author": "ptsueb", "ReviewID": "UR26228363", "Content": "We loved our stay here! We had a two bedroom villa which had comfortable beds, well-appointed kitchen and furniture, high-speed internet, great pools/hot tubs. The kids loved it. We also had access to the 5-star sister hotel, within walking distance, which had a lazy river. There were other activities for kids including a pool table, \"big chess\" game. One night (Monday) of entertainment with a singing cowboy. Very close to a large mall with shopping and lots of restaurants. This facility borders a nice golf course, too.", "Date": "March 15, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Location": "4", "Rooms": "4"}, "AuthorLocation": "Buffalo, N.Y.", "Title": "“Wonderful time!”", "Author": "AlisonBuffalo", "ReviewID": "UR25776616", "Content": "We visited the Marriott's Canyon Villa's from Feb.26th-Mar.2,2009. We had a nice room. The hotel was extremely clean. the beds great. There was a safe, microwave and refrigerator in the room. The hotel staff was very helpful, especially Heather, the concierge ,who helped book my tour. I especially liked the pools. You could also use the pools at the nearby JW Marriott which were awesome. We went on a wonderful tour with DETOURS (they pick you up at the hotel) to the Grand Canyon and Sedona. I would highly recommend this tour if you are in Arizona for only a few days. Go to Talisien West ,Old Town Scottsdale and the Cactus Botannical Gardens. The are MANY MALLS and RESTAURANTS near the hotel-mostly chains. I would highly recommend La Fontanella an authentic Italian restaurant on 4231 E. Indian School Road. You really need to rent a car . Everything, except the malls , is far away.", "Date": "March 7, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "4", "Rooms": "5"}, "AuthorLocation": "Lochem", "Title": "“Home away from Home”", "Author": "WillemIII", "ReviewID": "UR25105546", "Content": "This a really nice resort style hotel, while it also feels like a very luxury apartment complex with spacious rooms, comfortable living room and a well equipped kitchen. We visited the Phoenix area for 5 days and stayed 4 nights in this hotel with a family with 3 teenagers and a baby. The facilities from the JW Marriot Hotel, just half a mile away, are available to hotel guests. The kids really loved the lazy river and the fact that there is a shuttle every 30 minutes. The same shuttle can take you also to the nearby shopping mall and runs every 30 minutes too. The hotel staff is very friendly and the whole atmosphere is like a small community instead of a hotel, yet with the service you expect in a good hotel. The hotel is kept very clean, fires are lit at night and the pool is open from early in the AM until 11PM with many facilities and hot tubs/whirlpools. The service in the rooms even includes switching on the dishwasher, replenishing paper towels as well as the 'normal' hotel services. We had a really great stay in a picture perfect environment with really nice weather 78+ degrees!", "Date": "February 24, 2009"}, {"Ratings": {"Cleanliness": "5", "Business service (e.g., internet access)": "3", "Check in / front desk": "4", "Overall": "4.0", "Value": "3", "Rooms": "5", "Location": "4"}, "AuthorLocation": "New Mexico", "Title": "“Home-like Feeling in Arizona”", "Author": "DestinyNewMexico", "ReviewID": "UR24226319", "Content": "Our family prefers suite/condo style accomodations. The Villas offer a home-like atmosphere -very clean, comfortable and decorated very tastefully. The location was handy - some of the best shopping and restaurants in Phoenix just across the road. We've stayed at the Pointe Hilton resorts and Arizona Grand in the past. These suites are definitely larger and an upgrade in comparison, but with a higher rate. The Villa's pool area is nice, but the Pointe resorts' pool areas were more preferable for our family.", "Date": "February 4, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "3", "Check in / front desk": "5", "Overall": "5.0", "Value": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "The Villages, Florida", "Title": "“Arizona - Yippie Yi Yo”", "Author": "Tbugs", "ReviewID": "UR23913850", "Content": "My wife and I were invited by my sister and bro-in-law to join them at the Marriott Canyon Villas for a week in January. Before I could say \"no\", my wife said \"yes\" so we booked flights on Southwest to Phoenix. The Canyon Villas are about 20 miles northeast of the Phoenix airport and are very easy to find - with the help of bro-in-law's Magellan GPS with the nickname of \"Maggie\". The Desert Ridge shopping center is about a mile from the resort and has every kind of restaurant you could want - from In and Out Burger to microbreweries to high end restaurants. There are also the usual stores like Old Navy, Gap, etc and the all important grocery store (Albertson's) which has a great supply of beer, wine, and liquor. We had a 2 bedroom unit which was perfectly fine. It did not have a great view of anything from the balconies but was very nicely furnished. Marriott has gone away from the glass-topped dining tables because they were just too messy with fingerprints and also with food in the space between the table top and glass. The dining tables are now wood tops and have been \"weathered and distressed\" at the factories so little scratches do not show up from visitors. Good thinkiing! The lockout portion was very nice with a great king size bed, sofa, flat screen television, dressing area, and good sized bathroom. The master bedroom had a very large bathroom, double sinks and whirlpool tub in the dressing area, a king size bed, chairs, and a television. The kitchen had an electric stove, microwave, coffee maker, dishwasher, and good sized refrigerator. The washer and dryer were behind a kitchen louver door and were the only drawback. They were extremely loud when running - so we used them just before leaving for the day. Canyon Villa guests can use the facilities at the JW Marriott resort and the shuttle bus to and from the resort. We really enjoyed the swimming pool at the JW and the Lazy River area. There is a beautiful golf course (expensive at $199 for guests) but we enjoyed walking the cart paths before golfers got out there. The wildlife was great to see. There are lots of rabbits, coveys of quail, several hawks, lots of cactus wrens, and quite a few hummingbirds to see every morning on the walks. We used Canyon Villas for a base to explore other areas of Arizona such as Prescott, Jerome, Sedona, Mesa, Scottsdale, and Cave Creek. Be sure to go to the red rock country of Sedona and take the famous Pink Jeep Tours. We did the Broken Arrow Trail tour which is 2 hours of off-road trekking over a trail you could not believe a mountain goat could traverse - but the jeep had no problem. Outstanding views! Attend the 90 minute sales presentation and receive a $100 voucher for Roy's (Hawaiian fusion) at the JW or a $100 American Express gift card. No sales pressure and an excellent meal at Roy's. We ate at some other great places, too. I recommend Las Dos Molinas on Central Avenue for a \"locals\" place which has excellent New Mexico Southwest food (no mild served!) in a casual atmosphere. I recommend reading and packing the AAA Guide for Arizona, taking a good roadmap and a GPS with you to find your way around in an easy way. Enjoy the drives with the views of mountains, arroyos, saguaro cactus, and barrel cactus. This was a very good trip!", "Date": "January 26, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "4.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Englewood, New Jersey", "Title": "“Lovely!”", "Author": "norinice", "ReviewID": "UR21993402", "Content": "This is a really nice place to stay. Well run, clean, beautifully maintained grounds. They must spend a fortune in landscaping alone because the gardens and greenery are superb! The pools are fabulous. Staying here allows you use of the facilities at the JW Marriott which are amazing. A shuttle transports guests between the two hotels all day. There is a large, entertaining mall just down the road with everything you could imagine. The shuttle also transports you there if you like. I had a rental car and prefer to drive myself. The shuttles are nice though and the staff all around treats you like royalty. Very sophisticated. If you have kids this is the place for you for sure. They will spend the whole day in the many, many pools and be happy. My only possible complaints would be (and this isn't the fault of the hotel per se) the complete lack of any interesting food choices in the area. I can only take but so many chain restaurants. Also, there is a shortage of things to do in the evening. The JW has a lounge singer in the cocktail bar which is nice. But there's really nothing going on at night. Drinks are attractive and well made, but pricey. I can't rave enough about the flora and fauna on the grounds. Quail, rabbits, duck, lizards, cacti. I have tons of pictures I'll definately post. This place is gorgeous! The king size bed has quality cotton sheets and is comfy. The rooms are incredibly clean. Get a one or two bedroom for more than one person because they come with a full size kitchen and living area. The studios are tight. Bring your family here. Relax, and enjoy yourself. I'll be back for sure! Thumbs up!", "Date": "November 19, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "ohio", "Title": "“This is the One!”", "Author": "daisy921", "ReviewID": "UR20540255", "Content": "I booked this resort through a getaway from Interval International. I booked a 2-bedroom unit for my husband and me and my sister-in-law and her husband. We arrived early and the clerk was very nice. The unit was a 2-bedroom lock-out so the studio unit was not cleaned but we were able to leave our luggage in the one-bedroom until the studio unit was available. The grocery store and mall was no more than a mile away and easy to access. The resort also have a shuttle bus that will take you the mall (no charge) and to JW Marriott. The Marriott Canyon Villas resort is very clean! The weight room and exercise room are nice but sort of small, which is fine because it was never crowded. Also it is open 24 hours. There are 2 pools at the Marriott Canyon Villas, these are nice but the real treat was the lazy pool at the JW Marriott! We were able to relax to the fullest in the lazy river pool and I really enjoyed the sliding board! All residents at the Marriott Canyon has access to the pools at the JW Marriott Resort. The JW Marriott resort is beautiful! The green grass, tall shady trees and decor is marvelously. The JW Marriott has 4 pools including a nice sprinkler for the little ones. The front desk clerks were exceptionally kind at the Marriott Canyon Villas. They offered to Mapquest anywhere we wanted to visit and made some very good suggestions of activities off the resort. The front desk clerks even offered to print our boarding passes for our return back to Cleveland, Ohio. The Marriott Canyon Villa also had a scheduled sheet for all the activitites on the resort for each day. I would recommend this resort for everyone! I hope to return soon. What a good time we all had! I don't think you could go wrong at this resort even if you are picky! :-)", "Date": "October 1, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "4", "Overall": "5.0", "Value": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Riverbank, California", "Title": "“Fabulous Vacation Experience”", "Author": "Lauriee", "ReviewID": "UR20518977", "Content": "We spent a week at the Canyon Villas during the second week of September. We loved the place. We would have preferred a one bedroom unit and were willing to pay an upgraded price however we were told there was no availability? The studio/lock-off unit was small however sufficed. Check-in was easy and friendly staff. Judy, the Concierge at the Canyon Villas is very helpful and always friendly to visit with. We attended the orientation on Monday morning to hear about tours and things to do in the area. This was very helpful. Glad we attended. We took the Segway Tour and this was sooo much fun. The instructor/guide, Darci, is awesome! Other highlights included our Spa Day at the JW Marriott across the street. This Spa is among the best we have ever experienced, absolutely lovely in every way imaginable. If you visit the Spa, be sure to check out the two Owls that inhabit the palm trees located near the outdoor spa. The dining is fantastic. Kierland Commons has a great Tommy Bahama Cafe and Maestro's Fish and Seafood Restaurant. We never made it to Roy's at the JW, however will visit Roy's Asian Fusion Bistro next time and there is no doubt that there will be a next time. Can't end this review without mentioning the beautiful pools at the JW Marriott. Canyon Villas have nice pools too and a great Lizard Lagoon Pool for the kids.", "Date": "September 30, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Wisconsin", "Title": "“Great Desert Oasis”", "Author": "Chred1", "ReviewID": "UR20514261", "Content": "We traded through Interval International to stay at the Villas. We had a great time. We stayed in the whole two bedroom unit, which was clean and updated. Unfortunately we were near the construction but there was only one time that I even heard any noise. The main pool was great with waterfalls that provided excellent background. The kids pool was a nice touch also, it'll be even better when they add the third pool. The access to the JW was nice. It has the restaurants, more pools, spa, golf. My wife had a massage and was very impressed by the service and facilities. There is a shuttle but we walked every time, it's not far. I walked to the Starbucks every morning. There is also better outdoor seating at the lounge at the JW. The real key is having the shopping so close. We went to the grocery store and Target rather than bringing supplies with us. We have a six month old so that was key. The restaurant choices there are nice also. I'd recommend BJ's Brewhouse for the pizza and the beer. We also made day trips to Sedona and the Grand Canyon, they were long days but worth it. I would definitely recommend this place to anybody, there was a good mix of singles, married no kids, families, retired.", "Date": "September 30, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "4.0", "Value": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Escondido, ca", "Title": "“Relaxing”", "Author": "kthomas2008", "ReviewID": "UR19799063", "Content": "This property is emaculate. The check in service was A+++. They were able to get us the best room available (looking over the main pool & top floor). Note that I did call in this request about 9 months before our arrival. The only thing I found that could use some TLC is the concierge desk... they didnt seem to really want to talk to my boyfriend and I because we were not interested in purchasing a timeshare. Plus it seemed like all of their \"events\" had to do with purchasing a timeshare. I would have enjoyed some other non timeshare sales events: movie night, card night...whatever... without the sales pitch. Anyways the area was fantastic. Nice pools & great views of the AZ sunsets.The property has a shuttle that takes you to the local mall area (many nice places to eat & shop). Our favorite was the Grilled Expedition-- awesome happy hour! We will be back!", "Date": "September 5, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "maryland", "Title": "“wonderful”", "Author": "debt", "ReviewID": "UR18445946", "Content": "We stayed in a 2 bedroom from June 25-July 2 and loved the canyon villas. There is so much room and it was wonderful to have free wireless available. Every morning my husband and I walked over to the JWmarriott for coffee and danish at the Starbucks which opens very early for the golfers. It was a very pleasant walk - we did it about 7am. Even though the days were usually 112 degrees, it really didn't bother us. usually from 2-5 if we weren't in the pool, we either went to the movies at the huge shopping complex nearby or were in room there. we even enjoyed the 2 great hot tubs in all that heat. The bigger pool was cooler than I prefer, probably because of the waterfall, so we used the 'lap' pool that wasn't restricted to laps. I loved looking at mountains in the distance everywhere. One day we went swimming at the marriott as I was excited about the lazy river. our cards didn't work in the gate, but someone was there to let us in and told us the villa cards never work. we got tubes and went around about 5 times and then went back to villa. that very night we got a voice mail saying the next day the tubes would be $10/day for a person! I was very glad we went the day we did. we didn't go back. I really think that is terrible. there were plenty of tubes and people used them when they wanted and then put them back. we had a nice pool at the villas so never went swimming again at the marriott. it was so easy to take our rental car and drive to the villas. the roads are all very easy. the shopping complex is so great- has so many restaurants. we ate there each evening. we also saw 2 movies there. we went to mini golf about 12 minutes away and one day went bowling right when it opened and got fantastic rate per game. we took the morning tour in the desert where we were able to shoot six shooters, potato gun and throw tomahawk. my 17 year old thought that was one of best highlights. we took the whole day detours trip to grand canyon. you go to sedona, see the red rocks, have 30minutes in a shopping area, then off to helicopter spot by grand canyon. all 12 of us in the van did it and it was amazing. little pricey but it was a highlight. then off to the south rim and saw the grand canyon from 3 different locations. breathtaking. on way back we stopped at navajo trading post. long day, but wonderful. we also went to heard museum one day which my husband and son found boring, but I enjoyed. we went to taliesin west one morning- get there when they open and definitely take their umbrella to walk around. it was too expensive for what they offered, but I did enjoy it. I really recommend the villas. the price was so much more reasonable that the hotel, we had so much space and the wireless internet was free.", "Date": "July 31, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Minnesota", "Title": "“Awesome Resort!”", "Author": "nascar9", "ReviewID": "UR18151757", "Content": "We stayed in a two bedroom and absolutely loved this place. Check in was a breeze. The front desk people were very nice. As a matter of fact, all the employees (even the maintenance people) were really friendly. The unit we stayed in was nice sized and clean. It came with a few extra stuff that most timeshare units don't provide. (extra TP, paper towels, coffee filters, porcelain coated pans). We all (2 adults and two kids) loved the pools. There were plenty of chairs available at all times. There is a tiki style bar at the pool that serves drinks and food. Prices are what you can expect from a resort type pool bar. Bar staff were really fun to talk to and gave good advice on what to do in the area. They had live \"Cowboy Music\" on one of the nights that was pretty fun. There are nice gas grills available both near the main building and some near the condo units. There are planned activities for kids and adults you can sign up for. There is a pool table, ping pong table, and a \"life sized\" chess board to use for guests. As mentioned here, the resort has a free shuttle that will take you to the sister property the JW Marriott and a nearby mall. The mall (Desert Marketplace??) has an Albertsons and a Target store as well as other similar stores including bars and restaurants. As a guest at Canyon Villas, you can use the facilities at JW. The pool here is beautiful. They have a fantastic lazy river that we enjoyed. There are staff on site that will bring a pitcher of ice cold water right to where you sit down by the pool. We booked this thru a \"getaway\" on II. We have stayed at numerous timeshare properties and the Canyon Villas was the nicest so far.", "Date": "July 22, 2008"}, {"Ratings": {"Service": "2", "Cleanliness": "4", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "UK", "Title": "“Fantastic scenery”", "Author": "Lindyloo1", "ReviewID": "UR16904592", "Content": "My husband and I arrived at Canyon Villas after a long drive from California. The reception desk was very pleasant and they gave us the keys to the villa and keys to the hotel pool should we wish to use it. Our villa was itself was quite small as it was only an efficiency villa so we didn't have any cooking facilities, we had a comfortable bed and a smallish bathroom. The villa however was clean and quite pleasant, unfortunately the cleaning staff had forgotten to remove coats and trousers that had been left by the people before us and we had to remove these ourselves as nobody came to take them away even though we rang down numerous times and were told somebody was on their way ! The people that owned these coats etc came back for them early evening just before we went out and were fortunate to find us there. When we rang the front desk asking for these to be removed for the fourth time and nobody came we gave up and we thought this was very bad indeed of the staff there. Having said this, we have stayed at the Phoenician in Phoenix and this Resort is a hundred times nicer. However, the whole resort is absolutely fantastic as it is next to the JW Marriott Resort & Spa and you have full use of their facilities. The pools are beautiful, the selection of restaurants are v.good indeed and we went to Roys Asian Cuisine most nights which is situated just at the side of the lounge within the hotel. The hotel is simply beautiful and has every facility imaginable. There is a large Starbucks that opens at 5.30am in order that golfers can grab a coffee and pastry before playing golf as it is 38C by 10.30. We went to Starbucks quite a lot. The most wonderful scenery surrounds this resort and in fact surrounds Phoenix, Scottsdale and Arizona in general and we would love to go back one day as it is a relaxing place to be. The villas are not attractive, there are far better Marriott villas and we can only assume that these were intended to be in keeping with the South Western style. However, the hotel facilities make up for the villas as it is absolutely beautiful.", "Date": "June 13, 2008"}, {"Ratings": {"Service": "2", "Cleanliness": "2", "Check in / front desk": "3", "Overall": "2.0", "Value": "2", "Rooms": "2", "Location": "2"}, "AuthorLocation": "Chicago, Illinois", "Title": "“Not What I Expected”", "Author": "disneyfanandmom", "ReviewID": "UR16778598", "Content": "We stayed at the Marriott Canyon Villas from May 31 to June 6. We checked into the hotel around 11:00am and our room was not ready, which was fine because we had requested a room on the third floor overlooking the pool. However, we came back to check in we were given a second floor room not quite overlooking the pool. However, when I went to fix the kids a snack, the dish area was crawling with ants. I called the front desk and the maintenance man sprayed for the ants. The smelled bothered me and I requested another room. We ended up in building 3300 (the farthest area from the pool) on the first floor looking at the desert (as described, but really some desert plants and a dirt road for the maintenance men.) Our next incident with bugs came after my son took his bath. There was a cockroach behind the toliet. Again the room was sprayed. (Bug season in Arizona is what I was told, haven't had these issues at the Marriott resorts in Florida) I then awoke at 4:00am to use the bathroom and the door was locked. (I closed the door to not smell the spray and the door ended up locking.) Unfortunately, there were no other rooms. During the rest of our visit, we encountered the following items: a missed wake up call, keys that did not work at the JW pool area and an unannouced visit to our room (a request was made for new towels in another room, but our room was changed in error - did not expect someone to entry our room while we were away.) Overall, we enjoyed Arizona. We took the AZ Hummer Tour which was awesome. The best part of the resort was the pool. It would have been nice if an attempt was made to reconcile the issues that we encountered.", "Date": "June 8, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Aurora, Illinois", "Title": "“Loved It”", "Author": "AuroraIL", "ReviewID": "UR15996514", "Content": "WOW! What a timeshare property. I have stayed at a couple of timeshare properties in the past and they have been OK, but nothing like this. I might have to consider purchasing a place here. Before Our Trip: We were contacted by the resort a week prior to checking in to see if there any special requirements that we had. This caught us off guard because we has exchanged through interval to stay here, and we are not even Marriott's owners. We had told them that we would be arriving the morning and they said it would be no problem to drop off our bags at the front desk and get started on our vacation. Check-In: Check-in was a breeze, we arrived about 11am. The guy at the front desk was extremely friendly. Gave us a detailed overview of the Villas and the JW Marriott across the way. Also gave us recommendations of restaurants at the Desert Ridge Marketplace that was close by. He then realized that our room was not ready yet, but checked to see if anything else was available. The was an available room and he let us check-in to that room right away. Room: We were only able to find the efficiency available when we booked on interval, but it was just fine for the two of us. It was just your standard Marriott hotel room that was clean, comfortable, and enough space for the two of us. It did not have a full kitchen, but had a small sink, mini refrigerator, and microwave. If traveling with a family I would recommend at least getting the one bedroom unit. That has more room and a full kitchen and dining area. Pools: I found the pools at both the Canyon Villas and the JW Marriott to be very nice. They were both clean and had plenty of towels to use. I thought the pool at the Canyon Villas was not nearly and busy and cramped at the one at the JW, but the one at the JW did have the benefit of having a lazy river. At the Canyon Villas they gave us a key card to access the pools at the JW. None of them worked, but if you go the the front desk at the JW they will exchange it out for one that will work. All and all it was a fun and relaxing vacation that was further enhanced by the helpful and friendly staff at the Canyon Villas.", "Date": "May 13, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Boston, MA", "Title": "“Loved Marriott Canyon Villas”", "Author": "EastCoastGirl1", "ReviewID": "UR15667175", "Content": "We traded through II into this property. We stayed from April 26th to May 3rd. The weather was perfect - high 80s to high 90s during the day and at night you needed a light sweater. We didn't see one cloud the entire week. The villas are only 20 minutes from the airport - very easy access to the highways. We checked in around 5 pm and the staff were very friendly. We were in unit 2959 (the third floor). The units are very nice and comfortable. The bed was great. We had a walk in shower and jacuzzi tub. The balcony was small .. had a table and 4 chairs, but it was a squeeze. The resort offered a few activities as well as activities at the JW Marriott, where you would walk to or take a shuttle. The shuttle also went to the Desert Ridge Marketplace - plenty of shopping and restaurants as well as an 18 screen movie theatre and a supermarket. They are building a new shopping area (right next to the Marketplace) called City Place that will open in the next few years. It will be a more upscale shopping center with Nordstrom and Bloomingdales. I've been told it will be similar to Kierland Commons (near the Westin Resort). We ate dinner at Kierland Commons twice .. once an italian restaurant called North and at a french bistro called Zinc. Zinc had a nice courtyard room where the roof retracts in nice weather. Both had very good food. We went to the Chart House for dinner one night and had a great meal. Their chocolate soufle was wonderful! We also had dinner at Roys over at the Marriott Hotel - very nice. We had dinner on the patio - it was lit with Tiki Torches and they have a firepit. If you dine there on Friday and Saturday nights, you can hear the music from the band that plays outside on the Marriott patio. The pool areas at both the resort and villas was very nice and kept very clean. My husband golfed every day. He loved that he could get out very early in the morning - just after 6 am. We bought the par n'pamper pass for $500 which entitled us to 5 rounds of golf, 5 spa treatments or a combination of the two. Good deal - especially in the high season months! The spa was the nicest I have seen. It had it's own pool with a jacuzzi and very plush lounge chairs. The spa has it's own restaurant and the two services I received were WONDERFUL! I can't wait to go back. Feel free to email me with any questions.", "Date": "May 5, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Business service (e.g., internet access)": "5", "Check in / front desk": "3", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Upstate, New York", "Title": "“Wonderful Familiy Resort - Vacation”", "Author": "Dawn868", "ReviewID": "UR15051804", "Content": "Timeshare Swap via Interval International - Wonderful family vacation resort with clean villas, pool, playground equipment and all other resort amenities. We stayed in a 1-Bedroom Master Suite that was handicapped accessible - great accommodations for wheelchair/disabled in the bathroom and kitchen for my husband. The shuttle is handicapped accessible for JW Desert Ridge Resort as well as the Marketplace. Great resort activities to keep the family entertained, our 7-Yr old daughter loved the pool selection, and playground, as well as resort activities (Chess/Checkers, Water Balloon Toss, Arts & Crafts, etc). We will definitely return back to the Desert Ridge - after traveling to the West Canyon - welcome vacation resort for rest & relaxation.", "Date": "April 15, 2008"}, {"Ratings": {"Cleanliness": "4", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Kissimmee, Florida", "Title": "“Didn't Want to Leave”", "Author": "fernh", "ReviewID": "UR14992490", "Content": "We are timeshare owners at this property and booked our stay a year ago. This was our first time staying here a full week. We booked the 2 bedroom villa so our grown kids could stay with us. We requested a golf course view, top floor, quiet, away from construction and that is exactly what we got. Check in was easy. We arrived early, around 2:30pm, and our villa wasn't ready but all we had to do later was come back to get our keys. They took our cell phone number so they could call us when it was ready. The staff there is great and always want to help. We took that time to grab a late lunch and stock up on some supplies at Albertson's. The villa itself was exactly as I remembered and the view of the mountains and the golf course was gorgeous. So, were there any problems? Not really, but there were some things I should mention. I love the Marriott pillowtop beds. The master bedroom and the lockoff beds, however, were not that bed type. They were new but fairly hard mattresses. Not uncomfortable at all. I never woke up with a backache. These must be what they use in all of their timeshares as it was the same at one of the Florida properties we stayed in last year. The sofa bed in the living room was another story. The mattress was incredibly thin. The mattress cover and fitted sheet we got from the closet were too big and bunched up. The top sheet had small tears around the hem. Not what I expected from Marriott but my oldest son wasn't bothered that much. Oh, here's one thing that really bothered me. I like to sleep in a totally dark room. The drapes in the master bedroom and the lockoff were fine, they did close all of the way to block out the light. The problem was the smoke detector in all of the rooms. It had very bright blinking lights. They blinked every 3 seconds. It drove me crazy. Same in the living area and the lockoff. You never notice it until you turn the lights out. I never really got used to it. The pool area was nice and only really crowded the first day. Never any problem parking near the villa either. After staying here, it will be very hard to stay in a regular hotel room.", "Date": "April 12, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "4", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Mansfield, TX", "Title": "“Roomy and Relaxing”", "Author": "livewireworld", "ReviewID": "UR12182704", "Content": "Spent a week here on a time share exchange the week before Xmas and enjoyed every minute of it. It was dark when we arrived, but the resort was colorfully decorated for the holidays. Check-in took less than a couple minutes and we were on our way to our 2-bedroom unit for some much needed rest. The suite seemed very new and was spotless. Each bedroom had a king bed, comfortable bedding, and lots of storage space. The main bedroom had a large soaking tub along with a separate large shower. The suite had three flat-screen TV's each with a DVD player. Lots of channels along with a few HBO and Encore channels. The kitchen is functional with full-size frig (there's a small one in the guest bedroom), microwave, full stove & oven, dishwasher, and washer/dryer. They give you enough dishwasher soap, but you'll need your own laundry detergent. A nice touch was a water feature on one of the walls which added to the relaxing ambience. We were on the first floor so we were only steps from our car in the parking lot. The property itself is quite large. To the east (which is the direction our villa faced) is a golf course and the JW Marriott is probably less than one mile away. To the north is some more of the golf course and some desert landscape. To the west over a wall are some homes, but you hardly notice them. To the south, they've begun construction on the next phase of the resort so I would imagine the villas at that end will be somewhat noisy in 2008. The hotel provides a regular shuttle to the JW Marriott and Desert Ridge Marketplace. The small gift shop really has very little in it. There's also a nice pool area with two waterfalls, whirlpool, large scale chess set, outdoor barbecues, playground, grass volleyball court, pool table, and ping pong table. There is something scheduled at the resort every day for every age group so you can choose whatever you might be intrested in. Being so close to the Desert Ridge Marketplace was a big plus. We ate there, shopped groceries there, saw movies there, and did a little last minute holiday shopping. The resort is close to the freeways, but still feels like it's in a very quiet area which was nice. We all really enjoyed our stay and I'd strongly recommend this place.", "Date": "January 1, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "4.0", "Value": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Pontypridd, United Kingdom", "Title": "“Phew!!!!!”", "Author": "WalesHolscrazy", "ReviewID": "UR10014887", "Content": "lbertsons are a 3min drive away. Can't think of anything the supermarket didn't sell, apart from proper baked beans, but then you can never get them in the states! We ate at The Keg, both the steak & the salmon was delicious. We also tried The Bamboo Club - a wide variety of asian dishes on offer. Did not eat at the JW but Roy's looked superb. Very,very hot the entire week but you know before you go so be prepared. Will not be returning - there are too many places out there still to visit, but would recommend both the MCV & Arizona.", "Date": "September 28, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Phoenix, Arizona", "Title": "“This resort is fabulous!!!”", "Author": "Gummybarb", "ReviewID": "UR8703514", "Content": "We have just returned from a week at the Canyon Villas. We had the two bedroom villa and it was absolutely amazing! It was so big that we got lost in it! We can't say enough good things about this property! We loved the fact that it was so close to Desert Ridge Shopping Mall and soon there will be even more shopping called CIty North. We didn't mind the heat (109 degrees) because we were having so much fun. I highly recommend this property to anyone that likes a first class resort!", "Date": "September 12, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Philadelphia, Pennsylvania", "Title": "“Canyon Villas Is Awesome”", "Author": "Philly3", "ReviewID": "UR8688839", "Content": "This property was wonderful. We booked here for 3 nights on short notice because the JW Marriott Desert Ridge was booked. Our villa was beautiful and spacious. Just what we needed at the end of an 11 day vacation in Arizona. We used the shuttle to the JW each day and enjoyed two fantastic days at the pools there. Our 9 year old loved it and we all hated to leave. Lunch by the pool each day was top notch. With access to all the services, restaurants at the JW plus a gorgeous full size condo, we were in heaven. Cocktails with live music outside on the patio was perfect before dinner at Roy's. Who cares if it is 112 degrees? We stayed at the Fairmont Princess for 4 days at the beginning of our vacation before going to Sedona and Grand Canyon. The Princess was great, but a different experience. We actually liked Canyon Villas/JW Marriott Desert Ridge better. Can't wait to go back!", "Date": "September 10, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Whitby, Ontario Canada", "Title": "“Awesome property...SO relaxing!”", "Author": "travel-travel-Dar", "ReviewID": "UR8347787", "Content": "This property is immaculate with a true south-west feel. We stayed in 2 bedroom unit overlooking the pool and found it quiet and scenic. The 3rd floor allows views of the mountains and desert. The Desert Ridge Mall is so close but in the heat it is certainly too far to walk with groceries. Albertsons Groceries has everything. The pool was a good size and we loved the misters. The poolbar/snack bar items were reasonably priced and in fact it was cheaper than any resort pool bar/resturant I have ever been to. Great food for kids and adults alike. We looked at the JW resort and took a spin though the lazy river over at the hotel but found it too busy,crowded and over priced. Stay at the villas for a true vacation. The staff were there when you needed them but certainly let you sit and relax. Bottom line, I'd take my family to visit this resort every year. I'd buy a unit here if I could right now!", "Date": "August 3, 2007"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Business service (e.g., internet access)": "3", "Check in / front desk": "4", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Chicago", "Title": "“Great Resort!!”", "Author": "Diamondgirl", "ReviewID": "UR8096670", "Content": "Great place to stay. We stayed during the week of 6-17/6-24 in a two bedroom villa. Very spacious and everything seemed quite new inside the villa. King bed in each room, the second bedroom is a lock off with its own entrance. The pool area wasn't the biggest but it sure was among the best. Nice waterfalls, great bartender, great drinks and food. JW Marriott just a quick drive away. There is free parking there if you rent a car, also the shuttle service is available. I asked for a certain building (2800) & I received it. Great view of the pool area and the JW Marriott. We have stayed in quite a few Marriott resorts over the years (I do prefer Marriott's) and this is one of the nicest by far.", "Date": "July 10, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "3", "Check in / front desk": "4", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "New York", "Title": "“Loved Canyon Villas”", "Author": "gir7375", "ReviewID": "UR8050675", "Content": "Very pretty resort, great pool and spacious rooms. Great place to relax. Just a short drive to Phoenix.", "Date": "July 3, 2007"}], "HotelInfo": {"Name": "Marriott's Canyon Villas", "HotelURL": "/ShowUserReviews-g31310-d286542-Reviews-Marriott_s_Canyon_Villas-Phoenix_Arizona.html", "Price": "$160 - $503*", "Address": "<address class=\"addressReset\"><span rel=\"v:address\"><span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">5220 E. Marriott Drive</span>, <span class=\"locality\"><span property=\"v:locality\">Phoenix</span>, <span property=\"v:region\">AZ</span> <span property=\"v:postal-code\">85054</span></span> </span></span></address>", "HotelID": "2516188", "ImgURL": "http://media-cdn.tripadvisor.com/media/ProviderThumbnails/dirs/f4/20/f420255db8ee4da8730505b343c17db913large.jpg"}}