{"Reviews": [{"Ratings": {"Service": "3", "Cleanliness": "2", "Overall": "2.0", "Value": "2", "Sleep Quality": "2", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Las Cruces, New Mexico, United States", "Title": "“Average accommodations”", "Author": "Milonguero23", "ReviewID": "UR129062636", "Content": "These are basic accommodations. We booked 2 rooms, one with two queens and one with a king. Both had an unpleasant odor, kind of musty, sickly sweet. I told the person at the desk when we left. And, both had ac units with very loud buzzing and rattling sounds. The noise of the ac units did drown out any other noises, so that was good. Carpet was kind of nasty looking. The bathrooms were nice and clean. There is a convenience store across the street, which is.....convenient. And, it is just two minutes from downtown. That was handy, as we were there to attend a downtown event. Otherwise, pretty basic for the price. But, I guess Phoenix is expensive.", "Date": "April 29, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Minneapolis, Minnesota", "Title": "“Don't always believe what you read.....”", "Author": "Sara J", "ReviewID": "UR127494435", "Content": "We came down to visit family, and my dad called ahead and made revervations. Read reviews online and I was unsure if we should stay here....boy was I wrong!!!!! The rooms Newly remodeled, new owners and staff VERY nice!!! Walt and Brent were AWESOME!!!~ would DEF. stay there again!", "Date": "April 8, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Milwaukee, Wisconsin", "Title": "“Wonderful experience”", "Author": "Michael K", "ReviewID": "UR127489100", "Content": "I've stayed in Super 8's throughout the United States and this is by far the nicest. Clean and comfortable with all the amenities. The staff is friendly, courteous and helpful in every way. We will definitely stay at this hotel again. Mike K.", "Date": "April 8, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "College Station, Texas, United States", "Title": "“No complains”", "Author": "Adrian S", "ReviewID": "UR126331376", "Content": "The staff was very friendly, the facility was clean, very close to down town...overall a great experience, will definitely come back here whenever I need a place to stay en Phoenix!!!", "Date": "March 19, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Texas", "Title": "“SUPER SUPER SUPER 8”", "Author": "Marquesa F", "ReviewID": "UR126191513", "Content": "This Super 8 was by far my best experience at a motel. Walt the owner of the Super 8 was extremely helpful and knowledgeable about the area. The other staff were also so friendly and accommodating. The motel is an easy walk to the heart of downtown Phoenix as well as the rail system. The rooms were extremely clean, comfortable and spacious. Free wifi and free warm breakfast. I would highly recommend this place to anyone!", "Date": "March 16, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Las Colinas, Panama, Panama", "Title": "“You should definitely stay here!”", "Author": "Rachel T", "ReviewID": "UR126153503", "Content": "Not only was this Super 8 very accommodating to our large group of college students but extremely helpful! Walter, the manager, was very knowledgeable of the surrounding area and he definitely pointed us in the right direction for food and fun. He was extremely responsive when we needed help with transportation to the airport. Ohh!! And the rooms were super clean and smelled fresh. Although we experienced long and tiring few days at the conference, we were able to relax and rejuvenate once we got back to our hotel rooms. Slept like a log! You can crank up the air in your room to make it like an igloo too. Above all, best customer experienced I've had at a motel! Great job Walter and staff!", "Date": "March 15, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "College Station, Texas, United States", "Title": "“Super 8 exceeds expectations”", "Author": "Joe H", "ReviewID": "UR126146955", "Content": "I was in Phoenix for a conference this March with 14 other Texas A&M University Architecture students and this Super 8 was our destination for R&R. Walt, the Super 8 owner, went above and beyond to help our group out in any way that he could. on top of the already immaculate facilities and great breakfast, We really felt that we were being taken care of. For instance, our group was interested in taking a tour of a local attraction which was located 45 minutes away from the hotel. Walt offered to go and get a bus and give us a ride out to the attraction at no charge. When he found out the bus was out of commission, he made a few phone calls to find us the next best thing and most cost effective means of travel. I highly recommend this Super 8 to anyone seeking a place to stay in downtown Phoenix. Final tip: have a complimentary waffle (or 2)for breakfast, they will blow your mind.", "Date": "March 15, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Rochester, Minnesota", "Title": "“Very satisfied!”", "Author": "MNMeg", "ReviewID": "UR125897772", "Content": "What more can you ask for at this price?? The rooms were newly remodeled and clean. Short walk to downtown. Friendly staff. Free warm breakfast. My husband and I wanted to experience downtown Phoenix but were on a budget and couldn't spend/waste $250 a night (what other downtown hotels wanted) so for a ~third of the price we stayed here. Glad we did. The hotel manager, Walt, was awesome and very helpful.", "Date": "March 10, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Sierra Vista, Arizona", "Title": "“Pleasant stay at Super 8 right downtown!!”", "Author": "ach2633", "ReviewID": "UR123806513", "Content": "Nice clean rooms with flat screens. A couple blocks from the Convention Center, great value!", "Date": "January 29, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "4", "Sleep Quality": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Yeovil, United Kingdom", "Title": "“Very adequate”", "Author": "peter_somerset_uk", "ReviewID": "UR123241910", "Content": "My wife and I stayed here for 2 nights and found the overall experience adequate. Good price, good room, great location and adequate breakfast. We had one problem with the room, the fridge did not work. I thought the management could have done more by solving the problem other than offering us an alternative room. This would have been a bit inconveniant because we had already un packed all our stuff.", "Date": "January 18, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "3", "Location": "3"}, "AuthorLocation": "South Wales", "Title": "“Not the best but not bad either”", "Author": "Brent L", "ReviewID": "UR121008790", "Content": "Stayed her for total of 2 nights. The hotel is pretty much road touch. A place seemed a bit over noisy during weekend. The rooms were okay. Breakfast definitely need some improving. The parking lot was dated quite a bit. Staff was friendly enough. The internet kept on disconnecting for some reason, it may have been something with my pc but I had used it a few days earlier at some other hotel. Overall stay was okay.", "Date": "November 25, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "4.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Tucson, Arizona", "Title": "“Pleasantly surprised”", "Author": "ArizonaNative50", "ReviewID": "UR115372050", "Content": "We stayed here for two nights while attending the All-Star Game/Home-run Derby, etc... This is an older hotel, however has recently been updated. Our room was spotless, had new carpet, tile, upgraded bath, flat screen tv. Rooms are smaller than some of the newer hotels, however it was large enough for a king bed, chair with foot rest, desk, and entertainement center/dresser. A little weather stripping around the door would maybe help a bit as it appeared a lot of light was coming in which means hot air could get in also! A free breakfast was included with waffles, yogurt, cereal, toast, fruit, juice, coffee. Dining area is small, but very clean and organized. The property has a swimming pool and there is a computer in the Lobby area for use. It is an easy walk to Chase Field, US Airway Center, the light rail, etc.... There is a great authentic Mexican restaurant/bakery about a block away - La Tolteca. Manager/owner, desk personel, & breakfast attendant were wonderful. Very friendly and knew the area in order to recommend things to do and places to eat. This is a simple, but clean motel. It was quiet and comfortable. We will definately stay here again when we come up for anything taking place in the downtown area.", "Date": "July 14, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Medicine Hat, Canada", "Title": "“Would absolutely stay here again next time in Phoenix”", "Author": "jhodges15793", "ReviewID": "UR106290145", "Content": "Great location, close, walking distance to Chase Field for MLB games. Very courteous staff, helpful and polite. Rooms newly remodelled and decorated. Were with a large group attending 2 MLB games, owners laid on extra food for super start breakfast. Would definitely stay they next visit to Phoenix.", "Date": "April 30, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "3", "Overall": "1.0", "Value": "1", "Sleep Quality": "3", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Tucson", "Title": "“Horrible, Rude Manager”", "Author": "mightykale", "ReviewID": "UR97334088", "Content": "One star is far more than they deserve. The owner of the property spent an excessive amount of time barking out reminders of hotel policy, was rude to guests and his staff. The stay here felt more like being in prison with the warden constantly in your face. People in the group that stayed were locked out of the room by management, forced to pay made up fines. The owner ruined the entire experience. If this is how customers are treated, this place won't be around long.", "Date": "February 20, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Montgomery, Alabama", "Title": "“Trip for National Championship”", "Author": "AUJohn2010", "ReviewID": "UR94380558", "Content": "Stayed here Jan. 9 & 10 for the National Championship game--WAR EAGLE--had a great time close to airport--but not 2 close, close to downtown--we used Arizona Pedal cab-(bike carts) back and forth--lots of fun--ate at La Tolteca--walking distance (1 1/2 blocks) wonderful mexican food--all on advise of desk people, who were just great!!!! Katie (very pretty) and all the guys, on all three shifts helped with advise, directions, and wake up calls---Wonderful--they are all GREAT!!-- would stay there again--rooms-- not fancy-- big enough, clean, nice, quiet--would not want anything else-- and for the game it was completely full-- so could have been noisy--breakfast was nice and good also.", "Date": "January 25, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Albuquerque", "Title": "“In the Super 8 Downtown Phoenix, we found some delightful surprises!”", "Author": "weedle11", "ReviewID": "UR91348867", "Content": "When we were planning our trip to the Phoenix area, we were on a modest budget. Therefore, we made reservations at the Super 8 Downtown. When we arrived, we were pleasantly surprised at how close the Super 8 was to the downtown center and especially the Metro Light Rail System. Then, we were warmly welcomed by the staff and General Manager/Owner. When we went to our room, we expected to open the door to a modest motel room. To our surprise, we walked into what semed to be a 4 star-5 star room complete with the following: king bed, luxurious furnishings, refrigerator, microwave, flat-screen tv, and wi-fi internet. When we walked into the bathroom, we felt like we were in motel heaven, complete with: luxurious granite sink countertops and shower walls, a deep tub that was big enough to seat two (comfortably and romantically), hair dryer, iron and ironing board, coffee maker, and some very nice complimentary amenities. The complimentary breakfast, while average, provided everything we needed to start the day. After staying at supposedly \"nicer\" motels and hotels, the quality and price of the Super 8 Downtown Phoenix gave us more than our money's worth and made us feel GREAT! We have already recommended this property to family and friends over the higher-rated competitors just up the street.", "Date": "January 1, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Waterloo, New York", "Title": "“Excellent”", "Author": "kjhoward", "ReviewID": "UR81276375", "Content": "This is the best super 8 ive stayed at by far!!! The rooms are newly renovated and are very modern and comfortable. The price is right, the staff is friendly and very helpful, and the location is very close to the downtown area. I would absolutely stay again and recommend that you do as well!!!", "Date": "September 27, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Brownsville, Texas", "Title": "“Super place and people”", "Author": "wificontent", "ReviewID": "UR62918843", "Content": "A very nice surprise to find a clean, affordable and simple hotel..that has the kindest employees in downtown Phoenix......close to university, museums, etc. Found this place online, and stayed over a week at this location in Phoenix,and frankly the hotel was well maintained, and clearly in transition from old mode..to plans of new.....rennovations. The staff....Walt and Joe were helpful daily, well informed and knowledgeable of local restaurants, bus service, and great out of the way places to eat...Authentic, and straight forward staff.....Location was excellent to rail, bus, restaurants, theatre, and museums without the go home broke price tag. Breakfast was limited, basic..so hopefully this will change. However, I recommend the place, and certainly will return.......", "Date": "May 1, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Victoria, B.C. Canada", "Title": "“Super 8 Motel - Great staff, clean room, excellent price, primo location”", "Author": "mh2010_2", "ReviewID": "UR62038595", "Content": "When you exit the freeway just past chase stadium you will find this friendly Super 8. Don't be dismayed by the miles of ghost motels some quite vintage that you see if you go too far. Just go back to the Super 8 pronto. It's a short walk to the center of town and the light rail and the airport near everything you need at a real price premium. swimming pool and laundry, fridges in room. free parking, ample, not fancy, breakfast but so friendly and helpful. We recommend this place for the budget conscious traveler", "Date": "April 20, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Fairfax", "Title": "“Value at its BEST!”", "Author": "hadfuninaz", "ReviewID": "UR60648742", "Content": "Found this location 8 blocks for the convention center. After reading some of the reviews I was a little worried about booking here. From the moment we arrived until we left we relalized we found a diamond in the desert. Service was as good as it gets. Front desk helped with transportation to the far side of town for a big event making sure we got a fair price for 15 people. A great breakfast everyday. Tips on how the public transportation worked. Great housekeeping servcie. Price was $100 a night cheaper than the other hotels in the area. Wil tell everyone I know about this place.", "Date": "April 7, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "3", "Check in / front desk": "1", "Overall": "2.0", "Value": "2", "Rooms": "2", "Location": "1"}, "AuthorLocation": "San Diego, Ca", "Title": "“I Wouldn't Stay Here”", "Author": "GoDeeGo", "ReviewID": "UR21538295", "Content": "Well my mom wanted to go with us to Phoenix this past weekend, but she was too cheap to stay at the same place we were staying, so i booked this place for her. It was in her price range and not too far from our hotel. When we got to Phoenix, we helped her check in and what not. She's handicap, so she needed some help. The first thing i noticed was that there were almost no food places within walking distance for her to go to. Also, there were no criminal looking people around, but the neighborhood was the type where all the buildings had bars on the windows. I was a little put off by this since my toddler son was to stay with my mom for a couple hours while my husband and I attended a wedding. The you folks working in the lobby were very nice and courteous, but then an older man, who i think was the manager or owner, came from the back to \"help\" the girl at the front desk. She was training. He was rude and gruff, in my opinion. He had a half blind dog with him and every few seconds he would interupt the booking process to yell \"stay!\" at the poor dog. Then we were informed by him that, in addition to the room cost, which was paid through hotels.com, there would be a $100 old on my mom's debit card. He said it may take a \"few days\" to be refunded, but the sign behind him said it could take up to 10 days. By the time I noticed that, he had already done it. Then he told the front desk clerk to put my mom in an upstairs room. I was like, \"she's handicap.\" He was all, \"well there's nothing about that in the reservation\", like i was lying. He reluctantly put her in a downstairs room. Maybe the fact that we were parked in a handicap spot convinced him she was really handicap. We took my mom to the room. To be honest, it wasn't as dirty and ghetto as I thought it would be. It was satisfactory. I'm sure if I would've stuck around long enough I might have found something to eerk me, but my mom seemed content with it, so we moved on. I wouldn't stay there or let her stay there again, though.", "Date": "November 4, 2008"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Business service (e.g., internet access)": "3", "Check in / front desk": "3", "Overall": "3.0", "Value": "4", "Rooms": "3", "Location": "4"}, "AuthorLocation": "footloose50", "Title": "“Good place for the price”", "Author": "footloose50", "ReviewID": "UR18266221", "Content": "This hotel was good for the price. The room was nice enough. Breakfast was minimal, with stale donuts, but you can’t expect much for the price. Try the Mexican restaurant right next door to the hotel. Great food, good prices and nice owners.", "Date": "July 26, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Business service (e.g., internet access)": "4", "Check in / front desk": "4", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Crystal Lake, Illinois", "Title": "“Clean rooms, good location”", "Author": "Cable_Hogue", "ReviewID": "UR18141004", "Content": "Overall a good value for money in the budget range. The rooms were clean and had good amenities for the money. There was a desk! table! and small fridge!!! I don't remember if there was a microwave, as I wasn't paying enough attention. Everything was clean and ready to go when I arrived. The only flaw in the room is that the shower head is really low, so be aware. As a previous reviewer mentioned, this is on a busy street, which has its ups and downs. It is possible to walk to downtown Phoenix, but you won't really want to in the summer. There is a pool here too, but I didn't want to use it while I was there on account of the weather. The management and staff here are friendly and helpful.", "Date": "July 22, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Check in / front desk": "4", "Overall": "3.0", "Value": "3", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Lindsay, CA", "Title": "“Super 8 quality”", "Author": "dperales", "ReviewID": "UR14724766", "Content": "We needed an moderately priced motel in downtown Phoenix within walking distance of USAirways Arena. This Super 8 filled the bill. We stayed 4 nights and the front desk staff was very helpful. It is located on a busy street, so we requested a room in the back. There is a bus stop right across the street which goes directly to downtown Phoenix. We walked to USAirways Arena and it took 25 minutes. It is 15 minutes to the Arizona Center. A Circle K convenience store is directly across the street and there is a wonderful Mexican restaurant right next door. We ate breakfast there every morning and the family that owns it is wonderful! It is a typical Super 8 motel and it had a continental breakfast. Our room was clean and the bathroom was large. We got what we paid for and it was a good trip.", "Date": "April 2, 2008"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Business service (e.g., internet access)": "3", "Check in / front desk": "3", "Overall": "1.0", "Value": "1", "Rooms": "1", "Location": "3"}, "AuthorLocation": "New York", "Title": "“The Worst Hotel in Phoenix !”", "Author": "mrreview55", "ReviewID": "UR7348029", "Content": "This is quite easily the worst hotel we have ever stayed in. Upon arrival we discovered our bed sheets were wrinkled and previously slept in with hair in the sheets. We were also missing a pillow. We called the night manager who seemed uninterested in our issue. He arrived at our room with 2 pillows that smelled from cigarette and tobacco smoke that he took from a smoking room and not from the fresh housekeeping supply. We were also given new bed sheets that we had to put on ourselves. He had no interest in getting housekeeping to the room to re-sheet the bed. When we showed him the wrinkled used sheets he simplied walked off without saying anything. Additionally, there was absolutely no hot water running for the shower. We left a do not disturb sign on our door while we left for a quick breakfast the next morning, only to find upon our return that a maid had let herself inside anyway. When we confronted her in our room and asked her why she was there despite our do not disturb sign, she began talking quickly in Spanish which we do not understand. We went to the pool area and found the chair lounges hadn't been cleaned in years and were black and sticky from all the previous guests laying on them. The pool had dirt and debris floating in the water. This hotel offers coupons for very inexpensive rates, but you and your family are better off sleeping in a tent outside then wasting your hard earned dollars on this low class transient dump they try to pass off as a hotel !!!", "Date": "April 13, 2007"}, {"Ratings": {"Cleanliness": "2", "Overall": "2.0", "Value": "3", "Service": "1", "Rooms": "2"}, "AuthorLocation": "Missouri", "Title": "“Dont cut corners with this one (no frills at its worst)”", "Author": "aussiepete141", "ReviewID": "UR5362094", "Content": "one day is all we stayed at this hotel and we were glad it was only for one day , the rooms smelled bad, staff are helpful but dont have any manners, the pool looked like a green swamp and the television remotes didnt work upon arrival", "Date": "June 19, 2006"}, {"Ratings": {"Overall": "2.0"}, "AuthorLocation": "The moon", "Title": "“Average but slipping”", "Author": "A TripAdvisor Member", "ReviewID": "UR4454003", "Content": "The staff were not that bothered about if I wanted a room or not. Metal bars on the rooms window, view of someones dusty back yard. There is good if overpriced Mexican Cafe next door and a Gas station opposite with a cop standing inside watching all the customers, moonlighting?. The room was largeish but could hear noise from next door, I asked the front desk for a rag for my vehicle instead of using their towels , after turning the TV volume down, he explained they didn't have any and seemed quite suprised they existed. The maid helped me out. No internet but you can reach somone elses from around the center of the carpark. Someone could make a lot of money if it was managed a lot better maybe it's a tax loss or something.", "Date": "February 12, 2006"}, {"Ratings": {"Cleanliness": "2", "Overall": "1.0", "Value": "3", "Service": "1", "Rooms": "2"}, "AuthorLocation": "Las Vegas, NV", "Title": "“Bring your own towels”", "Author": "A TripAdvisor Member", "ReviewID": "UR4356541", "Content": "The hotel itself was not bad for being so close to downtown. A few, \"undesirables,\" in the area, so be sure to lock your vehicle and secure your room. The problem came when I requested a couple of additional towels for my wife and I (they only give two very thin ones and we had to use them for two days) and during a conversation with the front desk I was told the following, \"we don't have any towels, your checking out today anyway so why should we give you additional towels, and we can't just keep replacing the towels in the rooms.\" I was a little shocked and offerred to exchange the towels we had for clean ones and the desk advised, \"I would have to close the office and go wash some and I'm not going to do that.\" Customer service was very poor and unhelpful. The 1-800 number for Super 8 corporate office also advised that each hotel has their own policies and they could not do anything. I would not recommend nor will I ever stay at this hotel again.", "Date": "January 16, 2006"}], "HotelInfo": {"Name": "Super 8 Phoenix Downtown", "HotelURL": "/ShowUserReviews-g31310-d313465-Reviews-Super_8_Phoenix_Downtown-Phoenix_Arizona.html", "Price": "$63 - $96*", "Address": "<address><span rel=\"v:address\"><span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">965 East Van Buren</span>, <span class=\"locality\"><span property=\"v:locality\">Phoenix</span>, <span property=\"v:region\">AZ</span> <span property=\"v:postal-code\">85006</span></span> </span></span></address>", "HotelID": "2516157", "ImgURL": "http://media-cdn.tripadvisor.com/media/ProviderThumbnails/dirs/76/01/7601d74677dd7648f5993d61f5992e363large.jpg"}}