{"Reviews": [{"Ratings": {"Service": "5", "Cleanliness": "3", "Overall": "3.0", "Value": "4", "Sleep Quality": "3", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Auckland", "Title": "“Average, but a great location”", "Author": "Cate_H_74", "ReviewID": "UR128631232", "Content": "We stayed for 3 nights & it was a great place in terms of location, right behind the Hollywood & Highland center, great if you want to be in walking distance of Hollywood. However, the rooms were dated - one of the quilts had holes and burn marks all over it. The shower had large holes in the wall where the head & handle came out - and it felt like we were going to break it by turning it on. However, the staff were extremely helpful and friendly. It's a good, cheap choice for a central hollywood location.", "Date": "April 26, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Buenos aires", "Title": "“Good choice!”", "Author": "Gabymas", "ReviewID": "UR128149401", "Content": "We stayed for 4 days. The ubication was perfect! Two blocks away from the Kodak theatre. Big and clean room with wifi free. Breakfast was ok. Perfect price/quality relation.", "Date": "April 19, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Melbourne, Australia", "Title": "“Great location, pleasant stay”", "Author": "paulie_au", "ReviewID": "UR122793481", "Content": "There really isn't anything major to fault this place on, we had a pleasant stay there for 2 nights whilst visiting LA from Australia. We got a Standard room and were surprised by the roominess of it, great size room, huge bathroom area, comfortable beds, rooms made up daily and most importantly (for tourists anyway), GREAT location, it's literally a few minutes walk to Hollywood Boulevard and transport. Although we didn't spend all day in the hotel, we both had a pleasant nights sleep each night. So if you're looking for somewhere comfortable to stay and base yourself from while you see the sights, without breaking the bank, I would recommend this place. Of course there were some things that could be improved, front desk staff always seemed too busy chatting on the phone or with friends to care too much; despite this though, they will help you with what you need if you ask for it! The rooms look a little dated, and could do with some minor maintenance, but nothing major. Overall, great value for money, with free wifi (ask front desk for pass key) and parking. Not to mention a fantastic location, walking distance to everything! Some great food places nearby worth a visit are Mel's Drive In Diner & Hard Rock Cafe.", "Date": "January 8, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "3", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Northern California", "Title": "“Third Stay”", "Author": "never_again01", "ReviewID": "UR121497930", "Content": "In as much as I really want to love this independantly owned boutique hotel, I still cant bring myself to do it. WHY?? OK, I am a person of size, meaning that the bathroom fixtures are WAY TOO SMALL. The shower, while ample in the curtain area still has its flaws. This hotel is not compliant in many ways, so if you need an elevator, forget it! Lots of steps. THe front desk attendents can be very helpful and for the most part polite. The woman who owns the place was there when I checked in and she told me the building was built in the 1930s. She was very nice as well. OK, so the place is not the Best Western or the Holiday inn, but it is not corperate owned either. I like to support independant business. And since this is only a place to sleep while out on the town, I will continue to stay here, Previously reviewed: I have now stayed here twice. As previous reviews have stated the location is EXCELLENT. My traveling partner and I wanted close to the Magic Castle and a decent room rate. That is what this basic \"no frills\" hotel has to offer. PROS: Location Decent size rooms and bathrooms decent quality bed. great \"budget\" price. CONS: Limited parking (lot was full when I pulled in late Saturday night and had to leave keys at front desk for consideration of other guests.) No bottled water or sugar free beverages in the nearly out of product vending machine. Not ADA complient. No elevator, lots of stairs and finally, their bookkeeping department! Re: bookkeeping: I reserved 2 nights (Friday night and Saturday night) departing Sunday morning. After being on the road 1/2 way home to the SF Bay area, I get a call from the hotel bookkeeper. \"You owe us for another night.\" she says. I told her we left at 11:00 am check out time, gave our keys to the housekeeping lady because the front desk guy was tending to something else. She then asks me to mail her or fax her my receipt when I got home as she did not have a copy of it. (WHAT? no reciept copy which I signed???) We hang up, she then calls me back (as I am driving) and then tells me she made a mistake and apologizes. So, other than this customer service incident, I would reccomend this place highly as you get a nice clean space. Pay cash and get a receipt.", "Date": "December 7, 2011"}, {"Ratings": {"Overall": "1.0"}, "AuthorLocation": "Melbourne, Australia", "Title": "“Worst booking experience EVER!”", "Author": "yolanda52", "ReviewID": "UR120320299", "Content": "Avoid booking this hotel at all costs. I booked a two night stay and paid one night's deposit. A few weeks later I wanted to extend the booking by a night and emailed them to request this. I received no response after several emails and eventually made three phone calls in an endeavour to see if the extension was possible. They eventually sent an email which had details on it that I could not decipher. I again made a phone call to try and get them to send me proper confirmation ...... and I am still waiting. Wwe haven't been there yet but if their booking process is indicative of theri service I'm not looking forward to the stay.", "Date": "November 8, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "1", "Overall": "1.0", "Value": "3", "Sleep Quality": "3", "Rooms": "1", "Location": "5"}, "AuthorLocation": "Halifax, United Kingdom", "Title": "“Really, really grim”", "Author": "SLordUK", "ReviewID": "UR119623012", "Content": "We had such mixed thoughts about this place - the location to the Hollywood Boulevard is great, in fact it is literally on the back door of the Kodak Theatre. Check-in was friendly. We had a 'suite' which was anything but. Everything felt dirty. The kitchen was large but devoid of any utensils, toaster etc. The room layout was terrible, lacking mains outlets and random furniture everywhere. The main socket in the kitchen fell to bits in my hand (see photo), and the telephone was filthy and complete with someone's hair (see photo). Breakfast was absolutely the worst attempt at catering we have ever experienced. Undrinkable dishwater-coffee, children's watered-down orange and all served in the smallest room imaginable. It really can't be that difficult to get this so wrong? Although it was a budget hotel, we wouldn't ever come back here but instead try the other budget hotels nearby.", "Date": "October 23, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Las Vegas, Nevada", "Title": "“Loved our room”", "Author": "spoiledinlv", "ReviewID": "UR118350529", "Content": "I loved our room and location. We got a suite which included a comfy king bed, a huge bathroom area and a kitchenette. The room was clean and comfortable. The location was awesome. Literally 2 minute walk to the mall, hollywood blvd, kodak theater and chinese theater. Very quiet hotel. No complaints at all. The people at the front desk where very helpful and friendly. I would totally stay here again", "Date": "September 20, 2011"}, {"Ratings": {"Location": "5", "Overall": "3.0", "Value": "3", "Service": "3", "Rooms": "2"}, "AuthorLocation": "Mountain View, California", "Title": "“Cant expect more for that price”", "Author": "prashbs", "ReviewID": "UR118168363", "Content": "I recently booked a room at Liberty Hotel, at LA. The room was not that great, they stated two queen beds but the room had only two double beds. The flooring in the toilet was horrible, the tiles were cracked and even the toilet was tilted slightly. The good thing about this hotel is it location, less than 5 minutes walk to the hollywood area. The parking is behind the hotel in a narrow ally and the space is not sufficient enough for all the cars. I had to leave the keys at the front desk, so that they could park my car at some other location.", "Date": "September 15, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "4", "Overall": "4.0", "Value": "4", "Service": "5"}, "AuthorLocation": "Gainesville FL", "Title": "“One block from Hollywood Boulevard”", "Author": "KSUgrad", "ReviewID": "UR116829437", "Content": "A European style hotel - two story, no elevator, simple breakfast (coffee, muffins, bagels), coin operated washer and dryer on site, WiFi, and TV and free parking in lot behind - no frills. Can't beat the convenience to mass transit and to walking Hollywood Boulevard. The mall at Hollywood and Highland (one block) has numerous restaurants and stores and some entertainment. Other restaurants are on the boulevard along with theaters and stores of all kinds.", "Date": "August 16, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "2.0", "Value": "3", "Location": "3", "Rooms": "1"}, "AuthorLocation": "Melbourne, Aus", "Title": "“Don't stay in Hollywood”", "Author": "johnojnr", "ReviewID": "UR115391857", "Content": "We booked this hotel basically because we couldn't afford Beverly Hills. If you want a hotel close to Hollywood Boulevard then this is great. The rooms were made each day which was also great. However, from check in the people that greeted us were rude, spoke in foreign language in front of us, and didn't seem to even know about our booking through expedia. The rooms were old, run down, and smelt if the a/c wasn't on. The shower was terrible, and the toilet was disgusting. Pay extra and stay somewhere better, Hollywood is crap", "Date": "July 15, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "5.0", "Value": "5", "Service": "4"}, "AuthorLocation": "Birmingham, United Kingdom", "Title": "“Excellent location, would definitely return”", "Author": "nicky_starr", "ReviewID": "UR114970558", "Content": "Went to this LA hotel with a friend (we're two girls in our early 20's) 23rd June - 30th June 2011 We got to the hotel at 9pm at night (after missing a connection in Chicago! Argh!) and we were checked into our ground floor room fast and efficiently. There were two double beds in the main room, with a chest of drawers containing a TV with lots of cable channels and there was a large table in the corner. No door to the bathroom but this never caused a problem the whole week we were there so don't let this startle you. The toilet did have a door and was at one end of the bathroom and the shower was large, and was very easy to use, it was great. The reception staff were always friendly and didn't mind looking after our passports the whole week (recommended) . The room was cleaned and beds made daily and towels were changed every other day and the maids were very friendly and even washed a towel for me i brought from home without me asking. Nothing went missing from our room at any point in the week. The room was basic, but this hotel is all about the location, its a 1-2 min walk from the main blvd which has the Chinese Theatre and the Walk of Fame. and a 3 min walk from the underground metro station which will get you everywhere you want to go for a very great price. Lots of great restaurants in the area including The Rolling Stone lounge, Hard Rock Cafe, California Pizza Kitchen, Boho (who do an AMAZING steak) and Hollywood Grill. Lots of other places to eat along hollywood blvd. All in all I highly recommend this hotel, the bad reviews must have been unlucky? The location is second to none and we got a great nights sleep in the room every night. If you want something more glamorous there is the Renaissance Hotel right next door, but it is double the price, why pay more?? Loved the stay and cant wait to go back =)", "Date": "July 2, 2011"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Overall": "4.0", "Value": "4", "Location": "5", "Rooms": "3"}, "AuthorLocation": "", "Title": "“Great location, basic hotel.”", "Author": "FirsttimeUStraveller", "ReviewID": "UR114813043", "Content": "First time review which we are doing because we found Trip Advisor so helpful planning our US holiday. This hotel is basic but comfortable, clean and the rooms are big. The location is unbeatable for Hollywood Blvd and the metro. We got breakfast (albeit basic) and wi-fi included which we werent expecting. Only one of the three receptionists we spoke to seemed to have a good grasp of English or a desire to help. If you want a basic hotel to sleep in only for a good price and a great location this hotel is fine, just don't ask the reception person for anything too difficult.", "Date": "June 27, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "5"}, "AuthorLocation": "London", "Title": "“Perfect location”", "Author": "LivLondon", "ReviewID": "UR110282212", "Content": "The location of this hotel is the best thing about it! It is minutes away from Man's Chinese Theatre and also the stops for tours. Our room was huge and clean enough. Could use some new paint though and the shower was a bit difficult. Nice little welcome pack in the room. Our room had a large kitchen area but no tea/coffee making facilities. Only went to the breakfast once - not much there. Warm juice was not appealing either. We had to meet a tour at another hotel not far away so I asket reception. The guy had no idea and was pointing me in a strange direction so I had to use my laptop to find out!", "Date": "May 28, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Torquay, United Kingdom", "Title": "“Great location, cheap, free parking & breakfast”", "Author": "misablue", "ReviewID": "UR108484608", "Content": "Arrived to hotel after 12 hour flight and 2.5 hour wait at airport at 8PM. Receptionist said: \"oohh did you not receive email about relocation?\" We did not get any email at all and were not happy to hear that. Receptionist then said to wait while he called his manager. Then he said that luckily they had room for us which will be ready in 2 hours. I was really tired and annoyed that we should wait till 10PM for our room, but nothing could be done. Went to move car to the carpark at the back and receptionist came out to tell us, that they actually have room available for us right now, so we checked in and went in our room! Really felt like in some reality show where they try to create tension in order to get the happy ending! Silly really, they had room so why the drama? Anyway, after that all was great, our room was huge, hotel has excellent location, just 3 min walk from Hollywood boulevard and subway stop(went to Universal studios, just one stop on subway). Breakfast was good enough for us, I had croissant with strawberry jam and husband had bagel with cream cheese, coffee, juice, cereal available, could not fault it. Had dinner at Le Oriental Bistro at North Highland Avenue, 250m from hotel, had amazing orange chicken, it was dinner menu with soup and spring rolls all for $12! And so tasty, highly recommended if you are on budget or not! Does not look anything special from outside but worth trying!", "Date": "May 16, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Hobart", "Title": "“Great location, great value”", "Author": "morramate", "ReviewID": "UR105870518", "Content": "Stayed here for three nights and it was all we expected and all we needed . The locatiopn is super. Hollywood at your doorstep. Close to sights, taxis, tube . All L.A. is easily accessible . Hotel is very clean . Big room which was unexpected. Bit of noise. Thin walls and a room off foyer meant we had to ask night manager to talk to his friends a little more quietly. Breakfast nothing special but at this price any breakfast is a bonus. Can thoroughly recommend Graham Hobart", "Date": "April 27, 2011"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Moscow", "Title": "“Greate location, good sleep and cheap!”", "Author": "RudeboyMoscow", "ReviewID": "UR104350190", "Content": "This hotel is right in the middle of Hollywood and that's what almost all visitors of LA are about! It's on a quiet street and you have a good sleep. Beds are big and firm, sheets are clean enough. We stayed for two nights with our doughter and all of us were satisfied. No bedbugs (such a relief for cheap hotel)!! They serve breakfast (included), not much you will have for that: coffee/tea, bead&butter, jam, some cereal. There are only 6 seats for breakfast and all stuff finishes quik so be first. The hotel provide FREE parking right at the door. Room smelled freshly drycleaned (ouch!), but this is much better then smell of mold. We kept our windows open. Of the amenities there were TV (we never tried), iron without board, small fridge and aircon (never tried). Overall: what the hell do you want in the city of angels exept a good sleep. Or pay three times higher and get a full buffet.", "Date": "April 17, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Sydney, Australia", "Title": "“prime location, friendly staff”", "Author": "moocow8989", "ReviewID": "UR100541631", "Content": "Great staff, cheaper than surrounding hotels, no frills, breakfast is generous compared to surrounding hotels, rooms are a decent size Location is great right behind hollywood and highland literally a 30 second walk to the back door of the centre", "Date": "March 17, 2011"}, {"Ratings": {"Service": "2", "Cleanliness": "2", "Overall": "3.0", "Value": "3", "Sleep Quality": "2", "Rooms": "2", "Location": "4"}, "AuthorLocation": "Brisbane, Australia", "Title": "“Budget Hotel, not at a budget price”", "Author": "scomal", "ReviewID": "UR99944766", "Content": "Thisis a great location if you want to be close to the walk of fame and all those attractions like the kodak theatre... but, first impressions were not very good. We were greeted by a lady at the front desk who was not very helpful at all. We had a couple of issues and when approaching staff the language barrier was very broken therefore also frustrating. The rooms were very basic, stuffy and old. The door seemed once locked you could push it open. At night you can hear pretty much everything. If you want location and really not fussed with what you get, then this is for you. Otherwise look elsewhere.", "Date": "March 12, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "2", "Overall": "3.0", "Value": "5", "Sleep Quality": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Melbourne, Australia", "Title": "“Great location, cheap rates”", "Author": "jk121255", "ReviewID": "UR98160208", "Content": "The Liberty Hotel is located in Hollywood, directly behind the Hollywood/Highland Mall and subway station, Kodak Theatre, Grauman's Chinese Theatre and Walk of Fame, all located on the famous Hollywood Boulevard. Universal Studios is a 4 minute subway trip away and the hotel is in a quiet pocket and is in an ok neighborhood (which is saying something in LA). You can see the Hollywood sign from the Hollywood/Highland mall so make sure to snap some pictures there. Upon checking in, always examine the bed and sheets. I made a rather nasty discovery this time - there was a toenail in the sheets! I complained to the front desk and housekeeping came to change our sheets. The room was very spacious and there was a separate kitchenette and big bathroom. The decor is pretty dated (it's definitely a no frills hotel) and the room smelled strongly of bleach, and despite this the shower curtain was a bit mouldy. We attempted to air out the room and noticed that a few of the window latches were broken. Hotel maintenance has rectified this by welding bars on the outside over the broken windows so security wasn't too big an issue, and it was nice to be able to get some fresh air. The phone was not working so I had to make yet another complaint - however, this was fixed the next day. The hotel provides a decent free breakfast - you can have cereal, bagels, toast, muffins, juice, tea and coffee as you want. The staff were nice and were not offended by my complaints and did their best to fix any issues. There's free wifi and they guy at the front desk let us store our luggage at the hotel after checking out as our flight was not until later that night. Also, make sure to tip the maids or else you might find yourself with threadbare towels... Despite the not-so-top-notch cleanliness and maintenance, I would recommend the Hotel Liberty as the staff were pleasant, the rate I got was very good, the free breakfast was filling and saved me having to wander out and get something and it's in a good location. Make sure to get a car when in LA because everything else is quite pretty far away and the public transport isn't ideal.", "Date": "February 27, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Sleep Quality": "2", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Valley Springs, California", "Title": "“Really clean”", "Author": "Michelle209", "ReviewID": "UR98131554", "Content": "Nice staff, clean rooms. good price. 1st night the pipes in the walls rattled every 10 min or so, lucky the 2ed night they didnt. Bed was also a little hard.", "Date": "February 26, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Moncton, Canada", "Title": "“Location, location, location!!”", "Author": "sandra r", "ReviewID": "UR86269517", "Content": "This hotel was literally behind Hollywood Blvd, the location was perfect, we would walk out of the hotel, up the street and we were on Hollywood Blvd, it took approx. one minute, this is how close we were. As for the hotel, it's not very fancy by all means, but it was quiet, we slept very well. Our room was cleaned every day by housekeeping, and we always had a change of fresh towels. I did have a few problems with the TV, I had to ask them twice to come and fix it and they did. Also, the toilet did make a bit of noise, like I said it is not a fancy hotel, but we didn't spend time in our room anyways, it was a place to sleep and that was all. As for the breakfast, you can expect bagels, toast, muffins, cereal, orange juice and milk! I would recommend this hotel if you just want a place to lay your head and be close the action!", "Date": "November 7, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "4", "Sleep Quality": "3", "Rooms": "2", "Location": "5"}, "AuthorLocation": "Cockermouth, UK", "Title": "“fantastic location good value for money”", "Author": "AndreaCockermouth_UK", "ReviewID": "UR85746539", "Content": "Location perfect for touring situated right behind Graumann's Chinese Theatre. Rooms were clean and the staff were pleasant and helpful. Rooms a bit dated but spacious. We had a very noisy night very inconsiderate other guests making a lot of noise during the night. However, I would recommend this hotel as very good value.", "Date": "November 2, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Sleep Quality": "2", "Rooms": "2", "Location": "5"}, "AuthorLocation": "Melbourne, Australia", "Title": "“Good Location - Average Hotel”", "Author": "anthonyob", "ReviewID": "UR83770232", "Content": "The Location is the saviour of the Liberty - Just next to Hoolywood & Highland, makes it easy to get downtown on the metro, or take a bus to the other attractions like santa monica and the other beaches. The hotel is somewhat aged however, and the nose seemed to ravel thorugh the hotel - ypu could here people coming and going all night, The staff were fairly helpful allowing early checkin, which was appreciated.", "Date": "October 17, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Vienna, Austria", "Title": "“top location, cheap and quiet rooms, friendly staff”", "Author": "Nil76", "ReviewID": "UR81295057", "Content": "top location behind kodak theater, and the hollywood boulevard (walk of fame), some good night clubs and restaurants are also in the area and a shopping center as well. rooms are okay but not fancy, we payed 100$ (incl. taxes) for 3 in a double queen. we asked for a new tv and they changed him right away. the rooms are a old but clean. The staff was very friendly and helpful.", "Date": "September 28, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "London", "Title": "“great location and a very good hotel”", "Author": "JFKtravel", "ReviewID": "UR76399368", "Content": "Great location and it is only a 5 minutes walk to the metro, friendly and helpful counter staff. The rooms are spacious are clean every day.", "Date": "August 23, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Victoria, Canada", "Title": "“Civilized clientele and staff”", "Author": "SusanBarr", "ReviewID": "UR65437769", "Content": "The hotel is not super-posh. It's modest accommodation at a wonderful price. My daughter lives in Los Angeles and she shopped around for us. She did well! The staff are very nice and the clientele all seemed quite civilized. In spite of being within a block of major tourist activity we had no trouble at all sleeping - it was remarkably quiet. They have a continental breakfast, but it wasn't my cup of tea. Still, if you're looking to save a little money, they have a continental breakfast. We stayed a week and the only thing I missed was a wifi connection.", "Date": "May 26, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Australia", "Title": "“Fantastic location, pleasantly surprised with standard of room”", "Author": "NikitaGoldCoast", "ReviewID": "UR46065384", "Content": "Sensational location, however we did not know what to expect as it was a cheap property. We were pleasantly surprised with large room, very clean including all linen. Staff were extremely helpful. Don't expect the Ritz Carlton but in terms of value for money and in particular to being centrally located I would recommend this property and certainly stay there again.", "Date": "October 7, 2009"}, {"Ratings": {"Service": "2", "Cleanliness": "2", "Overall": "2.0", "Value": "2", "Location": "3", "Rooms": "2"}, "AuthorLocation": "Manchester", "Title": "“Not worth it for the cheap cost - stay somewhere near the beach”", "Author": "ManchesterChuffer", "ReviewID": "UR38631823", "Content": "Huge rooms & good location if you want to be very near the Wall of Fame (or walk of shame we called it) & the Kodak theatre. Although once you have seen these things then there isn’t much to see & its not very safe to walk around at night in this area. Hotel was VERY noisy & there was no safe & a little lock on the door which we didn’t like. There was free & ample parking which was good. Overall a cheap hotel & we got what we paid for but if I went there again I wouldn’t stay in Hollywood (Or in thgis hotel) I would stay out near the beach as much nicer safer area. This is the only hotel out of the 12 we stayed in on our trip that i would NOT recommed to a friend - a huge disappointment.", "Date": "August 24, 2009"}, {"Ratings": {"Service": "1", "Cleanliness": "3", "Check in / front desk": "2", "Overall": "1.0", "Value": "1", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Malaga", "Title": "“Don't bother to stay here”", "Author": "DCFMalaga", "ReviewID": "UR20571133", "Content": "This is really an unpleasant area to stay, scruffy and untidy and this hotel fitted into this area well. To say there was a continental breakfast was insult to we Europeans. The Hotel was run by young teenagers and early twenties staff who showed no interest in anything. The rooms were clean and comfortable but very old and everything in our bathroom seemed patched up with odd tiles etc.,One day no coffee one day no milk one day no coffee or milk and no one cared.This sounds petty but we were very disappointed with the overall stay.", "Date": "October 2, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "3", "Business service (e.g., internet access)": "3", "Check in / front desk": "5", "Overall": "4.0", "Value": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Ottawa, Ontario", "Title": "“Good Bang For Your Buck!”", "Author": "revblonde72", "ReviewID": "UR14577399", "Content": "Great location, Great service! I chose this hotel for the location and price. And let me tell you, I was pleasantly surprised! The staff and management were superb. Very helpful. Room was large and very clean. Room also included a full kitchen with small fridge and microwave. The hotel is literally one block from Graumans Chinese Theatre, the Kodak theatre and Hollywood Blvd. Location is splendid for walking and not far from Rodeo Drive. I travelled alone and did not feel the least bit unsafe walking alone at night. In short....this hotel cannot be beat for budget, service and convenient location. I would definately stay there again and recommend it to all of those who are looking for budget travel and getting the most bang for your buck! Check this place out!!!", "Date": "March 27, 2008"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Business service (e.g., internet access)": "3", "Check in / front desk": "2", "Overall": "3.0", "Value": "4", "Rooms": "3", "Location": "4"}, "AuthorLocation": "New York City, New York", "Title": "“Bad Timing”", "Author": "Manzin", "ReviewID": "UR14075249", "Content": "This hotel is perfectly located near Hollywood & Highland. Little did I know when I booked that I'd be next door to the Oscars. This made traffic and parking a bit of a problem as there's only 14 spaces reserved for hotel guests and Good Morning America stole three of them. But the hotel was largely nice. My room was very large for the price: kitchenette, sofa, king bed, digital cable, a closet, and a bathroom with a separate vanity area. The wireless worked well. My only complaint was that my remote wouldn't work with the TV and if I wanted to turn it on/off or adjust the volume I had to get up and do it manually. That and they tended to leave security doors propped open. But the area felt safe, it's walking distance to everything you'd need (including a 24 hr Subway and a gas station) and I'd definitely stay here again.", "Date": "March 5, 2008"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Business service (e.g., internet access)": "4", "Check in / front desk": "2", "Overall": "3.0", "Value": "5", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Melbourne, Australia", "Title": "“Gret location”", "Author": "Coops80", "ReviewID": "UR10386308", "Content": "In the lead up to arriving in the US we were able to ask a number of questions to the owner including about getting there from the airport. When we did arrive however we did have to wait in reception for about 15 minutes until someone was able to check us in. The room was perfect for what we needed; beds, shower and a tv although there was a bit of an old smoke smell to the room but overall it was clean which was the most important thing. The location was awesome it basically backed onto the Hollywood stripe, Kodak theatre, a large dinning complex, tourist centre, the train which we could take to Universal (1 stop away) and walking distance to the most amazing restaurant Musso & Franks. The four of us would definitely stay there again.", "Date": "October 27, 2007"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Check in / front desk": "4", "Overall": "3.0", "Value": "3", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Zurich", "Title": "“Ok, spacious”", "Author": "blueyesgr14", "ReviewID": "UR7431848", "Content": "We stayed at this hotel for 3 days. Close to Hollywood Boulevard, close to shops, condition ok and generally or room was very big, so was the bed. I wouldn't mind reccomending this hotel. If you rent a car you can park it at the back.", "Date": "April 25, 2007"}, {"Ratings": {"Service": "2", "Cleanliness": "2", "Business service (e.g., internet access)": "1", "Check in / front desk": "4", "Overall": "2.0", "Value": "2", "Rooms": "3", "Location": "1"}, "AuthorLocation": "Clermont Ferrand", "Title": "“Forget it...”", "Author": "Donut90210", "ReviewID": "UR6320382", "Content": "We stayed ther for 3 weeks. Rooms are acceptable, with space and TV, cable, and a decent private Bath. But some maintenance is needed urgently ! Moistures and various damages on floor and roof are not acceptable. Staff is OK. The worst in this hotel are the surroundings. I've never seen such a loud and noisy place. If you plan to take some reste, FORGET IT. No more than 4 hours of silence per night. On top of that, streets around by night are the place of homeless (some of them were even eating in the hotel trash bin on the back parking lot) and weird people... if you have kids, never go there ! For around 100$ per night, it's really not the best place to stay in L.A.", "Date": "December 3, 2006"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": ", Greenville South Carolina", "Title": "“Great little hotel, awesome location!”", "Author": "Belladonnaf66", "ReviewID": "UR5559545", "Content": "Great little hotel, very much like the hostels I stayed at in Europe, but with private bath. Front desk people were wonderful and car was safe and convenient. Dated interior but as we were sightseeing we didn't need modern and updated. My family included 2 adults and 2 teens and we were very comfortable and felt very safe. Location was awesome, block behind Holywood Walk of fame and El Capitan Theatre. Worth staying there if you just want a comfortable room and easy access to sightseeing.", "Date": "August 4, 2006"}, {"Ratings": {"Cleanliness": "4", "Overall": "4.0", "Value": "5", "Service": "4", "Rooms": "3"}, "AuthorLocation": "Glasgow, Scotland", "Title": "“Great!”", "Author": "A TripAdvisor Member", "ReviewID": "UR5456951", "Content": "My boyfriend and I stayed here for 5 nights last month, our final stop on a road trip across the US from NYC, and I was very pleased with our choice. We had originally booked into the Hollywood Hostel, but after hearing such terrible things about it, we booked in here a few days in advance. The staff are very friendly, helpful and accommodating, and we were actually charged less than we had been quoted. Be aware that they do not accept travellers cheques, altho the owner suggested I just pay the balance later in the week, once I'd cashed more cheques, so I wasn't leaving myself without any cash. The room itself was very clean, as was the bathroom. The location is ideal for Manns, the Walk of Fame, etc. We had mixed feelings about staying so close to Hollywood Blvd., as we had heard it can get pretty dodgy at night, but it wasn't so bad. The back entrance to the Liberty is right next to a very fancy hotel with doormen, so no chance of getting mugged on the (very short) walk home! The area might not be for everyone, it is very touristy, a bit run down and further down the boulevard is a bit dodgy, but it's certainly not as bad as some people say it is! It's weird to see such huge differences in people's opinions, not just of this place, but of any accommodation. It makes choosing somewhere to stay a nightmare - but rest assured my review is very honest, hope it's helpful!", "Date": "July 11, 2006"}, {"Ratings": {"Cleanliness": "2", "Overall": "2.0", "Value": "2", "Service": "3", "Rooms": "2"}, "AuthorLocation": "San Francisco, CA", "Title": "“Hated the hotel, location cool, staff OK”", "Author": "pazyamor", "ReviewID": "UR4599133", "Content": "After reading the UFO review, I decided to stay at this hotel. Please note, not all rooms have carpets. Ours didn't and the tile floors were cold. PROS: Location, location, location. But you need a car to get anywhere beyond Hollywood. The rooms were clean. CONS: The walls are paper thin. You can hear EVERYTHING inside the hotel and outside. The nightman was singing up and down the hallways at 3 or 4 in the morning, found floater pubes on the nightstand and my bath towel, you can't call the front desk, unless you call the hotel, there are no hairdryers as someone previously mentioned, and not all rooms are like the one from the UFO guy, the beds were uncomfortable and only had a sheet and bedcover (no blanket), people coming in and out of the hotel room at all hours, so if you're a light sleeper, ask for a top floor and bring earplugs.", "Date": "March 10, 2006"}, {"Ratings": {"Cleanliness": "5", "Overall": "5.0", "Value": "5", "Service": "5", "Rooms": "5"}, "AuthorLocation": "Orange County, CA", "Title": "“It was home away from home and friendly staff”", "Author": "area51base", "ReviewID": "UR4386354", "Content": "I stayed at the Hollywood Liberty Hotel last September 2005, while I was attending a UFO Conference located at the Renaissance Hollywood Hotel. My stay at Hollywood Liberty Hotel was very nice. The room I stayed in was clean and comfortable. The room was a suite; it had a kitchen, dinning room, cable TV, AC & Heating and the restroom was well stocked, including toothpaste (how cool is that!!??). The manager was very friendly and helpful; he saved me from getting a parking ticket when I was parked at the front, which was reserved for local residents and one space for loading/unloading only (I was parked in reserve). The hotel had plenty of parking in the rear. I really enjoyed my stay, the room felt like home. The hotel is only walking distance to Hollywood blvd. where all the attractions are located. Well worth the stay if you are on a budget and want a nice quiet room that is cozy. I will definitely book my stay again next time I visit Hollywood. RSW", "Date": "January 25, 2006"}, {"Ratings": {"Cleanliness": "4", "Overall": "4.0", "Value": "4", "Service": "3", "Rooms": "3"}, "AuthorLocation": "Klaukkala, Finland", "Title": "“Nice hotel, great location”", "Author": "A TripAdvisor Member", "ReviewID": "UR3733206", "Content": "Hotel/room was clean, spacious and you get your own bathroom (bring a hairdryer if you need one). Our room was little bit noisy `cause it was downstairs and next to the reception desk. Location was great and staff were frendly. They also have a small parking area which wasn`t mentioned in a hotel description.", "Date": "August 3, 2005"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Sydney, Australia", "Title": "“Excellent on a budget, great location”", "Author": "A TripAdvisor Member", "ReviewID": "UR1705095", "Content": "This is a great place to stay if you are on a budget but don't want to stay at a hostel with shared facilities. The hotel is a 2 minute walk to the main sights on Hollywood Blvd and the staff were friendly and helpful. The room was big, there were two double beds, the essentials were there, you get your own bathroom, although the shower was very small. Ask for a room upstairs as the doors are thin and there is more traffic in the hall downstairs. There was some distant traffic noise throughout the night but it is LA. Slept soundly and that's all you need a hotel room for while on holidays. Can't beat the price", "Date": "March 4, 2004"}], "HotelInfo": {"Name": "Liberty Hotel", "HotelURL": "/ShowUserReviews-g32655-d119422-Reviews-Liberty_Hotel-Los_Angeles_California.html", "Price": "$101 - $113*", "Address": "<address><span rel=\"v:address\"><span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">1770 Orchid Ave</span>, <span class=\"extended-address\">Hollywood</span>, <span class=\"locality\"><span property=\"v:locality\">Los Angeles</span>, <span property=\"v:region\">CA</span> <span property=\"v:postal-code\">90028-4303</span></span> </span></span></address>", "HotelID": "2516119", "ImgURL": "http://media-cdn.tripadvisor.com/media/photo-s/01/d4/a6/63/welcome-to-the-hollywood.jpg"}}