{"Reviews": [{"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "3.0", "Value": "2", "Sleep Quality": "3", "Rooms": "2", "Location": "5"}, "AuthorLocation": "California", "Title": "“Busy hotel in good location”", "Author": "Sara9889", "ReviewID": "UR128878504", "Content": "I selected the Hampton for proximity to a work project. It was a very convenient location, close to the freeway. I felt that the hotel itself was just an average value. It was busy - the parking lot was overfilled every night, the breakfast area was crowded in the morning, and there were groups of people hanging out near the elevators on my floor. I believe there were some large tour groups staying here at the time, and that created the sense of \"crowds\". My room had all of the listed amenities, but it was oddly large. There was a very large floor space between the door and the bed/desk area. I had a corner room and perhaps this is why, but it did not feel warm and comfortable. And that sums up my stay - this particular Hampton just did not feel inviting and comfortable to me personally.", "Date": "April 27, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Morristown, NJ", "Title": "“Real Nice Hotel and Good Value”", "Author": "shel7", "ReviewID": "UR128630594", "Content": "Had the opportunity to stay here for 5 days and service was great. Room was large, clean, and extremely comfortable. Breakfast was extensive and always well stocked. Would return without hesitation.", "Date": "April 26, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Varna, Bulgaria", "Title": "“Great Place and wonderful location””", "Author": "dana v", "ReviewID": "UR127983904", "Content": "I booked this hotel through United Travel in L.A because I wanted my group to experience studio city. It was the perfect location and provided comfortable accommodation, wonderful meals helpful staff and easy access to all of the city. We had a great time walking the neighborhood streets and had easy access to the sepulveda and ventura and the studio city within a minute walk.", "Date": "April 16, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "3"}, "AuthorLocation": "San Joaquin Valley California", "Title": "“Close to Universal Studios”", "Author": "MIZER", "ReviewID": "UR126803298", "Content": "Sayed here on a recent trip to Universal Studios. Clean rooms, decent breakfast, reasonable rates, cookies at front desk at night. Only downside is small parking lot, though we always found a spot. Indoor heated pool. Nice staff.", "Date": "March 27, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Scottsdale, Arizona", "Title": "“Great Service!”", "Author": "cmkovacs", "ReviewID": "UR125756004", "Content": "We had a great stay here! Service was very good, quick check-in. Great room, bed, clean, and great breakfast!", "Date": "March 7, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Guadalajara, Mexico", "Title": "“Great value, good location, excellent breakfast”", "Author": "Tomas_RV", "ReviewID": "UR124494164", "Content": "Found this place while searching for an under $110 USD room in this area. Location is great as the entrance for two of the major freeways are less than 2 minute drive form the hotel. Check in was efficient, and room (at 4th floor) was clean. Please ask for a room oposite to the street in order to avoid noise at night. The bed was wonderful. Not too soft, not too hard. Breakfast menu is the typical Hampton, but better in quality compared to other hotels of this chain. Would stay here again if necessary.", "Date": "February 12, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Scottsdale, AZ", "Title": "“Beware of overcrowded and dangerous parking lot”", "Author": "Snorkels_in_space", "ReviewID": "UR124480354", "Content": "I stayed here for 4 nights. The location was the main reason I stayed here as it was close to my relatives. The rooms are clean and comfortable, however, they do not control the parking and it is overflowing with cars every night. People are parking in the lanes and this is unsafe. A fire truck would not be able to reach the building. I reported this to the Los Angeles parking control, but I am not sure what they will do about it. One morning, I needed to leave around 6:30am to take my father to the hospital for surgery. My car was blocked by another car and I could not get out. Fortunately, my brother was able to come by and pick me up. When I complained to the front desk, they said they would have contacted the car owner and asked him to move his car. At 6:30am? That is ridiculous!", "Date": "February 12, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "gardnerville, nv", "Title": "“business stay”", "Author": "totineke", "ReviewID": "UR123881542", "Content": "I stayed here for 5- 6 weeks for a business trip. The staff is very professional and friendly. During my stay they remodeled the lobby/breakfast area with minimal noise. Every floor has its own gathering area with tasteful and comfortable seating off the elevator which is very handy if you need to have little meetings. Previous reviews expressed a concern about parking. Technically, this can be difficult as there are not many on site spaces. That said, I never had any trouble finding a spot on the private parking lot and never parked on the street, arrivng at different times during the PMs. The location is great. You can get on the 101 North without using the 405/101 interchange. You can get on the 134 east without using the 405/134 interchange, you can go north on the 405 in less than .2 miles without using the 134-101/405 interchange. This location can shave many travel minutes off your business day. Fed ex office is 1-2 blocks. I will stay here again if I need to return to the San Fernando Valley.", "Date": "January 30, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Los Angeles", "Title": "“Nice place”", "Author": "titkat", "ReviewID": "UR122694363", "Content": "Nice place, clean rooms and other amenitties. Stayed there for a month and fell in love with the place and the staff. Their breakfast is great and they make a point of giving you a brown bag with something to snack on if you have to leave before breakfast time. You'll love the convenient location as well... Two freeways and a Target store are a stone-throw away.", "Date": "January 7, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Denver, Colorado", "Title": "“Fabulous.”", "Author": "SleepingFoxandSon", "ReviewID": "UR122539990", "Content": "Son and I spent two nights here to start the year 2012. I was pleasantly surprised. The room was nice with two very comfy beds (the only more comfortable bed on our vacation trip was at Disney). The location (near the 101 and 405 freeways) was perfect for our needs. The parking was the only problem. Unfortunately, we returned to the hotel after 9 p.m. on the evening of January 1 and the lot was completely full. Even the compact spots were over-stuffed with vehicles too large for them.", "Date": "January 4, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Copenhagen, Denmark", "Title": "“Fine chain hotel”", "Author": "KayDenmark", "ReviewID": "UR122499638", "Content": "We got a good welcome at check-in, and when our first room had a problem - a smoky smell - we were upgraded to a suite with a large balcony. We were very satisfied with the suite, which included a kitchenette, and thought the breakfast was good for the price of the room. There is an indoor pool with very warm water - like a bathtub! We swam for a long time, and noticed that several of the other families did as well. Generally we were pleased with this hotel. The only negative is that it cannot be reached by mass transit, although that's hardly unusual for California!", "Date": "January 4, 2012"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "4"}, "AuthorLocation": "North Pole, Alaska", "Title": "“Terrible stay, exact opposite of my first review of this hotel”", "Author": "Laterisers", "ReviewID": "UR121577662", "Content": "We arrived the evening of the 6th and was greeted with we have the king smoking room you reserved ready for you, I told the man that is not what we reserved and he then informed me that the original room that I had reserved with a credit card had been given to another guest by mistake and this was the only room left. He was friendly and also called other area hotels, they were full as well, I had no option but stay in the smoking room. When I complained more he told me that he would give me a reduced rate ($99), the rate is not why I booked this property, the way we were treated in the past was. I told him if I had not shown up even though they sold my room, I would have still been charged the original rate, and that was the room I wanted. From the hall, the tag on the door said it was a non-smoking room, my wife stated, maybe he made a mistake and it is a non-smoking room, as soon as I inserted the key card and opened the door it was very obvious it was a smoking room as the smell blasted into the hall. We entered into the room and started to sit down and the chair in the room but it was severely stained, looked like someone had pee'd or pooped on it. There were cigarette burns on the sink in the bathroom and overall the entire room smelled terrible. My wife and I were flying home the next day and neither of us got more than 1 - 2 hours of sleep because every time one of us would move, the stink of cigarette smoke would come from the covers moving. The next morning when we checked out I stopped at the front desk, the lady there said she was the one that had assigned rooms each day and that she specifically remembers assigning a non-smoking room to us. She asked what could be done to fix the situation and I told her (while pointing to the Hampton guarantee) that I should not have to pay for a room I reserved and paid for in advance and then received the exact opposite of what was purchased. She told me that it was too early in the morning, the manager was not there and she would discuss it with him and if he approved, she would waive the charge. I provided my cell phone number and asked to be called when the manager was there. 3 hours later, just prior to boarding our flight I called back, spoke with the same lady and was told, the manager did approve waiving the cost, but I never received a call from the manager. While glad I did not have to pay for that deplorable room, I am shocked that I did not hear from the management staff. I also feel it was criminal that a room that I had reserved and secured with a credit card could be sold to another guest. I am also amazed Hilton still has smoking rooms, what a disgusting place to expect people to work (housekeepers and guests) and stay, I understand providing an area for smoking, but in rooms is obsolete. It is no wonder that it was the last place available. While in the military I was deployed multiple times, I can think of at least three locations that I would rather stay at than this property if this is the level of service and type of room they will provide. If I had to book a room tomorrow in the same part of the city, I definitely would not return here at this time, if this is how I can expect to be treated. If you do not mind possible staying in a stinking room, taking a chance your reservation will not be honored and then as another person posted, having to prove what you reserved, this might be the place for you. Overall a very disappointing ending to a very good visit to California.", "Date": "December 9, 2011"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Overall": "2.0", "Value": "2", "Sleep Quality": "3", "Rooms": "3", "Location": "2"}, "AuthorLocation": "Saint Paul, Minnesota", "Title": "“So-So Hampton with a Parking Problem”", "Author": "FlyGuy47", "ReviewID": "UR119732701", "Content": "As Hampton Inns go, this one ranks below the median. I used to stay at the Courtyard (formerly a Radisson) over on Ventura Blvd., but they started raising their rates so I was happy when they built this Hampton Inn. I've stayed here twice now and both experiences were so-so. Upon check-in this time, I was told I had a double with queen beds. I informed them I'd reserved a king bed. It took me digging through my luggage to produce a printed copy of the confirmation email before he finally believed that I had a king reserved. Then, it took him another 15 minutes to put me in a room... during which time, I watched him put 2 phone calls on permanent \"hold\" and then finally just quit answering the ringing phone. So, overall, my impression of the service level and staff competency wasn't good. The most inconvenient thing here -- and the reason I probably won't stay here again -- is the parking lot. Clearly, it doesn't have enough spaces for a full hotel and many of the spaces it does have are narrow and inaccessible. Once you have your car in a space, you're reluctant to leave even to go get dinner for fear that you'll come back and the lot will be full. The neighborhood's sketchy, too, so the prospect of having to park somewhere nearby wasn't appealing, either. Finally, even though this hotel isn't many years old, they're renovating the lobby area. So, they're serving breakfast in a limited space and there wasn't any seating available. The only option was to grab something and take it back to your room to eat. I'll probably head back to the Courtyard on the next trip... or look for something else.", "Date": "October 25, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Sleep Quality": "4", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Chicago", "Title": "“OK Hotel, bad parking situation”", "Author": "pianoman822", "ReviewID": "UR119597258", "Content": "We usually stay at Hampton Inns, and in fact had just stayed at one the week before in Las Vegas. While the Las Vegas Hampton was perfect, this hotel was just average. The rooms were adequate, but smaller than most other Hamptons, the breakfast was as good as most,. The problem that that property has is that they do NOT have enough parking for their facility. That is, they do not have enough spaces to accommodate their guests. They know about the situation, and try to help, including letting people park in every available area whether it is designed for parking or not, but still if you get in later in the evening, you could have to find street parking. It is not a good situation. Another small thing... and this admittedly IS small: But each evening when we came in, they were out of warm cookies. We jokingly asked about it, and they said, each night, that they ran out. Now, and again this is small, but it seems the idea of having warm cookies for guests is a wonderful, welcome to the hotel idea, and to say that they are out, and only make a certain amount, seems cheap, and leaves you with the opposite feeling, like you are not a welcome guest that they want to accommodate, but a nuisance that needs to be put up with. That was kind of the feeling we got in general, which is unusual for a Hampton Inn., So, all in all, it is an OK place to stay, but not up to the generally high standards of other Hamptons we have stayed at.", "Date": "October 22, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "La Selva Beach", "Title": "“Will Definitely Stay Here Again”", "Author": "schmidtmba", "ReviewID": "UR118936558", "Content": "We went to visit our son in Los Angeles/Hollywood and definitely did not want to stay in downtown LA or Hollywood. Read here about valet fees to park your car overnight at the big hotels (valets are everywhere in LA but this ensures there is parking for the hotel or restaurant you visit). We found Hampton Inn at Sherman Oaks/Los Angeles right here on Trip Advisor (score again) and were very happy with our reservations (call the hotel directly for the best deal of course) and their suggestions for our stay. They put us on the fourth floor at the back (away from smoking rooms, although we never smelled any smoke in the hotel, and the back rooms are away from Sepulveda Blvd street noise, not that we ever heard any), upgraded us from the two queen beds to a king size bed larger room (microwave and refrigerator) which was nice for our five-day stay. The hotel staff were all smiling and pleasant, the continental breakfast was very satisfying (some form of eggs, meat and potatoes every day), waffles, toast, bagels, fresh fruit (grapefruit, oranges, pineapple, grapes), oatmeal, cold cereal, juices, apples, bananas, oranges, and there was fresh coffee available all day long. There were even fresh baked cookies and juice in the evening to snack on. There is an inside pool and we used it one evening to rest and relax our sore bodies from sitting in the car all day. It is right off the 405 freeway, easy to get to, only 15-30 minutes from LA/Hollywood depending on the time of day and traffic. The other guests were friendly, many staying here before. Very clean, good beds, parking full but there was always a place even when we came in at 2:00 AM one night after going to the LA County Fair.", "Date": "October 4, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "San Diego, CA", "Title": "“Nice Hampton with a convenient location”", "Author": "travelerforfun49", "ReviewID": "UR116437930", "Content": "The Hampton is very near the 405 and not far from a mall with good restaurants. The rooms were nice, the beds were comfortable and the breakfast was convenient. The parking was tight, but we managed to find a spot even though we didn't come back to the hotel until about 11pm. I would definitely recommend this Hampton to anybody.", "Date": "August 8, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Denmark", "Title": "“Great location - parking les great”", "Author": "bastian87", "ReviewID": "UR115692897", "Content": "The location of Hampton Inn & Suites Sherman Oaks, LA are great for staying outside the busy city but still being able to quickly getting to e.g. Hollywod blvd etc. because of the great location - close to the 405 and literally minutes from e.g Univesal studios etc. As an frequent Hampton Inn user, this one is like a Hampton Inn should be: Nice, clean, friendly and with a breakfast that boasts of great variety. Hampton Inn Sherman Oaks has a professional staff that can and will help you with daytrips, tours and also their own personal suggestions to how to spend your day. We were told of specific sites were we were able to get closer to the famous Hollywood sign instead of 'just' watching it from the Kodak Theatre area..a suggestion that lived up to our suggestions. Furtheremore we were bumped up to a suite for free, instead of a normal room with two queen size beds. The suite also had a small balcony with a if not super view of the city, then a view of the mountains in the morning - very nice. But: The parking ( which, very importantly in LA, were for free ) on the other hand was not very large, and this is not that good if you arrive e.g. late in the evening We came in late one night and the only parking spot left, was right next to the entrance (see picture) , allmost in the reception area. But at least we got a parkingspace, but other guests arriving later than we did, were forced to find parking other (unsurveilled ) places than us. This is someting one must take into consideration when booking this hotel, a minor flaw that one can survive, but never the less can be very annoying when getting to the hotel after e.g. a late night on the town. But overall a very pleasant stay with a very nice and helpful staff.. We wil be back !", "Date": "July 23, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "North Pole, Alaska", "Title": "“Quiet comfortable room, with a great staff”", "Author": "Laterisers", "ReviewID": "UR115636556", "Content": "Typical Hilton quality when making the reservation, friendly and professional. We have stayed at three hotels in this area over the past three years and have to say we had pretty low expectations based on the other hotels in the area. Needless to say we were very pleased when we arrived, nice lobby, comfortable room, normal Hampton breakfast, with definately a great staff in all areas. Our room (322 I believe) was away from the road, very quiet and comfortable, my wife slept both nights without earplugs!! Unheard of at other trips we have taken and we travel approximately every three months. Only negative was the entrance to the hotel had a very big dip in it and our cars front bumper hit it when entering, we even had a flat when I returned to it after checkin. The staff even turned that experience into a positive when the person that was going to show us to the parking garage saw we had a flat and it was 1130 PM, he offered to move his car which was parked close by around the corner of the building so I could park the car and change the tire the next day, very few in the service/hotel industry make offers that impact them anymore, and it was much appreciated. Check in could have been the fastest of any hotel I have stayed in, and everyone I saw over the two days had smiles on their face and were friendly. Next time we are in LA visiting family in the area, no question this is where we will stay!", "Date": "July 22, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Austin, Texas", "Title": "“Met our expectations”", "Author": "TexasEd60", "ReviewID": "UR113548627", "Content": "This is a typical Hampton Inn, nicely maintained and well run. Our room was as expected, clean and comfortable. The staff is very friendly. The area is convenient and centrally located in the Van Nuys/Sherman Oaks area, but it sits on a heavily congested major street and parking on the hotel grounds can be hard to find.........the owner has additional parking nearby that he gladly furnishes and will even have a valey take care of it.", "Date": "June 14, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "4", "Overall": "3.0", "Value": "4", "Service": "5"}, "AuthorLocation": "Fort Washington, Pennsylvania", "Title": "“Great location to the 101, neighborhood a little eclectic...”", "Author": "originalXfactor", "ReviewID": "UR113281591", "Content": "Parking here was a nightmare initially, but hotel essentially valet'ed the car when we returned from dinner, no additional hassle. I have to commend the staff, they had the car right out front in the morning without us calling down for it, likely moved it up front when a space opened - nice touch. Pretty close to Studio City too, good gawking and food in that area. Lobby was clean and staff as above was a cut above. Rooms were the standard Hampton fare, clean, comfortable, great for business travelers or a place to lay the head for a night.", "Date": "June 13, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "", "Title": "“Liked it so much we came back on the second part of our trip.”", "Author": "newswede", "ReviewID": "UR90003659", "Content": "Very clean hotel (I'm thinking recently renovated) with really nice rooms. I think you'll have a hard time finding a better value anywhere. Safe parking lot and drop off area, easy highway access. Check in staff was very helpful and cleaning staff don't disturb you but somehow still get their job done and do it very well.", "Date": "December 16, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Palo Alto, California", "Title": "“Convenient to the Getty Museum.”", "Author": "havanagal", "ReviewID": "UR82916270", "Content": "I chose this hotel because I like the Hilton family of hotels and this one was just a few miles away from the Getty Museum, off of 405. We arrived at night, and barely found a parking spot, which we were grateful for. The room was clean and spacious. The breakfast was decent (eggs, bagel toppers, cereals, breads, waffles, fruit, coffee/juice). They also had breakfast bags to go available at the lobby desk, and baskets of lollipops and hard candies. There was free wi fi in the rooms. We would stay here again the next time we visit the Getty Museum.", "Date": "October 10, 2010"}, {"Ratings": {"Overall": "3.0"}, "AuthorLocation": "Redwood City, Ca", "Title": "“Some Good, Some Bad, Some Average”", "Author": "Tabachin2008", "ReviewID": "UR79393625", "Content": "Let's start with the good: 1) Quickly responded to request for a change of rooms. 2) Large flat screen TV in room. 3) Fairly new and modern rooms. 4) Nice pool and small exercise area (stationary bike, treadmill and stair-master). 5) Competent, friendly front desk personnel. Especially Sally. 6) Close to the 405 freeway. And the Bad: 1) A/C wall unit pretty much did what it wanted and ignored input from wall control. 2) Beds are double and not queen. 3) Dicey surrounding area. 4) Insufficient parking during heavy occupancy. 5) All the rooms with windows towards Sepulveda and the 405 are overwhelmed by traffic noise. Get a room facing the back parking lot. Synopsis: The hotel is fairly new and the rooms are a sufficient size. Very nice lobby with the average yogurt, bagels, cereal, fruit, waffle breakfast fare. The staff seems friendly and helpful. Quite a contrast between the hotel and the surrounding area. We didn't feel safe walking very far. I would stay here again.", "Date": "September 13, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Winnipeg, Manitoba", "Title": "“Was like a Second Home”", "Author": "StressedMommy", "ReviewID": "UR77161457", "Content": "I stayed at the Hampton Inn and Suites at Sherman Oaks with my two daughters for two weeks. We were in the LA area as my daughters were taking classes at a performing arts school. We were so pleased with the service and quality of the rooms and facilities at this hotel. The beds were incredibly comfortable and the room was very clean. The staff was friendly and very accommodating. Breakfasts were great and there was some variety through the week. Mary who was the breakfast host for most of the days we were there was exceptional in keeping the food topped up and taking orders to make fresh waffles for all the guests. The hotel was in a great location for traveling around the LA area as you are close to the 405 and 101. It only took us 20 minutes to get to the Santa Monica and Venice Beach areas from the hotel, 15 minutes into Hollywood and 10-15 minutes into Burbank and North Hollywood. You have to use common sense of course and make plans to avoid rush hour traffic times but even when we were caught in this we still always made it to our destinations in under a hour. Parking is free at the hotel which is a bonus in LA. Some complained that at times the parking lot became full but parking was still available in neighboring businesses that are used as overflow for the hotel. We had to park here on three occasions and it was perfectly fine. We will be back in LA next summer for two weeks and plan to stay here again. It is a great option that is slightly removed away from the craziness you'll experience in the high tourist areas. it really became our home away from home.", "Date": "August 27, 2010"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Nashville, Tennessee", "Title": "“A Welcome Spot in LA”", "Author": "faulkner2", "ReviewID": "UR75370023", "Content": "Very clean, good-sized room. Staff very friendly. Breakfast average for hotels. Main lobby and floor lobbies are attractive. Good location to 405 and 101 highways. Used to stay at nearby Best Western, this is much improved.", "Date": "August 15, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Leicester, United Kingdom", "Title": "“Excellent Hampton, very new and convenient to 405 Fwy”", "Author": "dgrbleu2", "ReviewID": "UR73035177", "Content": "Very nice and seems very new, good hot breakfast for free. Parking also free but get there early to get a spot, as the car park is very tiny! Heated indoor pool was very enjoyable. Area (Burbank and Sepulveda Blvds.) is not dodgy, rather it is very industrial so not a lot going on at night. Two petrol stations close by for snacks, drinks, etc. Also nearby a Denny's if you are on foot. We would certainly stay here again, very impressed and this is coming from someone who is well versed with Hampton Inns!", "Date": "July 30, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Bellevue, Washington", "Title": "“Second great stay at this hotel”", "Author": "LKZ101", "ReviewID": "UR71551168", "Content": "We stayed in this hotel in May, 2009, and liked it so much that we stayed here again in June, 2010. The rooms are large and very clean and have complimentary wi-fi, the free breakfast is good, the staff is very nice and accommodating, and the location is very good--right near the 405 freeway. We will continue to return.", "Date": "July 19, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Roanoke, Virginia", "Title": "“Great stay!”", "Author": "3UVAfans", "ReviewID": "UR71395402", "Content": "Nice size, clean, comfortable rooms at a great rate which included good continental breakfast. Check in was smooth and welcoming thanks to Brian. Breakfast staff (Mary & Ricky) were cheerful and accommodating. As mentioned in other posts, the parking lot is small, but on the nights we came in late hotel staff was there to help get everyone a parking space. We would have loved to have a microwave/fridge which most Hamptons do have. I think the suites had them, but they had only a king bed and we needed 2 beds. The hotel is conveniently located to both 101 and 405 which are the major freeways. There are not a lot of restaurants close-by. Business center was closet-sized with only one computer and printer. However, there was free Wi-fi in the rooms. Target within walking distance. :)", "Date": "July 18, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "5", "Location": "4"}, "AuthorLocation": "San Francisco, California", "Title": "“A modern and large suite”", "Author": "Brian5900", "ReviewID": "UR67647559", "Content": "We reserved and paid 3 nights in advance and thus got a very good rate (~$127/day). The suite has 2 queen beds and is very large. The room also has a 42 inch flat screen TV, a sofa, a microwave and a refrigerator. Breakfast (included) was good and varied somewhat from day to day (i.e. sausage, ham). Although parking (free) was limited we had no trouble finding a spot even when we came back late at night. This is definitely the place to stay if you visit UCLA.", "Date": "June 15, 2010"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Overall": "2.0", "Value": "3", "Sleep Quality": "2", "Rooms": "2", "Location": "4"}, "AuthorLocation": "Sacramento", "Title": "“Not a place for business. Not a place for comfort. Not a place for good customer service.\"”", "Author": "FedIns", "ReviewID": "UR67488358", "Content": "We had a meeting and hotel rooms booked there. The swamp cooler they had wasn't working properly to the point we had to open doors, etc. The request for our beverages was ignored. As we arrived the staff told us we had no rooms (even with reservation) when the problem was we couldn't check in yet. The atomosphere was not appealing. I have stayed at a lot of Hamptons and this was very bad.", "Date": "June 14, 2010"}, {"Ratings": {"Overall": "2.0"}, "AuthorLocation": "Louisville, KY", "Title": "“Insufficient Amount of Parking Spaces”", "Author": "briak-ky", "ReviewID": "UR67412576", "Content": "I stayed at this hotel last week for 1 night. First off, there are very few parking spots at this hotel. Certainly not enough on-property spots for the number of rooms that they have. Additionally, the hotel has meeting rooms and, when I arrived around 8PM, the meetings were still going and people were double parked in the lot and in the fire lanes. The front desk wanted me to part in a remote lot (not on-site). I refused and they told me to part in the fire lane overnight. I wasn't towed but it didn't give me a good impression. For breakfast, they were very low on muffins at 7AM on a weekday. The A/C in the room is limited to 68F as the low setting. Room was clean and quiet. I am Hilton Diamond member and this is the worst parking situation I have experienced at a Hilton-branded property. I submitted a comment card to the front desk upon check out. No contact from the manager after submitting it.", "Date": "June 13, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Honolulu, Hawaii", "Title": "“diamond in the rough”", "Author": "goofy_surfer", "ReviewID": "UR66932032", "Content": "neighborhood has gotten much better...staff is friendly and laid back...room was clean and spacious...central and convenient location to lax and burbank airports...free parking, internet, and breakfast were like icing on the cake...perfect for our needs...will be back...", "Date": "June 9, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "3", "Sleep Quality": "5", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Escondido, California", "Title": "“New Hotel, Great Service, Excellent Stay”", "Author": "SterlingGuy", "ReviewID": "UR60775664", "Content": "This is a brand new Hampton Inn in Sherman Oaks / Van Nuys. The neighborhood isn't much- gas stations, industrial places. The hotel is very new. Each floor has a mini lobby with big, comfy chairs by the elevators. Indoor pool is heated and the area is nice and warm too. The Breakfast (included) has great coffee (lots of creamer choices) and a waffel maker in addition to the usual Hampton bfast items. We arrived with a bunch of high school students at 10 PM and they offered to keep the pool open an extra hour for us! How nice. The rooms and hallways are spacious. The (included) free wifi works great, too. It's a little noisy outside in this area, so keep the fan on at night to 'white noise' out the city sounds. Very helpful, kind staff made our stay perfect. Easy off and on the nearby freeway is a plus.", "Date": "April 8, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "3", "Overall": "2.0", "Value": "1", "Location": "3", "Rooms": "3"}, "AuthorLocation": "Calif", "Title": "“If you like the sound of traffic through your wall and a parking shortage, stay here”", "Author": "JardineCalif", "ReviewID": "UR54555745", "Content": "On heavily heavily trafficked Sepulveda, newish construction building located in an industrial neighborhood with a pawn shop row ambience. Omnipresent traffic noise. Found suite adequate size for three people, with nice desk, chair, sofa; rooms were clean. Good breakfast variety and quality-included in room rate. Floor lobbies are spacious and look comfortable and useful for meetings. Came back @12:15 am after late night meeting to find no parking at Inn --all parking slots were filled--was told by desk attendent and security person to park \"next door\" in a multistory parking garage which was unattended. Found out that \"desk attendent/night auditor\" , who was acting as a night manager, would not move his car to free up a parking space @ Inn. Was told next day by \"Day Manager\" that, in spite of explicit statement in the Hampton Inn and Suites customer satisfaction survey preamble, there was not a manager on site 24 hours a day to \"ensure\" customer satisifaction. Written policy further notes that \" you don't pay if you are not satisfied.\" The day manager made no effort, when reminded of this Hampton Inn and Suites policy, to act on the policy. There are other lodging alternatives in the area--use them, unless you like overpaying for a suite complete with road noise and a clear risk of no parking in the Inn parking lot..", "Date": "January 28, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "3", "Overall": "2.0", "Value": "2", "Location": "2", "Rooms": "4"}, "AuthorLocation": "Los Angeles", "Title": "“Sketchy Neighborhood, boutique property”", "Author": "SecretAgentReview", "ReviewID": "UR51340714", "Content": "stopped here on way back to los angeles. Apparently though made days prior my res was not ready so waited while it was manually asiigned etc. indifferent staff, as a HHonors elite member i was 'upgraded' to a larger room. Well it was next to elevator ( my profile says Away From Elevator' so each time a person used teh elevator or walked by it sounded like someone was using the card key to enter the room. Rate, though slightly discounted for 6.00 more I could have stayed st the Universal Hilton a few miles away. I should have taken the trip Romm nice large, microwave and fridge, bethroom well lit. Few outlets a pet peeve and internet while free, did not work which is a major problem for me. Was told theyd call the room when fixed, they never called. Would not recommend for a single female traveler, theres no real security and at night not a great neighborhood Large lobby with tv and breakfast area. Free breakfast was good variety. I did nt get my Hhonors my way, water and snack, usually already in room and twice when stoping at desk to obain same. was unmanned. I left detailed comment card, No managment follow up so I cannot recommend this property especially when they tout a 100% guarantee or its free slogan. My room was neither comped nor reduced. I dont mind problems, hey they happen, but to not addres the GUEST, keyword GUEST, is unacceptable. Seems like the staff would like the hositality business if it werent for those pesky guests.......", "Date": "December 16, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Location": "4", "Rooms": "5"}, "AuthorLocation": "Williamsville, New York", "Title": "“Great value!”", "Author": "stevesgirl", "ReviewID": "UR48688441", "Content": "We had a great stay at this Hampton. It was conveniently located near the Interstate, so getting to and from the LA attractions was easy and they were not too far away. Where the hotel is located is not fancy at all, but I felt safe at all times. The hotel itself seemed really new. The hotel owner/manager greeted us at the door and answered our questions about where to park. Check-in was fast and smooth. Our room was very nice, clean and newly decorated. The beds and pillows were very comfortable -- I'm very picky about this. Breakfast was the traditional, abundant Hampton fare. Everything was kept well-stocked and we didn't have a problem finding a table. Our favorite thing about this hotel was the pool! Lucky for us, we had it all to ourselves both nights. I usually don't spend much time in hotel pools as they are usually too cold for me, but this pool was heated nice and warm. ;-) We spent a few hours each night in the pool and the kids loved that! I'd definitely picked this hotel again if we were staying in the area. It truly was a bargain.", "Date": "November 7, 2009"}, {"Ratings": {"Overall": "2.0"}, "AuthorLocation": "Colorado", "Title": "“Second and last stay”", "Author": "COGuest", "ReviewID": "UR38340440", "Content": "This is my second and last stay here. I am in the middle of the stay now. Have stayed at many Hamptons inthe US and Canada. Location is nice and near highway here, but desk staff is unprofessional, unkempt, and not helpful. On cell phone w/personal calls, ill-groomed, and ill-informed. I asked for a plastic laundry bag and was told they had not had them for a long time here. On last stay I saw a man hoist himself over fence into the back parking lot and walk around lot, peering nto cars. Yesterday a panhandler on Sepulveda asked for money, in the daytime. I need a different sort of atmosphere to feel comfortable. A friend suggested the Courtyard on Ventura, whihc is not too far. Going to check it out.", "Date": "August 21, 2009"}, {"Ratings": {"Cleanliness": "5", "Overall": "4.0", "Rooms": "4", "Service": "5", "Location": "3"}, "AuthorLocation": "Plant City, Florida", "Title": "“Good hotel for business travelers”", "Author": "pacman2033", "ReviewID": "UR36374214", "Content": "This is a newer property and still in good shape. Most of the guests were business travelers which they seem to cater to. Our son had become ill while traveling to the hotel in the morning and after calling and explaining the situation they had our room cleaned and ready for us and allowed us to check in early! We did have trouble gaining access to our room as the key cards did not work and we had to make three trips to the front desk to finally get one that worked. There is a two story Target store across the street and limited dining in the immedaite area.", "Date": "July 31, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Brandon, Florida", "Title": "“A pleasant surprise”", "Author": "Stevied888", "ReviewID": "UR33544465", "Content": "While it was true the surronding neighborhood was not the fanciest the property itself was very nice and especially roomy in the common areas. Breakfast was a nice warm Hampton breakfast with eggs and sausage. I was upgraded to a studio suite which was on the 4th floor. I assume it is different on lower floors but I had 20 foot ceilings which made a spacious room even larger.", "Date": "June 30, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Location": "1", "Rooms": "3"}, "AuthorLocation": "New York City, New York", "Title": "“Questionable location, rude front desk”", "Author": "tinapai18", "ReviewID": "UR33231127", "Content": "Though I liked the newness of everything in the hotel once you got inside, I didn't like the seedy location and felt uncomfortable when I walked outside property at night. My window looked out to a Park N Sel car lot and was hard to sleep with the noisy Blvd traffic. I asked the front desk agent to change rooms and he spoke to his colleague in some Carribean language in front of me, which I thought was rude. Room was tiny and toilet was literally flushed next to sink, which reminded me of being in an airplane toilet. As a single female traveler, I would stay elsewhere.", "Date": "June 26, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "NM", "Title": "“Great place! Great people!”", "Author": "swkathrs", "ReviewID": "UR23509276", "Content": "This is the nicest Hampton Inn we've stayed at--and we've been at many over the years all over the U.S. Everyone from the manager to the breakfast hostess went out of their way to give my husband and me information and do many extra things for all their guests! Our room was large, nicely appointed, and immaculate. Indoor pool and exercise room, too. The surrounding area was \"ok\" with easy freeway access and no security problems. Great value, too! We will definitely return!", "Date": "January 13, 2009"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "Palmdale, California", "Title": "“Great staff!”", "Author": "rickwend", "ReviewID": "UR22971673", "Content": "I was pleasantly surprised by this hotel, which was a last minute reservation made online by my wife when I couldn't drive home due to bad weather. The Hampton Inn website didn't have a photo of the hotel (not usually a good sign!) and my Garmin couldn't find the address but I found it fine and it turned out to be a new hotel and much better than either of us had anticipated at such short notice in the Van Nuys area. Most other hotels were already full! Being totally unprepared for a night away from home at 4am the next morning I was greeted by a very pleasant and helpful member of staff at the front desk. In addition to the toothbrush I requested, he was also quick to provide me with the latest weather and traffic information. Such good service you rarely find even in a very expensive hotel.", "Date": "December 23, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Check in / front desk": "3", "Overall": "4.0", "Value": "4", "Rooms": "5", "Location": "4"}, "AuthorLocation": "San Diego", "Title": "“Inexpensive and Convenient”", "Author": "hobo6", "ReviewID": "UR22105080", "Content": "After recently marrying, my parents who live in Sherman Oaks had a small reception at their house. My new wife and I needed a place to stay. Originally we were going to stay at the Best Western across the street, however, for about the same price we thought it would be better to stay in a newer hotel. We had a three night stay in the large room with a king sized bed. The bed was super comfortable and the rooms were very clean and of course reflected the newness of the hotel. We were also very delighted with the size of the room. We arrived very late at night and were given our room. Unfortunately, it was apparent that someone had smoked in the room. The staff was very nice and accommodating when we asked to change our room. We really enjoyed our three breakfasts. They tasted good and we were allowed to take the food up to our room. In addition, different food was offered each morning. The one drawback was the pungent odor in the lobby at night. It smelled like sewerage, but it was only in the lobby and only at night. So we held our noses on entering the elevator and then everything was fine. Now that I will occasionally be visiting my parents with my wife and future children, I need an inexpensive hotel to stay at. This will be our hotel.", "Date": "November 23, 2008"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "San Diego", "Title": "“Wonderful visit”", "Author": "Sooz2", "ReviewID": "UR20043466", "Content": "My husband and I just returned from a 4 night stay at this Hampton Inn. Everything about it was very, VERY nice. The hotel is a few months old -- very nice and clean. The 2 Queen room is small, but fine. (I'm not sure if it would work for more than 2 people ... perhaps a suite.) We were on the top, 4th floor. It couldn't have been quieter. Nice flat screen TV. We enjoyed the coffee always available in the lobby, which is a lovely area. The towels were thick and large and the sheets crisp and fresh. The beds were excellent, as was the shower. Our room didn't have a refrigerator so they brought us a nice big one, on request. Very sweet people at all times and all shifts. I wish I had gotten the names of a two very special people who helped us! We picked this location because, for a reasonable rate, we could get to the Getty Museum and other sites quickly and easily, and even took non freeway routes during high traffic times, to Hollywood, etc. I would HIGHLY recommend this location to anyone who has a car. There aren't good places to eat in the immediate area, but for a short drive you can go to Ventura Blvd. and there are almost TOO MANY GOOD CHOICES! And we also visited our favorite deli in LA ... Brent's in Northridge! (That's why we needed the refrigerator!)", "Date": "September 13, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Check in / front desk": "5", "Overall": "2.0", "Value": "2", "Rooms": "3", "Location": "1"}, "AuthorLocation": "santa cruz", "Title": "“Breakfast disappointing, manager and wife RUDE”", "Author": "pmbee", "ReviewID": "UR18938006", "Content": "The night staff greeted me kindly. The day desk person and staff were gracious. I feel sorry for them all working for a man and wife management team that are focused on all the wrong things. They are not running this Hampton up to Hampton standards. This is a bad facility to be avoided. Here is the problem I had..another guest who had either a small child or elderly person waiting upstairs attempted to take some breakfast items up to her room. This set off a fury by the manager. He yelled at this guest ( she later referred to him as Gustapo like) He and his wife then proceeded to spend the rest of breakfast posting do not take food to room signs all over the breakfast area. The result was there were no waffles, fruit, or eggs prepared. this was 9am.When I asked about more fruit the wife said just snapped NO gruffly, not I'm sorry, no. I had the front desk person inquire about waffles after that treatment and she was told more waffles were coming. That did not happen because the wife made her husband breakfast and the two of them sat in the cafe together. I figured out I had been shined on and asked for a reduction in my room rate to cover breakfast at somewhere else.", "Date": "August 14, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "4", "Overall": "5.0", "Value": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Stockton, CA", "Title": "“Excellent hotel”", "Author": "CaliforniaJayhawk", "ReviewID": "UR17856433", "Content": "This is a very new hotel. Rooms were very clean, beds very comfortable. Nice large flatscreen tv. Decent free breakfast. Easy access from freeway. Overall, a very great stay!!!", "Date": "July 14, 2008"}], "HotelInfo": {"Name": "Hampton Inn & Suites Los Angeles/Sherman Oaks", "HotelURL": "/ShowUserReviews-g32655-d673130-Reviews-Hampton_Inn_Suites_Los_Angeles_Sherman_Oaks-Los_Angeles_California.html", "Price": "$136 - $180*", "Address": "<address class=\"addressReset\"><span rel=\"v:address\"><span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">5638 Sepulveda Blvd</span>, <span class=\"locality\"><span property=\"v:locality\">Los Angeles</span>, <span property=\"v:region\">CA</span> <span property=\"v:postal-code\">91411</span></span> </span></span></address>", "HotelID": "2516076", "ImgURL": "http://media-cdn.tripadvisor.com/media/ProviderThumbnails/dirs/58/b7/58b7748ff20d048958d7a3a2caac7a993large.jpg"}}