{"Reviews": [{"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "highland, MD", "Title": "“Highly Recommend”", "Author": "JACKThighland_MD", "ReviewID": "UR129125614", "Content": "The accomodagions and service at this hotel are top rate. Frfom the first time that I spoke with Joey about making reservations and all subsequent discussions my expectations for this hotel were high. Joey was most helpful in room selection, letting me know about the airport pickup, the rental car agency that I was interested in, hotel van assistance to the light rail, and everything else. He provided cheerful greeting when we met personally, and the rest of the staff that we dealt with, Francesco {van driver}, Richard and Dominkka at check-in, Nijel (for fixing the safe & refrigerator expediciously, (sorry about the misspelling), Ms. Moeller, Jeff and Justin (managers, thanks for help with the waffle, Jeff), Waitresses and Chef, in short, everyone, could not be more accomodating. Now, the buffet breakfast (complimentary with our reservation) had cooked-to-order selections included (no rubberry eggs here thanks to Enrique the Cheff ). In addition, the rooms were clean, the whole hotel was clean, and they were QUIET with adjustable sleep number beds... We hated to leave & if we get back to this part of the country again THIS HOTEL WILL BE OUR FIRST CHOICE. From Maryland, with hopes for another stay!", "Date": "April 30, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Danbury, Ct.", "Title": "“A great airport hotel”", "Author": "jaydub0425", "ReviewID": "UR128430967", "Content": "We stayed at The Hilton Garden Inn overnight because we had an early flight the next day. The staff was very friendly and accommodating. They had a small pool which was great for the kids since it was 100 degrees out while we were there. We ate in the restaurant that night and the food was very good. The room was large and clean and up to date and equipped with fridge, coffee maker, etc. The shuttle bus to the airport was fast. A convenient hotel at a great value!", "Date": "April 23, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Lichfield, United Kingdom", "Title": "“good for airport”", "Author": "lichfield2", "ReviewID": "UR127880790", "Content": "Arrived late evening after a long flight .The big plus was the hotel was easy to find as it was our first time in Phoenix. Friendly helpful staff , large comfortable rooms with kitchen area but not equipped. Be WARNED do not except room 227 it is next to the laundry and the noise of the plumbing and washers mean sleep is impossible. We asked to be moved after 10 mins in the room .", "Date": "April 14, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Tucson, Arizona", "Title": "“very helpful people”", "Author": "Nanette M", "ReviewID": "UR126993280", "Content": "During spring break, we needed two hotel rooms on short notice. Jeff Moennich, sales manager, came to our rescue and we got our two rooms. The hotel is very nice, rooms clean, staff extremely courteous and helpful. We were treated very well and will continue to stay at this hotel which is close to the airport.", "Date": "March 30, 2012"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "strongsville, oh", "Title": "“Very nice”", "Author": "paul l", "ReviewID": "UR126421803", "Content": "The Hilton garden inn airport north is a very nice hotel. Internet was reasonable speed. Breakfast was included, and was very good. I really like made to order omelets. The hotel is in a mediocre neighborhood, but I felt safe in the parking lot or the outdoor pool.", "Date": "March 20, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Salinas, CA", "Title": "“A Central Location for a Spring Training Weekend”", "Author": "CentCoastPastor", "ReviewID": "UR126336529", "Content": "The Hilton Garden Inn kept up the Hilton Standard during a very busy time. The room was clean and well appointed. The lobby and lounge were well kept and the staff was attentive to our needs. The location made travel to the various baseball stadiums very easy and we were able to stop by the hotel between games. The rate was lower then the majority of hotels in this class. Rates are always very high during this time of year. The only downside is the neighborhood to the east of the hotel, but that isn't the hotels fault. We would definitely stay again.", "Date": "March 19, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "3.0", "Value": "2", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "st. catharines", "Title": "“I think it was way overpriced”", "Author": "rodney01", "ReviewID": "UR125478251", "Content": "We had to stay close to the airport as Southwest airlines missplaced our luggage and I had to find a place quick so we could inform them where to deliver our luggage to. Not being familiar with the city but with the hilton name we were stressed out enough to pull into something familiar. Now the room was gorgeous and spacious. Clean, comfortable with everything we could want. If I was not being held hostage by the fact we had no luggage I would never have paid the $140.00 USD a night for a room that could be had anywhere for $100.00 a night MAX! Next morning we found out that \"special rate\" did not include breakfast the rest of the guest's were enjoying. I cannot find any fault with anything about this hotel except how do they expect working class people to be able to afford it?", "Date": "March 1, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Sleep Quality": "2", "Rooms": "3", "Location": "4"}, "AuthorLocation": "harrison, ny", "Title": "“Garden \"sleep system\" mattress is a joke-”", "Author": "redskynight", "ReviewID": "UR125317475", "Content": "They have to be kidding... it felt like I bruised my tailbone when I woke up from lying on that rock hard mattress. It was set to the softest on the dial possible. Not a good feeling when you are getting up early for a 5 hour flight. Did not take advantage of the gym or pool, maybe I would have felt better about the price but didn't get my money's worth here.", "Date": "February 27, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "3", "Overall": "3.0", "Value": "4", "Sleep Quality": "3", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Cheltenham, United Kingdom", "Title": "“Great staff, average hotel”", "Author": "kakistoc", "ReviewID": "UR124830621", "Content": "I hate to say bad things about this hotel, given firstly that everyone else loves it and secondly the pride that all the staff clearly take in their hotel. However I found it pretty average. The staff were absolutely great - both welcoming and helpful. However, I found both the public areas and the rooms very basic and not appealing. I'd stress again that the staff were great. It was just the hotel itself that I wasn't blown away by. Sorry guys.", "Date": "February 19, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "3", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Lincoln, Nebraska", "Title": "“Great Property & Excellent Service”", "Author": "jgtraveler", "ReviewID": "UR124500070", "Content": "Missed our flight home and found this property on tripadvisor. The shuttle picked us up from the airport in just a few minutes. The hotel looked very nice when we checked in. Had a problem with maintenance noise outside our room at midnight. I mentioned it to Lura at the front desk the next morning and she was awesome! She did not make us pay for our room and she upgraded our breakfast. She said we should not have been put in that room because they knew about the maintenance being done. She apologized for the mistake. What a professional! She really made us happy with her quick handling of the situation. We will DEFINITELY stay here again when we are in the area. Plus, the breakfast was one of the best we'd had! The omelet station was so good. Great property and they've obviously trained their people very well in customer service.", "Date": "February 12, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Phoenix, Arizona", "Title": "“Just keeps getting better”", "Author": "Andy A", "ReviewID": "UR124475104", "Content": "I continue to use HGI Phoenix Airport over all the other places in the Phoenix area, for so many reasons but the most important from day one they treat you as faimly and that is not one person its a awesome staff. As many times I have stayed here I witnessed first hand this. It can be a one time stay or many your treatment is always outstanding. The morning staff in the dining room starts your day off and always willing to help you get your breakfast to start the day of bright. I would specifically acknowledge Mike in the front office, Richard and Domica at the registration desk, Cassandra in the dining room. All of them (and the entire team) do a great job providing professional and courteous service. Thanks for making me feel like part of your family.", "Date": "February 12, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Show Low, Arizona", "Title": "“Best property in the Phoenix metro area”", "Author": "James J", "ReviewID": "UR124372156", "Content": "Myself and the organization that I work for uses the HGI Phoenix Airport North weekly. We have many choices in Phoenix, but chose this property because of the great facility, cleanliness, cost and service. I would specifically acknowledge David in the front office, Richard and Tamica at the registration desk, JD in the bar and Cassandra in the dining room. All of them (and the entire team) do a great job providing professional and courteous service.", "Date": "February 9, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "nj", "Title": "“Close to airport and nice!”", "Author": "snivvy", "ReviewID": "UR123135378", "Content": "We needed to catch an early flight out of Phoenix, so we chose to stay at the closest Hilton available. Airport N. was clean, offered a free shuttle on the half hour, plus other niceties as hubby is a Hilton Honors member. There are several Hilton propeties in the area and this one is on our list to stay at again.", "Date": "January 15, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Overland Park, Kansas", "Title": "“Fantastic stay!”", "Author": "Craig L", "ReviewID": "UR122513364", "Content": "We stayed in this hotel while we visited Phoenix for the Insight Bowl. From the time we arrived at the property until the time we got dropped off at the airport, the service we impeccable. Lura was the most friendly and helpful front desk person we've ever encountered in our years of traveling. And the shuttle drivers were so nice and helpful with directions and also VERY prompt. The rooms were clean and the bed was fantastic. We would HIGHLY recommend this property!", "Date": "January 4, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Nebraska", "Title": "“Had a great stay”", "Author": "Sc00terT", "ReviewID": "UR121778943", "Content": "I travel frequently on business and needed a hotel close to the Phoenix airport for a recent trip. I chose the Hilton Garden Inn Airport North as it was close to the airport and I could also earn my Hilton Honor points. I was not disappointed at all! The hotel is in a pretty industrial area, so there isn't much to see or do close by, but the hotel had everything I needed. The staff was very friendly and helpful. The room was nice and clean. And I had an awesome omelette for breakfast. I think I just found my new \"home away from home\" when I travel to Phoenix.", "Date": "December 15, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Phoenix, Arizona", "Title": "“Aweome Hotel”", "Author": "Dwayne D", "ReviewID": "UR121701219", "Content": "This is by far the best Hilton Garden Inn I have stayed at. Food is great and more than most offer. Work Out facilities are great, Precor for your work out. Staff very good and will help anyway they can. I travel alot and I will stay only hear when in the Phoenix area, can't wait for next trip.", "Date": "December 13, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Rochester, MI", "Title": "“Outstanding personnel!”", "Author": "Detroit_Heavy_D", "ReviewID": "UR121527333", "Content": "Excellent hotel with incredible employees! Domica, Rich, and Laura all went well above and beyond the call of duty and are invaluable to the hotel and guests. There were a couple of minor issues getting my room. They're really not worth mentioning, but for the fact the problems are what allowed the wonderful people of the HGI to really shine! Of course the hotel was new, clean, and luxurious, but that takes a back seat to the absolutely wonderful people that worked so hard to make sure everything was corrected and more. Again, I have to compliment Domica, Rich, and Laura. Their professionalism, eager and helpful natures made this stay one of the best I've experienced.", "Date": "December 8, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Sleep Quality": "2", "Rooms": "4", "Location": "2"}, "AuthorLocation": "Riverton, Wyoming", "Title": "“OK if you need to be near the airport”", "Author": "bobbymcsnoddy", "ReviewID": "UR121515474", "Content": "First of all, I need to say that the staff was great..courteous and friendly..no complaints there. My main objection to this hotel was the noise and less than ideal area of town, neither of which the hotel has control over. The hotel is on a very busy street and traffic starts very early in the morning. I am not a light sleeper but had to wear earplugs in order to not hear the buses, trucks, etc. A previous reviewer said it was \"quiet.\" Not so...although it's true you don't hear the air traffic. Also, the hotel is in a pretty sleazy part of town, so if you don't have a car, your options for eating are limited to the hotel restaurant, which was fine. For a one or two nighter, it would be OK, but if you don't have to be near the airport, pick another property. Also, it might help to request a room that is not streetside.", "Date": "December 8, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "3", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "usa", "Title": "“Quiet Hotel”", "Author": "donuvia", "ReviewID": "UR121426626", "Content": "I was able to contact hotel for Shuttle Van from the Airport Hotel Courtesy phone located in baggage area..dialed numbers 05 for this hotel. There are different Hilton Garden hotels in the area, make sure you board in the corrrect shuttle...my shuttle did state Hilton Garden Inn Airport North. Although this hotel is near Phoenix Airport it was real quiet. Lovely lobby with fire place and tv. Hotel lobby has small area for guest to buy items, such as mid-night snacks. Double occupancy room was large. The firm mattress was great! Bathroom needed an extra inspection before assigning room to guest. Breakfast, lunch and dinner was great! Breakfast was much more than a continental breakfast! I will consider to stay at this hotel again.", "Date": "December 5, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "5.0", "Value": "4", "Sleep Quality": "4", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Sheffield, United Kingdom", "Title": "“Perfect for last night of trip”", "Author": "rojanich", "ReviewID": "UR121054085", "Content": "We stayed at the hotel on the last night of our 4 week trip so were well pleased that the room was big enough for us to unpack all the detritus we had accumulated before the serious job of trying to pack two suitcases and two carry-ons under the airline weight limit. We were devastated that the batteries in our suitcase scales had run down and of course they are a different size to any we had with us. We envisaged my husband having to scour the area trying to find a store selling batteries or chance huge overweight charges. He explained the problem at reception and Mike Leaverton found batteries to fit – what a hero ! Talk about ‘going the extra mile’ for customer service. The room itself was huge as I’ve said, clean and comfortable. My husband enjoyed the comfortable chair with footrest while he watched me do the packing ! As we were tired we decided to eat in the restaurant and expected an expensive meal of indifferent quality. Instead, we had a steak and a rack of ribs and shared them, both happy with the quality and the wine was good and not hugely expensive. The service was fine too. Unfortunately we weren’t able to try breakfast as we had to get to the airport. Reception at check out was good and the young lady gave us good directions to the car rental. We would definitely stay again and recommend the hotel.", "Date": "November 26, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "3"}, "AuthorLocation": "Anchorage, Alaska", "Title": "“Base Camp”", "Author": "Mitchell W", "ReviewID": "UR120795534", "Content": "I work in the area and fly out often, this property allows you to leave your vehicle in the parking lot and they shuttle you to the airport. I like the little lobby restaurant for convenience and not having to drive anywhere. There is a BBQ place nearby that is a little pricey but not much else. They have a washer and dryer here too. I like the staff and Dannika Brock is always on top of things, she really makes a difference when I compare to other Hilton properties. I have stayed here six times in the past two months and have always enjoyed my stay.", "Date": "November 19, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Kent", "Title": "“Pretty Average”", "Author": "Shakyjowls", "ReviewID": "UR120700969", "Content": "During our recent vacation I have decided to try a different brand from our usual hotels and after two stays in different Hilton Garden Inns, we won't be rushing back. I was looking for a hotel close to the airport as we would have been traveling all day. I chose this hotel based on positive reviews and the position on the map. Luckily the directions from the car rental agent was spot on because I cannot say the Van Buren Street is inspiring in that area, in fact it looked a bit sleazy. The staff was friendly upon check in, the room was o.k. and the breakfast was not bad. However there just appeared to be something missing in the general enjoyment of the stay. I experienced the same in a sister property. It seems that Hilton feels that they do not have to try hard due to high turnover of short stays,", "Date": "November 17, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "3", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Saint Petersburg, fl", "Title": "“Frequent Visitor”", "Author": "hooveraa", "ReviewID": "UR120664521", "Content": "I visit the Phoenix area 5-10 times a year, and this is one of the two hotels that I always stay at. For the value and convenient location, this is best place to stay near the airport, hands down. The rooms are pretty night (4 out of 5), and they are stocked with mini-fridge and microwave, which are bonuses in the price range for this hotel. I rate the rooms with only a 4 because of the beds - most Hilton hotels have very VERY comfortable beds. The beds in this hotel are particularly hard and inconsitent with the other many Hilton hotels I stay in. However, the breakfast (make to order omelets, french toast, pancakes, etc) is superb! This is no ordinary continental breakfast. The coffee in the loby is also pretty good. On another note, I have seen a lot of postings on checking in early. This is a busy hotel. I have had the same issue, but it should be expected, not frowned on. Check in is at 3pm (I beleive), and don't expect to check in early.", "Date": "November 16, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Chicago, Illinois", "Title": "“Ok Hilton Garden - Expect more from Garden Inn.”", "Author": "daskoterzar", "ReviewID": "UR120396764", "Content": "I am a diamond Hilton Honors member. Stayed here on Nov 3 thru 5th. Check in for me was a challenge. I arrived a little early at 1:30pm and inquired about check in and was told my room wasn't ready. I told the front desk that would wait in the restaurant part of the lobby and work using their wifi. While waiting, the front desk staff came over to another traveler who was also waiting bringing along his key and registration. Then, I watched 5 or 6 people walk in and check in without a delay. I waited for more than an hour and then inquired and was told my room was ready. Why no one came over to tell me, not sure. The breakfast is a free-forall, very crowded, dirty tables, no clean silverware out on the tables. The place appeared to be overwhelmed. The room service was excellent. The neighborhood was not nice and was warned not to walk after dark. The AC was pretty loud, but worked. The room's cleanliness was OK, the room wasn't vacumed while I was there. Very close to the airport and the staff for the most part were good, with the exception of the confusion at check in.", "Date": "November 9, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "3.0", "Value": "2", "Sleep Quality": "3", "Rooms": "4", "Location": "4"}, "AuthorLocation": "", "Title": "“Good Hotel”", "Author": "AlbertNags", "ReviewID": "UR120161430", "Content": "Nice hotel, however the rate which our travel department got compared to the rest of a 2 week itinary was not good value for money in my opinion. Coupled with the noisy room airconditioning (mentioned elsewhere) I scored this hotel down. Noticing a trend that Hilton Garden Inns have noisy air conditioning units in the bedrooms, certainly starting to influence my hotel selection when travelling. Parking was easy (and free), check-in was pleasant, loyalty card guests get a couple of bottles of water thrown in also. My room was on the 7th floor, directly off the elevators, I'd normally head straight back down and ask to change room but it was getting late, I'd had a long trip and just wanted to get some rest before an 18 journey the next day. Pleased to say that I never heard any noise from the corridor (maybe in part due to the room air conditioning:-) ) Room itself was very good, clean with everything I needed. Internet worked fine (adequate speed) and there was a good selection of decent TV channels. I did order room service, thought the selection was a bit thin & a little expensive, however the food delivered was very good. Alarm call next morning was on-time. Breakfast was a really good experience, totally unexpected. Selection of food was excellent and the cooked to order food was very good. Special mention also to all the breakfast room staff, chef was jovial & the waiting staff were very attentive (not too much) and worked very hard to clear & clean tables etc. Plenty of smiles. The lady who seemed to be in charge of the area was very friendly also, offering to top up coffee & go and get additional items etc. for guests. Only slight concern for the hotel is that I could quite easily not paid, but was happy to make sure I did (think it was $12.99). No issues with check-out, fuss-free.", "Date": "November 4, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Location": "3", "Rooms": "3"}, "AuthorLocation": "", "Title": "“Stay here for early Phoenix flights”", "Author": "Travlnlots", "ReviewID": "UR119627115", "Content": "New Hilton hotel is clean and convenient. For early morning phx flits this is the place to stay. Great for business travelers\" free wifi, business center and gym. Inouse restaurant is good for breakfast. Only a short shuttle ride to Mill Ave. near ASU", "Date": "October 23, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "2.0", "Value": "3", "Sleep Quality": "1", "Rooms": "3", "Location": "4"}, "AuthorLocation": "california", "Title": "“aircon too loud”", "Author": "explore2b", "ReviewID": "UR119538385", "Content": "nice clean hotel except 2 problems; aircon very loud (compared to others in area that I could not sleep) and there's no room service.", "Date": "October 21, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "1", "Overall": "2.0", "Value": "1", "Sleep Quality": "3", "Rooms": "2", "Location": "1"}, "AuthorLocation": "Texas", "Title": "“Disappointed”", "Author": "alanndon", "ReviewID": "UR119534985", "Content": "Pro's Very nice staff, except dining room staff; allowed early check-in; would call for transportation; held baggage after check-out until ready to depart for airport; internet reception was good, room service/dinner was very good, bed was comfortable. Con's 1. Bad neighborhood (staff advised not to walk after dark) 2. No bench/seats out front to wait for taxi's - transportation 3. Not convenient to downtown convention center as stated when I called - have to take a taxi or light rail. Light rail quite far from hotel, even though staff stated it wasn't far after I arrived. Nothing located closeby - within safe walking distance for meals, shopping, etc. 4. Restaurant only open for breakfast and dinner. Bad part of town and no place close/safe to walk to eat. 5. King rooms do not have a bath tub. 6. Hot water not hot, barely warm. 7. Maid service, even with tip was less than desirable. Coffee cups/single drinking glass in room never washed/exchanged for clean. One cup had a distinctive chip in it so it was easy to tell they were not changing them out. Didn't clean coffee pot either. 8. Only use VIP taxi service. Long wait for taxi 35-40 minutes and fees were much higher than the other companies I contacted on my own for transportation to same destinations. Must have a contract or get a commission from the company. 9. Breakfast dining staff acted inconvenienced when arrived for breakfast 10 minutes before closing, tried to discourage usage. (staff were boxing up food for what I believe was for personal use as they were putting it in disposable containers) Staff made comments such as \"do you have a coupon\" when I answered no they attempted to discourage me again by saying the breakfast was $11.95 and they were in the process of putting it away. Toaster had been shut off, etc. Again, it was 10 minutes before the scheduled closing. 10. Very small pool, hard to call it a pool. Just enough of one to say they had one. 11. Very small work-out area. Again, just enough equip. to say they had one. Would have given it a 1, but the staff were nice. Almost felt sorry for them having to work in such a hotel because they were nice people. I'm not sure how they received the higher ratings unless it was just based solely on the staff being nice.", "Date": "October 20, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Inkster, Michigan", "Title": "“Completely Satisfied”", "Author": "LaToya N", "ReviewID": "UR119300655", "Content": "I would like to start by saying that the shuttle driver was very kind and polite. When my family and I walked through the Hilton Garden Inn doors the lobby was very clean and in order. The front desk clerk was nice, and polite she had a beautiful smile on her face while greeting us. The room was neat and clean, and my daughter and I loved the spa/pool area. I will stay at Hilton Garden Inn very soon!", "Date": "October 14, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "3", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Nashville, Tennessee", "Title": "“Big Rooms, It's a good place”", "Author": "2tired2choose", "ReviewID": "UR119226553", "Content": "First thing you will notice is that it's larger than most HGIs. Very clean, large restaraunt with a good menu. Business center has everything and fitness center is very good. Pool is right next to the road and small. The staff seems 1/2 asleep. They are polite, helpful - just - sleepy and not very professional. If you are coming here for business, it will be just fine. If you are travelling with family and won't be in the hotel for an extended period of time, I recommend it. *You will need to call and schedule the hotel shuttle in advance. If you are a VPN user, the wi-fi disconnects constantly and it's a bit frustrating.", "Date": "October 12, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Sleep Quality": "4", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Houston, Texas", "Title": "“Comfortable stay”", "Author": "FitTraveller_85", "ReviewID": "UR118870026", "Content": "Clean rooms, nice fitness area, it would have been nice if they had a proper pool for doing laps for those who like to stay fit while travelling. Breakfast was excellent. The bed was comfy even though i think the dial that controlled the softness of the bed was not working.", "Date": "October 3, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "3", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Fort Collins, Colorado", "Title": "“A Great Hilton!”", "Author": "Freedomgirl11", "ReviewID": "UR118575352", "Content": "We stayed here only for one night after flying into Phoenix late and not wanting to drive the two hours to our destination at night. The customer service was very good and the room was updated and clean. The breakfast offered in the morning is great food! Much better than an other hotel where there is a continental or full service breakfast. The shuttle ride was quick and easy and the driver took us directly to the Car Rental garage where we needed to go instead of just the airport terminal. A quick stay, but was enjoyable and easy!!", "Date": "September 25, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Baltimore, Maryland", "Title": "“We will be back....everything was GREAT:):):)”", "Author": "faye t", "ReviewID": "UR117752672", "Content": "I was stuck in Phoenix Airport..... August 2011. U.S. airway sent me to the Hilton Garden Inn.....it was the best, EVERYTHING about it was the Best. When ever I'm in Phoenix this will be the hotel I will stay in. Thanks for everything. I had a wonderful stay. Thanks!!!", "Date": "September 6, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Philadelphia", "Title": "“Excellent Customer Service”", "Author": "PhillyLover", "ReviewID": "UR117727416", "Content": "Unexpectedly became ill on a flight through Phoenix and the airline recommended this hotel for the night. The van ride over was quick and easy, as was check in. I was particularly thankful since I wasn't feeling well. Spent two days at the hotel and the stay was great. the front desk staff were top notch and the rooms were comfortable. Thank you to the staff!", "Date": "September 5, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Vancouver, Washington", "Title": "“\"Over the top\" service... WOW!”", "Author": "john a", "ReviewID": "UR117557393", "Content": "My wife was flying home from Nashville with our four small children (ages 1-10). Her flight was delayed 3 hours and consequently they were not able to make their connection in Phoenix. The airline arranged for them to stay at the Hilton Garden Inn Airport North for the night - without any luggage/diapers/milk/clothes/pajamas/bathroom supplies/etc. They were going to arrive at midnight. When their flight left Nashville, I flew into action and called the hotel. I explained the nightmare my wife was living through, and was reassured by the staff that they would take care of my family. I asked for ridiculous things (diapers, bottle, milk, bathroom supplies, a crib in the room, etc). AND THEY DELIVERED! They sent their driver out on a \"run\", got everything needed/asked for, and had it in the room ready for them when they arrived. They even put them in a larger room than normal. I can't express my appreciation and satisfaction enough to this amazing crew. These people (from the delivery driver to the manager) went over the top, above and beyond anything that should be expected. There's a reason I'm a Hilton Honors member and stay at Hilton Properties exclusively. And they just confirmed my choice. Thanks Hilton. You guys get it.", "Date": "September 1, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "MN", "Title": "“Zero Problems”", "Author": "davenak3", "ReviewID": "UR117287108", "Content": "Everything about this stay was excellent, from check-in to check-out. The room was very spacious, clean and unlike most hotel rooms, had an abundance of power outlets, both sides of the bed, in the bathroom, next to the coffee maker, etc. - this is about the first time I've not had to \"search\" for an outlet for my laptop, cell phone and Ipod - I normally carry a plug extension so I have enough outlets, it was not needed at this hotel. Breakfast was buffet or cooked to order or both, all for the same price; selections were good and good was great.Not much real close to hotel as far as things to do, but easy enough if you have a car to get just about anywhere, including Tempe or Scootsdale. Front desk personnel were super nice and even called after I reached my room to ask if it was ok or if I needed anything else. I'll certainly stay here again when doing business in the Phoenix area.", "Date": "August 26, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Phoenix, Arizona", "Title": "“Always a friendly staff and a spotless hotel”", "Author": "Susan V", "ReviewID": "UR116871974", "Content": "From the very beginning when I arrive at the PHX Airport, the Front Office Staff is friendly and courteous. Very informative and eager to help. The Hotel Shuttle is prompt when picking you up at the airport. A wonderful and cold bottle of water always awaits. The driver is informative about what is happening in the city. Again upon check in the Front Office Staff is always willing to help. From bags to a speedy check in, offering amenities and hotel benefits. The room is always perfect. Very clean and fresh. I personally love the walk in shower! And the pillows! WOW! A+ again! I always feel welcome when I arrive, am walking about the hotel or leaving...that's why I will be back.", "Date": "August 17, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "4", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Naples, Italy", "Title": "“Friendly, sincere service and modern, clean rooms and facilities”", "Author": "guinnw", "ReviewID": "UR116831728", "Content": "Prompt, complimentary airport pickup. Some of the most helpful and friendly staff across the board, from drivers to receiption. They even used the hotel van to drive my family to a local favorite mexican restaurant (we didn't have a rental car) at no charge. Overall, a wonderful place we will certainly visit again.", "Date": "August 16, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Redondo Beach, California", "Title": "“Best Hilton Garden Inn I always stay here”", "Author": "Paulette8907654532", "ReviewID": "UR116829206", "Content": "This Hilton garden Inn Airport-North is always clean, everyone at the front desk is friendly especially Richard and the breakfast is the best. I actually prefer the GHI because of the breakfast; it is fresh, hot and I suggest an egg white omelet. If you need a hotel by the airport stay at this one. The Hilton Hotel airport is not a good choice. Not at this airport anyway until they build a new one or upgrade the current one. I stayed there once and never went back. The HGI is nicer.", "Date": "August 16, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Phoenix, Arizona", "Title": "“Hotel and Staff are Awesome”", "Author": "Andy A", "ReviewID": "UR116783546", "Content": "I can not say enough about the service and staff. The breakfast in the morning have more selction then most hotels. The food has favor and your food is hot, fresh friut, yogart, and always plenty. The rooms are always clean and maid service is bar none. From the first day of check in I can not tell you how professional and made to feel you was family. I will continue staying at this hotel on ever vist in Phoenix Andy", "Date": "August 16, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Ithaca, NY", "Title": "“Incredibly helpful and friendly staff & very convenient to PHX”", "Author": "NERoth", "ReviewID": "UR116685106", "Content": "This is a typical Hilton Garden Inn, except that the staff is exceptional. This was our first visit to this property and we were impressed from the moment we walked in by the friendly, helpful service. The hotel is clean and well cared for and the rooms are relatively large and comfortable. Would definitely stay here again when I need a room convenient to the airport in Phoenix.", "Date": "August 14, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Indianapolis, Indiana", "Title": "“Overnight visit”", "Author": "NeverUnpacked", "ReviewID": "UR116384174", "Content": "We were flying space available, and there was no space for us. Stayed overnight here due to the location and hotel rating. It was a place to catch a quick bite and some sleep. The shuttle arrived quickly at the airport after we called for a room. Short ride to the hotel. All of the staff that we encountered were friendly and helpful, from the van drivers and front desk to the cleaning crew. Clean, comfortable room. Excellent recommendation for a quick meal (surprisingly good delivery pizza). Decent breakfast selection. For the price and location, this perfectly suited our purpose", "Date": "August 7, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Sarver", "Title": "“Loved the staff...loved the hotel”", "Author": "JPKuert", "ReviewID": "UR116356157", "Content": "Right from check in with Damika we felt warmly welcomed. Ouyvya (not sure of spelling was helpful setting up a little bed with spreads on the floor for our grandson because the hotel didn't have a cot. And the maids even made his little bed every day. Jim and Francesco the shuttle guys were always ready to ride us to the light rail or pick us up. Also the front desk people like Richard and Rafael and so hospitible . The breakfast waitresses like Cynthia were \"service with a smile personified\" Everything and everybody including the General Manager was great.", "Date": "August 6, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Brandon, Florida", "Title": "“We missed our flight but enjoyed the stay”", "Author": "tcordy1", "ReviewID": "UR115824926", "Content": "Arrived at 2 am after being dumped in Phoenix by the airline due to bad weather. Called for pick up at the airport and we were on our way to the hotel within 8 minutes. Had just paid $200 per night in Las Vegas for a room that smelled like bleach and had no amenities. The Hilton was great at a third of the cost...refrigerator,microwave, coffee in the room, thick towels, ahhhh. Breakfast buffet the next morning was just $12 for the four of us compared to $100 in Las Vegas. Our teenage grandson kept exclaiming how great the sheets were compared to our \"luxury suite \" in Las Vegas. The staff was polite, helpful and pleasant. An overall great stay in unpleasant circumstances.", "Date": "July 26, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "4.0", "Value": "4", "Service": "5"}, "AuthorLocation": "Concord, New Hampshire", "Title": "“Practical and utilitarian”", "Author": "Cabota", "ReviewID": "UR115414948", "Content": "No frills in this one. A little dated, but clean. The shuttle to the airport was timely and the staff was very friendly. Not a place I'd want to hang out at, but it does the job!", "Date": "July 16, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Houston, Texas", "Title": "“Great Services!”", "Author": "Houstrvl", "ReviewID": "UR114906989", "Content": "Was at the hotel for a meeting. Great sleeping room and Thomas the server was fantastic!", "Date": "June 30, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "5", "Overall": "4.0", "Value": "5", "Service": "4"}, "AuthorLocation": "Phoenix, Arizona", "Title": "“I'll be back.”", "Author": "harley814", "ReviewID": "UR114884931", "Content": "I reviewed this hotel earlier this year, after I had been disappointed with the service and staff. To be fair, I have to submit a new review after staying here several times this year, and I have seen much improvement in the level of service and the friendliness of the staff, and they go out of their way to provide a good experience for their guests. The location of the hotel is very convenient (if you have a room in the front of the hotel you overlook the runway of PHX airport), free wireless Internet, free parking, cooked to order breakfast, coffee pot and refrigerator in rooms. This is my new home when I have business in the Phoenix area.", "Date": "June 29, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Vancouver, Washington", "Title": "“Nice airport location, best sheets ever”", "Author": "Judy0549", "ReviewID": "UR109999251", "Content": "Good place to stay between flights. Be sure to verify that you have breakfast included or you will be billed $12 per person! Rooms clean, big, linens nice! Nice staff. Shuttle service.", "Date": "May 26, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "3", "Sleep Quality": "3", "Rooms": "5", "Location": "5"}, "AuthorLocation": "De Pere, WI", "Title": "“Close to airport”", "Author": "Jodie1906", "ReviewID": "UR103959623", "Content": "My husband and I recently stayed at this location on our last day of vacation prior to flying out of Phoenix. It is very close to the aiport and offers a free shuttle. There really isn't anything else nearby (walking distance) to see or do. But there is shopping, dining and hiking nearby - within driving distance. If you don't mind a short drive and are looking for a few more things to do close by, I would suggest the Scottsdale area. It was a beautiful area with lots of shopping and restaurants. But, this is a nice hotel, very close to the airport if that is what you need.", "Date": "April 13, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Abbotsford, Canada", "Title": "“Location, Location, Location”", "Author": "Cindy09_09", "ReviewID": "UR102492528", "Content": "My family and I stayed at the Hilton Garden Inn Phoenix Airport North for several days. The staff were friendly and helpful. The rooms are very spacious and the comfortable beds provided restful sleeps. The buffet breakfast offered many tasty items. This hotel is in a great location. It is extremely easy to get to \"must see\" sights and anywhere else we wanted to go. I highly recommend this hotel and would definitely stay here again.", "Date": "April 2, 2011"}, {"Ratings": {"Service": "2", "Cleanliness": "2", "Overall": "3.0", "Value": "3", "Sleep Quality": "4", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Phoenix, Arizona", "Title": "“nice hotel but service lacking”", "Author": "harley814", "ReviewID": "UR101963872", "Content": "The room that I eventually got was clean and well-appointed, the hotel is close to the PHX airport and is convenient to my business locations in Tempe and Phoenix. They offer free breakfast, free HS Internet, free parking. Unfortunately, I was assigned to a room with two double beds although I reserved a king suite. They told me the suite was not available and put me in a second room with king bed. That room had a bed that had obviously been slept in with crumpled sheets and pillow cases semi-straightened out, and leftover materials from the previous guest such as unused coupons and shaving cream container and used soap in the shower. The third room was OK, but directly across the hall from the elevator. The first morning I was there they failed to deliver the promised free newspaper to my room. When I went to the desk to ask why my neighbors got newspapers and I did not I was told that they were shorted papers and had to only give them to Hilton Honors guests. The fact is that I am a Silver member of Hilton Honors and that was reflected on my registration. That night I went to the lounge during happy hour and asked for a Tanqueray martini, and they had run out of the Tanqueray and said they had to order more. Four nights later, still no Tanqueray. The service at this location needs a great deal of improvement, and if I were running the place I would find someone who could provide the right leadership to improve housekeeping and front desk personnel.", "Date": "March 28, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "new hampshire", "Title": "“Excellent Airport Hotel”", "Author": "greylaggoose", "ReviewID": "UR100819210", "Content": "This hotel does exactly what it needs to do - it provides comfortable lodging and friendly service at a location convienient to the airport. The rooms are clean and provided a great nights sleep. We had a delicious dinner at the restaurant the night of our arrival, with a complimentary glass of wine, and the morning breakfast sent us happily on our way. The staff is the true strength of this hotel - they were friendly, attentive and helpful. The location is good in that it is convienient to the airport - it did not seem to provide a lot of other nearby attractions. If you are arriving late at night, I would advise taking a little extra care in the parking lot .", "Date": "March 20, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "1", "Sleep Quality": "2", "Rooms": "2", "Location": "3"}, "AuthorLocation": "Denver", "Title": "“Not Great.”", "Author": "sunytrvler", "ReviewID": "UR96975635", "Content": "This was one of the most expensive Hilton Garden Inns/ or any hotel of this category. So I was shocked to see so many stains on the carpet, hard bulges in the carpet (hurt to walk on it!), gross food and loud door slams all morning. Upon check in, the girl said I didn't get a free breakfast. Ok, fine, but when I asked someone else the next day, he gave me free vouchers (thank you). I ate dinner here - mistake. I felt like I was in a hospital cafeteria. From the atmosphere (bright lights and sterile) to the quality of food (tasteless, cheap quality). Ick. Breakfast wasnt any better. Eggs were rubber, oatmeal was goo and the omlete tasted like lighter fluid. I did like the hot water! It didnt taste like coffee - but tea!", "Date": "February 17, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "3", "Sleep Quality": "5", "Rooms": "5", "Location": "3"}, "AuthorLocation": "Pittsburgh, Pennsylvania", "Title": "“One of the best hotels I've been in, I travel alot and I'm very picky!”", "Author": "Burghette", "ReviewID": "UR94319823", "Content": "The shuttle from the airport was quick and the driver was very friendly. The staff was friendly and check-in and check-out was easy. The hotel is new, clean, and comfortable. The room was spacious and quiet. Many reviews said the location was sketchy but really no worse than any other large city airport area. The only real problem was that I got in at 8pm and the restaurant had already closed. Bottom line - really enjoyed my stay.", "Date": "January 24, 2011"}, {"Ratings": {"Cleanliness": "5", "Overall": "4.0", "Value": "3", "Sleep Quality": "5", "Rooms": "5", "Location": "3"}, "AuthorLocation": "USA", "Title": "“close to airport”", "Author": "UsaRunner", "ReviewID": "UR93452924", "Content": "Great location, quiet room. The staff was very helpful. Had a room with a king bed in it. Very comfortable. They gave us a coupon for a free drink for each of us. Nice touch!", "Date": "January 17, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "3", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Cleveland, OH", "Title": "“A+ hotel just doing the basics.”", "Author": "TechnicalTraveler_9", "ReviewID": "UR93408982", "Content": "This place knows what to do to keep your hotel stay stress free. It's the little things that count and they have them covered. For example, the dining area is spaciously laid out so that you never feel crowded or awkward. The breakfast offerings are a cut above and your service is as good as any upscale hotel. Better, even. I have never felt more welcome at the front desk than here, as a minor issue came up and was handled very smoothly with no problems afterward. The rooms have absolutely no smell and are conspicuously clean after each daily treatment.", "Date": "January 17, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Birmingham, Alabama", "Title": "“Staying like a champion”", "Author": "jdub30375", "ReviewID": "UR92876635", "Content": "We stayed at the Hilton Garden Inn for the BCS Championship game. Everything at the hotel was great. The facilities are spotless and the staff was very helpful and friendly. It was very convenient to the airport (but no airport noise) and took us only 15 minutes to get to and from the airport during rush hour time. It was very accessible to roads and we could easily get to Scottsdale and Glendale for all of the game activities. The only negative was there wasn't much around the hotel, but it wasn't really a negative for us because we spent most of our time in other parts of the city. But, it was conveniently located for all of our activities.", "Date": "January 14, 2011"}, {"Ratings": {"Cleanliness": "5", "Overall": "5.0", "Value": "3", "Sleep Quality": "2", "Rooms": "2", "Location": "3"}, "AuthorLocation": "Toronto, Canada", "Title": "“Would certainly come again”", "Author": "155019Nancy", "ReviewID": "UR88530286", "Content": "We found everything to exceed our expectations, and the friendliness and helpfulness of the staff was superb. Loved being close to relatives and the airport, and grateful for the shuttle service.", "Date": "November 29, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "2"}, "AuthorLocation": "Bellevue, WA", "Title": "“Nice Service”", "Author": "CougarTraveler", "ReviewID": "UR86014342", "Content": "I stayed at this hotel on a business trip. They have an airport shuttle which did pick me up late at night and return me to the airport early in the morning. I thought the breakfast was pretty good, though not the best I've had at an HGI property. I thought the chef did a nice job making some entrees, but the other hot options didn't taste the best. There were plenty of places to sit in the restaurant which is better than some HGI properties with restaurants. The area around the hotel is not the best, but not awful. I ate at a nearby barbecue place called Big Apple. The food was pretty good, but the service was really slow. There's not much around the hotel besides the restaurant mentioned above, but there is a light rail stop nearby. I had a couple of issues during my stay, such as the TV losing its signal, but the staff quickly went to work. They did offer some benefits to Hilton Honors Gold members that were nice. The business center was helpful.", "Date": "November 4, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "3.0", "Value": "2", "Sleep Quality": "3", "Rooms": "4", "Location": "2"}, "AuthorLocation": "Jacksonville, Florida", "Title": "“Great hotel in not-so-great area”", "Author": "thegoodsongs", "ReviewID": "UR83235590", "Content": "Once you get inside this hotel, you \"feel\" safe regarding the surrounding area! The staff makes you feel welcome and the rooms have a new feel to them. The only problems we encountered was that one of the rooms had a toilet that wouldn't stop running water once you flushed it and the shower had no shower curtain! We called the front desk and they sent someone to fix the problems within a decent amount of time. If you have to stay near the airport, then this hotel will probably do the job just fine. If you need to eat at nearby restaurants - there aren't any. There is a hotel restaurant, but we didn't try it.", "Date": "October 12, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Midwest Illinois", "Title": "“Nice hotel in a sketchy area close to the airport”", "Author": "l0vebug", "ReviewID": "UR82246165", "Content": "Clean, nice, comfortable, spacious rooms. Good bathrooms as well. The area is close by to the airport, however, it does look sketchy nearby. I'd recommend for a good, decently priced hotel near the airport. Free wifi.", "Date": "October 5, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Tampa, FL", "Title": "“Great staff and fantastic hotel”", "Author": "leta0131", "ReviewID": "UR82057773", "Content": "We stayed at this hotel when we flew into Phoenix on our way up to the Grand Canyon and Havasupai indian reservation. The staff is excellent and always smiling. The rooms were clean and spacious. We liked it so much, we stayed again on the way out of town.", "Date": "October 4, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "3", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Los Angeles, California", "Title": "“Very comfortable hotel”", "Author": "daymeeyan", "ReviewID": "UR81756278", "Content": "Last time in Phoenix I stayed at the Hilton Garden Inn south of the airport. This time I couldn't get a room there so opted for this one which is north of the airport. The rates are slightly higher, but that is because the hotel is in much better condition. Service was excellent from the front desk to the restaurant. The room seemed so new and comfortable. Free internet throughout the hotel although a bit slow (0.5Mbps down and 0.1Mbps up). Great selection of TV channels. Comfy bed. Nice bathroom with walk in shower. Business center to print off boarding passes. The restaurant seems to have good dinner selections, but limited vegetarian dishes. That would be my only complaint. I did see the pool which is in an awkward location. Right on the front side of the hotel where people on the street can see into the pool area. I didn't have time to use it, but I doubt I'd be comfortable in the cramped area visible from the parking lot and street. The pool at the Airport South location was way better if you are looking for a nice pool. I'll definitely be back on one of my many upcoming business trips to Phoenix.", "Date": "October 1, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Sheffield", "Title": "“Nice room in a new hotel that was...”", "Author": "Tiptoptraveller", "ReviewID": "UR80092457", "Content": "Nice room in a new hotel that was comfortable and well-appointed with fridge and microwave. Good breakfast with eggs cooked to order. Handy for the airport but no aircaft noise. The only downside is the noisy, rather primitive air- conditioning.", "Date": "September 18, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Clearwater", "Title": "“Great nights sleep”", "Author": "bizzybear", "ReviewID": "UR78136750", "Content": "Beds at this hotel are wonderful, haven't had a good nights sleep like this in a long time at a hotel. Upon check in I could tell I was going to have a wonderful stay, the front desk was very friendly and how could anything be wrong with the warm cookies sitting there waiting for me. I would definately stay with this property again, it was a great value and had everything that I needed to have a successful business trip to Phoenix, this will be my first choice when coming into the area. Thank you to the wonderful staff for making my stay a great one!", "Date": "September 3, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Location": "3", "Rooms": "4"}, "AuthorLocation": "", "Title": "“Pleasant and comfortable stay.”", "Author": "VFitaly", "ReviewID": "UR75709550", "Content": "Fairly new hotel, quiet and nice rooms. Very helpful and friendly staff. Housekeeping not flawless (i.e. used towels and other items randomly replaced...) Definitely a hotel we would recommend.", "Date": "August 18, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Richmond, Virginia", "Title": "“Great place to stay near the airport”", "Author": "AreWeThereYet1973", "ReviewID": "UR75292013", "Content": "Super value for the money. We stayed here to be near the airport for an early flight after a cross-country car trip. The rooms are modern and comfortable with all you could need. The pool met the needs of my kids. The free shuttle to the airport leaves every half hour and was perfect. The staff was professional and friendly. There doesn't seem to be much immediately surrounding the hotel but since we weren't there to sightsee, it didn't make any difference to us.", "Date": "August 15, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Phoenix, Arizona", "Title": "“Great price, service, and hospitality”", "Author": "rproenza", "ReviewID": "UR74290565", "Content": "I was on business travel for my 10 day stay. The hotel was clean, modern, and very comfortable. I especially enjoyed the adjustable comfort beds. The location was convenient for shopping, eating, and site seeing (close to loop 101). I would definitely stay here again.", "Date": "August 8, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Hawaii", "Title": "“Beautiful, clean hotel close to airport”", "Author": "SandyHI", "ReviewID": "UR68790955", "Content": "Arrived at midnight and wanted someplace close to airport to rest before heading out to the Grand Canyon. Fact check-in, pleasant hotel staff, quiet & clean room. Didn't get a chance to use any services, however, we did note an adequate pool and a small nook for convenience purchases in the lobby. Would consider staying here again despite its location, especially if arriving or departing the airport at odd times of the day.", "Date": "June 27, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "3"}, "AuthorLocation": "Jacksonville, FL", "Title": "“Beautiful Inside, Great Rooms and Service, location questionable.”", "Author": "CimcoTraveler", "ReviewID": "UR68662249", "Content": "Very nice guest rooms and amenities. Service was outstanding as most HGI's are. I was very pleased with everything inside the hotel. The surrounding area wasn't the greatest but the location couldn't have been better. Minutes to the airport and to the Camelback corridor.", "Date": "June 25, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Dallas, Texas", "Title": "“\"My Home Away From Home.\"”", "Author": "gsh2010", "ReviewID": "UR67193745", "Content": "MY HOME AWAY FROM HOME I travel a lot. Where I call home is very important to me. When my business requires frequent, almost weekly travel to Arizona, I know I have choices where to stay. My only choice and where I always stay is at The Hilton Garden Inn Phoenix Airport North. “My Home Away From Home.” They say that a productive day begins at night. From the moment I walk in, I get greeted at check-in with warm, sincere, familiar faces and a very friendly, “Welcome back!” from great associates like Damikka and Desiree. Just like home. My room is spacious, comfortable, clean, and functional. I appreciate my flat screen tv, a large desk with more than sufficient lighting, a bed that has a feel like your floating in a cloud, and of course awesome temperature control. Just like home. My Hilton Family are all very engaging, friendly, and always finding little ways to be courteous and ways to make my stay enjoyable. Just like home. The breakfast buffet has never let me down. The restaurant team of Paula, J.D., Cynthia, Emelia, and Enrique are ALL top notch and extremely professional. They make it look easy. Just like home. Walking through the lobby, you just get that immediate feeling you’re at someplace special. Rich, pristine, and inviting. The 24-hour Pavilion Pantry is always stocked and open for snacking. Just like home! The General Manager, Michael and Sales Manager, Daniel always find time to have great conversation with me in spite of their busy schedules. Just like home. Bottom line . . . I ALWAYS feel better than a guest. My Hilton Garden Inn Phoenix Airport North IS “My Home Away From Home.” Conrad Hilton would be proud of this team. Sincerely, Gary H.", "Date": "June 11, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "4", "Rooms": "5"}, "AuthorLocation": "holywood,n.ireland", "Title": "“Great for an over night stay and very close to the airport.”", "Author": "polar1", "ReviewID": "UR66072964", "Content": "Enjoyed a 1 night stay before catching an early morning flight. Found the hotel to be an oasis of calm following a long drive in 90 degree temperatures plus a long traffic jam on I 17. Hotel still has a new feel with bedrooms well equiped. The ony minor downside was that the hotel while very close to the airport appeared to be in a fairly desolate area. Also the air con in the room was quite noisy otherwise no cplaints!", "Date": "June 1, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "3"}, "AuthorLocation": "Denver", "Title": "“Decent place for a business meeting”", "Author": "paulpjo", "ReviewID": "UR60688988", "Content": "This is a new hotel and the rooms were new and clean. It was not too expensive and close to the airport, so it was a good place to gather 20 people from across the country. There is not much around it, so make sure you have a rental car to get to restaurants, etc. Service was decent and the meeting rooms were adequate. All in All a little better than I might have expected for the rates. Downsides were that many of the group had to wait quite awhile for their room to be ready to get checked in, and the restaurant doesn't serve lunch.", "Date": "April 7, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "3"}, "AuthorLocation": "Toronto, CA", "Title": "“Great hotel, a little pricey, good location if you have a car”", "Author": "EverywhereAndBack", "ReviewID": "UR60648267", "Content": "The hotel was clean and the rooms were nicely decorated. The hotel and furniture were in good shape. They also had a little 'shop' downstairs where you could purchase snacks and small frozen meals. The room service was fast but after the gratuity charges and another surchrage the waitress still lingered about for a tip. I didn't like her. My room was also not cleaned on my second day because I was in my room the two consecutive times the cleaning lady knocked. I told her to come back in an hour. She didn't. But they were very nice aout bringing the beauty products that weren't restocked as a result of the room not being cleaned up to me very quickly. I found Phoenix quite small and it was about 20 minutes to most points of interest. The hotel was fairly central. Less if I knew my way around a bit. If I were to go again I would get a place closer to Tempe where there was actual life on the streets. If you do decide to stay at this hotel make sure to go to the Chinese Cultural Centre enarby to eat and check out the amazing grocery store. The only significant shortcoming of the hotel was it's pool. I expected something nice and large but instead it was a small pool surrrounded by iron gating in the front of the hotel so you were kind of on display to the people parking and checking in. It would be nice if the pool surrounding were a little more lush at least.", "Date": "April 7, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "3", "Sleep Quality": "5", "Rooms": "5", "Location": "2"}, "AuthorLocation": "Newport, Oregon", "Title": "“New Facility, Great Stay”", "Author": "Wally54", "ReviewID": "UR60603806", "Content": "Stayed here the night before an early morning flight out of Phoenix. This hotel appears to be new; all amenities are very up-to-date. Beautiful room. Spent Happy Hour in the hotel bar; it had specials on appetizers and the beer was very cold! Only five minutes to the hotel by its shuttle. Not much in the area near the hotel. If you don't have a car, plan to eat in the hotel restaurant - nothing really near by. We will stay at this facility again when in Phoenix and need to be near the airport.", "Date": "April 6, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Roseville, California", "Title": "“Great New Airport Hotel”", "Author": "drichrx", "ReviewID": "UR59666617", "Content": "Very nice, very new, Hilton Garden Inn that is above average for this chain. Room was very clean. Love the showers without tubs. Plenty of free parking, and free internet, but not near anything but the airport.", "Date": "March 27, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "3.0", "Value": "3", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Calgary, Canada", "Title": "“Nice hotel, clean and adequate.”", "Author": "TheWinger", "ReviewID": "UR58823300", "Content": "I recently had 2 separate stays at this property for a total of 5 nights. I am not too bothered about the local area, and the hotel itself was clean and the beds very comfortable. I can't see anyone wanting to use the pool as there isn't really any privacy from the front street and from people entering and leaving the hotel. Internet was reliable, and tv in room was nice. As a Hilton Diamond member I wasn't offered an upgrade on either stay, but did receive breakfast. I thought all staff I had dealings with were very pleasant except for 1 waitress in particular during breakfast who took my drink order twice and seemed flustered because I asked for chocolate milk and both times didn't bring it out. The cook doing the breakfast was a very nice fellow and remembered what I wanted for breakfast during my 2nd stay. I have stayed at several Hilton locations in the Phoenix area and I would consider this hotel again if the rate was reasonable.", "Date": "March 17, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "3"}, "AuthorLocation": "Seattle", "Title": "“Excellent Inside”", "Author": "mooresn", "ReviewID": "UR58018326", "Content": "Stayed for business for three days. Driving there, I was worried about the \"local residents\" but I guess ALL cities near the airport have their questonable people. Good news ... the hotel was just past that. The interior is beautiful. The room was comfy with all amenities to include a great <included> breakfast (I wasn't there for any other meals or happy hour) I booked here as it was fairly clsoe to my business and rated the #2 hotel in Phoenix. Did not disappoint. Gym was suitable. A *small* pool was in front next to an arterial (I don't know about taking a dip as the traffic flies by) If a pool is what you're looking for, this may not be for you. But if you are looking for an attentive/friendly staff, excellent bed, and good hotel inside, this is your place. 4 out of 5 for the price ($119 per night) I jogged through Papago Park and climbed Camelback Mountain. Fairly close to both.", "Date": "March 8, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "1"}, "AuthorLocation": "New Mexico", "Title": "“Nicest HGI I've Stayed At”", "Author": "BiznessClass", "ReviewID": "UR57655950", "Content": "This hotel is 10 stories high, and the classiest Garden Inn I've ever stayed in (and I've stayed in a lot). Typically, you'd expect the white tile entry with the chandelier and the Golden Girls furniture. Not here. This place is like walking into swank W or the like, with a great bar stocked with flat screens, and very courteous staff. The room was great with all of the latest amenities, and here's (sadly) one of the best parts- outlets everywhere! No struggle to plug in my iPod, Blackberry, laptop, Bluetooth- plenty of electrical current to spare! The only dig on this place is its location- although in good proximity to the airport, Van Buren is known to be one of the raunchiest parts of Phoenix, and this hotel sticks out like a 10 story sore thumb. Great hotel, just stay indoors after the sun goes down (unless crack and prostitutes are a part of your business trip).", "Date": "March 3, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "3", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Portland, Maine", "Title": "“Comfortable, Convenient Airport Hotel”", "Author": "IronChefNeva", "ReviewID": "UR57580413", "Content": "This Hilton Garden Inn was a comfortable, clean, and convenient airport hotel. I stayed one night on a layover during a business trip. The airport shuttle bus was prompt and the driver was courteous and helpful. The room was clean and everything worked. The bed, however, was a little hard so I had some trouble sleeping. The breakfast was good, but a little on the expensive side.", "Date": "March 2, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "3.0", "Value": "2", "Location": "2", "Rooms": "4"}, "AuthorLocation": "calgary, Canada", "Title": "“Up to Hilton standards-however-”", "Author": "marfster", "ReviewID": "UR54033406", "Content": "I have stayed in a number of Hiltons lately and have found the quality to be very hit and miss. This one is, like a lot of Hiltons, a 1960-70 hotel which they tried to bring up to modern standards. They have been mostly succesful. To be specific, the business center was great-24 hours, printer, etc, Also, the wi-fi is free. The staff is great and the breakfast ( not included in my ticket, but the lady at the front deal gave me a boucher anyway (cool) is also very good. However, the location is bad. It is clse to the airport, but it is in an industrial area. I would not be comfortable going out at night.", "Date": "January 21, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "4", "Location": "3", "Rooms": "3"}, "AuthorLocation": "Dallas", "Title": "“Good and recommended, but not worth the extraordinary rating”", "Author": "dsloantx", "ReviewID": "UR51481469", "Content": "The hotel is spacious and clean, the beds comfortable. The restaurant is unexpectedly good - our meal was simple, but well-prepared and perfectly cooked. The concierge was extremely helpful with our sight-seeing plans. On the minus side, our duvet was torn, the coffee service dirty with the previous tenant's coffee and not replenished. We ran out of hot water during showers.", "Date": "December 18, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Location": "3", "Rooms": "4"}, "AuthorLocation": "USA", "Title": "“Clean & confortable”", "Author": "iqlatino", "ReviewID": "UR51316125", "Content": "This is a good hotel, new, clean and good value. Free internet and parking and great free buffet breakfast. Nice modern decor, near the airport. Only complain is that the shower hot water was not very hot at all. The one on the sink was very hot, dont know why the shower's wasnt. Get the packakge with the free tickets to ride the new Light rail, very nice way to go around the city.", "Date": "December 15, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "McLean, VA", "Title": "“exceeded our expectations!”", "Author": "MMY86", "ReviewID": "UR49223941", "Content": "We are pretty discerning travelers, and it's rare we'd give a place 5 stars... but this place deserves it! Granted, it's not in a wonderful part of town...but for the ease/convenience to the airport, there is nothing that could match this place! And it's an easy 7-minute drive to downtown Phoenix. It's a new hotel and it shows... everything is absolutely spotless! The high floor room we got with the view of the mountains was lovely. Flatscreen TV, refrig, micro, coffee maker, highspeed and wireless internet...everything you'd need. The bed is amazingly comfortable; the bathroom/shower is spacious; the leather chair with ottoman is a nice touch. Very inviting lobby and nice restaurant attached with flatscreens; complimentary coffee/tea in the lobby available all day. The staff is so friendly and professional. You will not be disappointed with this place!", "Date": "November 15, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Salt Lake City", "Title": "“Amazing Hotel”", "Author": "golferjj1", "ReviewID": "UR41941509", "Content": "I stay in hotels about 40% of the year and this is the best hotel I've stayed in for a very very very long time. Anytime I go back to phoenix I will always book this hotel.", "Date": "September 15, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Location": "3", "Rooms": "4"}, "AuthorLocation": "Honolulu", "Title": "“That new hotel smell...”", "Author": "doyner", "ReviewID": "UR37215538", "Content": "Everything was new, the staff was great, and no detail was omitted. From the leather-bound (feaux, probably) bathroom to the high-end fitness facility, this hotel is the perfect retreat from the Phoenix heat. Although it is a good 30 blocks from downtown, the quality of the facility makes up for it.", "Date": "August 10, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "crawley uk", "Title": "“lovely brand new hotel”", "Author": "janieCrawleyUk", "ReviewID": "UR35683567", "Content": "Stayed here for one night after a very long flight .BEAUTIFUL ROOM ,very easy to find after the airport .It was the weekend and the area was very quiet .The hotel is new,and altho the pool is small it's all you need for a quick dip .The best thing was the breakfast .Superb .", "Date": "July 24, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Location": "3", "Rooms": "4"}, "AuthorLocation": "Southern California", "Title": "“Clean, New Hotel”", "Author": "Architraveler101", "ReviewID": "UR32184177", "Content": "Stayed for 2 nights while attending a wedding in Phoenix. The inside of the hotel was great. Multiple people I talked with at the front desk were friendly and courteous. We used the business center and they had free print outs for directions. The rooms and halls were all very clean - I think it was built recently, because everything seemed nice and new. We had a room on the 10th floor (near or at the top) and the view was quite expansive. Nothing great in particular to look at (we looked over the airport side, I think the other side had a nicer view of the mountains etc, but it was still a nice clear view for miles. It was kind of peaceful to watch. A few minor issues: the air conditioner was really loud in our room. Since we're not from Phoenix, maybe we're not used to how much it clicked on and off (summer stay) but when it came on you HEARD it! And the bed was on the firm side, even thought they claimed it could be \"adjusted\" softer, we couldn't tell. The neighborhood was more business oriented. It was perfectly safe, just nothing interesting going on. The hotel is right across the street from a community college, so on the weekends it was empty. There's NO restaurants within walking distance, but I guess everyone has a car in Phoenix anyways. And it was only a few minutes to get back to the airport to return our rental car. The pool was kind of laughable, about 10 feet wide and 20 feet long. Its right next to the main driveway (which is right next to the main road) and didn't have a privacy fence, so even though we originally thought we might enjoy the AZ sun, we ended up passing on going down there, since it seemed like it would have been like sunbathing on the sidewalk of a major street. I think this was a nice \"base\" for our stay in Phoenix - when we were inside the hotel it was perfect, especially when compared to other hotels we were looking at in the same price range (50-75 a night) Pool and A/C aside, I would definitely recommend it - it was great value for the money.", "Date": "June 12, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "North Carolinia", "Title": "“Best Hotel I have ever stayed in”", "Author": "Dixieland_Delight", "ReviewID": "UR30652792", "Content": "This is the best hotel I have ever stayed in. I called at midnight and asked for a military discount. I got a really nice room for sixty dollars. The man at the front desk was so nice. Definitely the best customer service I have ever had from a hotel. The beds were amazing. They were so soft you just sunk into them. There were plenty of blankets on the bed and a free breakfast. The towels were huge. Great hotel!", "Date": "May 24, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "4", "Rooms": "5"}, "AuthorLocation": "Far West Suburbs of Chicago", "Title": "“Great for an overnight near the airport.”", "Author": "DVCBob", "ReviewID": "UR30062865", "Content": "I traveled to Phoenix for a one night stay for business. I choose this location as I was coming in on an evening flight for an early appointment the next morning in Paradise Valley. I was greeted promptly upon arrival. My room was ready and received a gift of chips and salsa for Hilton Honors members. Room looked brand new and was spotless. Went down to the restaurant for a late dinner. Sat at a table for ten minutes but nobody came so I ordered at the bar. In all fairness it looked like the bartender was the only one there and he was doing the best he could do. Ordered the Mobley burger with fresh fruit instead of fries. Very good burger and some of the freshest fruit I have had in awhile. The bed was the most comfortable hotel bed I have ever slept in. Overall a great place to stay overnight if you have business in the area. The road to the hotel from the airport rental car center looks a little sketchy at times but the hotel is on the edge of a business/office district.", "Date": "May 15, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "4", "Rooms": "5"}, "AuthorLocation": "San Antonio", "Title": "“Great value, superb staff, nice views - excellent!”", "Author": "Maxesparents", "ReviewID": "UR29707466", "Content": "This new hotel represents an excellent value. Stayed two nights, they gave me exactly the room I had requested (ask for mountain view!). Quiet location, you will need a rental car to get around in Phoenix/Scottsdale (but anyone I know gets a rental here). Or use their airport shuttle. I was impressed by the modern and clean room, fast internet, modern flat screen TV, great shower, comfortable bed - and the overall friendlyness of the staff. Kudos to the breakfast service and the cook who makes exellent omelettes to order. Great choice of breakfast items. Fast elevators. I would repeat my stay without hesitation anytime.", "Date": "May 10, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "3", "Location": "4", "Rooms": "4"}, "AuthorLocation": "Surrey, England", "Title": "“Good airport hotel”", "Author": "surreyimp", "ReviewID": "UR29478632", "Content": "We were looking for an airport hotel to use for one night after a transatlantic flight that arrived in the early evening. This Hilton fitted the bill very well. The staff were uniformly friendly and helpful. For instance the shuttle bus driver insisted on unloading and moving our numerous bags (we were camping) but disappeared to help someone else before we could tip him. The barman was similarly friendly and chatty. And the barfood was good quality comfort food, Rooms big and clean as might be expected, and the shuttle runs to the airport every 30mins (call on landing to find out where to meet it). It was quite pricy despite booking six months in advance (180 USD) but otherwise perfect if like us you prefer to pick-up your hire car the morning after arrival.", "Date": "May 6, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Hawaii", "Title": "“Newly furnished and clean rooms, front desk staff needs upgrade”", "Author": "808travelers", "ReviewID": "UR25975522", "Content": "We chose this hotel because we are HHonor members, and are usually very well treated at other Hilton properties. Make friends with the shuttle van drivers, they are the ones who will get you places and are very helpful. The shuttle drivers took us to and from the Desert Botanical Gardens at no charge, and even offered to take us to a livelier part of town for some dinner between airport runs. The front desk staff did not impress us, nor were they very helpful as they seem to be too busy with other things. Overall, the hotel rooms are contemporary and very clean, they just need to train their staff to smile and be more accommodating. Restaurant off lobby had good food for the price.", "Date": "March 11, 2009"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "Atlanta, Ga", "Title": "“One of the best Hotel's you can stay at, Highly recommended!”", "Author": "lisajean143", "ReviewID": "UR24436082", "Content": "Mark Houser took excellent care of his guests including myself. I missed my flight with AirTran and they advised me to call the Nationwide Vendor Program. Nationwide Vendor Program referred me to this beautiful facility. I have never been in Phoenix before and Mark made me feel at home. I had no luggage with me and Mark went out of his way to provide me with a toothbrush. This is hospitality at its best! I highly suggest this hotel if you are planning a trip to Phoenix or if you have an overnight lay over at the airport.", "Date": "February 10, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Phoenix", "Title": "“Amazing”", "Author": "yogadoug", "ReviewID": "UR23374388", "Content": "Stayed overnight at this new Hilton Garden Inn just minutes from Phoenix Sky Harbor Airport. It's an amazing property. Rooms are large and bright and great views of the airport one side and mountains on the other!! Staff are very friendly and the amenities are first class. Can't be beat for the price .... PLUS, it's only a block from the 38th Street Light Rail station that takes you right into downtown or Tempe in just minutes for only $2.50/day unlimited rides! Would highly recommend!", "Date": "January 8, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "4", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Calgary, Alberta", "Title": "“Relaxing holiday”", "Author": "Westboundanddown", "ReviewID": "UR23374053", "Content": "Had a great stay at this hotel! The rooms were very classy, great bathrooms, flatscreen TV, super comfortable bed. The pool and hot tub were a perfect way to relax. The staff went out of their way to accommodate us and the rest of the hotel had a great atmosphere! I will definitely recommend this place to friends.", "Date": "January 8, 2009"}], "HotelInfo": {"Name": "Hilton Garden Inn Phoenix Airport North", "HotelURL": "/ShowUserReviews-g31310-d1176581-Reviews-Hilton_Garden_Inn_Phoenix_Airport_North-Phoenix_Arizona.html", "Price": "$78 - $214*", "Address": "<address class=\"addressReset\"><span rel=\"v:address\"><span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">3838 E. Van Buren</span>, <span class=\"locality\"><span property=\"v:locality\">Phoenix</span>, <span property=\"v:region\">AZ</span> <span property=\"v:postal-code\">85008</span></span> </span></span></address>", "HotelID": "2516180", "ImgURL": "http://media-cdn.tripadvisor.com/media/photo-s/01/60/ad/21/double-queen-bedded-room.jpg"}}