{"Reviews": [{"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "South San Francisco, California", "Title": "“Loved it!”", "Author": "Melvin C", "ReviewID": "UR128908019", "Content": "We were visiting LA with the whole family and planned to visit Universal Studios etc. Unfortunately, my dad made a reservation at some Motel 6 for $50. We arrived there and it was a nightmare. The rooms were dark and did not smell good. Also the neighborhood was scary!....so I decided to call this place because I had previously worked for a Comfort Inn in San Mateo, CA. From the moment I spoke to the front desk girl, I had a feeling this place was going to be better. I persuaded my dad to cancel our reservation at Motel 6 and we drove to this place and we loved this place from the moment we entered the parking lot. We paid $89 instead of $50 but it was worth it. This place was a life saver. The rooms were clean, neighborhood is great, Dannys in the parking lot, and a nice swimming pool.....we love this place and will definitely be back!", "Date": "April 27, 2012"}, {"Ratings": {"Service": "1", "Cleanliness": "4", "Overall": "2.0", "Value": "3", "Sleep Quality": "4", "Rooms": "4", "Location": "3"}, "AuthorLocation": "London, England, United Kingdom", "Title": "“Was good at beginning, then the nightmare began!”", "Author": "Sumant S", "ReviewID": "UR128565808", "Content": "Stayed here for 7 days and initially when I checked in, the woman at the desk was very warm and kind, she had a whole conversation with me and even gave me some good points on where to eat and go. The room was spacious and clean, although the toilet area was kind of small. Everything in the room worked, so bonus points for that, and the breakfast was fine. As I was near the main road and not the freeway, I heard less noise and had a comfortable sleep. Although the nightmare began when I checked out, they had taken my payment through on the night I left, as they do, my flight was 6 or 7 in the morning and I had left quite early, on arrival to the airport I looked through my bag and discovered that I had left my Ipod back at the hotel. When I had called the desk clerk and told him about my problem, he did not seem so bothered, refused to co-operate by saying he could not leave the desk for 2 mins. I finally asked a friend to pick it up for me in the afternoon and send it by mail for me, on arrival they had informed her that they would not give it to her on the grounds that I did not pay for my last night there. They had not informed me of this information and gave my friend grief about this, refusing to give my personal belongings and holding it as a down payment. Is this a hotel or a loans sharks hideout? my tip for anyone staying here would be, make sure you check you have all your belongings before you leave and stay there for just a few nights.", "Date": "April 25, 2012"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Geneva, Switzerland", "Title": "“Quiet hotel”", "Author": "bigcop73", "ReviewID": "UR125306977", "Content": "Very nice place to stay, quiet, out of center LA. Great pool, cool breakfast, Denny's beside, grocer Ralph's 2 minute walk.Highway not far if you want to drive to the beach", "Date": "February 27, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "2", "Overall": "3.0", "Value": "3", "Sleep Quality": "2", "Rooms": "2", "Location": "3"}, "AuthorLocation": "West Hills", "Title": "“Its ok, not the best”", "Author": "Lisa U", "ReviewID": "UR123412799", "Content": "You definitely get what you pay for. We had enough hot water for a 5 minute shower. Then we got a room with a king bed and only had 4 pillows and asked if we could get some more and they brought us just one pillow. Its suppose to be a nice area but its really not. But it does have a Dennys on the same property and a little shopping center across the street.", "Date": "January 21, 2012"}, {"Ratings": {"Cleanliness": "3", "Sleep Quality": "4", "Overall": "4.0", "Value": "4", "Service": "3"}, "AuthorLocation": "Point Roberts, Washington", "Title": "“In an area with not a lot of good choices this is one.”", "Author": "statue1", "ReviewID": "UR116274507", "Content": "A clean well run hotel in an ok location if you need to be in Woodland Hills Ca. A very nice pool area and a Dennys next door privide a good low priced trip. Lots of realy good resturants near by Mortons, Kate Madalini, Roys, Flemings and a lot more. It's easy to get to Universal Studios and Hollywood if the freways are not to bad.", "Date": "August 4, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "3", "Overall": "2.0", "Value": "2", "Location": "4", "Rooms": "3"}, "AuthorLocation": "", "Title": "“Rooms were clean, service was terrible.”", "Author": "Craig G", "ReviewID": "UR115511352", "Content": "Started when are room keys had to be reprogramed the first night. It got worse. Breakfast was from 6:30 to 9:30, but if you weren't there by 9:00 you didn't get anything. The staff stop refilling breakfast items about 8:45. On our second morning we discovered they had shorted us a bath towel. I went to the front to get one, but they were out. Housekeeping was supposed to deliver one in 5 mins. My wife finally had to dry off with a hand towel. The towel didn't show up for 45 mins. The next night they shorted us again. I would find someplace else to stay if I were you. I know I won't stay here again.", "Date": "July 19, 2011"}, {"Ratings": {"Cleanliness": "1", "Sleep Quality": "1", "Overall": "1.0", "Value": "1", "Service": "1"}, "AuthorLocation": "Colorado", "Title": "“DO NOT STAY HERE!!!!”", "Author": "redrobin1983", "ReviewID": "UR114653782", "Content": "There were numerous things missing during my stay at the comfort inn on ventura (next to the denny's). Zippo went missing one day. & after i checked out, i called later that day to notify them that i had left some clothes in a drawer. they gave me some bullsh** about their lost & found not being open except from 8a to 1p mon-fri. i called back at 8a mon & was told it wouldn't be open till 11a, so i called back again & was told my things were never found. now i know some people loose their things & find them later or something, but i know for a fact that i left clothes in the drawer- 100% positive & they told me nothing was found. of course, by this time i was already back in colorado. i spoke with the manager, Tan, who was extremely rude to me on the phone & trying to convince me i must've lost my things elsewhere. He eventually started arguing with me & mocking me about my stuff & when i asked him if he was seriously being like that with me, he hung up on me. How mature! He did refund my card $20, which didn't even cover the cost of 1 of my items left/taken. if you want to save yourself a tremendous amount of stress on your trip, DO NOT stay here!!!", "Date": "June 22, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "3", "Overall": "3.0", "Value": "2", "Service": "3"}, "AuthorLocation": "California City, California", "Title": "“Okay place, some issues.”", "Author": "CrossMyDesk", "ReviewID": "UR113130235", "Content": "I stayed here at the last minute one night while on business in the Warner Center area. Checking in, the young lady was really nice and gave me everything I needed. The room was small, and suited my needs. The fridge in the room did not work, though... and I'm not really sure the A/C worked very well either. Over all, though, it wasn't bad. In walking about the grounds, I noticed that some of the area looked a bit run down. The blinds in the housekeeping area were mangled, and quite visible for any of the guests walking by. That wasn't terribly attractive. The grounds were clean and pleasant, but \"tight\" because of the small space. Everything seems a bit cramped, including the walkways. This hotel is literally wedged between to 101 freeway and Ventura Blvd -- and that means lots of road noise. This really is the type of place you go when you just need a place to sleep -- so if noise bothers you, bring earplugs. For me, though, the worst of the experience was the next morning. While I was getting dressed, the phone kept ringing and ringing. I picked it up a few times to find a dial tone. This continued for about 30 minutes... random ringing. When I mentioned it to the guy at the front desk, he was pretty rude about it, blowing me off. He said, \"All calls come though here, lady, and there haven't been any. Are you sure you aren't hearing things?\" Yeah, that went over well. It's a good thing I was on my out and didn't want to deal with it. Breakfast was okay. Apparently, they've recently expanded their breakfast buffet to include hot bacon and eggs. The bacon was fine... but the eggs? YUCK! They are cooked from discs of salty yellow goo. Blech. The price was okay, considering that most rooms in this area (during summer) tend to be pretty high, but I've certainly been in much nicer hotels for less. However, it's a nice place and the rooms are clean and have just about anything you'd need (hairdryer, iron/ironing board. microwave, fridge (if it works), etc. The free breakfast was okay, but avoid the nuked egg patties.", "Date": "June 13, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "4", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "2", "Location": "2"}, "AuthorLocation": "Corvallis, Oregon", "Title": "“unprofessional staff with a horrible attitude.”", "Author": "lindalou555", "ReviewID": "UR87944968", "Content": "Durring our stay I will say that the rooms were very clean. Yet there were nothing but issues from the start with the front desk staff. The first said she made our reservation, even giving me a confirmation number, which when we tried to look up, turned out to be false. Then, the air conditioning in our room failed, and the staff refused to move us even though they were virtually empty. When I spoke to the manager, he yelled at me claiming I was out of line to think I deserved to be relocated. Not only were we lied to by the staff, but also screamed at by them. Then, when it was time to check out, the front desk staff did not know how to do a manual check out when the computer system was down. All around, an unpleasant experience.", "Date": "November 22, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Surrey, Canada", "Title": "“AWESOME HOTEL.....AWESOME ROOM....WARM AND FRIENDLY STAFF!!”", "Author": "Shivvy097", "ReviewID": "UR87643436", "Content": "Just want to say a big thank you to the staff at the Comfort Inn! We stayed for 4 nights and it was well worth the price..couldn't get any better!! They upgraded us to the bigger room right across from the pool..room 108! The room was very clean, the pool the right temperature and the breakfast in the morning was great. I HIGHLY recommend this hotel!! We will be back next year! THANK YOU!", "Date": "November 20, 2010"}, {"Ratings": {"Cleanliness": "4", "Overall": "3.0", "Value": "4", "Sleep Quality": "2", "Rooms": "2", "Location": "4"}, "AuthorLocation": "San Diego, CA", "Title": "“Just okay...”", "Author": "BronwenL", "ReviewID": "UR84953575", "Content": "We got a room here because it was close to a meeting we had scheduled and we needed something inexpensive and convenient. This hotel did meet the requirements. It's an old building but well maintained. The rooms had a rather sterile smell to them, very clean but not very appealing. The room, while small, did have a little 2-seater table, desk, armoire, fridge and microwave. Pretty good set up if you're in town on business and need to get stuff done. Add to that the free internet, free parking and free breakfast. Finding all of this together under $100 per night in the LA area is hard to do. So the room overall was decent, nothing to write home about. The bed was very firm, which works for us but some others may not be so happy. The street noise was not too bad all night but got a bit much around 6am. There is a Denny's right next door which has the best service (late-night) of any Denny's I've ever been to. Since we got in very late, we missed breakfast. In a pinch I'd stay here again, but it wouldn't be first choice.", "Date": "October 26, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Madera, CA", "Title": "“Great Rate, Friendly Staff”", "Author": "AliceMadera_CA", "ReviewID": "UR81423792", "Content": "This was a perfect hotel for our traveling high school team. The staff could not have been more friendly. The rooms were nice and very clean. The free breakfast for the kids made it so easy for us too. I would certainly recommend this hotel.", "Date": "September 29, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "3.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Calgary, United Kingdom", "Title": "“Good Value”", "Author": "Gary004", "ReviewID": "UR64002684", "Content": "Breakfast could use a little more protein, good sleep and no charge parking, easy to find", "Date": "May 12, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Israel", "Title": "“Motel style, great price”", "Author": "the-amazing-grace", "ReviewID": "UR63565824", "Content": "I stayed at the Comfort Inn for 2 nights, and chose it because of the price and proximity to the venue for a wedding I was attending. The hotel is more like a motel, but at under $70 a night, its very good value for money. The room was a decent size, the bed was huge and comfortable (pillows could have been firmer), the bathroom area was fine, and the room had a big flatscreen tv, fridge, coffee maker etc. A simple but adequate breakfast is included in the price, and the pool & spa area is actually very nice. Denny's is next door which some might see as a plus, and others a minus, but it certainly didn't bother me. As others have mentioned, internet access is annoying, and the free wireless only ever seemed to work for 2 minutes at a time, but apart from that, I felt like I got everything I expected and needed. If you're looking for decent value for money, and need to be in the Woodland Hills area, then this motel will do you just fine.", "Date": "May 8, 2010"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "Varna, Bulgaria", "Title": "“Great Place”", "Author": "infectbnl", "ReviewID": "UR50596683", "Content": "Great Hotel. Rooms greatly decorated, all the needed amenities. Great service. Location is a bit tricky (just on the border of downtown and a bad neighborhood - I judge it on its looks, have no idea if it was bad or not :)), but we did not have any trouble with that. I would highly recommend it to a friend. Superb value for the money you pay.", "Date": "December 3, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Location": "4", "Rooms": "4"}, "AuthorLocation": "UK", "Title": "“Clean, friendly hotel would go back again.”", "Author": "MUMTOBLISS", "ReviewID": "UR48757432", "Content": "Despite previous bad reviews ,the most recent a better one after the refurb,I decided to take a chance on this hotel. The hotel was a good price ,after a long flight from London ,check in was fast & efficient & the staff friendly & helpful . Our room was overlooking the pool ,which was clean & warm ,some have not so good a view at the back of the hotel. The room itself was clean & spacious, lovely comfortable beds & plenty of fresh towels every day. There was a spacious dressing area, clean bathroom & everything we needed. The complimentary breakfast ( served from 6-9.30 am ) was constantly topped up & a good selection this could be taken up to your room or to go. A special mention for the lovely breakfast lady Veronica who was so sweet & lovely .All staff were polite friendly & helpful and we had a lovely stay ( myself & 4 kids 23, 16,13,7 )", "Date": "November 8, 2009"}, {"Ratings": {"Service": "1", "Cleanliness": "3", "Check in / front desk": "3", "Overall": "1.0", "Rooms": "3", "Location": "3"}, "AuthorLocation": "St. Louis, MO", "Title": "“Worst experience EVER!!!”", "Author": "SleeplessSt_Louis_MO", "ReviewID": "UR10896607", "Content": "We spent one horrible night at this place. First, the t.v. did not work and we were told someone would come up and fix it, which did not happen. Then about 12:30 a.m., after we fell asleep, a large group of teenagers from the highschool across the street starting running along the corriders, screaming, pounding, breaking bottles, and at least one, throwing up outside a guest room door. The front desk sent ineffective security which could not control the situation, and about 2-2:30 a.m., the LA police (which had to be called by a guest) showed up and kicked them out.. When we asked the front desk manager this morning if there were chaperones, he said there were none; the rooms clearly were rented to minors with no chaperones. There were only two Kleenexes in the box, only one bar of soap (no separate one for the shower), and, to top matters off, there was no hot water when I showered, but rather, ice cold water. We were originally going to stay one more night, but relocated today to another motel in the area. This appears to be a low-budget operation with inadequate and ineffective staff and security. We will NEVER stay there again.", "Date": "November 18, 2007"}, {"Ratings": {"Cleanliness": "1", "Check in / front desk": "2", "Overall": "1.0", "Value": "1", "Rooms": "1", "Location": "2"}, "AuthorLocation": "Ellicott City, Maryland", "Title": "“Unacceptable”", "Author": "groovyvegan", "ReviewID": "UR7952536", "Content": "I had an unpleasant experience at this motel and will not be returning. However, I acknowledge the motel had some good points, which I list first. It may be possible to have a decent experience here if you stay on the side furthest away from the Denny's, and if you check the plumbing first to make sure it works properly, and if you find the room to be acceptably clean. But with so many hotel choices nearby, I wouldn't chance it. Positives (or Neutral) : * Unusually firm mattress * Refrigerator in room next size up from tiny * Microwave in room * Swimming pool that's larger than what you'd expect in such a small motel. * Although the room is small, the decor is neutral and pleasant. * My partner found the breakfast acceptable. It included: 2 kinds of cereal, waffles, muffins, toast, 2 kinds of juice, and coffee. And now the negatives which greatly outweighed the positives for me: * Dirty bathroom with many hairs on the floor. Yuck. * Shower water temperature varied wildly from hot to cold. * No cold water in the bathroom faucet. My partner and I had to quickly wash our hands before the water completely warmed up, or we would have been scalded. A child could have easily been scalded. * VERY LOUD. We were in room 210, two rooms away from the Dennys which shares the parking lot. I was kept up in the middle of the night (3:30 to after 4 am) by people blasting car radio and having loud conversations in the parking lot. I had no idea Dennys is open 24 hours a day, but found out the hard way. * A too small, tight parking lot. We were okay b/c we were there on a Sunday night, but had we been there Saturday night when they were sold out, we would have had a problem. * I noticed a flea jumping on the bed. And as Dr. Phil said, \"for every one you see there's a hundred you don't.\" That may have explained why a previous reviewer's family was bitten up at night. The cost was $96 a night (AAA discount), before taxes and fees. In my experience, motels in the L.A. area that cost under $100 are dives. I recommend staying away.", "Date": "June 20, 2007"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Business service (e.g., internet access)": "1", "Check in / front desk": "3", "Overall": "1.0", "Value": "1", "Rooms": "1", "Location": "2"}, "AuthorLocation": "Oregon", "Title": "“Substandard”", "Author": "PammyRae", "ReviewID": "UR5597682", "Content": "My family and I rented 3 rooms there last week, for 2 nights. One room was alright but the other 2 were substandard. The toilet overflowed in the room downstairs. The room on the second floor was absolutely filthy! The carpet was the worse I have ever seen and the chair was nasty looking. I complained to the front desk and they said they wouyld get back to me. Which they never did. Upon checking out I spoke with the manager and he was unwilling to alter the bill in any way. When I let him know I was intending on posting a negative review online about his hotel, he indicated to me that he couldn't care less. Stay away from this substandard hotel and the very rude staff that work there!", "Date": "August 10, 2006"}, {"Ratings": {"Cleanliness": "5", "Overall": "5.0", "Value": "5", "Service": "5", "Rooms": "5"}, "AuthorLocation": "DALLAS, TX", "Title": "“Very nice and clean”", "Author": "A TripAdvisor Member", "ReviewID": "UR5233791", "Content": "I was there on a business trip. I don't know why they had bad reviews. The hotel looks like it has been upgraded. I asked the front desk clerk, they said they have just finished remodeling and it's under new management. I liked the interior of the room. Nice wall-paper and bed sheets were very clean. I liked it. I thought it was as good as any five star hotel. Good price for a room like that and I liked their breakfast. It was a nice experience for me. People were friendly and curtious at the front desk. I think I will stay there if I go back to L.A. again.", "Date": "May 30, 2006"}, {"Ratings": {"Cleanliness": "1", "Overall": "1.0", "Value": "1", "Service": "1", "Rooms": "1"}, "AuthorLocation": "Phoenix", "Title": "“Garbage Dump”", "Author": "mwhiti", "ReviewID": "UR3801698", "Content": "The other reviews are correct. Unfortunately I didn't read them before I went. STAY AWAY!!!. The room smelled terribly of wet paint covering rotten walls. When I complained the staff gave me a room key to check another room. I accidentally walked in on a family that was already in that room. I went back to tell the staff and they gave me the key to another room. Well, guess what. Someone was in that room too! Finally I got one more key and was able to check out the room. It smelled the same. It was too late and we were too tired to go in search of another hotel. We had to ask for clean sheets. The sheets on the bed were dirty. We had to buy some air freshener to try to mask the smell. It didn't work. This place is a run down dump.", "Date": "August 23, 2005"}, {"Ratings": {"Cleanliness": "1", "Overall": "1.0", "Value": "1", "Service": "1", "Rooms": "1"}, "AuthorLocation": "New Hampshire", "Title": "“Stay away!”", "Author": "Stoneygirl", "ReviewID": "UR3696208", "Content": "I love Comfort Inns, but this was definitely not on par with the rest of the chain. It is located on a busy road--lots of traffic. The room was dirty and we had to ask for pillows for the beds as well as towels. Much to our dismay, we didn't discover the shower didn't work until the next morning when we had to cope with water temp. going from scalding to freezing and water pressure from a slight stream to drips. The staff was curt and unfriendly. Luckily, we only needed the room 1 night. I would not recommend this hotel.", "Date": "July 24, 2005"}, {"Ratings": {"Overall": "1.0"}, "AuthorLocation": "Cathey's Valley, California", "Title": "“Noise, Noise, and even more noise!”", "Author": "ynp-CV", "ReviewID": "UR3169341", "Content": "The hotel is sandwiched right between busy Ventura Blvd and even busier US Highway 101--we had a room on the side facing neither, but the traffic noise was unbearable and add to that the noise of every car \"beeping\" when its' doors were locked/unlocked by the owner. You could hear every footstep from the room above and from anyone walking down the runways outside. The room above us must have been \"rented by the hour\", traffic in/out was constant most of the day/night. They must have used tissue paper for insulation when they built this place. The \"parking lot\" was very small for the number of rooms--get there early or don't give up your space. The breakfast room was 5 tables squeezed into the small lobby and 2 of the tables were in the very small area where the food was--with people at those tables, it was impossible to maneuver to the food. Then throw in the fact that what looked like the \"cleaning staff\" was sitting at one of the tables eating and carrying on. The continental breakfast was very cheap pastries and watered down OJ and some stale cereal with very few bowls available. The front desk people were unfriendly/curt and were very very difficult to understand. The only really nice thing about the room was the bathroom set-up. The sink and very large countertop were outside and away from the room where the toilet/shower was. That should be a MUST for any hotel--it allows for easier use by multiple people. If I didn't have business in the immediate area, I would have NEVER stayed here. Comfort Inns used to be a decent chain, but I haven't stayed in many decent ones lately and this one is AAA-approved! This one last sentence should sum up this hotel--the in-room refrigerator had graffiti scrawled on the door!", "Date": "February 8, 2005"}], "HotelInfo": {"Name": "Comfort Inn Near Warner Center", "HotelURL": "/ShowUserReviews-g32655-d82684-Reviews-Comfort_Inn_Near_Warner_Center-Los_Angeles_California.html", "Price": "$99 - $119*", "Address": "<address class=\"addressReset\"><span rel=\"v:address\"><span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">20157 Ventura Blvd.</span>, <span class=\"extended-address\">Woodland Hills</span>, <span class=\"locality\"><span property=\"v:locality\">Los Angeles</span>, <span property=\"v:region\">CA</span> <span property=\"v:postal-code\">91364</span></span> </span></span></address>", "HotelID": "2516134", "ImgURL": "http://media-cdn.tripadvisor.com/media/ProviderThumbnails/dirs/55/1c/551c9a0f789d7c7941055841d1f6e35f4large.jpg"}}