{"Reviews": [{"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "3", "Rooms": "4", "Location": "4"}, "AuthorLocation": "", "Title": "“A pleasant surprise in wine country”", "Author": "Zach S", "ReviewID": "UR129228866", "Content": "This hotel is well maintained, has friendly staff, and is in a great location. My only complaint is that the pillows are too hard, and the bed is too firm so my quality of sleep was not great. We would definitely come back and stay here though.", "Date": "May 2, 2012"}, {"Ratings": {"Overall": "1.0", "Value": "1", "Service": "1", "Location": "1"}, "AuthorLocation": "Napa Valley", "Title": "“Terrible customer service!! Do not stay here!!”", "Author": "SBHNapaValley", "ReviewID": "UR127842395", "Content": "I booked this hotel based on the reviews of venere.com. After 16 hours of driving from Seattle, WA my friends and I went to check in to this hotel, only to find out that our booking was not there. The receptionist told us that the hotel does not have the room that we booked on the website, and if we want to stay at the hotel we have to pay extra money. When we told him that we booked the hotel based on what the hotel advertised he got very aggressive with us. Needless to say we cancelled our booking and left the hotel as soon as possible. I definitely would not recommend people staying at this hotel as this experience was horrible!!!", "Date": "April 14, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "4", "Sleep Quality": "4", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Kelowna, Canada", "Title": "“One of the better motels”", "Author": "Fred S", "ReviewID": "UR119814988", "Content": "Clean rooms, friendly staff, at an affordable price. Yes, it is a motel...get over it.", "Date": "October 27, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "3.0", "Value": "4", "Sleep Quality": "3", "Rooms": "4", "Location": "3"}, "AuthorLocation": "", "Title": "“Sisters' Weekend in Napa”", "Author": "Wench117", "ReviewID": "UR119681264", "Content": "We selected this property because of it's price & the fact that it was the one of only a few that did not require a 2 nite minimum. Many in the area do. Not very pretty around the hotel because it is surrounded by other establishments. But, it was centrally located & not far from anything you'd need to buy or see. Check in person was not freindly, if not curt. Tried to give us a room with only one bed when reservation called for two beds. He blamed it on Booking.com but when showed our printed receipt from same, we were switched immediately. Room was spacious & clean. Had a refrig & micro, plus flat screen TV & Dish Network. We could have used a small table for the 2 chairs that were in the room & there was plenty of space for it. Rooms are decorated with Roman themes. Ours was the \"Venice\" rm & we had a mural of same. All in all, beds were comfortable & room afforded all we needed for our stay and price was reasonable for the area.", "Date": "October 24, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "3", "Location": "5"}, "AuthorLocation": "San Francisco, California", "Title": "“Great value, good location”", "Author": "BatlinFamily", "ReviewID": "UR118380249", "Content": "The staff was very personable. Room was small but clean. This is a motel just off St. Helena Highway, so if you're traveling wine country on a budget this is the spot. Napa has beautiful hotels/spas, but this place is great if you just need a bed and shower. Free wi-fi was a definite plus.", "Date": "September 20, 2011"}, {"Ratings": {"Cleanliness": "3", "Sleep Quality": "3", "Overall": "3.0", "Value": "3", "Service": "3"}, "AuthorLocation": "Philadelphia, PA", "Title": "“Much better than it looks”", "Author": "WineGirl72", "ReviewID": "UR117987093", "Content": "This place looks like a motor lodge, which seemed a bit shady when we first arrived. There was also no one available at reception even though I rang the bell three times. But once I did get the key, I was pleasantly surprised by the room, which was really pretty nice.", "Date": "September 12, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Location": "3", "Rooms": "5"}, "AuthorLocation": "", "Title": "“A very pleasant surprise!”", "Author": "Tashywood", "ReviewID": "UR117610360", "Content": "We booked this hotel for our one night in Napa and were slightly nervous based on some of the reviews on this site. However, we were very pleasantly surprised. The room was nicer than the one we had spend double the price on in San Fran and was really well equipped with complimentary snacks and bottled water and a small iron and ironing board. The room was beautifully decorated and the bed was very comfortable. The owners are obviously very proud if the work they have put into it and rightly so. I agree the location isn't great but it is only a 5 min drive from the centre of napa. I also think it would be better to describe it as a motel to reduce some of the negative comments. Overall though I would definitely recommend this if you are stopping off through Napa.", "Date": "September 3, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "2", "Overall": "2.0", "Value": "4", "Service": "3"}, "AuthorLocation": "Napa, California", "Title": "“Unfortunately opposite a building site”", "Author": "HambledonMike", "ReviewID": "UR116107957", "Content": "Rooms were very nice and clean but frankly would describe this as a motel rather than a Hotel. Manager kept herself locked away in a secure room with only buzzer entry. Our biggest critism was that at about 5.30 am work started on a big building site opposite making a lot of noise and waking us up.", "Date": "August 1, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Singapore", "Title": "“Very nice little motel”", "Author": "JitterCritter", "ReviewID": "UR114632467", "Content": "Most motels in Napa are pricey. For the price, this motel is way better than most I've stayed in. I found the room clean and well decorated. No problems with checking in/out, good wifi, nice location.", "Date": "June 22, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "4"}, "AuthorLocation": "Ventura, California", "Title": "“Dissapointed at best”", "Author": "Erin_Faverman", "ReviewID": "UR78500770", "Content": "This hotel was really not a hotel at all, but a tiny motel. Clean on the outside, ,the inside of the room was small, old, dated, and the carpet was stained and filthy. The window opened to a view of a weedy yard with a dilapidated chicken coop and a wire clothes line. There must be better places to stay in Napa, and the price at $150.00 a night was not all that cheap.", "Date": "September 6, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "5", "Location": "3"}, "AuthorLocation": "Erfurt", "Title": "“nice place”", "Author": "sebsahib", "ReviewID": "UR67554972", "Content": "nice place to stay, good and clean rooms, lots of space. Mediterranean style. Wallpaintings were handpainted by owner! Beds are cosy. Little fridge in room. downtown is about 15 minutes walk. Restaurants around. Big street in front but not too loud. parking for free. TV in room. Nice city. Try the vietnamese restaurant in city center!", "Date": "June 15, 2010"}, {"Ratings": {"Service": "2", "Cleanliness": "4", "Overall": "2.0", "Value": "2", "Sleep Quality": "1", "Rooms": "2", "Location": "3"}, "AuthorLocation": "Los Angeles, CA", "Title": "“It's a motel, I wouldn't come here again”", "Author": "Boginia1", "ReviewID": "UR66464187", "Content": "We booked this hotel very last minute for Memorial Day weekend. Everything else in town was either booked or costing $250+/night. I'm glad we found this hotel's availability for $150/night because it saved our trip, but I would not stay here again if I can avoid it. This place is definitely a motel, which is not the type of accomodations I look for on an otherwise luxury vacation. For a motel though, it had decent accomodations with large rooms, though the mattress was horrible, I couldn't fall asleep or stay asleep. Plus at check in time the manager made me feel unwelcome, he wasn't rude or anything per se, but something about his approach was offputting.", "Date": "June 4, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "2", "Overall": "2.0", "Value": "1", "Sleep Quality": "2", "Rooms": "3", "Location": "2"}, "AuthorLocation": "Pleasanton, California", "Title": "“Not Worth It”", "Author": "mrclean1", "ReviewID": "UR65378030", "Content": "This hotel is not what it looks like on the website, in fact its a totally different picture. The room was average but not worth what we paid. Not a good part of town.The women at the front desk was very rude. I asked for help with the tv and she got very frustrated like a child and treated me like an inconvenience. I would not recommend it!!", "Date": "May 26, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Location": "4", "Rooms": "4"}, "AuthorLocation": "Campbell, California", "Title": "“It was a good fit!”", "Author": "jeaners2000", "ReviewID": "UR48069374", "Content": "We were looking for an affordable and comfortable room in Napa Valley to celebrate our 2nd year anniversary. After an extensive internet search I found this hotel. I didn't know what to expect, but was pleasantly surprised! We were able to find the hotel with no problems, the parking lot is spacious and easy. The front desk gave us our key and we proceeded to room 19. The room was tidy and made up. The bathroom was clean and well lit. The room has a nice decor and is comfortable, but it is tiny. Don't expect a huge and luscious room, it is small and comfy. For the amount they charge you get exactly what you pay for. A reasonable amount for a reasonable room. We didn't feel like we overpayed for a crappy room. As for location, its in the middle, between Napa Valley and the vineyards up 29. We were able to go driving and do some sightseeing, visit the vineyards and have dinner downtown with no problems! It was a perfect fit for us!", "Date": "October 29, 2009"}, {"Ratings": {"Service": "1", "Cleanliness": "3", "Overall": "3.0", "Value": "2", "Location": "3", "Rooms": "2"}, "AuthorLocation": "San Diego, CA", "Title": "“Stay here only if you have to”", "Author": "PBLiving", "ReviewID": "UR46861159", "Content": "We just got back from a trip to Napa and unfortunately we waited too long to book rooms, so one of the few places available (and not over $500) was the Chardonnay Lodge. We tried to check in at noon, and while their policy is 2pm check in, I thought there might be a room available. I walked in and said I would like to check in and the frond desk person said, sorry no check in until 2pm. He did not even ask for my name. I asked if it was possible that the room was ready early, because we had to change for a party we were going to at 2:30, but he said no. The place looked empty but he did not even check to see if anything was available. We got the Cabernet Room (#6). When you walk in it the sink was in the doorway, which was very awkward. The room was cutely decorated though and was clean. The bed was uncomfortable and the towels were the cheapest, thinnest ones I have ever used. But my biggest complaint was the noise. You could here everything from the rooms around you. I literally was woken up by someone farting in the room next door. The neighbor's shower sounded like it was in the middle of our room. And you can here everyone entering and leaving their room. And there was some falling down shed that was the view from our room. I am not sure what type of clientelle this motel is trying to attract. It was recently remodeled to look Tuscan, but the cheap towels and amenities in the room kind of detracted from the room. We only stayed here one night, which was OK. But if I had other options, I would definately stay somewhere else.", "Date": "October 14, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Location": "4", "Rooms": "4"}, "AuthorLocation": "Stockton, CA", "Title": "“Nice accomodations for the price”", "Author": "CynthiaStockton_CA", "ReviewID": "UR46810877", "Content": "We normally like to stay in Calistoga where we can enjoy the small town feeling and mineral hot springs, but didn't plan far enough in advance to get three rooms for our group. We were lucky enough to find rooms here, and while we were very skeptical due to the low price, we were very satisfied with our rooms. My husband and I had a room with two full beds, and another couple in our party had a queen size (1 bed) room. Our rooms were clean and had many amenities most hotels don't provide, including a coffeemaker, refrigerator, microwave, iron, & hairdryer. We arrived before ll:00 a.m., and were able to check in early, which was great! It wasn't fancy, and definitely not a four star hotel, but it was clean and the staff was courteous and friendly. I still prefer to be further up the valley, but I would stay here again.", "Date": "October 14, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Location": "4", "Rooms": "5"}, "AuthorLocation": "Irvine, California", "Title": "“Amazing!!!!”", "Author": "jennon", "ReviewID": "UR36615395", "Content": "Very cozy, extremely clean and perfect romantic atmosphere!!!", "Date": "August 3, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "3.0", "Value": "4", "Location": "3", "Rooms": "3"}, "AuthorLocation": "New York City", "Title": "“Simple but clean”", "Author": "Leysvel", "ReviewID": "UR36485617", "Content": "We stayed here and although it is small, it is clean and priced correctly. The management was attentive and provided us with tons of information plus passes to some of the local wineries. The rooms are clean and comfortable, small but cozy. Nicely decorated and excellent for someone on a budget who wants a clean place for resting.", "Date": "August 2, 2009"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Overall": "2.0", "Value": "1", "Location": "2", "Rooms": "2"}, "AuthorLocation": "Oxford", "Title": "“This is just a third rate motel, posing as something special, with rates to match.”", "Author": "flyinggrannyOxford", "ReviewID": "UR36178026", "Content": "What a disappointment it was to find this motel I had booked as something special for my daughter's birthday visit to Napa Valley. Next time I will stick to Priceline through which we had an excellent and reasonable hotel in san Francisco.", "Date": "July 29, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "lit", "Title": "“What's not to like? Don't be deceived!”", "Author": "videojoejs", "ReviewID": "UR23387999", "Content": "Karen has really out done herself with the renovation. They were so friendly and I enjoyed hearing how hard she had worked on the concept etc. Every room is unique, the walls have hand painted art and all the fixtures new as well as the beds etc. I loved the little vineyard and they were very helpful. They know peoples in the wineries and the tour bus stops there. Ask Karen to get you a tasting etc. They've worked really hard to update a vintage motel and offer robe services and such like an expensive hotel. We ate at the restaurant Karen recommended every night. It was right on the river and the SW food devine. I will stay there every trip I make to the Valley. Little Rock", "Date": "January 8, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Little Rock", "Title": "“Great find in Napa!”", "Author": "CameraWork", "ReviewID": "UR20644155", "Content": "What a great place! Each room is uniquely and tastefully decorated. Some rooms have hand-painted murals. Very special find! The room was meticulously clean and the owners were very helpful and friendly about the wineries and restaurants. Extremely reasonably priced for the area! Very quiet and also near the main roads to the wineries. Can't wait to return! I highly recommend!", "Date": "October 5, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Burlington, WA", "Title": "“A nice surprise!”", "Author": "WashingtonMom26", "ReviewID": "UR20311818", "Content": "We pulled in and were kind of leary but when we went to check in, the lady was very friendly. We were there to visit the wineries so she found out our tastes and gave us a map and circled the wineries we would most likely prefer. She also gave us some great ideas for where to eat dinner in Napa that night as well. We checked into our room and it had a very warm and cozy feeling. They have done a great job turning your basic roadside motel into a comfortable place to stay in a great location. It was right in town and was pretty quiet. There was no breakfast but they do provide granola bars, water bottles, and coffee in the room at no extra charge. Overall I felt safe and comfortable.", "Date": "September 23, 2008"}, {"Ratings": {"Check in / front desk": "1", "Overall": "1.0", "Location": "1", "Value": "1"}, "AuthorLocation": "East Bay, CA", "Title": "“Never even made it in the door”", "Author": "LSJohnson", "ReviewID": "UR19128344", "Content": "We had a wedding to attend in St. Helena on a Saturday, and decided it would be fun to stay overnight nearby. It came down to this place or the Christian Brothers retreat on Redwood Road, and I wish I had followed up with Christian Brothers instead of just accepting this place. I called around Wednesday that week to confirm our stay and also to let them know that we would probably be arriving after 8. First, the man on the phone could not find our reservation--it took a solid fifteen minutes of checking, even though I had booked it directly and had an email response from their website. Then he went silent at my 8:00 arrival time and finally said, \"well, you'll have to ring for someone at the office.\" A tad unfriendly, but we really just wanted a place to sleep that night. And that's what we would have had, if we had been able to make it to our room. Because the man on the phone had utterly neglected to inform us that this was \"Cruise Night\" in Napa, where all the teenagers in the area get together and party on the last Saturday before school starts. We didn't know anything about it at the time; all we knew was that when we reached Jefferson there were people everywhere: lining the streets, driving cars up and down the road, riding bicycles all over, playing music, shouting, shoving, making out. It was like entering a concert ground. We crawled through this traffic onto Jefferson; we idled while some kids shouted back and forth with a tricked-out SUV; when we finally came up to the \"Chardonnay Lodge\" we were greeted with the facade of a motel, a locked and darkened office, and a parking lot stuffed with cars and teenagers. We were at a loss as to how we would even get in there, much less how we were supposed to sleep with all this chaos around us. I know now that the cops quiet everything down after 10, but after a long day of driving and celebrating we just felt shellshocked at the scene. Shellshocked, and furious that no one had bothered to point out to us that we would be arriving in the midst of this. It's an annual event in Napa; it would have been courteous to give us some advance notice. Other reviewers are correct in pointing out that this establishment is a distance from downtown Napa; I'm not sure if the area was run down per se but it was definitely a residential neighborhood, with a large school across the street and nothing to walk to but a few strip malls. Perhaps the rooms were in decent shape, but the outward appearance was that of a cheap motel, not a $140 per night \"lodge\", nor the spa-like atmosphere that the website presents. We simply didn't go. We couldn't get in the parking lot and we could see nowhere nearby that we could park and walk to our room. And quite frankly, we didn't want to be fighting our way through crowds of raucous teens; we wanted to relax, have a hot shower, and stroll through quiet streets for a late dinner. Which is precisely what we did: we drove home.", "Date": "August 19, 2008"}, {"Ratings": {"Overall": "1.0"}, "AuthorLocation": "nz", "Title": "“Not the place to stay”", "Author": "poopoo1", "ReviewID": "UR18734993", "Content": "Run down neighbourhood, unfriendly host. Do not recommend this place. Pictures very misleading, so be careful.", "Date": "August 8, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "3"}, "AuthorLocation": "chicago", "Title": "“hidden gem”", "Author": "chuck925", "ReviewID": "UR16742451", "Content": "We almost stayed at the marriot, but we are glad we didn't. The Chardonnay lodge was a pleasant surprise, especially when we walked into our room. One thing that I really liked was how each room is themed differently. The only thing that was missing was the breakfast, but they did have coffee in the room. I would recommend this to someone who is looking for a above average stay.", "Date": "June 7, 2008"}, {"Ratings": {"Cleanliness": "2", "Business service (e.g., internet access)": "1", "Check in / front desk": "1", "Overall": "1.0", "Value": "1", "Rooms": "2", "Location": "1"}, "AuthorLocation": "New York", "Title": "“Don't stay here”", "Author": "LadySemour", "ReviewID": "UR15084990", "Content": "The location is in a very sketchy neighborhood. The pictures are completely misleading. When we checked in at around 5 pm, the front office door was locked. We could only get in by pressing a buzzer. The internet service is not high speed and we kept getting bumped off. We couldn't print out our e-tickets for Southwest either. We could hear every little noise outside. No coffee filters for the coffeemaker which was probably a good thing. It seems the host is trying hard to make this place into something it can never be unless she puts a huge security gate around the entire place and covers it with greenery and that isn't all that should be done. I really felt we were tricked by the way she took her pictures. Yes, she has decorated the rooms nicely, but it still doesn't mean this is \"like a bed and breakfast but without the breakfast.\" which is what she screamed at me when I wanted to view the room before we checked in. She also told us that it would not matter if we didn't like it, we were paying for it regardless. The place makes you feel like you don't want to spend too much time in it. Bottom line - It is an old motel in a not-so-great neighborhood.", "Date": "April 16, 2008"}, {"Ratings": {"Overall": "1.0"}, "AuthorLocation": "Wisconsin", "Title": "“Not a nice place at all”", "Author": "celiafeline", "ReviewID": "UR14991707", "Content": "I stayed at Chardonnay Lodge with my daughter on April 4-5, 2008. The online description and photo were very misleading to my daughter, Mary, who made the reservation. I would have never chosen it based on the very accurate “cheap and a bit nasty” review on this website. The Chardonnay website description says \"luxurious… quaint… romantic…. relaxing…. comfortable.” That is not what we experienced by any stretch of the imagination. This pricey but cheap motel was stale, musty-smelling, shabby, and poorly furnished; there was a refrigerator and microwave as advertised but no table or desk of any sort to sit at – definitely not comfortable much less luxurious. Walking barefoot on the filthy carpet made my feet black. There were no amenities unless you count “bathroom and television and telephone” – as they do on their web page. There were no tissues and only untearable shampoo packets. The ice bucket was a pitiful, small plastic “cottage cheese container”; but that didn’t matter much since the ice machine was coin-operated and broken. I am amazed that there are any positive reviews but I have noticed that most of those talk about newly-remodeled rooms. We did not have or see a newly-remodeled room. I would never stay at this lodge again or recommend it to anyone. Napa Valley is expensive so I would instead look for lodging in nearby Santa Rosa. That just happens to be close to my favorite winery anyway – Pride Mountain.", "Date": "April 12, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "las vegas", "Title": "“absolutely wonderful experience”", "Author": "lasvegasguide", "ReviewID": "UR13921334", "Content": "I stayed at this quaint little lodge a few weeks ago. Immediately, we were greeted by the owner of the property who not only was very helpful in making suggestions about the wineries to check out, also called us after we had gotten situated to let us know what time the wineries closed. She also showed us some of the other rooms that are under construction. Apparently, she took over the property about a year ago and has done some major work. Everything about my stay was nice. There was numerous little touches that made everything even better- from the complimentary bottled water in the room, to the handpainted murals and little signs giving each room a name, to the cozy bedding and decorating. I would go back in a moment. It is a great deal, owned by someone who really cares, and provides a nice touch to the entire Napa experience.", "Date": "February 28, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "3", "Check in / front desk": "5", "Overall": "4.0", "Value": "5", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Miami, Florida", "Title": "“We will be back!!!!!”", "Author": "K P", "ReviewID": "UR10759904", "Content": "A wonderful stay , rooms were very nice & clean, thank you for your warm hospitality, we will be back........", "Date": "November 11, 2007"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Check in / front desk": "3", "Overall": "3.0", "Value": "4", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Columbus, Ohio", "Title": "“Cute little place”", "Author": "scubagrrl", "ReviewID": "UR10007714", "Content": "Not in downtown Napa, but not far. We needed just a one night stay before checking into our accomodations further up Valley. The rooms were completely remodeled and very quaint. The rooms are small, but extremely clean and well kept.", "Date": "September 26, 2007"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Business service (e.g., internet access)": "4", "Check in / front desk": "3", "Overall": "3.0", "Value": "2", "Rooms": "3", "Location": "2"}, "AuthorLocation": "usa", "Title": "“Not the worst ever”", "Author": "skaksi", "ReviewID": "UR8363349", "Content": "We chose this place to save money- which we did. The people were nice, and the rooms were clean. They were tiny- however, not a family sized place. the bathrooms were simple and during our long stay, did not get cleaned. The air conditioner did not work- so we had the fan blasted every night rather than have a repairman dirty up our room. The back window looked out into a gross alley which was bumping with spanish music at all hours. i was not horribly unhappy, because we only were there to sleep- the rest of the time out and about- so if thats all you need, go for it. but dont expect anything remotely fancy. the hair dryers were nice. and they did give us bottled water and snacks everyday.", "Date": "August 6, 2007"}, {"Ratings": {"Service": "2", "Cleanliness": "1", "Check in / front desk": "1", "Overall": "1.0", "Value": "2", "Rooms": "1", "Location": "2"}, "AuthorLocation": "Scotland, Dundee", "Title": "“cheap and a bit nasty”", "Author": "peh1", "ReviewID": "UR8267816", "Content": "Yes I know it was cheap! - thats why we booked this place in expensive Nappa - and yes I know what we should have expected for the price but this motel is pretty horrid and not even worth the relatively low cost. We're talking mould on the curtains and sad to report from the last reviews (which I wish I'd read before hand now!) in the last couple of years the state of the towels and sheets definately haven't improved. There were also sections of the carpet and furnature which were pretty grotty and unexcusable to be honest even for a cheap motel. OK it's a cheap motel but that doesn't mean we necessarly expected to stay in somewhare as manky as that. The receptionist was helpful enough if a tad aloof! We booked it as it was the cheapest place in Nappa but pretty much as soon as we arrived we definately wished we'd paid the little bit more for a different motel. All in all I guess what you pay for in the price is absolutely definately reflected (and more!) in this place. On the plus side it's relatively cheap to get a taxi into downtown nappa itself - which is really nice - and get away from the place!", "Date": "July 31, 2007"}, {"Ratings": {"Overall": "1.0"}, "AuthorLocation": "San Francisco, CA", "Title": "“Motel Hell...abusive owner who doubles as the maid.”", "Author": "TranquiloImports", "ReviewID": "UR7657368", "Content": "Rooms smell like mildew. Owner yelled at my wife because she had the nerve to ask for a coffee packet for our second morning (who knew it was one packer per stay). Towels looked and felt like they were intended for penetentiary use only. Hope you like cumbia music because the neighbors behind our room had it blaring until 1:30 AM. Need I say more.", "Date": "May 21, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Business service (e.g., internet access)": "3", "Check in / front desk": "4", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "3"}, "AuthorLocation": "vallejo", "Title": "“very helpful”", "Author": "illa", "ReviewID": "UR5801328", "Content": "we have just returned from our stay at the chardonnay lodge and absolutly loved it. The clerks were so nice to give us so much information about napa valley, the rooms were very clean and affordable we know where to come when we come to napa valley again.......", "Date": "September 14, 2006"}, {"Ratings": {"Service": "3", "Cleanliness": "1", "Business service (e.g., internet access)": "1", "Check in / front desk": "2", "Overall": "1.0", "Value": "1", "Location": "4"}, "AuthorLocation": "Chico, CA", "Title": "“Never Again!!!”", "Author": "jlarabee", "ReviewID": "UR5768262", "Content": "This hotel had so much to be desired! Yes, part of it is because it is a very old hotel, but that does not give the excuse for not being clean. The bathroom was obviously not wiped down as you can see condensation watermarks on the door and shower rod., plus we had a burned out ceiling light in there (the only light in the bathroom). The freezer was not cleaned as there was a frozen entree from someone else. There was no light cover in the main room---just two lightblubs glaring at you. The coffee maker was not cleaned out as putting water in the reservior, up pops this old coffee filter! YES! they had a ice machine . . . but you had to pay for the ice! The carpet is old and stained. Check in time is 2 PM while check out time is at 11 AM. We felt cheated out on four hours of storing our belongings there while we did more touring. We requested a late check out, but the management refused us that option. One more thing, our relatives in another room actually ran out of toilet paper. They had to go to the office to request more. They gave it to them through a little window that they had to squeeze it through. Their room had very little space to walk around the bed to get to the the closet. They did not have a microwave in their room as advertised. We have never complained about places with some issues, but this one takes the cake! Positives: Hot running water with good pressure, microwave and pleasant management.", "Date": "September 4, 2006"}, {"Ratings": {"Cleanliness": "1", "Overall": "1.0", "Value": "1", "Service": "1", "Rooms": "1"}, "AuthorLocation": "Boston, MA", "Title": "“Chardonnay Lodge - Worst motel ever!”", "Author": "MML2006", "ReviewID": "UR5312907", "Content": "My husband and I just returned from our trip to California and the Chardonnay Lodge was the worst motel we've ever seen. My husband wanted to save money so he chose the Chardonnay Lodge for our night in Napa. Since it was only for one night I thought it would be tolerable. I was wrong. As soon as we pulled into the driveway I knew we had made a mistake. It looked very shabby. We had to ring the doorbell to get into the office. It was just about 3:00 p.m. but our room wasn't ready. The desk clerk gave us the key anyway so we peeked into the room. It looked very old and dirty. The area around the motel wasn't nice either. We felt extremely uncomfortable there. We found another place to stay and went back and checked out. They charged us for the room at check-in so we lost $89 but it was worth it to get out of there.", "Date": "June 5, 2006"}, {"Ratings": {"Overall": "1.0"}, "AuthorLocation": "Sacramento", "Title": "“Hated the Chardonnay Lodge”", "Author": "kathmac47", "ReviewID": "UR5012636", "Content": "We stayed one night at the Chardonnay Lodge in April 2006 and we will never go back again. Motel 6 is better than this. The place was run down. Only a few of the light bulbs worked. There were missing tiles in the bathroom and it was old and ugly. The lawn out front looked liked it hadn't been mowed in months. The door to the front desk was always locked, so you had to ring the door bell for assitance. When they finally did come they acted liked you were disturbing them. There was a mini-fridge, microwave and coffee pot. That was the only good part, except when I called them before hand to ask if there was a coffee pot, they said no.", "Date": "April 26, 2006"}, {"Ratings": {"Overall": "2.0"}, "AuthorLocation": "Santa Barbara, CA", "Title": "“Budget-minded only”", "Author": "JenniferinSB", "ReviewID": "UR4154903", "Content": "This family-run motel could use a little help. The owners were very friendly, but have not taken well care of their establishment. The rooms are slightly run down and not as clean as they could be. If you are on a tight budget and just need sleep this place will suit your needs.", "Date": "November 30, 2005"}, {"Ratings": {"Cleanliness": "3", "Overall": "3.0", "Value": "3", "Service": "2", "Rooms": "3"}, "AuthorLocation": "Sacramento, CA", "Title": "“Good for the money”", "Author": "A TripAdvisor Member", "ReviewID": "UR3680919", "Content": "We ended up staying here because it was one of the few properties that didn't have a two night minimum on weekends and because it was just a \"place to sleep\". For the price it was just fine. The room was clean and pretty spacious. No frills. The location will not win a prize for being reflective of Napa, but it is a good spot to day-trip around the wine county. One big negative is that I thought the street noise was pretty significant. It certainly woke me up several times during the night. The upside is that at $90 a night it is well worth it if you'd rather spend your money on the great food and dining that the Napa Valley has to offer.", "Date": "July 19, 2005"}, {"Ratings": {"Cleanliness": "3", "Overall": "4.0", "Value": "3", "Service": "3", "Rooms": "3"}, "AuthorLocation": "philadelphia, pa", "Title": "“clean tourist class lodging in downtown Napa”", "Author": "dreamvac", "ReviewID": "UR3652476", "Content": "This is an oldstyle drive up 1950's motel in downtown Napa that is well maintained and provides affordable tourist class lodging in the Napa Valley. It is just a place to crash at the end of the day touring the area. The room was clean with a firm mattress and fresh sheets, adequate TV, working AC and bath. I booked the room through the motel's own website for $90 a night for a room with one queen bed. For Napa during high season, this was a good value. The rooms use regular keys, so if security is a concern, you might not like that Don't go there is you are looking for luxury or are taking your loved one for a romantic weekend. It is not a destination property.", "Date": "July 9, 2005"}], "HotelInfo": {"Name": "Chardonnay Lodge", "HotelURL": "/ShowUserReviews-g32766-d248135-Reviews-Chardonnay_Lodge-Napa_Napa_Valley_California.html", "Price": "$85 - $135*", "Address": "<address><span rel=\"v:address\"><span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">2640 Jefferson St.</span>, <span class=\"locality\"><span property=\"v:locality\">Napa</span>, <span property=\"v:region\">CA</span> <span property=\"v:postal-code\">94558</span></span> </span></span></address>", "HotelID": "2516226", "ImgURL": "http://media-cdn.tripadvisor.com/media/ProviderThumbnails/dirs/9e/86/9e8644a25b64698721ab9c93d462c4941large.jpg"}}