{"Reviews": [{"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Sacramento", "Title": "“Quiet, peaceful getaway”", "Author": "IRockHard", "ReviewID": "UR124630961", "Content": "I stayed at the Hideaway Cottages about two week ago with my girlfriend, Emily. We loved the place. The rooms were comfortable and quiet. The lawns and gardens were well maintained. It was two blocks from the main street so there was no traffic, and it was a quick walk to all the restaurants and bars. Day and night, it remained quiet and peaceful. Because of the weather, we didn't use the swimming pool but we did enjoy the hot tub. I also enjoyed the no kids policy. Five stars, will recommend to friends and return in the future.", "Date": "February 15, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "3", "Overall": "4.0", "Value": "5", "Sleep Quality": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Belmont, California", "Title": "“Great getaway in the wine country”", "Author": "FSB018", "ReviewID": "UR120966490", "Content": "We had a wonderful stay at Hideaway Cottages. The grounds are very relaxing and the pool area was peaceful and well maintained. If you want slick chrome and steel modern rooms, this is not for you. We very much enjoyed the modest but very clean and comfortable cottages. Only a couple of blocks from restaurants, it was a pleasure to walk to and from dinner. This is a great option for a family reunion or a group of friends.", "Date": "November 23, 2011"}, {"Ratings": {"Cleanliness": "3", "Sleep Quality": "2", "Overall": "2.0", "Value": "1", "Service": "2"}, "AuthorLocation": "san francisco", "Title": "“I will never go back again..”", "Author": "Elysed", "ReviewID": "UR116922555", "Content": "After years of staying at Hideaway Cottages, I will NOT go back again. The draw for me was the \"peaceful\" grounds and pool. I was willing to pay, up to and above, $200 for the \"peaceful\" atmosphere, but it is anything but peaceful! The pool area is a bit rundown, and has neighbors that are quite loud. Both sides of the pool area had kids in yards that were very loud, and a another bordering property had a very yappy dog.. I understand that the owners, and managers can't control the neighbors..but I think advertising as a \"peaceful\" place is deceptive! There was limited management on site, and we had neighbors in adjacent cottages that sat outside at night and were very talkative. Bottom-line, it's not peaceful and not worth the price!!", "Date": "August 18, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Los Angeles", "Title": "“Charming, comfy, step back in time”", "Author": "FoxVoyage", "ReviewID": "UR116581345", "Content": "Delightful cottages from the thirties, spotless and well maintained with good air conditioning and excellent beds. The tiny kitchen and living room area made this ideal for families or groups who want to hang out together. The brown bag breakfast had four stars only in that it wasn't hot food, but it was generous, delicious and fresh, with fresh baked muffins and granola, fresh fruits and juices, and other things. Front desk was gracious and responsive, and we were warned before arrival that an antique car race would be making noise one night of our stay; it did not bother us. Lovely pool area with tables for picnicking and a gourmet grocery store two blocks down the street. Stayed there with three girlfriends from high school, all four of us were delighted with the place and will return with spouses. One morning we awoke and went outside to find colorful balloon rides landing in an adjacent feel. Rural small town feel and total charm. Set in a residential area but two blocks to the main drag in Calistoga with shops, restaurants, etc. Pool area looked lovely but I didn't try it so can't describe further. A delight!", "Date": "August 11, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "1.0", "Value": "1", "Service": "1"}, "AuthorLocation": "Portola Valley, California", "Title": "“Luxe Prices, Cheap Attitude”", "Author": "lovestotravel8888", "ReviewID": "UR115011591", "Content": "They charge high prices but have a stingy attitude. Where is the heated pool? Where are the feather pillows? Where are the soft towels. Decor and Landscaping are in the Blah category. Bathroom was grotty. The Breakfast tote tasted good but was delivered in a Trader Joe's grocery bag...really? They were practically empty and would not let our friends check in early. They change the password to wi-fi daily, what a pain. They make you initial check out time and room rate...really, we're not buying the place. The have lots of notes of what they won't do. Office was frequently empty. They won't answer their phone. I think they need a course in how to run a luxury property, they are running it like its a $50.00 a night motel.", "Date": "July 4, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Los Angeles, California", "Title": "“THE MOST RELAXED STAY WE'VE HAD.....”", "Author": "kmesh", "ReviewID": "UR84482334", "Content": "My husband and I travel to the Napa Valley often for rest, leisure and recreation. We have family in the Bay area and when we visit we like to occationally take advantage of a fun day of wine tasting or a spa day in the area. We found the pretiest little place, tucked back from the main road, with Wilkinson's Spa right there with a friendly, welcoming staff and quaint rooms w/ kitchenettes so we can go out or stay in as we like. I love the quiet, relaxed atmosphere and the muffin basket in the morning!", "Date": "October 22, 2010"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Santa Cruz, CA", "Title": "“Relaxing and private!”", "Author": "Taster", "ReviewID": "UR82629919", "Content": "We have stayed at the Hideaway many times, and it remains our favorite get-away accommodation in Calistoga, which is less-crowded and more spa-friendly than the other towns of Napa Valley. Our cozy cottage had a full kitchen and was steps away from a lovely, shaded lawn area with mineral pool and separate whirlpool. Even though the temperature was around 100 degrees Calistoga, our air-conditoned room was comfortable. Friendly staff, and a nice breakfast box that can be picked up in the office each morning. Walk to town. Grocery store 1 block away. Good restaurants nearby.", "Date": "October 8, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "San Clemente, Ca", "Title": "“Awesome Napa Hideaway in Calistoga, perfect cottages for our stay!”", "Author": "jfregan", "ReviewID": "UR82337270", "Content": "We stayed the weekend with 3 other couples and we each had our own cottage. They were perfect for our stay. We went wine tasting all day and came back to the Hideaway. Each couple went to their cottage and cooked/prepared hors devours and snacks and we all met out under the trees for an unbeatable evening. We finished up together in the spa before retiring to Paris, Rome, Vienna & Berlin (The cottages are all named for great destinations). We could not have picked a better place to stay with the fun group we traveled with. Can't wait to go back and visit again!", "Date": "October 6, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "2ccunningham@cox.net", "Title": "“Excellent Stay”", "Author": "2Christina", "ReviewID": "UR38710072", "Content": "Really enjoyed this property! It is just off the main street in Calistoga, so it was very quiet and private--there are no children allowed. The grounds are green and quaint with a mineral pool and jacuzzi. The cottage we stayed in (Erevan) had a bedroom, bathroom, kitchenette and a TV room. It was small, but more than adequate for my husband and me. The decor is 50's-ish but it was clean, hip, and cozy. The bed was comfortable, the linens very nice, and the bathroom was adequate. We really appreciated the breakfast provided: oatmeal with dried fruit and nuts, pastry, fresh fruit, and juices. The kitchenette was stocked with dishes and cutlery as well as a tea kettle and coffee, tea, and hot cocoa. It was also a great central location for dining right in Calistoga (the Calistoga Inn restaurant was fabulous) and wine tasting in Sonoma and Napa.", "Date": "August 24, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Sacramento, CA", "Title": "“Still love it!”", "Author": "Leslie24", "ReviewID": "UR33974187", "Content": "I love staying here! Its rather quaint and old fashioned, but always clean and roomy. For the price, you get a nice homey cottage with full kitchen and separate small living room. They added a \"Breakfast Tote\" in the last year which you pick up from the office in the morning. That consists of several fresh pastries, fruit, juice and jelly. You can already make tea or coffee in your kitchen. They also have a nice spring fed pool and spa to relax in. Further, they are in easy walking distance from Calistoga's charming downtown. Compared to other nearby lodging, I think this is a very good value.", "Date": "July 5, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Marin County, CA", "Title": "“Hideaway Cottages Offer Charm, Privacy, Comfort”", "Author": "fun4jg", "ReviewID": "UR32118259", "Content": "This charming group of cottages is tucked away off a main road near Dr. Wilkinson’s Hot Springs in Calistoga. My husband and I celebrated our 12th wedding anniversary there. It was the perfect setting – peaceful and romantic. From the moment we arrived, we were graciously welcomed by the manager at the front desk in a lovely, restored Victorian house with a beautiful, well manicured garden. He cheerfully escorted us down a lane past cottages named for famous cities. We turned off the lane at “Vienna” − our destination. The cottage was ideal for quiet rest and relaxation and offered the comforts of home − a wonderful king-size bed; a charming, full kitchen complete with appliances, hot beverage supplies, and dishes; a cozy sitting room for watching television or reading; and a bathroom stocked with toiletry items, hair dryer, and aromatic soap. For guests not inclined to cook their own breakfast (like us), a continental breakfast is provided, consisting of juice, oatmeal, pastry, and fresh fruit. The centerpiece of the grounds is an inviting hot tub and swimming pool surrounded by beautiful landscaping. If you’re looking for privacy, charm, comfort, and a peaceful setting at an affordable price, I highly recommend the Hideaway Cottages, owned and managed by the same family that owns and manages Dr. Wilkinson’s Hot Springs.", "Date": "June 11, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Calistoga, California", "Title": "“what a lovely,quiet resort..”", "Author": "noosee", "ReviewID": "UR27120671", "Content": "This has to be the most quiet place in all Napa Valley.Consisting of 18 cottages, each with kitchens and picnic tables right outside or a separate porch, p[erfect for an evening cocktail and Go and try it yourselves. !protected from the hot dry summer sun by big shady trees. Since they do not accept pets or children it is really quiet and oh sooooooooooooooo relaxing and only 1 block from downtown with its restaurants. The staff is kind and helpful and it is the perfect place for an extended summer vacation. Highly recommanded!!", "Date": "March 30, 2009"}, {"Ratings": {"Overall": "2.0"}, "AuthorLocation": "California", "Title": "“Don't know if we'll go back”", "Author": "Spookygrinder", "ReviewID": "UR19862877", "Content": "We stayed at Hideaway twice in 2006 and loved our experience. This time we were not so happy. We had to change rooms because of an uncomfortable bed and the room we were moved into, Madrid, had a bed that was just as lumpy. Also, the staff seems to have changed. We remember a really helpful woman from New Zealand who was super friendly and gave us a lot of advice about restaurants. The new manager seems super stressed and wasn't very helpful. The tote breakfast is sweet but could they please get some new beds? Please?!?", "Date": "September 7, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "San Francisco, California", "Title": "“A nice get away”", "Author": "kkhart", "ReviewID": "UR18508606", "Content": "Hideaway Cottages is a collection of small cottages located in \"downtown\" Calistoga, just a block off the main street. It's an easy walk to restaurants, shops and mud baths. We spent two relaxing days here. There are no pets or kids allowed, and they are located in a residential area so it is QUIET! The cottages are nicely appointed and ours had a real, working kitchen. There is a nearby grocery store, wine shops and a bakery, so we were able to stock up and then spend our time around the pool, reading and relaxing. The TV in the sitting room had real cable with a ton of channels, but we never used it. Everything was clean and there is daily maid service. This place is a find for an old fashioned relaxing summer get away.", "Date": "August 1, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Orange County", "Title": "“Home Away From Home - But Better!!!!”", "Author": "BritgirlOrangeCounty", "ReviewID": "UR17410175", "Content": "Our cozy cottage was perfect for a relaxing weekend! Bedrooms are nicely decorated in a modern farmhouse style with high quality linens. The cottages have small kitchens and guests can pick up a takeaway tote containing a breakfast of freshly baked pastries and juice each morning. We also enjoyed having our own private patio area - perfect for sipping an evening glass of your favorite wine from that day's vineyard tours. Easy walking distance to excellent downtown restaurants and spas, and the service from the staff was uniformly friendly and accomodating. Hideaway Cottages was the perfect place to fully relax and feel right at home in Napa Valley!", "Date": "July 1, 2008"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Business service (e.g., internet access)": "3", "Check in / front desk": "4", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Georgia", "Title": "“Fabulous Find”", "Author": "MaxGA", "ReviewID": "UR14880894", "Content": "We could not have been more pleased with the accomodations. We spent time trying to find a place to stay that would sent a laid-back, calm and relaxing tone for our trip. We found it. Compared to most hotels/motels/B&Bs in the area, these cottages are conveniently located. They are just two blocks from the main street. (Calistoga only has one main street with one red light.) It was a very easy walk to the far end of town. If you need supplies, the grocery is on the corner. Because you are off the main road, the area is quiet and peaceful. The cottages are dated. Built in the 40's. Think 50's ranch house for interior, especially kitchen and bath. This is not a sleak, modern hotel. It's a charming alternatives to the motels and B&Bs in the area. We stayed several days and found the cottage quite comfortable. Our room had a kitchen, bath, bedroom, and a den with couch and TV. Plenty of room. They are very clear that the office will not be staffed overnight and that they routinely walk the property. If the staff has to leave the property for any time, they post this information. They even put a note on our door that they had to leave early due to illness. Honestly, once we checked-in we did not need the staff until check-out. Parking is not adjacent to the cottages but is very close. With rolling luggage, this really wasn't an issue. They do not have phones in the room. They do have wireless internet. Breakfast is delicious - fruit, juice and pastries from a local bakery. The coffee in the room is from the local coffee house and is excellent. Most mornings we took our breakfast outside. They provide outside table and chairs for each cottage. The staff was very helpful. Great resturant and winery recommendations. Even gave us discount coupons. This is the \"sister\" property to Dr. Wilkinson's (best massage in Calistoga) and is an all-adult property. That might have added to the peaceful nature of our stay. Our room was close to the pool. The pool area is lovely. The only complaint we had was that the maintenance shed was next to the pool and the grounds keeper and housekeeping started early - before we wanted to wake up. Given how clean the place is and how comfortable the beds are - this is a small inconvenience.", "Date": "April 8, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Business service (e.g., internet access)": "4", "Check in / front desk": "3", "Overall": "4.0", "Value": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "california", "Title": "“loved the hideaway”", "Author": "gardengalCalifornia", "ReviewID": "UR8281931", "Content": "Very pleasant accommodations in calistoga. The unit was immaculate, neat, nicely furnished and met our needs. Of course you must realize that these are units from the 1940's at least, and the plumbing/appliances were probably updated in the early 60's at best. But everything works, so it is fine. We loved the pool and spa area, nice shade trees and very comfortable. The staff was very attentive and pleasant. Guides to restaurants/ wineries etc. were made available to us. Set back from the main street, the cottages are nestled in a residential neighborhood and just a short walk from the town grocery and the Wilkenson spa. Would have liked to take a spa at night past 10 PM but understand the limits, to ensure the quiet enjoyment for all. Other guests were quite nice and engaged in easy conversation. A couple of updates would be nice, new kitchen cabinet/stove, It needs more counter space. A new vanity in the bath would be a nice addition too. They need to add some hooks/towel bars too. The new bed frames are quite nice but alittle too big for the room, so walking around the bed is a bit of a challenge. These are small things. We will return for a weekend in the future.", "Date": "August 2, 2007"}, {"Ratings": {"Overall": "2.0"}, "AuthorLocation": "SF Bay Area, CA", "Title": "“Not so great--”", "Author": "love2bake", "ReviewID": "UR8263906", "Content": "I did not love this place. The cottages look cute and they have kitchens, the property is pretty, and the pools are nice. However, parking is not convenient, there are no phones in the rooms, and staff, while friendly, weren't easy to find. I've stayed in Calistoga a number of times and was looking for something different. That it is--and I won't come back.", "Date": "July 31, 2007"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "Santa Rosa", "Title": "“Once a year must”", "Author": "CallieSantaRosa", "ReviewID": "UR8102062", "Content": "There is a group of us gals that have been coming every year for the past seven years. We normally get three cottages right across from the pool. We love sitting outside in the mornings, drinking mimosa's and saying \"good morning\" to every one that passes. We also invite them to join us in a mimosa. We have met some wonderful people over the years, who are also staying there. People have told us they envy us for the fun we are having. The staff provides us with a BBQ, and one night while we are there, we BBQ outside our cottages and eat at the picnic tables provided. It is an absolute perfect getaway. Our group consists of six to twelve gals who love to get together and come from all over the bay area. When we found this place we could not believe our luck, and as I have said, we have been coming here for at least seven years now.....So please, do not hesitate to make your reservations. And if you happen to be there at the same time as a bunch of \"young broads,\" come join us in the morning for a mimosa........", "Date": "July 11, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "La Jolla, CA", "Title": "“We loved the Hideaway Cottages, had such a relaxing time”", "Author": "tonitravelLaJolla", "ReviewID": "UR7730954", "Content": "My husband and I stayed recently at the Hideaway Cottages in Calistoga and had a wonderful, relaxing time. The cottage we stayed in was very spacious, well maintaned and private. It had 2 bedrooms and a huge kitchen and dining room, living room and a bath. The pool area was very nice, the pool temperature and the spa was excellent. The location close to town and all the restaurants and shops was perfect. We will definately be back for another visit.", "Date": "June 1, 2007"}, {"Ratings": {"Cleanliness": "5", "Overall": "5.0", "Value": "5", "Service": "5", "Rooms": "5"}, "AuthorLocation": "Napa Valley", "Title": "“What a find!”", "Author": "goldinr", "ReviewID": "UR4100257", "Content": "On my most recent trip to Calistoga I had the pleasure of staying at the Hideaway Cottages. What a treat! The decor is very comfortable and comfortable, rooms are clean and the gardens and grounds are tranquil. I loved the cottages and will return again! Dinner at Brannan's and FlatIron Grill was also excellent.", "Date": "November 8, 2005"}, {"Ratings": {"Cleanliness": "5", "Overall": "5.0", "Value": "5", "Service": "5", "Rooms": "5"}, "AuthorLocation": "San Francisco", "Title": "“Perfect Hideaway”", "Author": "FoodGuru4you", "ReviewID": "UR3238818", "Content": "We just got back from a trip to Napa Valley and discovered a real jewel! The Hideaway Cottages is a perfect place to stay while touring the Valley. The rooms are very roomy and nicely decorated, the gardens are beautiful, and the staff is very friendly. The room are also very quiet and spotless! We found it to be a great value and we will be back. We also dined at Brannan's Grill and it was fantastic!", "Date": "March 1, 2005"}, {"Ratings": {"Overall": "2.0"}, "AuthorLocation": "San Jose, CA", "Title": "“Unexpected Charges and Ants!”", "Author": "A TripAdvisor Member", "ReviewID": "UR2813777", "Content": "I am rating this hotel for a few frustating reasons. Number one; i had experienced unexpected charges from the hotel. Here was the situation and one you should be aware of. A staff member that quoted me the hotel rate for a large group, quoted me a AAA rate automatically without telling me she already included it in the room quote. So - at checkout, I didn't get a 10% discount that I expected...it was already included unknown to me, so I was assuming I was getting a better rate. The contract says it was a \"planned\" discount, but unclear that they had already given it to me. Number two; the staff was rude about it. There was no emphaty. Number 3; there were ants all over our kitchen. Just be careful and read between the lines with this hotel.", "Date": "November 9, 2004"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "Alameda, CA", "Title": "“Excellent place to stay!”", "Author": "rsw1021", "ReviewID": "UR2171066", "Content": "My friends and I needed a place to stay in Calistoga. There were 5 of us and we wanted something that would comfortably accomodate us all. This was the best find! Walking distance to restaurants and shops. Jennifer and Sarah (checked us in and made sure we had everyting we needed) were super! We plan to come back again before the end of the year! The pool and hot tub were a perfect way to hang out and relax after going to a spa.", "Date": "June 8, 2004"}], "HotelInfo": {"Name": "Hideaway Cottages", "HotelURL": "/ShowUserReviews-g32143-d279694-Reviews-Hideaway_Cottages-Calistoga_Napa_Valley_California.html", "Price": "$110 - $550*", "Address": "<address><span rel=\"v:address\"><span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">1412 Fairway</span>, <span class=\"locality\"><span property=\"v:locality\">Calistoga</span>, <span property=\"v:region\">CA</span> <span property=\"v:postal-code\">94515</span></span> </span></span></address>", "HotelID": "2516230", "ImgURL": "http://media-cdn.tripadvisor.com/media/photo-s/02/5b/c5/5b/hideaway-cottages.jpg"}}