{"Reviews": [{"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "2.0", "Value": "2", "Sleep Quality": "3", "Rooms": "2", "Location": "4"}, "AuthorLocation": "Oconomowoc, WI", "Title": "“I Came to See Old Trees - Not Old Rooms....”", "Author": "kkeener57", "ReviewID": "UR119996285", "Content": "Don't let the name \"charm or fool you.\" Personally thought this was an old Red Roof Inn that they had put up a different sign. Stayed there with spouse and another couple on trip to Napa and Muir Woods. We only stayed one night which was a good thing...I have allergies and this place is a musty old hotel that is in desperate need of updates - carpeting old, outdated furniture, upholstery, bedspreads...everything needs attention. Slept with window open to air out room. The staff was nice - but that does not account for a price that was competitive if not more than nicer places in the area. Did not want to sit or lay on older bedspreads; . Rooms are dark and outdated decor. Get the point.....", "Date": "October 31, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "3"}, "AuthorLocation": "San Francisco, CA", "Title": "“The good thing is in California, stuff is slow to decay... like hotel rooms!”", "Author": "SpicyB", "ReviewID": "UR119970412", "Content": "This hotel has all the basic amenities and does the job for a quick stay. The staff were actually very friendly and nice and down to earth (translation: local twenty-something types with a somewhat laid back attitude, plus the parent-like managers). Reservations can be made online and it's all convenient. They also still use room keys which is a nice, classic touch. It's a little outdated with the tube TV, simple decor and bedding but it's not what I'd call shabby. Just simple. For example, our king room was spacious and equipped with a tiny kitchenette (stove! microwave! fridge! sink! very 70's!) but it didn't have a duvet on the bed, plush pillows or a comfy armchair. (There was a table with 3 sitting chairs, bench, closet, pullout ironing board in the room, iron, hairdryer. Make sure you request a room on \"the quiet side\" which means away from the pool area where people can hang out into the evening.) When my hubs and I stay up in Wine Country we're usually prepared to spend at least $200-250 per night + hotel taxes. Our usual place wasn't available (Indian Springs Resort and Spa), so we had to check out something new. We weren't disappointed in the John Muir as mainly a place to crash, get ready for the semi-formal wedding we were attending and spend just a little downtime before and after. A very reasonable deal for the Napa Valley considering Wine Country premium costs. This is perfect for adults who will be too busy hiking, wine tasting, dining out and shopping (and want to spend their $$$ on that rather than a hotel room). Or, a decent choice for posse on a budget (it's right off the highway with cheap eats nearby) who want to chill and don't mind the well-attended but dated atmosphere. The good thing is in California, stuff is slow to decay... I would recommend this place to friends that just needs a simple room versus a romantic high end hideaway.", "Date": "October 31, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "2", "Overall": "2.0", "Value": "4", "Sleep Quality": "3", "Rooms": "2", "Location": "5"}, "AuthorLocation": "pass1421", "Title": "“Yikes! Tired & needs a good renovation!”", "Author": "jzk131", "ReviewID": "UR119945617", "Content": "The location is great for this motel, however, it is tired and could use a good renovation. They may also want to consider adding better food to their complimentary breakfast and adding wine glasses to the room. They are in Napa, so that would be a good touch.", "Date": "October 31, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Location": "3", "Rooms": "2"}, "AuthorLocation": "Central Valley, California", "Title": "“Unimpressed”", "Author": "jg1983", "ReviewID": "UR118692110", "Content": "Stayed here for a wedding in Napa. I wasn't impressed with the hotel. It was like a Motel 6 but at the cost of a Marriott. Decor was old, beds we soft and you can feel springs moving. Should have spent the extra $$ to stay at the Marriott right down the street.", "Date": "September 28, 2011"}, {"Ratings": {"Cleanliness": "3", "Sleep Quality": "2", "Overall": "3.0", "Value": "3", "Service": "4"}, "AuthorLocation": "Boulder, Colorado", "Title": "“Shop Worn, Needs some upgrades!”", "Author": "pmcolorado", "ReviewID": "UR117879359", "Content": "We stayed here for 2 nights while attending a family wedding in the area. This was one of the more reasonable options that the bride and groom offered, and now I know why! This hotel has definitely seen better days. We had a room on the first floor - #124, a couple doors across and down from the housekeeping work area. The housekeepers kept the door to their work area open constantly, so every time we went to our room we got a nice look at the giant laundry machines, dirty laundry all over the place, and groups of housekeepers sitting around a table eating, folding, etc.... Lovely! The rooms are VERY basic. Beds are older and a little saggy. Bed linens and towels were threadbare. Carpet in the rooms and common areas at least needs a good shampoo, if not to be replaced. Bathroom was clean, but nothing special. Continental breakfast includes coffee, juice, mini muffins, yogurt, and bananas and apples. Again, quite basic. Location is convenient, and there is plenty of parking. Didn't use the pool but it looks quite small. Staff was pleasant and helpful. For the price, for Napa, and on a holiday weekend I think it was an adequate value, but I will definitely look for other options on my next trip!", "Date": "September 9, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "3.0", "Value": "4", "Service": "5"}, "AuthorLocation": "Los Angeles", "Title": "“Nice, Friendly”", "Author": "FlashDad", "ReviewID": "UR117188172", "Content": "We stayed here for two nights on an extended family road trip. The room was nice, clean and comfortable. The best part about it is the location. Two adult, one senior and two children used it as home base for various forays into the Napa Valley. Although right next to Highway 129, it is not noisy. Decor is pretty average. The staff is very friendly and the Continental Breakfast very convenient, if not elaborate.", "Date": "August 24, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "2", "Overall": "3.0", "Value": "3", "Service": "3"}, "AuthorLocation": "Phoenix, Arizona", "Title": "“Average”", "Author": "lucky715", "ReviewID": "UR115765807", "Content": "We recently stayed at the John Muir Inn on our trip to Napa. The staff was friendly. Hotel was clean. The atmosphere is definitely low key and the interior is somewhat dark. Not necessarily dreary but not vibrant. Room was clean and well kept but not very attractive. Bed was stiff and pillows were small and soft. Not a good choice for those with any back issues. Continental breakfast: small muffins, oj, coffee, yogurt and fruit. If you are a breakfast eater you will have to go out for something of substance. In a pinch I would stay here again but my preference would be some place with a bit more atmosphere and vibrance. There is a nice restaurant with wonderful food a block or so away to the north which was very convenient for our late dinner.", "Date": "July 25, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "4.0", "Value": "5", "Service": "5"}, "AuthorLocation": "London", "Title": "“friendly staff very good location”", "Author": "SemiLOOSE", "ReviewID": "UR113720009", "Content": "Napa was our second stop in our whirlwind california fly drive holiday. arriving in Napa and coming into the hotel we were treated by a very friendly receptionist. He checked us in and informed us that he is a wine taster and he is putting together a brochure for visitors and it was great to be met with such enthusiasm. He told about all the available amenities as well as suggesting areas to visit and places to eat. the hotel is a lot better for the money you pay, its clean and beds a good. soon as we chcked in we went out into the car park and played a bit of cricket with a tennis ball and using a water bottle as a bat. there is a restaurant opposite the hotel for which you get a voucher for free breakfast. a very pleasant experience, we only stayed there one night.", "Date": "June 15, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "memphis tn.", "Title": "“Accomodating”", "Author": "Skipper69MemphisTn_", "ReviewID": "UR105806415", "Content": "We were greeted by a friendly staff and they allowed us to check in ahead of our scheduled time. The room was big and had a refrigerator, coffee pot and microwave in the room. The rooms were clean and very comfortable. We loved the cats that greeted us at the entrance of the hotel. It had a down home relaxed and comfortable atmosphere. A restaurant located next to the parking lot made it very convenient for dinner that also served a continental breakfast to hotel visitors. Very nice. Would definitely stay there again.", "Date": "April 27, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Jackson, Mississippi", "Title": "“Great Value...Great Location”", "Author": "wwalkertannjr", "ReviewID": "UR92333372", "Content": "If you are visiting wine country and plan on being at wineries all day long, like we did, then all you need is a nice,clean,convenient place to come back to. The John Muir Inn really is a glorified Holiday Inn. Extremely clean and perfect location. There is no reason to spend a lot on your room when all you really are doing is having a place to crash! We have stayed here twice and will be doing so again in the very near future. It is extremely important to start your day, especially when drinking a bunch of wine, with a good breakfast and since you get a coupon to Marie Calendar's(which is in the same parking lot),it makes it extremely easy to start your day with a good fulfilling breakfast.", "Date": "January 9, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Tampa, Florida", "Title": "“Convenient location”", "Author": "Susan34678", "ReviewID": "UR82510217", "Content": "We stayed at John Muir for 2 nights as we visited Napa Wineries. The accomodations were good for an older hotel especially when you don't spend much time at the hotel. We had three females in one room and there was plenty of room for the roll away bed. It was a great location between wineries and downtown Napa. We would do it again and would recommend to friends", "Date": "October 7, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "2", "Location": "1"}, "AuthorLocation": "Washington", "Title": "“Don't waste your time or money on the John Muir Inn”", "Author": "pciriddle", "ReviewID": "UR79916616", "Content": "Lousy location adjacent the main highway. Stop light outside your room makes this a perfect all night drag racing take off point. Don't bother lodging a complaint with any of the staff because they will do nothing. The Manager will not bother to contact you when you write or email him either. This place is mediocre at best. The hot tub and pool are always dirty and nobody seems to have any maintenance responsibilities at all. The trees along the parking lot are diseased and many are dying. The best thing about this place is the adjacent Marie Callanders. Don't fall for the \"in room spa tub\" that adds another $30 to your nightly bill. The one we ended up with did not provide a \"spa experience\" at all so we used it once and never bothered after that time. When I complained the folks at the front desk simply said; \"sorry\". This place is a rip off and you could do better at a Super 8 or a Motel 6.", "Date": "September 17, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "3", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Los Angeles, California", "Title": "“Last minute stay... good experiance”", "Author": "wynwzrd", "ReviewID": "UR75632037", "Content": "My wife and I had a last minute stay here in Napa (needed just one more day!!) We checked in that night. The hotel is located on the north side of the town of Napa, ok place. The property is older, a bit worn around the edges, but clean. The wifi is the type that keeps cycling on/off at about every 30 min. I did have some trouble getting my two year old laptop to sign on at first, after that it was ok. (we used the 2nd wireless option on the networks available). Front desk staff at night and in the morning was very professional. Overall, the room was a bit pricey (hey it is Napa) for the quality of the room. DO NOT eat breakfast at Marie Calendars next door... bad experiance.", "Date": "August 17, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Indy", "Title": "“superdeeduper=great service, excellent location, plus marie callander”", "Author": "DavidLynwood", "ReviewID": "UR71306386", "Content": "Stayed 2 nights with my family a couple weeks ago. Great napa location for wineries. Very friendly, helpful staff and cats in the lobby=I'm allergic but they didnt bother me at all. All who stay get $5 vouchers to use at Marie Callender resturant across the parking lot= excellent menu, great variety but so many good place to try in Napa makes it hard to take it all in. Would stay here again and highly recommend it to all.", "Date": "July 18, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Location": "5", "Rooms": "3"}, "AuthorLocation": "Detroit, Mi", "Title": "“The right price and location for your Napa visit”", "Author": "detroiterchick", "ReviewID": "UR52549235", "Content": "This hotel is perfectly adequate for your trip to Napa. The location was ideal, located right off of the highway that leads to the many of the vineyards. The room was spacious and clean. The ambiance was minimal, but the price was extremely reasonable for Napa and the staff was helpful. We spent so little time in the room as it was; it was nice to save a bit on accommodations.", "Date": "January 4, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "3.0", "Value": "4", "Location": "3", "Rooms": "2"}, "AuthorLocation": "san antonio, tx", "Title": "“Don't be fooled by the name - its a Best Western”", "Author": "Aggie1996", "ReviewID": "UR30538499", "Content": "The positives - nice staff, fairly clean room, decent location (easy on & off the highway) The negatives - its nothing fancy. It is a best western with a cool name. We were under the impression that it was a rustic, lodge kind of place off the beaten path. It shares the parking lot with Marie Callendars and is next to a residential neighborhood. This is the hotle you bring your buddies to before a day of tailgating, not a place with your wife for a weekend of wine tasting... we wont get fooled again.", "Date": "May 22, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Business service (e.g., internet access)": "4", "Check in / front desk": "5", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Altrincham, United Kingdom", "Title": "“Great value in Napa Valley”", "Author": "JoDfromEngland", "ReviewID": "UR22004195", "Content": "We stayed at this hotel from 14-16th November 08, we were in Napa for a friends wedding and this hotel was great value for money in what can be a very expensive area. The hotel was just on the edge of the Napa Valley but in easy driving distnce of St Helena, Sonoma, Calistoga etc. The staff were very friendly, especially Stirling on the front desk. The room was comfortable and very clean, and good value for what we paid for the room. Marie Callendars breakfast was ok, good choice and with the discount card worked out very reasonable. I would recommend this hotel to anyone looking for value for money with helpful staff and clean rooms.", "Date": "November 19, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "5", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Denver", "Title": "“Lovely place”", "Author": "AceAceDenver", "ReviewID": "UR20326852", "Content": "Wonderful place. Great location. Comfortable rooms with nice beds. Front desk staff friendly and helpful. At check in, they had a few different rooms for me to choose from and just gave me the keys to go look at them and decide which room to pick. You get a discount at Marie Callendars for breakfast for each day you are there, The staff also has coupons and suggestions for the wineries in the area. Nice quiet pool area. Easy to find.", "Date": "September 24, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "3", "Check in / front desk": "3", "Overall": "4.0", "Value": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Bay Area - California", "Title": "“Great Value for the area”", "Author": "vetech63", "ReviewID": "UR19935512", "Content": "We thought this was a good value especially for the location in the Napa Wine Country. The staff was friendly and helpful. We were in room 301 next to a noisy ice maker, but the staff was sure to turn it off early in the evening which was perfect. We asked to check out other rooms for the noise factor, and found ours once the ice maker was turned off, was the quietest. The room is nice above average. Bed was a medium firm I would say. The room was very clean and there was no hallway noise. I did not see any children about in this hotel either. The restaurant next door was good. We will come back again.", "Date": "September 9, 2008"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Minneapolis, MN", "Title": "“Remember the 4 C's”", "Author": "RIKKASDAD", "ReviewID": "UR15133307", "Content": "No, not those four C's--this is not a diamond. But it is clean, comfortable, convenient and cheap. At least I think it was cheap--we booked through Expedia so its hard to tell.", "Date": "April 18, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "3", "Business service (e.g., internet access)": "3", "Check in / front desk": "5", "Overall": "5.0", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Oslo", "Title": "“Very helpfull staff”", "Author": "Oslofjord", "ReviewID": "UR14702859", "Content": "The staff were lovely. Helped us with everything, restaurants and sights. Great atmosphere with fireplace.", "Date": "April 1, 2008"}, {"Ratings": {"Service": "1", "Cleanliness": "3", "Check in / front desk": "3", "Overall": "2.0", "Value": "2", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Colorado", "Title": "“Rude staff”", "Author": "Margaret16", "ReviewID": "UR13707676", "Content": "We enjoyed the property but I have a huge problem with their rude staff.", "Date": "February 20, 2008"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "NEW JERSEY", "Title": "“Booked on short notice by another hotel who cancelled our reservation”", "Author": "THETHREEOFUS2005", "ReviewID": "UR10314609", "Content": "The Hilton Garden Inn called this hotel for us when they cancelled our reservation, and we were so happy that we were going to stay there our whole trip instead of the Hilton. King room booked 20 minutes before wer were to check in, huge beds, sitting area, jacuzzi tub in room. AWESOME breakfast next door at Marie Calenders which they give you a $5 per person voucher for (breakfasts are about $7 each, so around $4 per person with drinks after the voucher). By far the best value in Napa that I've seen!", "Date": "October 25, 2007"}, {"Ratings": {"Overall": "3.0"}, "AuthorLocation": "Los Angeles", "Title": "“a convenience”", "Author": "Shi Hu", "ReviewID": "UR5972145", "Content": "We spent two nights at the John Muir Inn in mid-October, 2006, which friends booked for us as it was near their home. The Inn was perfectly convenient for our needs, easy free parking, the rooms clean, quiet, with ample space in both the room and the bathroom. Internet access was free and convenient in the lobby. The young staff was helpful and professional. A continental breakfast was available in the a chain restaurant just steps away. No, it is not \"charming\" but provides adequate accommodations.", "Date": "October 19, 2006"}, {"Ratings": {"Cleanliness": "3", "Check in / front desk": "4", "Overall": "1.0", "Value": "1", "Rooms": "1", "Location": "1"}, "AuthorLocation": "Modesto, CA", "Title": "“Sleepless in Napa”", "Author": "Loves2GoPlaces", "ReviewID": "UR5935129", "Content": "My family and I had to stay at the John Muir Inn as part of a ballooning package I won at an auction. I did not want to stay at the JMI, but was forced to. The AAA travel gal said they were a three diamond property and that it was comfortable. FOR WHOM?? I have to say, the staff was very nice and the lobby was warm and inviting, but that's it as far as comfort. We were checked in on the first floor at the end of the hall. The place was 'booked\" so we could not change rooms. Since I had my son with me, we had a room with double beds. Yes, the place was \"clean\" but try sleeping on a lumpy mattress with bad pillows and that's a recipe for being tried in the A.M. Now this was not the JMI fault, but the road noise was awful and the drunken masses that filed in at 3:00 AM was no picnic either. It was a sleepless night and at $160 was totally not worth it. When we checked out at 6:15AM the next day, I realized we did not even stay there 12 hours, but I was so happy when we left. The guy at the front desk was all apologetic after I told him about the terrible matresses, but that was it. I will never stay there again and I am going to let AAA know, this is NO triple diamond property. Also, check out my review of Balloons Above the Valley, I think you will find it informative. Happy Traveling :-)", "Date": "October 10, 2006"}, {"Ratings": {"Cleanliness": "4", "Overall": "4.0", "Value": "4", "Service": "4", "Rooms": "3"}, "AuthorLocation": "California", "Title": "“Just what we needed”", "Author": "TrekMeister", "ReviewID": "UR5353997", "Content": "My husband and I stayed at the John Muir Inn the night before our balloon ride. We were looking for a place that was inexpensive but clean and comfortable. John Muir Inn was just what we were looking for. Our room was a good size, and very clean. The bed was comfortable, although our pillows were fairly worn. However, when we called the front desk for different pillows, they delivered firmer, newer pillows to our room. The room had all the amenities we needed, including an ironing board and iron, and a blow dryer. The service was really nice. We had to check out before dawn to get to our balloon ride, and it was a nice surprise to find the front desk staffed with a very friendly, helpful person that early in the morning. The hotel was conveniently located adjacent to a Marie Calendar's restaurant. Also the hotel has three regular feline residents that are very cute and friendly, and help to make the Inn feel more homey.", "Date": "June 16, 2006"}, {"Ratings": {"Overall": "3.0"}, "AuthorLocation": "", "Title": "“Ok, but um...”", "Author": "Lunchbox229", "ReviewID": "UR4983944", "Content": "I was put here because my condominum was overbooked for one night. At first, the hotel sounded excellent, promising beautiful rooms and a great property. When you pull up, it looks like a Days Inn right off the highway. We walked in and the lobby was dark and had the smell of a doctors office. The rooms are spacious, clean and have newer beds and furnature. The hotel lacks ammenties BIG time. It is adjacent to Marie Callanders and a 2 min. walk to a nice Bistro. Overall, the hotel is average and nothing to write home about. NOTE ABOUT WIFI: Unlike another report, the WiFi has 3 hotspots throughout the hotel. I recieved full reception from the lobby location, but there is also one on each floor...", "Date": "April 17, 2006"}, {"Ratings": {"Cleanliness": "4", "Overall": "3.0", "Value": "3", "Service": "4", "Rooms": "3"}, "AuthorLocation": "", "Title": "“It was ...um...OK ...nothing special”", "Author": "Karacg", "ReviewID": "UR3503824", "Content": "First I might say that I expected something charming. The John Muir is not charming by my book. It is right off the highway at the southern end of Napa Valley, near the strip malls. The bed and room were fine -- nothing spectacular, but fine. The bathroom was fine. Spacious and clean. Great view of.....the parking lot. No breakfast in the hotel, you have to go next door and we never bothered. It is like a Best Western or a Comfort Inn...nothing outstanding. The staff was helpful and courteous. I understand that for the price this is a good deal, but I was expecting something with more personality - I could have been in Chicago or Deluth and not known the difference until we drove a few miles. This may just be my own unfulfilled expectations. It is fine for overnight but not someplace I would seek out for a vacation spot. Not particularly romantic -unless you like to look at the parking lot - but a comfortable enough and clean place to sleep.", "Date": "May 27, 2005"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "Northern_California", "Title": "“Great Value!”", "Author": "Nerdy_Dood", "ReviewID": "UR3186042", "Content": "Stayed at this inn on Saturday, 2/12/05 as a valentines getaway for me and my girlfriend. I was a little skeptical at first, as the inn actually shares a parking lot with Marie Calender's. However, as we were assigned a room by the helpful front desk, the suite was very spacious. The bathroom had a whirlpool jacuzzi and was pretty clean. We never got to see the chubby cats that the other guests had mentioned, since they were always out and about. The next morning, they gave $5 off vouchers for sunday brunches at Marie Calender's (what a bonus!). I would definitely recommend this as a place to stay in Napa. I paid $165 (+ tax) for an overnight stay, which is cheaper than staying at a B&B. Pros: Great Value!, Great bonus off voucher, spacious rooms, good location! Cons: TV was positioned rather awkwardly at an angle from the bed (very minor). See also my other review on Lavender Hill Spa!", "Date": "February 14, 2005"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "Burlington, Vermont", "Title": "“Nice Place, Good Deal”", "Author": "jgNYC", "ReviewID": "UR2785023", "Content": "For the price, I honestly expected John Muir Inn to be a motor lodge. I was shocked that it was actually a very nice place. It was a very comfortable attractive hotel with all the comforts...fridge, comfy bed, nice large clean bathroom, good climate control, the room was spacious. It was great. Also very freindly staff. I would highly recommend it. When we were there they even did a complementary wine tasting in the evening for all hotel guests and there were breakfast vouchers for the place across the parking lot.", "Date": "October 25, 2004"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Los angeles", "Title": "“John Muir, Best Value”", "Author": "bendoni", "ReviewID": "UR2569809", "Content": "This Hotel was a pleasure to visit. It was inexpensive and clean. The people who work there were very friendly and helpfu. My favorite thing about the hotel were the very laid back Lobby Cats. Enjoy Greg Bendoni", "Date": "September 13, 2004"}], "HotelInfo": {"Name": "John Muir Inn of Napa", "HotelURL": "/ShowUserReviews-g32766-d251862-Reviews-John_Muir_Inn_of_Napa-Napa_Napa_Valley_California.html", "Price": "$113 - $169*", "Address": "<address><span rel=\"v:address\"><span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">1998 Trower Ave.</span>, <span class=\"locality\"><span property=\"v:locality\">Napa</span>, <span property=\"v:region\">CA</span> <span property=\"v:postal-code\">94558</span></span> </span></span></address>", "HotelID": "251862", "ImgURL": "http://media-cdn.tripadvisor.com/media/photo-s/01/c1/37/6d/hotel-front-at-night.jpg"}}