{"Reviews": [{"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Bensenville, Illinois", "Title": "“Been staying there for 20 years...”", "Author": "Keith W", "ReviewID": "UR124728068", "Content": "My favorite little hotel in Mexico City. The same staff has been there for a long time and they know me by my first name. It has been remodeled. Convenient to the Metrobus. A short walk to the Zona Rosa. Rooms are a little small, but pleasantly decorated with a European style. They even let my dog (a small bichon) stay with me. The restaurant is pretty good if you don't feel like leaving the hotel. They will send a SUV to the airport to pick me up, usually less $$ than the registered taxi. However, unless you're comfortable with the lifestyle in urban Mexico, it would be better to stay at a brand name hotel.", "Date": "February 17, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Sleep Quality": "3", "Rooms": "2", "Location": "5"}, "AuthorLocation": "Colima", "Title": "“Great location, 1960's style hotel”", "Author": "HdGowner", "ReviewID": "UR123133920", "Content": "I spent 2 nights at the Roosevelt and was partially disapointed. Pros: Great location in La Condesa, great restaurants and bars close by. Cons: Old building with an ancient style. Basic service. Soviet atmosphere.", "Date": "January 15, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Sleep Quality": "2", "Rooms": "1", "Location": "2"}, "AuthorLocation": "San Pedro Garza Garcia, Mexico", "Title": "“Poor Quality - Not worth the money”", "Author": "mtorres108", "ReviewID": "UR119964699", "Content": "We stayed for 1 night at the hotel and left the morning for another place. Room was very small, bed linens, courtains and towels were rotten with holes and steins. Bathroon was ok, with hot running water. Location is not the best, it felt a little dangerous. I would not go back there. The price was low, but not the lowest.", "Date": "October 31, 2011"}, {"Ratings": {"Location": "3", "Overall": "2.0", "Value": "3", "Service": "3", "Rooms": "3"}, "AuthorLocation": "Merida, Mexico", "Title": "“once was a good hotel”", "Author": "paul z", "ReviewID": "UR118232801", "Content": "had been staying here for 6 years. under new management and the place is dreadful. low morale with staff. new all night bars all around the already noisy hotel. people yelling in the halls and the staff making noise in the early morning. after 6 years with this hotel [3 times a year] the new management will not make a reservation for a suite. the long weekend we stayed there the restaurant flooded and the place had a sewer smell. too bad. it was once a good hotel.", "Date": "September 17, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Acolman", "Title": "“Exceeded my Expectations”", "Author": "Key13", "ReviewID": "UR110158818", "Content": "I chose this hotel based on the good reviews, the price (about $65 per night) and the location. I have to say, it exceeded my expectations. The rooms were very clean and the maids left two bottles of water for us everyday. The room wasn't exactly spacious, but they definitely weren't cramped for two adults and one young child. The pillows were a little harder than what I prefer and the mattress was a pillowtop that was softer than expected. The soap and shampoo were horrible, it dried out our skin and frizzed out our hair, I would recommend bringing your own or bring lots of lotion. The showers were refreshing with nice hot water and strong water pressure. One thing I didn't like about the rooms is that they get stuffy fast. The ceiling fan worked great, but I would recommend leaving the window open a few inches to get some fresh air. The windows were thick and they did a good job at keeping the traffic noise out. Another thing, keep kids away from the window, there is no screen and it could be dangerous to not watch your child in the room with the window open, especially on one of the higher floors. I was very happy with the staff. Anytime you passed them in the hall they said hi. Check-in and check-out was quick and any question you asked was answered enthusiastically. We were especially happy when we were informed that internet was free, we weren't charged one peso for access. That was a huge convenience for us. When we reserved our room online, we requested a quiet room and we were thrilled to find that they accommodated us by putting us on a higher floor, farther from the traffic noise. Sleep came easy to us all. The location was great. The hotel sits on one of the corners of a 5-point intersection and there are plenty of different restaurants and convenience stores to chose from. It is close to Chapultepec Park (less than 10 minutes by taxi) and the Angel of Independence as well as some good shopping malls. Also, there were a lot of interesting bars around in the area, but we didn't try out any of them because it was a family trip. The hotel restaurant was convenient and the menu provided plenty of options to keep all of us happy. After we looked at the prices, we made the mistake of assuming that the plates were small and we ordered too much food. Just one bowl a soup filled me up since a bread basket came with it, and it the best tortilla soup I ever had. The breakfast menu was a great thing to look forward to in the mornings. They are open late so when we got back from touring late, we could order some good, hot food from the restaurant. They deliver it to your room free of charge, just make sure you tip. Overall, we were extremely satisfied with Hotel Roosevelt. The value was excellent and we would have stayed longer if our bodies weren't so exhausted from dragging around an energetic 4 year old for 2 days straight. We would recommend this hotel to anyone and we hope to return again soon.", "Date": "May 27, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "3", "Sleep Quality": "3", "Rooms": "5", "Location": "5"}, "AuthorLocation": "South Carolina", "Title": "“Updated and Immaculate”", "Author": "SouthCarolinaMax", "ReviewID": "UR81967899", "Content": "Hotel Roosevelt is beautifully located on Insurgentes Sur, within 100 feet of the Metro Bus stop. It is a 10 minute ride on the metrobus to the Zona Rosa, and is surrounded by shops and restaurants. The neighborhood behind the hotel (Condesa) is upper class urban, young, and filled with great restaurants and parks. The hotel is older and basic business but has been well updated and pleasant upstairs. There is a large (but just adequate) restaurant downstairs and the lobby is very small. The rooms are sleek, and antiseptically clean. The bed was really hard (a warning for those predisposed to soft pillowtops) but I found it good sleeping. The bath was very nice with great tilework. My room on the Yucatan Street side was on the third floor and despite the double paned windows and heavy drapes, the traffic noise was annoying. Since there is no ceiling fan or AC, the guest faces a dilemma: open the window and endure the noise or keep it closed and endure the stuffiness. We finally compromised: open during the day and then late in the evening for awhile before trying to get some sleep. The staff was extremely cordial and helpful. The room service was off the same menu from the restaurant at the same prices, the only extra was the tip.", "Date": "October 3, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "3", "Sleep Quality": "3", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Frazier Park, California", "Title": "“Good hotel, but choose which side to book on”", "Author": "OnParleFrancais", "ReviewID": "UR59086666", "Content": "I stayed at this hotel while taking a two week language course at a nearby school. It was just fine, except for the first weekend, when the noise (which some might call music) was SO LOUD (excuse the caps) that I could not get to sleep until after it shut down at 2:15 in the morning. I just canÂ´t believe the neighbors have not complained about this insult to the ears, but perhaps the bar is owned by a local politician or narco crook, who knows? Anyway, this is a fine hotel (beautiful marble), but insist on the Popocatapl side, not the side facing the noisy traffic and the bar, at least on Friday and Saturday nights. The management was just fine when I asked to move. As for transportation, it is not on a metro (underground) line but instead is served by a very speedy Metrobus. Four pesos a ride.", "Date": "March 20, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "3", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "New Castle, Delaware", "Title": "“No Noise, Just Great Clean, Cheap Hotel”", "Author": "pin-up-82", "ReviewID": "UR23403326", "Content": "We went to Mexico City for one of the biggest parties of the year, the Day of the Dead festival/Halloween. Even with all the parties, festivals, street fairs and commotion, the Hotel Roosevelt was calm and tranquil, even though they were very busy. We were extremely happy we picked there to stay! It is in a centralized location, right on Insurgentes, and is easily accessible to the bus and taxis, and there is even a little grocery in the gas station across the intersection which is great for late night snacking. Staying for 6 days, we never saw a cockroach, bug, or had something stolen. We loved every minute of it! The one major problem we had at the hotel, and this goes for any hotel, is that the tax is 10%, plus the tourism tax is %25. Anytime you stay in a hotel, it will cost you THIRTY FIVE PERCENT just to walk into the door. That shoots the price up, so if you think you're staying for cheap, think again! Think about renting an apartment with a kitchen instead.", "Date": "January 9, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Check in / front desk": "3", "Overall": "3.0", "Value": "4", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Brooklyn", "Title": "“Good rates and neighborhood, but noisy”", "Author": "Horatio_Jitterbug", "ReviewID": "UR22699409", "Content": "We stayed here and at Hotel Prim when staying in Mexico City- if I had to chooose between the 2 I'd go with Hotel Roosevelt. Both hotels were noisy, but my girlfriend and I really liked Condessa/Roma neighborhoods so this hotel's location was great for us. Compared to Hotel Prim, this is further from historic touristy stuff but the neighborhood is much better. We loved with parks within 10 minute walk with great places where you could get food to go and chill in the park. Tons of great bars/restaurants in a 10 min walk. Rooms had a lockbox in closet (which I very preferred much compared to lockboxes at lobby desk at Hotel Prim). Plus this hotel seemed a bit more modern, maybe a bit cleaner, and just as cheap. Not the place for pampering/luxury, but very reasonable rates in a great neighborhood.", "Date": "December 13, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Business service (e.g., internet access)": "2", "Check in / front desk": "4", "Overall": "2.0", "Value": "3", "Rooms": "2", "Location": "3"}, "AuthorLocation": "Connecticut", "Title": "“Serviceable but nothing else”", "Author": "Ferrah", "ReviewID": "UR14635197", "Content": "Stayed here for three nights. We had a cramped 'matrimonial' room facing the street. The noise of the traffic was absolutely deafening. When there wasn't traffic, the noise of the groups of local school children in the courtyard came right through the paper-thin door. The room seemed clean enough, but the sheets were almost translucent, the furniture and carpeting looked ancient. There's sort of a fusty, never been remodeled, aired-out, or exposed to sunlight smell and look to the place. The maid service was excellent though, bottled water was provided each day, and the guys at the front desk are very helpful if you speak Spanish. Don't let them call a cab for you, though, as we got charged 70 pesos for a three or four block drive to a breakfast place (they told us, for whatever reason, that it was too far to walk!) Unlike other reviewers, I didn't find the location particularly great. Sure, it's close to bus stops, but so is everywhere in DF. The nearest metro stop is very far away, and there's no restaurants or cafes within the immediate vicinity. The streets get kind of deserted at night, so although it is possible to walk to the area with clubs and restaurants in Condesa, I wouldn't recommend it. Next time I'll choose my hotel for comfort rather than location in a brand-name neighborhood.", "Date": "March 29, 2008"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Check in / front desk": "3", "Overall": "2.0", "Value": "2", "Rooms": "2", "Location": "3"}, "AuthorLocation": "Australia", "Title": "“great location but bad noise problems”", "Author": "FrancescaAustralia", "ReviewID": "UR14558374", "Content": "I stayed at the Roosevelt 3 nights during the Easter long week-end, after reading generally positive reviews from previous visitors. Unfortunately my experience was not overall very positive. Yes the location is excellent, but I was given one of the rooms facing the tiny !!! internal courtyard and the noise problems were such that I was waken up several times every night by unpleasant noises of one sort or another (someone vomiting in the midddle of the night, loud sex, loud talking, loud TV, you name it I had it!!). There are 16 rooms and associated bathrooms facing this courtyard all with their windows open for lack of air in the rooms, which are dark and fairly claustrophobic, but clean and with great showers. There is a fan but you canÂ´t regulate the speed, so you have to keep turning it on or off. I couldnÂ´t cope in the summer heat as the courtyard is airless. So I will not stay here again, which is a pity as the area is great, but sleepless nights donÂ´t make happy travellers. And yes the matress was rock hard and the pillows very uncomfortable as well and the linen pretty worn out. Maybe the higher priced rooms are better, but I am not going to take my chances here again.", "Date": "March 26, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Business service (e.g., internet access)": "4", "Check in / front desk": "4", "Overall": "4.0", "Value": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Austin, Texas", "Title": "“Comfort and Affordability in Mexico City”", "Author": "sugrmag", "ReviewID": "UR10837892", "Content": "This was my first visit to Mexico City and I was traveling with my husband and 76 year old aunt. I was able to make our reservations online. When we arrived the king room that I had reserved for my aunt was not available for the first night, but she didn't really care and decided to stay in the double bed room for the entire stay. The hotel is in the midst of renovation and both our rooms had already been renovated. Although we were not bothered, they were in the midst of renovating the floor my aunt was staying on and she said she was woken up a couple mornings to banging. The bed was firmer than I prefer but not rock hard, the bathroom was modern and new with a huge shower and the location is within walking distance to the hip area called the Condessa. The only problem is that our cab driver from the bus station wasn't immediately familiar with it but luckily found it with little direction (at the intersection of Insurgentes and Yucatan) and our bus driver for the pyramid tour got lost trying to find it in the middle of payday rushhour, so I guess it's not a well know hotel but I thought convieniently located to what we wanted to see (the hotel, archeological museum and Zocalo formed a convienient triangle). The hotel restaraunt was decent although the morning staff was pretty slow. The evening staff was friendly and prompt. There is internet access in the restaraunt and although it says $50 pesos for 15 minutes (still cheaper than cafes) I was never charged. Considering that for 4 nights we paid $178 U.S.D. the Hotel Roosevelt was an amazing deal in a great area of Mexico City. I'm guessing with all the renovation that is happening that it will be more expensive the next time we go, but we will certainly check it out before making reservations somewhere else.+", "Date": "November 15, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "3", "Check in / front desk": "4", "Overall": "5.0", "Value": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "England", "Title": "“Home from Home”", "Author": "Ursalina", "ReviewID": "UR7829443", "Content": "I've been staying at The Roosevelt since 1998 when I spent three months living there. It's a simple, modest and comfortable hotel, and I wouldn't dream of staying anywhere else in Mexico City! It's very affordable, conveniently located for the city center, and right on the edge of the beautiful Condesa district, but the best thing about The Roosevelt is the charming staff. The hotel restaurant, serving tasty simple dishes, is manned by friendly waiters who always remember me when I return. A delightful place - and a bargain too.", "Date": "June 10, 2007"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Bloomington, Indiana", "Title": "“Good stay at the Roosevelt”", "Author": "WalkingBob", "ReviewID": "UR5581229", "Content": "The Roosevelt is a good, economical choice for travelers to Mexico City. The public transport is excellent (Insurgentes Metrobus stop just up the street with good connections to the Metro). The service was excellent (both housekeeping and the front desk). The on-site restaurant is satisfactory, but is pay-as-you-go since it is independently managed. I took most breakfasts at a nearby branch of the excellent Bisquets Obregon chain. The hotel laundry service is good, but there are more economical choices in the neighborhood. The main problem with the hotel is traffic noise (noted in other reviews). The rooms on the southern side of the hotel are somewhat quieter than on the (Yucatan Street) north. Best for quiet are the interior rooms which I routinely request from economy hotels in Mexican cities. A plus is that the hotel is convenient to the restaurants and other action in both the Condesa and Roma neighborhoods. I walk, but others may want to opt for a short taxi ride--especially after about ten pm. On that topic, my impression is that the security situation for tourists is considerably better that it was five or six years ago. The streets are livelier than they were then--at least in the entertainment districts. Residential streets are pretty quiet after ten o'clock.", "Date": "August 9, 2006"}, {"Ratings": {"Cleanliness": "5", "Overall": "3.0", "Value": "5", "Service": "4", "Rooms": "4"}, "AuthorLocation": "Mexico City", "Title": "“Temporary Home”", "Author": "JudyMexicoCity", "ReviewID": "UR5367229", "Content": "My husband and I spent 3 weeks at the Roosevelt while we were waiting for our Condo in Condesa to be completed. We found the room very comfortable (many of them are being remolded) and extremely affordable. The only complaints we had were in regard to a group of children on some type of group trip who played havoc in the hotel. We parked our brand new car in the garage and it was apparent that someone seat on the hood and slid off it (scuffing it). The price is affordable and I recommend it to our numerous friends who come to visit us. The price is a bargain. I do not recommend eating in the attached restaurant.", "Date": "June 20, 2006"}, {"Ratings": {"Cleanliness": "5", "Overall": "4.0", "Rooms": "3", "Service": "4"}, "AuthorLocation": "Tomball, Texas", "Title": "“Clean & Inexpensive”", "Author": "A TripAdvisor Member", "ReviewID": "UR4081008", "Content": "We stayed at the Hotel Roosevelt because of the location, very near to my family's apartment. The bed was not the most comfortable, but everything was very, very clean. The bathroom was spotless. The staff was very friendly and helpful. If you use a washcloth when bathing, take your own - the hotel doesn't even know what they are. The hotel was very inexpensive. I will stay there again the next time I visit my family.", "Date": "November 2, 2005"}, {"Ratings": {"Overall": "3.0"}, "AuthorLocation": "nashville, tennessee", "Title": "“Economical choice”", "Author": "etimer", "ReviewID": "UR1713505", "Content": "I stayed at the Hotel Roosevelt in February of 2004. The staff was friendly, the room was clean. The price was great, 370 pesos per night (about $34 USD). The only real negative is the noise from the very busy streets outside. I was only bothered by the incessant car horns that start pretty early each morning. La Condesa is a beautiful art deco neighborhood with great parks, restaurants and people...charming Amsterdam Avenue is only one block from the hotel, but it seems a world away from the noise of Insurgentes.", "Date": "March 8, 2004"}, {"Ratings": {"Overall": "3.0"}, "AuthorLocation": "Tacoma, WA", "Title": "“This was clean and adaquate”", "Author": "A TripAdvisor Member", "ReviewID": "UR1281585", "Content": "I stayed at the Hotel Roosevelt for 3 nights in August 2003. I got a king size bed on the 3rd floor for 400 MP per night. The room was clean, the lights and plumbing all worked well. I had no complaints at all. The restaurant was also a decent place to eat. The food was moderately priced and served quickly. This is not the Four Seasons Hotel but it's not priced to be either. The only potential downside I'd mention is the lack of air conditioning. While the weather was mild enough to not need it during my stay, I suspect the building could really warm up during the hot season. If I go back to DF, I would not hesitate staying in the Roosevelt again.", "Date": "September 11, 2003"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Ensenada, B.C.", "Title": "“very nice place.”", "Author": "A TripAdvisor Member", "ReviewID": "UR859358", "Content": "The hotel was pretty nice, clean, everything worked... the only complain perhaps was that it took a while for the hot water to come out (the water heater is centralized and this hotel has several floors)... and the personnel was helpful...they even allowed many people per room.... (we took 4 rooms... 4 persons per room... school trip) Everyone we met was nice and helpful not a 5 star hotel... but excellent for people on moderate budget... and the nearby metro (subway) station is a nice way to get around... except during rush hour... :)", "Date": "February 19, 2003"}], "HotelInfo": {"Name": "Hotel Roosevelt", "HotelURL": "/ShowUserReviews-g150800-d252644-Reviews-Hotel_Roosevelt-Mexico_City_Central_Mexico_and_Gulf_Coast.html", "Price": "$49 - $49*", "Address": "<address> <span rel=\"v:address\"> <span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">Insurgentes Sur, 287</span> | <span class=\"extended-address\">Colonia Hip&oacute;dromo Condesa</span>, <span class=\"locality\"><span property=\"v:locality\">Mexico City</span> <span property=\"v:postal-code\">06100</span></span>, <span class=\"country-name\" property=\"v:country-name\">Mexico</span> </span> </span> </address>", "HotelID": "252644", "ImgURL": "http://media-cdn.tripadvisor.com/media/photo-s/02/3e/e0/11/fachada.jpg"}}