{"Reviews": [{"Ratings": {"Overall": "3.0", "Value": "3", "Service": "3"}, "AuthorLocation": "Tampico, Mexico", "Title": "“Under construction...”", "Author": "Lilitu71", "ReviewID": "UR118021447", "Content": "Well, the hotel is being upgraded and a lot of noise can be heard since early in the morning. Also, its name is no longer Monte Real but Howard Johnson Alameda. It's located one block away from one of Mexico City main avenues, and you can just walk to Bellas Artes, Torre Latinoamericana, etc. It's not that expensive, it has no a/c, and if you're going to spend your day out of the hotel or the noise doesn't bother you, this hotel is for you.", "Date": "September 12, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "3.0", "Value": "4", "Sleep Quality": "1", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Guadalajara, Mexico", "Title": "“Good hotel, but big lack of security”", "Author": "Melina_Guadalajara", "ReviewID": "UR92307010", "Content": "The hotel is good, comfortable with good services. Our stay could have been nice but a very bad experience prevented us to enjoy the hotel. We simply got stolen in our own room when we were inside: a guy posed as a technician for the TV that didn't work and left with my phone without us noticing (luckily, since he could have attacked us without problem). It seems that noone takes care of the security nor control the access of this hotel. Their reaction was prompt and benevolent to handle the problem (looking for the guy which was know for working with them before), but obviously we never recovered the phone. They changed our room without problem. Except from that, the room was clean, the service good, even if there was a bit of noise because of the proximity of one or several club and a party in the hotel the first night. Notice also that the internet connection is not available everywhere in the hotel (4th had bad connectivity and 9th none at all)", "Date": "January 9, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Location": "5", "Rooms": "3"}, "AuthorLocation": "manchester", "Title": "“Basic but well located”", "Author": "yellowboxfish10 Posted by an OctopusTravel traveler", "ReviewID": "UR90578624", "Content": "Not the best rooms in the world or the comfiest beds but in a very good location. Friendly staff with limited English. Don't eat at the hotel restaurant as much better places close by. Filled up with tour groups ( and they were young and loud) but for a convenient location and price in a major city you can't really complain.", "Date": "December 23, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "2", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Sydney, Australia", "Title": "“Great value, but so many tour groups!”", "Author": "bearpackers", "ReviewID": "UR60873305", "Content": "Stayed here for 8 nights over easter, found a cheap rate on hotelscombined.com ($25pn). Room was good size with two double beds, safe, decent bathroom, and tv (they have about 20 channels, most in spanish or dubbed in spanish). During our stay there were atleast 3 tour buses checking into the hotel every day. They would only stay a night and then leave the next morning. Not sure if this was for easter or holidays, but the groups socialised in the lobby making it crowded if you wanted to use the wifi (wifi only available in lobby, not in rooms). One of the nights a few buses with younger people arrived and luckily for us some of them stayed in the room next to ours. It must of been the party room as they kept the door open and had about 10 people or so in there drinking and carrying on till atleast 2am. Called reception who asked them to quite down, which they didnt. Couldn't sleep, so went downstairs to use the wifi, but there were about 20 or so people down there drinking beer with about 100 or so empty beer cans everywhere. Seemed receiption couldn't control them as they were so bloody loud! Other than that, the hotel is great value and would recommend for the budget traveller.", "Date": "April 9, 2010"}, {"Ratings": {"Service": "2", "Cleanliness": "4", "Overall": "3.0", "Value": "4", "Location": "4", "Rooms": "3"}, "AuthorLocation": "Burlington, Iowa", "Title": "“This was a very nice hotel, different from what I was use to in the states.”", "Author": "forshanmill", "ReviewID": "UR37426433", "Content": "Hotel didn't have a lot of amenities, but the staff was very accommodating, when we needed extra things like towels, toilet paper, & bottled water.", "Date": "August 11, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "4.0", "Value": "5", "Location": "5", "Rooms": "3"}, "AuthorLocation": "western US", "Title": "“Good choice and location for value Mexico City”", "Author": "airstreampilgrim", "ReviewID": "UR36537736", "Content": "I have stayed here at least five times, sometimes for one night and other times for three. Will stay again in Nov 09 for three nights. Good location for visiting Mexico City. Historic centro area. Price is reasonable. Hotel is average standard, nothing special and no special old charm color. (but, my wife considers it acceptable). They do get some tour buses, so the lobby can be a little noisey on occasion. Two block walking distance to metro station, and if heading toward the zocolo- many places to eat. I usually do not reserve ahead of time, just walk in and have never had any problems getting rooms for me or other family members. An alternative hotel nearby is the Marlowe, a wee bit more upscale but also reasonable. I have also stayed nearby at the Hotel San Francisco, but did not like the service. It is even cheaper in price. My favorite cafe nearby is the Trivol, located north, next to the Park Alameda.", "Date": "August 3, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "3", "Check in / front desk": "5", "Overall": "5.0", "Value": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Falun, Sweden", "Title": "“Best location”", "Author": "Mikkzo", "ReviewID": "UR22696523", "Content": "We ended our vacation in Mexico in October 2008 staying at the hotel Monte real. The hotel was in most ways very good. The rooms clean and in very good condition. The service at the hotel is very good and the staff helpful and nice. The rates are reasonable, for 50$ we had a fine room with two beds. The location is very good in the historic centre close to the alameda park. On the nearby streets there is some local street-markets. There is lots of good restaurants and the metro is just two minutes walk from the hotel. We would most likely stay at this hotel again coming to Mexico!", "Date": "December 13, 2008"}, {"Ratings": {"Cleanliness": "2", "Overall": "2.0", "Value": "2", "Service": "1", "Rooms": "2"}, "AuthorLocation": "Sydney, Australia", "Title": "“very noisy”", "Author": "minoumex", "ReviewID": "UR5046018", "Content": "We have just arrived from a wonderful month in Mexico. WE had three nights at the Hotel Monte Real with the plan of staying another three. Certainly the position is good and the rooms clean, however, the rooms were very small and stuffy (if the room was facing into a covered courtyard) and they had inadequate fans. We changed to a room facing the street which had a tiny window opening to allow the minimum of air into the room, but there was a very noisy club directly opposite which had blaring music allnight and men screaming in the street. The hotel was also full of school groups who naturally enough were also noisy. We had no sleep at all and the people at reception were not at all helpful or pleasant. This was a surprise as in our entire month in Mexico we found the Mexicans kind, helpful and very friendly and we loved every minute of our stay. We decided not to spend our last three night at the Monte Real and went to the hotel Isabel which was half the price, with huge rooms with high ceilings and balcony, close to the Zocola with the most friendly and lovely people. Mexico is such a fantastic country so there I would certainly stay again.", "Date": "May 10, 2006"}], "HotelInfo": {"Name": "Hotel Monte Real", "HotelURL": "/ShowUserReviews-g150800-d252638-Reviews-Hotel_Monte_Real-Mexico_City_Central_Mexico_and_Gulf_Coast.html", "Price": "$45 - $69*", "Address": "<address class=\"addressReset\"> <span rel=\"v:address\"> <span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">Revillagigedo, 23</span> | <span class=\"extended-address\">Colonia Centro</span>, <span class=\"locality\"><span property=\"v:locality\">Mexico City</span> <span property=\"v:postal-code\">06050</span></span>, <span class=\"country-name\" property=\"v:country-name\">Mexico</span> </span> </span> </address>", "HotelID": "252638", "ImgURL": "http://media-cdn.tripadvisor.com/media/ProviderThumbnails/dirs/b1/d6/b1d64bac55fa7836b064f2d4e9c195c83large.jpg"}}