{"Reviews": [{"Ratings": {"Service": "2", "Cleanliness": "2", "Overall": "2.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Chicago, Illinois", "Title": "“Getting old and run down”", "Author": "LITTLEBIRD4-13", "ReviewID": "UR125188350", "Content": "For many years I chose el Hotelel Diplomatico as my preferred lodging, because of its convenient location, great value and excellent Mexican breakfasts. When I visited it again after ten years absence, and I was very disappointed to find the hotel looking much older and unappealing due to neglect and poor maintenence. Probably, it's under new management who isn't doing a good job in recuperating the hotel's old glory. Incidentally, their breakfast is still good.", "Date": "February 25, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Toronto", "Title": "“Lots around”", "Author": "IanM01", "ReviewID": "UR124894789", "Content": "This is a place to stay if you want to experience Mexico City without being a tourist. When Mexicans travel to the city to go to the bullfights they stay here. The parking lot is filled every morning by businessmen arriving for breakfast meetings. I just got back from staying a month at El Diplomatico. The street side is noisy but the back side and annex are quiet. The higher floors get views. On the street side up high there might be a view of the snow capped mountains when the air clears. The rooms have safe deposit boxes but you have to ask for the key. The rooms have mini-fridges but check if it works before you accept a room. All the TV channels are Mexican but many have American shows with Spanish subtitles. English skills are poor throughout the hotel but sufficient at the front desk. I have experienced the rock hard mattresses but some rooms have pillow-top mattresses. I won’t tell you which is my favorite room because I want it to be available when I come back. The hotel is on one of Mexico city’s main streets, Insurgentes, and located about half way between the historical downtown and the charming neighborhoods of Coyoacan and San Angel. The Metrobus running up and down Insurgentes is clean and cheap. 20 pesos buys a reloadable pass good for a few trips. The bullring (spring and fall) and a soccer stadium are only a couple of blocks from the hotel. Next to the hotel is Parque Hundido for a stroll through a wooded park with replica pre-Columbian sculptures. On the side street just north of the hotel are a laundry and a Telcel cell phone store and couple of streets further north a Superama supermarket to get your toiletries, booze and snacks. Several blocks south is a big modern shopping centre with the Liverpool department store that has everything from socks to Smart cars. Lots of restaurants within a short walk such as 2 Japanese, 2 Chinese, 1 Danish, several Argentinean, 1 Italian, 1 American (MacDonald’s), and many Mexican ranging from street tacos to Delicias, where you get a late night show of traditional Mexican singing and dancing.", "Date": "February 20, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "3.0", "Value": "4", "Sleep Quality": "2", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Spokane, WA", "Title": "“Good and bad, fine overall”", "Author": "Dr.TMac", "ReviewID": "UR123179201", "Content": "I stayed at the Diplomatico for four days, and it was a mixed experience. I would recommend it for business travelers and tourists looking for a clean and safe, no frills hotel that is safe. Pro: Very inexpensive (less than half the price of the hotels near the Zocalo) Clean good and inexpensive breakfast buffet for $100 pesos (try the chilaquiles!) Very helpful staff (but it really helps if you speak Spanish). They were especially good about getting safe cabs to get around the city. Cons: The beds were clean but rock hard. LOUD!!! There are several clubs across the street, that play deafening music until 2-3am, and the street traffic kicks off at about 5:30 am. It would have been a nightmare for my kids, but it was bearable with earplugs. No free wifi No \"official\" access to a printer, (but a kind word and $10 pesos might convince a younger staff person to print your boarding pass for you). Also: they will send you to Delicioso (just north) which was OK, but overpriced and touristy. Go a bit further to El Huequito for cheap, good Mexican food in a bright, fun atmosphere (near the corner of Atlanta and Tintoreo)", "Date": "January 16, 2012"}, {"Ratings": {"Service": "2", "Cleanliness": "4", "Overall": "2.0", "Value": "1", "Location": "4", "Rooms": "2"}, "AuthorLocation": "", "Title": "“Bad experience”", "Author": "abiezer", "ReviewID": "UR118478186", "Content": "The worst lobby service, the keys needs to be reprogam everyday and the mattress are like stone.", "Date": "September 23, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "4.0", "Value": "5", "Service": "4"}, "AuthorLocation": "LA", "Title": "“Good hotel, way above my expectiations”", "Author": "Jenny_Travel", "ReviewID": "UR115440210", "Content": "After reading many of the reviews I still booked myself in here. I was quite surprised by the reviewers with respect to the actually reality of the hotel, the staff and the surroundings. If I go back to Mexico city I would book here again. The hotel is older but everything functions and works well. The staff were nice, helpful and attentive. My room was cleaned daily. My only complaint is there WIFI internet system has to be renewed each day at 9AM and sometimes it took the server an hour to recognize your new log in each day. This was a headache but the staff really tried to help. Again don't believe the negative reviews it was well worth the price and beyond my exceptions.", "Date": "July 17, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "4.0", "Value": "5", "Service": "4"}, "AuthorLocation": "Melbourne Australia", "Title": "“A very good hotel in the south of mexico city”", "Author": "MelbourneOztraveller", "ReviewID": "UR113442963", "Content": "Finding decent hotels in the south of Mexico City is not easy. The Diplomatico turned out to be an excellent choice on a recent conference visit. Clean, reasonably up to date publlc areas. My room was on the large side with comfortable beds and a decent bathroom. Wireless internet signal was strong. The hotel is on the busy main north-south road, Insurgentes, and there are plenty of fast buses (Metrobus stop is one block away) and taxis. Plenty of good restaurants all around the hotel location plus the pleasant Parque Hundido to walk in if you want to stretch your legs and see some trees. The location is excellent if you need to be closer to the pretty and culturally alive areas of San Angel and Coyoacan or one of the many universities in the south. But its also easy to get to the centro historico quite quickly.. .", "Date": "June 14, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "2"}, "AuthorLocation": "Washington DC", "Title": "“Daily regretted Booking will never stay here again - tried to move !!!”", "Author": "HappyWorkingMom", "ReviewID": "UR74464446", "Content": "What an unpleasant and demeaning experience! Nightmare. Arrived having booked from US, I regularly travel to Mex.City and liked location for my 4 day meetings. - Room not ready, 2 hour wait. Then unpacked : A/C completely broken and could not be turned off ! Engineer came but had to re-visit 3 times, never really worked and v. noisy. Next day I bought apples, cheese etc - but minibar in room not plugged in and again , broken!! I had to make do with buckets of ice. Reception found my difficulties so comic, they think its hilarious that their hotel doesn't deliver what it promises. My room card locked me out of my room every day and another trek down to reception to be greeted with mirth rather than apologies. Noisy and unpleasant. Not at all clean (hair in the shower on walls), yes you get 2 bottles of water, but you do in every hotel. Towels smelled bad - food v. low compared to Mexican standards (walk dwon the road and get something decent in any restaurant). I seriously considered moving to one of my regular places but was too buisy with meetings. Reception obnoxious - never got a single one of my wake up calls at the right time (on 2 of my 4 days they didnt call at all when i complained reception said it wasnt in the book - I took to going down and watching it being put into book, stil not right. - It wasnt my ordering that was wrong, I'm Mexican and speak perfect spanish). Ghastly. Please dont even think about staying ehre - I suggest Hotel Vermont (same price, great service, lovely rooms) or El Greco if you're on a budget, or Holiday Express (even better location if you can afford just $20 more a day). Oh and needless to say having asked for a quiet room I overlooked a construction site that starts up at 6.00 a.m. every day, still that was lucky given my wake-up calls never happened.... wont set foot in here again EVER.", "Date": "August 9, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "2", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Monterrey, Mexico", "Title": "“Budget hotel with great location”", "Author": "GabiG3", "ReviewID": "UR73060740", "Content": "My husband and I stayed at this hotel for ten days this month. It was a very good experience because we wanted to stay in a hotel that were located in the middle between South Mexico City (Perisur, UNAM, Ajusco) and downtown-Reforma. One of the good things that has this hotel is that local transportation is just outside the door: the metrobus stop (an express bus that goes north-south through Insurgentes Ave.) was in front of the hotel, so we could take the metrobus and be in Reforma in just 15 minutes for $5 pesos each. There are also safe taxis that serve the hotel. The location of this hotel is very safe and there are lots of restaurants very close. Also there is a very nice park one block away. The rooms are big and very clean. All the furniture are in very good condition. The bathroom looked like it was remodeled short time ago. The only drawback of the hotel is that sometimes can get noisy mostly in weekends because Insurgentes Ave. is a very busy avenue. I got a room that face Insurgentes Ave. but I guess that rooms that face the parking are much more quiet. But in general it was a good experience. I would definitely stay here again.", "Date": "July 30, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "New Mexico", "Title": "“Great Place, Unhelpful Front Desk”", "Author": "Bachguy", "ReviewID": "UR26356468", "Content": "This is a very nice hotel, and convenient/close to Plaza Mexico (bullfights) and the soccer stadium. The room that I had was spacious, clean and quiet. It was quiet because I specifically asked for a room on the hotel side away from the extremely busy front street. The hotel restaurant was pleasant and inexpensive, with very professional yet personable staff. The cleaning staff was helpful. There are many good restaurants nearby. The concierge was extremely helpful. All of the above makes the front desk receptionists a mystery; they were a real pain in the backside. They wouldn't change money, they wouldn't cash travelers' checks, and they didn't offer the help that most travelers consider routine of a front desk. I suspect that, because I was there on an Expedia flight-hotel deal (which made my room rate pretty low), the receptionists felt that I wasn't a \"real\" guest. There was no language miscommunication causing the poor service, as I speak Spanish. In sum, I would certainly stay there again, but I would not approach the front desk for help. The hotel's location (see above) was perfect for my doings in Mexico City. Recommended with the disclaimer.", "Date": "March 17, 2009"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "Puerto Rico", "Title": "“Nice overall”", "Author": "Marilyn2008", "ReviewID": "UR21661839", "Content": "I spent a week in this hotel and although I expected the worst after reading several reviews, I was happily surprised. The hotel was clean, with a nice lobby and restaurant. My room was clean and I had two bottles of water every day. I had wifi connection, blower and iron. I had breakfast every day and dinner a couple of nights and food was fine. Eating breakfast was more expensive than dining. The clerks at the counter were somewhat distant, but they took care of my petitions. The hotel is near the Parque Hundido Metrobus stop, which is very convenient to travel North and South of Avenida Insurgentes. There are a lot of stores and restaurants nearby. To me, this hotel could be rated with 3 stars.", "Date": "November 9, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Check in / front desk": "3", "Overall": "3.0", "Value": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Seattle, Washington", "Title": "“It's not that bad....”", "Author": "SeattleRedBear", "ReviewID": "UR21479155", "Content": "I stayed here for two nights to attend a seminar at UNAM. Since I was giving a presentation, the institute prepaid my room and made all the arrangements (so I can't comment on value, etc.) There were three people staffing reception when I arrived. It appears the reception desk also handled all telephone reservations and it did appear to be very busy with telephone calls. The person who checked me in was friendly and spoke a little English. Personally, I don't expect the rest of the world to speak English and with my two-dozen words of Spanish, I was able to communicate fine in my interactions with the staff. It does seem their room reservation system does have some problems as the receptionist checked me in to room 501. The bellhop picked up my bag and the key, saw the room number on the key and went back to the reception desk. There was a short conversation (I'm thinking something along the lines of \"I just took someone up to room 501, are you sure it's available?\") and then the receptionist issued me a key for room 701. During this time, there was much viewing of a complex display that appeared to a map that showed the status of every room in the hotel. The room was good-sized with two double beds, LARGE closet, desk by the window. Bathroom was good-sized with plenty of hot water. Housekeeping provided 2 bottles of water that were replaced every day. From the 7th floor there was a great view looking out over the city with the mountains in the background (when the smog finally cleared up). The hotel fronts on a very busy street and drivers love to use their horns there, so there is street noise. 7th floor was high enough that the noise was pretty minor, but if you are a light sleeper, I'd suggest asking for a room facing the back of the hotel. Bellhop showed me how the air-conditioning worked. AC unit was not noisy but it did blow directly on the beds so I turned it on when I left the room for the day and then turned it off before going to bed. Yes, the blankets are fuzzy and the sheets were not 300-count, but the bedding was clean and comfortable. The bed was firm (not hard in my opinion...I've slept on some HARD beds in budget hotels). The marble \"step\" a previous reviewer mentioned was a 1/2\" high ledge meant to keep the room from flooding in the event of a water problem. I also noticed a drain in the middle of the bathroom floor. It's not uncommon to see this in older hotels (in fact, when I travelled in eastern europe, it was standard to see these two things as the shower was typically not separate from the rest of the bathroom). The elevators are a little funky, but I've had worse elevator experiences. These elevators use a light beam/sensor to determine whether someone is entering/leaving the elevators. I noticed the bellhop using his hand to break the beam if the doors opened but no one broke the beam (ie, when the elevator arrived, and it was too full for the person to get on). An eccentricity that would cause people to think the elevator wasn't working. Breakfast in the restaurant was typical hotel, decent quality but overpriced for Mexico City. Service was OK, coffee at the table as soon as I sat down, waiter taking my order as soon as I closed the menu, food arriving fairly quickly. Once you get the waiters outside of their routine though, it was a problem. One morning, I started out sitting by myself and then had colleagues join me as breakfast went on. The last two people got coffee right away, but then after five minutes had to ask for a menu and then had to track down our waiter down to get their orders in to the kitchen. Overall, I would characterize this hotel as an older hotel (style strikes me as 1960's) that has been well maintained but not updated. Staff are typical: small problems here and there, but generally acceptable. I would definitely stay here again given my understanding that there are few hotels in this part of town. There are many restaurants in close walking distance and the MetroBus (running the length of Insurgentes) is a convenient and cheap way to get into town or to a subway station.", "Date": "November 2, 2008"}, {"Ratings": {"Service": "3", "Cleanliness": "2", "Business service (e.g., internet access)": "2", "Check in / front desk": "3", "Overall": "2.0", "Value": "3", "Rooms": "2", "Location": "4"}, "AuthorLocation": "Baltimore, Maryland", "Title": "“Not Horrible but not great either”", "Author": "lbmore", "ReviewID": "UR19383333", "Content": "I stayed here in connection with a meeting so I didn't have much choice. It's pretty cheap but you get what you pay for. My room smelled funny and had a really loud AC unit. Also the room faced the main drag on the 4th floor and was really loud. I'd definitely advise if you stay here to try and get something that doesn't face Insurgentes if you can. As another reviewer mentioned there's a loud -- really loud restaurant across the street that stays open late. But, generally the hotel was pretty clean and again, fairly cheap. Still, I think you can find much better in Mexico City. Look a little harder!", "Date": "August 26, 2008"}, {"Ratings": {"Service": "2", "Cleanliness": "4", "Business service (e.g., internet access)": "3", "Check in / front desk": "1", "Overall": "3.0", "Value": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "French Riviera", "Title": "“Convenient Hotel with Poor Staff.”", "Author": "Torero", "ReviewID": "UR10837087", "Content": "We stayed at the Diplomatico from October 26 until Nov 6th. This Hotel is located near the Bullring \"La Mexico\" and the Soccer stadium. It is right across the street from Parque Undido. There are Plenty of restaurants within walking distance along Insurgentes Sur which is the main avenue in this area. It is about 25 mns away from the Airport when traffic is normal, otherwise it could take one hour during rush hour. The restaurant located on the second floor is not too good. Only to be used if you don't have time to go out. You can order domino's pizza for delivery. We arrived on Oct 25th with a reservation confirmation from the hotel garantied by credit card. We were told there was no room available because a group had decided to overstay. There was no manager on duty to speak to. We showed we were unhappy and argued firmly. We found out other guests were in the same situation as us. The Staff offered to relocate us at another hotel at the other end of town which was not acceptable to us. We eventually found, on our own, a room at the Fiesta Inn, not too far away but at a higher rate. The next day we returned to the Hotel early in the morning to speak with management. They made us feel stupid as if it were obvious they were right and we did not understand what had happened. We eventually were given the room we had reserved and after a long argument they accepted to pay half the excess price we had spent to stay at the Fiesta Inn. They should have paid for the entire difference and the cost of getting there and back and not argue about it. In fact they should have honored our reservation in the first place. We had a Suite with two queen beds. The Suite is very spacious and the bathroom is old looking but efficient with hair dryer. Standard double rooms are of a decent size with identical fixtures. Although everything in this hotel is old looking it remains in good shape. Rooms are decently sound proof. They work with their own cab and chauffeur. It cost us 1.000 pesos to have a chauffeur take us to Teotihuacan for the afternoon with a stop at the Basilica. The suite cost about 850 pesos per night with an early reservation on the hotel web site. Considering it is often difficult to get good service in Mexico hotels when something goes wrong, I would still recommend this hotel if you need to be in this area of town. Just be prepared to fight it out and defend yourself. Local restaurants worth trying and within walking distance are \"El Buen Bife\", \"El Candelero\", \"Konditori\", and less formal across the street from the hotel are \"Papa Bill\" and \"Freedom\". There is a department store close by called LIVERPOOL as well as convenient stores\"Sandborns\", 7Eleven.", "Date": "November 15, 2007"}, {"Ratings": {"Cleanliness": "5", "Overall": "4.0", "Value": "5", "Service": "5", "Rooms": "5"}, "AuthorLocation": "Mexico City, Mexico", "Title": "“Good, comfortable, friendly staff, but...”", "Author": "Itiofele", "ReviewID": "UR4568165", "Content": "I stayed for four nights. The room was very comfortable, the staff was very friendly (bellboys, room service, the restaurant in general...), it had cable TV, minibar; I always found it clean when I returned to the room. In general, I was very satisfied. BUT... Actually the only complain I have was the air conditioner, which seems to be broken because it did not cool the room to my like. The other recommendation is that you need to keep your valuables in the safe. I even kept my laptop in reception when I was not carrying it (the hotel recommends you to do so). I am saying this because my last night I was coming back to my room and in the corridor another customer told me that some of her things had been stolen, and asked me whether the same had happen to me. I had nothing of value, so nothing was taken. So I took my precautions, but you beware.", "Date": "March 2, 2006"}, {"Ratings": {"Cleanliness": "3", "Overall": "4.0", "Value": "5", "Service": "3", "Rooms": "5"}, "AuthorLocation": "playa del carmen", "Title": "“great room for a great price”", "Author": "rosalinda22", "ReviewID": "UR4124182", "Content": "I spent one week at Hotel el Diplomatico during my first visit ( alone) to mexico city. The room was big and very comfortable, clean and had all the necessary amenities. The staff was very friendly, even though on the phone before arriving they told me they had availability, and once I arrived from the airport they didn't have rooms available. I had to look for another Hotel for that night, but came back the following day and had the room. This wasn't a good start, but I'm glad I went back because the location is excellent, the staff is nice and helpful. I was alone so this was a big issue to me. The only cmplaint I have is the maid service: at 4.00 pm often my room was not ready, and the maids were in the next room watching TV!! But overall, the price was so low that I didn't care. In the morning I want to the free gym. I would recommend this hotel.", "Date": "November 17, 2005"}, {"Ratings": {"Overall": "2.0"}, "AuthorLocation": "", "Title": "“Hotel Not Recommended...”", "Author": "A TripAdvisor Member", "ReviewID": "UR2799903", "Content": "This hotel on the outside appearance seems really nice, and along with its decent price and close proximity to the World Trade Center does really well. But it does need to update it's decor inside, along with updating the rooms so that you don't hear the person in the next room sneezing or their intimate activities. The phone in the room had a lot of static making it very difficult for people to contact me in my room instead of on my cell phone. There was no voice mail system, so callers had to either call my cell phone for voicemail or trust the front desk to slip a note under my door. The television never worked, even after calling maintenance. And the controls for the air conditioner worked only after spending a half hour pressing the buttons really hard in order to get them to work. However, the hotel staff was more than outstanding. If anything, that is what made the stay bearable. But there is no bar, no gift ship, or mini bar. I do not recommend this hotel for business travel.", "Date": "November 1, 2004"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "Palm Harbor, FL", "Title": "“good hotel in mexico”", "Author": "A TripAdvisor Member", "ReviewID": "UR2187422", "Content": "Great food, good service and well located. Hotel is very clean and the people are friendly.", "Date": "June 14, 2004"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Elmira, ON, Canada", "Title": "“Good central location”", "Author": "Shannon067", "ReviewID": "UR1537820", "Content": "This hotel is very well situated. We never had to wait more than 30 seconds for a bus or taxi, and were at our destination in good time. The rooms was comfortable and very well lit. The restaurant was not special, but there were great places nearby to breakfast.", "Date": "January 4, 2004"}, {"Ratings": {"Cleanliness": "3", "Overall": "3.0", "Value": "3", "Service": "3", "Rooms": "2"}, "AuthorLocation": "New York", "Title": "“Fine. Just fine.”", "Author": "OftenContentFlyer", "ReviewID": "UR926651", "Content": "There is nothing major wrong with this hotel, there just isn't that much that stands out. It screams for a renovation (decour is old and faded, bathroom walls are yellowing, etc.), and I almost got stuck in the lift one day because the bellman encouraged a 5th person to get on (they are rated for four). Dispite the listing here, there is is no gift shop or mini-bars in the room. There are a few resturants across the street, and a bar a half a block away that is open until 3:00am. There is, however, a night club that seems to be about five meters from the back of the hotel. It is only open on Saturday, but it is loud then and open late. The staff is very nice, the area is good and the rooms are clean. I guess if my client had me stay there again, I wouldn't make a fuss -- however, if someone was asking for the name of a hotel in Mexico City, I would not rush with recommending the Hotel El Diplomatico.", "Date": "March 30, 2003"}], "HotelInfo": {"Name": "Hotel El Diplomatico", "HotelURL": "/ShowUserReviews-g150800-d252605-Reviews-Hotel_El_Diplomatico-Mexico_City_Central_Mexico_and_Gulf_Coast.html", "Price": "$64 - $65*", "Address": "<address> <span rel=\"v:address\"> <span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">Avenida Insurgentes Sur 1105</span> | <span class=\"extended-address\">Colonia Nochebuena</span>, <span class=\"locality\"><span property=\"v:locality\">Mexico City</span> <span property=\"v:postal-code\">03720</span></span>, <span class=\"country-name\" property=\"v:country-name\">Mexico</span> </span> </span> </address>", "HotelID": "252605", "ImgURL": "http://media-cdn.tripadvisor.com/media/ProviderThumbnails/dirs/11/47/11474e7bc54f814053f99d0db41e58fc3large.jpg"}}