{"Reviews": [{"Ratings": {"Overall": "1.0", "Value": "1", "Service": "1"}, "AuthorLocation": "Springfield, Missouri", "Title": "“Telephone operator 8/27/2011 10pm”", "Author": "Cecs1", "ReviewID": "UR117336217", "Content": "Telephone operator 8/27/2011 10pm was very rude, he insulting me that I was stupid because no one answered my phone call, when he passed me to the room and it was routed back to him. I felt sick, What did I do to deserve the insult? Such services scare me, If you staff can not be professional on the phone when people call or when guests call then do away with that option. The profanity \"Your stupid,'' was used by Leisure Country Inn 3350 West Hwy 76, Branson, MO 65616 staff, thats why its included in this review, I wonder who has the audacity to hurl insults over the phone at people he does not know, while working for an establishment like a hotel?", "Date": "August 27, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "branson", "Title": "“A much needed extended stay motel and negotiable.”", "Author": "curus005", "ReviewID": "UR109116989", "Content": "A nice place to stay with all expenses paid such as: wifi tv,radio,heat,ac,hot water, small refrig, furniture, carpeting, drapes,lights like a residents atmosphere with large rooms, W/D, swimming pool and hot tub,and up dated with Spring cleanings, and initial towels and such. If you want room service, it may be extra as there are always the regular hotel rates. And then there is the extended stays, and negotiable. Sincerely, Barbara, an annual extended stay resident.5/20/11", "Date": "May 20, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Wichita, Kansas", "Title": "“Great stay!!!!!”", "Author": "skippy047", "ReviewID": "UR98472831", "Content": "We stayed for 5 nights. The staff was friendly and helped us with directions and getting show tickets. They took the hassle out of our stay in Branson. The room was clean and comfortable. My wife got extra pillows and towels. We liked the location. We will stay here again!!!", "Date": "February 28, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "1"}, "AuthorLocation": "Farmer City, Illinois", "Title": "“never again....”", "Author": "cobina54", "ReviewID": "UR87023248", "Content": "just spend 3 nights in the so called motel. had reservations for a handi-capped room. they do not even have handi-capped rooms. No coffee pot, no elevator, lighting struck it, leaky toliet, had to keep asking for towels and toliet paper, one of the rooms had mold in the bath, the only good thing, it was quiet because their were no other guest. olease by-pass this motel. sleep on the bus.", "Date": "November 14, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "3", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Michigan", "Title": "“Holiday lites of Branson”", "Author": "R_DfromMI", "ReviewID": "UR12148859", "Content": "Again , another gr8 stay at the Leisure Country INN !! The staff was again........ EXCELLENT and VERY helpful with answers !!! The HOUSEKEEPING Staff was again INCREDIBLE and our in room items REMAINED SAFE !! While there this year WE toured the City of Branson \"FESTIVAL of LIGHTS\" -- that was pretty cool !! The REAL KICKER though was the Shepard of the Hills \"TRAIL of LITES\" --WOW what a ride and what a DISPLAY !! (if your there for the Holidays DO SEE THIS !). We also had a GR8 Wireless connection !! In response to an earlier REVIEW about the shampoo ---- in all our years - there never has been any shampoo at this gr8 INN !! In fact WE always take our own when traveling because we stay at the UNbranded type places and MOST of them have NO SHAMPOO !! But the Leisure Country INN is where we have stayed for the past 15 years and we keep going back because it's AFFORDABLE ,QUIET ,CLEAN ,COZY and we feel RIGHT AT HOME THERE !! So visit CARL and his staff of plenty when in Branson ---- this motel is a place where 3 shows a day can offer a bit of peacefulness and relaxation and it's located right close to HWY 76 with easy access to and from anywhere in Branson ! And when ya go tell 'em Rick and Debbie from Michigan sent ya !!", "Date": "December 31, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Check in / front desk": "4", "Overall": "2.0", "Value": "3", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Oklahoma", "Title": "“Overpriced for what you get”", "Author": "bransonlover", "ReviewID": "UR10740975", "Content": "My husband, son, and eight month old daughter stayed here for one night in October. We paid $80/night, so I figured it would be pretty nice. (Considering most lodging in Branson is fairly cheap.) It was OK, just very basic. There was no fridge or microwave which I was really hoping for because of the babies milk. There was no shampoo; just one bar of soap for a family of four. They do have ice and vending machines on every floor which is really convenient, the couple who checked us in was extremely nice, and the motel was super quiet. I have noticed on some previous reviews where the price per night wasn't so expensive. If that is the case, and you are not looking for anything fancy, then it is a good place to stay, but in Branson there are a lot of nicer places to stay for the same amount of money.", "Date": "November 10, 2007"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Check in / front desk": "3", "Overall": "3.0", "Value": "4", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Tulsa, OK", "Title": "“Basic Motel for a Basic Price”", "Author": "OKFishMom", "ReviewID": "UR7726770", "Content": "We stayed at the Leisure Country Inn over Memorial Weekend holiday. Because we waited until the last minute to go, the major chains were booked. We also decided we wanted to save money on the room, and spend it on shopping and entertainment. Stayed 2 nights, cost was about $135 with tax. Rooms were clean, but dated in decor. No shampoo, etc available. But there was a bar of soap. Good water pressure in shower, but I did see a spider on the bathroom floor. Beds were comfortable. The hot tub I wouldn't use because it was the free standing type you would have in your back yard, with a removable cover. The weather was too cool to use the pool. Breakfast was just ok, basic cereal and donuts, biscuits and gravy. No tea bags or hot water. Breakfast was only served for one hour, from 8-9, so less than convenient. The location is good, and walking to the top of the hill and along the strip was really easy, and not an issue. I have stayed at another local motel, and it had a much steeper incline. Basically, you get what you pay for. I noticed other Inns that had vacancies that I would try the next time...I don't plan to return to Leisure Country Inn.", "Date": "May 31, 2007"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "Southeast Missouri", "Title": "“Nice Clean Rooms”", "Author": "Gods_Child74", "ReviewID": "UR7543129", "Content": "When we took our Girl Scout troop to see \"The Number One Hits of the Sixties\" (which I would also recommend) we stayed in this hotel. It was very clean and the service was good. It did not have anything \"flashy\", but we didn't need anything flashy. We wanted a clean, comfortable room and that is what we got. It is a good value for the money.", "Date": "May 3, 2007"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "Unknown", "Title": "“Leisure Country Inn is great!”", "Author": "A TripAdvisor Member", "ReviewID": "UR5184495", "Content": "I thought the Leisure Country Inn was an excellent hotel. It was the best we've had during our five stays in Branson so far. There was a very helpful woman (Joan) that ordered tickets for all of our shows. They were ready at the desk when we checked in. We’ll definitely stay there again. One of our shows (Yakov Smirnoff) was rescheduled from Sunday afternoon to Tuesday morning because he was receiving a Masters Degree from the University of Pennsylvania. That turned out to be a blessing in disguise. My mom and her friends LOVE their Milwaukee Brewers. After the rescheduling of our show, Joan called several sports bars and finally found one that could get the Brewers game. We spent Sunday afternoon there and had a great time. In response to the person who objected to the hills around the hotel, I have to say that Branson is in the Ozark Mountains and hills are a part of the deal there. The only things that I've seen there that have level walking are the insides of buildings. If you are physically challenged by slopes or hills, you need to take a tour bus or drive from place to place and have somebody drop you off at the door if you are unable to negotiate the steep grades in the parking lots.", "Date": "May 20, 2006"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "Andover, KS", "Title": "“Best Deal in Branson”", "Author": "Herk", "ReviewID": "UR4406120", "Content": "This is the best deal in Branson. I've stayed in many different hotels in Branson and this is the best deal I have found. It's like staying in an expensive Marriott hotel only for a much lower price. The rooms are large and beautifully decorated and the price includes an outstanding complimentary breakfast. It is located close to the strip for easy access to numerous shows and restaurants. It has a very \"class act\" atmosphere and I have recommended it to all of my friends. The hotel's new owners are dedicated to providing exceptional service for their customers. Anyone that rates this hotel below average is simply not being truthful. Everyone I know that has stayed there says it is and outstanding value. I agree.", "Date": "February 1, 2006"}, {"Ratings": {"Overall": "3.0"}, "AuthorLocation": "Unknown", "Title": "“response to sad situation reviewer”", "Author": "A TripAdvisor Member", "ReviewID": "UR1663623", "Content": "My wife and I stayed at Leisure Country Inn in April of 2002. It was in our opinion an aveage place to stay. We chose this hotel mainly because after researching several hotel packages we chose this one because of the value. The staff was friendly and was most helpful in getting all the right tickets. Yes, the hotel is located on a steep hill, but so are many others. Also some entertainment places are located on hills. I guess if don't like hills or can't walk on them, then Branson isn't for you.", "Date": "February 21, 2004"}, {"Ratings": {"Overall": "1.0"}, "AuthorLocation": "Unknown", "Title": "“Sad Situation”", "Author": "A TripAdvisor Member", "ReviewID": "UR1260312", "Content": "We stayed at Leisure Country Inn approximately 2 years ago. We were told on the phone that the hotel was just a few hundred feet away from several shows, within walking distance. They did NOT tell us the hotel was at the bottom of a very steep hill even though I told them up front I had physical problems and was disabled. We found it was not within walking distance, basically because of the very steep hill one had to climb to get to the main street. Also while there, we were interrupted in our room when the door suddenly opened and a clerk from the hotel was showing rooms, our room, which was occupied. We complained but they offered no explanation or discounts for the intrusion of our privacy or the fact they failed to reveal the fact the hotel was at the bottom of a very steep hill.", "Date": "August 25, 2003"}], "HotelInfo": {"Name": "Leisure Country Inn", "HotelURL": "/ShowUserReviews-g44160-d253333-Reviews-Leisure_Country_Inn-Branson_Missouri.html", "Price": "0", "Address": "<address><span rel=\"v:address\"><span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">3350 West Hwy 76</span>, <span class=\"locality\"><span property=\"v:municipality\">Branson</span>, <span property=\"v:region\">MO</span> <span property=\"v:postal-code\">65616</span></span> </span></span></address>", "HotelID": "253333", "ImgURL": "http://media-cdn.tripadvisor.com/media/photo-o/01/bd/ff/85/leisure-country-inn-thumbnail.jpg"}}