{"Reviews": [{"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "3", "Location": "2"}, "AuthorLocation": "Brownsburg, Indiana", "Title": "“Nice Hotel”", "Author": "Rand R", "ReviewID": "UR127076622", "Content": "My wife and I stayed here one night before going on a cruise. We arrived at 3:00PM; which was listed as check in time. Another couple arrived at the same time. The manager went up to check the rooms for readiness. In the mean time the clerk issued us keys for a room. Upon arrival, the room was not ready, but the manager waived us down the hall to another room and told us that he would bring new key cards up in a few minutes. Before he got back, the other couple used their keys to let themselves into our room. They went back down to find out what was going on, we never saw them again. The room was clean, moderately sized and well equipped. The staff friendly and attempted to be helpful, but a broken printer at checkout and lack of communication with the cleaning staff made things more difficult than necessary. It was a $15+ (cash) each way taxi ride to everywhere we wanted to go to in the city. There was no good way to walk to any attractions or the beach. The taxi rides got to be more expensive and used more cash than we had anticipated. The Bistro 66 attached to the hotel served a very good breakfast and had excellent service.", "Date": "April 1, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Tampa, Florida, United States", "Title": "“A great European Style Hotel”", "Author": "Jim G", "ReviewID": "UR126584046", "Content": "My wife and I stayed here while she was competing in the 70.3 Ironman San Juan. This is a European style hotel, right down to the bistro off the lobby (which by the way serves excellent food). The staff was more than helpful when it came to storing the wife's bike, providing information and ... just being friendly. Our room was clean and comfortable (it was next to the ice machine, but after a day it was not an issue). If you are looking for a Marriott type hotel, don't go here, but if you want a neighborhood locale and a boutique style experience where the staff recognizes you when you come \"home\", this is it. Grocery store down the block, a Condado Lagoon beach just down the block (no pool) and local restaurants nearby.", "Date": "March 24, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Pittsburgh, Pennsylvania", "Title": "“Trip with my college friends”", "Author": "Rebecca W", "ReviewID": "UR126210385", "Content": "My friends and I went here for our spring break last week and we had an amazing time. We were on a budget, so we didn't expect much from this place- and were pleasantly surprised. We spent a lot of time on their roof deck (eating various meals- or in between activities). The staff is all very helpful and kind- and gave us really great recommendations for places to eat, or go out at night. It isn't a luxurious resort but it is clean, well kept, and really close to everything we wanted to do. It only costs $16 plus $1 per bag to get a taxi to the airport. The only problem we had was that the hot water ran out fairly quickly- but since it was hot anyways none of us found this to be a really big issue. I would really recommend this place- I think that you get a ton of value for what you pay.", "Date": "March 16, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Sleep Quality": "2", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Gilbert, Arizona", "Title": "“Hummmm...It's OK, if you're not expecting luxury.”", "Author": "joloughlin", "ReviewID": "UR126115771", "Content": "After our cruise we opted for a 1-day lay-over to see Old Town San Juan. From Hotel Miramar, 10 minutes by city bus (50 cents per/person 1-way), will get you to Old Town SJ. --Hotel Miramar is an old hotel. My main objection was with the bathroom; it did not have an exhaust fan. Thus, mold / mildew was built up on the ceiling over the shower. The proprietor tried to paint over it, but you can't get rid of mold with paint. We tried opening the bathroom window to vent the shower steam, but the outside air was just as humid as the inside. Also, the bed sheets were scratchy, cigarette burns in the bedspread, and the pillows were hard as a sack of potatoes. With that said -- if you stay here just know that you are not staying at a plush hotel...it's just a place to spend the night. The hotel was mostly clean, conveniently located with several restaurants within walking distance, and it was quiet; no street noise. The manager was very helpful, friendly, and accommodating. We dropped our bags off at 9am, returned at 2pm and our bags were waiting for us in the room. I had difficulty rating this hotel -- if you just need a convenient place to sleep...you'll like it. If you are accustomed to luxury...you may want to keep looking. ---- p.s., I have photos, but they are no different than the ones already posted. I have a pic of the mold if you want to see that.", "Date": "March 14, 2012"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Location": "1", "Rooms": "1"}, "AuthorLocation": "", "Title": "“Horrible, Unprofessional & Delinquents!”", "Author": "Locg22", "ReviewID": "UR125875132", "Content": "I rented two rooms in advance! During my stay at the valet parking the attendant crashed my car causing damaged to it! I reported the incident! I ended up receiving on partial payment for the damaged after a year and half of the date of the incident! After numerous calls finally the owner, Mr. Sanchez responded in an unprofessional and unethical manner. I wouldn't recommend anyone to stay here, EVER! Mr. Sanchez as well as his staff are the equivalent of functional DELINQUENTS!", "Date": "March 10, 2012"}, {"Ratings": {"Overall": "1.0", "Service": "1"}, "AuthorLocation": "Redmond Oregon", "Title": "“DO NOT STAY HERE!! THEY ARE CROOKS!!”", "Author": "chevygal99", "ReviewID": "UR125836407", "Content": "Well, after reading the review that was last posted, I feel exactly how that other person feels. I too had a reservation for Feb 25, but due to airline delays, I was unable my connection to San Juan. I called this hotel to let them know I will not be arriving, and was told it was non refundable. I had called and emailed many, many times asking for a confirmation. I never once received an email and was never told what the cancellation policy was. After being told that my nights room was non refundable, I told them that I will be needing a room the following Sunday after our cruise and asked if they could use those funds. I was told that I would need to speak to a manager. I never heard back. I called and emailed several times and never got a response other than it is non refundable. They were very rude about it and not willing to take responibility for not informing me of their cancellation policy or emailing me the requested information that I asked for several times. I did not book my reservation on their website, I called the hotel direct. I would have thought they would have told me the policy regardless of how I booked. I work for a major airline and interact with thousands of people a week who are travelling. I have a travel blog and many people are referred to me because of my extensive travel background. I go on cruises every 3 months and make a lot of recommendations. I WILL NEVER RECOMMEND THIS HOTEL TO ANYONE. I advised them of this and they said 'they could care less.' Bad customer service travels faster than good and apparently they don't realize this. But, after reading the previous review, they are rolling in the money and turning people away. I dont understand how this hotel is staying in business. I have also filed a complaint with the Better Business Bureau. This is absolutely unacceptable. By the way, I ended up paing 3 times the amount to stay at another hotel the following Sunday. I didn't care how much it cost, as long as the Hotel Miramar doesn't get another dime of my money. I will make sure to let everyone know, and I am sure they wont care either.", "Date": "March 9, 2012"}, {"Ratings": {"Overall": "1.0", "Service": "1"}, "AuthorLocation": "Syracuse, New York", "Title": "“NEVER AGAIN”", "Author": "JJLMT", "ReviewID": "UR125659676", "Content": "We booked to stay at the Miramar for February 25, 2012, in April of 2011, for a 1 night stay before our cruise. We had 4 rooms booked for our family. When we arrived at the hotel we were greeted outside by a baggage boy holding envelopes (5 to be exact) and 1 with our name on it. He told us \"sorry, but we are booked full and you will have to stay at our sister hotel around the corner\". When I told him that was unacceptable and I wanted to speak to the manager he told me \"the manager is gone for the day and won't be available until 7am tomorrow morning.\" I went into the lobby and went to the desk to voice my discontent. How can a hotel overbook when our rooms were booked almost a year ago, and if they overbooked the rooms 10 months ago, why weren't we notified so we could have made alternative arrangements? After 10 minutes of insisting I wasn't going anywhere until I spoke to someone in management, low and behold, they hotel manager appeared. Her name was Lourdes. We attempted to show her our confirmation papers on our rooms and explained we did NOT want to stay at the shabby looking hotel around the corner. She told us to bad, but the rooms were all booked and we could not stay there. When we tried to reason with her that we booked 10 months in advance, she just smirked and said \"oh well, contact Expedia and let them help you.\" She was rude to say the least, and not one bit willing to listen to us, or even look at the reservation papers I had. We paid in advance when we booked so our rooms were already paid for back in April of 2011. When we asked her if the supposed sister hotel she was pawning us off on was comparable with the Miramar she would not answer us. They never offered to show us the room in advance so we could determine if we wanted to stay there. With 9 family members standing outside in the street with luggage, we were forced to walk down the street and up a hill, carrying our own luggage of course to this \"sister\" hotel. My elderly mother who has trouble walking was with us, and after traveling the entire day from NY I wasn’t about to search the phone book for hotels in San Juan, and pay yet again for 4 rooms. We walked to the Olympus Hotel around the corner. It wasn't the slightest comparable to the Miramar. It was a hotel straight out of the 1960's. The rooms were nothing like the rooms we booked at the Miramar. Also upon looking at the price guide on the back of the room door, they were also a lot cheaper. The only compensation Lourdes was willing to offer was a continental breakfast (which by the way should have come with our room anyway had we been guests at the Miramar). The Olympus (sister hotel) had NO amenities at all to offer. The hallways and the rooms had a VERY strong smell of bleach, which right off the bat made me wonder what might be crawling around the rooms, or the bed. Needless to say this has been the worst customer service I have ever received. I would never recommend this hotel to anyone based on the scam they are running. I say scam because I believe that is exactly what they are doing. Overbooking the hotel rooms at the Miramar, taking the people who may have paid a higher price on the rooms, allowing them to stay, and then shifting the people who didn't pay as much to the \"sister\" hotel around the corner where the prices are cheaper. Meanwhile, the Miramar has been paid up front for the room and is making money by throwing you a lower priced hotel, and throwing business to the Olympus. The staff was at least friendly to us at the Olympus. The staff at the Miramar seemed to be scared of Lourdes and not willing to answer questions when she was around. Shame on you Miramar for making our stay in San Juan such an unpleasant experience. If this is the way that you treat customers, it’s a wonder anyone wants to stay at your hotel at all. I will make sure all of the cruise boards I am on know about this so this experience doesn’t happen to them. My pre cruise stay in Puerto Rico was less than pleasant thanks to the Miramar. John, Syracuse NY", "Date": "March 5, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Atlanta, Georgia", "Title": "“Decent hotel with courteous staff”", "Author": "BhaviniA", "ReviewID": "UR125658020", "Content": "We stayed at Hotel Miramar for 3 nights. The staff is courteous and very helpful, they gave us good recommendations on local joints to eat, tours to take and where to find convenient and cheap parking in Old San Juan. The rooms could use a little updating but they are clean and adequate. We had a king size bed, microwave, fridge, hair dryer(much needed :) ) and iron. The neighborhood seemed safe with pharmacy, grocery and restaurants within a block and 10 mins drive to Old San Juan. The hotel is on a one way street for cars so we had to go around few blocks to get to it, got a little tricky the first couple of times but it shouldn't be a problem if you don't have a car. They offer free parking which was a plus.", "Date": "March 5, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "New York, New York, United States", "Title": "“Nice comfortable hotel”", "Author": "SMP272", "ReviewID": "UR125527505", "Content": "We recently stayed at Hotel Miramar for 1 night after a cruise. I have to say that many of the reviews I read about the hotel after booking it on Hotwire were spot on from the rooms to the water issues. This hotel is conveniently located in an area of the city that has numerous eating establishments so we really had no problem finding anything to eat. The room was clean and comfortable and we had free wifi (which is always a plus). When we arrived the room we had reserved was not ready, but we were quickly given another ready room by the manager. He also remembered my name the next day, which is a plus - I felt at home. Also, I called ahead to the hotel to find out about the cost of a taxi ride to the hotel and a new staff person was able to give me info and direction about going to the taxi stand at the airport and they would give me a price for the ride before I got in the taxi. The only things I had issue with were the earlier morning knocks on the door by housekeeping, which I couldn't understand since checkout wasn't until 12pm. Also, it was quiet at night but the room door does not block out a lot of noise so I heard the housekeeping staff in the hallway in the morning. Also each room has its own water heater for the hot water. So we ran out of hot water after some time. I would definitely stay at this hotel again when I go to SanJuan.", "Date": "March 2, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "4", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Minneapolis, Minnesota, United States", "Title": "“Great small hotel”", "Author": "Pat T", "ReviewID": "UR124982600", "Content": "I had written this when we were there but isn't showing up. We stayed at the Hotel Miramar for two days before a cruise and one after. We would stay there again in a heartbeat. The hotel is small, old fashioned but in all the right ways. Spotlessly clean with incredible staff. Noelia, Silvia, Jill all did their very best to help us. Sent us to great local spots, including the Castilla Miramar, an incredible restaurant. The hotel is in a very convenient neighborhood, with a pharmacy, grocery, organic deli and movie theater within a block. And it is on a major bus line, so for fifty cents we could go wherever we wanted. The staff gave us great directions, recommendations and service. I have seldom seen a staff as helpful and friendly in my years of travel.", "Date": "February 21, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "New York City, New York", "Title": "“Manager Ms.Silvia personally take care”", "Author": "Salim M", "ReviewID": "UR124810383", "Content": "I have been staying at this property for last one year pleasant, clean and friendly. I alway recommend all my friends, family and business travellers to stay since I get the best hospitally and it's also centrally located. I have to personally thanks Ms.Silvia Manager of the property she is an excellent person and most helpful all manner. I alway call her for my booking and she take care of it seamlessly. And it's wonderful to know person who knows you in person which it homely.", "Date": "February 19, 2012"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Overall": "2.0", "Value": "2", "Sleep Quality": "3", "Rooms": "2", "Location": "4"}, "AuthorLocation": "San Juan, Puerto Rico", "Title": "“Not the best value”", "Author": "eriu31", "ReviewID": "UR124804813", "Content": "First off, you will be landing in a shady looking neighborhood. There is no obvious way to reach the hotel unless you drive against traffic or use the bus lane. I booked a king bed room through hotels.com. When I arrived, two hours after check-in time, it was not ready. I sat around in the lobby for a bit. When I got it, I was surprised to find I got a two full beds room. I called front desk about it, to no avail. Since I had booked online, I had no claim. The girl at the front desk asked me to bring a copy of my reservation so she could read it to me. Surely enough, this was an additional humilliation I did not want, so I sucked it up and asked for nothing else. If you are staying here, know there is no parking for your car, no hot water in your faucet, no coffemaker; and although there is a microwave and a small fridge you will not find mugs, plates or even a spoon, so bring your own. There are a lot of nice places to eat within walking distance. Be careful if walking around late, there is quite a few unoccupied buildings around the block.", "Date": "February 19, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Montreal, Canada", "Title": "“Good deal, easy access to Old San Juan”", "Author": "Brasstess", "ReviewID": "UR124484273", "Content": "The neighbourhood might not be to everyone's liking, but this is the place to stay. Very clean, very quiet and extraordinary people to welcome you. The hotel has a 'bistro', but you will also find restaurants nearby. Our room had a small fridge and microwave and there is a grocery store within walking distance. The bus stops in front of the hotel and for 50 cents it will get you the Old San Juan terminal where you can catch the free trolley. We stayed for 2 nights before cruising", "Date": "February 12, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Lawrenceville, Georgia", "Title": "“Friendly Staff and Great Location”", "Author": "JPWONG", "ReviewID": "UR124297628", "Content": "I have stayed in this hotel countless times in the past for business reasons, and it has never occured to me that I should properly write a review about my experience. I guess because most of my previous visits only spent a night or so at the hotel. Anyway, this time around, I did stay for 3 nights, so... The staffs are very friendly and accommodating. Since I do not personally speak Spanish, they are willing to teach me a few words for me to get by. Great location, about 10 to 15 minutes away from Old San Juan. The bus stop is just a block away. A few restaurants and a supermarket (if you need grocery for an extended stay) are just up the block. The room is clean and roomy with microwave and refrigerator. I especially love the rooftop terrace. It offers a great view of the city and plenty of fresh air. The only concern seems to be the water in the shower. A few times, the water did not come out hot enough, well...it was not exactly cold, but I guess given the warm weather in PR, it shouldn't be much a problem. A great value for the overall experience and will stay again.", "Date": "February 8, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Tampa, FL", "Title": "“Good Value for San Juan”", "Author": "RustyCarpenter", "ReviewID": "UR124257326", "Content": "We found this hotel on Trip Advisor, read the previous reviews, and then booked it. It was an excellent choice. It is about a 10-minute bus or taxi ride to old San Juan and is in a nice business and residential mix neighborhood. The staff was very friendly and there is a restaurant attached to the hotel, and several others in the neighborhood. There also is a movie complex just up the block with first run films. Our room was large and very comfortable. Our only concern was a certain mustiness upon entering the room. We suspected the air conditioner filter needed to be changed. A couple of other guests that we talked to also noticed the odor. Overall, a very good value.", "Date": "February 7, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "3", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Minneapolis, Minnesota", "Title": "“Great location, value and service!”", "Author": "SEGMN", "ReviewID": "UR124210237", "Content": "I stayed here for one night after spending over a week on the East side of the island. I scored a great deal on hotwire and just needed a clean place to sleep. The hotel is a boutique-style hotel in Miramar, a residential area, which is about a 10 minute walk to Condado area. Hotel Miramar was absolutely perfect for what I needed! The public bus stop was right across the street and for .50, I took the M3 bus to Old San Juan where I spent the entire day walking and exploring. The front desk staff was friendly and very helpful with questions about Old San Juan, nearby dining, taxis, safety, etc.. The hotel is SO charming, there is a little sitting area on the lobby floor but away from the lobby area with computers for guests' use. There is a fitness center, laundry facilities and a very nice rooftop terrace offering sweeping views of the city. The rooms were very spacious and incredibly clean. This was the perfect simple accommodation for one night. My only complaints were that the water in my shower never got hot, only lukewarm and the bed was a little hard for me. Nevertheless, I would stay here again.", "Date": "February 6, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Sleep Quality": "4", "Rooms": "4", "Location": "3"}, "AuthorLocation": "minnesota", "Title": "“Interesting!”", "Author": "believer4ever", "ReviewID": "UR123572566", "Content": "Others have told you many things, so I won't go into those repeated things. When you pull up to the hotle, you may think you have made a mistake... it looks like an unsafe neighborhood. I do not know if that is true or not, but we had no problems. The hotel room ws clean, the bed comfortable, and the bathroom was like visiting an aunt's house... green tile, pedistal sink, and bath tub with shower. Two windows in our room, and a king size bed. Nice air conditioning, and an elevator. The roof top deck was g-r-e-a-t!! The night time views were spectacular. We were there during the St. Sabastian festival, so it was crowded. I was not impressed with the knowledge of the staff... they told us that we could take a bus to Old San Juan. We waited, and finally a taxi took us there for a very nominal fee. When it was time to return to the hotel, the buses were not running where they had told us. The streets were so crowded that no taxi could get through. We had to walk the 2.5 miles back to the hotel. The directions we were given to find our way back were \" keep the water to your right arm, and you will find us\". We did find our way back, but it was late, and we had some giant blisters on our feet that took all week to heal. The streets are narrow, and bumpy, and sidewalks are nonexistent.... or the cars are parked on them... and the people walk along side the curb. The traffic was backed up so far the next morning, that we had to go to the corner and wait to flag a taxi... the hotel could not call one because the taxi could not get into the one way street. The small bistro next door is nice. Their coffee is good, but americans beware.... there is no bottomless cups in San Juan!! All in all, the hotel is nice, clean, and will do.... but it was expensive for what we got, and it's location. A suggestion to the management.... have more than one employee at the front desk in the morning... that poor girl was s-w-a-m-p-e-d!!! and, we all had to wait in a crowded lobby.", "Date": "January 24, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "brockport,ny", "Title": "“great place to start or end a cruise”", "Author": "thalpin", "ReviewID": "UR123569907", "Content": "very clean, good value,very helpful staff,take the bus to Old San Juan!!!50cents!be sure to take a day to visit the rainforest!!Carlos is a great guide!!TEHALPIN", "Date": "January 24, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Corona, CA", "Title": "“Nice, large room”", "Author": "annie8848", "ReviewID": "UR123547954", "Content": "Nice, large room, a little dated in design but not bad.Clean. Fridge, microwave.Bed was a little firm for me. Located down the street in walking distance from restaurants and supermarket. We ate at Lima restaurant, very good though slow service. Stayed one night before cruise and it was quite acceptable. 16. dollar taxi ride from the airport.Can catch a bus across the street -.50 cents per person-and ride to bus terminal to old town San Juan. Then take free shuttle that goes around all of old town--get off and on at many points. We had ocean view from our room #401 and close to cruise terminal. I think it was a 6 dollar taxi to cruise ship. Xmas through Jan 14th there is the Festival of San Sebastian--streets close in the afternoon and shuttles stop running. not far to walk though back to bus terminal.", "Date": "January 24, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "West Sayville, New York", "Title": "“A Perfect Stop”", "Author": "Roseanne A", "ReviewID": "UR123293363", "Content": "We were visiting a friend on the west side of the island and needed a quiet place just outside San Juan for one night, as it was a festival day. We selected the Hotel Miramar from the tourist map without any other knowledge of the place and were delighted to find a clean, updated, fresh facility with a delightfully helpful concierge, Sylivia, who did everything in her power to make our stay pleasant. I recommend it highly.", "Date": "January 19, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Perrysburg, Ohio, United States", "Title": "“\"Family Fun\"”", "Author": "Susan B", "ReviewID": "UR122557668", "Content": "We had a fabulous time in San Juan and stayed at the Hotel Miramar. It was very close to the airport. Bus stop near hotel took us into Old San Juan and staff was very helpful in giving us ideas for daytrips and good local restaurants (some within walking distance) The hotel was very fresh, clean & updated with some spanish antiques and flair. We thought the rooms were very spacious and our toddler was very comfortable. We thought this hotel had the best rates in town!!! Cute restaurant downstairs served us a quick breakfast in the morning and had a pleasant aura. We were a little dissapointment with the extremely laid back almost absent waiter during breakfast but we figured he was probably tired from working a night shift up the street. Had a great time & would recommend to friends and family !!!", "Date": "January 5, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "3.0", "Value": "4", "Sleep Quality": "3", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Leiden", "Title": "“Small hotel with friendly staff in quite area.”", "Author": "iccc", "ReviewID": "UR122460867", "Content": "This hotel is conveniently located at the edge of a residential area, near a shopping street and in walking distance from the convention centre. The rooms are quite, have free internet access. The hotel staff is very friendly. Breakfast is served in a small room, a la carte; it is cheap and of reasonable quality.", "Date": "January 3, 2012"}, {"Ratings": {"Service": "1", "Cleanliness": "3", "Overall": "2.0", "Value": "1", "Sleep Quality": "2", "Rooms": "1", "Location": "1"}, "AuthorLocation": "Ontario ,Canada", "Title": "“Poor Customer Service”", "Author": "TTbarrie", "ReviewID": "UR122118459", "Content": "Not only is this Hotel in a sketchy neighborhood but their attitude is terrible. After I booked an ocean view ( overtop of some rundown buildings ) room that the manger said had a pullout couch I was told that my young daughter couldn't sleep on it. I was forced late at night to rent a 2nd room ! Just to make things ridiculous the clerk told me he just spoke to the MGR and the MGR wanted to make sure that we wouldn't have 5 people in the room !!! This after we just paid for a 2nd room !!! can you imagine leaving the 2nd room empty after just paying a stupid last minute rate for it. Had he been up front I could have booked 2 cheaper rooms instead of the room with the pullout couch ( chair) When leaving it took us half an hour to get the 1 slow elevator they have and then after waiting with 20 other people in their small lobby to check out we ended up just leaving. Book anywhere else in SAN JUAN", "Date": "December 26, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Ontario, Canada", "Title": "“Delightful Hotel”", "Author": "KarinaLB", "ReviewID": "UR121716184", "Content": "We recently stayed 3 nights at the Miramar Hotel. We had no clue whether it would be good or not but we really enjoyed staying there. The staff were wonderful, very friendly and helpful. The room was good. It's an older building but has been updated. I would recommend this hotel as the place to stay in San Juan. Wonderful view of the ocean and lagoon from our room. Breakfast at the hotel was great. Service wonderful. I would stay at this hotel again.", "Date": "December 13, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Wexford, Ireland", "Title": "“nice stay”", "Author": "roamingirishman", "ReviewID": "UR121166825", "Content": "my wife and i stayed here recently pre cruise and found everything just fine.very efficient staff at check in and out.lovely clean marbled floor bedroom no complaints.had a few reasonably priced drinks at the bar on site.friendly local people made chat with us which we enjoyed.breakfast next morning was very fresh and tasty and reasonably priced.the only complaint i have about san juan is that the taxis are a complete rip off which i think should be regulated a bit better,but other than that everything was good and i would definetely stay here again.", "Date": "November 28, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "3.0", "Value": "4", "Sleep Quality": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Middletown, New York", "Title": "“Great Pre Cruise Location for budget minded”", "Author": "Lazier", "ReviewID": "UR120901996", "Content": "We were looking for a hotel for a day in San Juan prior to a cruise. Most were sold out that had reasonable locations to the cruise terminal. We also like to check out small boutique hotels when visiting locations. After some searching we found Hotel Miramar. We made a reservation for a room called \"run of the house\" for $99. This means you get what is available when you arrive. We were lucky enough to get a room with a king size bed, close to elevator, and the room was clean. Upon our arrival which was a short $25 cab ride from the airport we met \"Sylvia\" who was extremely busy and pretty much overloaded, but she took care of us immediately even though we arrived before check in time. Sylvia as well as the rest of the staff we met were very pleasant and helpful. The great parts of the hotel are its convenient location with a drug store, super market, and cafe within steps of the hotel. Want to go to Old San Juan ? Jump on the bus just outside the hotel. Cost 50 cents VS $20 cab ride. Clean and safe. There is a laundry in the hotel which we used so we had all clean clothes when we got to the ship. The roof top is pretty cool with a view of San Juan. Down side of the hotel is that it is dated, there was a slight odor in the room but I think it was just something they clean with. Again, bathrooms and room were clean and no sign of bugs ! big thing with my wife. Lastly there is a small cafe next to the hotel. We had lunch there and it was excellent !! awesome soup, great local beer, nice wine !", "Date": "November 22, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Location": "3", "Rooms": "4"}, "AuthorLocation": "", "Title": "“Good value, clean room, typical Puerto Rico service.”", "Author": "peterjontheroadagain", "ReviewID": "UR120554378", "Content": "Parking is a chore and not a great place to walk but is an easy bus or taxi ride to old town. Would stay again for a night or two (why would anyone want to spend more than two nights in PR anyway?). Did not try Bistro. Too bad the sun deck closes at 11.", "Date": "November 13, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Carrollton, Texas", "Title": "“adequate”", "Author": "farish2", "ReviewID": "UR120420545", "Content": "We picked Hotel Miramar for the reasonable price and location - close to Old San Juan. It is an old property that has been partially updated. It was adequate in that we planned to spend most of our time away from our hotel rooms on excursions out of San Juan, and it was easy to catch the city bus for cheap transportation to sightsee in Old San Juan. The hotel is located in an older business section of San Juan. There are a few decent restaurants (Casita Miramar) close by and some fast food (Papa John's, Subway). As there are no coffee makers in the room, and the coffee from the small bar/restaurant in the hotel is $2.00/cup (no refills) and they don't want you to take it up to your room, Subway has the best coffee at a good price ($1.25). Sylvia, the manager, was very helpful! She responds promptly to emails and phone calls and offered prompt assistance with problems or questions.", "Date": "November 10, 2011"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Overall": "2.0", "Value": "2", "Sleep Quality": "3", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Norcross, Georgia", "Title": "“just NO”", "Author": "singjoy", "ReviewID": "UR120020789", "Content": "If all the travel web sites said breakfast is included why isn’t it when you ask for???? The manager said that complimentary or courtesy breakfast ended in January 2011. This was why I picked this particular hotel…. You can say no wireless internet because it was down all 4 day we stayed there. Travelocity and Orbitz both said Complimentary continental breakfast and free wireless internet just check it out for yourself before you go.", "Date": "November 1, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "2", "Overall": "3.0", "Value": "3", "Sleep Quality": "2", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Decatur, Illinois", "Title": "“High hopes......let down”", "Author": "sunray712", "ReviewID": "UR118967133", "Content": "visited Sept. 23 before a cruise booked to return for a couple of days after cruise. After staying one night, I cancelled before the ship left Puerto Rico. Our AC was not working well, desk person came up and AC got cooler. Small ants were in the bathroom and crawling on nightstand. I was bitten by one. No hot water from basin, just a very loud noise(Rm 301). The comforter fell off on the floor during the night exposing a nice size dirt smear on the sheet. Sheets and pillowcases were dingy. The bathroom was very nice. We visited several floors and sweated badly because the hallways were so hot. Received a call about 9AM from front desk telling us to close an open window because it was raining. No windows in our room were opened. A couple of nice stores down the street and a small restaurant but I would not return here. Nice view of the city on roof top. Free breakfast but very small bistro had about 3-4 tables to accomendate guest. I didn't even go down.", "Date": "October 5, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Rochester Hills, Michigan", "Title": "“One night at Miramar”", "Author": "Sarah L", "ReviewID": "UR118341274", "Content": "We had a good experience at Hotel Miramar. We stayed for only one night before we departed for our cruise. Check in was no problem, and the women working the front desk was very friendly and helpful giving us tips on nearby dining, and getting us down to Old San Juan. She recommended a VERY nice resturaunt that is a 2 minute walk, it had a castle theme/name (sorry can't remeber exactly) but it is the only one nearby. We had a wonderful dinner there, I highly recommend it$15-$22 per plate, but well worth it. There is a bus stop right outside the hotel that goes to Old San Juan ( a 5 min ride) for only 75 cents. There is some local shopping, and a grocery store as mentioned in other reviews right down the road in walking distance. The rooms were nice, clean, beds were fine. Bathrooms were nice with the tile work, my only complaint was that our shower drained slowly so my feet were in an inch of water when I was done. There is a roof top area that has a beautiful view of the city and water with lounge chairs and a table. It was very nice. On check out day we went to Old San Juan and we were able to leave our luggage at the hotel. I was concerned because of a review I read on here, but we had no issues at all with this, and I appreciate being able to do this so I could go see Old SJ...which you should do too, it's beautiful! Especially the forts which is only $3 per person to walk through. Amazing. Anyway, overall I felt like I certainly got my moneys worth, and I think Miramar is a lovely place with nice rooms and very helpful staff. If I ever make my way to Puerto Rico again, I would certainly stay there.", "Date": "September 19, 2011"}, {"Ratings": {"Cleanliness": "3", "Sleep Quality": "4", "Overall": "3.0", "Value": "2", "Service": "3"}, "AuthorLocation": "Atlanta, Georgia", "Title": "“Hotel was okay for our four day stay”", "Author": "deeA2011", "ReviewID": "UR117833247", "Content": "On the outside the hotel looks small. We got a double room which was spacious with a beautifully tiled bathroom. A refrigerator was a good accomodation because we were able to go to the Pueblo grocery store a few blocks down to get some fruits, juice and yogurt to reduce our dine-out bill. It was a little pricey but convenient. Our online room rate was honored, but they did not give us our discount. We believe it would be better to obtain any discounts directly with the hotels. We ended up spending about as much for our hotel as we would have booking at one of the nicer hotels in Condado a much nicer district. The hotel was conveniently located a few miles from the Old San Juan tourist district. The only other drawback was the smelly carpets which we sprayed with air freshener. My husband liked the nice decor inside. This was an average hotel with nice decor. We were pleased with the size of the room. Although parking was limited with our small car we were able to squeeze in the small lot in back of the hotel which accomodates 4 or 5 cars. Our online discount rate with taxes and fees was $288 for 3 nights we paid $327 instead. The rate was $86 per night but the tax and tariff was 21% and there was a $5 room surcharge per night.", "Date": "September 8, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Willemstad, Curacao", "Title": "“A great experience”", "Author": "hjkroeze", "ReviewID": "UR117577866", "Content": "Our first time in Puerto Rico we stayed in the Miramar Hotel not knowing what to expect. From entering the hotel untill leaving we had a great experience. The staff is very, very helpfull, the rooms are clean and great and the food in the Bistro 606 is excellent. If you rented a car you are in for a surprise, because there are only 3 parking places at the back of the hotel, but in the area around you always can find a free spot. And because we are not very demanding, it was no problem at all. The location is superb: just outside Old San Juan and the view from the sunroof is magnificent. We'll sure be staying there on our next trip to Puerto Rico. A great island with many inteersting things to see and visit.", "Date": "September 2, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Tampa, Florida", "Title": "“Just checked in- great”", "Author": "DrJK12", "ReviewID": "UR117562830", "Content": "When I first booked the hotel, I was worried about 1) service in general, 2)internet access and 3) parking after reading the reviews. Completely contradictory experience. Getting to the hotel: The GPS couldn't locate the address so it might be worthwhile to print out the directions to get in from the airport. 1) Checking in: Just an outstanding and charming welcome from Noelia. Chose the room for us to make sure we are comfortable. 2) Internet: No problems logging in from the room (currently logged on). 3) Parking: 3 spaces only but Noelia explained that we can leave the keys with her. I think this should be fine. I will provide the final note at checkout but looking forward to the next two days here.", "Date": "September 1, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Cincinnati", "Title": "“Great Value, Excellent Trip!”", "Author": "Laura_3148", "ReviewID": "UR117478078", "Content": "I loved staying at Hotel Miramar! Stayed for a little over a week in the end of March beginning of April 2011. This is the perfect hotel for a short or long stay. Hotel staff was always friendly, and caring. Stayed with a group of 3 women ranging from 22-68. We always felt safe in the area. There is a bus stop almost in front of the hotel, a grocery store right up the block, and some great little places to catch a quick lunch or a nice dinner. Our room was in the front of the building so we had a beautiful view of the ocean. The roof top deck was the perfect place to spend time in the evening/night, and the rooms are HUGE compared to most hotels I have stayed in. I can't wait to get back and explore more of Puerto Rico!", "Date": "August 31, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Miami, Florida", "Title": "“Perfect little hotel”", "Author": "docmo06", "ReviewID": "UR117236432", "Content": "Really enjoyed our stay!!! Friendly staff, clean rooms, great price, and beautiful roof terrace. We loved it and we'll be back again....hopefully soon....PR is lovely!!!", "Date": "August 25, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "New York City, New York", "Title": "“Cute, Comfy and Clean as always”", "Author": "msd30", "ReviewID": "UR117157184", "Content": "This is my second time staying at the Hotel Miramar!! I really enjoy staying at this hotel!! When I'm there, I feel like I'm at a mini Ritz Carlton!! The service is great, the staff is friendly, the rooms are a nice size and more importantly very clean, the decoration is lovely, and the newly renovated bathrooms are gorgeous!! Even though there is not a pool, there is a fantastic roof top terrace, where you can sunbathe and relax with a beautiful view of the city and the sea!! I will definitely be staying a third time!!", "Date": "August 23, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "New York City, New York", "Title": "“The MVP.....I mean MVH (most valuable hotel)”", "Author": "elias p", "ReviewID": "UR117156325", "Content": "This hotel in its category of small hotels is a giant in several aspects, great costumer service, great atmosphere, the staff treats you like family, the rooms are very spacious, and comfortable beds help you rest after a long day of sight seeing. The hotel has a nice roof terrace, that in our case (girlfriend and I), brought a very romantic moment with a spectacular view of the stars and the city lights. We can't wait to be back!!", "Date": "August 23, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Miami, Florida", "Title": "“We loved the hotel and we will be back, we felt like home”", "Author": "plostaunau", "ReviewID": "UR117020310", "Content": "We enjoy the hospitality of the hotel. We had a very spacious room and a great restaurant. The people was very friendly and helpful with us. We will be back", "Date": "August 21, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "4", "Overall": "4.0", "Value": "5", "Service": "4"}, "AuthorLocation": "Boston, Massachusetts", "Title": "“Never Judge a Hotel by its' size”", "Author": "Rudy C", "ReviewID": "UR117010017", "Content": "Just recently i traveled to San Juan on a business trip, but was a little disappointed because I could not get a reservation at the hotel i normally stay in. However, I have to recognize that size and fame aren't always best. From the moment I arrived at the Miramar Hotel with the warmest personal touch, a smile that one could feel was genuine and sincere. Rooms though not very large are adequate but very clean and service was more than i expected. But have to give a special thanks to the front desk personnel for all the help they provided me during my 4 days there! Though smaller than most in size, TheMiramar Hotel is certainly larger than most in servitud and equal in quality. I'll never again judge a hotel by its' size!", "Date": "August 20, 2011"}, {"Ratings": {"Cleanliness": "3", "Sleep Quality": "1", "Overall": "1.0", "Value": "3", "Service": "2"}, "AuthorLocation": "Evanston, Illinois", "Title": "“Bad, bad experience”", "Author": "Jan K", "ReviewID": "UR116842335", "Content": "Unfortunately my experience with Hotel Miramar has been very bad. Here are the main reasons: * their wireless internet is a joke. The signal came from a crappy wireless modem attached to the hallway wall just outside one of the guestrooms. I know that because it went down on my second day there and the hotel management didn't do anything about for the next two and a half days (needless to say, I really needed the connection). * the AC in my room was really noisy (I checked and the same type of AC's were in other rooms as well). It was actually so noisy that it would wake me up during nighttime. And you do need your AC turned on in PR. * even noisier was the ice making machine that I had on my floor. I might have been unlucky to be on the floor with the ice making machine, but that means that all other ten rooms on the floor were affected. And boy, that was one noisy ice making machine! * one of the reasons I chose this hotel was that the breakfasts were apparently included in the room price. Not true. They actually give you these coupons which give you $2.5 discount off the regular prices, which are really inflated e.g. they charged $7 for basic scrambled eggs which is A LOT by PR standards * talking about the kitchen / \"restaurant\", the guy taking orders was quite rude and low class, behaved like he wanted to punch anybody around him at any time... but hey - you get what you pay for...", "Date": "August 17, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "Brookings, OR", "Title": "“Excellent value and location for exploring San Juan”", "Author": "BruinPlayer", "ReviewID": "UR116219682", "Content": "With a bus stop practically outside the front door, we could be in Old San Juan in 5 minutes or Isle Verde in 15. Playita Condado is a lovely 12-minute walk away, and was virtually deserted after sunset. Five minutes from Isle Grande airport for the trip to Calebra. Several restaurants and bars close by. A 24-hour grocery one block away made the in-room fridge and microwave a money-saver on our food bill. Wonderful views from the rooftop patio (which we had all to ourselves every night). All staff consistently hepful, friendly, and efficient. Very comfortable room/bed. We weren't in San Juan to hang out in a hotel, but wanted to be out and about, and Miramar was perfect for us. (And, if the elevator seems too slow for your hurried pace, you can do one of two things: slow down yourself, or take the stairs.)", "Date": "August 3, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "5", "Overall": "5.0", "Value": "5", "Service": "5"}, "AuthorLocation": "San Francisco, California", "Title": "“Hidden Jewel”", "Author": "SFtraveler6688", "ReviewID": "UR115235573", "Content": "The room and other areas in this hotel is always clean. Everyone is cheerful, polite and extremely helpful. I have traveled around world but Miramar exceeded my expectation in every aspect. Free parking and wireless internet. Bus top to Old Town San Juan is a couple of min walking distance. This place is less than half miles away from Puerto Rico Convention Center. Love this place!", "Date": "July 11, 2011"}, {"Ratings": {"Cleanliness": "4", "Sleep Quality": "4", "Overall": "4.0", "Value": "4", "Service": "5"}, "AuthorLocation": "Philli", "Title": "“Loved my stay here”", "Author": "PhilliTraveller007", "ReviewID": "UR115184406", "Content": "We stayed here during the July 4th weekend. We stayed in a room which had a king size bed. Our room had a microwave, minifridge, TV, AC, Iron and Iron Board, hair drier, safe deposit, wireless internet. it seems microwave and minifridge are standard in all rooms. Not sure about other items. Usage of internet and safe deposit box was free which i liked since some hotels charge for such facility. The rooms and bathrooms were very well maintained. Every time we were back at the end of the day, our bed would be nicely done and all towels and bath soaps replaced and all thrash removed. We stayed there for 6 nights and each day they were very consistent in their maintenance. There are also laundry facilities for the guests. They provide room service for food. There are vending machines for water and Ice on I think alternate floors. The hotel also has a wonderful rooftop deck. The only shortage is parking but you always find some spot to park around the hotel. If you don't find a spot just park the car in their aisle and leave the key at the reception. They would park your car legally when there is parking space available around the hotel. Next day morning just pick the keys and they would tell you where they have parked your car around the hotel. the entire 6 days we did not have any parking problems. The front desk guys are very helpful and the front desk is manned 24 hrs. There is a Bistro on the ground floor of the hotel which was very convenient since every day morning we had our breakfast there. It opens at 7.00 am everyday except on Saturday/Sunday when it opens at 8.00 am. It has a bar. They also serve lunch and dinner, although we never tried it out. The location is just perfect. It is close to old city and if you want to go east towards Fajardo, Rt26 is right next to the hotel.The road access to this hotel is a little complex, but once you get used to it, its pretty simple. There is also a PUEBLO grocery store just walking distance from this place which was very convenient. Overall I am very much satisfied with my stay in Hotel Miramar and I would recommend it to fellow travelers.", "Date": "July 9, 2011"}, {"Ratings": {"Cleanliness": "5", "Sleep Quality": "4", "Overall": "5.0", "Service": "5"}, "AuthorLocation": "Phoenix, Arizona", "Title": "“Honeymoon in San Juan”", "Author": "Bflood2000", "ReviewID": "UR114773688", "Content": "Went to San Juan for our honeymoon in June 2011. Was booked into Miramar hotel with the travel package so I dint know that much about it before hand. Let me state here I was very impressed. The staff led by manager Sylvia was very helpful. Always giving us directions and advise as we had rented a car. This hotel is not in the tourist zone but in the real city. The Miramar was clean, quiet and felt safe, it is close to beach. Parking is tight as it is in any large city. The roof top view patio view was spectacular. We took are dinner up there one evening. All in all I was very happy with the Miramar. I highly recommend it.", "Date": "June 26, 2011"}, {"Ratings": {"Cleanliness": "2", "Sleep Quality": "1", "Overall": "1.0", "Value": "1", "Service": "1"}, "AuthorLocation": "Bronx, New York", "Title": "“VERY UNSUPPORTIVE STAFF IN TIMES OF MISFORTUNE\"”", "Author": "jrodroguez", "ReviewID": "UR114690582", "Content": "The first 2 days were pleasant. However, on the 3rd day my rental car was vandalized at the hotel's valet parking, which consists of 4 spaces. Once the 4 spaces are filled the use the street parking as valet parking. If this type of experience isn't disturbing enough, to say the least, the hotel staff's lack of concern, empathy and courtesy was very disheartening. They had the key to the car but didnot move the car to another location. The windows were broken but the did not want to move the car and rather it stay on the street where it was vulnerable to further vandalism. The hotel is in a very dangerous neighborhood!!!", "Date": "June 23, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Ontario", "Title": "“Little Gem with Suberb Staff”", "Author": "GrammyOntario", "ReviewID": "UR110702249", "Content": "The hotel is very quaint, not too big, with a great view of the harbour from the attractive roof patio. Rooms are clean and very comfortable. Hotel is in the process of remodeling all bathrooms. Very close to the port, if you are cruising, with local bus (50 cents) right outside front door to old San Juan. The staff (Sylvia) are extremely friendly and all are most accommodating. Surrounding area, although looks a bit rough, has good restaurants and grocery shopping...\"area is safe\". Small restaurant and bar on property...breakfast, all we ate, excellent. Not a lot of frills but offers great value with very comfortable accommodation. No hesitation to recommend this hotel...we will be staying there the next time we go back!", "Date": "May 31, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "3.0", "Value": "4", "Sleep Quality": "3", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Virginia", "Title": "“Fine for an overnight stay”", "Author": "SMLBARB", "ReviewID": "UR102791312", "Content": "We spent one pre-cruise night here and it was fine for that. The hotel does need updating, but it was clean and very convenient. We took the local bus to Old San Juan and walked to Condado Beach. The view from the rooftop was lovely day and night. We didn't have breakfast here - we stopped at a little cafe a half block away for a good and inexpensive breakfast. There is a grocery and pharmacies nearby so you can pick up wine and anything else you might need before your cruise.", "Date": "April 4, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Copenhagen, Denmark", "Title": "“Nice hotel”", "Author": "SanJuan-2011", "ReviewID": "UR101162793", "Content": "Fine place of hotel. Close to the lagoon, Close to busstop - 5 minutes to Old San Juan (only 50 cents.) Nice sunterresse at the top of the hotel. Fine romms with good beds. Very helpfull frontdesk.", "Date": "March 22, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Marietta, Georgia", "Title": "“Great value, excellent service, and don't miss the rooftop terrace!”", "Author": "Travel30066", "ReviewID": "UR100759218", "Content": "We stayed here two nights and really enjoyed it. The rooms were somewhat outdated (nothing special), but did have a refrigerator, microwave, and free Wi-Fi. We had a great view of the Condado Bay and skyline from our room and an even better one from the beautiful rooftop terrace. This hotel is walking distance from Condado and a 75 cent bus ride to Old San Juan. We enjoyed being just outside the tourist area, because we could walk to a grocery store and a couple of nice cafes serving Puerto Rican food at reasonable prices. The hotel's free breakfast is just a basket of bread and small pastries, but you can apply your voucher for $2.50 off any other breakfast they serve, making it the cheapest breakfast (and quite good) in the area. The staff was very friendly and helpful, especially Sylvia who allowed us to store a suitcase there for a few days while we went to Vieques. This place had a very local, friendly feel. I would stay there again.", "Date": "March 19, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "lawrence ma", "Title": "“This hotel is clean, comfortable and has the best view of San Juan from roof terrace.”", "Author": "ramos929", "ReviewID": "UR99865976", "Content": "If you are looking for a place to stay in San Juan with comfortable beds and nice bedrooms stay at hotel Miramar. The service is great and you need that to enjoy yourselves when you leave to learn about all the history that surrounds you. If you like to exercise it has a fitness room for you as well. You cant go wrong staying at this beautiful hotel, definitely going back.", "Date": "March 12, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Washington DC", "Title": "“Highly recommeded if you are not the beach resort type”", "Author": "PhilWashingtonDC", "ReviewID": "UR99639382", "Content": "Things we liked about this hotel and its location include: - Perfect weather (72 to 82 every day during our 5 day January vacation) - Reasonable rates -Comfortable, clean, quiet room with a refrigerator and microwave - Free parking although mostly the hotel staff parked the car in the street - 10 minute, 50 cent bus ride to Old San Juan a few feet from the hotel - A nearby grocery store and several good restaurants including the one in the hotel - A rooftop patio where you can relax and view the ocean (plus smoke if you like) Any complaints have more to do with the neigborhood or San Juan in general than the hotel: Many of the nearby properties appear abandoned or neglected and several nearby restaurants that are listed on the internet simply do not exist. In addition the hotel is near a nexus of several high speed roads an overpasses which hinder walking in several directions. For example there is a Sizzler steakhouse overlooking a nearby yacht club within a few hundred yards of the hotel but it took me three days to figure out how to walk there without risking suicide by crossing the highways. Finally, virtually every private home in the area is surrounded by a razor or barbed wire topped wall or fence so crime must be a big problem. (PR has a hundred murders a month out of a population of 4 million. and private security guards and police are everwhere.)", "Date": "March 10, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Boston, Massachusetts", "Title": "“Great Expirience”", "Author": "aestevez21", "ReviewID": "UR99284353", "Content": "Looove, Loooved the Hotel. Small but cozy. The bathrooms are newlly renovated and spacious. The hotel has a warm, home feeling. Even though it does not have a pool, it has a big terrace at the top of the hotel with a great view of the surroundings and laggon. Here they have functions and parties. We were lucky to enjoy a function while we were ther Great location as well. Is in the middle of San Juan with in minutes of the \"old san juan\". The satff was very frindlly and since is a small hotel, they were able to deliver fast and accurate service. The sapce was very, very clean. Also, great restaurants within the block as well as in the Hotel. The owner, Juan, is friendlly and wants you to have a great experiance in Puerto Rico and offers great recommendations of sites to see, food and night life. We had a great time. Will recommend to everyone.", "Date": "March 7, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "1"}, "AuthorLocation": "Watchung, New Jersey", "Title": "“Safe yourself go elsewhere”", "Author": "dvjx102", "ReviewID": "UR97151722", "Content": "The Hotel is in real big need of updating, the hotel the lobby is the only updated area the bathroom stop in 1970, not very well cleaned rooms ,the ice machine way down the hall can be heard a mile away,the continental breakfast is a joke, front desk well lets just say don't drop a $20.00 bill, it will never be seen again the folks there will make sure of that. the neighborhood it's alright, in the day bring lots a change, you will need it to give to the many poor unfortunate people as you walk down the street ,at night dont bother going out for a walk unless your looking for trouble.", "Date": "February 18, 2011"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Monticello ny", "Title": "“Sylvia is GREAT!!”", "Author": "steveboces1", "ReviewID": "UR96217190", "Content": "As many have said, the hotel is a good value. It is also located very close to the bus which takes you quickly to the Old City. The rooms could use some updating and there is some noise. Given the climate, a pool would have been nice. Having said all of this, Sylvia at the desk was a gem and made the hotel worthwhile. She was always cheery and helpful and sent us to 2 fabulous restaurants. (I'm a foodie so I'm very picky.) We liked her and the location enough, so that when we finished our sailing trip, we came back to the hotel for our last night in town.", "Date": "February 11, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Miami, Florida", "Title": "“Excellent hotel”", "Author": "Ada33178", "ReviewID": "UR96189485", "Content": "I stayed at the Miramar for 5 nights, I have travelled well and to many hotels world wide. This is a family run hotel similar to the small hotels you find in Europe. The room had a microwave and small fridge, ironing board and iron. The room and bathroom were very clean, good ambiance, excellent staff, more than a continental breakfast with hot oatmeal, pastrys, local bread, cereals, fruits. Good for cruise travelers or bussiness travelers, close but not walking distance to Condado, Old San Juan or metropolitan area. Helpful bilingual staff will get you a taxi to these areas. There is nothing near to walk at night, it is a quiet hotel. Would happily stay again and reccommend to friends. I saw many europeans staying there and many pre cruisers and they all had good comments.", "Date": "February 10, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Swannanoa, North Carolina", "Title": "“Outstanding Value, Friendly and Knowledgable Staff”", "Author": "phillip1941", "ReviewID": "UR95589436", "Content": "My wife and I spent 3 nights at this hotel prior to our cruise. We thoroughly enjoyed the stay. All the front desk personnel and dining room staff we had contact with were friendly, gave very helpful travel and sightseeing directions and recommended good eating places. They also drove me across town to help find a credit card I had left at a restaurant. Our room was very clean, pleasantly large, quiet and had a small microwave and fridge. The hotel is centrally located within 10 minutes walk of a beach, grocery store, pharmacy, and fast food places; 5 minute bus ride to Old San Juan and several galleries/museums; and with almost instant taxi service. The free continental breakfast was all you can eat and had more variety than often available. We ate once at the Bistro. The food was excellent and reasonably priced although a little slow in delivery. The hotel is a small independent business and to us that was part of its attraction. If you want big chain and luxury and 2 steps to the beach don't stay at the Miramar. If you want outstanding value for your dollar, helpful and friendly staff, and a convenient location then we recommend the hotel without reservation.", "Date": "February 5, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Rochester, NY", "Title": "“Great for Pre Cruise Stay”", "Author": "Travellers807", "ReviewID": "UR94992346", "Content": "We stayed at the Hotel Miramar before our cruise in January. The rooms were spacious and very quiet at night. We enjoyed the sun deck immensely and found it very easy, inexpensive and quick to take the bus to Old San Juan. Staff was friendly and helpful. Would definitely stay there again if we visited San Juan.", "Date": "January 30, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "3", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "1"}, "AuthorLocation": "Ottawa, Canada", "Title": "“Roaches”", "Author": "Indy3110", "ReviewID": "UR94631525", "Content": "We booked a double room for one night before our cruise. After checking in we inspected the mattresses for bed bugs. We didn't find any bed bugs but instead found a dead cockroach under one of the beds. We called the front desk and were offered to change rooms. When we expressed a concern that there may bugs in that room as well the managers got very agressive and we were told to leave the hotel immediately. He took a real offence that we inspected the beds for bed bugs. We asked if we could at least use the internet at the hotel to find ourselves another hotel, as it was late and dark outside and we didin't know the area. The manager refused. We were also told that we would be charged for the room if we left. We were worried that we may not find another hotel since this is a busy time of the year for cruise passenger so we elected to stay in a different room. Needless to say we didn't sleep much that night. We have never been treated so poorly in any hotel before and we travel a lot. The hotel is not in a great area and we didn't feel safe walking around at night.", "Date": "January 27, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Winnipeg, Canada", "Title": "“Very good value”", "Author": "Spruce", "ReviewID": "UR94494013", "Content": "Our family is two adults and a 3-year old child. Let me just say because it's important, anyone who complains about the breakfast here has never had a continental breakfast before. We thought the food selection and quality were FABULOUS for a free hotel breakfast! And the coffee was excellent. Of course they won't let you pack a lunch from the continental breakfast - go buy your lunch in town. Duh. We stayed at the Miramar twice, one night before a cruise and three after. We therefore had two different rooms. They were both large and spotlessly clean, and both had a nice microwave and bar fridge. The first (406) had a king-sized bed against a wall with a window, which was odd but there was nowhere else to put it. The security light outside shone under the curtain all night which I thought would bother me but we all slept fine. The second room (304) had two double beds and looked onto the next-door hotel which is currently being gutted. I had no complaints about either room. The air conditioning worked well but the unit in the second room was much newer and quieter. When we checked in the second time, the elevator was broken. I thought \"here we go\" but a technician was called and it was fixed within half an hour. Some other hotels might have left it broken for days so this was impressive. The staff were pleasant. Somehow our booking was made for the wrong days but it was corrected without any hassle or really any investigation at all. To this day I have no idea whose mistake it was. The laundry worked well and was much cheaper than on our cruise. The rooftop is very nice. For us the best feature was the Pueblo supermarket a block away, and 3 pharmacies within walking distance. There are also some good restaurants around. There are two computers in the lobby which are free for patrons' use. I would definitely stay here again.", "Date": "January 26, 2011"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "3.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "madison, wi", "Title": "“Pre Cruise hotel, great for the price, location”", "Author": "mauiwahine", "ReviewID": "UR93450440", "Content": "Cab cost $26 to Hotel Miramar for all 6 of us. There was a nice restaurant just around the corner but it was already closed since it was past 10pm. We later found out that another couple said they had a wonderful time at that restaurant the night before. We went down the street, within visual distance of our hotel to another restaurant for locals. Diagonally across the street is a bar. Hotel Miramar is close to the Pan American pier if you are leaving on a cruise. If you are active and don't mind hauling your luggage, you could possibly even walk to the pier from there. The interchanges are a bit confusing around the hotel though. I think I would stay at a beach resort next time to enjoy the water/beach. However, the staff at Miramar was excellent and friendly and they even let us check out as late as 3pm. We hung out on the rooftop prior to checking out, it was a partly cloudy day and not too hot. We found the contenental breakfast to be quite adequate. They had milk, cereal and many pastries. All in all, a great place to stay for the money.", "Date": "January 17, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Sleep Quality": "3", "Rooms": "4", "Location": "3"}, "AuthorLocation": "Los Anglees", "Title": "“Why all the negative reviews, this is a nice place to stay”", "Author": "Duckdoger", "ReviewID": "UR91743758", "Content": "I used this hotel for two nights after a holiday cruise. I just don't know where these terrible ratings are coming from. Hotel staff couldn't be friendler or more helpful, fast internet, and respectible rooms. No this is not a new place, but if you have ever traveled Europe and stayed in smaller, family operated hotels, this is very nice. Has all of the amenities one could want. Yes, the building is dated and not in a \"hip\" area but bus transportation right outside the front entrance and was only a 5 minute ride from the cruise ship pier. The roof top deck has great views too, laundry available and vending machines that don't charge 3x the going rate. That being said this isn't a perfect hotel. The rooms have seen too many coats of paint, water pressure is low but all of the fixtures are clean, the carpet new, A/C VERY quite. Avoid rooms ending in 01 or 02 as they face a busy street. Beds also a bit tired but still comfortable and the lines were cleaner than on my cruise ship. Sizzler, Subway, Papa Johns, and Wendy's all within walking distance", "Date": "January 4, 2011"}, {"Ratings": {"Service": "3", "Cleanliness": "4", "Overall": "2.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "2"}, "AuthorLocation": "Newark DE", "Title": "“Clean, quiet but out of the way”", "Author": "SteveDELIWEAR", "ReviewID": "UR91274373", "Content": "Clean room in hotel that came with package. Continental breakfast though free, not worth it. No real places nearby to get breakfast. Bus ride into Old San Juan attractions. Friendly staff, excellent restaurant, Bistro 606, attached. Several dinners were had there. Leisurely service, well prepared and fresh food and moderately priced, though not cheap. Would not stay here again due to location, but for those looking for a modestly priced hotel, that is clean and well maintained, this is a viable choice.", "Date": "January 1, 2011"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Vancouver, BC, Canada", "Title": "“Excellent value!”", "Author": "Greggarious66", "ReviewID": "UR91052913", "Content": "Stayed there after our cruise and would absolutely do so again. It was a great value for the price. Extremely large spotless room, recently updated with beautifully tiled bath. Front desk staff was fantastic, even during an onslaught of incoming/outgoing cruise passengers. The only thing lacking was a pool. Quiet, convenient location and the largely residential neighbourhood had some beautiful homes.", "Date": "December 29, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "5"}, "AuthorLocation": "Enid, Ok", "Title": "“needs updating”", "Author": "antiquelover20", "ReviewID": "UR90438059", "Content": "went on a cruise 12/12/10 so stayed the 11th at the hotel. NO coffee in the rooms and no pool- didn't mind not having a pool but feel coffee is a must and no room service before 8AM- we rise at 6AM so this was not good. Roof top is nice but the rooms need updating. Would not stay there again.", "Date": "December 21, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "3.0", "Value": "4", "Sleep Quality": "4", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Houston, Texas", "Title": "“Great small hotel”", "Author": "TexasTraveler073", "ReviewID": "UR89267562", "Content": "My twelve year old daughter and I stayed at the Miramar for one evening before our cruise. We had a very large room, and the beds were great. We thought the location was great -- close to old San Juan, and still easy to get to the cruise terminal. The customer service was good -- the folks at the desk were very friendly and helpful. Breakfast was an adequate continental, nothing special, but it was free. On the whole we thought it was a great hotel for the money, and I have booked it again before our cruise in two weeks.", "Date": "December 7, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Little Elm, Texas", "Title": "“This was ideal..”", "Author": "stoph", "ReviewID": "UR88019223", "Content": "The Hotel Miramar was a bargain for what we paid - We would have expected to pay twice as much. It was clean and bright and very nice. The room was spacious. We stayed here the night before departing on a cruise. We got in very late, and were hungry. The staff helped us find a place to eat at one in the morning. The next morning it was very easy to get a cab and make our way to the cruise terminal.", "Date": "November 23, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Fort Collins, Colorado", "Title": "“Great customer service”", "Author": "professorj_10", "ReviewID": "UR87824755", "Content": "I stayed at this hotel the night before a cruise departure and give it my highest recommendation. Huge comfortable room, reasonable rates, and lovely staff. Juan Sanchez at the front desk could not have been nicer or more helpful. I misplaced the only sweater I had brought along somewhere in the hotel and had mentioned this to Mr. Sanchez when I checked out, heading for the cruise pier; he found my sweater and actually had it sent to me in my stateroom on board ship before it sailed! Thank you for this thoughtful effort, Mr. Sanchez!", "Date": "November 21, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Chicago", "Title": "“Very quaint”", "Author": "victom", "ReviewID": "UR87451967", "Content": "This hotel has Old San Juan charm and tons of customer service! The rooms are spacious but the beds are a little hard. Only one elevator so be ready to use the stairs after you get your luggage to your room. The roof top view is wonderful and we had a very relaxing time with our group of 10 just sitting and having beverages which were easily purchased at the grocery store 1/2 block away. The front desk was more than helpful with getting taxis and giving area information for the bus to Old San Juan just a mile away. Then it was just a 5 minute ride to the Royal Caribbean port which cost us about $5 a person for 5 of us with all our luggage. The breakfast is nothing to brag about and takes some time to get waited on but didn't bother us as we had plenty of time.", "Date": "November 17, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "3", "Overall": "2.0", "Value": "1", "Sleep Quality": "2", "Rooms": "3", "Location": "2"}, "AuthorLocation": "Seattle, Washington", "Title": "“Old hotel with poor service and unexpected charges”", "Author": "xdamethyst", "ReviewID": "UR86000921", "Content": "My husband and I stayed at this hotel for three days in Oct 2010 for vacation. Our stay was otherwise satisfactory, except for one episode which reflects very badly on the hotel’s attitude towards customer service. We were told that it had *free breakfast* every morning so in the next two days we took our breakfast at the hotel. The service was strange because they put drinks by window so you can help yourself, but food had to be served by the attendants there. They provided each customer two pieces of bread and two pieces of pastry, with a few pieces of watermelon. However, on the last day morning, when we were in a hurry to catch a ferry to the island Culebra, we asked the attendant to give us *one* share of bread and pastry so we could bring them with us and hit the road. But, this time, the attendant told us that the breakfast was actually a buffet, which meant we couldn’t take out any food. She consulted with a manager at the front desk and got the same answer. In the last two days when we had our breakfast, nobody told us it was a buffet so we could have as much as we wanted, now when we need only *one* share of food to go, suddenly they told us it was a buffet. The manager who talked to us had very poor attitude. Instead of empathizing with our situation, he asked us if we knew what a buffet was! Finally he relented and allowed the attendant to give us the food, but not before wasting much valuable time, which caused us to get stuck in traffic in San Juan and almost miss the ferry.", "Date": "November 4, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Sleep Quality": "4", "Rooms": "5", "Location": "3"}, "AuthorLocation": "Wilmington, North Carolina", "Title": "“Great stay in a very nice boutique hotel”", "Author": "pparrothead", "ReviewID": "UR84965723", "Content": "When we first drove up to the Hotel Miramar my wife and I were taken aback. Could this be? But after parking our rental car, checking in and then going to our room we were more than satisfied. The hotel's staff was quite possibly the most polite, courteous, and helpful that we have ever encountered. The room was clean, comfortable and had a microwave and mini fridge. On the eighth floor was an outdoor rooftop terrace with a spectacular view of San Juan. In fact it was so nice we decided to have dinner up there one night with a chilled bottle of wine and dessert. We would definitely stay here again", "Date": "October 26, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Mountain View, CA", "Title": "“Jewel of a hotel centrally located, with easy access”", "Author": "sfaamm", "ReviewID": "UR84454334", "Content": "Beautiful, secluded yet very accessible hotel. Rooms are clean and spacious. Roof top terrace has great views of Condado area and beaches. Breakfast included was reasonable. Small but trendy restaurant with excellent dishes (try mussels with chorizo). Staff is friendly and courteous. Book through internet service like Expedia for best deals. The only major drawback was hot water did not work well for shower. Parking is a slight challenge, so rent a small car and leave the keys with the front desk.", "Date": "October 22, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Canton, Georgia", "Title": "“The roof top view was absolutely breathe taking....”", "Author": "REM57", "ReviewID": "UR78173235", "Content": "I decided to bring my daughther to San Juan for a week long vacation... after endless searching on the internet to find the perfect hotel.... we decided on the Miramar and what an amazing experience it has turned out to be. Sometimes you never know what to expect when booking online... but from the very moment we step in the door of the hotel... we felt like we were home away from home. We were greeted by Manuel Medalla the hotel representative and he was extremely welcoming and helpful. He took the time to assist we all of our questions & even took the time to give a quick run down of the city and best beaches. The rooms are spacious, clean, comfortable and affordable. I would definately stay here again.", "Date": "September 3, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Miami, Florida", "Title": "“A great hotel for a weekend on the island.”", "Author": "psicher", "ReviewID": "UR77751366", "Content": "My wife got a really good fare on tickets to Puerto Rico for us and our 2 year old daughter so we decided to jump on it. Tired of the big chains we decided to go with this family run hotel after a good friend recommended it after she spent her honeymoon there. For being a small hotel, it had all that we needed. The rooms were clean and spacious, the staff was attentive and the free continental breakfast was a great way to start the morning. The dinner service at the restaurant was great, but so were the recommendations of nearby places. Speaking of places to go, the hotel is within walking distance of the brand new convention center and a few minutes walk from the Condado area. Old San Juan is only a short cab ride away, although I am sure you avid walkers could get there on foot (not us, no 2 year old is doing that any time soon!) Top to bottom this hotel was what we wanted and more. The attention of the staff was outstanding and the rooms were spacious and comfortable and the rate was outstanding. The owner, Juan, was very attentive to our needs and he could always be seen interacting with guests and trying to ensure they would have a great experience. More than one person we talked to at the hotel said it was not their first time staying there, a very important factor to consider. People like coming back, and we plan on doing it.", "Date": "August 31, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Miami, Florida", "Title": "“The best small hotel I ever stayed in”", "Author": "maridiu", "ReviewID": "UR77584671", "Content": "This small hotel is very clean, walking distance to the Convention center, nice friendly people, fine restaurant and the beds a very confortable, together with the good price you can't ask for more. The BEST", "Date": "August 30, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Orlando, Florida", "Title": "“Great Hotel - Can't wait to visit PR and stay at HOTEL MIRAMAR!”", "Author": "unkie1969", "ReviewID": "UR77489710", "Content": "My family and I stayed at the Hotel Miramar in June 2010. Rooms are clean and serviced with a smile everyday. The hotel is located close to all points of interest, which made it easy to take a cab anywhere. The staff went above and beyond to make us feel at home. We are excited to return to the Hotel Miramar in 2011 for our annual family vacation!", "Date": "August 30, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "2.0", "Value": "2", "Location": "3", "Rooms": "1"}, "AuthorLocation": "New York City, New York", "Title": "“muggy room! poor sleep! rooms need to be renovated!”", "Author": "silvia60763", "ReviewID": "UR76801999", "Content": "I never sleep worse in my life. The room was smelling like old and muggy carpet. The beds are so uncomfortable. I never go back!!!!! customer service was great!", "Date": "August 25, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "New Holland, Pennsylvania", "Title": "“Great location, big clean rooms”", "Author": "Sevilla2010", "ReviewID": "UR70687320", "Content": "There was a group of nine of us who spent 4 nights here over the 4th of July weekend. The hotel was great. Rooms were big and clean. The rooms in the front of the hotel have great views, the smaller rooms in the back have windows that look out to the building next door. All rooms are bright and get great sunlight. Rooms have fridge and microwave and internet access. No noise from traffic or other rooms. Theres a nice outdoor terrace on the roof. Was a nice place for our large group to just hang out together, without having to be in someones room. Parking was not a problem at all. There are a few spaces right out front, and more along the sides and back. Easy to get to major roads, easy to get to Old San Juan from the hotel. Breakfast is included. It's not much, muffins, danishes, and bread, enough to hold you over until lunch. Everyone at the desk was very nice and helpful. Would definatly stay here again.", "Date": "July 12, 2010"}, {"Ratings": {"Overall": "5.0"}, "AuthorLocation": "Miami, Florida", "Title": "“Newly Engaged in Puerto Rico”", "Author": "NewlyEngaged630", "ReviewID": "UR69899568", "Content": "My first experience with Hotel Miramar was an email, I had reached out to the hotel in regards to the local tours offered and received a reply within hours. Sylvia is amazing, not only she did reserve an amazing tour for us, but upgraded us, and gave us great insight on getting around in San Juan. She is a stellar employee and they are lucky to have her. This is an unforgetable trip for us because it was my boyfriend's 30th birthday but we also got engaged and Sylvia made it that much more special.", "Date": "July 6, 2010"}, {"Ratings": {"Service": "3", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Sleep Quality": "3", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Munich, Germany", "Title": "“good location, perfect room”", "Author": "NordicTropical", "ReviewID": "UR68127287", "Content": "I had a Caribbean tour with my friend, so we stayed almost every night another hotel...this was our last, and it was a great finish. The hotel is close to airport, but also not far from center. The staff is friendly, there was some mess with our reservation, but Fabian was nice and didnt let us waiting senseless long. The room is good qualitiy, clean, has everything that u need...and the bed is awsome huge :) A good example when price and quality meets.", "Date": "June 20, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "5"}, "AuthorLocation": "El Paso, Texas", "Title": "“A humble and service oriented organization.”", "Author": "RPacheco56", "ReviewID": "UR64945186", "Content": "This hotel is not a glamour place, however, the friendly staff and the cozy environment makes up for it. The location is great and allows the visitor to travel to historic and entertainment areas with ease. The staff provides a tremendous amount of information for tours and the best way to get around in San Juan and the rest of the island.", "Date": "May 21, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "4", "Location": "5"}, "AuthorLocation": "Scarborough, Ontario", "Title": "“Stayed one night before our cruise”", "Author": "chillthenrelax", "ReviewID": "UR64186151", "Content": "Stayed at hotel for one night Apr 10, 2010. Went with a group of 18, family wedding on the cruise. The taxi fare is determined at the airport. I think it was around $3-$4/person, $1/luggage. Rooms were big and clean. Beds were comfortable. They had a microwave, fridge, tv. The room size varies. The rooms ending with 1 and 2 are the biggest/best (e.g. 201, 202). Those rooms also have the best view, a lot of daylight gets in. My room was facing the wall of the next building. The tv size also varies. My friend's room had the smallest tv! it was probably 13-15 inch haha. Ours was ~30 inch. If I remember correctly room 202 had the big flat screen tv. Hotel has an elevator, but it's very slow. It's faster if you just take the stairs. The hotel has 7 floors. The roof has a couple of patio sets, very nice view. We brought drinks to the roof and hung out there all night. Gym is very tiny, you need a key from the front desk to get in. AC very good, very strong. windows do not have screens, but I don't remember any mosquitos, maybe it's because we're so close to the water, constant breeze. Ice machine in hallway. Two computers on the main floor with internet service (free). Internet connection for your laptop also free. I used their printer and they didn't charge me for the paper. There's a big supermarket down the street (one minute walk). They sell alcohol in the supermarket. A few places to eat. There's one place across the street and down a bit from the hotel with this wicked dish. Can't remember the name of the restaurant, but it looks like a bar/foodcourt, they have a jukebox in there. Can't remember the name of the dish (spanish name), but the dish has chicken&veggies in a tomatoey sauce on top of fried plantains. Oh my god it was delicious! We had it for lunch and dinner! Their papaya shake is also good. If you take a 15 minute walk, you'll reach a stretch of hotels lining the bay. They have a casino there, and also a noodle soup place! There are no nightclubs by the hotel, so it's pretty quiet at night. Breakfast is free, it's located in the tiny restaurant in the hotel lobby. Not that much variety though; pastries, fruit, cookies, coffee, tea, juice. For guests leaving for the cruise, they can check out 2pm. We decided to check out 11:30am and head to the cruise port. A lot of people were already there lining up to get on the ship. So it's not too early if you're wondering. I highly recommend this hotel, especially for people that will be hoping on the Royal Caribbean cruise ships. Also Princess cruise ships were at that port too. There are two cruise ports/terminals, one is at Old San Juan, and one is on the other side of the bay; Pan American Pier. Royal Caribbean uses Pan American Pier. This hotel is not for you if you want historic architecture, fancy shops and nightclubs. There were none of that around us.", "Date": "May 15, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Sleep Quality": "5", "Rooms": "5", "Location": "3"}, "AuthorLocation": "Red Lion, Pennsylvania", "Title": "“Good place - Bad parking”", "Author": "confam", "ReviewID": "UR63837702", "Content": "The hotel was great, Dont plan on having a parking space but they will take care of your car. Nice complementary breakfast. Should have fresh fruit.", "Date": "May 11, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "St. Petersburg, Florida", "Title": "“Great Staff and Nice Hotel!”", "Author": "jaw0808", "ReviewID": "UR63428102", "Content": "Just got back from Puerto Rico and the Hotel Miramar! I had a fabulous time! The hotel was nice and clean, the room was a nice size and the microwave and fridge were great. The beds were hard but I like it that way. There was a hair dryer in the bathroom and an iron and ironing board. The complementary breakfast was enough but if you wanted more the omelets was very good for about $6. The sun deck had just the right amount of breeze! The staff was the best. They took care of our every need from allowing us to check in early, late check out, helping us with tours and directions, suggestions from where to eat and what to do. They welcomed us “home” when ever we saw them. It felt like we were friends and they cared about us! If I find myself in Puerto Rico again I hope Sylvia, Samuel and the rest of the Hotel Miramar staff will be there to greet me when I get there!!", "Date": "May 6, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "3.0", "Value": "4", "Sleep Quality": "1", "Rooms": "2", "Location": "2"}, "AuthorLocation": "Redmond, WA", "Title": "“Good value, but better ones exist”", "Author": "Elvenfair", "ReviewID": "UR61789471", "Content": "Definitely in an out-of-the-way place, but the taxi from the airport took us straight there without getting lost ($15 for 2 people + $1/bag + $1 for being after 10pm). We arrived late but the friendly front desk clerk directed us to Los Pinos café is not even two blocks away and serves good food at reasonable prices. (Try the “fried riped plantains” — looks and tastes a little like banana, with a texture something like French fries.) The hotel room was plenty large, with lots of drawers to use, a closet, a fridge and a microwave. The bathroom was not big enough for two at once unless one was in the shower. :) Everything was acceptably clean, albeit not new, but then, this isn’t a resort hotel. Unfortunately, the room is wide, rather than deep. In most hotels you walk in and the bathroom and the closet come first, then the main area — separates you from hallway noise a little bit. Here, you walk directly into the main area, with the bathroom and closet off to the left. Hence you can hear every sound in the hallway, every door slam, ever conversation in the hall, every husband pounding on the door to get the attention of the wife who’s in the bathroom… No street noise, though. :) The bed is hard as a rock and so are the pillows (though I happen to like hard pillows). The neighbors behind our heads were tossing and turning at occasional intervals throughout the night, not that I can blame them, but it caused a squeaking sound in our room for some reason, so that kept us awake too. The continental breakfast defines minimal — some small pastries, white toast, fruit (which was gone by the last half hour when we got down there), and supposedly cereal upon request. We paid $170 (including the exorbitant 20% tax on all San Juan hotels), and found out that someone else got the Caribe Hilton for $90 for the same night through Priceline. That’s a last-minute deal you can’t count on, but all things considered I’d have rather had a softer bed and guaranteed sleep.", "Date": "April 18, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Delaware", "Title": "“Fantastic front desk, great value”", "Author": "supersew", "ReviewID": "UR60696393", "Content": "The front desk, Juan and his assistant were so warm and wonderful to everyone. They really made us feel welcome and were helpful in every way. The building is quaint and just right for a smaller hotel. There is a grocery store a block away and a few little cafes with very good food. The hotel offers a nice breakfast with the room in a nice dining area. There is a nice quite computer room with a lovely lounge arera. Also, there is a sun deck and laundry machines available. The room had a microwave and refrigerator. Very clean room and hotel. You can ride the local bus into Old San Juan for just .75. There is a small beach across from the hotel. We would definitely stay there again and recommend it to our friends. Thank you, Juan, for taking your time with all of your guests. :~)", "Date": "April 7, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "oxnard, CA", "Title": "“Hotel Miramar was wonderful!”", "Author": "greattrip42", "ReviewID": "UR60586368", "Content": "This is just a wonderful place to stay. You can get to any destination easily either on the bus or by taxi. We did not rent a car so we traveled by bus the whole time we were there for .50 cents a ride. We arrived at the Hotel early but were still able to check in and were also given all the information we needed to direct us to all the great places we could want to visit. The staff was fantastic and so friendly and gracious. The room was great and very comfortable and clean. Continental breakfast was very good and more than I needed in the morning. During my stay there I had a personal crisis and the staff there attended to me with the most wonderful kindness and caring. I will come back again and again and suggest you try it too!", "Date": "April 6, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "3"}, "AuthorLocation": "New Jersey", "Title": "“Nice hotel to use before a cruise”", "Author": "nanshoe", "ReviewID": "UR60012616", "Content": "Stayed for 2 nights before cruise and staff was great with directions, nice little bar and restaurant on site. No pool but just 10 minutes in cab from Old San Juan and close to airport and pier. Quiet, clean and a great price per night. Great restaurant called La Casita - make right out of hotel then next right - up the street on left side at end of the block --opens at 6 each night. Authentic food and great staff.", "Date": "March 31, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "4"}, "AuthorLocation": "Miami, FL", "Title": "“Nice hotel with wonderful staff”", "Author": "rosjest", "ReviewID": "UR59386940", "Content": "We stayed at Hotel Miramar for one night during the weekend. We ended up arriving in San Juan much earlier in the day than anticipated and absolutely exhausted, so we decided to stop by the hotel and see if there was any chance of checking in early. It was about 8 in the morning, and I'm sure that Sylvia, the wonderful woman at the front desk, was very surprised to see us showing up that early to find out about checking in. Although the normal check-in time is much later, she was a great help and was able to get one of the rooms cleaned for us right away when the housekeeping staff came in. We were checked into a room and able to crash within an hour, and words can't express how grateful we were to her. In addition to the very caring and helpful staff, the hotel itself is quite nice. The rooms are large, clean, and nicely furnished. While the complimentary breakfast is not extensive, you can request for cereal, toast, etc. in addition to the fruit and pastries that they have available. There is also a small workout room on the top floor with the basic necessary equipment. The hotel is very conveniently located for heading into Old San Juan, the bus stop is directly across the street. Depending on the bus route, it's about 50 or 75 cents a person. We were sad we couldn't stay another night, and will definitely be back the next time we are in San Juan.", "Date": "March 23, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Orlando, FL", "Title": "“Pleasantly surprised by quality personal service and accomodations.”", "Author": "jjhukill", "ReviewID": "UR58743811", "Content": "We stayed in Hotel Miramar March 14, 2010. It was a quality stay, all things considered. Located just on the mainland, it is a short 10 minute cab ride from the center of Old San Juan. The room was clean, quiet, and large enough for our party of four to hang out in during the day. The price was very competitive compared to other hotels nearby. The staff was helpful and accommodated our request for an early check-in. The man behind the counter even walked down the block to find a taxi for us upon check-out. Friendly staff, clean and roomy accommodations, competitive price..you really can't beat it. Recommended!", "Date": "March 16, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Henniker NH", "Title": "“Great find!”", "Author": "Trinketlady", "ReviewID": "UR57973327", "Content": "What a great place. Rooms were very clean and roomy. There was a workout room and a laundry room! It is walking distance from the beach and the Condado resort area. The employees are very friendly and helpful. They really make you feel at home. The rooftop deck has great views. Great little local restaurants across the street. The bus stop is right there and takes you right to Old San Juan. We will definitely be going back", "Date": "March 7, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Buffalo, NY", "Title": "“Personal service in a friendly hotel...”", "Author": "Buffalo_NYMeesha", "ReviewID": "UR57779575", "Content": "We have just returned from a week's stay at the Miramar. Our room was wonderful with a micro and refrig that we used alot. I requested a quiet room and it was perfect. It is indeed easy to get to Old San Juan from here via bus. Sylvia and her staff were most friendly and helpful and PERSONAL. It was not the feeling of a big resort. A car is needed for most other sites(rainforest, ferry, etc.) and Sylvia helped us get one when their availability was tight. The neighboorhood seemed safe and the proximity to a grocery store was helpful. I can't say enough about the staff.", "Date": "March 5, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "3.0", "Value": "3", "Sleep Quality": "3", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Christiansted, St. Croix", "Title": "“Convenient location”", "Author": "travelerSt_Croix", "ReviewID": "UR57575113", "Content": "Located about 5 minutes from Old SanJuan by bus, this hotel is located in the center of some of the highest rated restaurants in San Juan. The bus cost is just $.50/person each way, or $1.00/day /person. A great deal for convenience and ease of travel! We covered the Old San Juan area from El Moro to Ben and Jerry's from the free trolley which picked us up at the bus station, a nice way to orient oneself to the area before setting out on foot! . This was a perfect getaway for a long weekend. The inhouse restaurant is the best value and quality in the area, it is called 606.", "Date": "March 2, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "3.0", "Value": "4", "Sleep Quality": "4", "Rooms": "4", "Location": "2"}, "AuthorLocation": "Asheville NC", "Title": "“older hotel, but nice, watch how much you pay”", "Author": "BobAshevillenc", "ReviewID": "UR56343336", "Content": "In doing my planing for the trip I always check the reviews and several sites for price. This hotel was $30 more on some sites. I just wanted a place so I could get to know San Juan not a resort. This hotel has some charm, clean, and the sevice very good. No pool, and the beach is a 15 min walk. But the rooms are large with a refig and microwave and a flat screen TV. They have a free continental breakfast and internet in all rooms. The staff was great told you where the bus stop ( right across the street) was and tips on where to go. There is a grocery store 1 block away and some places to eat . They have a roof top sun deck which is grat at night.", "Date": "February 18, 2010"}, {"Ratings": {"Service": "1", "Cleanliness": "3", "Overall": "1.0", "Value": "3", "Location": "3", "Rooms": "3"}, "AuthorLocation": "Miami Beach", "Title": "“Adequate until the very end”", "Author": "coffeespoons8", "ReviewID": "UR56143280", "Content": "This is a pretty basic hotel. It's clean, does not smell bad, and the rooms have the basic amenities anyone would need: hair dryer, iron, ironing board, security safe, and most importantly, air-conditioning! The room we stayed in (7th floor) had a decent enough bathroom. My one complaint with regard to the bathroom is that the hot water would run out at the end of my shower (and I don't take very long showers). So if you're someone who does take long showers, be prepared to be a little cold toward the end. The rest of the hotel is not bad, either. The rooftop deck is actually quite nice and affords a great view of the city. The breeze up there is heavenly. Also, there is a little restaurant/bistro bar right when you walk into the hotel - this is where they serve the continental breakfast and then later some cocktails and food. We did not really try out the breakdast and only had some coffee and juice one morning, but it looked like it consisted mainly of some fruit, pastries, coffee and juice. The hotel does have a pared down version of room service. We did not try this out, either - really, if you are in San Juan, there are much better places to eat other than your hotel, no matter where you stay. I do have to mention that the location of this hotel is ideal to getting into Old San Juan - there is a bus stop right across the street that only costs $0.75 and takes you right into OSJ. Doesn't get much more convenient than that. Keep in mind that taxis in this city are a bit on the pricy side. As for the staff, they were generally friendly and helpful, particularly the housekeeping staff. However, I have to mention an incredibly uncomfortable incident that overshadowed everything good that I just said about this place. The morning that we were checking out, one of the male front desk employees (I don't know if he was the manager or not) was incredibly rude to a female guest and her husband. I really can't say I know what had transpired before my boyfriend and I got downstairs, but all I know is that we inadvertently found ourselves in the middle of a screamfest of epic proportions. First, the rude hotel guy berated another employee in front of the guests - a HUGE no-no. Then, he said something to the lady about her bill. Granted, the lady was not the most polite of persons, but her response to his inquiry really was not that rude and did not necessitate his outrageous reaction - all he did was escalate the situation. He literally yelled at her to \"SHUT UP!\" about three times, and obviously the woman was becoming more agitated as well and responded in kind. This went on for a few minutes - yelling...no, screaming back and forth - until this guy tells this woman and her husband that he did not need their money and that he wanted them out of his hotel and that he was going to call the police. He also told them a few times that \"this is NOT the United States! This is Puerto Rico!\" and kept yelling at the woman, \"WHO DO YOU THINK YOU ARE!?\" He literally kicked them out of the hotel - my boyfriend and I walked to a nearby supermarket to get some change for the bus, and when we walked back to the bus stop, the couple was outside on the curb, in front of the hotel. The whole thing was unlike anything I'd ever witnessed before and honestly, was one of the most uncomfortable experiences I've ever had while traveling. The hotel guy, no matter WHAT the woman was doing or had said, should never have reacted the way that he did or said the things he said (in the volume in which he said them). In the hospitality industry (I know because my father has been in the hospitality industry for almost thirty years), there is simply NO EXCUSE WHATSOEVER for this type of rudeness and behavior. It is baffling to me that this man had the gall to treat a customer - any customer - in such a way. IN FRONT OF OTHER CUSTOMERS. Simply inexcusable. This hotel may be adequate in every other way, but someone get this man to an anger management class or in another industry pronto. He should know that word gets around. In short - don't stay here. For any reason.", "Date": "February 16, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Sleep Quality": "5", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Michigan", "Title": "“Very GoodValue”", "Author": "looncalls", "ReviewID": "UR55568855", "Content": "If you're looking for a hotel that is reasonably priced, has very good service, and the rooms are comfortable and clean, this is a very good choice. There is a small bar and restaurant on site and the food and drinks are excellent. There is a great new restaurant around the corner called \"La Casita.\" We were only in San Juan 3 nights before our cruise but wound up eating there twice. It was recommended by the hotel desk clerk. The 8th floor rooftop has tables for outdoor cocktails (bring your own up to the roof) with a very pleasant view toward Condado and the ocean. You do have to walk up stairs from the 7th floor to get to it, however. It's a 75 cent ten minute bus ride to Old San Juan from the hotel.", "Date": "February 9, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "2", "Location": "2", "Rooms": "3"}, "AuthorLocation": "Iowa", "Title": "“Pretty good hotel”", "Author": "praise_5", "ReviewID": "UR54624402", "Content": "We went to Puerto to catch a Carnival Cruise.This was a pretty decent hotel considering some of the others we had seen. The room I had requested was 2 queen beds but we only got one king, and with 3 children two had to sleep on the floor. The room was really clean but was outdated. The hotel staff were really nice and helpful and the continental breakfast was pretty good. The only problem was the location,there were hardly any resturants around and it was far from the airport and the cruise port. We had to take a bus to go downtown and a Taxi to go to the cruise port and they were scary. We had a crazy guy trying to tell us to get on the wrong bus, I think he was going to lead us to a bad part of town and jump us, luckily I asked the bus driver to tell us the right way. Everyone drive crazy there!! I can't say I would every go back to Puerto Rico, it wasn't a pleasant experience!!", "Date": "January 28, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Location": "4", "Rooms": "4"}, "AuthorLocation": "Sweden", "Title": "“Nice stay at a pre-cruise hotel”", "Author": "Nic-Sweden", "ReviewID": "UR53886539", "Content": "We were stay two days at Miramar before cruising with RCCL. We arrived in the evening and we were from the beginning well taken care of. The room was quite big, clean and the standard was ok. The location was very good, about 15-20 min from the airport and about 10 min to the port. The are a very nice supermarket very close to the hotel that you shop whatever you want.The bus stopped right outside and there were taxis waiting to. What I think is great is that all the fares with taxis are already set so there is no confusion what it costs. We paid US 15 from the airport and 1USD a bag, and I think 1-2USD because we travelled in the evening. At the pier it cost about 12 USD. The breakfast is the thing that I think could have been better. Im not really used to this breakfast which was included like pastries, toast, jams etc and if you wanted something else you have to pay for it. We were hungry within 1 hour, so we have to buy something outside. I really recommend to visit Plaza Las Americas, the largest shopping mall in the Caribbean with 3 floors. A lot of stores, restaurants etc. Just a trip with taxi 12 USD. Don´t miss that! To summarize; Nice stay for this price, very good location and the breakfast could have been little better", "Date": "January 19, 2010"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "minnesota", "Title": "“Very friendly service, clean, and on the bus route to Old San Juan”", "Author": "jilly-0", "ReviewID": "UR52761471", "Content": "Very friendly service, clean, and quick to Old San Juan on the bus.", "Date": "January 6, 2010"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "3", "Location": "4", "Rooms": "3"}, "AuthorLocation": "Manchester, UK", "Title": "“A good San Juan hotel, a reviewer who has stayed at 4 hotels in the area!”", "Author": "Ange_from_cheshire", "ReviewID": "UR52337068", "Content": "Attentive staff, clean throughout. We stayed in a nice, large room albeit with an outdated 1970s bathroom suite. Location is good for old san juan as you can get a bus from just outside the hotel and in just under 10 mins for 50-75 cents per person each way you can be at the port docks. However, be warned that taxis are expensive here and you will pay a minimum of 14 dollars to the hotel from old san juan (only a few miles, worst, very worst, 4 miles).", "Date": "January 1, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Location": "4", "Rooms": "4"}, "AuthorLocation": "Chicago, IL", "Title": "“We were happy here”", "Author": "Starshark10", "ReviewID": "UR52108182", "Content": "This hotel was okay. The room was nice and cool and just a $15 cab ride from Old San Juan. The bathrooms were a little outdated but overall we were happy with the location and value. We moved to this hotel from the Courtyard Marriott where our credit card got skimmed by the hotel staff so anything would be better than that!", "Date": "December 29, 2009"}, {"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Location": "1", "Rooms": "1"}, "AuthorLocation": "Toronto", "Title": "“Do not even think about this one!!! u´ll be on the street!!!!”", "Author": "v_chau_001", "ReviewID": "UR50378138", "Content": "A total og 9 friends, we make reservations for 5 rooms with same credit card, we arrived at different times and for the last 2 couples they just throw them to the street. They even lie about the credit card not beein ok with out having an explication on how come the other 3 rooms worked ok with same reservation and same credit card!!!! The guy at the front desk had no decision or problem solving skills, he just said we are full, they sugested a near by hotel, but this Hotel could not even pay for the TAXI, wichi is 15us for a 5k ride!!!! They do not even have any way to contact the manager who left the place before 4pm!!!! Its the worst hotel I been at and Puertoricans have no sence of customer service or problem solving!!!! evrything they see is how to get your US caring less for anything else. My recomendation travel to Mayan RIVERA, they know how to treat turist and the sites way better than here!!! we are Canadians and hopfuly we do not get back EVER to this joke of hotel call MARIMAR at San Juan puertorico..... finally the hotel looks like no body spend a cent in maintenance for the last 5 years, the hotels at Cuba are even better than this one!!!", "Date": "November 30, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Location": "4", "Rooms": "4"}, "AuthorLocation": "Ohio", "Title": "“Delightful Visit!”", "Author": "dhstas", "ReviewID": "UR50036456", "Content": "Very pleasant accommodations, large bright clean room. Delightful, friendly, and helpful staff (Sylvia was particularly pleasant and helpful). Property is very well maintained by a very dedicated staff. We couldn't have been more pleased.", "Date": "November 25, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Location": "5", "Rooms": "4"}, "AuthorLocation": "", "Title": "“Good value for the location”", "Author": "Sueedgington", "ReviewID": "UR49763072", "Content": "Our room was large, clean, comfortable, and met our needs just fine. We wanted a reasonable place to stay that was close to Isla Grande Airport, shopping and restaurants. The owner and staff were very friendly and helpful. There is a large grocery store nearby and we had taxi drivers waiting without having to call. We would definitely stay there again.", "Date": "November 21, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "St. Croix, USVI", "Title": "“Juan and his Staff - Simply the Best”", "Author": "CaribPilot", "ReviewID": "UR49241035", "Content": "My name is Erick M, and I'm a new pilot to the Caribbean, and will be traveling to many different locations on a regular basis. My hotel experience in San Juan was with Juan and his staff at Hotel Miramar. I had a wonderful evening, as the rooms, the lobby downstairs, and the friendliness of the staff is better than any hotel I have experienced. Their breakfast of fruit, breads, and cereals in the morning is great, and the dinner menu/bar prices aren't bad at all if you are looking to dine in at the hotel for an evening. I'm sure that I will, as a pilot, have to return to San Juan on a number of occasions, and if I do, I will always have the request from my clients to stay at Hotel Miramar. Cheers to Juan and his great group of staff members for such a lovely hotel. See you again soon!", "Date": "November 15, 2009"}, {"Ratings": {"Service": "1", "Cleanliness": "2", "Overall": "1.0", "Value": "1", "Location": "3", "Rooms": "1"}, "AuthorLocation": "St.John's", "Title": "“Horror”", "Author": "pharmadine", "ReviewID": "UR48438377", "Content": "My parents, sister and me stayed at this hotel last weekend and our experience was awful. First of all, for a hotel that is nothing close to a five star rating the rooms were way too expensive. We had one room for all four of us and it was certainly not great. We were charged for the four of us being in there and spent almost $360 for two nights. If it were up to me we would not have stayed there but my mother has been staying there for years and she is set in her ways. I checked and we could have stayed at Coral by the Sea, Comfort Inn, Coqui Inn or Howard Johnson for less than this. The price really bothered me but I decided to chill out and accomodate my family. Next, the room smelled moldy. Rooms should have proper ventilation and smell fresh. They advertised complimentary breakfast which we were told we could have and this was nothing much really and the gymn they advertised was a run down room with poorventilation on the 8th floor. Barey any of the equipment worked. Sunday morning wasthehighlight of the trip. We decided to pack a barrel and we were told by a receptionist that the barrel came and we could pack it. We were never told that we should have packed it downstairs so we took it to our room and packed it there.Sunday morning while my father and I were transporting the barrel downstairs, the hotel manager came screaming at us in an insulting manner and said we were damaging his new carpet and we should have used logic to realise we are not supposed to bring the barrel upstairs. Had we known this information first hand we would not have brought the barrel upstairs and none of the staff said anything about this to us. The annoying thing was the fact that the so called manager was insulting us and telling us we should have used logic i.e we are stupid. My father and I let him have it right on spot. I told him he was stupid and he has no right speaking to us in that tone. I also told him that we would never stay at his hotel again. As for the carpet, I asked him if it looked anywhere close to damaged. We used the smooth part of the barrel to turn it and if we saw a problem we would have asked for help. The manager was told that we would never stay at his hotel again and he replied \"good\"which means he has no remorse or shame for his stupid behavior. His behavior reflected poor judgment, poor managerial skills, poor customer serviceand overall stupidity and he was told this by my father and me. If youy are paying your money especially over $350 for two nights good service and high quality is expected all around. This hotel had none of that and is not on my list of recommendations. When I went back to work today I spoke with one of my colleagues and she said she didn't like that hotel. I wish she had told me sooner. I don't knowhow this hotel received a reward but the manager needs to go ASAP. Even though they spent money to upgrade it over the past few years they still have far to go to become a five star. I was so angry on Sunday that I was close to bursting. Don't stay here.", "Date": "November 3, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Long Beach, CA", "Title": "“A Great Find”", "Author": "DaveLongBeach_CA", "ReviewID": "UR48351530", "Content": "My wife and I stayed at this hotel the night before our cruise departure and again the night after arriving back in San Juan. A totally pleasant experience, and we are recommeding this hotel to all of our friends who will be visiting San Juan. This Hotel is quiet, the staff is pleasant and the rooms are fantastic for the price. We are looking forwarding to staying here on our next cruise from San Juan in 2010.", "Date": "November 2, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Location": "5", "Rooms": "4"}, "AuthorLocation": "Boston, MA", "Title": "“Very clean room with very friendly & helpful staff”", "Author": "sci_biz_traveler", "ReviewID": "UR48334534", "Content": "Stayed at Hotel Miramar because it was the least expensive one that was closest to the Puerto Rico Convention Center. The room was equipped with a queen size bed, night stands, desk, chair, microwave, refirg., combination safe, big closet, lg screen TV in a dresser, and free WiFi. The bathroom was small but spotless. This is not the most modern hotel but the staff was incredibly helpful and friendly and every one of them greeted all the guest with a smile and a \"Hello\". A continental breakfast of juice, toast, rolls, coffee, and pastry was included. Again, not the most modern but was incredibly clean. This is a great deal for a nice room compared to other in the area.", "Date": "November 2, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Bay Islands", "Title": "“Look no further, this is the hotel”", "Author": "utilaguy", "ReviewID": "UR48039189", "Content": "We had two rooms for two nights on our way to a wedding. We were perfectly happy with our stay....staff was GREAT, especially Sylvia. Clean rooms, parking for our rental car, good breakfast, good location for sight seeing.", "Date": "October 29, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Location": "3", "Rooms": "2"}, "AuthorLocation": "Jacksonville, FL", "Title": "“Great staff old hotel sloooowwwww elevator”", "Author": "figment7", "ReviewID": "UR47750844", "Content": "Stayed at Hotel Miramar for one night before a cruise. My extended family had about 7 rooms booked. The hotel is in a nice area with a grocery store less than a block away where you can get any items you may need. The room was nice size with a nice flat screen TV but the bathroom is where the updating needs to be done. The bathrooms were small and also quite a few of the rooms shower did not drain resulting in your standing in a pool of water at the end of the shower. After my wife showered it took over 30 minutes for the shower to drain and I ended up using my parents room to shower since their drain didn't clog. The elevator is very slow and very old. The maximum people you can put on the elevator is 4 and it takes forever to serve the entire hotel and is overwhelmed. The breakfast was a joke, evidentally they had a large group show up the day before a day early (60 people). Well that day they ran out of food and warned us, instead of I guess buying more food the following day to not repeat the same problem the next day it happened again. I went down at 8:10 (breakfast opens at 8am) and there was 1 muffin left on the muffin tray. Overall great staff just an old hotel in need of some changes that would make it a nice hotel.", "Date": "October 26, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Location": "3", "Rooms": "4"}, "AuthorLocation": "New York City, New York", "Title": "“Great value”", "Author": "roby2000", "ReviewID": "UR47321176", "Content": "Nice large room, spotless. Everthing was new. Not too close to everything and only a few parking places. But valet parking is provided free. Has fridge, micro and wifi. Staff was very nice and the $5 margaritas were awesome. No need to take the car to Old San Juan, bus across the street for 50 cents. Nice Continental b'fast with some real good miniature pastries. No view, but a nice room to be in. Also had a safe to keep the netbook in.", "Date": "October 20, 2009"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Overall": "2.0", "Value": "2", "Location": "1", "Rooms": "2"}, "AuthorLocation": "NJ", "Title": "“Off the beaten track and somewhat rundown”", "Author": "LSS33", "ReviewID": "UR46267686", "Content": "If you don't mind not being anywhere near the beach, and being in a scary neighborhood; then this is the place for you. For the moderate cost, it's pretty clean but offers no amenities. The rooftop sundeck has nowhere to even rinse yourself off while sweating in the sun. The continental breakfast was totally disgusting; better off skipping it. Would never return to this place.", "Date": "October 8, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Lawrenceville, GA", "Title": "“Very happy”", "Author": "Busygeorgiafam", "ReviewID": "UR45357658", "Content": "My husband and I had to travel for one week to PR to take care of some family issues and pick up some things we'd left since we moved to the states. From the moment we walked in we were greeted with big smile by Sylvia who was great. We were very happy with our room as well and the fact that because the hotel is small, there's more personal attention. All the staff was great and friendly especially Miguel who went out of his way to even drop off a package for us at the post office. The sun deck had a great view and would've been great for tanning, if we'd had the time. It was quiet but yet very accessible to all of the centric areas for night life. The only thing we would've wanted was more variety for the continental breakfast but the breakfast we did pay for was great. My husband and I both agree we will be there again for our next getaway and even plan on taking the kids.", "Date": "September 28, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "3.0", "Value": "3", "Location": "5", "Rooms": "5"}, "AuthorLocation": "New York", "Title": "“Hadicap”", "Author": "jungleboy0123", "ReviewID": "UR44566505", "Content": "I want to thank Jose for helping me to get around and meeting my needs. Where there was a possibility that I was going to have a difficult stay because of my Handicap, Jose made it possible for to make my stay a remember one. What ever I needed he was there to prvide what was needed to make my stay comfortable. Thank You Jose! Hotel Miramar-San Juan 606 Ponce De Leon Ave. 10:29pm", "Date": "September 25, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Location": "4", "Rooms": "4"}, "AuthorLocation": "South Bend, IN", "Title": "“Great customer service!!!!!!”", "Author": "KmbrClen", "ReviewID": "UR44531440", "Content": "My stay in Puerto Rico would not have been the same if we had not stayed at the Hotel Miramar and met Jose (the front desk clerk). He went above and beyond the call of duty. He helped us to rent a car, told of some of the best places to visit while in San Juan and the surrounding area, good places to eat and some of the night life. Our stay would not have been the same without Jose and his love of the job and the island.", "Date": "September 25, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Location": "3", "Rooms": "5"}, "AuthorLocation": "houston,tx", "Title": "“great service”", "Author": "yugogirlr", "ReviewID": "UR44463292", "Content": "my stay at the Miramar,with the exception of the bed,was great. All the staff was friendly and helpful. Bus stop across the street and just a 10 minute ride to Old San Juan. The negative was an extremly hard bed and an over priced restaurant. Never saw anyone in the restaurant except for free breakfast. Should change the concept.", "Date": "September 25, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Aruba", "Title": "“Greattttt hotel and staff!!!”", "Author": "AnitaAruba", "ReviewID": "UR41706764", "Content": "I arrive Sept. 10th till Sept. 15th, my experience with this is hotel is great and they have a very nice staff: Omar/Osvaldo/Silvia/Miguel and Jose. They made me feel home and welcomed me very much. A special thank to Jose: I like to thank you so much for your help and all good information that you've gave me, you were so nice to me and helpfull, you took all your time to listen and explain me everything. I felt so compfortable with you, you are a great friend Jose, and I will miss you for sure. Because of all of you, I will come back to your hotel. I had also a great time in PR. it's a nice Island, people are so friendly. I have enjoyed my stay very much in PR. and Hotel Miramar. Love you all and thank you!!! Nita. (Aruba).", "Date": "September 14, 2009"}, {"Ratings": {"Service": "2", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Location": "1", "Rooms": "1"}, "AuthorLocation": "Broadbeach, Australia", "Title": "“Would not go back”", "Author": "Thetravelpair", "ReviewID": "UR37739594", "Content": "This hotel was a waste of money. Old rooms, dirty towels, misplacing reservations. This place took forever to find. There are only 3 parking spaces available, there are many drunk homeless people as soon as you step out of the hotel, and the continental breakfast was consist of cereal, bread, and juice.", "Date": "August 15, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Location": "3", "Rooms": "4"}, "AuthorLocation": "San Francisco, California", "Title": "“the Miramar”", "Author": "travelapple", "ReviewID": "UR37298628", "Content": "our experience was great at the Miramar, 2 adults 1 teenager we had a top floor room that was large enough for us all not to fell cramped! the staff was helpful and firendly. we did walk over to the Conado beach area without problems, but for Old San Juan take the bus or rent a car ( we did both with no problem ) All in all we had a pleasant stay at the hotel and love Puerto Rico! Nice back lobby with birds and Internet if you dont have your own computer with you.", "Date": "August 10, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "3.0", "Value": "2", "Location": "3", "Rooms": "3"}, "AuthorLocation": "mapesae", "Title": "“Very friendly, helpful staff...hotel was average.”", "Author": "mapesae", "ReviewID": "UR33413083", "Content": "The hotel was decent. It was clean, friendly staff, offered a continental breakfast. There were several restaurants and a grocery store in the immediate area, and the bus stop is right across the street to get to Old San Juan ($.50.) If you take a cab it's $14 for a 3 minute ride. The hotel was clean, decent decor, had a restaurant, rooftop area, business center and a fitness center. I think the cost could be a little lower for what it offers, but I would recommend it to people who are trying to stick to a budget.", "Date": "June 28, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Location": "4", "Rooms": "4"}, "AuthorLocation": "Brisbane, Australia", "Title": "“Friendly hotel in a great location”", "Author": "BrisMac", "ReviewID": "UR30891563", "Content": "We stayed for 2 nights before boarding a cruise ship. The room was large, clean and quite. It had a fridge, but did not have coffee/tea making facilities. All the staff, in particular Sylvia, were extremly friendly and more than happy to assist with any enquire. There is no need for a car if staying in the city, as public transport is regular and cheap. There is a bus stop across the road from the hotel and a supermarket one block away. A great location for sightseeing as it is a short trip by bus to the Old Town. Once in the Old Town, there is a free bus service that takes you around the town and to the Fort. It's a hop-on-hop-off service.", "Date": "May 27, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "4"}, "AuthorLocation": "canada", "Title": "“Excellent Experience”", "Author": "prairieflowerCanada", "ReviewID": "UR30474051", "Content": "Having read reviews on Trip Advisor about this hotel we booked and were not disappointed. Hotel staff were great, even giving tips on nearby grocery store. The breakfast is very continental but sufficient for getting the day started and then if you wish more you can always order from the menu. The hotel is old and therefore has been renovated so does not have the shiny look of the Hilton however the ambience is great for the area. A taxi to the cruise port is only about $20.00 and also to the airport. There is a small area for parking behind the hotel but it is free. We went to the grocery store and purchased a chicken and some pita bread and were able to pack a lunch for the 7 hr flight back to the states which made the flight a lot more enjoyable, not having to purchase less than fresh $7.00 sandwiches and stale snacks. If you want internet, you need to ask the front desk to hook you up. There is a fitness/pool on the 5th floor which we did not use but is available.", "Date": "May 21, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Summerton, SC", "Title": "“WE LOVED THE HOTEL MIRAMAR, GREAT PLACE, STAFF, FOOD & SERVICE”", "Author": "Magnolia10", "ReviewID": "UR29390158", "Content": "We usually stay at the beach when we make our trips to San Juan. This trip, we decided to stay off the beach and closer to our meetings. We weren't sure what to expect, but... WOW ... Hotel Miramar was a wonderful surprise. From check in to check out, the staff was warm and helpful. The room and hotel were spotless and the food in the restaurant and room service was great! It ended up costing us about a third of what we usually pay when we stay on the beach. Keep up the great work, we are coming back soon!", "Date": "May 5, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "4", "Rooms": "5"}, "AuthorLocation": "Miami, Florida", "Title": "“Great service and location”", "Author": "plostaunau", "ReviewID": "UR29110892", "Content": "I had a great experience at the Miramar Hotel, it was very close to everything , walking distance and we were able to take a bus from hotel to Isla Verde, very unexpensive way to do it now. Then we were able to go to a great peruvian restaurant \"Lima\" next to the hotel. The service at the hotel was great and I really enjoy all the people. I would stay again with them", "Date": "April 30, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Los Angeles", "Title": "“Great Value and Location was fantastic”", "Author": "Yoli18", "ReviewID": "UR28594018", "Content": "I was very surprised to receive the kind of service I had at the Miramar Hotel. The rooms are very big and very clean,. I got wireless for free, and I was able to do a little bit of work while enjoying the nightlife in San Juan at a very moderate price. Dinner was very good and affordable for me.", "Date": "April 23, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "5", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Dayton", "Title": "“The Best Place To Stay In Puerto Rico - Where service counts!!!!!”", "Author": "TroySly", "ReviewID": "UR28173768", "Content": "When I arrived I was greeted and helped out in a timely manner!!!! I never thought the employees would help me find so much hope in the city!!!! This was my first time ever on the Island!!!! When I Checked In I was Greeted By Madiam!!!! She was the life of my stay at the hotel!!!! She makes a mean cup of coffee!!!! Jessie was the graveyard shift!!!! She helped plan my evenings out after hours!!!! And when you didnt think you met alot of great employees, you have Araceli sneeking back behind the counter --- (when she was off) to help out in the office and she's great!!!! Christain was the topping of the cake!!!! All I can say is WOOF 2 him!!!!! If you think people can look great and help u out with your vacation ----- this is the definate spot to come too!!!!! Now also let me tell you about the Euro Bistro Bar & Grill ----- The Food Is Great & You Dont Have To Leave The Hotel To Eat A Great Meal!!!!!! Just believe me stay there at the hotel and have the time of your life!!!!!! Troy M W Sly", "Date": "April 16, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "3", "Location": "4", "Rooms": "5"}, "AuthorLocation": "boston", "Title": "“I love the Hotel Miramar and Sylvia!”", "Author": "pmonji", "ReviewID": "UR27863079", "Content": "We stayed at the Hotel Miramar for about 5 days and I was so pleased with our stay. Sylvia helped us everyday and every night find fun activities. Without her, we would have spent so much more money and would have been lost! The staff was so kind...we really couldn't have asked for a better vacation! Would go back immediately!", "Date": "April 12, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Location": "4", "Rooms": "3"}, "AuthorLocation": "Ottawa", "Title": "“Good location, good value, great service,”", "Author": "Avian44", "ReviewID": "UR27669198", "Content": "My wife and I stayed at this hotel for three days. It is an older building, but well maintained and with a pleasant ambiance and a nice ocean view from the terrace. The rates represented great value, and the Miramar location permitted very easy bus routing either to Old San Juan, or to Isla Verde (the best San Juan beaches). The staff were very friendly and accommodating; very willing to make schedule changes and provide useful information about how to see and dine in San Juan. We found it to be an excellent combination of comfort, convenience and economy and would certainly recommend it for those reasons.", "Date": "April 8, 2009"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Location": "3", "Rooms": "4"}, "AuthorLocation": "Florida", "Title": "“Not a bad choice if you want to stay in the city.”", "Author": "theyoungfamily4", "ReviewID": "UR26885694", "Content": "We booked our stay late and had trouble finding other hotel options in San Juan. Pleasantly surprised. Not a beach resort by any means but alright for in the middle of the city. We were able to take the bus into old Jan Suan city to walk and see the sights. The hotel desk lady was very nice and accommodating even though we arrivbed late at night. The rooms were fairly spacious and clean. The hotel is next to an abondonded building but we felt safe even walking at night. There is also a 24 dinner across the street which is nice if you arrive late or depart early. We have friends who have an infant and were checking in at the same time. They had not menitoned the baby earlier but the front desk lady quickly left her desk and set up the crib and bedding (happily). Dont' stay at this hotel for a week. But passing through San Juan for a night or two nights to explore the city you will find it workable and convienent. Do not stay here if you are expecting a resort or beach front hotel.", "Date": "March 26, 2009"}, {"Ratings": {"Overall": "1.0"}, "AuthorLocation": "New Jersey", "Title": "“NOT WELCOMING AT ALLLLLL!!!!! THe worse hotel Manager EVER!!!!”", "Author": "resse123", "ReviewID": "UR26737918", "Content": "I've read the reviews before the trip and I'm reading on my return. The Hotel is in a horrible location, in the middle of two abondoned facilities, a church and a building. Looking out the window from the hotel is like looking at the end of the world. The hotel is clean, However it should be your absolute last resort to rest your head for a night. The staff seemed welcoming, after they did not locate the reservations we made a month ahead. But then the manager and his wife were horrible to myself as, friends, his staff in front of our faces, and gave the worse Puerto Rico introduction. I will never advise anyone to stay here. Please do your research. This is not a vacation hotel, it does not even have a pool???????? Myself and friends work hard every day, and came to vacation in PR to have a good time, and for the manager to look down on us, speak as if we meant nothing, and didn't deserve his accomidation was totally wrong!!!!!!! Please I am very sure this isn't the vacation hotel. Me and freinds left the next morning and stayed at the beautiful Embassy Suites, now that is a hotel!!!!", "Date": "March 24, 2009"}, {"Ratings": {"Service": "4", "Cleanliness": "3", "Overall": "3.0", "Value": "3", "Location": "3", "Rooms": "3"}, "AuthorLocation": "DC Area", "Title": "“If I had booked further in advance I would have chosen another hotel”", "Author": "Budget_Traveler_007", "ReviewID": "UR26616387", "Content": "Let me clarify, Miramar isn't a bad hotel. Not by any means. But it cost $150/night after taxes (Friday night) - and we waited far too late to book so most hotels near San Juan were full. The hotel was clean, the location is not bad (parking is tough, but doable). You have to drive to Old San Juan and Condado... but there are a few restaurants within walking distance if you are just there for the night. The management was helpful enough and the room was okay (elevators really small and beds not that comfy.... but okay). Overall I'd say if you have no other choice you'd be fine here - but I'd opt for another hotel were I to go back. PS - the \"breakfast\" is a joke. It was bread and fruit and coffee.", "Date": "March 22, 2009"}, {"Ratings": {"Cleanliness": "3", "Overall": "2.0", "Rooms": "2", "Location": "1"}, "AuthorLocation": "Indiana", "Title": "“BEWARE of extra charges!”", "Author": "tiffstulips", "ReviewID": "UR25181262", "Content": "BEWARE of Hotel Miramar! Just back from 2/14 sailing on Serenade. Made reservations with Hotel Miramar on Ponce de Leon Avenue in San Juan about 3 months ago. We wanted to spend an extra day in San Juan before going on our cruise so the kids could see the town. Hotel reservations were made through an online booking company. During the online search I entered 2 adults and 3 children and their ages. It selects hotels avaliable for the criteria you enter. I booked Hotel Miramar and paid a small booking fee. I called 1 week before arrival to confirm the reservation. I told them I was making sure we had 2 double beds since we were traveling with 3 children. They assured me that was correct. Upon arrival the girl at the counter says you have 5 people? I said yes. she said our rooms are 4 people max. After making several calls to the owner she informed us we would have to rent 2 rooms. (by the way, the rooms were huge and the 2 double beds would have easily accomidiated our family.) We argued we had confirmed and had a print out of the online reservation and they simply blamed the online booking company. We waited about 2 hours in the lobby while trying to work out something. Finally we reluctantly agreed to rent 2 rooms for 2 nights but at $99 for the 2nd room we were being forced to rent. We paid the $472 for the rooms as we were exhausted and ready to get settled. The next evening the front desk girl approached my husband in the lobby and told him she made a mistake and forgot to charge us the 2nd night at $99 for the 2nd room and we would have to pay it at check-out in the morning. She was very apologetic stating she was only doing her job and what the owner was relaying to her. The next morning the owners wife was at the desk. She was quite harsh stating we would need to pay the extra night. My husband argued he had already paid above and beyond and it was not our fault the desk girl made a mistake. With a very bad taste in out mouth we paid the final $99 plus tax and informed her we would be posting this as a review with a warning for others. At the beginning of our vacation a hotel that should have cost us $322 ended up costing almost $600 and alot of stress! We also stayed at 2 other hotels over the vacation on Houston and Chicago and had no problem renting 1 room.", "Date": "February 26, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Rooms": "4", "Location": "4"}, "AuthorLocation": "Palm Springs, California", "Title": "“A SLEEPER and DIAMOND in the Ruff.”", "Author": "PSRIC", "ReviewID": "UR23537734", "Content": "Much to my surprise, this hotel was MUCH more than I had expected, considering I booked it as a part of a package DEAL. First of all, the staff couldnt have been nicer and more helpful. From the moment we arrived til the day of departure they knew our names and what room we were in and many of our interests. They knew all this because they took the time and interest to ASK. KUDOS to the \"manager\" SYLVIA...She constantly strove to make our stay one of excellence and confort. This is more of a \"boutique\" type hotel considering the number of rooms. The rooms were clean and kept tidy. The location is not all that bad and considering it is right on two main bus lines that go to Old San Juan, about 10 minutes bus ride...far eaisier than trying to drive and find parking in the touristy area. It is walking distance to another touristy area called the Condado, where more of the upscale hotels seem to be that were right on the beach. You have to check this one out for yourself. I would go back again and again. They treat you like family. ONE THING THOUGH...parking as in most other places in San Juan is at a minimum. The staff does try to accomodate parking with free on-street valet parking. The hotel itself has only I believe 5 parking spaces for guests. We did have a car for only a couple of days so it wasnt a major inconvenience. Thats pretty much it...I give it a thumbs up.", "Date": "January 13, 2009"}, {"Ratings": {"Service": "2", "Cleanliness": "2", "Business service (e.g., internet access)": "2", "Check in / front desk": "5", "Overall": "1.0", "Value": "1"}, "AuthorLocation": "atlanta", "Title": "“what a messy noisy place very difficult to find”", "Author": "wakas", "ReviewID": "UR23219331", "Content": "We took about 2 hrs looking for this hotel and its in a dingy side of town! In the process of getting lost we found ourselves in Old town, in cruise traffic and endless construction tunnels and bridges! finally from the parking lot of the hilton across the lagoon we see it lost in some other buildings! not what you see on the adverts! the young lady on duty at the front desk was very friendly but the older one either the manager or the owner was no rude and had no time really to attend to you. we got a room 201 which was so noisy the traffic the ac machine and we were moved to a smaller queiter 208. with a child we needed a microwave and had to practicaly move it for our selves! both rooms were clean and the showers too but the air was so stale the fan had to be on all the time! we spent 4 nights here but i would not return, i have stayed in better places for much less than what we paid for. and not forgetting the horrible continental breakfast, however the chef/attendant was so kind and helpful he made eating that junk fun he was from new york his english was great! in short was a terrible welcome to puerto rico i will return but not stay here.", "Date": "January 3, 2009"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Lima-Peru", "Title": "“the best personal”", "Author": "SpiderPeru", "ReviewID": "UR22545977", "Content": "The hotel is goog, the place is average of the city, but the personal of services is better that others. especially melissa, who is very nice.", "Date": "December 8, 2008"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "florida", "Title": "“Thank you Hotel Miramar staff!”", "Author": "laindiah", "ReviewID": "UR19994883", "Content": "just a thank you note for all the staff @ miramar hotel . my husband and i hade an emergency trip to pr and booked whith hotels.com from 08/29/08 till 09/01/08 .our room was 507 . liliana make sure we where conftable at all times. the custumer service that its offered in this hotel \"miramar\" its greatt! rated # 1.not enough parking.,but... when i couldn't park. the person @ the desk will take my keys and park my car for me. i felt secure there are cops out there in the street making sure that the turist are safe! once again thank you!", "Date": "September 11, 2008"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Check in / front desk": "2", "Overall": "2.0", "Value": "2", "Rooms": "3", "Location": "2"}, "AuthorLocation": "Florida", "Title": "“Miramar,s BLUFF”", "Author": "Floridatravelor08", "ReviewID": "UR17563685", "Content": "We booked with Hotwire and stayed for 8days. first thing no parking area ,very small ,best to park out in the street.even thou it didn,t feel safe.Room was o.k. have been in better. Didn,t like beeing in a 6th floor, elevator was to small kinda scary. breakfast go to MCDonalds. staff not to friendly. I still think i got overcharged. hotel was not worth it. would i recommend it NO I Don,t think so. No pool--and no view-- could have done better.", "Date": "July 5, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Business service (e.g., internet access)": "5", "Check in / front desk": "3", "Overall": "3.0", "Value": "3", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Houston, TX", "Title": "“It was decent”", "Author": "KandyKane056", "ReviewID": "UR16865228", "Content": "We got a good deal with Expedia airplane and hotel. I checked the reviews and it seemed OK. We couldn't complain the hotel room was spotless clean. Yes, it is old, i didn't smell any mold though but I noticed the carpet and the comforter were worn out. I liked the fact that we had a microwave and a mini fridge that we stock w drinks. Our cleaning lady was super nice, she always left our room clean, bring us fresh towels and ask us if we needed help. Same with reception. I could have pass on the breakfast though, the food not that good. It is continental breakfast, cereal and fruit and after a couple of days I was tired of it. To go to the beach or to Ashford St you have to walk like 10 min, not bad, a lot of people ( even locals) are walking out at night and we saw cops too. However you have to pass under a dark bridge though. Next time, I would choose a hotel in Isla Verde, the beach is WAY nicer than Condado.", "Date": "June 11, 2008"}, {"Ratings": {"Service": "3", "Cleanliness": "1", "Check in / front desk": "5", "Overall": "1.0", "Value": "1", "Rooms": "1", "Location": "1"}, "AuthorLocation": "Boston", "Title": "“There are a lot better places to stay in San Juan”", "Author": "LolaGirl", "ReviewID": "UR16409756", "Content": "The rooms smelled awful. The curtains smelled like urine and mold, and the carpets were dirty. Through the windows you could look into the dilapidated building next door. We checked in around 8pm and asked if there was a place we could get a bite to eat, and the desk staff told us there was a Subway up the street a few blocks. We walked up and \"experienced\" the local homeless sleeping in their boxes, and a few shady types lurking in doorways. There is nothing to do at or very near the hotel. For a bite to eat, go the Los Pinos Cafe, about a block from the hotel. It's a local cafe where you can get red beans and rice and authentic Puerto Rican fare, and a local beer. The wait staff there is friendly and speaks multiple languages. You can go up on the roof and look at the neighboring buildings falling down and the endless construction cranes. Don't expect spectacular views of the ocean in its glory, or the mountains, either. The continental breakfast consisted of boxed doughnuts and canned pineapple, which were sitting out way too long. You could get a stale bagel for $2 from an uninterested woman who spent much time talking on her cell phone while purportedly cleaning up the breakfast area and helping the guests. You can walk to the beach, about fifteen minutes away. It is tiny, and across from the police station (that should make you feel safe..). You walk through the park where the homeless live, and it smells of urine and general filth. You can also walk through the tent city, where the protesters are set up to try to stop what they determine to be illegal construction. Seems that most of the beachfront has been bought up by chain hotels, and the buildings go right up to the water, and the tall buildings stop the ocean breezes from coming into the city, so the whole area is hot and stagnant. There must be a lot of places to stay in San Juan that are much more pleasant. The one nice thing was that the hotel desk staff were very nice. They hailed us a cab so we could get back to the airport and it was there is just a few minutes. They speak very good English.", "Date": "May 26, 2008"}, {"Ratings": {"Overall": "1.0"}, "AuthorLocation": "New York", "Title": "“The worse Hotel in earth!!!!!!”", "Author": "Lollypop23", "ReviewID": "UR15315769", "Content": "This was the worse hotel I have stayed in. Starting with bed bugs, old and deteriorated bathrooms, the hallways and room had a weird smell. My friends and I wish we had Lysol. One of my friends even sprayed one of my perfumes. Top of all were the rude staff and manager or owner (Juan). Instead of admitting that his staff made a mistake; he treated all of us like criminals by making threats to call the police. I would not recommend this hotel to anyone. Everyone in Puerto Rico was very friendly except for the people in this horrible hotel.", "Date": "April 24, 2008"}, {"Ratings": {"Service": "4", "Cleanliness": "2", "Check in / front desk": "4", "Overall": "3.0", "Value": "3", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Houston, TX", "Title": "“Hair in the Tub”", "Author": "Travel_Queen12", "ReviewID": "UR14948088", "Content": "We stayed at the Hotel Miramar in March 2008 before we left on a cruise. I viewed some of the Trip Advisor photos and there must be a difference between the \"Hotel Miramar\" and \"The Courtyard Miramar\" because the photos of the Courtyard looked much nicer than where we stayed. Overall, our stay was pleasant. This hotel is in a dangerous part of town so do not venture out alone at night. This is an old hotel, but kept up well. My main and only complaint would be that there was a lot of hair in the shower (and I mean a lot- 10 or more pieces) and there was hair in the bathroom sink. The blanket on the bed was also very old and worn looking-- I would not touch it. This is a 3 star hotel... so once again you get what you pay for.", "Date": "April 10, 2008"}, {"Ratings": {"Overall": "3.0"}, "AuthorLocation": "Minneapolis, Minnesota", "Title": "“Miramar Fine For Short Visit”", "Author": "iam_intrigued", "ReviewID": "UR14722771", "Content": "Considering the prices of five star hotels, we decided to try this hotel for a couple of nights before going to the El San Juan Hotel & Casino. It was clean, the rooms were large, and the staff was helpful. The artwork on the walls in the rooms was actually nice, and the room included a fridge & microwave. Continental breakfast was included which came with fruit, cold cuts, cheese, cereal, coffee, rolls, etc. For two breakfasts, it was nice. They had pretty plants in the tiny lobby and a few birds and a computer in a room behind the lobby. The restaurant next door is where the breakfast was served. We also had dinner there our first night (it included a free drink) - it was pretty good. For a lower-end priced hotel, this one was fine. The only negative was that the area wasn't close to much. We took the bus to Old San Juan, which was good, and we walked down the block through a few souvenir shops. Other than that, you're in the middle of no where. If you need to hang out in your room, it doesn't have the right feel to want to stay and relax. It just didn't feel that safe. (They locked their front door at night and had someone let you in). For a short stay, it's acceptable. The hotel itself had some charm. If you want to be in the heart of everything, though, this location leaves something to be desired.", "Date": "April 1, 2008"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Check in / front desk": "1", "Overall": "2.0", "Value": "1", "Rooms": "2", "Location": "3"}, "AuthorLocation": "Flushing, New York", "Title": "“Beware of hidden fees”", "Author": "gln126", "ReviewID": "UR14590749", "Content": "My husband and I booked for a night after our cruise. We paid $13 from the Pan American Pier to the hotel. We arrived at 10:30 in the morning. They said that the rooms would not be available until 3 p.m. They allowed us to leave our luggages there while we explored old San Juan. There was a local bus stop located across the street on the left of the hotel. All you have to pay was $0.50/person. It took us to the main station in Old San Juan. We came back at 4:15 thinking that the room should be ready. However, they said that it wouldn't be ready in another half hour. There was not much to do around the hotel so we walked to the supermarket on the right of the hotel. We came back at 5 but the room was still not ready. The receptionist said that we have to pay an extra $3 per person and $5 per night stay. I said that I already paid all the taxes and others charges when I booked for ONE night stay. She then pointed to a sign on the top of the counter and said that the travel agency might not know about these additional charges. I looked at it and it said that the charges commenced on October 1, 2006. And now it is 2008!She insisted that we pay before we she gave us the key. I paid and I asked for a receipt and she printed one for me. The room was big but the fridge didn't work, The chair almost fell apart. The lamp was barely attached to the light fixture. There was mildew smell in the room too unless you blast up the A.C.. When we checked out the next morning, an old man asked us to pay AGAIN because he couldn't find it on the computer nor it was checked off that we paid. It was too much of a hassel to stay in this hotel. Anyway, the taxi fee to the airport was $15.", "Date": "March 27, 2008"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Business service (e.g., internet access)": "3", "Check in / front desk": "4", "Overall": "3.0", "Value": "3", "Rooms": "3", "Location": "2"}, "AuthorLocation": "Moss, Norway", "Title": "“Our one night stay.”", "Author": "Bollan", "ReviewID": "UR13834707", "Content": "We arrived the hotel late on january 19th. An elderly man meet us, checked us in, and pointed out the elevator for us. We stayed on the 4.th floor, to the left out of the elevator, and in the last room on the left side of the hallway. A large room with two large beds, a small fridge, tv, a comfortable chair, and a bathroom. We have nothing to complain about regarding the room, and we slept well in the beds. The aircondition were a little bit noisy, but did not ruin our nights sleep. We went down a couple of floors and found the ice machine. I am glad we did not have a room there. It made a lot of noise. Also fount a soda machine there. Did not have breakfast there, but walked to Wahlgreens a couple of blocks away to get some soda and water for our upcomming cruise. Checked out just before 12, and a nice man at the desk rang for a taxi to pick us up. Overall not the best hotel we have stayed on, but most certainly not the worst. We could easily stay here another time, just for one night.", "Date": "February 25, 2008"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Business service (e.g., internet access)": "4", "Check in / front desk": "4", "Overall": "3.0", "Value": "3", "Rooms": "3", "Location": "2"}, "AuthorLocation": "Oslo", "Title": "“Not a hotel for long vacations”", "Author": "Oslo81", "ReviewID": "UR12430218", "Content": "We stayed at Hotel Miramar for just one night. It is not a hotel where I would stay longer. The location is not great. It is not close to any of the sights. You have to take a taxi to the old city and the best beaches. The room was ok. It was big and very peaceful. But the breakfast was awful. We got to the restaurant half an hour before the breakfast ended and it was no food left and the woman working there would not bring out more food.", "Date": "January 8, 2008"}, {"Ratings": {"Overall": "2.0"}, "AuthorLocation": "Alexandria Virginia", "Title": "“Concrete Block”", "Author": "hysterian", "ReviewID": "UR12202834", "Content": "I was very disappointed in this hotel because it was concrete inside and out. I have never stayed in a room with concrete walls, and hope never to again! The staff was nice, but the hotel is on the fringe of a very bad neighborhood and we would not have felt comfortable walking. I had thought the hotel was very close to Old San Juan from their website, but it is about a $12 cab ride away.", "Date": "January 1, 2008"}, {"Ratings": {"Service": "1", "Cleanliness": "2", "Business service (e.g., internet access)": "1", "Check in / front desk": "2", "Overall": "1.0", "Value": "1", "Rooms": "1", "Location": "1"}, "AuthorLocation": "Washington DC, District of Columbia", "Title": "“Run now while you can”", "Author": "ebbtide123", "ReviewID": "UR11056438", "Content": "Thought that by picking a cheap hotel I could save a lot. Not this one. Except for a couple of staff, I've never seen rudeness so institutionalized in one place from the owner down to the support staff. The rooms are old and worn. Bathrooms are scarily decrepit with tiles chipped off. Thanks god, there is the outside and that's what I did when I was booked in this rodent's nest- stayed outside most of the time expect when it's time to sleep......and you better be really exhausted...", "Date": "November 25, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "5", "Check in / front desk": "5", "Overall": "5.0", "Value": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Illinois", "Title": "“A Great Place to Stay!!!!!”", "Author": "imagineone", "ReviewID": "UR10048973", "Content": "My mother and I took a mother-daughter vacation and stayed at the Miramar for a week. It was a wonderful place to stay! The hotel was beautiful and the staff, especially Ramon, Sylvia, and Jorge (and others that I can't remember their names) were very accommodating and helpful! They gave us directions, recommendations on places to eat, and wanted to hear of our adventures daily! I loved the area that it was in as I wanted to see more of authentic Puerto Rico than the Americanized version that I felt I would've gotten at the Hilton, etc. There's a pharmacy across the street with some very reasonable souvenirs. Los Pinos Cafe, also across the street, had some wonderful Mofongo. The hotel had a very nice continental breakfast and since parking is so hard to find in San Juan the private parking was a lifesaver! The sundeck has a beautiful view! Overall, I wouldn't have wanted to stay anywhere else!", "Date": "October 7, 2007"}, {"Ratings": {"Service": "1", "Business service (e.g., internet access)": "2", "Check in / front desk": "2", "Overall": "1.0", "Value": "1", "Rooms": "1", "Location": "2"}, "AuthorLocation": "diver4life", "Title": "“You could not pay me to stay here.”", "Author": "diver4life", "ReviewID": "UR8272843", "Content": "Paid a very low rate, as they say you get what you pay for. The hotel manager, very rude and full of himself. We arrived at 4:00pm was given the room, took the luggage to the room, opened the door, the room was not cleaned from the prior guest, I did state we arrived at 4:00pm!!!! I returned to the front desk, the young lady was apologetic and gave us a new room, she even went up and checked the room before we lugged or luggage back up to the quest rooms. The room was ok, but the ice machine is not inside a stair well or a room on its own, it is in the hallway of the quest floor, all night you can here the ice machine dropping ice into the bottom of the machines' holding area. The first shower I took, I tried to adjust the shower head and it came off in my hand, the next morning I gave the shower head to the manager, as he gave it to his maintenance person the manager rolled his eyes and asked me was their anything else broken in the room . I replied not at this time. Later that day when we return from the beach, I tried to adjust the air conditioners fan speed, but could not because that was broken. The maid service starts at 7:00am sharp, we know because the wheels on the maid service cart squeal load enough to wake you up, if that doesn't wake you the maids talking loudly, and their buckets hitting the wall, cart, ice machine, doors, will. I could continue but you get the point. I haven't had the opportunity to go to Europe yet, but if this is a European style hotel, no thanks, I'll pass.", "Date": "August 1, 2007"}, {"Ratings": {"Overall": "1.0"}, "AuthorLocation": "colorado", "Title": "“Horrible experience Do Not Go, Find another hotel”", "Author": "westerngypsy", "ReviewID": "UR7588189", "Content": "I am writing this review about the Hotel Miramar, 606 Ponce de Leon Avenue, San Juan. Please DO NOT confuse this with the Marriot Miramar. I made a reservation through Priceline and received confirmation for the Hotel Miramar for one night prior to our cruise leaving. We arrived at the hotel at 1:30 am. Upon arrival a woman comes out to the street (this hotel is located on a dark side street in San Juan) and asks us if we have reservations. I thought it most peculiar, but said yes, we have reservations and confirmation (room already paid for) through Priceline. I then give her the paper with confirmation # and payment record, and she says, \"We don't have a reservation for you\" I said, \" Here it is, it's already paid for\". She says \"no, I have no room for you.\" I said, \"OK, just give us a room and we will pay for it.\" (thinking that I will sort all this out when we get home) She then says, \"there are no rooms available here, they are all taken.\" So we get back into the taxi, and our driver feels so sorry for us that he starts to call other hotels to see if he can get us a room. Meantime, we are sitting in front of the Miramar when another taxi pulls up. Two people get out and go in with their travel packet and yep.....sure enough they get a room! Meantime the taxi driver is having a difficult time since all hotel rooms are booked up in San Juan. Finally he calls the Best Western who just had an airline crew cancellation! We go there and I am telling the from desk clerk about our experirence with the Miramar Hotel and he said there were two other people who checked in earlier that the same thing had happened to. The Hotel Miramar was unsympathetic, and totally unresponsive. I would tell everyone out there, don't go.....it was an awful experience for 2 very experienced travelers. I have contacted Priceline for them to resolve this... Stay clear of this place, you don't want to end up like we did.", "Date": "May 11, 2007"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Business service (e.g., internet access)": "4", "Check in / front desk": "5", "Overall": "5.0", "Value": "4", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Aruba", "Title": "“WE LOVED IT!!!”", "Author": "Dario_Rossy", "ReviewID": "UR7542650", "Content": "This hotel is very good we stayed there from 26 April till 01 May 2007. We had a blast the hotel staff is excellent, clean room and towels everyday. The hotel is near a supermarket on the right and right on the corner you can find taxi, and if you want to go by bus it's only 0,75$. Naxt to Pueblo Supermarket you can find, subway, a chinese restaurant, a restaurant about taco's and there's a pharmacy across the street and a beauty saloon. So we found the hotel very good. In the lobby there's free internet for 30 minutes. And a cute yellow bird. And I forgot to take a picture of the bathroom next time :-)", "Date": "May 3, 2007"}, {"Ratings": {"Overall": "1.0"}, "AuthorLocation": "Fremont, CA", "Title": "“Horrible Experience at the Hotel Miramar”", "Author": "MissKareBear", "ReviewID": "UR7420063", "Content": "I stayed at the Hotel Miramar with my family prior to our Caribbean cruise. Thankfully, we were there for only 1 night. It is by far the worst experience at a hotel that I have ever encountered. We requested one room for a family of 4 and were given “the biggest room”. Granted, the room is relatively spacious, but none of us felt comfortable at all to really get good sleep. For starters, we found hairs on the bed sheets, as well as stains on the bed covers. Because I tend to get cold at night, I reluctantly still pulled the covers over me. As I started to fluff the comforter I started to smell this…odor. When I took a sniff I realize the odor came from the stained, dirty, and now stinky comforter. Needless to say, I just opened my suitcase and grabbed a sweater and slept in it instead to keep warm. The toilet itself is so dirty and filled with grim that I wish there were toilet seat covers provided. The bathroom itself just gave us a really unclean sense of feeling and I felt showering in it might get me dirtier. In fact, all of us opt to forgo the shower, so we can leave this “hotel” as soon as possible and get on our cruise ship! Despite paying extra for the 2 additional people, breakfast was only provided for 2. I did not go for breakfast, but those that did, said it was mediocre at best and we all still went out somewhere else to grab a bit. The area around the hotel doesn’t necessary feel unsafe, but I surely will not stroll around there at night with my family. Over, this was a HUGE disappointment of a hotel. I would never ever stay at this hotel again, and will not recommend this hotel to anyone.", "Date": "April 23, 2007"}, {"Ratings": {"Cleanliness": "1", "Overall": "2.0", "Value": "2", "Service": "2", "Rooms": "1"}, "AuthorLocation": "", "Title": "“Mixed feelings”", "Author": "A TripAdvisor Member", "ReviewID": "UR5292122", "Content": "My family of four, one 16 year old, 12 year old and husband and I stayed at the Miriamar from May 8 through the 12. When we arrived we were tired and hot from the trip. We registered in and were told we had a room on the third floor. But guess what we had to walk up to our room and carry our luggage. Now if any one knows a women and a pre teen girl can bring a lot of luggage. So up we all went with all this stuff. Went into our room and to our supprise it was a room with a king. I did tell them we needed a room with double beds. Found the maid in the hall way and tried to explain to her we needed a bigger room, she spoke no english and my spanish is not the best. make a long story short we did get a room with two beds. We did notice the room did have a musty smell and the AC did not work well. The house cleaning was not at all good. The tub backed up and the maid never cleaned the bath room good. The tub had a ring around it and the beds were not made. The view from the top floor was great, you saw the water and the kids loved it. The breakfast was ok. The front desk staff were helpful and nice. Would we stay again, no. I would go somewere else.", "Date": "June 2, 2006"}, {"Ratings": {"Cleanliness": "4", "Overall": "3.0", "Value": "3", "Service": "5", "Rooms": "3"}, "AuthorLocation": "Chicago", "Title": "“Budget hotel, clean, friendly and free continental breakfast”", "Author": "mrchicago", "ReviewID": "UR5180253", "Content": "Knew the hotel was old so there was no surprise. However, when we arrived the elevator was being renovated, which meant a walk up to our room on third floor, sun deck and gym on 7. Rooms are large and clean with small fridge and micro. The staff was extremely helpful with directions and restaurant recommendations. A free continental breakfast buffet was served every morning in the restaurant (currently only open for breakfast). Hilton hotel is a 10 minute walk, casino 15 minutes, 45 minute walk to Old San Juan. You can catch a bus in either direction in front of hotel for 75 cents. This is not a luxury hotel, no room service, pool or beach. However, if looking to save some money it's the place to stay. Keep in mind, your view could be a vacant building or car lot. We had a good time. Take a bus to Marriott if you want to sit by the pool. P.S. We got an extreme bargain on this hotel. If we had paid full price we may have been more critical.", "Date": "May 18, 2006"}], "HotelInfo": {"Name": "Hotel Miramar", "HotelURL": "/ShowUserReviews-g147320-d253693-Reviews-Hotel_Miramar-San_Juan_Puerto_Rico.html", "Price": "$94 - $159*", "Address": "<address> <span rel=\"v:address\"> <span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">606 Ponce de Leon Avenue</span> | <span class=\"extended-address\">Miramar</span>, <span class=\"locality\"><span property=\"v:locality\">San Juan</span> <span property=\"v:postal-code\">00907</span></span>, <span class=\"country-name\" property=\"v:country-name\">Puerto Rico</span> </span> </span> </address>", "HotelID": "253693", "ImgURL": "http://media-cdn.tripadvisor.com/media/ProviderThumbnails/dirs/8b/d6/8bd6e379e97bca1e47d9a82a19457ac010large.jpg"}}