{"Reviews": [{"Ratings": {"Service": "1", "Cleanliness": "1", "Overall": "1.0", "Value": "1", "Sleep Quality": "1", "Rooms": "1", "Location": "3"}, "AuthorLocation": "manasquan", "Title": "“Never again!”", "Author": "ginny110411", "ReviewID": "UR139206799", "Content": "We had stayed at this hotel several times before and just recently attempting to try it again has soured us immensly! While the hotel had problems with its previous owners., the new management seems to have done nothing to correct any problems. One big issue was getting internet in the rooms. Told we could \"probably\" get it, when we didn't, the desk clerk offered another room saying we \"probably could get it there.\" I'm not wasting my time checking room after room to get internet. This had been an on-going problem for a long time anyhow. Next, the condition of the rooms is definitly deteriorating quickly. Very heavy smell of bleach in the rooms, rugs were dirty and patched, furniture in sad condition and bed linens less than desirable with just a quick look. The topper is the clientele is extremely questionable - this place is giving all the vibrations of being a crack hotel. There used to be a small convenience store in front but it is out of business as well at the Ihop restaurant is gone now. Not worth stopping at this one!", "Date": "September 2, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "3", "Overall": "3.0", "Value": "4", "Sleep Quality": "3", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Trinity, North Carolina", "Title": "“Great for Overnight Stay”", "Author": "KeriO351", "ReviewID": "UR136805910", "Content": "Our family of 5 spent the night in this hotel the night before going to Disney World. The room was decent and they had cereal for the kids the next morning so that we didn't have to make a breakfast run. For the price & location, it's great for a one night quick stay.", "Date": "August 10, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "2", "Overall": "3.0", "Value": "4", "Sleep Quality": "3", "Rooms": "2", "Location": "5"}, "AuthorLocation": "Douglasville, Georgia", "Title": "“You Get What You Pay For”", "Author": "TeamBolden", "ReviewID": "UR135782604", "Content": "The rooms were old and dank smelling. There were no room amenities, just basic sleeping accommodations. There is a huge walk-in closet, but it smelled horrible and had several HUGE spiders in the corners. The key card system was down my entire stay so it was inconvenient getting in and out of room. The pluses: pool was great, breakfast awesome and the staff really friendly and helpful.", "Date": "July 30, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Overall": "4.0", "Value": "5", "Sleep Quality": "4", "Rooms": "3", "Location": "4"}, "AuthorLocation": "Winter Springs, Florida", "Title": "“Very clean & friendly place!”", "Author": "LeeAnne67", "ReviewID": "UR130941731", "Content": "We stayed here for three days over the Memorial Day weekend, to attend my grandson's all-star football tournaments - 3 rooms total. The owners and staff were very polite and accomodating. It is a smaller hotel, but, the pool area and all 3 rooms were very clean. You will definitely get your money's worth here. We would stay again!", "Date": "May 30, 2012"}, {"Ratings": {"Service": "3", "Cleanliness": "2", "Overall": "2.0", "Value": "2", "Sleep Quality": "2", "Rooms": "2", "Location": "2"}, "AuthorLocation": "Jonesboro, Georgia, United States", "Title": "“It wasn't horrible”", "Author": "Mai S", "ReviewID": "UR127570991", "Content": "I has a smoking room and it was evident. I'm not sure what one would expect for the price. I was traveling and was only going to need to stay there for a few hours. So it served its purpose. It looked like some peeple partied really hard in the room I was in. Burn everywhere and a patched hole in the wall.", "Date": "April 10, 2012"}, {"Ratings": {"Service": "4", "Cleanliness": "4", "Overall": "4.0", "Value": "4", "Location": "3", "Rooms": "4"}, "AuthorLocation": "", "Title": "“Great no frills hotel”", "Author": "Kieran1987", "ReviewID": "UR127267683", "Content": "We stayed here for one night and were pleasantly surprised with our stay. Good points - the room was spacious and comfy - free wifi - a pool - friendly owner who chatted to me about England and was genuinely a nice guy. The only bad point is that the hotel is a fair way from the beach, if you don't have a car I doubt you would want to walk to the beach as it's well over a mile over a bridge", "Date": "April 4, 2012"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "4", "Sleep Quality": "5", "Rooms": "5", "Location": "5"}, "AuthorLocation": "Saraland, Alabama", "Title": "“Stayed for Daytona 500”", "Author": "Terry S", "ReviewID": "UR125554503", "Content": "Everything was great. Clean rooms, comfortable beds. Owners very nice and accomodating. Staff was very nice too. We will stay again when in Daytona!", "Date": "March 3, 2012"}, {"Ratings": {"Service": "2", "Cleanliness": "3", "Overall": "2.0", "Value": "2", "Sleep Quality": "2", "Rooms": "3", "Location": "3"}, "AuthorLocation": "Jensen Beach, Florida", "Title": "“BEWARE, bait and switch, do not honor their word”", "Author": "gary p", "ReviewID": "UR121163971", "Content": "Visited during the Turkey Rod Run November 25th. I had originally booked 2 nights through expedia. Learned I was unable to stay the second night, called expedia who called the hotel and changed the reservation for the one night only. All was good, Manager Nina Patel said I would have to pay a $25 change fee, I was ok with that. Expedia informed me to call them after the saty and they would refund the second night. I cecked in Friday evening giving the manager my expedia paperwork. Saturday morning I was the only person in the lobby, The same lady that checked me in, (I am presuming to be the manager), is there, I ask her if there is anything I need to do to check out, she replied, \"no, nothing further.\" I said great and left the hotel, not returning for the second night as planned. The hotel manager refuses to refund my second night saying I did not check out correctly. After calleing her directly she says it iall my fault and they have no record of the reservation change that expedia made while i was on the phone with them, effectively calling me a liar. I cannot recommend this place at all. On a second note, had friends use the same hotel and were charged $30 above what they were quoted on the phone when they booked.", "Date": "November 28, 2011"}, {"Ratings": {"Service": "1", "Cleanliness": "2", "Overall": "1.0", "Value": "2", "Sleep Quality": "3", "Rooms": "1", "Location": "5"}, "AuthorLocation": "Ocala, Florida", "Title": "“Never again!”", "Author": "ecallwood", "ReviewID": "UR71954557", "Content": "I reserved my room for this stay on the Days Inn website to include an additional person in the room. The website asked me to enter my credit card information in order to receive the discount for online payment, so I did. When I arrived, the attendant, who I apparently woke from her nap in the back room, said that I did not pay on-line even though she had a print out of the reservation. With protest, I allowed her to re-swipe my credit card, only to find that they charged me 50 cents more per person than the price quoted online. When I brought it up, the attendant called the manager (i guess) from the back room. They began talking to each other in another language and when finished, the manager said, \"what is it? 50 cents? Jesus Christ!!! just give it to her! He then slammed open the cash drawer and has me sign for 50 cents. When all of that is settled, I'm told that my room won't be ready for another 20 minutes, even though I arrived shortly after 3 pm. Once in the room, later on that night there were bugs. Many, many bugs that could fly. My husband ended up killing the things because I didn't want to call the manager to have him swear at me again. The shower head was broken and the next day, even though i asked to have the sheets changed, they only made up the bed. The breakfast was lousy. There's a train that runs by at 3 am and blows it's horn. (seriously!) When i complained to the main Days Inn Customer Care line, they apologized profusely and said that they would issue me a $25 gift certificate. A gift certificate that does not cover the cost of one night stay, which means I'll have to spend money to make use of their apology. I WILL NEVER STAY AT ANOTHER DAYS INN AGAIN!", "Date": "July 22, 2010"}, {"Ratings": {"Service": "4", "Cleanliness": "5", "Overall": "4.0", "Value": "4", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Shropshire", "Title": "“Superb location at a sensible price”", "Author": "munchie11", "ReviewID": "UR49002281", "Content": "This hotel has direct access to Daytona Beach. The rooms were large, bright and well furnished and all have sea views and a balcony. The staff were very helpful and friendly. Great heated pool (a must for us wimps!), free coffee, internet and parking. Within 15 minute drive of Racetrack, Flea Markets, shopping, fishing charters and entertainment.", "Date": "November 11, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "5", "Overall": "5.0", "Value": "3", "Location": "5", "Rooms": "5"}, "AuthorLocation": "Atlanta Ga.", "Title": "“Everything I expected and more.”", "Author": "Bill_Volmary_2004", "ReviewID": "UR48064852", "Content": "I stayed at this hotel primarily because of its location to Biketoberfest activities. Central to everything. Easy access to roadways even in heavy traffic. Small but effeciently run. Very knowlegeable & attentive staff ( appears to be family run). Surrounding area appears to be a little seedy so security was a concern but not an issue as the manager BP was on constant patrol always attending to the needs and concerns of the guests. He is one of the most accomidating managers I have ever met. During Biketoberfest I had a trouble free experience at this hotel and met many new friends at the nightly get togethers & cookouts in the parking lot. Bed was one of the most comfortable I have ever had on the road. Breakfast was kind of skimpy but with all the good resturants close by not an issue, as you don't attend Bike Week on the cheap. Will be returning in the spring with friends.", "Date": "October 29, 2009"}, {"Ratings": {"Service": "5", "Cleanliness": "4", "Business service (e.g., internet access)": "4", "Check in / front desk": "5", "Overall": "4.0", "Value": "4", "Rooms": "3", "Location": "4"}, "AuthorLocation": "kentucky", "Title": "“great front desk staff”", "Author": "delldoll", "ReviewID": "UR18074879", "Content": "I needed a hotel quick for my son on a last minute deal. I made the arrangements from Texas over the phone. The staff was very help. My son said the room was nice and enjoyed the stay.", "Date": "July 20, 2008"}, {"Ratings": {"Overall": "1.0"}, "AuthorLocation": "Orlando, FL", "Title": "“AVOID AT ALL COSTS”", "Author": "DonnaL.", "ReviewID": "UR6473596", "Content": "This was worst Days Inn we have ever stayed at....we booked thru their website, maybe that is why they had a rating of 5 Sunbursts!! We did not get the room we reserved and had to take a smoking room and it smelled horribly!!!!!!!! The fridge was barely cool. The advertised complimentary breakfast was nonexistant...we were told they had run out of coffee...and they had nothing else at 9AM!!!!!! The bed was hard as a rock but the bathroom was spotless, the only good thing there. I would never stay there again, tho, and it wasnt like it was cheap at $70 a night!!!", "Date": "December 19, 2006"}, {"Ratings": {"Overall": "3.0"}, "AuthorLocation": "Ljubljana, Slovenia", "Title": "“Nice facility, but outlook grim”", "Author": "Slo-Lju", "ReviewID": "UR3229816", "Content": "This is a very new facility, so it is nice and rooms are spaciuos. I don't understand why the pool was built so tiny? I agree that hotel was built quickly and cheaply and it now caters to spring breakers, backpackers and other budget guests. This also means you can hear all of the activities associated with spring break through paper-thin walls. I doubt this property will be able to hold the standard set at the begining.", "Date": "February 25, 2005"}, {"Ratings": {"Overall": "2.0"}, "AuthorLocation": "Unknown", "Title": "“Not impressed”", "Author": "A TripAdvisor Member", "ReviewID": "UR1714282", "Content": "This hotel had filthy sheets upon check-in (make-up on pillowcase, etc.); manager/owner would not allow us to change credit cards upon check-out for one of the nights so that we could split the cost of the room with friends.", "Date": "March 9, 2004"}, {"Ratings": {"Overall": "4.0"}, "AuthorLocation": "Unknown", "Title": "“New hotel with easy access to Daytona Speedway”", "Author": "A TripAdvisor Member", "ReviewID": "UR981936", "Content": "Hotel was recently built so the new facility was nice. The facility was very clean and the staff helpful. Sufficent parking and lots of channel service on the TV. However, the hotel was cheaply made and in time they will have problems with the facility. The walls are thin and you can hear your neighbors on ocassion. Close to Daytona Speedway....but not a hotel if you want to stay on the beach!! They even plan to drop prices (which they have this year.)", "Date": "April 23, 2003"}], "HotelInfo": {"Name": "Days Inn Daytona Beach", "HotelURL": "/ShowUserReviews-g34172-d253945-Reviews-Days_Inn_Daytona_Beach-Daytona_Beach_Florida.html", "Price": "$52 and up*", "Address": "<address><span rel=\"v:address\"><span dir=\"ltr\"><span class=\"street-address\" property=\"v:street-address\">544 South Ridgewood Avenue</span>, <span class=\"locality\"><span property=\"v:locality\">Daytona Beach</span>, <span property=\"v:region\">FL</span> <span property=\"v:postal-code\">32114</span></span> </span></span></address>", "HotelID": "253945", "ImgURL": "http://media-cdn.tripadvisor.com/media/ProviderThumbnails/dirs/f8/19/f819ee278f90a74a7b5a0ed0c11e8a4c4large.jpg"}}